{"uri": "http://fox59.com/2017/01/18/mother-of-5-year-old-girl-killed-in-accidental-shooting-on-new-years-eve-charged-with-neglect/", "title": "Mother of 5-year-old girl killed in accidental shooting on New Year’s Eve charged with neglect", "dct": "Wed, 18 Jan 2017 13:39:00 GMT", "id": "2bf3237fc6dc71dc6089c36106540e4d", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nINDIANAPOLIS, Ind. – The Marion County Prosecutor’s Office has filed charges against the mother of a 5-year-old girl who was killed in an accidental shooting.\nAsia Turentine is charged with neglect of a dependent resulting in death, a level 1 felony, and neglect of a dependent in a situation that endangers the dependent, a level 6 felony.\nD’asia Turentine was shot in the head inside her family’s northeast side apartment in the 4000 block of Newburgh Drive on New Year’s Eve. She passed away on January 3.\nAccording to court documents, Asia was in the apartment with her son and D’asia when the shooting occurred. She had a handgun in her purse which she laid on her bed in the master bedroom. She told detectives that she bought the gun for self-defense.\nAround noon, she put her children in their bedroom for a nap, and she went to sleep on the couch.\nWhile she was asleep she heard a gunshot, and she heard her daughter scream. She awoke to find her son running out of her master bedroom into his bedroom.\nGun experts say this is a situation that was likely entirely avoidable.\n“A lot of people will think 'Oh, I'm in my home so I'm safe inside my home',\" said NRA-certified fireamrs instructor Zachary Rogers, \"when that’s where they become the most complacent and most at risk, because they leave it out, in their purse, or wherever, and they don’t pay attention to it.\"\nAfter hearing the shot, according to court documents, Asia found her daughter in the master bedroom with her eyes closed, and she called 911.\nDetectives asked Asia if her children had ever seen her gun before the shooting, and she said, \"Yes, but they know not, I tell them all the time, even if they, if it‘s around and they see it, I say, ‘N0! N0! No!’ I always make that very clear so they know, and I say it a lot to let them know. They know not to go near it.\"\nAsia told detectives that she usually puts the gun on her closet shelf, and she did not know there was a bullet in the chamber of the gun. She said that she thought the safety on the gun was always on.\nShe also told detectives that she has no experience with guns, according to court documents.\nRogers says most people who buy a gun are not familiar with firearms, and therefore should make sure to get some kind of basic training and familiarity with the weapon.\nDetectives interviewed Asia’s son. They asked him if anyone was hurt today, and he told them, “Yeah. . .her at home. . .I shoot her . . .In her face. . .In her face.” He told detectives he had never touched the gun before that day.\nAsia was arrested Wednesday afternoon, and she is currently being processed in the Marion County Jail. She is expected to appear before a judge on Thursday."}