{"uri": "http://cbs6albany.com/news/local/17-year-old-shot-and-killed-in-schenectady", "title": "Thursday night shooting victim was Schenectady High School Student", "dct": "Fri, 16 Sep 2016 00:00:00 GMT", "id": "c1877e84127a828d975c6397748b72e8", "content": "UPDATE: Schenectady Police have identified the victim in the fatal shooting at 524 Schenectady Street as 17-year-old Medina Knowles.\nAccording to police Knowles was shot once in the head in the second floor apartment at 524 Schenectady Street around 11:30 p.m. Thursday. Lt. Mark McCracken says Knowles was pronounced dead at the scene.\n“There were several people inside the residence but I am not going to identify who they are and what their relationship to the victim was,” Lt. McCracken said. Fatima Reid, a friend of the victim, tells CBS 6 that Knowles had a 2-year-old son. “I just saw her two days ago and we were walking with our kids through the block and she said she was going to hit me up on Facebook but she never did,” Ms. Reid.\nLate Friday afternoon a spokesperson for the Schenectady City School District sent this statement to CBS 6: “We are sad to learn about the untimely and tragic passing of Schenectady High School student Medina Knowles. We have mobilized our crisis team, including counselors and social workers, who are immediately available to provide counseling and support service to our students. Our team will continue to be available and provide ongoing support for our students and staff members during this difficult time. “\nAs of early Friday evening police had made no arrests or identified any suspects.\n------\nSchenectady Police say they are investigating the deadly shooting of a 17-year-old girl at 524 Schenectady Street late Thursday night.\nLt. Mark McCracken says officers found the victim dead with an apparent gunshot wound to the head.\nMcCracken says the shooting happened in the second floor apartment at about 11:30 Thursday night.\nNo suspects have been identified and no arrests have been made.\nThe Crime Scene Collection Unit is working to process the scene.\nAnyone with information on the shooting can call the T.I.P.S. line at (518) 788-6566.\nStay with CBS6 both on air and online as we work to bring you the latest details."}