{"uri": "http://www.roanoke.com/news/crime/roanoke/year-old-boy-shot-dead-by--year-old-in/article_457966ba-5b5d-5596-82b6-018b3935dcb1.html", "title": "11-year-old boy shot dead by 10-year-old in Roanoke 'was normal happy kid'", "dct": "Thu, 26 May 2016 12:49:00 GMT", "id": "e795bac81474c22589e55311d31224ee", "content": "“Where he at?” a woman implored, clutching her chest as she talked with a police officer. “Where’s my son?”\nA half-dozen police cars and emergency vehicles lined the 2000 block of Carroll Avenue. About 45 minutes earlier, a 10-year-old boy shot an 11-year-old boy, the woman’s son, with a handgun they found inside the house, police spokesman Scott Leamon said.\nThe two boys had been playing with the gun. The 10-year-old called 911 at 12:18 p.m. to report the shooting, Leamon said.\nThe boy died at the scene. Police would not release his name, citing his age.\nBut Janice Welch, the 11-year-old’s grandmother, identified him as Khalil Burt. The boy had graduated Thursday from Westside Elementary School, she said.\nCrime tape couldn’t contain the emotions. Two men, who told officers they were the mother’s sons, circled her, demanding answers.\nThe people gathered in front of the house began to wail louder at the officer’s response, which was inaudible. One man collapsed to the ground.\nAs police tried to calm them, the three rushed toward the house, breaking the crime scene tape. One officer restrained the woman, pulling her into an embrace. Bystanders lined nearby front yards, drawn by the sobbing, which echoed down the street.\nLeamon said officers kept them from going into the house not only for their own safety, but to protect the officers and the integrity of the crime scene.\n“They did put two of them in handcuffs,” Leamon said, referring to the two men at the scene. “Once they calmed down, they were released. They weren’t charged.”\nIt does not appear that anyone else was inside the house at the time of the shooting, Leamon said. He said the boys were “kin to each other.”\nWelch said her grandson loved music. He had a drum set he liked banging on and a guitar he liked to strum. He even learned how to play the violin.\nHe was artistically inclined, family said. He drew pictures of anything that popped into the mind of a creative young boy, Welch said.\n“He was a normal happy kid, and he loved life,” Welch said.\nOn Sundays and Wednesdays, Khalil sat on the steps of the church cater-cornered from his house, said the Rev. David Jones. He couldn’t wait for the doors to open for church service or Bible study.\nJones still remembers the day he baptized Khalil at Williams Memorial Baptist Church. Khalil was only 8 or 9 years old, and he wanted to be baptized.\nJones said Khalil had an infectious smile and was very affectionate, frequently running at people and hugging them.\n“He was a special child, and he had a remarkable faith that he wanted to learn so much more about,” Jones said.\nLeamon said detectives have been talking to the Roanoke Commonwealth’s Attorney’s Office. No charges have been filed; the possibility of charges will be discussed after all interviews have been conducted and evidence analyzed, he said.\nTwenty-seven states, including Virginia, have laws that hold adults responsible for letting children have unsupervised access to guns, according to the Law Center to Prevent Gun Violence. Virginia’s law makes its unlawful for a person to recklessly have a loaded, unsecured firearm accessible in a way that a child under the age of 14 could kill or become injured. A violation of the law is a misdemeanor.\nThis year, 96 people have been killed in accidental shootings, according to Everytown for Gun Safety, a gun control advocacy group that compiles these shootings, mostly through news reports. Of those, including Thursday’s in Roanoke, 20 were 11 or younger.\nSeveral hours after the shooting, police still walked in and out of the house. The mother, still sobbing, and her family sat on a small hill across the street and watched. An officer prepared them for what they would see inside the house, and they inquired about how they should clean it."}