{"uri": "http://www.post-gazette.com/local/south/2014/01/03/Pennsylvania-State-Police-charge-17-year-old-as-an-adult-in-fatal-shooting/st", "title": "Fayette County 17-year-old charged as an adult in fatal shooting", "dct": "Fri, 03 Jan 2014 22:39:00 GMT", "id": "392aec742470515752530836ec31b9ce", "content": "A Fayette County 17-year-old was charged as an adult in the death Thursday of a Connellsville man.\nAndrew Thomas Hustosky, of Dunbar, fatally shot William Oburn Little IV, 22, at the Hustosky home in the 200 block of Hustosky Road about 6 p.m. Thursday, Pennsylvania State Police in the Uniontown barracks said in a news release.\nAn autopsy was scheduled for Thursday.\nAndrew, Mr. Little, and two other people were sitting in the living room when Andrew picked up a .22-caliber Ruger pistol off of a coffee table, pointed it at Mr. Little and fired one round, hitting Mr. Little in the head, state police wrote in the news release.\nLater at the state police barracks, Andrew told troopers during an interview that his fiancee was \"jokingly flirting\" with Mr. Little and that Mr. Little said he was going to sit on her lap, police wrote.\nAndrew said \"no, you're not,\" picked up the gun and announced that it was loaded, state police wrote in the complaint.\nThe complaint continued: \"He said he manipulated the gun to attempt to unload the pistol. He said he then pointed the gun at Little wanting to scare him by making the gun go click. He said he pulled the trigger and heard a bang. He said it shocked him because he thought the gun was empty.\"\nIn her interview with police, the fiancee said she saw Andrew aim the pistol at Mr. Little's head then heard one shot. She also said she told him not to point the gun at someone's head.\nThe other person in the room, a male, told police he saw Andrew grab the pistol and place it on his leg. He then, police wrote, saw him raise it, rack the slide and say \"I have something.\"\nThe man said he didn't witness the shooting, but heard one shot and \"felt the wind blow by him.\"\nCharged with criminal homicide and two counts of reckless endangerment, Andrew was taken to the Fayette County Booking Center for arraignment.\nMolly Born: mborn@post-gazette.com, 412-263-1944 or on Twitter @borntolede. First Published January 3, 2014 8:35 AM"}