{"uri": "http://homicide.latimes.com/post/richard-che-risher/", "title": "Richard Che Risher, 18", "dct": "Mon, 29 Aug 2016 00:00:00 GMT", "id": "b8e1306c424473f5ec84bbab6caf0fca", "content": "Richard Che Risher, an 18-year-old black man, was fatally shot by Los Angeles police officers Monday, July 25, at 11124 Antwerp Avenue in Watts, according to Los Angeles County coroner’s records.\nAbout 11 p.m., officers patrolling the Nickerson Gardens housing development saw a group of people near East 111th and Antwerp streets, the LAPD said.\nOfficers had been paying particular attention to the area because of a deadly dispute between a gang affiliated with Nickerson Gardens and a rival group associated with the nearby Jordan Downs housing project, LAPD Chief Charlie Beck said.\nThe feud, which police believe began with a July 15 shooting in Hawthorne, led to a series of back-and-forth shootings that have left three people dead and eight wounded, Beck said.\nThe officers on patrol saw what they believed to be a group of gang members and stopped to investigate, Beck said, citing a preliminary investigation.\nOne man, later identified as Risher, began to run, then turned and started shooting at the officers, who fired back, killing him, Beck said.\nRisher was pronounced dead at 11:26 p.m. at the scene, according to coroner’s records.\nOne officer was hit in the arm and taken to a hospital for treatment.\nBeck said a gun was found in “close proximity” to Risher’s body. The officers were not wearing body cameras, he said, but investigators are looking at footage from their patrol car and cameras belonging to the housing authority.\nBased on the initial investigation, Beck said, it “appears that the officers responded to a deadly threat appropriately.”\nRisher’s mother, Lisa Simpson, learned about her son’s death when her daughter called her with the news later that night.\nSimpson, 47, was stunned. She called Risher’s father, who shares the same name as his eldest child.\nRichard Risher, 39, didn’t believe her at first and hung up the phone.\nWhen she called back, he said, he got into his car and sped to the housing project. The parents didn’t leave the area until mid-morning the next day.\nEach questioned the police account, saying they didn’t believe their son had a weapon.\nThe 18-year-old was with a group of people, his father said, and could have been running away from the gunfire when he was shot by police.\nRisher said that his son had been spending time in Nickerson Gardens but that he was encouraging the teen to move to his San Fernando Valley home to finish his high school diploma.\nThe younger Risher liked basketball and music, his parents said, and making people laugh.\n“I always thought that my kids were going to outlive me,” said Simpson, a paralegal who lives in Apple Valley. “If God let me trade places, I’d trade places with my son right now.”"}