{"uri": "http://pittsburgh.cbslocal.com/2014/03/01/1-killed-in-homewood-shooting/", "title": "Man Killed, 4 Others Injured In Homewood Shooting", "dct": "Sat, 01 Mar 2014 17:40:00 GMT", "id": "3483a870cfbf99cf13e010430d9acd34", "content": "PITTSBURGH (KDKA) – Investigators continue to look for suspects after one person was killed and four others were injured when gunfire erupted overnight at a bar in Homewood.\nPolice were on the scene for hours Saturday morning. They say around 1:25 a.m., a man came inside the Rendezvous Phase III bar on Hamilton Avenue and started shooting.\n“This is another sad day in the community,” said City Councilman Ricky Burgess. “We pray for the victim, and the other people who were shot and their families, and we actually pray for the person who did the shooting.”\nVincent Edward Holt, Jr., 27, of Homewood, died from multiple gunshots in the chest.\nFour other men, all in their 20s, suffered non-life-threatening wounds.\n“We want to be able to find who this person is. We want to be able to arrest them, but we need the community’s help to give us information,” said Mayor Bill Peduto. “And I can assure you, any information that’s given will be kept confidential.”\nSeveral witnesses, who did not want to talk on camera, say security guards are required to search customers for weapons when they enter the bar.\nThey believe the gunman was not searched by the four security guards who left the business before police arrived.\nCouncilman Burgess says he understands why so many are scared to talk.\n“Those who have guns in some ways hold the community terrorized because they’re afraid. They’re afraid that if they do say something, the friends or the associates of the shooter will come and retaliate against them,” he said.\nBurgess is hoping the new administration will renew the Pittsburgh Initiative to Reduce Crime, which is a program that he says helped reduce homicides.\nMayor Peduto believes bar patrons hold the key to the investigation.\n“They have the information that can help us to make this arrest very quickly, just asking them to work with the police,” Mayor Peduto said.\nDetectives do have one big advantage in their investigation.\nThe bar has video surveillance cameras outside and on the inside, and it’s hoped that evidence on those cameras will help lead to an arrest."}