{"uri": "http://www.dcourier.com/news/2016/oct/14/prescott-valley-couple-face-felony-charges-after-a/", "title": "Prescott Valley couple face felony charges after accidental shooting", "dct": "Fri, 14 Oct 2016 06:01:00 GMT", "id": "e0e9e4dac8f5a11f1fc121756627909d", "content": "PRESCOTT VALLEY – A Prescott Valley shooting – allegedly involving an accidental self-inflicted gunshot wound – has led to the arrest of two people on a variety of drug, firearm, and endangerment charges.\nPrescott Valley Police reported Thursday, Oct. 13, that a couple, Amanda Paladino and Christopher Lapointe, were booked into the Yavapai County Jail on multiple felony counts.\nAmong the charges for both Lapointe and Paladino: Possession of drug paraphernalia, marijuana, and marijuana for sale; prohibited possession of a firearm; misconduct involving weapons during a drug offense; and misconduct involving weapons – possessing a prohibited weapon.\nIn addition, Paladino faces charges of: Unlawful discharge of a firearm in town limits; disorderly conduct discharging a deadly weapon; possession of dangerous drugs; possession of narcotic drugs; and three counts of endangerment (one for each child in the house at the time of the gunshot).\nThe incident began Oct. 7, when Prescott Valley Police officers were summoned to the Yavapai Regional Medical Center (YRMC) in Prescott Valley concerning a woman who had been dropped off with a gunshot wound.\n“Upon arrival, police learned that Amanda Paladino had allegedly accidentally shot herself while cleaning her shotgun in her residence on East Horizon Lane,” stated a news release from the Prescott Valley Police. She was later taken by ambulance to a Phoenix hospital.\nLapointe, her live-in boyfriend, had brought Paladino to YRMC, and had returned to the home to care for three girls, age 14 and 10-year-old twins, who had been left unattended, the release added.\nWhen officers arrived at the home to check on the children, they reportedly saw drug paraphernalia, an illegally altered shotgun, and a hole in the bedroom wall that appeared to have pellet spray surrounding it. In addition, they reported detecting an odor of marijuana.\nLapointe reportedly told officers that he and Paladino had had an argument about two hours before the shooting, but was unwilling to provide further information. A subsequent review of his criminal history “revealed that he is a convicted felon and therefore a prohibited possessor of a firearm,” the news release stated.\nAfter obtaining a search warrant, officers found six additional firearms, $1,520 in cash, 8.6 grams of methamphetamine, 6 ounces of marijuana, 2.3 grams of heroin, and other miscellaneous drug paraphernalia.\nPaladino, who was released from the hospital later that day, was arrested on Tuesday, Oct. 11, and booked in the Yavapai County Jail in Camp Verde.\n“Prescott Valley Police Department reminds everyone that firearms in the home require special care, especially when children reside in the home,” the news release stated, adding, “Fortunately, no other injuries occurred during this incident.”"}