{"uri": "http://www.localnews8.com/news/Charges-conditionally-dismissed-in-girl-s-shooting-death/33145450?ens=1&utm_source=Local+Breaking+News&utm_medium=email&utm_campaign=Local+Breaking+News_548739d20cf2d63fd8f1ace0_idaho&utm_content=20150521_1109", "title": "Charges conditionally dismissed in girl's shooting death", "dct": "Thu, 21 May 2015 23:50:00 GMT", "id": "e063677647c2df34bdddc49b0c7c33ff", "content": "POCATELLO, Idaho - The Chubbuck couple charged in the accidental shooting death of a 5-year-old girl last summer has reached a deferred prosecution agreement with prosecutors.\nIn April, we reported Rusty and Ashlee Lish had both pleaded not guilty to charges of misdemeanor injury to a child. Each charge carried up to six months in jail and a $1,000 fine.\nBoth were due in court Thursday, but in papers filed Wednesday, they were able to reach an agreement with prosecutors in which charges were conditionally dismissed.\nThe terms of the deal are as follows:\n- Pay around $28,000 in restitution to the Shawver family\n- Cannot possess a firearm for at least 2 years\n- Complete a court-approved parenting course\n- Complete a certified gun safety course\n- Complete family counseling for both themselves and other family members\n- Develop a community service project to educate the community about firearm safety in the home\n- Cannot commit any misdemeanors or felonies\nBannock County Prosecutor Steve Herzog said the charges could be brought back over the next two years should any of the terms of the deal be broken.\nStephen Muhonen, the prosecutor who handled the case, said charges could even be upgraded to felony injury to a child.\nMuhonen said the Shawver family worked closely with prosecutors to draft the terms of the deal.\nNoelle Shawver was shot by the Lishes' 5-year-old in July while visiting the Lishes' home on Canal Street. Prosecutors alleged the couple left loaded firearms within reach of those children.\nLocal News 8 has placed a call the Lishes' attorney, Gregory May, but that call hasn't been returned."}