{"uri": "http://boston.cbslocal.com/2016/10/09/girl-9-shot-roxbury-boston-police-annunciation-road/", "title": "9-Year-Old Girl Shot In Roxbury While Playing On Playground", "dct": "Sun, 09 Oct 2016 14:46:00 GMT", "id": "a0675d6b2db7585a4c8a4e712c64000d", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nBOSTON (CBS) — Frightened and upset residents who live in an apartment complex on Annunciation Road were horrified to hear a 9-year-old girl was shot while playing with other kids early Sunday morning\n“The only thing I heard was gun shots, about four or five gun shots maybe more,” one resident said.\nPolice say a family was having a party around 1 a.m. on Sunday. A group of kids were also part of the crowd when out of nowhere several gunshots rang out. One of the bullets struck a 9-year-old girl in the back. The shooter then fled the scene.\n“It’s tragic. I mean, I don’t know her status right now but still, regardless of what it is, it’s a 9-year-old being shot,” one resident said.\nThe girl was rushed to the hospital with non-life threatening injuries. One woman who does not want to be identified said she was shot in this same area six years ago. She said the neighborhood is simply not safe for kids or adults.\n“I am scared for my life,” she said.\nMany are wondering what kids were doing out so late, especially in this area.\n“In my opinion, no matter where you are, no matter where you live, out past dark is not safe,” a resident said. “Even with parents, without parents, I don’t think anyone should be out this late.”\nNo arrests have been made and police are still investigating the shooting.\nWBZ NewsRadio 1030’s Kim Tunnicliffe reports\nFollow\nFollow Paul on Twitter Paul Burton is a general assignment reporter for WBZ-TV News. Burton joined the stations as a participant in the \"CBS News Development Program\" and from WLNE-TV in Providence, where he worked as a general assignment rep...\nMore from Paul Burton"}