{"uri": "http://www.kmov.com/story/32233529/family-of-little-girl-shot-in-alleged-road-rage-speaks", "title": "Family of little girl shot in alleged road rage speaks", "dct": "Thu, 16 Jun 2016 02:44:00 GMT", "id": "92c19ac1129935cab610dae72e3942b4", "content": "ST. LOUIS, Mo. (KMOV.com) -\nThe family of a girl who was shot in an alleged road rage shooting spoke about the ordeal.\nThe girl, 3, was shot in the leg when her father, who was driving, honked at a black Ford F150 that got too close to his car. Someone inside the F150 then opened fire, the father said.\nOne bullet went through the car’s backdoor as the child held a teddy bear. The child was shot in the leg. The family says she is doing well and only has a bandage on her calf.\n“It came in the back and came out the front,” said one of the girl’s parents. That bullet, a parent said, grazed the girl in the leg.\nThe girl’s mother was in the front seat.\n“I dropped down to the bottom of the seat and then jumped him to snatch her and pulled her to the front of the car,” said the girl’s mother.\nAnother bullet hit the car’s gas tank.\n“We weren’t doing anything,” the mother said. \"I can see if we were doing something, but we weren’t doing anything.”\nThe family said it will not honk at other drivers anymore.\nCopyright 2016 KMOV (Meredith Corporation). All rights reserved\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}