{"uri": "http://wjhl.com/2015/08/31/19-year-old-man-accused-of-killing-mother-step-dad-grandmother-in-bristol/", "title": "Bond set at $1M for 19-year-old man accused of killing mother, step-dad and grandmother", "dct": "Mon, 31 Aug 2015 11:13:00 GMT", "id": "f5151f806324074d7601f4e260166f47", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nBRISTOL, TN (WJHL) – Bond has been set at $1 million for a man accused of killing three family members and injuring a child after a shooting that happened over the weekend.\nRobert Seth Denton, 19, is accused of killing his mother, step-father and grandmother inside a Bristol, TN home.\nMonday morning, the Sullivan County Sheriff’s Office released the name of the victims.\nDenton’s mother, 39-year-old Toshya Millhorn, step-father 36-year-old James Millhorn and grandmother 57-year-old Lena Rose were all fatally wounded at a home located in the 600 block of Henson Road around 5:45 p.m.\nDenton faces three counts of first-degree murder, aggravated assault and felony reckless endangerment charges.\nWhen officers responded to the scene Saturday evening, Toshya Millhorn and Lena Rose were found dead on the scene. James Millhorn died later at Johnson City Medical Center.\nA fourth victim, a 7-year-old girl, is said to be in stable condition.\nNews Channel 11 was told Denton was shot by his grandfather during the shooting and was taken to Bristol Regional Medical Center before his arrest. He is currently being held at the Sullivan County Correctional Facility.\nSheriff Wayne Anderson revealed more details in a press conference Monday morning.\nSheriff Anderson said officers talked to Curtis Rose, Denton’s grandfather, who told them his grandson was responsible for the shootings. Rose told deputies, he was doing some work next to the home when he was approached by his grandson who told him the needed to call 911. Rose told investigators he went inside the home and found the victims and took the children to another room.\nRose told investigators, he then grabbed a pistol, ran out the home and spotted his grandson at the end of the driveway – as he was about to leave the property.\nRose told officers he fired a shot at Denton, striking him in the arm.\nPolice found Denton moments later at the 800 block of Henson Road.\nSix children were inside the home at the time of the shooting. The bodies of the victims have been sent off for an autopsy.\nThe Sullivan County Sheriff’s Office says the investigation is ongoing.\nDenton was arraigned in Bristol Monday morning. His bond was set at $1 million.\nContinue to follow News Channel 11 for the latest developments in the case.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}