{"uri": "http://triblive.com/news/adminpage/9519484-74/chisler-police-gmitter?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29#axzz3sZJWTNet", "title": "Uniontown teen charged in shooting of friend", "dct": "Thu, 26 Nov 2015 05:21:00 GMT", "id": "dec51e41d985cb3d9dd9dd54ff8ea067", "content": "A Uniontown teenager was charged by city police with aggravated assault and placed in the Fayette County Jail on Wednesday for allegedly shooting a friend in the city's Pershing Court housing complex.\nAmar Daeshawn Chisler, 17, told police the shooting was accidental, according to a criminal complaint.\nHe was arraigned before District Judge Michael M. Metros on additional charges of reckless endangerment, simple assault and possession of a firearm by a minor, according to court records.\nIn an affidavit of probable cause, Uniontown Detective Donald Gmitter stated that police were called to a Pershing Court residence at 12:31 a.m. Wednesday for a report of a male with a gunshot to the head.\nPolice identified that person as Dametrious Addison, 18, of Pittsburgh, who was flown to Ruby Memorial Medical Center in Morgantown, W.Va., for medical treatment.\nHis condition could not be obtained on Thursday.\nGmitter said he observed a blood-soaked mattress and carpet in an upstairs bedroom, and a .38 Special revolver on a nightstand.\nGmitter said that in an interview, Chisler said that he and several friends, including Addison, were “hanging out” together and that “Meech” had a gun, which he placed on the bed.\n“Amar stated that he doesn't like guns, so he used a paper towel or napkin to pick up the gun and move it. When Amar picked up the gun, he stated that it ‘went off.' Amar threw the gun onto a nightstand and began to render aid (to Addison),” Gmitter wrote in the affidavit.\nChisler was transported to the city police station for questioning, where he admitted shooting his friend and stating that it was an accident, according to the affidavit.\nAccording to Gmitter, a Fayette EMS first responder who tended to Addison asked him who shot him.\n“He said, ‘It was my friend,' ” Gmitter wrote in the affidavit.\nMetros set Chisler's bail at $35,000.\nHe faces a preliminary hearing Dec. 22 before Metros.\nIn 2012, a man whom Uniontown police identified as Chisler's brother, Ramal O. Chisler, pleaded guilty to involuntary manslaughter and carrying a firearm without a license in a similar incident.\nChisler, now 21, was 16 when he was charged as an adult in the Sept. 16, 2010, shooting death of Tiffany Moody, 17, also in a Pershing Court apartment.\nAccording to Chisler's statements during a plea hearing, he was dismantling a handgun when it discharged unexpectedly, accidentally firing a bullet into Moody's upper left abdomen.\nRamal Chisler told police that he was dismantling the handgun because Moody did not like firearms, but her family disputed that claim.\nA sister, Jennifer Moody-Garrison, said their father, a hunter, taught them how to handle firearms properly as they were growing up.\nFayette County Judge Nancy Vernon sentenced Ramal Chisler to a term of six to 12 years in prison.\nHe remains in custody in the State Correctional Institution at Somerset.\nMary Pickels is a staff writer for Trib Total Media. She can be reached at 724-836-5401 or mpickels@tribweb.com."}