{"uri": "http://www.ktbs.com/story/27387766/shooting-under-investigation-in-shreveport", "title": "UPDATE - Toddler shot in Shreveport dies", "dct": "Sun, 16 Nov 2014 21:57:00 GMT", "id": "359012904c8950863e0385dac78b10d1", "content": "UPDATE (Sunday, 4:00 p.m.):\nThe girl shot in the head in Shreveport on Friday afternoon has died. Shreveport Police tell KTBS 3 News that the toddler passed away some time on Sunday. Police are now investigating the case as a homicide, and are still looking for the shooter.\nUPDATE:\nShreveport Police are investigating a shooting which left a three year old child seriously injured and authorities seeking a suspect.\nJust after 12:00 p.m. on November 14, 2014, Shreveport Police patrol officers were dispatched to University Health Medical Center after it was learned a three year old female had arrived at the hospital's emergency room suffering an apparent gunshot wound to the head. Upon officer's arrival at the hospital, contact was made with the child's parents who alleged their child was shot by an unknown intruder who entered their home, located in the 2700 block of Devaughn Street. The suspect fled the scene of the crime following the shooting. The child remains in critical condition.\nShreveport Police Violent Crimes detectives along with Crime Scene investigators were notified of the incident and arrived at the home launching an investigation into the shooting. Detectives are working feverishly at this hour to determine the exact circumstances surrounding the shooting and the identity and whereabouts of the person responsible. A limited suspect description of an African American male was provided to authorities during preliminary interviews. Police are urging anyone with information about this crime to contact Crime Stoppers immediately at (318) 673-7373 or on their website at www.lockemup.org Crime Stoppers is offering a reward for information leading to the arrest of the person responsible for this crime.\nORIGINAL STORY:\nShreveport police are investigating a shooting. It happened before noon today in the 2700 Block DeVaughn Street.\nAccording to an official with the Shreveport Police Department, a man and a female child were sitting at home when another man walked in fired a gun and fled. The bullet struck the young girl, who is believed to be around 3 to 5 years old. She was taken by a private vehicle to University Health and is listed in critical condition. There is no word on the relationship between the man who was in the home with the girl prior to the shooting.\nNo names have been released and police do not have a description of the suspect. We'll continue to follow this story as it develops."}