{"uri": "http://www.ksla.com/story/27394588/shreveport-girl-3-dies-from-injuries-after-being-shot-in-head", "title": "Shreveport girl, 3, shot in head remains on life support", "dct": "Sat, 29 Nov 2014 20:34:00 GMT", "id": "e6b58386e0f4264f2d8548aa4915474e", "content": "SHREVEPORT, LA (KSLA) - The 3-year-old girl shot in the head on Friday in Shreveport remains in critical condition at University Health.\nAfter speaking with the child's father, KSLA News 12 reported that that 3-year-old Paris Hill, affectionately known as \"Nanny\" had died from her injuries.\nThat report was in error, as authorities have since clarified that the little girl remains on life support.\nParis was rushed to University Health on Friday by her parents, who told police she had been shot by an unknown intruder who entered their home in the 2700 block of Devaughn St. just before noon.\n\"I tried to take that bullet, I tried to take that bullet. I was just a second late,\" said Paris' father Alonzo Hill. \"My baby would still be here.\"\nNeighbors reported hearing gunshots and seeing a white car drive away.\nHill now says his daughter's condition is very grave, and that the family is now faced with the difficult decision of whether to remove her from life support.\n\"That's my baby, I am going to miss her. She just passed today,\" Hill said.\nPolice are looking for surveillance video from nearby businesses in hopes of turning up video that might help investigators narrow down what kind of vehicle the gunman was driving and help lead to a suspect.\n\"It was like a flash, and then it was over with,\" Hill added.\nHill says he works out of state but decided to drive overnight to come home to see his babies, because work often keeps him away.\nPolice are urging anyone with information about this crime to contact Crime Stoppers immediately at (318) 673-7373 or on their website at www.lockemup.org Crime Stoppers is offering a reward for information leading to the arrest of the person responsible for this crime.\n\"The man that did this, man, I wish you would come forward,\" Hill pleaded.\nParis' family has set up a GoFundMe account to help cover her funeral expenses.\nCopyright 2014 KSLA. All rights reserved."}