{"uri": "http://www.kktv.com/home/headlines/Active-Shooter-Situation-At-Planned-Parenthood-356013081.html", "title": "3 Dead In Springs Planned Parenthood Shooting; Gunman In Custody", "dct": "Fri, 27 Nov 2015 11:55:00 GMT", "id": "a480075e26fb1eb535ddd1df3f6e1402", "content": "UPDATE 11/30 5:04 p.m: The autopsies for the three people killed in Friday's shooting have been released.\nThe El Paso County Coroner's Office ruled all the deaths a homicide. The cause of death for each victim was a gunshot wound.\n___________________________\nUPDATE 11/30 1:30 p.m.: Accused gunman Robert Dear made his first court appearance through a video feed in the jail.\nDear had been held in the El Paso County jail without bond since his arrest Friday night. District Attorney Dan May said that won't be changing after his first court appearance.\n\"In terms of today's hearing, the top charge was the most important in terms of setting any bond...under Colorado law, at this appearance, if it's a first-degree murder [charge], that's a mandatory no bond,\" May explained.\nIf convicted, Dear could face a minimum sentence of life on prison or a maximum sentence of death. The DA's office has nine weeks to decide whether to seek the death penalty or not.\nIn addition to the first-degree murder charge, Dear could face federal charges. That decision has not been made yet.\nThe families of the shooting victims were in court Monday to watch the hearing.\nDear will be back in court next week.\n____________________________\nUPDATE 11/29 4:30 p.m.\nAll lanes of Centennial Blvd from Fillmore to Rio Alto Heights are now open to normal vehicle and pedestrian traffic.\nAreas around Planned Parenthood are still closed as investigators continue to process the scene.\n____________________________\nUPDATE 11/29 4:01 p.m.\nThe two civilian victims have been tentatively identified by the El Paso County Sheriff's Office as 35-year-old Jennifer Markovsky and 29-year-old Ke'Arre Stewart.\nThe Sheriff's Office says says autopsies are still being done.\n__________________________\nUPDATE 11/29 3:13 p.m.\nA GoFundMe Account has been set up for Ke'Arre Stewart. Access it by clicking here.\n____________________________\nUPDATE 11/29 12:06 p.m.: Investigators estimate it will take six to seven days to process the crime scene. It is anticipated that Centennial Blvd. will be open to traffic by next Monday morning, November 30.\nWe've also learned the name of one of the civilians killed. Ke'Arre Stewart's wife tells us he was a father and their \"lives will never be the same.\"\n-----------------------------------------------------\nUPDATE 11/29 11:21 a.m.: Memorial Hospital says three shooting victims have been discharged. One patient remains hospitalized.\n______________________________\nUPDATE 11/29 10:35 a.m: The family of Officer Garrett Swasey released a statement Sunday morning.\nStatement by Rachel Swasey, wife, Officer Garrett Swasey\nThe family of Officer Garrett Swasey sincerely thanks everyone for their support during this very difficult time. Our loss cannot be expressed in words. While the nation now knows Garrett as a hero who gave his life for others, he was also a devoted husband of 17 years and a wonderful father to his two children. His greatest joys were his family, his church, and his profession. We will cherish his memory, especially those times he spent tossing the football to his son and snuggling with his daughter on the couch.\nGarrett was born in Melrose, Massachusetts. After a successful career in ice skating, Garrett found his calling as a police officer. Helping others brought him deep satisfaction and being a police officer was a part of him. In the end, his last act was for the safety and wellbeing of others and was a tribute to his life. What we need most today, and in the coming weeks, is your prayers for our family and for others who were impacted by this tragedy. We are grateful for the tremendous outpouring of love that has come from the community and across the nation.\nWe understand this is a public tragedy felt by many and we also appreciate your support for us to grieve privately.\n___________________________\nUPDATE 11/28 8:30 p.m.: Students, faculty and numerous members of the community gathered on the UCCS campus Saturday night to hold a vigil for Officer Garrett Swasey.\nSwasey was a six-year veteran of the university's police force.\n\"He knew, he knew the risks and he loved what he did. He dedicated himself to being here, he dedicated himself to this profession,\" UCCS police Chief Brian McPike said.\nUCCS also held a moment of silence at their basketball game Saturday afternoon.\nA memorial fund set up for Swasey exceeded $68,000 Sunday morning. A link to the fund can be found on the side of this page, or underneath this article for mobile users.\n___________________________\nUPDATE 11/28 5:03 p.m.: Gov. John Hickenlooper has ordered flags at half-staff immediately to honor the victims of yesterday's shooting.\n____________________________\nUPDATE 11/28 4:01 p.m.: New numbers released by law enforcement at 4 p.m.:\n-Six officers, including fallen Officer Garrett Swasey, were shot.\n-Four officers with CSPD\n-One (Swasey) with UCCS\n-One with the El Paso County Sheriff's Office\n-Three additional officers were injured during the standoff/shootout, but not from gunshot wounds.\n-Six civilians, including the two killed, were shot.\n-All of the injured are in good condition and expected to make a full recovery.\n-Twenty-four people were evacuated unharmed from Planned Parenthood.\n-Three hundred people were forced to shelter in place in the nearby shopping center during the shootout/standoff. One hundred and fifty were inside King Soopers.\n-Autopsies for the slain civilians will be done on Monday, Nov. 30.\n______________________________\nUPDATE 11/28 1:10 p.m.: Officials gave the following answers at a media Q and A Saturday:\n-(Carey, in response to question about injured officers) \"I got to see them last night and the mayor got to visit them this morning. They're in pretty good spirits, and my hope is for the most part, most of them get released today. I'm absolutely blessed that more officers weren't killed yesterday.\"\n(Suthers, in response to the same question): \"I was incredibly impressed meeting with the officers this morning. They were all alert; some of them have a little longer path to recovery than others. Their major concerns are about their comrades. You can just feel they want to get out there, and they'd do it all again in a heartbeat.\"\n(John Walsh, Colorado attorney general, praising law enforcement): \"There was extraordinary courage and determination shown yesterday by first responders on the scene, who in all likelihood prevented a much greater loss of life.\"\n(Suthers, in response to question about protecting other potential targets in Colorado Springs) \"An incident of this nature can take place in any city in the United States. It behooves us to make sure we have as good a first response capability as possible. As I watched the situation unfold yesterday, there was not an iota of doubt in my mind that we have incredibly well-trained first responders...just as we responded very capably to this incident, we are capable of responding to other incidents. We periodically meet and talk about what our vulnerabilities are, and we plan for those.\"\n(Carey, in response to a question about whether he had been made aware of any threats to Planned Parenthood prior to Friday) \"I know we've had prior conversations with Planned Parenthood, as is the case with many of our bigger organizations in the city. They work with the Colorado Springs Police Department to develop site plans and some suggestions we give them to make their place safe. I don't know of any specific threats that I can discuss right now for that organization, but we've had some conversations in the past with them and other big organizations and buildings in the city.\"\n__________________________\nUPDATE 11/28 1 p.m.: Colorado Springs Police Chief Pete Carey outlined the police department's top priorities going forward in the investigation.\n\"First and foremost is to take care of the victims of this horrible tragedy. ... The second priority is to do as thorough and complete an investigation of this crime as we can, and there are a lot of moving parts with the crime scene, and literally dozens and dozens and dozens of victims and witnesses.\"\nCarey said the identities of the two civilian who were killed would not be released until their autopsies were completed. He expected that to be Monday.\n\"I finally want to say how proud I am of our first responders,\" he said before relinquishing the mic to the other officials for a media Q and A. \"The Colorado Springs Fire Department; police department; literally another dozen or two other agencies, big and small, that came out yesterday afternoon...some are still on scene. It was just amazing to see that. When you have things like a Waldo Canyon Fire, a Black Forest Fire, a tragedy like this, a distinction of why we're Colorado Springs is I don't have to ask for that. They've already come out, they're already rolling their sleeves up and helping out.\"\n________________________\nUPDATE 11/28 12:52 p.m.: Gov. John Hickenlooper refused to say the alleged gunman's name while addressing media over Friday's shooting.\nHis focus was on the heroes and victims--one and the same in many instances.\n\"Situations like this show the country is filled with heroes who want to protect their neighbors,\" Hickenlooper said. \"Incredible beauty here in the Springs exaggerates joy in joyful times and sorrow.\"\nHickenlooper said the state was united behind Colorado Springs and El Paso County.\n\"It's a tragedy beyond speech...I spent a lot of time last night trying to figure out how things like this can occur.\"\n______________________\nUPDATE 11/28 12:45 p.m.: \"The city of Colorado Springs is in mourning today,\" Mayor John Suthers said while addressing media Saturday at a joint news conference with Gov. John Hickenlooper.\n\"We're in mourning over the deaths of three people, including one very brave police officer. ... We mourn the injuries to citizens and police officers alike.\n\"But we are also very thankful today for the incredible work of the first responders, particularly the SWAT teams, who handled themselves incredibly well. In my opinion--and I was in the command center watching this all unravel--they saved many, many lives yesterday.\"\nSuthers said he had fielded calls from the White House Saturday offering their support, and that agencies such as the state attorney general's office and the FBI were on the ground in Colorado Springs to help with the investigation.\n_______________________\nUPDATE 11/28 12 p.m.: \"Our hearts break together for what happened,\" said Planned Parenthood of the Rocky Mountains President and CEO Vicki Cowart, addressing a full house at All Souls Unitarian Universalist Church.\n\"All of us, our entire nation, community, was attacked. We don't know yet why this happened.\"\nCowart said the 15 Planned Parenthood employees on duty at the time of the shootings are accounted for and unharmed. She anticipated the Centennial Boulevard clinic would be closed for \"some time.\"\n__________________________\nUPDATE 11/28 11:30 a.m.: A vigil for Planned Parenthood of the Rocky Mountains and all those who were impacted in Friday's shootings began at the All Souls Unitarian Universalist Church.\n___________________________\nUPDATE 11/28 9:57 a.m.: Two of the four shooting victims taken to Memorial have been discharged from the hospital.\n___________________________\nUPDATE 11/28 9:19 a.m.: Law enforcement announces an address listed in Hartsel, Colo. for shooting suspect Robert Lewis Dear.\n_____________________________\nUPDATE 11/28 7:15 a.m.: The King Soopers parking lot on Centennial has been reopened. People locked down in the shopping center Friday who were forced to leave their cars at the scene overnight are now allowed to pick them up.\n_____________________________\nUPDATE 11/28 6:55 a.m.: President Barack Obama released a statement responding to the tragedy in Colorado Springs:\nThe last thing Americans should have to do, over the holidays or any day, is comfort the families of people killed by gun violence -- people who woke up in the morning and bid their loved ones goodbye with no idea it would be for the last time.\nAnd yet, two days after Thanksgiving, that’s what we are forced to do again.\nWe don’t yet know what this particular gunman’s so-called motive was for shooting twelve people, or for terrorizing an entire community, when he opened fire with an assault weapon and took hostages at a Planned Parenthood center in Colorado. What we do know is that he killed a cop in the line of duty, along with two of the citizens that police officer was trying to protect. We know that law enforcement saved lives, as so many of them do every day, all across America. And we know that more Americans and their families had fear forced upon them.\nThis is not normal. We can’t let it become normal. If we truly care about this -- if we’re going to offer up our thoughts and prayers again, for God knows how many times, with a truly clean conscience -- then we have to do something about the easy accessibility of weapons of war on our streets to people who have no business wielding them. Period. Enough is enough.\nMay God bless Officer Garrett Swasey and the Americans he tried to save -- and may He grant the rest of us the courage to do the same thing.\n________________________________\nUPDATE 11/28 5 a.m.: Springs police released a mugshot of the suspected gunman in the Planned Parenthood shooting.\nThough the name was floated around hours earlier, law enforcement officially identified the alleged shooter at this time as 57-year-old Robert Lewis Dear. There are numerous media reports that he is from North Carolina.\nDear is being held in the El Paso County jail without bond.\nAt this time, nothing is known about Dear. We are working fast to get concrete information on his background.\n____________________________\nUPDATE 11/28 2:29 a.m. State Patrol escorted the body of fallen Officer Garrett Swasey to the El Paso County Coroner's Office. The roughly 40-minute procession drove from I-25 to Circle to Janitell to Las Vegas.\nDespite the early hour, some citizens took to the street and looked on solemnly.\n\"It's unfortunate news...it's unfortunate,\" said Nathan Humphrey, who recorded the procession and sent the video to 11 News.\n________________________________\nUPDATE 7:02 p.m.: Springs police confirm that three people were killed in the Planned Parenthood shooting.\nAmong the dead were two civilians and a police officer working for the University of Colorado-Colorado Springs. He has been identified as Garrett Swasey, 44. He worked for the department for six years.\nAccording to our partners at the Gazette, the suspect has been identified as Robert Lewis Dear.\nPolice say nine additional victims were hospitalized, and are in good condition. Of those, police say five officers and four civilians were injured.\nDespite the tragic loss of life, Mayor John Suthers said the loss of life could have been more staggering had it not been for the \"brave responding officers.\"\n\"This is a terrible, terrible tragedy that happened today in Colorado Springs,\" he said.\n_____________________________\nUPDATE 6:40 p.m.: Planned Parenthood officials told CNN they are \"still reaching out to confirm individuals, how they are,\" but do not believe any staff were severely injured in the shooting, and don't think any patients were hurt.\n______________________________\nUPDATE 6:05 p.m.: Our news partners at KCNC in Denver are reporting that an officer with the University of Colorado-Colorado Springs was killed in Friday's shooting.\n11 News is working to independently confirm this. Springs police have not officially announced any fatalities. A spokesperson with the city of Colorado Springs says they are still working to get more information on the conditions of the victims.\n______________________________\nUPDATE: 5:16 p.m.: \"This is a horrible tragedy for our community,\" 4th Judicial District Attorney Dan May said after the suspect's capture.\nHe and other officials sang the praises of the law enforcement involved in the hours-long standoff with the gunman.\n\"Our first responders did an excellent job,\" CSFD Chief Christopher Riley said.\n\"There were many instances of bravery today,\" said May.\n\"Our officers worked with untold valor,\" said CSPD Lt. Catherine Buckley.\nDespite engaging in gunfire with officers for more than two hours, a police spokesperson said officers were eventually able to get the suspect to surrender after shouting at him and maintaining contact with him while he was barricaded inside the Planned Parenthood building. It's unclear if the suspect was injured when he surrendered.\nAuthorities did not release the suspect's identity, but reiterated that the gunman was alone. They said the scene is \"complicated,\" and will take hours--possibly days--to process.\n\"It is too early to speculate on a motive,\" Buckley said.\n__________________________\nUPDATE 5:14 p.m.: Police say they are in the process of letting the 150 people inside King Soopers leave.\n____________________________\nUPDATE 5:06 p.m.: \"There's no continuing peril to the city of Colorado Springs,\" Colorado Springs Mayor John Suthers said in a statement to the media after the gunman was captured.\nOne hundred and fifteen Colorado Springs officers, and countless law enforcement from other agencies are currently at the scene.\nCSPD Chief Pete Carey told the media that he has \"just as many questions as you do.\" He and other officers refused to speculate on a motive, pointing out that they had just gotten the suspect in custody.\nThe suspect was caught just a few minutes before 5 p.m.\n_____________________________\nUPDATE: 5:02 p.m.: Mayor John Suthers' office has confirmed that the gunman is now in custody.\n_________________________\nUPDATE 4:58 p.m.: We are hearing unconfirmed reports that the gunman has been detained.\n___________________________\nUPDATE 4:52 p.m: A courier for Planned Parenthood told 11 News she is hiding in her car in the building's parking lot, more than five hours after a gunman stormed the premises.\n\"When I was leaving this building...I got back in my car and all of a sudden I heard what I thought was gunshots. And I kept thinking, 'Is that gunshots?'\"\nTo her horror, a moment later she saw a man stagger out of a car, riddled with gunshots.\n\"I was watching over to the Planned Parenthood area, and I saw a car and I see somebody leave and somebody go inside with a bag. I didn't think a whole of it, but then I watched this car...it kind of drifted from the driveway over at Planned Parenthood across to that little road in between that and the next building...it kind of went up a little hill, kind of drifted back. I knew watching it that there was no one steering that car.\n\"It came to a stop as it rolled backwards...a guy got out and fell to the ground. You could see all the gunshots.\"\n________________________\nUPDATE 4:35 p.m.: Colorado Springs Mayor John Suthers is currently at the shooting scene, working with law enforcement.\nKing Suthers', where 150 people have been locked down for almost five hours, says it is providing everyone there with food and drinks.\n_________________________\nUPDATE 4:18 p.m.: Gov. John Hickenlooper released a statement regarding the Planned Parenthood shooting in Colorado Springs:\n“We hold the Colorado Springs community in our thoughts and prayers. The bravery and courage of local law enforcement officers have prevented a dire situation from being far worse, and we are all grateful. We are in contact with Mayor Suthers. All state Public Safety resources are at the ready, if and when needed.” ‪#‎CentennialBLshooting‬\n-Governor Hickenlooper\n___________________________\nUPDATE 4:06 p.m.: CSPD Lt. Catherine Buckley confirms that the shooting did start at the Planned Parenthood on Centennial Boulevard. There had earlier been conflicting reports that the shooting may have started in a different area near the building.\nSome victims reportedly left Planned Parenthood and went to a nearby bank.\nBuckley told reporters that there is only one gunman, and does not know his identity. She confirmed the shooter remains holed up in the building that houses Planned Parenthood, and that he has been shooting at officers for the last couple of hours.\nBuckley said the gunman brought unspecified items into the building with him.\nFour officers are confirmed injured; Buckley said it's unconfirmed if a fifth was also hurt. There is no word on their conditions, and Buckley could not confirm if there were any fatalities. Several civilians were also injured.\n_______________________________\nUPDATE 3:41 p.m.: President Barack Obama has been briefed over the Colorado Springs shooting.\n______________________________\nUPDATE 3:33 p.m.: Planned Parenthood of the Rocky Mountains released a statement in response to the Centennial Boulevard shooting:\n\"We don't yet the full circumstances and motives behind this criminal action, and we don't know yet if Planned Parenthood was in fact the target of the attack.\"\n_____________________________\nUPDATE 3:25 p.m.: NYPD says its Critical Response Vehicles have been redeployed to Planned Parenthood sites as a precaution due to the active shooter in Colorado Springs. There is no current threat to NYC sites.\n______________________________\nUPDATE 3:20 p.m.: Penrose Main confirms six patients have been taken there.\n_____________________________\nUPDATE 2:50 p.m.: Penrose Main confirms five patients have been taken there.\n_____________________________\nUPDATE 2:43 p.m.: CSPD Lt. Buckley confirms four officers were shot.\nOfficers in the building that houses Planned Parenthood have encountered the suspect and are engaging in gunfire now.\n_______________________________\nUPDATE 2:29 p.m.: We have now confirmed four patients have been taken to Penrose Main. Their conditions are not known.\n____________________________\nUPDATE 2:18 p.m.: Officers say they are encountering gunfire as they try to corner the suspect.\n____________________________\nUPDATE 1:35 p.m.: CSPD Lt. Catherine Buckley says that the gunman in a shooting near Planned Parenthood remains at large after injuring three officers and an unknown amount of civilians.\nEveryone in the Centennial and Fillmore area is advised to stay inside.\nThree victims have been taken to Penrose Main, while an unknown amount of other victims have been taken to Memorial. Their conditions are unknown.\nAuthorities are actively working through the businesses in the Fillmore and Centennial area to treat victims and locate the shooter.\n__________________________\nUPDATE 1:02 p.m.: Police commander tells our news partners at The Gazette that a third officer was injured in shooting at Fillmore and Centennial.\n___________________________\nUPDATE 12:27 p.m. Fillmore and Centennial shopping center now under a shelter in place status due to an active shooter.\n_______________________\n11:49 a.m. An officer has reportedly been shot in the hand, while police continue their search for a shooting suspect near the Planned Parenthood on Centennial.\nSprings police are advising the public to stay away from the Centennial and Fillmore area.\nOur crew is at the scene now. This is a developing story, and we will provide updates as more information becomes available."}