{"uri": "http://gazette.com/active-shooter-contained-near-planned-parenthood-in-colorado-springs-multiple-victims-reported/article/1564419", "title": "Suspect identified in Colorado Springs Planned Parenthood shooting, 3 killed, 9 injured", "dct": "Fri, 27 Nov 2015 00:00:00 GMT", "id": "f880a361713328c8e90209d94ebf4126", "content": "Click here for more recent updates\nSaturday 1:15 p.m. UPDATE\nTwo officers were crouched down examining a wood-paneled shack at the five-acre property, 809 Ouray Court, which also included a small RV or mobile home and stacks of firewood.\nOther law enforcement officers -- including two Park County sheriff's SUVs, at least one ambulance and a command center vehicle -- where stationed in a makeshift parking area farther away.\nA sheriff's deputy blocked the entrance of Ouray Court, which is nestled in a 10-mile-long stretch of rolling prairies frequented by antelope between Wilkerson Pass and Hartsel.\nHe previously lived in North Carolina in a mountain cabin where he kept mostly to himself, living with no electricity or running water on a winding dirt road about 15 miles west of Asheville, the Associated Press reported.\n\"If you talked to him, nothing with him was very cognitive -- topics all over the place, said James Russell, who lived a few hundred feet away.\nHe would often avoid eye contact. Still, Russell said religion or abortion never came up in conversation, the Associated Press reported.\nSaturday 12:49 p.m. UPDATE\nPlanned Parenthood officials say that all 15 staff members who were in the Centennial Boulevard clinic at the time of the shootings on Friday are unharmed.\nSaturday 12:41 p.m. UPDATE\nPenrose-St. Francis hospital spokesman Chris Valentine says that three patients from the Planned Parenthood shootings had been discharged from the hospital and three remained as of about 12:30 p.m. Saturday.\nSaturday 11:49 a.m. UPDATE\nTwo funds thus far have been set up for the wife and children of slain Officer Garrett Swasey:\n- Aventa Credit Union has established the Garrett Swasey Memorial Fund. To make a donation, stop by any Aventa Credit Union branch or call Aventa Credit Union at 719.482.7600 or 800.555.6665.\n- An online memorial fund is accepting donations for the family at:\nhttps://www.youcaring.com/the-family-of-officer-swasey-rachel-swasey-and-children-477034.\nSaturday 10:56 a.m. UPDATE\nOfficials at the University of Colorado-Colorado Springs have announced the school will schedule a moment of silence for slain officer Garrett Swasey prior to Saturday's basketball games.\nChancellor Pam Shockley Zalabak, UCCS Police Chief Brian McPike and members of the UCCS Police Department will participate in the pre-game moment of silence at Gallogly Events Center.\nSaturday 10:25 a.m. UPDATE\nU.S. Rep. Doug Lamborn Saturday morning reacted to comments on the Colorado Springs from the White House: \"I'm sorry that President Obama tried to politicize this tragedy.\"\n\"The only appropriate thing to do is to grieve with the families ... and express gratitude to our first responders.\"\nThe Associated Press reports Colorado Springs Mayor John Suthers says authorities aren't ready to discuss a possible motive of the gunman who attacked a Planned Parenthood clinic there, but says people can make \"inferences from where it took place.\"\nSuthers says investigators have interviewed Dear, but that authorities still want to learn more about him, suggesting that his mental health was part of the investigation.\nThe mayor praised the security staff working at the clinic Friday and said they were \"incredibly helpful\" in working with police to monitor the gunman's whereabouts on surveillance video and advising on the building's layout, AP reported.\nSaturday 9:26 a.m. UPDATE\nColorado Springs police tweet that a residential address in Hartsel, Colo., has been linked to Robert Dear, and that it has been closed to access by the Park County Sheriff's Department.\nSprings police also confirm that the Planned Parenthood clinic has been cleared, though it still is an active crime-investigation scene.\nSaturday 9:10 a.m. UPDATE\nAn online memorial fund has been set up for University of Colorado at Colorado Springs Police Officer Garrett Swasey, who was one of three people killed Friday during a shooting at the Planned Parenthood clinic in Colorado Springs.\nDonations are being taken at:\nhttps://www.youcaring.com/the-family-of-officer-swasey-rachel-swasey-and-children-477034.\nMoney raised will start an education fund for Swasey and his wife Rachel’s two children, Faith, 6, and Elijah, 10.\nThe $5,000 goal had been surpassed by Saturday morning, topping more than $8,200.\nThe six-year veteran of the UCCS Police Department was on duty at the campus Friday morning and responded to the shooting to support Colorado Springs police.\nOriginally from Boston, Swasey moved to Colorado Springs in the early ’90s to train at the Olympic Training Center as an ice dancer before retiring and moving into law enforcement. He was an elder who led various groups at his church, Hope Chapel.\nThe church will have a prayer gathering in his honor Saturday at 3 p.m. The church, at 5740 N. Academy Blvd., is located near Academy Boulevard and Vickers Drive.\nUCCS will observe a moment of silence before Saturday’s basketball games. The teams will play games at 3:30 p.m. and 5:30 p.m. at the Gallogly Events Center on campus.\nUCCS also will host a vigil Saturday evening at 7:30 p.m. Attendees are asked to those who attend are asked to park in the parking garage and take the north exit to access the west lawn of the campus.\nSaturday 9:01 a.m. UPDATE\nMayor Suthers, a former attorney general, said, \"this is the largest incident I know of in the post-Columbine era.\"\nThe mayor reaffirmed his support for open-carry gun laws in Colorado, and praised law enforcement officers for their \"incredible response\" to the incident.\nSaturday 8:52 a.m. UPDATE\nA tired Mayor John Suthers revisited the scene of the shooting Saturday morning, and asked about himself by The Gazette, said \"I've been better.\"\nSuthers went on to say, \"This is a town I know will support everyone involved ... this town will rally.\"\nSaturday 8:08 a.m. UPDATE\nEl Paso County Sheriff's Office website states that Robert Dear is in jail on a no-bond hold.\nSaturday 8:04 a.m. UPDATE\nA few workers head into the King Soopers, indicating the store may reopen later today.\nMany police are still working the scene around Planned Parenthood. Two badly damaged police cruisers, one with windows shot out, can be seen sitting behind the crime-scene tape.\nIn the King Soopers lot, scores of cars still remain. One pickup truck has its window open, a cell phone lying on the snow-covered car seat.\nSaturday 7:55 a.m. UPDATE\nABC News has reported that Robert Dear is being held without bond as he awaits his first court appearance scheduled for Monday.\nJail records didn't list charges but showed him being held on two administrative holds, ABC reported.\nSaturday 7:30 a.m. UPDATE\nThe Colorado Springs Police Department confirms that the items brought to the scene by the suspect have been secured, and processed items are no longer a threat.\nSaturday 7:16 a.m. UPDATE\nColorado Springs police issue a notice that those who had to leave their vehicles in the King Soopers parking lot Friday night are now able to retrieve them.\nSnowplows were brought to the area Saturday morning to make it easier to move the snow-covered cars.\nThe scene at the Planned Parenthood center Saturday morning was busy: law enforcement officials and about 12 television crews, but all businesses are closed.\nSaturday 6:42 a.m. Saturday UPDATE\nAs the sun rose over Colorado Springs, the new day was still marred by Friday's tragedy.\nEven several inches of fresh snow couldn't disguise the crime-scene tape still hung up by the yard at Fillmore Street and Centennial Boulevard. In the King Soopers parking lot, dozens of snow-covered cars await their owners who were caught by Friday's killings and hunkered down inside stores.\nAcross the way, police cars idle, with lights flashing outside the Planned Parenthood Clinic that police say was targeted by Robert Lewis Dear.\nFriday 9:15 P.M. UPDATE\nA law enforcement official confirmed the identity of the man arrested Friday in connection to the shooting. His name is Robert Lewis Dear.\nFriday 7:30 P.M. UPDATE:\nUCCS has confirmed Garrett Swasey, 44, a six-year veteran of the UCCS Police, was killed in Friday's shoting.\nHere is a statement from UCCS Chancellor Pamela Shockley-Zalabak:\nIt is with great sadness that I share the tragic events today at the offices of Planned Parenthood in Colorado Springs have touched the campus of the University of Colorado at Colorado Springs.\nA UCCS police officer, Garrett Swasey, 44, responded in support of Colorado Springs Police to the active shooter sitation at about 11:50 a.m. Friday. He was killed in the line of duty.\nUCCS officers are sworn, state-certified police officers. Officer Swansey was on duty at the campus and responded in support of Colorado Springs Police.\nOfficer Swasey was a six-year veteran of the UCCS Police Department.\nUCCS is working with Officer Swasey's family and continues to support the Colorado Springs Police Department at the shooting scene.\nAll questions about the investigation of Planned Parenthood shootings should be directed to the Colorado Springs Police Department.\nFriday 7 P.M. PRESS CONFERENCE UPDATE:\nLt. Catherine Buckley of the Colorado Springs Police Department confirms two civilians and a UCCS police officer died in Friday's shooting. Four civilians and five officers were transported to hospitals with gunshot wounds. All are in good condition.\nMayor John Suthers: \"This is a terrible tragedy. It could have been much worse but for the actions of the first responders. I commend the Colorado Springs Police Department and all of the other first responders.\"\nPolice Chief Pete Carey: \"My heart's broken. This is a tough situation for a lot of people in our community.\"\nFriday 6:45 P.M. UPDATE:\nThe Colorado Fraternal Order of Police has confirmed that a police officer wounded in the shooting has died.\nColorado Springs Fire Chief Chris Riley said during a news conference at Penrose Hospital that he had visited all four officers wounded during the shooting. Three are Colorado Springs Police officers and one is an El Paso County Sheriff's deputy. He said all are awake and talking.\n\"All of the firefighters and police at the scene are heroes. They laid their lives on the line today to prevent this disaster from getting worse.\"\n\"This has been a tragic day, a very, very tragic day.\"\nAll victims have been transported away from the scene, but emergency responders continue to search the area \"to make sure the area is safe. We are not leaving anything to chance. It is also a crime scene, so I can't tell you how long law enforcement will be there combing the scene for evidence.\"\n\"We train for days like this, but hope they never happen. We have to be prepared and our people stood up to that challenge.\"\nRiley said 14 fire trucks and other vehicles with crews totaling 35 reponded to the scene, along with 12 ambulances and 26 crew members from American Medical Response and countless officers and support personnel from the Colorado Springs Police, El Paso County Sheriff's Office, the Colorado State Patrol, Colorado Bureau of Investigation, the FBI and Bureau of Alcohol, Tobacco and Firearms.\nFriday 6:16 P.M. UPDATE:\nStatement by University of Colorado at Colorado Springs Chancellor Pam Shockley-Zalabak:\nWe at UCCS are saddened by the tragic events today at the offices of Planned Parenthood in Colorado Springs, about 10 minutes southwest of campus.\nOur thoughts and support are with those injured.\nA UCCS police officer responded in support of CSPD to the active shooter situation at about 11:50 a.m. Friday.\nHe was on duty at the campus and responded in support of an officer under fire.\nUCCS officers continue to work in support of the Colorado Springs Police Department at the shooting scene.\nFriday 6 P.M. UPDATE:\nMultiple news outlets are reporting fatalities in Friday's shooting at a Colorado Springs Planned Parenthood building. Gazette news partner KKTV reports that a University of Colorado at Colorado Springs officer was killed; 9News in Denver reported that one offficer and one civilian are dead.\nA gunman surrendered to police at 4:52 p.m. Friday outside a Planned Parenthood in western Colorado Springs after an hours-long standoff all afternoon.\nEleven people were taken to hospitals, including five law enforcement officers.\nThe gunman and an unknown number of people remained inside for nearly five hours after a shots fired call was made to police at 11:38 a.m. Police have not identified the gunman nor said whether there were any fatalities.\n“This is a horrible tragedy for our community,” said Dan May, 4th Judicial District Attorney. “We saw a lot of individual acts of bravery today and actually a lot of bravery as a team.”\nA woman in a nearby hair salon said she heard 10-20 shots, and looked outside to see an officer fall to the ground and another officer try to drag him to safety.\n\"We can't stop shaking,\" she said, in a phone interview.\nOver the next several hours, people wounded were taken to a police staging area in armored personnel carriers. As one was put on a stretcher and taken by ambulance, shouts in the crowd of law enforcement officers could be heard calling for a sniper to help out.\nMore than 100 law enforcement officers from around El Paso County are on the scene, including bomb squads, law enforcement from the University of Colorado at Colorado Springs, Colorado State Patrol, the ATF and the FBI. Police have cordoned off a large swath of the area around Fillmore Street and Centennial Boulevard, near where the Planned Parenthood facility is. In a nearby strip mall anchored by King Soopers and at least a dozen stores, police asked people to shelter in place. As the shooting began, officers tried to clear the shopping center parking lot. Other Officers with guns could be seen hiding behind buildings.\nMeanwhile, some staff and possibly clients were seen leaving the scene and were taken to a nearby Veterans Administration building to speak with investigators.\nFor the latest updates, see below:\n---\nFriday 5:15 p.m.\nLt. Catherine Buckley states that officers do not yet have an identification of the suspect, and that the overall scene and circumstances could \"take days to process.\"\nWhen asked how many bystanders in the nearby King Soopers and other businesses had been rescued by law enforcement, Buckley had no numbers but said there were many instances of \"untold valor\" on the part of the officers involved.\nBuckley said during the press conference that a total of 11 people have been transported to UCHealth Memorial and Penrose hospitals to be treated following the shootings.\n5:07 p.m.: Colorado Springs Mayor John Suthers states at a press conference that the alleged shooter \"is in custody.\"\nThere is a \"huge crime scene\" to be covered, Suthers added, and officials have yet to determine the number of victims.\n4:54 p.m.: Police have detained a shooter at a Planned Parenthood building, according to Colorado Springs police.\nRadio traffic from police starting at 4:50 p.m.:\n* \"He's going to come out with his hands up.\"\n* \"He's standing up.\"\n* \"Can you confirm he has his hands clear?\"\n* \"He's facing down that hallway to the east, his shoulders down.\"\n* \"Bear, you can back up.\"\n* \"Bear, he is coming out.\"\n* \"We've got to take him out if he has any IED suspicion on him.\"\n* \"Are we in the way of the snipers?\"\n* \"Z-39, we have one suspect trained right now.\"\n* 4:52 p.m.: \"We have our suspect right now. He is alone and by himself.\"\nPolice then began to disperse throughout the building to search for improvised explosive devices.\n---\n3:17 p.m. UPDATE\nPolice confirm that officers and the suspect have exchanged gunfire inside the Planned Parenthood building.\nThe president of Planned Parenthood Vicki Cowart issues a statement: \"At this time, our concern is for the safety of our patients, staff and law enforcement.\"\n3:11 p.m. UPDATE\nPolicy report that the shooter is still active, and that all roads around the scene continue to be closed.\nWhite House officials announced that President Barack Obama has been notified about the situation in Colorado by Homeland Security Advisor Lisa Monaco and will be updated as necessary.\n3:03 p.m. UPDATE\nPenrose Hospital confirmed they have six victims of the shootings and Memorial confirmed they are handling three shooting victims.\n2:51 p.m. UPDATE\nOne person in scrubs and an employee of Planned Parenthood were just placed in police cars and taken to another staging area.\nThe man who was searching for his daughter began hopping up and down as soon as he saw his daughter being taken away in a police cars.\n“She’s all right,” the man said.\nThere was a moment this afternoon when a man walked up to the scene with a handgun strapped to his waist and ammunition vest around his chest. He appeared to be asking police if he could help. Officers told him to leave immediately because appearing at the scene while wearing firearms and that equipment was a bad idea.\n2:48 p.m. UPDATE\nJoan Motolinia said his sister Jennifer had an appointment at the Planned Parenthood today. He spoke with his sister on the phone about 1 p.m. She was hiding under a table and he heard gunshots before she hung up. He hasn’t heard from her since.\n2:38 p.m. UPDATE\nPolice are actively engaged with the shooter inside the Planned Parenthood facility and are receiving gunfire, Buckley said. When asked if the shooter has made any demands or had any communications besides firing at officers, she said “no.”\nPolice confirm that a fourth officer has been injured, and Buckley would not confirm how many civilians have been injured.\n2:17 p.m. UPDATE:\nColorado Springs police just tweeted that \"officers are encountering gunfire\" and the scene is still an active shooting.\n2:11 p.m. UPDATE\nAround 1:20 p.m., a man walked up Fillmore Street after parking at least one-quarter to a half-mile away.\nAs police officers and tactical units continued working at the scene, the man stood on the south side of Fillmore Street looking toward the Planned Parenthood building.\nAn officer pulled up and told the man, “You guys are in the line of fire.”\nThe man replied “my daughter’s in the line of fire. She works there.” He verified that she works at Planned Parenthood.\n“We’re trying to get her out,” the officer told the man, adding that the apparent shooter has “a high-powered rifle.”\n1:53 p.m. UPDATE\nPolice report that officers went to a Veterans Affairs clinic across the road from the shooting scene and warned patients and staff to stay away from windows. KKTV reports that Penrose Hospital, where injured were transported, is under a lockdown.\n1:43 p.m.\nPolice say they do not know the connection to Planned Parenthood, but that is where the 911 call came from. Police do not know the number of shooters, the containment of the shooters, or the number of victims. Police are not evacuating neighborhoods to the north of the scene, but they are asking residents to stay inside and to avoid the area. There are still people inside the nearby businesses, and police do not know if there are any hostage situations.\nBetween Colorado Springs Police Department, El Paso Sheriff's Office and State Patrol, \"we are using all of our resources,\" said spokeswoman and Lt. Catherine Buckley. Officers do not know the type of weapon involved, except there is a rifle involved.\n1:34 p.m.:\nThe shooting situation remains active and the shooter is not contained. Colorado Springs police says there is no connection to Planned Parenthood and shooting victims are getting treatment.\n1:28 p.m.:\nCSPD tweeted that three officers are injured and unknown civilians are injured. Police say the situation remains unstable and to avoid the area.\n1:01 p.m.:\nOne of the victims being loaded onto an ambulance yelled.\n12:54 p.m.:\nAt least three officers are injured, as well as multiple others. There are no estimates of the number injured or whether there are fatalities.\nThe shooter is “contained,” according to Lt. Kirk Wilson, a Colorado Springs police spokesman. Officers are working to “extricate” an officer who is at the scene, but police could not immediately reach him.\n12:52 p.m.:\nAt least three officers have been hurt, according to a police commander on the scene.\n12:47 p.m.:\nTwo patients were just transferred from a black tactical vehicle into waiting ambulance.\n12:47 p.m.:\nA tactical team is positioned near the Chase Bank on Centennial Boulevard.\n12:45 p.m.:\nPolice are communicating by cell phone with three people trapped in a bathroom closet inside Planned Parenthood.\n12:43 p.m.:\nDenise Speller, manager at a nearby haircut salon, said she heard roughly 10-20 gunshots in the span of less than five minutes. She said she saw a police cruiser and two officers outside near Chase Bank, not far from the Planned Parenthood facility. One of the officers appeared to fall to the ground and the other office knelt down to render aid, then tried to get the officer to safety behind the car, she said. Another officer told Speller to seek shelter inside the building.\n“We’re still pretty freaked out,” Speller said by phone. “We can’t stop shaking. For now we’re stuck back here not knowing.”\n12:38 p.m.:\nThe Mobile Command Center of the Colorado Springs Police and the Tactical Rescue unit from the El Paso County Sheriff's Office both are on scene. One officer asked colleagues to move because \"we are in the line of fire.\"\n12:36 p.m.:\nColorado Springs Police report that Centennial Boulevard is closed in both directions between Garden of the Gods Road and Fillmore Street.\n12:31 p.m.:\nScanner traffic indicated at least two officers were down, one near a dumpster, and another taken by ambulance to a hospital. A dispatcher said one wounded patient was reported to be located outside Elite Vision, which is in an adjacent building at 3470 Centennial Blvd. A later dispatch said at four were injured and an officer was heard requesting an ambulance. Another officer indicated wounded patients were being taken to Penrose Hospital, 2222 N. Nevada Ave.\nAt least one victim was taken by stretcher to an ambulance shortly after noon.\nThree police officers with guns drawn were pointing their weapons in the vicinity of Planned Parenthood.\nOne officer said on his radio that the gunman shot out the back window of his cruiser as the officer tried to \"get a look at him.\" A dispatcher said the gunman wore a long coat with a \"hunting-type\" hat.\nPolice closed Centennial Boulevard in both directions and customers were locked down at a King Soopers grocery store and several nearby shops at Fillmore Street and Centennial Boulevard.\n-\nContact Stephen Hobbs: 636-0275\nTwitter @bystephenhobbs\n#COSshooting Tweets\nGo to previous photo Go to next photo ×\nShare this photo\n0 Buy This Photo"}