{"uri": "http://www.ledger-enquirer.com/news/local/crime/article40739076.html", "title": "LaGrange man charged in mass shooting at Greenville club", "dct": "Wed, 21 Oct 2015 16:14:00 GMT", "id": "0743071052f41f6d11581f842ff17783", "content": "A 22-year-old LaGrange man has been charged in the Sept. 27 mass shooting of 10 people at Club CJ’s in Greenville, the Meriwether County Sheriff’s Office said today.\nTommie Thornton was taken into custody at 1 p.m. Oct. 12 at a Habersham Drive residence. He was transported to the Meriwether County Jail where he was charged with nine counts of aggravated assault and possession of a firearm during the commission of a crime. He is held without bond on the charges.\nMorris is accused in 2:56 a.m. shooting at 1140 Hill Haven Road. The name of the club is now listed as the Hill Haven Event Center.\nThe sheriff office was called to the club to check on numerous patrons being shot. At the scene, deputies discovered that 10 people had been shot.\n“Through the course of our investigation, we tracked down numerous leads and interviewed a substantial number of victims and witnesses related to this incident,” Sheriff Chuck Smith said in a release. “We also obtained some of the results back from the GBI Crime Lab related to the physical evidence that was found at the scene.”\nInvestigators also were able to locate evidence in Troup County that helped to identify a suspect. The sheriff office was assisted by GBI Crime Unit, LaGrange Police Department and Troup County Sheriff’s Office deputies on the night of the shooting.\nThornton’s arrest stems from a traffic stop that was conducted on a suspect vehicle during the investigation. Thornton was one of the occupants in a stopped vehicle.\nUsing additional leads developed by the LaGrange police, investigators were able to identify witnesses and suspects in the shooting. They learned that most of the victims and potential suspects were from the LaGrange area.\nSmith said many of the individuals were known to police units.\nMore arrests and charges are possible in the shooting, the sheriff said. “Our investigators have certainly stepped up in tracking down these leads, often times dealing with reluctant or uncooperative victims and witnesses,” Smith said. “This investigation will reveal the results of this dedication of service. I appreciate all agencies working collaboratively in this investigation to apprehend those responsible. This is an on-going investigation, more will follow.”"}