{"uri": "http://www.wthr.com/story/24949077/2014/03/11/juvenile-killed-in-greensburg-shooting", "title": "Greensburg Police: Boy, 6, fatally shot 13-year-old brother", "dct": "Wed, 12 Mar 2014 01:51:00 GMT", "id": "317cf94317629004fffdbe7b9e3a57ca", "content": "Greensburg Police officials confirm that a 13-year-old boy was accidentally shot at home Tuesday night by his six-year-old sibling.\nThe six-year-old picked up a gun being cleaned by his father at their N. Carver St. home in Greensburg around 5:30 pm.\nCraig Roberts' stepfather was cleaning the gun as his wife prepared to attend an Honor Society program for Craig at Greensburg Junior High School.\nHis mother reportedly called the stepfather out of the room and he left the gun on the table. Police say that's when Craig's brother picked up the gun, pointed it at the 13-year-old and accidentally shot him.\nEyewitness News has learned that the same gun was pointed at Craig Roberts' sister by the six-year-old through a window at home prior to the fatal shooting.\nCraig Roberts' stepfather had just purchased the gun the week before the shooting.\nDetectives spent Wednesday morning and early afternoon interviewing family members who witnessed the shooting.\nGreensburg Police will await final autopsy results scheduled for this week before closing the investigation.\nThe case will be presented to the prosecutor who will decide if the case warrants neglect charges against the stepfather.\nIn the meantime, Greensburg police officers are warning parents who have guns in the house to make sure they are in gunlock cases with ammunition kept safely away.\n\"I don't like guns in a house anyhow, 'cause kids are gonna get 'em, but what are you gonna do? I feel bad for the little kid, my grandson went to school with him,\" said neighbor Connie Riley.\nGreensburg Junior High School Principal Matt Clifford tells Eyewitness News that the entire community is mourning the loss.\n\"Craig was a bright and active young man with a great sense of humor. He was involved in our TV/media productions group, drama club, archery, choir, and a member of the National Junior Honor Society,\" Clifford wrote in an email to WTHR.\n\"This morning we rallied our team of counselors from the district, as well as brought in members of the local clergy. The goal from the outset was to have all of our resources on hand to give the students the support they need. We are grieving together, counseling each other, but through it all we want our students to know they are not alone. Our thoughts and prayers go out to Craig's family. He will be sorely missed.\""}