{"uri": "http://www.walb.com/story/31595356/douglas-family-wants-answers-in-shooting-death-of-18-year-old", "title": "Douglas family wants answers in shooting death of 18-year-old", "dct": "Wed, 30 Mar 2016 02:52:00 GMT", "id": "4792fbdfe41703fd6b8607b0c1370b64", "content": "DOUGLAS, GA (WALB) -\nDouglas city leaders come together Tuesday evening to talk about the safety of the city after a 14-year old girl was arrested for the shooting death of an 18-year old boy. The shooting victim's family is searching for answers.\n\"I don't know who done this, but he was a nice boy,” said Nicole Paulk, Victim’s Sister. “He was my brother. He was my pride and joy,\"\nThe Paulk Family is grieving the loss of 18-year-old Traveon Paulk. Police say Paulk was shot in the chest by a 14-year-old girl with a pistol in the 900 block of South Coffee avenue Monday night before 10:00 p.m.\n\"My momma just got through talking to him on the phone, on the phone,” said Paulk. “She told him to come home. He said he was alright.\"\nThe Douglas Police chief held a news conference to talk about the shooting. He says investigators are trying to figure out if the shooting was an accident.\n\"The original call dispatched from 911 was of an accidental shooting,” said Chief Gary Casteloes, Douglas Police Department.\nPolice say they're interviewing witnesses and that the 14-year-old could face additional charges.\n\"She knows more than what she's saying and she needs to really tell the truth so we can get to the bottom of this and get justice,” said Sylvia Lee, Aunt.\nFamily members are calling for the violence to stop.\n\"Somebody has to speak up in this community because we're tired of the killing,” said Francine Thornton, Relative.\n\"It just don't make no sense,” said Michael Paulk, Relative. “Put the guns down.\"\nThey're also hoping the community will come forward with answers.\n\"Just please come and tell us because my mama ain't gone be able to sleep, but I know she got justice,” said Paulk.\n\"She cannot never get her child back and it's sad,” said Lee.\nThe 14-year-old girl is currently in the Regional Youth Detention Center in Waycross charged with Involuntary Manslaughter.\nAnyone with any information on the shooting can find the Douglas Police Department's anonymous tip line at 912-260-3600."}