{"uri": "http://www.tri-cityherald.com/news/local/crime/article32141907.html", "title": "Victims of shooting near Yakima hookah lounge not cooperating, police say", "dct": "Tue, 17 Sep 2013 11:40:00 GMT", "id": "3138886688195e2d83da901929b62aa8", "content": "Yakima police said Monday that their search for suspects in the weekend shooting of six people is stymied by a lack of cooperation from victims.\nPolice are using footage collected by security cameras at Aladdin's Hookah Lounge to piece together what happened, but little information has come forward from the victims, who were shot in the parking lot of the business about 2:30 a.m. Sunday.\n\"With relative certainty, among these victims, somebody knows that car or who was in that car, but they're not sharing that with us,\" Yakima Police Capt. Rod Light said Monday morning. \"That makes it very, very difficult.\nFive of the six people shot were treated and released from Yakima Valley Memorial Hospital on Sunday. Their ages ranged from 20 to 27.\nBut 31-year-old Anthony D. Bradley is now at Seattle's Harborview Medical Center being treated for two gunshot wounds to the back. He underwent two surgeries Sunday and a third Monday, but remains in critical condition, Light said.\nLight couldn't confirm whether any of the victims are gang members, but said some had a documented past of gang affiliations. Comments by victims and witnesses in the immediate aftermath of the shooting lead police to believe the shooting is gang-related, Light said.\n\"We're certainly concerned about retaliatory shootings,\" Light said. \"We're working to put together intel that would provide us information to short-circuit something like that from happening.\"\nSo far police have only confirmed that the vehicle involved in the shooting was a small, dark-colored sedan, Light said. Police are also following up on rumors that the shooting may have stemmed from an incident at another establishment earlier Saturday night.\nOn Monday, Yakima police Chief Dominic Rizzi said he has heard little public outcry as a result of the incident, but that incidents such as what happened Sunday can't go unresolved.\n\"There should be public outcry,\" Rizzi said. \"It's something that should not happen.\""}