{"uri": "http://www.paysonroundup.com/news/2014/jun/06/babys-death-probed/", "title": "Baby’S Death Probed", "dct": "Fri, 06 Jun 2014 00:00:00 GMT", "id": "400e8c2fce405ddbd598d9f1ac4174bd", "content": "Advertisement\nA week after the tragic shooting of a toddler by his 3-year-old brother, new details of the chain of events that shattered a family and shocked a community have come to light.\nPolice took nine weapons out of the Pinecrest apartment, including the semi-automatic handgun the 3-year-old used to accidentally shoot his 18-month-old brother Matthias.\nOfficers also took into evidence a rifle, six other handguns and a BB gun.\nThe boys slipped into a bedroom of Allen Duncan Haley’s apartment on the afternoon of May 27 while their mother Jessica got a box of food from Haley, 77, according to police.\nThe boys reportedly found a handgun and just as Jessica entered the room, the gun went off, killing Matthias.\nThe Payson Police Department will likely turn the investigation over to the Gila County Attorney’s Office. Prosecutors will decide on whether to file any charges.\nMatthias’ family said they are devastated to have lost their “little angel,” but thanked the community for their support and prayers.\nJessica’s aunt Sherry said the family is doing the best they can. About 50 family members came to Payson after the shooting to offer their support.\nJessica’s 3-year-old son appears to have no idea what is going on.\n“It is just an absolute travesty,” Sherry said.\nJessica, who lives in the apartment complex, which her mother manages, had visited Haley regularly for at least the past two years, Sherry said.\nJessica never saw a gun there or even thought about a gun, she said.\nHaley had interacted with police regarding his weapons several times though, according to police records the Roundup received.\nIn May of 2008, a woman, who then lived in the Pinecrest Apartments, called police after Haley reportedly threatened her. The woman told officers Haley called her and told her “as a licensed gun owner in Arizona he can shoot at her from 6-8 feet away if she even looks at him funny,” according to a police report.\nAn officer told the woman to get a harassment injunction against Haley from the court.\nIn March of 2011, another Pinecrest tenant called police after Haley reportedly shoved her.\nThe woman suspected Haley had shot her cat with a BB gun because her cat was limping and another neighbor had reportedly seen Haley with a BB gun.\nWhen the woman asked Haley not to shoot her cat, Haley reportedly exited his apartment and shoved the woman with both hands.\nWhen police arrived and asked Haley if he had any guns, he said ‘yes.’\n“Allen stated that there were (guns in the apartment) and that he was in the process of re-loading one of his weapons as he does every day,” an officer said.\nHaley said he shoved the woman because he was angry she had accused him of doing something he had not done.\nPolice arrested Haley on an assault charge.\nMost recently, a woman suspected Haley was the victim.\nThe woman, another Pinecrest resident, was concerned when Haley purchased a nine-person van last year. Since Haley has no family in the area, cannot drive and has poor vision, the woman wondered why Haley had bought the van and wondered if it was elder abuse on the part of the dealership to sell him a van, according to a police report. She told officers Haley appears to have dementia.\nThe apartment manager, who said she has power of attorney for Haley, told police Haley appears to have undiagnosed Alzheimer’s.\nNo charges ever came out of that case.\nHaley has not been charged in the recent shooting. Police have ruled it accidental.\nThere have been two other accidental shootings in Payson in the past three years.\nOne occurred in 2012 at the Ponderosa Campground when a bullet directed at a bear that had attacked a camper hit a woman.\nLast June, a gun shop owner inadvertently shot himself in the leg while checking out a handgun."}