{"uri": "http://www.11alive.com/news/local/midtown/high-powered-atlanta-couple-involved-in-fatal-shooting-/326907335", "title": "High-powered Atlanta couple involved in fatal shooting", "dct": "Wed, 28 Sep 2016 00:00:00 GMT", "id": "b0ddd0638ac5f2f7c82287a6775b5e28", "content": "ATLANTA - Atlanta Police are investigating the circumstances surrounding the death of a prominent Atlanta business woman. Diane McIver was shot inside a a car that she was riding in with other people, including her husband, a few blocks from Piedmont Park.\nMcIver is the President of Corey Airport Services, a company that provides advertising in Airports in the U.S. Her husband, Claude \"Tex\" McIver confirmed to 11Alive News his wife had passed, but declined further comment.\nAtlanta Police are releasing few details about the circumstances surrounding the Sunday night shooting. \"What we know is that Ms. McIver was riding in a car with people she knew near 1073 Piedmont Ave. A firearm was discharged inside the vehicle,\" a spokesperson for Atlanta Police told 11Alive News.\nThe police incident report obtained by 11Alive News said McIver was in the passenger seat at the time of the shooting. McIver was driven to Emory hospital. She died during surgery at 12:49 am.\nWhen police arrived, they found the vehicle in the parking deck of the hospital. \"The driver was also identified and interviewed about the circumstances of the shooting,\" the report states.\nTex McIver is an attorney with the law firm of Fisher and Phillips. He is on the advisory committee of the American Bar Association's Standing Committee on Gun Violence.\nThe firm released a statement: Our deepest condolences go out to Tex and his family. This is an unthinkable tragedy for a wonderful couple, both of them distinguished members of the Atlanta business community. Diane McIver was a wonderful wife and a successful executive who will be greatly missed by everyone whose life she touched. Tex McIver is a respected law partner with deep community ties. Our thoughts and prayers are with him.\nAtlanta police continue their investigation into the circumstances surrounding the fatal shooting."}