{"uri": "http://www.nwculaw.edu/pdf/Linda_drive-by_shooting_death_Appeal-Democrat.pdf", "title": "Microsoft Word - Document11", "dct": "NODATE", "id": "48db11f0a53527a8142e1b3de43aeafd", "content": "Not-guilty plea in Linda drive-by shooting death By Ryan McCarthy/ADrmccarthy | A man charged with murder in a drive-by shooting death in Linda on Super Bowl Sunday was appointed the chief public defender to represent him and pleaded not guilty on Monday in Yuba County Superior Court. A March 1 preliminary hearing is set for Kong Meng Vue, 25, of Linda. Attorney Brian J. Davis is representing him. Witnesses said a dark-colored sedan pulled in front of the home on Feb. 3 and that shots were fired from the car, according to a statement of probable cause filed in court. A witness identified Vue firing a gun from the vehicle, according to a statement by law enforcement. Teng Yang, 20, was killed in the driveway of his home in the 5800 block of Poplar Avenue. The murder was to further activities of a criminal street gang, according to the charges filed against Vue. Davis said in court Monday that Vue and his family considered hiring a private attorney, but have not done so. Davis said a Hmong interpreter will be needed at the preliminary hearing. Vue, who appeared in court wearing an orange jail jumpsuit, is being held in Yuba County Jail without bail. Yuba County prosecutors have said they will not seek the death penalty against Vue, who is charged with first-degree murder, shooting at an inhabited dwelling and criminal street gang participation, along with numerous special allegations and circumstances. He faces life in prison without parole if convicted. Vue on Friday made his first appearance in Yuba County Superior Court, but did not then enter a plea. He asked Judge Julia L. Scrogin for time to hire a private attorney. Prosecutors asked for time to redact witness names from court documents and reports from the Yuba County Sheriff's Department. Kong Meng Vue used a .9mm semi-automatic handgun, according to law enforcement. He was arrested Wednesday when leaving his brother's home in Linda. Sheriff's deputies obtained a search warrant for the home of Kong Meng Vue's brother, Tong Vue, and seized numerous firearms, which Tong Vue, an ex-felon, was not allowed to have, Undersheriff Jerry Read has said. CONTACT Ryan McCarthy at rmccarthy@appealdemocrat.com or 749-4780. Find him on Facebook at /ADrmccarthy or on Twitter at @ADrmccarthy. Â"}