{"uri": "http://www.abc12.com/home/headlines/Multiple-people-shot-during-violent-holiday-weekend-304862191.html", "title": "Multiple people shot during violent holiday weekend", "dct": "Sun, 24 May 2015 16:45:00 GMT", "id": "af27a6fa1997138ac0d20788b200d0cf", "content": "FLINT (WJRT) - (05/24/15) - It has been an extremely violent weekend in the city of Flint.\nOvernight, police tell us nine people were shot, including seven in just one location.\nThat's not to mention the two murders police are still investigating from Wednesday and Friday.\nFlint Police and the Michigan State Police report seven people were shot in the parking lot of Southwestern Academy. The school is off of W. 12th Street near Hammerberg Road.\nPolice tell us an argument between two people at a social gathering lead to the shooting around 2:30 a.m. Sunday. None of the shootings were deadly. Police tell us one adult man has been arrested, and a judge could formally charge him on Tuesday.\nIt's important to note the location of the gathering had nothing to do with the school. It appears to be random.\nThen, about two hours later, a man was shot near Industrial Avenue and E. Pasadena Avenue. Police say that shooting was also non-deadly, although the victim was in critical condition.\nThat brings us to the night's first shooting.\nIt happened just outside the Brothers' Party Store on Saginaw around 10 p.m. The victim suffered non-life threatening injuries.\nThe violence started to unfold Wednesday, when a woman was found hanged in the 2800 block of Branch Road.\nThe case was originally thought to be a suicide, but police have since determined 24-year-old Kayla Ann MacGregor was murdered. Police have since arrested a man in MacGregor's case.\nThen on Friday, three people were shot at Atherton East Apartments. James Doshie Jr. later died from his injuries, while the two other people remain hospitalized.\nIf you have any information that could help police, you can remain anonymous by calling Crime Stoppers at 1-800-SPEAK-UP.\nConsidering these shootings started just hours after DeWaun Robinson's Stop the Violence rally promoted peace in the city of Flint, Friday, you might think it would be discouraging.\nHowever, Robinson says his rally is just one part of fighting back against the violence. Another part is getting into the neighborhoods, meeting the people behind it face-to-face.\n\"It lets you know that there's more work to do,\" Robinson said. \"(It might) be beneficial for them if you came into those areas and get an understanding of what they're dealing with to come up with a solution.\"\nKayamone Sutton's organization called Stop the Violence: Community Take Back Rally, meets regularly at the Berston Fieldhouse and aims to hit the problem early on.\n\"We are focusing directly on the youth. We want to show them there are things to participate in, try to keep them off the streets, get engaged in,\" he said.\nHow appropriate then that two non-profits, the People's Promotion and DREAMS Incorporated, held a field day at Berston, Sunday afternoon, where all kids had to do was be themselves.\n\"Some of these kids are being forced to grow up too early,\" said DREAMS, Inc. Founder Royce Stephens. \"Events like this, we're really emphasizing games, these child games, games we played growing up.\"\nA little positivity that will hopefully make a lasting difference. It's something Bertha Moore says she'll be practicing with her own daughter.\n\"Say, 'this might be your foundation, but you can definitely pursue a career, you don't have to engage into that violence,'\" she said."}