{"uri": "http://www.valleybreeze.com/2016-06-01/woonsocket-north-smithfield/woonsocket-man-gets-55-years-robberies-shooting-outside-alys#.V1NroOQYEk7", "title": "Woonsocket man gets 55 years for robberies, shooting outside Aly's", "dct": "Wed, 01 Jun 2016 00:00:00 GMT", "id": "6522b6f3eefd65a16949e95656015692", "content": "PROVIDENCE – Zackary Alvarado, age 20, of 285 Main St., Woonsocket, was sentenced Wednesday to 55 years with 35 years to serve in prison and the remainder suspended with probation.\nAlvarado will be eligible for parole in 10 to 15 years. If he violates conditions of his probation, he would serve the rest of his sentence without the chance for parole, according to the Office of the Attorney General (these two sentences correct information previously included from the AG's office making it appear that Alvarado would not be eligible for parole for the duration of his sentence).\nSuperior Court Justice Robert Krause sentenced Alvarado for multiple robberies and assaults that took place over a four-month period in 2015 that culminated with Alvarado shooting four people outside Aly’s Riverside Pub in Woonsocket on June 19, 2015. Alvarado had pleaded guilty Judge Krause on March 23.\nHad the case proceeded to trial, prosecutors say they were prepared to prove that Alvarado robbed at gunpoint the Metro PCS store on Main Street in Woonsocket three times in March and April of last year. During the April 27 robbery, he fired the weapon into the air. On June 13, 2015, the defendant robbed at gunpoint the Metro PCS stor on Social Street in Woonsocket. During the robbery, the defendant fired the gun into the front desk of the store.\nIn the very early hours of June 19, 2015, Alvarado, armed with a .22 caliber Luger, shot four people who were gathered outside Aly’s in a parking lot on River Street.\nAlvarado then fled the scene. He turned himself over to the Woonsocket Police later that day, and had been held without bail since his arrest.\nShell casings from the scene on River Street matched the shell casings from two of the Metro PCS robberies. Victims of the robberies also identified the defendant.\n“Armed with an illegal firearm, Zachary Alvarado was a one-man crime spree who wrought havoc through the city of Woonsocket,” said Attorney Gen. Peter Kilmartin. “Today’s sentence sends a strong message that gun violence in our communities will be met with stiff criminal penalties.”\nWoonsocket Police Detectives Kevin Sanford and Thomas Gormley investigated the case and Special Assistant Attorneys General Peter Roklan and Joseph McBurney prosecuted the case on behalf of the Office of Attorney General."}