{"uri": "http://www.nola.com/crime/index.ssf/2016/09/6_wounded_by_gunfire_in_centra.html#incart_river_index", "title": "1 shot in head among 6 wounded in Sunday's Central City incident: NOPD", "dct": "Mon, 12 Sep 2016 11:21:00 GMT", "id": "15452a1017271056cdd56d4e48389454", "content": "New Orleans police confirmed six people were wounded -- one shot in the head -- during a shooting Sunday night (Sept. 11) in Central City. The victim count is the highest for a single shooting so far this year, Superintendent Michael Harrison said.\nThe wounded are five men - ages 63, 60, 35, 23 and 23 - and a 30-year-old woman. One of the six victims was struck in the head, NOPD spokesman Tyler Gamble said Monday. The other five received what Gamble called \"non-life-threatening injuries.\"\nHarrison said detectives believe the gunfire was possibly meant for two people. NOPD also said at least some of the wounded were bystanders.\nReports differed Sunday night as to whether five or six people had been shot, after police initially issued an alert about 8:30 p.m. saying that the shooting had left three people wounded. NOPD spokeswoman Dawne Massey gave an update an hour later that stated police had revised the number of people shot from three victims to as many as possibly six.\nRoughly half of the victims were taken by private vehicles to different area hospitals, Gamble said.\nAt the scene of the shooting Sunday night, officers had placed dozens of evidence markers at the intersection of South Claiborne Avenue and First Street, where shell casings lay scattered outside a convenience store called South Claiborne Market. Witnesses standing in the neutral ground along South Claiborne said they heard around 20 shots.\nOne man, who asked not to be identified, said he saw the shooter park a truck near the market, exit the vehicle and \"peek around the corner to see if he was there.\" The man said the shooter then opened fire at someone who was halfway down the block near an apartment complex.\nThe man said bystanders were also struck, including one person in a wheelchair. The shooter fled in the truck, he said.\nThe block where the apartment complex sits was the scene of at least one other shooting, when two men were shot in April 2015.\nInvestigators are searching for surveillance video and witnesses, and are probing whether Sunday night's shooting is related to other incidents in the area.\nEight people were shot to death and at least 22 were wounded in shootings and stabbings in metro New Orleans in the week that ended Sunday, Sept. 11."}