{"uri": "http://www.miamiherald.com/news/local/crime/article103212767.html", "title": "The toll of 4 shootings in 4 days: Marine killed, child and 7 teens injured", "dct": "Wed, 21 Sep 2016 14:36:00 GMT", "id": "98427625bd4700cde04282e42616ad82", "content": "A wave of gunfire since Saturday throughout Miami-Dade County has left a U.S. Marine dead and a child and seven teenagers recovering from bullet wounds.\nIn all, two people were killed and eight others shot in a violent burst during four incidents that began Saturday night at a South Miami-Dade birthday party for a 16-year-old girl.\nPolice believe they’ve identified the shooters in three of the crimes. During a tense town hall meeting Tuesday night to address the gun violence in South Miami-Dade, police brass gave thanks to the community for coming forward.\nThat’s when Miami-Dade Police Maj. Samuel Bronson, after referring to the shooters as “gun-toting wannabe gangsters,” warned that “I’m charged with this area.”\nThe shootings began shortly before 10 Saturday night as about 75 teens and some children were gathered at Tameka Smith’s South Miami-Dade home at 20582 SW 119th Ave. They were celebrating her daughter’s Sweet 16.\nWhile Smith cooked in the kitchen and many of the kids gathered in front of the home, an SUV pulled up. That was followed by dozens of rounds of gunfire. Remarkably, the 12-year-old child and five teens who were struck are expected to survive, according to police.\nOne of the victims: Smith’s 13-year-old son, who was shot six times.\n“It was so many babies out here just on the ground,” Smith told Miami Herald news partner CBS4. “The blood is still on the corner out on the sidewalk.”\nMiami-Dade Fire Rescue took four victims to Jackson South Hospital. Another was transported to Baptist Hospital, and one more was airlifted to Kendall Regional Hospital. Shot were Cornell Dunn, 12; Anthony Elison, 13; Jaquwaivyon Mattes, 14; Fabian McIntryre, 15; Kondrea Wilson, 16; and DeAndre Foster, 17.\nBy Tuesday night, just before the town hall event, police announced the capture of three men they believe were responsible for the shooting. When Miami-Dade Police Director Juan Perez announced it to the crowd, people erupted in applause.\n“We had no idea who was responsible until this great community broke the silence,” Bronson said.\nAccording to police, Michael Melton, Travonta Berry and Dontavis Byrd, all 18, pulled up to the house in an SUV and got out of the car. At one point, witnesses said, Melton confronted one of the teens at the party.\n“Are we gonna fight or shoot it out?’ Melton asked, according to the witness.\nWhen the teen attending the party walked away, the three got back into the SUV and opened fire on the crowd. Police haven’t said why. All three were arrested and charged with premeditated attempted murder and displaying and firing a firearm.\nJust over 24 hours later, at about midnight on Sunday, a U.S. Marine, his wife and daughter had just left a family gathering in Miami Gardens and were inside their car when, police said, 18-year-old Demetrius Williams appeared with a gun and demanded the vehicle.\nThree people jumped out and Williams climbed into the front seat. But Guillermo Comme, 27 — who had served two tours in Iraq and one in Afghanistan — stayed in the backseat and fought with Williams.\nComme was shot dead. Then Williams turned to fire on one of Comme’s relatives but was shot before he could unload. Williams stumbled a few blocks, then collapsed. He died a day later.\n“He came back [from the wars], and we somehow managed to tragically lose him here when he was with his family and friends,” said Comme’s wife, Laura Comme.\nThen Tuesday, two more teens were shot.\nFirst, just after 6 p.m., a man in a white Mercedes drove up to Brownsville Middle School student Cedrick Pernell, 13, at Northwest 47th Street and 24th Avenue and opened fire. Pernell was shot in the neck and transported to Jackson Memorial Hospital in stable condition. Police didn’t release a motive.\nWithin a couple of hours, police had a man and a teen in custody that they said were responsible for Pernell’s shooting. Police said they spotted the Mercedes at Northwest 56th Street and Seventh Avenue and that driver Eric Williams-Bell, 19, had refused to pull over. After a brief chase, Williams-Bell lost control of the car and it crashed.\nWilliams-Bell was charged with first-degree attempted murder and fleeing a police officer and was refused bond. Two teens in the car were also apprehended, police said. They were both charged with resisting arrest without violence.\nFinally, three hours later, an 18-year-old was shot at Northwest 57th Street and Sixth Avenue, about two blocks from where Williams-Bell crashed the Mercedes. His name hasn’t been released by Wednesday, and his shooter remained free. Police said he was in critical condition at Jackson Memorial.\nTangela Sears, a community activist who runs the organization Parents of Murdered Children, said that unlike past years, the recent shootings that have wracked the county don’t seem to be over drug holes or weapons. She said it just seems like kids are much quicker to take issue others moving into their neighborhoods or flirting with their girlfriends.\nAnd the results, too often, are deadly.\n“Every week, we’re trying to figure out what caused another shooting,” Sears said. “How are they able to go in and out of jail. It’s a revolving door in this community. You’ve got to enforce the laws out on those streets. There’s no fear. It’s a game to the people out there. They don’t care.”"}