{"uri": "http://www.local10.com/news/enough-is-enough-mothers-plead-for-information-about-6-teens-shot-at-house-party", "title": "Police credit community in arrest of 3 men believed to be involved in shooting of 6 teens", "dct": "Tue, 20 Sep 2016 19:03:00 GMT", "id": "f9b4c2a2883099fb0be870a710f8cb1b", "content": "MIAMI-DADE COUNTY, Fla. - News of the arrest of three men in connection to a shooting over the weekend that left six teenagers injured was met with applause Tuesday night during a community meeting.\n\"All three gentlemen involved are in custody right now,\" Miami-Dade police Director Juan Perez said.\n6 teens shot at party in southwest Miami-Dade\nAs Perez made his announcement, a team of detectives who helped find and arrest Travonta Berry, 20, Dontavis Byrd, 18, and Michael Melton, 18, stood behind him. All three men were arrested on charges of attempted murder.\n\"We had no idea who was responsible,\" Maj. Samuel Bronson said. \"We didn't know what direction to go in. It was until this great community broke the silence.\"\nThe shooting was reported shortly after 10:30 p.m. at a home near Southwest 205th Street and Southwest 119th Avenue.\nAn altercation broke out and resulted in a shooting that left six teens injured.\nFour people were taken to Jackson South Community Hospital, one was taken to Baptist Hospital and one was airlifted to Kendall Regional Medical Center.\nMiami-Dade County Public Schools Superintendent Alberto Carvalho said the victims ranged in age from 13 to 17 years old.\n\"We are going to turn the page. We're going to turn the page with your help,\" Perez said.\nTuesday's town hall meeting gave residents the chance to address police, and each other, about gun violence.\nDuring the conversation, portraits of 72 victims of gun violence were displayed.\n\"Everybody knows the root of all things: money, guns, drugs from the kids to the elders,\" a resident said. \"If you see something, do something, Shut them down.\"\nThe most impassioned moment of the night came from a major tasked with overseeing a part of the county that has been torn apart by bullets.\n\"Let me serve notice, on all of you gun-toting, want-to-be gangsters,\" he said. \"I've been charged with this area. I may not stop what you do, but we will (show) you as weak if you bring that nonsense to the South District.\"\nHours before the arrests were made, three mothers of shooting victims, unrelated to this case, pleaded for anyone with information to come forward.\n\"We are tired of hearing, seeing these moms cry,\" Romania Dukes said. \"It goes on and on and on. Enough is enough.\"\nDukes was 10 steps away from her son when he died two years ago after being struck by a stray bullet.\nJoann Rich Brady and Tracey Brown have experienced it too – having their children taken too soon, and waiting for justice.\nThe trio have T-shirts that they say they can touch and wear to keep their sons close.\nThey’ve also started a group called Mothers Fighting for Justice and are joining together to help the families of six young people who were shot at a house party over the weekend.\n\"Sometimes when you can just put your arm around them and feel that love and that strength and that's what you draw from each other,\" Dukes said.\nCopyright 2016 by WPLG Local10.com - All rights reserved."}