{"uri": "http://www.khou.com/story/news/crime/2015/07/20/teen-shot-killed-during-party-in-fresno/30417337/", "title": "Teen shot, killed during party in Fresno", "dct": "Mon, 20 Jul 2015 00:00:00 GMT", "id": "91b16fd11689b932babb4342be361c41", "content": "FRESNO, Texas – A $5,000 reward is being offered for the gunmen who shot and killed a teen at a party in Fresno early Monday.\nHarry LaRose, 18, was pronounced dead after he was rushed to Pearland Medical Center.\n\"He was a good boy, not sassy, did good in school,\" LaRose's father said as he choked back tears. \"He did not pick a fight.\"\nFort Bend County investigators say LaRose and about 100 other people were at a party in the 1000 block of Cove Crest Trail.\nParty host, Alex January, said he invited about 30 friends over to celebrate because he was just picked up by Navarro Jr. College to play football.\n\"I don't even know the boy who was shot. I don't know the people who was shooting,\" January said.\nFort Bend County Sheriff's deputies said a DJ at the party tweeted about the gathering and that's when the party grew from 30 people to 100.\nJanuary told the uninvited guests, \"I don't know you all. You gotta leave.\"\nDeputies believe several young men got mad and fired about 10 shots into the crowd.\nOne of the bullets struck LaRose, a recent graduate of Thurgood Marshall High School.\n\"They was just trying to scare people. Some people were shooting in the air, some people were shooting at an angle,\" said Spencer Smith, a witness at the party.\nJanuary said he tried to revive LaRose, but couldn't. The young man died at Pearland Medical Center around 2 a.m. Monday.\nIn the meantime, neighborhood patrol captains at the Andover Farm Subdivision are planning a meeting Saturday at 7:30 p.m. at Splash Park to rally residents.\nBlock Captain, Felicia Parker Taylor, showed up right after the shooting and again later in the morning. Parker Taylor said, \"We need to keep others, people out of our community that are here to cause harm.\"\n\"I miss my son a whole lot. He was a good boy.\" said LaRose's dad.\nThe teen had started working at the Missouri City Whataburger during his senior year. According to the family, the restaurant is donating $4,000 to the LaRose family to assist with expenses.\nIf you know anything that could help detectives, contact Fort Bend Crime Stoppers at 281-342-8477. All calls to Crime Stoppers are anonymous."}