{"uri": "http://www.nola.com/crime/index.ssf/2015/11/at_least_10_victims_of_bunny_f.html#incart_river_index", "title": "17 people shot at New Orleans 9th Ward playground", "dct": "Mon, 23 Nov 2015 13:50:34 GMT", "id": "11330064123f4b0ae93bfbc9af868373", "content": "Seventeen people were injured Sunday night (Nov. 22) after gunfire erupted during a block party at Bunny Friend Park in the Upper 9th Ward, New Orleans Police Department officials said.\nEMS transported 10 victims to area hospitals, and another six arrived at emergency rooms through private conveyance. Monday morning NOPD said a 17th victim had been confirmed.\nSpeaking at the scene Sunday night, NOPD Superintendent Michael Harrison said he believed multiple people had fired into the crowd of more than 300. NOPD spokesman Tyler Gamble later confirmed that all victims are in stable condition.\n\"Detectives are still working to determine the extent of all of the victims' injuries,\" NOPD said in a news release. \"Information on the age and gender of all victims involved as well as the extent of their injuries will be provided when it is available.\"\nSeveral witnesses said the gathering was part of an after party for the Nine Times Social Aide & Pleasure Club's annual second line, which earlier in the day proceeded through the Desire and Florida Development neighborhoods before disbanding at Sampson Park in St. Roch. Harrison described the after-party as an \"unpermitted event.\"\n\"We staffed the second line pretty heavily,\" Harrison said. The NOPD later received word of an impromptu music video being shot inside the park, he said. The event must have \"circulated through social media,\" he added, \"because we got no report of it.\"\nOfficers were dispatched to the park to shut the gathering down, Harrison said. \"They were a block away when they heard gunshots and were flagged down\" from there. EMS appeared on the scene soon after, he said.\nOne witness, a nurse who declined to provide her name citing safety concerns, said two groups began shooting at each other around 6:15 p.m. \"It was like New Year's Eve all over again,\" she said.\nMultiple witnesses said they saw a man with a silver-colored machine gun fleeing the scene toward Louisa Street. They said the gunfire continued inside the park as the man ran away.\nAfter the shooting, witnesses described several gunshot victims lying in the middle of Gallier Street and Desire Street as EMS responders administered to them.\nJoseph Jordan was in a house across the street from the park with his friend, who gave her first name as Raven, when they heard gunshots. Later someone called Raven and told her that her niece had been shot. The two rushed to the hospital to check on the 14-year-old, who had been shot three times in the leg.\nSpeaking of the hospital, Jordan said: \"It's still crowded back there.\"\nMayor Mitch Landrieu joined Harrison during a press conference at the scene. He applauded the quick response of the NOPD and EMS.\n\"At the end of the day, it's really hard to police against a bunch of guys who decided to pull out guns and settle their disputes with 300 people in between them,\" Landrieu said. \"It's not something you can tolerate in the city.\"\nBoth Harrison and Landrieu said they hoped that witnesses inside the park would help the NOPD to identify the shooters.\n\"This is a classic case where we need citizen help,\" Harrison said. \"People know who did this. We need them to come forward and tell us so we can bring these people to justice.\"\nOTHER STORIES:\n- Gunfire erupted in after party for Nine Times club second line.\n- Social media posts from the scene, other residents.\nAnyone with information about the shooting is asked to call Crimestoppers at 822-1111 or toll-free 1-877-903-STOP.\nStaff Writer Emily Lane and the Associated Press contributed to this report. This story was updated Monday to add information from NOPD on a 17th victim."}