{"uri": "http://www.wwltv.com/story/news/crime/2015/11/22/several-shot-ninth-ward-playground/76237528/", "title": "17 now confirmed injured in Bunny Friend shooting", "dct": "Mon, 23 Nov 2015 00:00:00 GMT", "id": "768081286f3893075dcd4fc794991491", "content": "NEW ORLEANS - A gun battle broke out during the videotaping of an impromptu music video at a block party attended by an estimated 500 people at Bunny Friend playground Sunday, sending 17 people to the hospital with a variety of gunshot-related injuries.\nPolice said all of the victims were stable and all were suffering either from direct gunshot wounds or graze wounds. The suspects were able to get away.\nThe incident occurred around 6:15 p.m. Police said officers who were working an earlier second line a few blocks away were already headed to try to break up the block party, which they said was not properly permitted, when shots rang out.\n\"At the end of the day it's really hard to police against a bunch of guys who decide to pull out guns and settle disputes with 300 people between them,\" said Mayor Mitch Landrieu.\nIt was the second press conference of the day for Landrieu and Police Chief Michael Harrison, both of whom spoke earlier about the naming of a suspect in the shooting of a Tulane medical student on Friday. Both incidents come as the city is in the midst of a relatively peaceful period during October and November, at least in terms of fatal shootings.\nAmbulances streamed into and out of the park carrying 10 victims to University Medical Center. Police said another half dozen victims were taken to hospitals in private cars.\nJoseph Jordan was inside a house across the street from the park with his friend, who gave her first name as Raven, when they heard gunshots. Later someone called Raven and told her that her niece had been shot. The two rushed to the hospital to check on the 14-year-old, who had been shot three times in the leg.\nSpeaking of the hospital, Jordan said: \"It's still crowded back there.\"\nOutside University Medical Center, Kawandra Hayney said she had been driving about two or three blocks from the playground with her daughter when people ran by shooting. Her 14-year-old daughter was hit once in the knee and five times in her backside. Hayney pulled her daughter out of the truck and under it to hide, then into a nearby ditch.\n\"I saw the police coming, and I ran over to them,\" she said. She said she later counted seven bullet holes in her truck.\nDetectives are combing the neighborhood for any surveillance video of the incident and/or suspects. Anyone with video that they believe may be helpful to the investigation should contact the NOPD immediately.\nFifth District Detectives are in charge of the on-going investigation and can be contacted at 658-6050.\nCitizens with information that can help solve this crime are asked to call Crimestoppers at 822-1111."}