{"uri": "http://www.wlky.com/article/police-need-tips-in-case-of-15-year-old-fatally-shot-on-s-1st-street/8278535", "title": "Teenager shot and killed while heading home from community center", "dct": "Sat, 12 Nov 2016 04:38:00 GMT", "id": "07418d09f0b5672292ad74ad7d4dd8b3", "content": "LOUISVILLE, Ky. —\nA teenager was shot and killed while heading home from his local community center.\nA supervisor at the Beechmont Community Center said Le Truong was with friends at the facility until he left to go home. We are told that was around 6:30 p.m. on Thursday.\nPolice have yet to figure out what happened next.\nTruong was shot near the intersection of 1st Street and Tenny Avenue. He was found on the sidewalk with multiple gunshot wounds. Friends said the teen was on his bike.\nTruong was transported to University Hospital and pronounced dead just after 7 p.m.\nKevin Kinney, who works at the Beechmont Community Center, described Truong as a well-behaved, friendly teen.\n\"The kids really liked him. That was evident,\" Kinney said.\nOn Friday, he said the mood at the center was somber.\n\"We weren't thinking, as anybody would think, we weren't thinking it was our kids. You never think it's going to happen to people you know,\" Kinney said.\nKinney said he saw Truong on Thursday.\nThe 15-year-old, who recently began lifting weights, spent a lot of time at the community center.\n\"Le was kind of a quiet kid. You didn't really know that he was in the building a lot of the times because he never caused any trouble,\" Kinney said.\nKinney remembers seeing Truong just before the teen left to go home. He said the 15-year-old was wearing his signature smile.\n\"It was the last memory I have of him. He was outside and he brought in the basketball goals,\" Kinney said.\nKinney said he was heartbroken to learn the teen was shot a short time later. He expressed his condolences for Truong's loved ones.\n\"It's really a loss, you know, for the center, for his friends, and for his family,\" Kinney said.\nNews of the crime also shocked neighbors who live near the scene.\n\"This is a kid-friendly neighborhood, you know, so I think it hit us doubly hard,\" Janine Carr said.\nCarr's grandchildren played with Truong.\nShe said his murder is a wake-up call for the neighbors and city leaders.\n\"We have had a few isolated incidents, five years ago, eight years ago, but this is right at home,\" Carr said.\nCarr said police need to continue their efforts to combat violence in the area.\n\"The only thing I could suggest is just to stick with it,\" Carr said.\nOn Monday, there will be an emergency meeting at the Beechmont Community Center to discuss how to keep similar crimes from happening in the future. It begins at 7:30 p.m.\nPolice have yet to make an arrest in Truong's murder. But detectives said there were several reports of shots fired in the area.\nIf you have information that can help investigators, you can call 574-LMPD. The tip line is anonymous."}