{"uri": "http://www.wave3.com/story/33747394/teen-arrested-in-murder-of-15-year-old-iroquois-student", "title": "Teen arrested in murder of 15-year-old Iroquois HS student", "dct": "Fri, 18 Nov 2016 21:10:00 GMT", "id": "07c1145ee9fdd70c42a0fdc06e5ac25a", "content": "LOUISVILLE, KY (WAVE) - A week after a 15-year-old was gunned down in a church parking lot, another teen is charged with his murder.\nLe Truong, a Vietnamese student at Iroquois High School, was shot and killed outside a church in the 4900 block of S. First Street on Nov. 10. Thursday night not far from the homicide scene, off Southside Drive near Wabash Place, a suspect in the shooting was arrested.\n\"Le good son, her son is a good son,\" said Van Tran, a friend acting as an interpreter for Tsuy Truong, Le Truong's mother, told WAVE 3 News on Friday.\nPREVIOUS STORIES\n+ Tempers flare at community meeting following teen's death\n+ Neighbors frustrated about teen's murder after days of shootings\n+ Teen murder victim identified; search for suspects continues\nLe Truong didn't deserve to be shot in a church parking lot and left to die, Tsuy Truong said.\n\"She would like to see more police helping in the neighborhood,\" Van Tran said for the mother.\nPolice were in the neighborhood Thursday night when they arrested the 16-year-old suspect.\nNeighbors had described a car near the shooting scene, police later realized it matched the description of a car reported stolen. Thursday night Louisville Metro Police Department 4th Division officers spotted the vehicle with the 16-year-old boy and two adults inside.\n\"It was stolen prior to the homicide, that was the car that was used in the homicide,\" LMPD Lt. Emily McKinley said.\nPolice say the teen confessed.\n\"We recovered two weapons last night - a weapon that was in a car and a weapon at another location,\" McKinley told WAVE 3 News on Friday.\nMORE FROM WAVE3.COM\n+ Man dead in Worthington Hills shooting\n+ 1 dead, 1 wounded in Park Hill shooting\n+ Red-light runner accidents on the rise in Louisville\nPolice say Le and the teen suspect knew each other, but won't speculate on the motive.\n\"We think we have a younger generation that has a difficult time with forgiveness, tolerance and acceptance,\" McKinley said. \"I also think they have a difficult time with resolving whatever conflicts they have without resorting to violence and so those are the issues that our society today is facing.\"\nThe 16-year-old boy is charged with murder and receiving stolen property.\nPolice don't believe the two adults in the stolen car had any involvement in the murder, but they were also charged in the car theft.\nCopyright 2016 WAVE 3 News. All rights reserved."}