{"uri": "http://www.wave3.com/story/33683009/1-shot-in-louisvilles-southside-neighborhood", "title": "Teenage shooting victim in Southside neighborhood dies", "dct": "Fri, 11 Nov 2016 03:31:00 GMT", "id": "e4a65c6d467fe999dc92cf8af9a96c1f", "content": "LOUISVILLE, KY (WAVE) – Alone and left for dead in a church parking lot. That's how the life of a teenage boy ended.\nThe shooting was reported in the 4900 block of South First Street, near Tenny Avenue, around 6:30 p.m. Thursday, according to MetroSafe.\n\"I don't know what's going right now,\" a family friend of the victim said.\nShe said she got a call from the boy's frantic mother who was confused about what police were telling her.\n\"She said, 'uh, can you come? My son got shot, maybe he got died,'\" the friend said.\nIt was around 6 p.m. when shots rang through the neighborhood. Calls started flying to police. Officers found the teen still alive, but that quickly changed.\n\"I'm sure that majority of people are tired of turning on their televisions and seeing once again that we have another homicide that we have to deal with,\" LMPD spokeswoman Alicia Smiley said.\nThe crime scene spanned a few blocks. Officers used their flashlights while looking for casings.\nSeveral neighbors were too scared to go on camera, but they wanted to relay the message that they feel their neighborhood is being hijacked and is in need of help.\nMORE FROM WAVE3.COM\n+ Bicyclist left for dead after a crash on Dixie Highway\n+ Shively police looking for suspect in shooting on Lomond Drive\n+ Cop impersonator sentenced in gun beating incidents\n\"It's just a couple rotten apples kind of spoil it for everybody,\" a man who lives there said under anonymity.\nA few of the victim's friends said they heard the shots and walked to the scene wondering if it was one of their young friends. They were saddened to hear it was.\n\"We keep hearing this crazy stuff going on but it's not stopping, it keep on going,\" the man said.\nThe name of the victim has not been released.\nNo suspect information was immediately available.\nAnyone with information is asked to call the anonymous police tip line at (502) 574-LMPD.\nCopyright 2016 WAVE 3 News. All rights reserved."}