{"uri": "http://www.foxcarolina.com/story/31041301/dispatch-shooting-reported-in-anderson-co", "title": "Family: 9-year-old shooting victim shielded younger sister from gunfire", "dct": "Sun, 24 Jan 2016 04:16:00 GMT", "id": "3aff4f6f3d83e2f8c7ba87e0ae73101c", "content": "ANDERSON, SC (FOX Carolina) -\nThe family of a nine-year-old boy say he is a hero after using his body to cover his younger sister in a drive-by shooting.\nMeanwhile, the shooter remains at large.\nAnderson County deputies responded to on Crooked Creek Court around 11 p.m. Saturday\nLieutenant Sheila Cole said a nine-year-old boy was struck in the leg and transported to the hospital.\nThe boy's family said he was shot through both legs, breaking the bone in one leg.\nHis older brother and younger sister were in the room at the time.\nEven after being shot, family said the boy instructed his siblings to stay down and used his body to cover his sister until the gunfire stopped.\n“I know it's by God’s grace and mercy that my family is here today because the number of bullet holes in there… It’s like they were going to war with this house,\" Jacklen Lewis said.\nLewis has no idea why her son's home was the target of a drive-by shooting or why the shooter would put her three grandchildren's lives in danger.\nLewis said all the bullets hit the children's room - tearing through walls, toy bins and striking just inches from the bed.\nOne bullet hit her 9-year-old grandson.\n\"He is a hero,\" Lewis said.\nAfter warning his brother and sister to stay low - even shielding his sister - Lewis said he made his way across the house to get help.\n“Do you know that that little boy crawled to where his parents were and said, 'Mom and Dad, I’ve been shot.'”\nLewis says the parents heard the shots, but had no idea their house was the target until their son came to their bedroom.\nDetectives said they have no suspects in the case as of Monday afternoon and are investigating.\nBut Lewis said someone knows who they are, and they need to speak up before someone loses their life.\n“You’re cowards that’s what I say... Whatever happens in the darkness comes to the light and sooner or later you’re going to get caught,” Lewis said.\nThe family tells FOX Carolina that the boy remains in the hospital, but may come home soon.\nThe Anderson County Sheriff's Office asks anyone with information to call Crimestoppers at 1-888-CRIME-SC.\nCopyright 2016 FOX Carolina (Meredith Corporation). All rights reserved."}