{"uri": "http://www.wsbtv.com/news/local/henry-county-child-shot-in-the-head/452487930", "title": "18-month-old dies after being shot in McDonough home", "dct": "Sun, 02 Oct 2016 14:18:00 GMT", "id": "3c2f7d7080b0c9a65e006d9e94a04a08", "content": "18-month-old dies after being shot in McDonough home\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nHENRY COUNTY, Ga. - A McDonough family is grieving after an 18-month-old boy was shot and killed in their home Saturday afternoon. Investigators are still trying to find out who pulled the trigger.\nPolice say around 3 p.m., two brothers, ages 18 months and 3 years, were inside a bedroom with a couple of family members.\nOne of the adults set a loaded .45-caliber handgun down, police say.\nInvestigators say that's when one of the brothers picked up the gun and pulled the trigger. The 18-month-old brother was shot in the head.\n\"There were adults in the room at the time, but the adults were not paying attention to what was going on. They did not actually see the incident occur,\" Henry County police Lt. Mike Ireland said.\nThe family called 911 and tried to administer first aid. The child was pronounced dead at Piedmont Henry Hospital.\nInvestigators are working to determine if this was an accidental shooting by a 3-year-old or a self-inflicted shooting by the 18-month-old victim.\nPolice say they are giving the family time to mourn the loss of the toddler before considering possible criminal charges.\n\"It's a tragic time for all the family members, so we're allowing everybody to grieve at this time,\" Ireland said.\nA family friend has set up a GoFundMe page to help with funeral arrangements for the baby.\nMoments after toddler was shot, Henry Co Police say family administered first aid, called 911. What a lieutenant says happened after that... pic.twitter.com/vjc90xp3XS\n— Rikki Klaus (@RikkiKlausWSB) October 2, 2016\nHenry County Police lieutenant says 1.5-y/o boy shot on King Mill Road in McDonough has died. pic.twitter.com/02YHdqzAJJ\n— Rikki Klaus (@RikkiKlausWSB) October 1, 2016\nHenry Police trying to figure out whether 1.5-y/o boy shot himself or another child shot him. Lt. says adults heard shooting, didn't see it. pic.twitter.com/XtP6i1r8gP\n— Rikki Klaus (@RikkiKlausWSB) October 1, 2016\n© 2017 Cox Media Group."}