{"uri": "http://www.burlingtonfreepress.com/story/news/local/vermont/2015/08/10/social-worker-killing-arraignment/31409905/", "title": "Police: Suspect ‘calm and laughing’ after slaying", "dct": "Mon, 10 Aug 2015 00:00:00 GMT", "id": "834cd3bd6591ed28dcae1511117dc4a6", "content": "COURTESY\nBARRE – Her clothes stained with blood, Jody Herring laughed and made small talk in police custody shortly after she shot dead a social worker Friday afternoon in Barre, prosecutors said.\nBy Saturday morning, the police would discover the slayings of three of Herring’s relatives at a farmhouse six miles away. The authorities suspect Herring killed them, too, in one of Vermont’s deadliest outbursts of violence.\nInvestigators say Herring, 40, of South Barre was upset at losing custody of her 9-year-old daughter in July.\nHerring was expressionless Monday afternoon as sheriff’s deputies led her into Vermont Superior Court in Barre to face a charge of first-degree murder arising from the killing of Department for Children and Families employee Lara Sobel.\nThe defendant’s leg irons jangled in the silent courtroom as she walked to the defense table. In a red jumpsuit and wearing shackles, Herring sat less than 100 yards from the parking lot in which law enforcement says she killed Sobel. Herring’s attorney pleaded not guilty on her behalf.\nProsecutors have yet to bring charges connected to the killings of the suspect’s cousins, Rhonda and Regina Herring, and Jody Herring’s aunt Julie Falzarano. Assistant Attorney General John Treadwell said the investigation was “in its infancy.”\nJudge Kevin Griffin ordered Herring held without bail. Prosecutors could file new charges at any time. Her lawyers left court without commenting.\nSobel, 48, was leaving work at DCF on Friday afternoon when the police say Herring shot her twice with a .270-caliber, bolt-action rifle. Sobel, who is survived by her husband and two daughters, worked as a social worker for more than 14 years.\nThe state’s case\nA police affidavit of probable cause outlines the state’s case against Herring in connection with the killing of Sobel.\nPolice received a report of a shooting at 4:54 p.m. Friday. Witnesses told officers that Herring approached Sobel as she left work at Barre City Place, then shot her twice with a Remington 700 bolt-action rifle. Witnesses said Herring fired the second shot from close range, after Sobel had fallen to the ground.\nWashington County State’s Attorney Scott Williams was working out at a nearby gym when he heard the gunshots. Williams ran to the scene and managed to get the gun away from Herring, he told reporters Monday.\nBystanders held Herring until Barre City police arrived minutes later. An autopsy determined Sobel died of two gunshot wounds to the torso and upper extremities, the affidavit states.\nPolice said Herring behaved erratically once in custody. Herring was “very calm and laughing during the entire interaction,” police said, and “making small talk about the incident like it was no big deal.”\nHerring’s clothes were covered in blood and human matter, the affidavit states.\nShe became agitated later when investigators tried to interview her, the police say. Herring ranted about being beaten by a former partner, according to court papers, and about how she believed she had been mistreated by the Department for Children and Families.\nSaturday morning, the authorities found the bodies of three of Herring’s relatives at a home in the nearby town of Berlin. Gov. Peter Shumlin has identified Herring as “the alleged perpetrator” in all four killings.\nTiffany Herring, 23, the daughter of victim Rhonda Herring, told the Burlington Free Press on Saturday she found the bodies. She said Jody Herring had called her loved ones Friday morning to threaten them and to make comments about DCF.\nThe victims found in the house were sisters Regina Herring, 43, and Rhonda Herring, 48, and their mother, Julie Falzarano, 73.\nThe authorities have yet to detail how long before Sobel’s slaying they believe the three killings in Berlin occurred.\nCourt papers state Jody Herring called her brother, Dwayne Herring, just before 3 p.m. Friday and left a message asking him to call her back immediately “if you think anything of your sister.” Four minutes later, Herring called back and left another message, her brother later would tell the police: “Watch the news, and you’ll wish you got a hold of me earlier.”\nWilliams speaks out\nScott Williams spoke with reporters outside the courthouse Monday afternoon about his role in apprehending Herring.\nWilliams, a veteran of the U.S. Navy, said he two gunshots while he was at a gym in Barre City Place. He ran outside to the scene of the shooting, where he took the rifle from Herring.\n“I was able to disable the weapon and move it,” Williams said, adding that he had two bystanders restrain Herring until the police arrived.\nHe said he recognized Sobel and Herring from professional interactions. Williams praised Sobel for her work with Vermont’s children.\n“She was a pit bull of an advocate for kids. She did not hesitate to let judges and lawyers know what was best for kids,” Williams said. “I respected the hell out of her.”\nA tearful Williams said he comforted Sobel in her final moments. Sobel died at the scene.\nWilliams said he asked his wife to go to Sobel’s East Montpelier home to notify her family. He thanked the bystanders and police officers who secured the scene and attempted to treat Sobel.\nThe county prosecutor removed himself from handling the Herring case because he might be called as a witness. The Attorney General’s Office took over the prosecution.\nLengthy criminal history\nCourt records show Herring has 11 misdemeanor convictions dating to 1994, including drunken driving, domestic assault, disorderly conduct and possession of narcotics.\nHerring’s criminal convictions disqualified her from acquiring a gun, according to court records. The documents make no mention of how, where or when Herring obtained the rifle.\nThe police discovered a sleeve of .270-caliber rifle bullets in Herring’s waistband after her arrest, the affidavit states. In a search of Herring’s South Barre home Saturday, the police found 34 spent .270 shell casings, 14 live rounds and a June 2 receipt from Wal-Mart for the purchase of ammunition.\nInvestigators also found a box of .270-caliber ammunition in Herring’s vehicle in the Barre City Place parking lot.\nIn court papers, law-enforcement authorities made no mention of how long they believe Herring waited for Sobel to emerge from Barre City Place. A witness told the police she saw Herring sitting in a vehicle moments before the shooting.\nMeanwhile, Sobel’s family said Monday her funeral would be held at 11 a.m. Tuesday in the Grand Ballroom at the Capitol Plaza Hotel in Montpelier, according to an obituary published in the Barre Montpelier Times Argus newspaper.\nRELATED:\nThis story was first posted online on Aug. 10, 2015. Contact Zach Despart at 651-4826 or zdespart@burlingtonfreepress.com. Follow him on Twitter at www.twitter.com/ZachDespart."}