{"uri": "http://www.kjrh.com/news/local-news/hearing-for-quadruple-murder-suspects-continue", "title": "Brothers James Poore, Cedric Poore to stand trial for January quadruple murder at Fairmont Terrace", "dct": "Fri, 13 Sep 2013 09:45:00 GMT", "id": "8ea18c0baa1ff2268c071e5007bac580", "content": "Autoplay:\nTULSA - A Tulsa County judge ruled Friday afternoon that two brothers accused of murdering four women at a south Tulsa apartment complex will stand trial.\nJudge Stephen Clark said enough evidence had been presented against the men during the preliminary trial.\nJames Poore and Cedric Poore have pleaded not guilty to murder and robbery charges stemming from the Fairmont Terrace killings on Jan. 7.\nRELATED: 4 women found dead, shot inside Fairmont Terrace Apartments in south Tulsa (h ttp://bit.ly/Fairmontdeaths)\nThe bodies of Rebeika Powell, Misty Nunley, Julie Jackson and Kayetie Melchor were found inside Powell's apartment near 61st and Peoria.\nProsecutors and victims' families were relieved with the judge's ruling.\n\"We're happy for the family that we've taken this first step in trying to achieve justice for the deaths of these four women,\" said Doug Drummond, first assistant district attorney for Tulsa County.\nBut Cedric Poore's attorney disagreed with the ruling.\n\"Cedric Poore was not there. Cedric Poore was not at Fairmont Terrace,\" said John Echols, the court-appointed attorney for Cedric Poore.\n\"He did not participate in the murders of these women,\" said Echols.\nEchols said the judge denied him the opportunity to prove his client's innocence by not allowing either defense team to call their own witnesses.\n\"We had witnesses ready to call. We wanted to call the people from the police lab. We wanted to call witnesses that would support our case,\" said Echols.\nClark also refused to throw out testimony from Jamila Jones, the ex-girlfriend of James Poore, who testified she overheard the brothers confessing.\nJones admitted she lied to police initially because she was scared of the defendants.\n\"I was scared if I told that they were going to do something to me and my family,\" Jones said during her testimony on Monday.\n\"Her testimony was fraught with inconsistencies,\" said Echols. \"She'd say one thing under oath at one point and a different thing under oath at a different time. I think the important question to ask is why hasn't Jamila Jones been charged with these homicides?\"\nProsecutors say the evidence overwhelming points to the Poore brothers.\n\"This is the first step. This is going to be a long journey,\" said Drummond. \"These types of cases do take a long time.\"\nDrummond said it was too early to say whether the state will seek the death penalty.\nEchols said seeking the death penalty would not be the right thing to do based on testimony.\n\"Goodness gracious, to seek the death penalty under the testimony of Jamila Jones I think would be a disaster,\" said Echols, who plans to file appeals with the district judge prior to his client's arraignment.\nThe preliminary hearing ended Friday after more than week's worth of testimony.\n\"In Tulsa County if we did this with every prelim the system would shut down,\" said Drummond.\nDrummond said preliminary hearings for cases like this usually last two to three days.\nEchols said the preliminary hearing did not last too long.\n\"I've been in many longer preliminary hearings than this one and this hearing wasn't long enough is the problem,\" said Echols.\nIn addition, the court heard testimony from members of the Poore family, detectives and roommates of Jamila Jones.\nBoth Poore brothers have arraignments scheduled for Sept. 23 at 9 a.m.\nCopyright 2013 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}