{"uri": "http://www.trentonian.com/general-news/20161209/shooting-self-burlington-shooting-drugs-december-9-2016-trentonian-police-blotter", "title": "Shooting self, Burlington shooting, drugs: December 9, 2016 Trentonian Police Blotter", "dct": "Fri, 09 Dec 2016 22:48:00 GMT", "id": "55a43689e23a7bb6471f40aa52fefafd", "content": "The information below was provided by police unless otherwise noted.\nShooting Himself: At approximately 10:15 p.m. Thursday, officers were detailed to the Capital Health Regional Medical Center on a report of a gunshot victim. Detectives from the Shooting Response Team met with a 24-year-old male city resident, who stated that he was in area of Calhoun Street and Bellevue Avenue when he accidentally shot himself in the foot with a handgun. The investigation is ongoing. The man was treated for his injuries and released from the hospital.\nRug Thief: Police officers were on patrol in the area of South Broad and Hudson streets when they were flagged down by the manager of the Dollar Value store at approximately 11:30 a.m. Thursday. The manager stated that a male wearing a red and white jacket, later identified as Weldermar Cedeno, had stolen two carpets from the store and pointed him out to officers. Cedeno, 44, of the 100 block of Turpin Street, then took off on a bike and began leaving the area. The officers caught up to the city resident and he was placed under arrest. He was also found to be in possession of a hypodermic needle. The officers recovered one of the two rolls of carpet that were taken. Cedeno is charged with theft and possession of a syringe.\nPot Bust: Officers were in the area of Stuyvesant and Hoffman avenues when they observed an individual, later identified as David Crawford, was walking and clutching an unknown object in his hand at approximately 6:45 p.m. Thursday. When Crawford, 34, of the first block of Ellsworth Avenue, saw the officers, he placed the object in his jacket pocket and began walking at a faster pace. The officers stopped to conduct an investigation and found that the city resident was in possession of two small bags containing suspected marijuana. Crawford was placed under arrest for possession of marijuana. He also had an outstanding warrant.\nLEARN MORE\n[1] CAUTION! When driving a hybrid vehicle, pay special attention to the area around the vehicle. Because there is little vehicle noise in EV Mode, pedestrians, people riding bicycles or other people and vehicles in the area may not be aware of the vehicle starting off or approaching them, so take extra care while driving. Prime's EV Mode has an EPA-estimated driving range of 25 miles, allowing it to work under certain conditions at full highway speeds. EV Mode range will vary and is dependent upon many factors, including charging practice, driving style, road/traffic conditions, outside temperature, air conditioning control levels, payload/cargo weight, proper tire pressure, vehicle maintenance and battery age. Battery capacity will decrease with time and use. See Owner's Manual for details.\nAdvertisement\nPot Bust: Officers were on patrol in the area of Calhoun and Passaic streets at approximately 10:15 p.m. Thursday when they observed a vehicle with an expired temporary registration. During a motor vehicle stop on the 100 block of Passaic Street, officers smelled a strong odor of raw marijuana coming from the interior of the vehicle. Further investigation found the driver, Eric Tonnesen, 18, of Jackson, to be in possession of suspected marijuana. He was placed under arrest for pot possession and issued summonses for unregistered temporary registration, fictitious license plate and possession of drugs in a motor vehicle.\nPot Bust: Street crime unit detectives were on patrol on the 500 block of Greenwood Avenue at approximately 7:30 p.m. Thursday when they saw an individual, later identified as Maurice Pough, rolling an apparent marijuana joint. When Pough, 34, of the 500 block of Greenwood Avenue, became aware of the detectives, he threw the joint on the ground. The city resident is charged with being in possession of a small amount of marijuana.\nVehicle Break-in: Shortly before 2:30 a.m. Friday, officers patrolling East State Street and Hampton Avenue observed an individual, later identified Michael Mickens, with his upper torso inside the passenger side window of a Jeep Cherokee. The officers also noticed shattered glass on the ground near his feet and a female, later identified as Sa’Gabia Conway that was standing on the sidewalk near Mickens. As the officers got closer, Mickens frantically removed his body from the window and began walking away from the vehicle. Mickens was stopped by police and was holding a notary stamp that belonged to victim who owned the vehicle. Mickens, 23, of the 800 block of East State Street, and Sa’Gabia Conway, 19, of the 300 block of Walnut Avenue, were arrested and charged with burglary and theft.\nShooting: On Thursday shortly before 7 p.m., a reserve officer monitoring city security cameras observed what appeared to be an altercation on the 500 block of York Street involving several subjects. Nearby officers responded and heard gunshots. They immediately entered the area, where they observed several individuals running away and found a 17-year-old male from Moorestown suffering from a gunshot wound to the leg. He was transported to the hospital and is listed in stable condition. No arrests have been made. Anyone with information is asked to call Detective Anna Czajka at 609-386-0262 ext. 221 or leave a confidential tip at burlingtonpolicenj.com."}