{"uri": "http://www.khou.com/news/crime/one-adult-2-children-shot-in-possible-drive-by/352045593", "title": "Police question man about child's murder", "dct": "Tue, 15 Nov 2016 00:00:00 GMT", "id": "5e05f1b4374d7523b4b8a6f174efe572", "content": "HARRIS COUNTY, Texas – Harris County Sheriff’s deputies are questioning a man who may have information connected to the violent attack of a mother and her two young daughters.\nSources told KHOU 11 News the man was taken into custody on an unrelated warrant Tuesday at a motel more than six miles away from the shooting scene.\nInvestigators said they’re not confident calling the man a suspect or person of interest at this time. However, sources said a firearm was found in his possession.\nDiana Gomez, 27, and her two children who were shot in an attempted robbery Monday night. Four-year-old Ava Castillo died after being rushed to the hospital. Her 10-year old sister, Betzida Castillo, is in stable condition at the hospital. Gomez remains in critical condition. Her husband said she still can't speak but she is expected to survive.\nHarris County Sheriff's Deputies responded to the shooting call just before 9 p.m. at the Mission Falls apartments in the 10400 block of Greens Crossing Boulevard.\nBeverly Collins lives in a first-floor apartment feet away from where the shooting happened.\n“I thought I heard BB guns, because all I heard were three shots going off,” said Collins. \"And I saw a woman and a little girl laying on the ground by the car, by the tire.”\nAuthorities said Gomez and her two children were unloading groceries when two men pulled up in a dark-colored sedan and parked near Gomez and her vehicle.\nOne of the men was able to grab the strap of Gomez's purse but she fought back. One of the suspects pulled a handgun and shot the family multiple times. Neighbors counted nine shots.\n\"I think it's heartbreaking that a family has to get robbed, a mother gets robbed and a baby died,\" said David Mendoza, a witness.\n“For a purse? For money,” questioned neighbor Sharon Williams. “When did we get to this point? [For] some senseless inhumane person to take from someone who’s struggling and trying to make ends meet, it just has to stop!”\nWilliams laid a pair of stuffed animals, some flowers and a bundle of balloons outside of the apartment building where crime scene tape and blood splatter remain. “The red balloons represent the mom and the daughter that’s still hanging on to life,” explained Williams. “The pink balloon represents the four-year-old who didn’t even get a chance.”\n\"We have investigators here, deputies combing through, hopefully we’ll be able to catch a break and catch these guys,\" said Deputy Thomas Gilliland.\nInvestigators are looking at nearby surveillance video for further clues. They are also looking into whether this case could be connected to other violent robberies in the area.\nA detailed description of the suspects has not been released.\nCall Houston Crime Stoppers at 713-222-TIPS if you have any information.\n(© 2017 KHOU)"}