{"uri": "http://www.click2houston.com/news/2-children-1-adult-hit-in-drive-by-shooting", "title": "4-year-old killed, mother and sister wounded in robbery; person of interest in custody", "dct": "Mon, 14 Nov 2016 21:10:00 GMT", "id": "6ad397c1044c53d418f2f0935848b3e3", "content": "HOUSTON - A person of interest in a shooting that killed a 4-year-old girl and injured her mother and 10-year-old sister Monday night was taken into custody Tuesday, according to sources.\nHe’s being questioned by HCSO detectives. He was arrested Tuesday at a motel in the 200 block of Bammel-Westfield Rd, about 8 miles north of the murder scene. A weapon described as similar as the one used in the shootings was found in his room. Sources say ballistics tests will be performed to try to determine if the gun was used in the murder and shootings. He’s being held on an unrelated assault charge.\nMan shot in both legs in drive-by shooting\nDeputies say 27-year-old Diana Gomez, was unloading groceries with her two daughters, 4-year-old Ava Castillo and 10-year-old Betsida Castillo, just before 9 p.m. outside their apartment in the 10000 block of Greens Crossing Boulevard. Three men got out of a dark sedan and tried to snatch Gomez's purse, investigators said.\nOfficials said Gomez would not let go of the purse, and one of the men started shooting. Gomez and her children were shot several times, deputies said.\nNeighbor Jessica Zapata pulled into the parking lot the same time as police. She says she saw Gomez and her 4-year-old daughter unconscious on the ground. Gomez’ ten year old daughter was calling family members on her cell phone. But she was also hit.\nPHOTOS: Diana Gomez, Ava Castillo, Betsida Castillo\n“The 10-year-old started limping, and that’s when everyone started screaming, ‘she’s shot, she’s shot,’ and that’s when the cops looked at her and she had a wound right here at the stomach.” Zapata said. “We got shot, we got shot, that’s all she said.”\nThe three victims were taken to Memorial Hermann Hospital, where Ava died.\nAs of Tuesday night, Gomez remained in critical condition. Her sister, Julie, says she had about seven gunshot wounds and will probably remain in the hospital for at least another week. Betsida was released from the hospital on Tuesday and should be OK.\n“It has been tough,” Julie said. “Why would you rob someone with small children?”\nJulie said she had to break the news to her sister on Tuesday that 4-year-old Ava did not survive.\n“She has a breathing tube so she couldn’t speak. She just cried,” Julie said.\nOn Tuesday night, community members came to drop off flowers and balloons at a growing memorial, near the scene of the shooting.\n“We're all a community so we need to come together as a community and stop this nonsense,” said Michael Aguilar, who lives near the apartment complex.\nA GoFundMe account has been set up for the family.\n.@HCSOTexas arrest POI in shooting of mother & 2 kids. Detectives searching room where man stayed at Motel. @KPRC2 pic.twitter.com/hUgcgacBkA\n— Jake Reiner (@JakeKPRC2) November 15, 2016\nInvestigators said they are looking for three men who were wearing dark-colored clothes and got away in a dark-colored vehicle.\nDeputies said they are reviewing surveillance video from the apartment complex and are also talking to witnesses.\n\"How did it get to this point, where you can aim a weapon at a 4-year-old and be OK with that?\" asked Sharon Williams, who runs a nearby community center. \"I plead to whoever did this: Don't go any further. Turn yourself in.\"\nSources told KPRC2 that a person of interest was taken into custody Tuesday morning at a motel on Bammel Westfield Road near Interstate 45 during the execution of a warrant on an unrelated charge of assault family violence.\nSources said that a semi-automatic rifle was found in the person's room, and that the person was peacefully arrested.\nWhile the person has not been charged in connection with the girl's death, sources said, the person is being questioned in connection with the case.\nAnyone with information was asked to call Crime Stoppers at 713-222-8477.\n2016 Click2Houston/KPRC2"}