{"uri": "http://abc13.com/news/2-people-including-child-shot-in-harris-co-drive-by/1607307/", "title": "HCSO: Robbers fatally shoot 4-year-old over mom's purse", "dct": "Wed, 16 Nov 2016 00:00:00 GMT", "id": "7fcb32a029528cbff1050c5142c3bcba", "content": "HOUSTON (KTRK) --\nA little girl is dead and her mother and young sister were critically injured after they were shot during an attempted robbery in north Harris County, according to deputies.\nThis all started around 8:40pm as a 27-year-old woman was carrying groceries to her apartment alongside her 10-year-old and 4-year-old daughters.\nORIGINAL REPORT: Mother, two young daughters shot during attempted robbery\nInvestigators said at least two men in a dark-colored sedan pulled up next to them and got out. The men reportedly asked for the woman's purse, but she refused. That's when deputies believe one of the men shot the mother and her two children at close range.\nMORE: Four-year-old killed in violent robbery\nDeputies say at least nine shots were fired. The 4-year-old girl was struck in the head. The mother was shot in the stomach, but as she was trying to protect her kids, she apparently didn't even realize she'd been hit until a deputy noticed her shirt was bloody.\nAll three were rushed from the Mission Falls apartment complex on Greens Crossing Boulevard to nearby Houston Northwest Hospital.\nThe youngest of the victims, just 4 years old, was then taken by Life Flight to Memorial Hermann Hospital because of the seriousness of her condition. Sadly, she has died from her injuries.\nSources have told us the girl's name is Ava Castillo.\nHer mother is Diana Gomez, according to sources, and the 10-year-old sister is Betzida Castillo. They were listed in critical condition early this morning, fighting for their lives.\nHarris County Sheriff's Deputy Thomas Gilliland called this heinous act \"an absolute tragedy.\"\n\"A 4-year-old and a 10-year-old shot is pretty horrendous,\" Gilliland said. \"When you have children involved, it's not a great scene to be at.\"\nGilliland said when criminals are desperate, we do not know what they are capable of and that things can turn violent pretty quickly, even against children.\nThe mother told deputies there were two men, but a witness says there were three. Those suspects are still at large, and their descriptions at this point are extremely vague -- black men, dark colored clothing, dark car. Deputies are reviewing surveillance video in an effort to get a better description.\nWe're following this story on Eyewitness News. Watch for updates on air, online and on our mobile news app.\nKeep checking back on this page to get real-time updates as this story unfolds. To get alerts for breaking news, download the abc13 news app for iPhone or Android. You can also get breaking news alerts sent to you by email."}