{"uri": "http://www.kmov.com/story/32441632/2-dead-1-wounded-in-south-st-louis-shooting-officer-shot-by-suspect", "title": "GoFundMe account created for family of murdered principal - KMOV.com", "dct": "NODATE", "id": "47d7ef8e17330c7fe7bd432cdfa6fb68", "content": "Print\nSOUTH ST. LOUIS (KMOV.com) -\nA GoFundMe page has been created to raise money for the family of a principal who was killed on July 13.\nAuthorities told News 4 Maurice Hoskins, 40, shot his ex-girlfriend, identified as Jacara Sproaps, 38, her new boyfriend, identified as 40-year-old Maurice Partlow, and Sproaps' 18-year-old son in the 3000 block of Miami around 10:30 p.m. Police said there was an argument before the suspect showed a gun, which led to a struggle over the weapon, before shots were fired.\nHoskins was angry with Sproaps about a past relationship and arrived at the home and shot Partlow first, according to police. After her boyfriend was shot, Sproaps and her son attempted to run from the suspect, but were shot.\nWhen two officers arrived on the scene in a squad car, the suspect began firing gunshots towards them, according to police. Officers exchanged gunfire with Hoskins, during which an officer was grazed by a bullet in the shin. The officer refused treatment at the scene.\n“The officers heard shots being fired as they got close to the call when the officers arrived and turned the corner on to Miami from Pennsylvania the suspect was still on the scene and he began firing at officers,” said St. Louis Police Chief Sam Dotson.\nAfter exchanging gunfire with the officers, Hoskins ran from the scene and was arrested in the 3200 block of Minnesota following a short foot pursuit.\nSproaps and Partlow were pronounced dead at the scene. Sproaps’ son was taken to the hospital and listed in critical, stable condition.\nPolice said they issued warrants for two counts of first-degree murder, five counts of armed criminal action and two counts of first-degree assault against an LEO against Hoskins.\nAuthorities said a judge issued a $2 million cash-only bond for Hoskins.\nSproaps was the principal at Dunbar Elementary School in St. Louis. The St. Louis Public School District issued the following statement:\nThe Saint Louis Public School District suffered a great loss today with the tragic passing of Jacara Sproaps. Our hearts are heavy and we pray for her family and friends.\nMs. Sproaps was a talented and dedicated principal and a true champion for children. She was taken from us much too soon. She will be missed by her students and co-workers in the District, but she will never be forgotten.\nAn employee with the District for more than 14 years, Ms. Sproaps began her career as a teacher’s assistant in January 2002. She also held positions as a substitute teacher, special education teacher, assistant principal and administrative intern prior to being named principal at Dunbar in 2013.\nArthur Norman, Sproaps' uncle, said he is shocked that this happened.\n\"I am very disappointed because I had a relationship with this young man. This young man was one of the young men I saw group up in the community. I never thought that he would do something like that.\"\nNorman said he had a very close relationship and spoke to his niece the day before the fatal shooting.\n\"That is why it hit me so hard because I spoke with her yesterday and then last night, unbelievable,\" he said.\nAs the family mourns their loss, Norman says his niece will never be forgotten.\n\"She was an angel. A total angel. She was the crown jewel in our family...I would like people to remember her as a kind spirit. Someone [who] was accessible and someone who never changed. She was always smiling and giving herself for everyone.\"\nA memorial service is being held at 6 p.m. on July 20 at Dunbar Elementary School.\nA GoFundMe account was set up to help raise money for her surviving son that was shot during the incident.\nCopyright 2016 KMOV (Meredith Corporation). All rights reserved"}