{"uri": "http://www.kirotv.com/news/news/3-year-old-boy-shot-mouth-while-playing-4-year-old/njDMf/", "title": "3-year-old boy shot in mouth while playing with 4-year-old neighbor", "dct": "Sun, 23 Nov 2014 11:37:00 GMT", "id": "a2f59e2ed0cc1c66c358cd7366aa875b", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nLAKE STEVENS, Wash. - A shooting in the 600 block of East Lakeshore Drive in Lake Stevens just before 10:00 Friday night has left a 3-year-old boy fighting for his life.\nNeighbor Buzz McLeod said he arrived home after the shooting. Soon after that, medics showed up.\n\"The owner of that unit was watching the grandson and his son, while his wife and the lady were out,\" said McLeod, who lives below the units.\nThe condo is owned by 46-year-old Jon Holzwarth. An internet search revealed he is in the internet security and firearms businesses.\nAccording to Snohomish County deputies, the shooting happened in a bedroom that was locked.\nHolzwarth told them he heard a loud boom and ran to the bedroom where his son, Michael, and his neighbor's 4-year-old grandson were playing.\nHe forced the locked door open and initially thought his son had gotten hurt that way.\nAt Providence Everett Medical Center, doctors discovered the boy had been shot in the mouth.\nHe was airlifted to Harborview Medical Center in Seattle.\nNo one answered at Holzwarth's door where a sign reads: \"We don't dial 9-1-1\" with a metal cutout of a pistol dangling below.\nThere were also emblems about guns on his Jeep.\nOn Saturday, his son was struggling to survive from a gunshot wound -- a tragic irony not lost on his neighbor.\n\"I don't agree with the guns,\" said McLeod. \"You kind of get a little concerned when someone even has a gun.\"\nMcLeod was worried about Michael. \"He's a cute boy,\" he said.\nSnohomish County Sheriff’s deputies have said nothing about the make or model of the gun nor who owns it.\nThey are calling the shooting accidental but say they are still investigating.\nThey have not said if the gun's owner will face any charges."}