{"uri": "http://abc11.com/news/three-dead-in-fayetteville-shooting-that-left-two-deputies-wounded/227646/", "title": "Three dead in Cumberland County shootout", "dct": "Thu, 31 Jul 2014 00:00:00 GMT", "id": "1d032145ff37c2c666ae37beb74f411d", "content": "FAYETTEVILLE (WTVD) --\nThe Cumberland County Sheriff's Office said a gunman and two others were killed, including a child, in shootout at a Cumberland County mobile home park.\nAuthorities said the incident began around 7 a.m. Wednesday with a domestic dispute between 41-year-old Andrew Michaelis and his wife, 41-year-old Valerie Michaelis. The woman called 911 for help after an argument began at their home on Bramblegate Road.\nInvestigators said Michaelis then held his wife at gunpoint until she was able to get the gun away from him, and then he chased her with a knife.\nThe woman fled to the home of her father, 61-year-old Gary Simpson, at the Crystal Springs Mobile Home Park on New Moon Drive.\nWhile she and six others were inside the home, authorities said Michaelis drove by the home and fired an AR-15 assault rifle into the home, discharging 60 rounds in all.\n\"He was just firing at random like everywhere. I guess spraying the whole trailer,\" said Cumberland County Sheriff Earl \"Moose\" Butler.\nTwo people inside were killed -- Simpson and his grandson, 10-year-old Trekwan Covington. Michaelis' son, 13-year-old Ryan Michaelis, was also inside the home. He was not injured.\nDominick Nickerson was inside the home during the rapid-fire chaos. He saw his family members shot and killed.\n\"My grandpa was protecting -- telling us to back up. All he said was just leave the house and he just started shooting,\" said Nickerson.\nShots could be heard in the background on a witness' cell phone video provided to ABC11.\nMichaelis drove away and then returned -- firing another magazine of shots into the home. On the third time he returned, deputies, who were now inside the home, were struck by gunfire.\nNeighbors described what they saw and heard.\n\"It sounded like somebody was banging on the door and then I said 'No, that's gunshots,'\" said Danny McGirt.\n\"One of the daughters or whatever, she just came out and said, 'My daddy's gone. My daddy's gone. My daddy's gone,'\" said Al Williams.\nDeputies then chased Michaelis through the woods. They say he continued firing his weapon at deputies, who returned fire. Michaelis died in the shootout with deputies. It wasn't clear, however, if deputies killed him, or if he took his own life.\n\"When they were behind him down there. \"It was like an Army going off down there in the woods,\" said Archie Chavis.\nAfter what deputies found in Michaelis' pickup truck, the carnage could have been even worse.\n\"He had about 50 to 60 more rounds in his truck,\" said Butler. \"So this man was prepared to take some lives this morning.\"\nOne deputy was shot in the chest, back and shoulder during the shootout. He was taken to Cape Fear Valley Medical Center. Doctors were able to remove the bullet that was lodged in his back. He was last listed in stable condition.\nAnother deputy escaped major injuries when a bullet struck her duty belt. She suffered minor bruising and was unharmed.\nThe sheriff's office has not released the deputies' names.\nButler said the incident had him feeling upset and uneasy.\n\"Any time you hear an officer shot, it sends chill down your spine,\" said Butler. \"You really have a strange feeling about it because you know families are being torn apart.\"\nReport a Typo"}