{"uri": "http://m.news9.com/Story.aspx?story=29621553&catId=112032", "title": "Nicoma Park Police: 10-Year-Old Boy Accidentally Shot Himself", "dct": "Fri, 24 Jul 2015 01:33:00 GMT", "id": "226781d65905a3796746c35bed2fb081", "content": "Jim Gardner and Bob Mills SkyNews 9 HD was overhead following the accidental shooting of a 10-year-old boy outside a home in Nicoma Park.\nPolice said he shot himself.\nNicoma Park Police aren't saying how badly the boy is injured, but say he is \"stable.\"\nMeantime, neighbors are in shock.\n7/23/15 Related Story: Police Respond After Metro Boy, 10, Shot In Face\n“Our kids ride their bikes right down the same street where it happened,” said neighbor, Julie Watt.\n“It could have been one of them passing by, so that’s the scary thing about it,” said neighbor Rudy Mejia.\nJulie Watt and Rudy Mejia said a scene like this in their quiet Nicoma Park neighborhood isn't normal.\n“It’s just definitely crazy and definitely out of the ordinary for this neighborhood,” said Watt.\nPolice said the 10-year-old accidentally shot himself in the face just steps from their home.\nInvestigators believe the young victim is the son of one of the contractors working on the house.\n“Our kids could have been playing with him, I mean that’s not out of the realm of possibility,” said Watts. “My son could have asked to go down and play and he would have been there too.”\nPolice said the homeowners were not home at the time of the shooting, and police do not know how the child got his hands on a gun.\n“There were four people in the home at the time, all of which doing work,” said Nicoma Park Police Chief, Rob Groseclose. “We believe doing contractor work for the homeowner who is out of town.”\n“I had literally just walked down the street about an hour ago, and it was completely silent and quiet,” said Mejia. “An hour later, all the cops and sheriffs are out here.”\nAnd police still have a lot of questions.\n“It’s just a scary, scary thing to think that could happen to somebody so young,” said Mejia.\nThe victim’s name has not yet been released."}