{"uri": "http://fox59.com/2015/08/27/police-investigating-after-3-bodies-found-inside-home-in-henry-county/", "title": "Police discover 3 bodies, including 2 children, inside Henry County home", "dct": "Thu, 27 Aug 2015 11:47:00 GMT", "id": "07c0a466c33294286a896d41e6d7179f", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nHENRY COUNTY, Ind. (Aug. 28, 2015) – Officials in Henry County are investigating after three bodies were found in a home just east of Knightstown Thursday morning.\nOfficers were first called to the home in the 5500 block of West Old National Road to conduct a welfare check after one of the children in the home had not shown up to school. That’s when investigators found the bodies of two children and one adult male.\nOn Friday, Henry County Prosecutor Joe Bergacs confirmed the two children died of gunshot wounds, and the father died of a self-inflicted gunshot wound.\nAccording to Henry County Prosecutor Joe Bergacs, a deputy looked through a window and observed a young boy on the floor. Deputies forced entry into the house and determined the 5-year-old boy was deceased. Upon a search of the home, deputies found an 11-year-old girl, who was also deceased. The children's father, 48-year-old Joseph Horn, was found dead from an apparent gunshot wound.\nCourt records show Horn's wife filed for divorce on August 11.\nProsecutor Bergacs said there is no evidence a suspect is at large. The horrific discovery has left neighbors in the small community absolutely stunned.\n“This just does not happen in this area whatsoever. It’s just unreal,” said neighbor Sheila Rawlins.\nShelia owns the land right across the street from the home.\nShe says the family, a man and woman and two kids, had moved into the home earlier this year.\nSheriff’s deputies won’t confirm the ages of the people found inside the house, nor would they say exactly how the victims died.\nInvestigators did say the bodies were found throughout the house.\nNeighbors are heartbroken to think children may have lost their lives.\n“It’s unbelievable,” said Rawlins. “I can’t believe someone would do that to two kids.”\n“It’s disturbing and it’s sad,” said neighbor Janine Mattix. “The kids didn’t ask for that.”\nJanine says the homeowner claimed to be retired military, spent most of his days at home and always walked around with a gun on his hip.\nNeighbors also tell us the couple had been going through some domestic issues and wouldn’t be surprised if a fractured relationship led to the deaths.\n“I wasn’t real conformable around the man. I didn’t get a good vibe off him. If he’s responsible, it doesn’t really surprise me,” said Mattix.\n“It’s too bad the kids were the victims. It’s a sad thing that they had to pay the price,” said neighbor Ross Manche.\nYou need to have the Adobe Flash Player to view this content. Please click here to continue."}