{"uri": "http://www.pal-item.com/story/news/crime/2016/10/15/accidental-shooting-leads-6-month-sentence/92013408/", "title": "Accidental shooting leads to 6-month sentence", "dct": "Sat, 15 Oct 2016 00:00:00 GMT", "id": "396c9f4ac989e756d19bda96f3452db4", "content": "A Richmond teen was sentenced to six months in jail this week for an accidental shooting that took place a year ago.\nTaij A. Brown, 19, of the 800 block of South 11th Street pleaded guilty to Level 6 felony criminal recklessness in Wayne County Superior Court 1 and was given a 2½-year sentence with two of those years suspended to probation.\nA Richmond 16-year-old was shot in the neck in September 2015 when a group of teens was working out with weightlifting equipment and shooting each other with BB guns in a South Seventh Street garage. Brown told investigators he didn't realize he was handling a real firearm, thinking it was a BB gun, and he was surprised when it fired.\nThe victim apparently was shot in the garage and made his way across the home's back yard and into a yard across the alley that runs between South Seventh and South Eighth streets. He was found there and transported by ambulance to Richmond Municipal Airport to meet a medical helicopter.\nBrown was credited with 10 days of time served and 10 good-time days.\nTeen sentenced for arson, burglary\nAlso in Superior 1 this week, a Richmond 18-year-old was sentenced to 2½ years in the Wayne County Communication Corrections system after she recently pleaded guilty to setting a fire inside a North 17th Street home while seven people slept upstairs in June 2015.\nShaylinn R. Lamb, of the 600 block of South 13th Street, pleaded guilty to two arson counts and a burglary count (all Level 4 felonies) in late August. At the time, Judge Charles Todd Jr. listened to arguments and recommendations from the prosecution and defense about sentencing. On Tuesday, he handed down his decision, ordering a sentence of 5½ years with three of those years suspended to probation.\nLamb had admitted to walking to the home of a boyfriend who had broken up with her, breaking into the home and setting clothes on fire on June 5, 2015. The residents of the home in the 400 block climbed onto the roof and were rescued by neighbors with a ladder.\nLamb, who was 17 at the time of the fire, had been serving home detention. During her change of plea hearing in August, her attorney, Mark Cox, asked that Lamb be allowed to continue home detention because the recent Richmond High School graduate has begun classes at Ivy Tech and had started a job.\nShe was given credit for 494 days served and 123 good-time days."}