{"uri": "https://www.dnainfo.com/new-york/20160307/brownsville/brownsville-parents-arrested-for-torturing-3-year-old-son-prosecutors-say", "title": "Brownsville Parents Charged With Torturing 3-Year-Old Son, Prosecutors Say", "dct": "Mon, 07 Mar 2016 18:51:00 GMT", "id": "ed9e3332facc9af4183b8896cb284828", "content": "BROWNSVILLE — A mother and father were charged Monday with torturing their 3-year-old son over a span of six months, shooting him with a BB gun, beating him with a belt and forcing him to kneel on LEGO blocks, prosecutors said.\nAccording to the Brooklyn district attorney's office, the child's 23-year-old father, Leonardo Decouite, has admitted that between Sept. 1, 2015 and Friday he hit the toddler in the face and beat him with a belt and cable. Decouite also admitted he held the boy's feet under hot water until his skin started to burn, prosecutors said.\nThe boy's mother, Kiana Mohansing, 20, told officials that she had seen Decouite force his son to kneel on LEGO blocks for hours, put his son's hand under hot water until it burned, snuff cigarettes on the boy's arm and shoot him with a BB gun in the foot three times, according to prosecutors.\nThe pair was arrested Sunday after the child’s grandmother called police to report the abuse, according to the NYPD.\nDr. Teresa Lemma, an expert cited in the criminal complaint against Decouite and Mohansing, confirmed injuries consistent with abuse. Lemma described multiple signs of burns and bruises on the boy, and noted that his hand is permanently scarred and had limited mobility. There was also scarring and bruising on his knees.\nPolice also said the boy had BB pellets lodged underneath the skin of his right leg and foot and that he appeared malnourished.\nDecouite and Mohansing were charged with multiple counts of assault, endangering the welfare of child and criminal possession of weapon.\n“This is a heartbreaking situation and we are working with law enforcement authorities to investigate,” officials with the Administration for Children's Services said in a statement. They offered no further details based on privacy concerns."}