{"uri": "http://democratherald.com/news/public-safety-log-dec/article_1c17b779-1905-5045-bacb-e2b743d90d75.html", "title": "Public Safety Log (Dec. 6)", "dct": "Tue, 06 Dec 2016 00:00:00 GMT", "id": "7583a03cdce79595dbc8403598819f8b", "content": "Transient — At 9:31 a.m. Monday, a caller at the Phoenix Inn & Suites reported a transient sleeping on the couch in the lobby had been asked to leave the premises, but had not. The transient was advised to move on.\nTheft — At 7:15 a.m. Saturday, a caller in the 34100 block of Riverside Drive reported the theft of a 2013 Dodge crew cab pickup. The vehicle was later located in Grants Pass, and Ryker Joyner, 20, unknown address, was charged in connection with the incident.\nBroken windows — About 6:34 p.m. Saturday, a caller in the 800 block of Alder in Miller City reported someone was breaking windows in a house. Christopher Esman, 20, of Lyons, was arrested and charged with first-degree criminal mischief and second-degree criminal mischief for allegedly breaking a window and awning at the property. Monday afternoon he remained lodged at the Linn County Jail.\nHarassment — At 12:04 a.m. Monday, a caller in the 3200 block of Salem Ave, Millersburg, reported being harassed by a male and female. Deputy determined the caller and the couple knew each other and there was a dispute over personal property. Callers were advised to quit posting what could be construed as threats on social media.\nBullying — About 1:11 p.m. Friday, callers reported that a group of students in a white Jeep had yelled “Kill the gays” at her during lunch hour at the high school. Caller completed a bullying/harassment form at the high school and requested the other students be counseled. All three students were contacted and advised to cease such activities.\nGunshot wound — At 10 p.m. Friday, a caller in the 1600 block of South Ninth reported that 22-year-old Jared Dwayne Schmadeka accidentally shot himself in the leg while cleaning a .40 caliber handgun. The bullet exited his leg and no other injuries were reported. He was treated at Samaritan Lebanon Community Hospital. No charges were filed."}