{"uri": "http://www.legacy.com/obituaries/theberlincitizen/obituary.aspx?n=tyler-alan-cup&pid=175325715&fhid=4170", "title": "Tyler Alan Cup", "dct": "Thu, 16 Jul 2015 00:00:00 GMT", "id": "411bb9822eeed521067b51b72860a08c", "content": "Born in New Britain, a son of Richard J. Cop Jr. and Robyn (Trevethan) Cop, Tyler was a student at Berlin High School Class of 2018. He was a member of Sacred Heart Church and the confirmation class in East Berlin. He was an important part of a close family, and the light of his parents eyes, sharing a special friendship with his brother, sister and grandparents. He was an avid Boston Red Sox/New York Giants Fan, liked quading/motor sports, especially Corvettes. Tyler was very athletic, playing football, baseball and basketball, but his true love was basketball. Tyler was a big fan of Michael Jordan (he was all about the shoes). He enjoyed working with technology, especially X-Box and video games, where he liked to design and build his own controllers. He loved dinosaurs and New Jurassic World movie. He was a past member of the Berlin Little League, Berlin Youth Football and Cub Scot Pack 13. He also enjoyed vacationing at Myrtle Beach with his family. He enjoyed spending time with his close friends and his best buddy, his German shepherd, Brody. Tyler's smile always lit up a room and had a natural ability to make people laugh. Tyler is an angel now, but will live in our hearts forever.\nBesides his parents, Tyler is survived by a brother, Ryan J. Cop; a sister, Rylee N. Cop, of East Berlin; maternal grandparents, Bruce and Sharon Trevethan, of E. Berlin; paternal grandparents, Richard and Carol Cop, of Melbourne, Fla.; an uncle, Bruce Trevethan Jr., of North Carolina; and an aunt, Laura Battiglia, of Southington; several cousins; and countless friends.\nEveryone was invited to go to Sacred Heart Church, 66 Cottage St., E. Berlin, on Wednesday, July 22, for a Mass of Christian burial. Burial was followed at Wilcox Cemetery in East Berlin. The Berlin Memorial Funeral Home, 96 Main St., Kensington, has been entrusted with the arrangements.\nThe family would like to thank all Tyler's caregivers at the Connecticut Children's Medical Center for their loving care and support.\nTo share memories of Tyler with the family, please visit www.berlinmemorialfuneralhome.com."}