{"uri": "http://wane.com/2016/09/11/three-dead-another-critically-injured-in-shooting/", "title": "FWPD: 3 people found dead inside home, 4th person critically hurt", "dct": "Sun, 11 Sep 2016 04:15:00 GMT", "id": "0847294c8b3ba2faeb1c23c07cb38ce1", "content": "FORT WAYNE, Ind. (WANE) – Fort Wayne police found three people dead inside a home early Sunday morning.\nPolice responded to 3006 Holton Avenue around 4 a.m. on a reported “unknown problem.”\nFWPD Spokesman Officer Chris Felton said two females and a male were found dead. A fourth person, a woman, was taken to a hospital in critical condition.\nFelton said police do not know if the victims were shot or stabbed due to the amount of blood. However, Felton said there were two other people in the home that were not hurt and at least one of them told police they heard gunshots.\nThere is no suspect information and police do not have anyone in custody. It’s unclear if multiple people were involved.\nA motive is unclear and Felton said police don’t know the relationships between the four victims.\nPolice have yet to identify everyone in the house.\nThe two people in the home who were not hurt were taken to police headquarters for questioning.\nThe death investigation comes 14 hours after FWPD arrested two people in connection with a triple homicide on East Lewis Street in February.\nFelton said it’s too early in the Holton Avenue investigation to determine if Sunday’s incident is connected to the arrests.\nA large crime scene surrounded the home on Holton Avenue with police crime scene tape occupying an area about a half block on all sides of Holton and Colerick Street.\nMore than a dozen police officers responded to the area and several crime scene technicians were on hand.\nAs of 5:30 a.m., police were still waiting on a search warrant to enter the house and begin processing and collecting any possible evidence.\nDetectives were going door-to-door in an attempt to gather information or find potential witnesses.\nThe names of the victims have not been released.\nThe Allen County Coroner will determine and exact cause and manner of death. It’s important to note that the incident is being investigated as a homicide, but has not officially been declared a homicide until the coroner makes a ruling.\nThe incident is under investigation."}