{"uri": "http://www.journalgazette.net/news/local/police-fire/Victims-of-Holton-Avenue-shootings-ID-d--unborn-fetus-also-dies-15215725", "title": "Victims of Holton Avenue shootings ID'd; unborn fetus also dies", "dct": "Mon, 12 Sep 2016 15:44:00 GMT", "id": "9802783518e4e4d45adaa328b706abe2", "content": "Three people found dead from gunshot wounds inside a home in the 3000 block of Holton Avenue early Sunday have been identified, and one was carrying an unborn fetus who also died, the Allen County coroner's office said today.\nTraeven Harris, 18; Dajohiona Arrington, 18; her unborn fetus; and Consuela Arrington, 37, are the 28th, 29th, 30th and 31st homicide victims of the year in Allen County, the coroner's office said in a statement following autopsies.\nHarris died from a gunshot wound or wounds, the statement said. It said Dajohiona Arrington died from a gunshot wound or wounds of the head, and Consuela Arrington died from a gunshot wound or wounds and a stab wound or wounds.\nDajohiona Arrington was pregnant at the time of her death, and the unborn fetus was of a viable age if born, the coroner's office said. It said the cause of death for Baby Boy Arrington \"has been determined to be Intrauterine Demise due to Gunshot Wound(s) of the Head to the Mother.\"\nFort Wayne police have said they were called to a Holton Avenue home after someone reported hearing gunshots. Police initially said they found three female victims and a male victim inside. Two of the female victims and the male victim died at the scene, and the other female victim was taken to a local hospital in critical condition.\nA 20-year-old Fort Wayne man, Marcus D. Dansby, was arrested and initially charged with three counts of murder and one count of attempted murder, police have said.\nThe slayings are being investigated by city police, the coroner's office and the Allen County prosecutor's office.\nFor more on this story, visit www.journalgazette.net later today or see Tuesday's print edition of The Journal Gazette."}