{"uri": "http://wane.com/2016/09/11/stabbing-shooting-deaths-of-family-members-unborn-baby-rules-homicides/", "title": "Stabbing, shooting deaths of family members, unborn baby ruled homicides", "dct": "Sun, 11 Sep 2016 21:35:00 GMT", "id": "a4f1881ae34a4114decd4b18c3cb3c32", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nFORT WAYNE, Ind. (WANE) – Fort Wayne Police Chief Steve Reed said the three people and an unborn baby killed inside a Holton Avenue home early Sunday died in an apparent domestic situation.\nPolice were called to the home at 3006 Holton Avenue around 4 a.m. Sunday. When police arrived, the bodies of 37-year-old Consuela Arrington; 18-year-old Dajahiona Arrington; 18-year-old Traeven Harris, all of Fort Wayne, were found dead inside the home. Each victim suffered gunshot wounds to the head. The Allen County Coroner’s Office on Monday ruled each death, along with the unborn male child of Dajahiona Arrington, homicides. According to the police affidavit, Arrington was 8.5 months pregnant.\nAnother victim – 14-year-old Trinity Hairston – was taken to the hospital in critical condition from sharp force trauma and gunshot wounds, according to the affidavit.\nAccording to the affidavit, when police arrived on the scene, they found Marcus Dansby, 20, covered in blood and leaning over the couch, crying and asking for help.\nPolice escorted him to the front porch where he was patted down for weapons. Police found a large knife with a broken handle, covered in blood in Dansby’s front pocket.\nDuring an interview with police, Dansby immediately told the investigator, “I am still hearing gunshots,” and reportedly asked, “Did anyone survive?” according to the affidavit.\nWhile Chief Reed said the killings are being investigated as a domestic situation, it’s not clear yet what the motive was.\nAccording to the affidavit, Dansby told police Dajahiona Arrington was his girlfriend. Another male resident of the home, who had called 911, said that Dansby and Arrington had dated in the past, but broke up because Arrington was carrying a baby that was not Dansby’s. The man said Dansby had not been at the house in months.\nDansby told police he and Dajahiona Arrington went to lie down in her room when he heard a commotion downstairs. As he made his way down the steps, he heard gunshots before running back into Arrington’s room and hiding in the closet, according to the affidavit.\nDansby said he later saw a man with a knife and had attempted to offer first-aid to Harris, Hairston, and Consuela Arrington. He said he had not tried to call 911 because he did not have a cell phone. When police found a cell phone on him, he said the cell phone belonged to Consuela Arrington, according to the affidavit.\nDansby had cuts on his left hand and initially told police he did know where the cuts came from. Later he remembered “his cat scratched him,” according to the affidavit.\nDansby was arrested on three counts of murder and one count of attempted murder. He’s being held in the Allen County Jail without bond.\nPolice said they are not currently looking for any other suspects.\nWith the deaths, the Allen County Coroner said the county has seen now 31 homicides in 2016.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}