{"uri": "http://6abc.com/news/14-year-old-boy-shot-and-killed-in-mayfair/1629690/", "title": "Friend witnesses murder of 14-year-old Northeast High School student in Mayfair", "dct": "Wed, 30 Nov 2016 00:00:00 GMT", "id": "649bca682497b8f2c7e85ad4f04a1ec5", "content": "MAYFAIR (WPVI) --\nA friend who was with a 14-year-old boy when that boy was shot and killed Monday night in Mayfair is telling his story.\nThe friend, who asked to remain anonymous for his safety, spoke to Action News Tuesday evening.\n\"We saw two men walk up from my left and they had guns, and we just turned around and started running,\" the friend said.\nFourteen-year-old Ian Wilsey was shot and killed shortly before 9 p.m. Monday on the 6200 block of Brous Street in the Mayfair section of Philadelphia.\nWilsey lived on Cottman Avenue and was a ninth grader at Northeast High School.\nAccording to police, Wilsey and his friend were walking to a nearby store when two men approached them.\nWilsey's friend told homicide detectives that's when the boys saw those two men with guns and started running.\n\"They just started shooting,\" the friend told Action News Tuesday night. \"They didn't say anything. They didn't stop to talk to us. They just started shooting.\"\nWilsey was shot three times, one of the bullets went through his heart.\n\"He didn't make it in time to run,\" the friend said.\nNeighbor Chrissy Calel heard the gunfire.\n\"You don't expect to hear the gunshots. You always think it's fireworks or something. I realized after the first shot, I was like get away from the window,\" Calel said.\nWilsey was able to run a few feet before collapsing.\n\"After I heard the gunshots, I heard him screaming,\" the friend said.\nThe friend was uninjured and ran for help. He returned minutes later with an adult to a grisly scene.\n\"Me and him went outside to go check on him, and we seen him get picked up by the cops for a scoop and run,\" the friend said.\nWilsey was taken to Aria Health Torresdale, where he died.\n\"I thought he was going to make it. I was praying the whole time,\" the friend said. \"I just want him back. I just want him back. I miss him so much.\"\nFrank Myers, another close friend and classmate of Wilsey's at Northeast High, said he was told of the shooting at school.\n\"I went to school,\" said Myers. \"They took me inside a classroom and they said, 'You know, your friend Ian got shot,' and I'm like, 'That's fake.' I couldn't really believe it.\"\nAfter he briefly visited Wilsey's family and saw Wilsey's brother Charles, Myers said he knew it was true.\n\"I went in there and saw Charles crying. He's not the person to cry, and I really saw him crying, and I was like, that's a shame, man,\" Myers said.\nThe suspects are still on the loose and witness descriptions are vague. But they believe the two men exited a car and ran off.\n\"According to witnesses, the shooters were two males. One was wearing a dark hooded sweatshirt, the other one was wearing a very small beanie hat on his head,\" Philadelphia Police Chief Inspector Scott Small said.\nAnyone with information should contact Philadelphia police at 215-686-TIPS.\n\"It's conceivable because of the hour and the Eagles game was on, a lot of people may not have seen anything, but more so if you hear anything, don't hesitate to call, that could be your child,\" said Philadelphia Police Commissioner Richard Ross."}