{"uri": "http://wsvn.com/news/local/7-injured-in-nw-miami-dade-drive-by-shooting/", "title": "7 injured in NW Miami-Dade drive-by shooting", "dct": "Sun, 01 Jan 2017 00:00:00 GMT", "id": "aa5c55aab2069af6cb03990f9c8a4a18", "content": "MIAMI (WSVN) - MIAMI (WSVN) – A South Florida community is still reeling after, police said, four adults and three teenagers were shot outside a home in Northwest Miami-Dade.\nAll of them survived but several remain hospitalized, two days after the shooting occurred.\nMiami-Dade Police and Fire Rescue responded to the scene of the drive-by shooting, near the corner of Northwest 81st Street and 14th Avenue, Sunday evening.\nAccording to investigators, the victims, including a 15-year-old and two 17-year-olds, were standing outside of a residence when a dark blue, newer model sedan approached them and stopped, just before 6 p.m. “We’re presuming they were outside celebrating. They were standing outside of the home,” said Miami-Dade Police Detective Robin Pinkard.\nThe victims were identified Monday morning by Miami-Dade Police as 15-year-old Ramont Gage, 17-year-old Tamyra Milfort, 17-year-old Aaliyah Barr, 18-year-old Dewayne Leon, 20-year-old Shaquanna Ross, 30-year-old Alfredo Hudson and 43-year-old Tekeiki Taylor.\nTuesday afternoon, Milfort remains in the ICU. She was last listed in serious condition. The hospital has not released details on Taylor, Gage and Hudson, but their last known condition, on Monday, was that they were stable and are expected to be OK.\nLeon and Ross were released Tuesday afternoon. Barr was the first victim released, Monday evening.\nBarr is the daughter of Taylor, a Miami-Dade Corrections officer. They live in the home right next door to where the shooting happened.\nShe spoke to 7News, as she left Jackson Memorial Hospital. “I’m doing fine, just in a little pain,” she said as she broke down in tears.\nA neighbor, Miss Thomas, said she heard the shots. “It was like, ‘Pop, pop, pop, pop, pop, pop.'”\n“I thought it was firecrackers,” said neighbor Shannon McGowan. “I did see some young people running into the house, the pink house.”\nParamedics transported the victims to area hospitals. Officials said three of the victims, including two of the teens, were transported as trauma alerts to Jackson Memorial Hospital.\n7News cameras captured a large crowd of concerned friends and family members outside Jackson Memorial, Sunday night. A young woman was seen breaking down in tears.\nAt the crime scene, evidence markers in the street revealed where the bullet casings landed.\n“Bullets don’t have eyes,” said Leon’s mother, who asked not to be named or show her face on camera.\nShe added that her son is home from the hospital after having sustained a bullet wound to the inner thigh. “It’s just sad, and it’s hurtful. It’s very hurtful to see these kids have to suffer with death,” she said.\nThe concerned mother said she’s thankful she does not have to bury her son. “We had just gotten into 2017, and here it is already,” she said. “I never would have imagined that my kids would have been caught in gunfire.”\n“Children don’t know any other way to correct a situation besides violence,” said the mother of one of the victims, who identified herself as Mrs. Thompson.\n“Something needs to be done. We’re not going to have a generation, because they’re all being killed,” said Scott.\nThe driver and occupants inside the vehicle remain at large.\nPolice believe four or five men were inside the vehicle at the time of the shooting.\nThe motive behind the shooting remains under investigation.\nIf you have any information on this shooting, call Miami-Dade Crime Stoppers at 305-471-TIPS. Remember, you can always remain anonymous, and you may be eligible for a $3,000 reward.\nCopyright 2017 Sunbeam Television Corp. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}