{"uri": "http://www.pjstar.com/news/20160623/luciano-bullet-spares-girl-but-might-kill-her-future---if-anyone-cares", "title": "Growing fallout from Donald Trump's new immigration crackdown", "dct": "NODATE", "id": "2ae1c1971cefa00861935c566b4eddde", "content": "The fallout grew Saturday from President Donald Trump's immigration crackdown as U.S. legal permanent residents and visa-holders from seven Muslim-majority countries who had left the United States found they could not return for 90 days.\nRead more\nWhat does art taste like? Sculpture Walk inspires local chefs\nPEORIA - Food and sculpture, two very different creative disciplines, are highlighted in Sculpture Walk's promotion \"What Does Art Taste Like?\" Fourteen area restaurants are creating menu items inspired by the artwork in Sculpture Walk 2016 in the Peoria Warehouse District. Area chefs embraced the challenge. Ryan Dunkle, executive Chef at Two25, toured the display several times before choosing \"Uppercut\" by Santa Fe artist Alex Barrett. \"Uppercut\" reminded me of this strange creature you would find in the sea,\" said Dunkle, who create Crab Stuffed Prawns Genovese, a rich dish composed of three freshwater prawns stuffed with crab and served over Casarecca pasta with pesto parmesan cream sauce...\nRead more\nLuciano: Exploding vape device torches man's groin\nBenjamin Ellington enjoyed smoking. That is, in the traditional way. Not out of his front pocket. But that's what happened to the Bushnell man when the battery from his vaping device exploded, according to a new lawsuit. The combustion triggered burns to his hand, thigh and genitals, causing \"suffering and disfigurement,\" court documents claim. It's one of multiple recent reports nationally blaming the batteries and device for sudden, accidental and serious burns. A U.S. senator is calling for federal review of what have become generally known as e-cigs...\nRead more\nPEORIA - By sixth grade, Katelyn Kocher had a standard greeting for every teacher at the beginning of every school year. \"Hi, I'm Katelyn. I'm dyslexic. I have a 504 plan, have you read it and do you have any questions?\" she'd ask, referring to the medically-approved plan that lays out how her treatment for dyslexia should be handled in the classroom. Katelyn, now a Dunlap High School senior and aspiring country music singer, practically sings the phrase. She says she was taking control of her disability and her grades...\nRead more\nRivermen goaltender Phaneuf more than enough in 3-0 shutout over Kings\nSOUTHAVEN, MISS. - Three goals proved more than enough as the Peoria Rivermen rode rookie goaltender Storm Phaneuf to victory Friday. Phaneuf notched his first pro shutout, and celebrated a call-up from the FHL with his first SPHL win as the Rivermen rolled 3-0 over the Mississippi RiverKings before 3,514 at Landers Center. Peoria's power play unit notched two goals, while the surging Rivermen won their fifth straight and jumped from fifth into a second-place tie in the SPHL. Phaneuf was backed by goals from Mike Colantone, Dakota Klecha and Alec Hagaman to beat goaltender and SPHL Player of the Week Brad Barone...\nRead more\nBLOOMINGTON - The Eureka girls basketball team is 22-2 and are No. 2 in the Class 2A rankings, but the Hornets are playing for a greater purpose that can't be measured by success on the court. If you watched the team play in November and December, you may have noticed players wearing warm-up shirts that read, \"We play for Wendy.\" Eureka super fan Wendy Parsons, 83, was diagnosed with pancreatic cancer in December and he has decided to forego chemotherapy. \"The doctors told me I wasn't getting any better, and at that time they told me '6-12 months' and I took one round and thought it's not worth it,\" Parsons said...\nRead more\nEAST PEORIA - The notion that East Peoria philanthropist Peg Bahnfleth wanted a local sculptor to create a large piece of civic sculpture has been locked now for more than four years in the memories of two men who knew of her wishes firsthand - Commissioner Tim Jeffers and sculptor Bob Emser. Now her wishes can be confirmed, and in her own words. \"Thank you for the telephone message Sat., March 16, 2013, regarding the proposed 'on the triangle (Civic Plaza)' bandshell (sculpture) in East Peoria of which you and I have talked several times,\" Bahnfleth wrote to Jeffers almost four years ago...\nRead more"}