{"uri": "http://www.pjstar.com/news/20160613/girl-shot-early-monday-while-sleeping-inside-south-peoria-home?page=2", "title": "Girl shot early Monday while sleeping inside South Peoria home", "dct": "NODATE", "id": "b57b1d376925f745919205efbe0843ce", "content": "PEORIA - A girl suffered what police described as a non-life threatening injury early Monday when she was shot while sleeping inside a South Peoria home.\nShe was the second victim of apparently unrelated drive-by shootings in the city in a matter of hours. The conditions of the victims could not be obtained later Monday.\nThe ShotSpotter gunshot detection system alerted police to 10 rounds fired about 10:40 p.m. Sunday in the 700 block of Voris Street, and police arrived within minutes to find witnesses exiting a home in the 1100 block of Northeast Glendale Avenue.\nThey said shots had come from a black sedan with yellow stripes, with a truck also possibly involved, according to a report. While police were on the scene, a victim arrived at a Peoria hospital in a private vehicle with a gunshot wound.\nOfficers found shell casings and a samurai sword in an alley near where witnesses said some of the gunfire erupted. No arrests were made.\nShow more...\nLater, police responded about 4:45 a.m. Monday to the 1400 block of South Arago Street when ShotSpotter alerted officers to a few volleys of gunfire within seconds of each other. The system detected 18 gunshots, according to authorities.\nThe adolescent victim, whose exact age could not be immediately verified, was struck by a bullet that penetrated the exterior wall of the house while she slept.\nNo additional details about the shooting were available later Monday. Peoria police did not return multiple calls seeking information. No arrests had been made in connection with the incident by 7 a.m.\nThe area immediately surrounding the house where the girl was shot has been the scene of multiple incidents of gunplay over the last month and is one block away from where a 17-year-old boy died after being shot in January 2015. Tyrone \"Rocky\" Jones, Jr., lived a block away from where his body was found.\nA drive-by shooting in the East Bluff in August 2011 claimed the life of a sleeping 8-year-old boy. The death of Albert Billups-Wilson ultimately led to the city adopting the Don't Shoot program the next year.\nBoth homicides remain unsolved.\nMatt Buedel can be reached at 686-3154 or mbuedel@pjstar.com. Follow him on Twitter @JournoBuedel."}