{"uri": "http://abc3340.com/news/nation-world/police-2-dead-at-least-2-wounded-in-roanoke-active-shooter-situation", "title": "Roanoke shooter identified; 2 people, including shooter, dead, 3 wounded", "dct": "Tue, 25 Oct 2016 00:00:00 GMT", "id": "81f590496420cdef1bc3035157a0e0a6", "content": "ROANOKE, Va. (WSET) - Two people are dead after an active shooting situation at the FreightCar America building in Roanoke, Virginia, Tuesday morning. Police identified the shooter as Getachew Fekede, 53, who came to America from Kenya in 2011 via a refugee program.\nFekede lived in the 2000 block of Lynn Avenue, SW.\nPolice say Fekede arrived by bicycle Tuesday morning at FreightCar America before the shooting.\nOfficials say crews got the call at 6:08 a.m.\nThey say Fekede fired 10 rounds from a 9 mm handgun. ATF is determining who owned the gun and how Fekede was able to get it.\nFekede is a former employee of FreightCar America and police do not know if he was a product of bullying or if he was targeting the victims. Getachew Fekede worked at FreightCar America until March 2016 when he stopped showing up to work.\nJones says some of the property in the 800 block of Campbell Avenue Southeast belongs to Norfolk Southern and some belongs to Freight Car America. As of 11:45 a.m. Safer City Roanoke reported the police crews had finished their sweep of the area.\nAccording to their Facebook page, nothing suspicious was found during the sweep.\nOfficials say no officers were involved in this shooting. They say a witness locked himself inside and reported the incident. Roanoke Police say one employee was fatally shot and the identify of that person and the others that were wounded are not being released at this time in consideration for out-of-state families.\nFekede was found dead at the scene from what appeared to be a self-inflicted gunshot wound, according to police.\nStreets around the area have been blocked off including 8 1/2 Street and Tazewell.\nChief Jones says the shooter was believed to be an employee or ex-employee of Freight Car America. He says they are working to confirm that.\nPolice say both Freight Car America and Norfolk Southern have been evacuated.\nPolice say one of those dead is an employee, and the second is believed to be the shooter.\nAccording to a Facebook post from Safer City Roanoke, there is \"zero indication of any further threat in the area.\"\nPolice said in a news conference that they believe Fekede acted as the sole perpetrator and there is no evidence of any other individuals being involved.\nOfficials with Carilion Roanoke Memorial Hospital say they received three patients from the scene. They say all patients suffered from gun-related injuries.\nThe hospital says one person is in good condition. The other two victims are listed as being in fair condition and serious condition, respectively.\nFreightCar America has released a statement about the shooting:\nFreightCar America extends its deepest condolences to everyone affected by the tragic events that occurred at our Roanoke facility earlier this morning. We are working closely with federal, state, and local law enforcement to determine what happened and ensure that our employees are safe. Due to the ongoing nature of this investigation, and out of respect for our employees and their families, we cannot provide specific information about the victims at this time.\nPolice said they are still investigating."}