{"uri": "http://miami.cbslocal.com/2013/12/02/liberty-city-shooting-leaves-two-women-dead-two-injured/", "title": "Liberty City Shooting Leaves Two Women Dead, Two Injured", "dct": "Mon, 02 Dec 2013 08:41:00 GMT", "id": "5c99aadf98d2815b2990efc5701e99a7", "content": "MIAMI (CBSMiami) – Drugs may have been at the center of a Liberty City shooting over the weekend which left two women dead and two others in the hospital.\nWhen officers arrived in the area of NW 64th Street and 12th Avenue early Sunday, Dec. 1st, in response to call about gunfire they found a bullet ridden car and four women suffering from gunshot wounds.\nMiami Police Chief Manuel Orosa said investigators believe the women had gone to a house in the neighborhood to buy drugs and it was the man who drove them there who was the target.\nTwo of the women were not breathing and had no pulse, according to Carroll. They were taken to the Ryder Trauma Center where they were pronounced dead.\nPolice have identified them as 18-year old Tiarra Ashonda Grant and 22-year old Shalaunda Williams. Grant left behind a 1-month old baby.\nA 23-year old with multiple gunshot wounds to the leg was also taken to the Ryder Trauma Center.\nThe fourth woman, who was shot in the arm, was taken to Jackson Memorial Hospital.\nPolice have withheld the names of the two survivors.\n“I just think that it’s crazy because it’s women and stuff, like it’s crazy, the community is crazy, they killing women it don’t matter,” said China Black who lives in the area.\nNeighbors with children said they are on edge about the whole situation.\n“As a father this is one reason why I keep my children inside. I don’t allow them to come out and play because a lot of times some of these things just pop off unexpectedly, in broad daylight. There’s no time for violence. When it happens it happens,” said Al Barley.\nAnyone with information on the shooting is urged to call Crime Stoppers at (305) 471-TIPS."}