{"uri": "http://abc7ny.com/news/1-dead-3-hurt-after-shooting-at-brooklyn-hookah-lounge/960215/", "title": "1 dead, 3 hurt after shooting at Brooklyn hookah lounge", "dct": "Fri, 28 Aug 2015 00:00:00 GMT", "id": "ecebc36e13bad2b8517e1a80bca6dcb3", "content": "BROOKLYN, N.Y. (WABC) --\nOne person is dead and three others injured after a shooting inside a Brooklyn lounge early Friday.\nThe gunfire rang out inside Buda Hookah Lounge in the 500 block of Flatbush Avenue in the Prospect Lefferts Gardens section just after 3 a.m.\nThe man who was killed, 27-year-old Christopher Phillips, was shot multiple times in the head and torso and pronounced dead at Kings County Hospital.\nAuthorities say Phillips, a father of two, had gang connections and that the shooting may be gang related. They believe he was the intended target.\nThe shooting was captured on surveillance video inside the lounge, and it reportedly shows the suspect wearing black and white clothing. First, he is sitting calmly in the lounge before he gets into an argument with the victim. He then takes out his weapon and shoots multiple times at close range.\nAs he tries to escape, he falls down, gets back up and effectively starts shooting his way into the crowd to clear a path for an exit.\nThe rest of the victims, all in their 20s, were struck in that gunfire. They are all expected to survive.\n\"My heart's everywhere,\" Phillips' sister Jazz Phillips said. \"It's shattered.\"\nShe tells Eyewitness News that her brother had been to the bar many times before, and that she's still in shock over the events that transpired.\n\"I look at the doctor's face, and all I hear is blah blah blah, your brother passed at 3:30 this morning,\" Jazz Phillips said. \"After that, I blanked out.\"\nAnd while he had a history with the law, including 10 prior arrests for crimes such as assault and grand larceny, to her, there was much more to him than that.\n\"I am not justifying my brothers wrongs,\" she said. \"Chris was seen as a bad guy. To people who loved Chris and knew Chris, he was seen as a family man.\"\nNow, she recalls the insight he shared before his life was cut short.\n\"He like, 'You don't know what could happen tomorrow, so live for today,'\" she said. \"I never understood what he meant. Today I do.\"\nJazz Phillips believes her brother knew his killer. Police are still searching for him, and anyone with information is asked to call CrimeStoppers at 1-800-577-TIPS (8477)."}