{"uri": "http://www.news4jax.com/news/four-people-shot-in-brentwood-neighborhood_", "title": "Tensions high after teen killed in Brentwood shooting", "dct": "Mon, 15 Aug 2016 23:23:00 GMT", "id": "4cba1f2977522c4ecaa8c7ec7c3a120a", "content": "JACKSONVILLE, Fla. - The shooter who killed a 14-year-old girl Friday night outside a Brentwood apartment should be looking over his shoulder, the girl's family said Monday.\nTamia Sanders was sitting outside her home, near West 38th and Silver streets, with her mother and several other adults about 8:30 p.m. Friday when someone opened fire, according to her mother's longtime boyfriend, Shamon Gregory, who was also shot.\nTamia, who was shot in the head, died, and her mother, Kenyata Williams, suffered critical injures. Williams is still in the hospital, according to Gregory, who was released from the hospital Monday.\nPolice are still searching for the gunman.\nGregory said he hopes police find whoever the shooter is because he knows tensions are running high in the neighborhood, and he wants justice for Tamia, whom he considers a stepdaughter.\n“I hope they get them. I really do,” Gregory said. “But police ain’t the only people that are looking for them, so I hope that police get to them before anyone else does.”\nGregory said Tamia was an honor student, and he can't believe she's gone.\n“She was an angel, had the prettiest smile, just an all-around great kid,” Gregory said. “(She) wasn’t in too much trouble; never stayed out too late. She ain’t never did anything like that.”\nGregory said he was shot in the lower back, and the bullet bounced off his pelvic bone and exited through his backside. He was still hobbling from the wound Monday.\n“We were all just sitting on the porch enjoying our Friday, enjoying our day off, and I had just got home from work. I wasn’t even home an hour,” Gregory said.\nA second unidentified man was also shot, according to police.\nAnyone with any information about the shooting is asked to call Crime Stoppers at 866-845-TIPS.\nGregory said Tamia's family is in touch with a victims' service agency to discuss funeral arrangements, which have not been finalized yet.\nCopyright 2016 by WJXT News4Jax - All rights reserved."}