{"uri": "http://www.washingtontimes.com/news/2013/jan/29/dc-police-release-person-interest-photos-club-shoo/", "title": "D.C. police release ‘person of interest’ photos in club shooting", "dct": "Tue, 29 Jan 2013 00:00:00 GMT", "id": "0ddf540f3dbd2e3849cdea803d5dacba", "content": "The Metropolitan Police Department released photos Tuesday of two men investigators are trying to question about a shooting at a Northeast D.C. nightclub that injured five people.\nThe shooting happened as the club, D.C. Soundstage, was closing in the early morning hours Saturday. One man was involved in an altercation with a patron as the club closed, left the club, then re-entered and began firing inside, Metropolitan Police Department spokesman Officer Hugh Carew said. One woman and four men were shot, but all five were expected to survive.\nPolice described the shooter as a 20- to 25-year-old black man, about 6 feet tall, with shoulder-length dreadlocks and a full beard who possibly wore all black clothing. He is not one of the men shown in the photos police released Tuesday, Officer Carew said.\nThe two “persons of interest” whose photos were released are described by police as a black man wearing no shirt, blue jeans and a dark skull cap, and a second black man wearing a black top and with his braided hair pinned up.\nPolice Chief Cathy L. Lanier ordered D.C. Soundstage closed through Wednesday after the shooting. The District’s Alcoholic Beverage Control Board will review a report on the incident at their Wednesday meeting and could make further recommendations.\nCopyright © 2017 The Washington Times, LLC. Click here for reprint permission.\nSponsored\nWe were unable to load Disqus. If you are a moderator please see our troubleshooting guide.\nRecommending means this is a discussion worth sharing. It gets shared to your followers' Disqus feeds, and gives the creator kudos!\nRead full terms and conditions\nThey look just like Obama's sons... if he had sons.\nSponsored\nClick to Hide"}