{"uri": "http://www.reviewjournal.com/news/las-vegas/coroner-identifies-19-year-old-killed-accidental-shooting-park", "title": "Coroner identifies 19-year-old killed in accidental shooting at park", "dct": "Sat, 03 Sep 2016 12:56:00 GMT", "id": "9581b3c5eaf2629b6b7640d5ccb7de03", "content": "D’Andre Dickerson said that when he laid his friend Javante Stockard on the Palacio Park parking lot Thursday, his hand entered the exit wound of a gunshot.\nStockard, 19, had been shot in the chest in the backseat of the car they had occupied.\nStockard was shot accidentally at about 8 p.m. Thursday inside a car parked at Palacio Park, 947 W. Lake Mead Blvd., the Metropolitan Police Department said. The Clark County coroner’s office said Stockard died of a gunshot wound to the chest; his death was ruled a homicide.\nThe Clark County district attorney’s office will work with Metro homicide detectives to determine whether any charges will be filed. No one is in custody.\nDickerson, 19, had been in the car’s front seat, Stockard in the back with another person. The driver, Dickerson said, was outside the vehicle with a gun. Dickerson named neither the other backseat passenger nor the driver.\nDickerson said there was an argument about whether the driver’s gun was loaded; though the gun had no magazine, Dickerson said there was a single round in the chamber.\nDickerson said when the driver pulled the trigger, a bullet struck Stockard.\n“I basically watched my friend die,” Dickerson said.\nDickerson said he tried and failed to treat his friend’s wounds in the car. So he laid him on the ground to try again.\n“He didn’t deserve it,” Dickerson said. “He was a good young man with a golden heart.”\nDickerson said his mother had taken Stockard into their home several months ago. Dickerson said he and Stockard were considering their futures and contemplating joining the military.\nWhen Stockard was being loaded into an ambulance bound for University Medical Center, Dickerson he wanted to ride along, but stayed at the scene as a witness to police.\nDickerson said he learned of Stockard’s death about 11 p.m. that night, then broke down.\n“It plays in my mind over and over again every night,” Dickerson said. “He didn’t deserve it.”\nNyree Puente, a 17-year-old who knew Stockard, said he was “a good friend.”\n“He was goofy. He would love to sing, but he couldn’t sing,” Puente said, laughing. “He always had a positive energy around him.”\nKimbryanna Smith, Puente’s 17-year-old sister, said she was stunned to hear Stockard had been killed.\n“It was actually shocking,” Smith said.\nSmith said Stockard liked to stay in and play video games; Dickerson said the two had played together many times.\n“He likes to laugh, he likes to make other people laugh,” Smith said. “He’s really the joker.”\n“It will be OK,” Smith said. “I know he’s in a better place.”\nDickerson said he’ll never forget the friend he lost.\n“His memory will live on in us and everyone else whose life he filled with joy.”\nReview-Journal reporter Max Michor contributed to this story. Contact Christian Bertolaccini at cbertolaccini@reviewjournal.com and 702-383-0381. Follow @bertolaccinic on Twitter."}