{"uri": "http://www.sfgate.com/bayarea/article/Downtown-Oakland-rush-hour-shooting-sends-8157911.php", "title": "Teen girl killed, 3 others hurt in downtown Oakland shooting", "dct": "Sat, 18 Jun 2016 00:00:00 GMT", "id": "25c04c994eae19b8c9fa7db60feb662f", "content": "A broad-daylight shooting in downtown Oakland on Tuesday killed a teen girl and injured three others as multiple gunshots rang out during the evening commute.\nPolice described a chaotic scene at 13th and Franklin streets, where the shooting occurred.\nWitnesses reported two gunmen on foot who hit victims along half of a city block, said Lt. Carlos Gonzalez. Windows of businesses in the area were blown out by the gunfire.\nThe surviving victims, male and female ranging in age from mid-teens to early 20s, were all reportedly in stable condition, police said.\nWitnesses said the 16-year-old girl who died had been shot in the neck.\nThe shooting happened near a large family gathering at an entertainment facility, Venue, on 14th Street. Dozens of people inside and outside the facility were there after attending a funeral for two Oakland teens who drowned in a Stanislaus County reservoir over Memorial Day weekend.\nAt least some of the victims were connected to the memorial event.\nOne witness was walking down 14th Street about a block away when he heard multiple gunshots fired in rapid succession at 5:41 p.m.\n“And then basically there were people running every which way,” said Mason Stone, 39.\nThe Oakland resident ducked behind a car until the shots stopped.\nPeople started running toward the corner where it appeared someone was hit, he said. He immediately left the area.\n“The really scary thing, coming on the heels of the shooting in Orlando, you wonder is it gang related or is it a crazy gunman,” he said. “I guess you figure sooner or later if you live in a city like that you ... realize anything can happen at any time.”\nAnother witness, who didn’t want to be identified for safety reasons, said he watched the shooting unfold after an argument among a group of men playing a dice game along the street and said the vigil participants were caught in the crossfire.\nA security guard at Venue, Oscar Edwards, said he was inside when the shooting occurred and shocked at the timing and location.\n“This is very strange,” he said. “Downtown Oakland has changed a lot. Downtown is one of the safest places now. This was an isolated incident.”\nStreets around the shooting scene were blocked to traffic into the evening as police investigated the incident.\nJill Tucker and Jenna Lyons are San Francisco Chronicle staff writers. Email: jtucker@sfchronicle.com, jlyons@sfchronicle.com Twitter: jilltucker, @jennajourno"}