{"uri": "http://www.eastbaytimes.com/breaking-news/ci_30019171/police-identify-teen-slain-downtown-oakland-shooting", "title": "Police identify Antioch teen slain in downtown Oakland shooting", "dct": "Wed, 15 Jun 2016 13:29:00 GMT", "id": "d2b4fe34dff14aa7a8cd2fbddab51086", "content": "OAKLAND — A 16-year-old Antioch girl gunned down while attending a vigil in downtown Oakland has been identified as Reggina Jefferies, police said Wednesday.\nReggina, a Deer Valley High School student, was with a group about 5:41 p.m. Tuesday, on the 1300 block of Franklin Street, when a gunman opened fire. She was hospitalized in grave condition and later died; three other teens, two boys and a girl, suffered gunshot wounds and were treated and released from a hospital, according to police.\nPolice did not release any information on a motive for the shooting. Shell casings were discovered at the scene and a vehicle was seeing fleeing eastbound on 13th Street afterward. No suspects have been arrested.\nThe group was attending a vigil in the area of 14th Street and Broadway for two 15-year-old Oakland boys who drowned in Stanislaus County over Memorial Day weekend.\nJosiah Pratt-Rose and his best friend, Jamari Wilson, died May 28 after jumping into the Woodward Reservoir, apparently without life jackets, according to the Stanislaus County Sheriff’s Department.\nOakland police initially said there were as many as six people wounded by gunfire Tuesday, but later changed that figure to four after further medical evaluation determined some of the injuries were not caused by the shooting itself.\nPastor Kevin Hope, who officiated the funeral services for the two boys at Acts Full Gospel Church in East Oakland Tuesday, said he was shocked by the events that happened at the vigil afterward.\n“She performed a praise dance during the funeral service, she did a fantastic job. It’s just an unfortunate tragedy,” Hope said.\nSeveral hundred people attended a vigil for Reggina Wednesday evening, sharing stories about the teenager.\n“Let’s stop the killing and start the healing,” people in the crowd shouted after one fiery testimony from one woman who lamented having to attend funerals as well as graduations.\nAs Oakland police officers stood off to one side by the Golden Lotus, where wooden panels replaced the glass shot out by bullets Tuesday, people stood and listened, showing equal measures of sadness and resolve.\nSharon Rafferty, mother of Kris Rafferty, who was on the Fruitvale BART platform when Oscar Grant was later shot and killed by a BART officer, talked about the lingering pain of losing her son to gun violence.\n“It doesn’t just hurt, and these thugs or cowards on the street, they don’t realize the damage that they do,” she said. “Yes, you have killed your enemies, but you have also killed the mothers, the fathers, the children. … It’s not right.”\nPolice and Crime Stoppers of Oakland are offering up to $25,000 in reward for information leading to the arrest of the shooter. Anyone with information can call police at 510-238-3821 or Crime Stoppers at 510-777-8572."}