{"uri": "http://www.montgomeryadvertiser.com/story/news/crime/2016/09/27/10-year-old-shot-north-montgomery/91189098/", "title": "10-year-old shot in north Montgomery", "dct": "Tue, 27 Sep 2016 00:00:00 GMT", "id": "cefb5a02825d837d064947bc173e4390", "content": "Andrew J. Yawn / Advertiser\nIt was about 3 a.m. when Latarsha McKee woke up to the sound of gunfire on Garden Street.\n“When we were asleep, I heard gunshots, so I jumped up and woke my children up telling them to get up,” McKee said.\nThree of her children made it safely out of the bedroom that sits in the front corner of the house, the walls of which are now riddled with nearly a dozen bullet holes from the front and the side. The fourth, 10-year-old Achassity, was shot in the leg before she was able to escape Tuesday morning.\n“When she came out the room, she went in my sister’s room. She’s like, ‘Mom, I’m bleeding.’ I looked down and she had a bullet hole in her leg, and my sister called the ambulance,” McKee said.\nAchassity was taken to the hospital, but was released later Tuesday. Exactly 12 hours later, McKee was packing her belongings.\nNone of McKee’s children were in the house as she packed.\n“We can’t stay here anymore. That’s why I’m packing my stuff up and going about my business. That could have been my child’s life,” McKee said.\nMcKee said shootings on and around Garden Street happen “all the time.”\nOther neighbors, who declined to go on the record for fear of their own safety, confirmed the gun violence in the area.\nMcKee said she also heard gunfire about 11 p.m. Monday night just before she went to sleep and four hours before her daughter was shot.\nAs for the shooting that injured her daughter, McKee said it was not random. She said the shooting was meant for the person who shot and killed 19-year-old Zhivago “Stank” Hines on Clinton Street Saturday night.\n“They said it was because of the shooting where the boy got killed this weekend ... I guess they thought he stayed down here,” McKee said before confirming she was referencing Hines. “The boy thought (the shooter) was here and came down and shot it up.”\nWhile McKee walked around the outside of the house examining bullet holes, one man who declined to identify himself lifted up his shirt to reveal a gun in his pants, “for security,” he said.\nThis is not the first shooting north Montgomery has experienced.\nThe streets near Garden Street were the site of three fatal shootings in the summer.\nDemetrius Kelly, 22, was killed on Kiwanis Street on May 4. Steven Merriweather, 20, was shot by an AK-47 assault rifle on Vandiver Boulevard on May 5 and died after being taken to the hospital. Darnell Bush, 30, was shot and killed during a robbery on West Park Avenue on June 20.\nMontgomery Police Department Lt. Denise Barnes confirmed the shooting of a juvenile on Garden Street Tuesday morning and said the police are investigating. She said it's unknown at this time if Tuesday's shooting is related to the killing of Hines.\n\"Both are ongoing investigations and MPD is unable to confirm if the shootings are related at this time,\" Barnes said.\nMPD advised citizens to call CrimeStoppers at 215-STOP with information about Tuesday's shooting.\nNobody is in custody in either case."}