{"uri": "http://www.ajc.com/news/news/2-killed-3-injured-in-gwinnett-county-shooting/nhjN6/", "title": "Police: Man shoots 4 relatives, killing 2, then himself", "dct": "Tue, 14 Oct 2014 00:00:00 GMT", "id": "34698105fee46ae195a51b6aa8203c54", "content": "Three people are dead, including two teenagers, after a shooting Tuesday afternoon in a Gwinnett County apartment. But police late Tuesday had not determined what caused a man to shoot four of his relatives and then kill himself.\nA witness called 911 after hearing gunshots, Gwinnett Police Cpl. Jake Smith said, and in the 6000 block of Bannor Lane in Peachtree Corners, they found 13-year-old Kayla Serrano and 19-year-old Andre Mclean dead at the scene.\nThe two were the niece and nephew of the alleged shooter, 30-year-old Brandon Mclean, and police believed he used a handgun to shoot the two as well as two other relatives – his mother, 57-year-old Betty Mclean, and her sister, 52-year-old Charlotte Longnecker. Betty Mclean was the grandmother of the deceased teenagers. The women were taken to Gwinnett Medical Center and were reported to be in serious but stable condition, Smith said.\nFollowing the shootings, Smith said, Brandon Mclean was taken from the scene with an apparent self-inflicted gunshot wound and died at the hospital.\n“Detectives are convinced at this point that we’re not looking for any additional suspects, and they’re also convinced at this point that [Brandon Mclean] was the shooter and that his own injury was self-inflicted,” Smith said.\nInvestigators have not found thus far any prior incidents of violence in Brandon Mclean’s history, Smith said, adding that they would continue to delve into the man’s past as the investigation continues.\nPolice continue to speak to friends and family, but are not ready to announce a motive in the case.\nRelated\n“We believe it was domestic-related. We don’t think this stemmed from a robbery or anything along those lines,” Smith said. “We know that Brandon had been in and out of the home prior to the shooting. We do believe he had been staying here before the shooting. The exact circumstances that led up to the shooting, we can’t say precisely at this point, but we’re still fairly early in the investigation.”\n—Staff writer Alexis Stevens contributed to this report."}