{"uri": "http://www.11alive.com/story/news/local/norcross/2014/10/16/murder-suicide-911-family-fund-peachtree-corners/17388883/", "title": "911 call made from murder-suicide", "dct": "Thu, 16 Oct 2014 00:00:00 GMT", "id": "5f8abca8d36eeb1f386e030608e0f9cb", "content": "PEACHTREE CORNERS, Ga -- Police released a 911 call that was made from inside the home where two teens were shot and killed Tuesday in what is being called a murder-suicide.\nThe call was made by Ted Longnecker, the husband of one of the shooting victims, who is in serious condition. Police said Brandon Mclean shot four people in the home before turning the gun on himself.\n\"I think he may have shot my wife,\" Longnecker told the 911 Operator. \"I think he shot my wife dead, but I can't get up there, he's got a gun.\" Longnecker was calling from the first floor of an apartment on Bannor Lane in Peachtree Corners.\n\"He's in the house with a gun, please hurry!\" he told 911.\nWithin minutes Gwinnett County Police arrived at the home and found two teenagers dead from gunshot wounds. Kayla Serrano, 13, a middle school student and Andre Mclean, 19, who graduated from high school last year.\n\"She was just wonderful,\" Autumn Parlor, a cousin, said about Kayla. \"They were so young they hadn't even begun to live their life, it's just horrible.\"\nRelatives of the family said Andre Mclean wanted to be a Marine. He was in ROTC in high school. His cousin, Yogi Armstrong said he was the one everyone went to if they had a problem. \"Basically he wanted to help anybody and anything any way he could and that was the way he saw it,\" he said. He wanted to help his country.\"\nThe two teen victim's grandmother, Betty Mclean, 57, and her sister, Charlotte Longnecker, 52, were both shot and are recovering from serious injuries at Gwinnett Medical Center.\nAccording to police they were all shot by Betty Mclean's son, Brandon Mclean, 31, who turned the gun on himself and died at the hospital. According to the Georgia Department of Corrections, he was on parole for a drug conviction.\nThe family described him as jobless and troubled. \"You could never expect something like this,\" Parlor said. \"I mean it's just devastating.\"\nParlor set up a fund in the names of Kayla Serrano and Andre Mclean to help the surviving members of the family. You can help the family out by going to any Wells Fargo Branch and contribute to the Kayla Serrano and Andre Mclean fund."}