{"uri": "http://www.candgnews.com/news/man-who-shot-child-sentenced-3-12-years-prison-92022", "title": "Man who shot child sentenced to 3 1/2 years in prison", "dct": "Wed, 13 Apr 2016 00:00:00 GMT", "id": "0ba522cc62fd76127655afd5a6a4e4cf", "content": "CLINTON TOWNSHIP — Christian Howard, 25, was sentenced to 3 1/2 years to 10 years behind bars by Macomb County Circuit Court Judge Diane Druzinski for his role in an accidental shooting last May.\nHoward was sentenced for felony charges of second-degree child abuse, receiving and concealing a firearm and possessing a firearm while committing a felony for the incident that took place in Clinton Township’s Normandy Park. A misdemeanor charge of discharging a firearm resulting in injury or death was also included.\nHe received the mandatory sentence of two years for the felony charge of possessing a firearm, which will precede the other three sentences — which will run concurrently. He will serve 15 months for the other three counts, with an earliest release date of 3 1/2 years and a maximum of 10 years.\nThe sentence comes on the heels of a guilty plea by Howard in February. The plea deal with Druzinski was a means of capping Howard’s sentence.\nHoward’s attorney, Ryan Zemke, had no further comment on the plea deal besides saying he was happy Druzinski accepted it.\n“What happened was a terrible accident and he takes responsibility for his actions,” Zemke said.\nThe original incident occurred May 4, when Howard was 24. The Clinton Township resident was at Normandy Park, on Little Mack Avenue near 15 Mile Road, with his fiancée’s son — who is now 4 years old.\nHoward and the boy were in the park at dusk when a park ranger told them the park was closing. The ranger walked away to take care of his own business. Sirens were then heard and authorities found that the boy was injured by a gunshot wound to the head — an incident Howard deemed accidental.\nThe boy recovered in the hospital and is now OK. Zemke said the boy considers Howard to be his father, as he’s “the only father figure in his life.” The boy was the female’s son from a previous relationship, though at the time she was pregnant with Howard’s child. That baby is now about a couple of months old.\n“(The fiancée) spoke at sentencing and asked (Druzinski) for leniency, and she spoke about the positive impact of Howard (on her and her son),” Zemke said."}