{"uri": "http://www.myfoxdetroit.com/story/28985633/police-identify-3-year-old-boy-shot-in-clinton-twp-park", "title": "Police identify 3-year-old boy shot in Clinton Twp park", "dct": "Tue, 05 May 2015 21:47:00 GMT", "id": "dc3217f38d721ef2fb21a8e112a5758a", "content": "A 3-year-old boy is recovering after he was shot in the head at a Clinton Township park.\nPolice say that they do not believe the child was shot by a stray bullet or in a drive-by and are still looking for witnesses or the weapon at Normandy Park.\nClinton Township police say the 3-year-old, who neighbors identify as Jemeer Griffin, was at the park Monday night, with his mother's boyfriend, after she dropped them off.\nWitnesses say they were playing in a wooded area in the back of the park just after it closed around 8:30. That was when Griffin was then shot in the back of the head.\nPolice identify 3-year-old boy shot in Clinton Twp park\n\"At this point and time it's not clear why they were in the wooded area,\" said Police Chief Fred Posavetz.\nJemeer's mother, Marquesha Moore, was too distraught to speak to FOX 2 Tuesday. But Jemeer, who turns 4 on Friday, is awake and talking after being rushed to McLaren hospital, police say.\nInvestigators and canine units seen searching the park for the gun, adding that bullet fragments will be compared to other shootings. While those nearby say they didn't see anyone else in the park - or hear anything unusual.\n\"The cop came up to us and asked us if we heard any gunshots,\" said John Jaretz. \"We said no.\"\nClinton Township police say they've questioned the mother's boyfriend who they say was not forthcoming with information but is not a suspect at this point.\nRight now as police dig for answers the park remains quiet.\nThose living nearby feel frightened to return to the park - still surrounded by crime tape.\n\"My dad said I'm not allowed to come here anymore,\" Jaretz said. \"It's sad.\"\n\"This whole community has changed now because of this,\" said resident Ken Tillman, saying he will not be back to the park. \"I'll go somewhere else.\"\n\"I was shocked,\" said resident Frankie Coling. \"Who would shoot a little kid in the head?\""}