{"uri": "http://www.berkshireeagle.com/news/ci_28435940/reports-1-shot-dead-four-wounded-pittsfield-shooting", "title": "Update: 1 killed, four wounded in Pittsfield shooting", "dct": "Mon, 06 Jul 2015 10:40:00 GMT", "id": "9e8b20d22f08e608ae5424e822ee4c4c", "content": "PITTSFIELD — One man was killed and four others wounded in a shooting Saturday night in a vacant lot on Linden Street — the first of two reported shootings in the neighborhood just hours apart, police said.\nRonald Pinel, 25, of Pittsfield, was pronounced dead at the hospital after the shootings, which happened about 11 p.m. in the tree-lined lot near Dewey Avenue, according to the Berkshire District Attorney's Office. Police were alerted to the incident by a 911 call.\nTwo other victims remain in intensive care: a 25-year-old man at Berkshire Medical Center in Pittsfield and a 20-year-old man, who was transported to Baystate Medical Center in Springfield. Two others, a 20-year-old woman and a 26-year-old man, also were treated at BMC for injuries they said occurred as a result of the shooting.\nPittsfield Police Sgt. Matthew Hill said more than one gun was used in the shooting.\nHe stressed that police did not believe there was a shooter on the loose in the city.\n\"There is no need currently for the public to be alarmed or concerned,\" he said.\nOn Sunday afternoon, police also were investigating another reported shooting in the vicinity of 217 Robbins Avenue, about a block from the first crime scene.\nThe block was taped off and several police cars were seen in the neighborhood. Investigators were seen entering and exiting a home on that block with crime scene kits.\nIt was not clear whether the second incident, which was believed to have occurred early Sunday morning, was connected to the Linden Street shooting or if anyone was hit.\nA witness in the first shooting, who chose not to be identified, said he heard an argument and a scuffle followed by gunshots in lot near the corner of Dewey Avenue and Linden Street.\nThe shootings left neighbors rattled. One witness, who asked not to be identified, said he saw three of the victims lying on the ground and was surprised there was only one fatality.\n\"One of them looked pretty bad,\" he said. \"The other two guys looked real bad.\"\nA witness described the scene as confusing, as the shots rang out amid holiday fireworks detonations. In addition, smoke from the fireworks was wafting over the West Side neighborhoods, causing some visual uncertainty, a witness said.\nThe individual with non-life-threatening injuries was arrested on an unrelated warrant, police said.\nMayor Daniel L. Bianchi, speaking from his office Sunday, said he was confident state and local police would learn the facts of the incident.\n\"We're blessed with a very professional police force in Pittsfield, and they've been on this case from the start,\" he said. \"We never expect these things to happen, but they do, and they are never very pleasant.\"\nCity Councilor John Krol, who represents Ward 6, where the shootings occurred, said it was \"an extraordinarily sad day for the city. I don't know all the details, but this is unacceptable, as far as I'm concerned.\n\"It's disheartening,\" he continued, \"but the West Side community has great resilience. We will band together to work toward making sure this does not happen again.\n\"It's a very sad fact of life,\" he said, \"that shootings happen in an urban setting.\"\nAnyone with information pertaining to the incident is asked to call Pittsfield Police at (413) 448-9700.\nThe investigation is being conducted by members of the Pittsfield Police Department, state police detectives assigned to the District Attorney's Office and state police Crime Scene Services.\nThis story will be updated.\nTALK TO US\nIf you'd like to leave a comment (or a tip or a question) about this story with the editors, please email us. We also welcome letters to the editor for publication; you can do that by filling out our letters form and submitting it to the newsroom."}