{"uri": "http://www.nbc12.com/story/29191140/woman-juvenile-victims-of-double-homicide-in-chesterfield", "title": "Police release names of woman, toddler murdered in Chesterfield", "dct": "Fri, 29 May 2015 18:20:00 GMT", "id": "b22889cef222f1eeb43fea2357064c63", "content": "CHESTERFIELD, VA (WWBT) - Police have released the names of a woman and young child who found dead inside a home in the 20300 block of Ferintosh Court in Chesterfield Friday.\nAt about 12:10 p.m. officers went to the residence for a welfare check. Upon arriving and checking the residence, police found 34-year-old Morgan R. Rogers and 1-year-old Leah Rogers dead from gunshot wounds. Both victims lived at the residence.\nInvestigators identified Rogers' estranged boyfriend, 46-year-old Stafford L. Shaw Sr., of New Kent as a suspect in the double homicide. Police obtained arrest warrants for Shaw for: two counts of second degree murder; two counts of use of a firearm in the commission of a felony; two counts of violation of a protective order; and one count of transporting a firearm while under an emergency protective order.\nA few hours later, Shaw was spotted by a Chesterfield detective in New Kent. Chesterfield Police contacted Virginia State Police for assistance in stopping the Chevrolet Corvette Shaw was driving. Shaw tried to flee, which resulted in the deadly crash on Interstate 295 in Hanover County. Shaw and two people in another vehicle were killed in the 4-car wreck.\nMembers of the Rogers family announced late Friday a candlelight vigil will be held at the Ferintosh Court home, Saturday 7 p.m.\n\"There's no way on God's green Earth that I can imagine how a father could come in and do what this man did,\" said Michael Jones, cousin of Morgan Rogers. \"If there's any hint of [domestic violence], run for the hills\"\nPolice continue their investigation into this incident. Anyone with information should contact the Chesterfield County Police Department at 804-748-1251 or Crime Solvers at 804-748-0660 or www.crimesolvers.net.\nCopyright 2015 WWBT NBC12. All rights reserved"}