{"uri": "http://www.news4jax.com/news/local/jacksonville/mass-shooting-sparks-debate-over-safety-at-eureka-gardens_", "title": "Mother of 2 among 7 shot at Eureka Gardens", "dct": "Tue, 09 Aug 2016 13:11:00 GMT", "id": "f053bfecff1eb8db1d71ae491a0b9b10", "content": "JACKSONVILLE, Fla. - A 20-year-old mother of two was among seven people injured early Monday in a mass shooting at the Eureka Gardens apartment complex on Jacksonville's Westside. She was shot in the stomach.\nThe woman's family said her 16-month-old daughter was saved when three gunmen fired more than 50 rounds into a group of people. The toddler's father shielded her from the gunfire and was grazed by a bullet, the family said.\nThe woman, who the family asked not be identified, had her third surgery Tuesday and is in protective custody with the Jacksonville Sheriff's Office. “She's a fighter,” the family said.\nHer second daughter is just 3 weeks old (pictured below with sister).\nAnother one of the seven victims was a man who was shot in the neck and is in critical condition, according to the family.\nFollowing the mass shooting, the federal government stepped in to require security changes at Eureka Gardens.\nBullet holes riddled a truck and other remnants of the shooting could still be seen a day later.\nThe U.S. Department of Housing and Urban Development said Tuesday that it will require Global Ministries Foundation, which owns Eureka Gardens and several other complexes in Jacksonville, to hire a private security consultant to make recommendations on how to increase security and safety at the property.\nHUD representatives will then review the consultant's report and work with the owner to make needed changes.\nHUD officials, who met with Sen. Bill Nelson, D-Florida, and city leaders in Jacksonville on Tuesday said GMF was informed of the requirements Tuesday.\nDuring the meeting, HUD representatives told Nelson that GMF has a buyer lined up for its Jacksonville properties and that the sale could be final by the end of September. Two of the Jacksonville properties -- Eureka Gardens and Washington Heights -- have been the subject of an ongoing I-TEAM investigation into deplorable living conditions at the federally subsidized properties.\n“No American citizen should have to live in substandard conditions that are supported by the taxpayers' money of the federal government, and that just gets it down to the bottom line,” Nelson said Tuesday.\nCity, national leaders question safety at Eureka Gardens\nThe shooting prompted local leaders to call for 24-hour security at the federally-subsidized complex.\nGMF currently employs a security company that roams between Eureka Gardens and Washington Heights. The company said that at the time of the shooting, its patrols were on duty at Washington Heights.\nChief Marcus Williams, of Protective Enterprises of Florida, said the neighborhood has been put on high alert, meaning that the maximum number of patrols allowed are being placed in the complex.\nA couple dozen Eureka Gardens residents were at an emergency meeting Monday, along with U.S. Rep. Corrine Brown, D-Florida, who shared a letter she wrote to U.S. Department of Housing and Urban Development Secretary Julian Castro requesting that HUD immediately provide dedicated 24-hour security at both Eureka Gardens and Washington Heights. She also asked about security gates and upgraded security cameras.\n“We need cameras, gates, 24-hour security, not just in this property but the other property (Washington Heights). This has been a bipartisan issue,” Brown said. “This has been going on for some time now. We want them to act and act now.”\nBrown said the HUD budget has been cut drastically and she has dealt with a similar scenario for housing in Sanford. She said it took years for that to be resolved. She believes, however, that the needs of Eureka Gardens and Washington Heights can be improved quickly.\n“Our No. 1 responsibility is to make sure the residents are safe,” Brown said. “That’s the first thing, and they are not safe.”\nGMF issued a statement Monday addressing residents' safety concerns:\nOur hearts go out to those who were injured by the brazen actions of the criminals who appeared during the night at Eureka and terrorized the families living there and in the surrounding community. We are actively working closely with the Jacksonville Sheriff’s Office to help identify those responsible and bring them to justice swiftly. Though we know of no Section 8 owner that has 24/7 armed guards, Eureka Gardens has targeted paid security and surveillance technology to cover the expansive multi-block, family-style community. To support the JSO and City leaders as they tackle the high rates of violent crime in the area, GMF significantly increased security measures as soon as we purchased the property. It is precisely this type of unlawful activity that has made the job of providing Jacksonville families with safe and affordable housing extremely difficult, as those in law enforcement who put their lives on the line every day can attest.”\nCopyright 2016 by WJXT News4Jax - All rights reserved."}