{"uri": "http://fox43.com/2016/04/18/dad-charged-in-shooting-he-blamed-on-5-year-old-police-say/", "title": "Dad charged in shooting he blamed on 5-year-old, police say", "dct": "Mon, 18 Apr 2016 21:51:00 GMT", "id": "5c7b2a5d0bfe38555452452bc2cab1a7", "content": "To view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nA Philadelphia man accidentally shot and killed his 4-year-old daughter, then tried to blame it on her 5-year-old sister, police and other sources said.\nMaurice Phillips, 30, was arraigned Monday morning on third-degree murder charges and some lesser related charges, police said. Before he was charged, he initially told police that one of his other children had shot the girl, a source close to the investigation told CNN.\nPhillips was home with his seven children Saturday afternoon, watching TV and playing in his bedroom, when the shooting occurred, Philadelphia police said. After a single gunshot, Tahirah Phillips, 4, fell to the floor with a bullet wound to her head, police said.\nPhillips then allegedly struck Tahirah’s 5-year-old sister, who was also in the room, and wiped his bloody hand on her shirt. Police said he then carried his slain daughter’s body into a back bedroom, called his fiancé and told her to come home. Once she arrived he changed clothes and fled, police said.\nOn Sunday, Phillips turned himself in and eventually told the police that the 5-year-old was not involved.\n“After an investigation, (Phillips) admitted to accidentally shooting the victim, and stated that the sibling had nothing to do with it,” Sgt. Eric Gripp told CNN affiliate KYW on Sunday.\nRelatives remembered Tahirah Phillips fondly.\n“She was a sweet, loving little girl,” Catherine Dougherty, godmother of one of Tahirah’s siblings, told KYW. “She was full of life, she was always willing to help, she was a great big sister to her little brother.”\nPhillips also was charged with involuntary manslaughter, endangering the welfare of a child, recklessly endangering another person and related charges, according to Cameron Kline, spokesperson for the Philadelphia District Attorney’s office. He is being held without bail.\nIt was unclear Monday if Phillips has legal representation. He is scheduled to appear in court on May 4 for a preliminary hearing."}