{"uri": "http://www.kansascity.com/news/local/article73406927.html", "title": "Prosecutors charge father in shooting death of 2-year-old girl in Kansas City", "dct": "Fri, 22 Apr 2016 16:57:00 GMT", "id": "09a33a4ac5608696f7f2fd50dc01506a", "content": "A Kansas City man faces charges after his 2-year-old daughter died in a shooting Thursday in Kansas City.\nProsecutors on Friday charged Courtenay S. Block, 24, with child endangerment, tampering with evidence and armed criminal action.\nBlock’s daughter, Shaquille Kornegay, died after being shot in the head Thursday at a home in the 2600 block of Lawn Avenue.\n“This homicide was 100 percent preventable,” Jackson County Prosecutor Jean Peters Baker wrote in a statement released Friday with the charges against Block. “This is tragic. We must do a better job of protecting our most vulnerable, our children.”\nAccording to court records, officers were called to the house about 1:30 p.m. Thursday and found Block holding the unresponsive girl.\nShaquille had been shot in the head. Block told police he kept a loaded handgun inside the house.\nAn ambulance took the girl to Children’s Mercy Hospital, where she was declared dead.\nBlock told police he had been sleeping and awoke to the sound of Shaquille crying. She was standing next to the bed with a head wound, and Block noticed his handgun on the floor next to her. Block allegedly picked up the child and the gun and walked to the bathroom to hide the gun. Then he walked outside with the girl and called for help. A neighbor called police.\nPolice found the handgun in a bathroom floor vent covered by a child’s T-shirt.\nThe only people at the home when officers arrived were Block, Shaquille and a 3-year-old boy.\nNeighbors said the family had lived at the residence for several months.\nOne neighbor said he was watching television when he heard a gunshot. Block rushed over to the man’s house and pleaded, “Help my baby.”\nBlock asked him to call 911.\nThe father raced back inside and grabbed the child. He then ran back to the neighbor’s house. Block held the child with a dark towel or shirt over Shaquille’s head. Block asked the neighbor a second time to call 911.\nInvestigators later spoke to the child’s mother, who had not been told what had happened. She told police that she had left Shaquille next to Block, who was in bed, and left the house with her 5-year-old son. She and her son were picked up by a friend and went to another residence.\nThe woman said she told Block she was leaving the child with him. She knew Block kept a handgun for protection and said the weapon was normally stored in removable ceiling tiles in the living room.\nBlock later told investigators that he also kept the loaded handgun either under his pillow or under the mattress. The gun could have been in either place before he fell asleep.\nPolice found the 9 mm handgun while serving a search warrant on the house. The gun had a spent shell casing lodged in the chamber and eight live rounds in the magazine. Officers also found a plastic baggy that contained 13 grams of what police believed was marijuana.\nNeighbors said they were saddened by the news of the child’s death.\n“It’s always sad when a baby dies, whatever the circumstances,” said Vanatta Harris, another neighbor who lives to the north of the child’s family. “I feel so sad for the father, I just can’t imagine what that must have been like.”\nOn Friday, no one was inside the small beige one-story house. A bed sheet was draped over the front window where the glass had been broken out. Shards of glass littered the front porch.\nMary Baker said earlier Friday that she saw the child’s family at the house and decided to walk over. Baker gave a relative a pink teddy bear and expressed her condolence.\n“That was a child,” Baker said. “I know their hearts are troubled.”\nGlenn E. Rice: 816-234-4341, @GRicekcstar"}