{"uri": "http://www.abc15.com/news/region-phoenix-metro/central-phoenix/phoenix-fire-five-people-shot-at-hotel-3-in-critical-condition", "title": "Police: Two dead, several hurt after suspect opens fire in Phoenix Motel 6", "dct": "Sun, 05 Jun 2016 22:51:00 GMT", "id": "7e15ecfb88f95506dcea078150f99ca4", "content": "Autoplay:Man in deadly shooting passes awayCONNECTING...XTwo dead after Phoenix motel shooting\nPHOENIX - Police are investigating after a man opened fire in a Phoenix Motel 6, killing two people, before car-jacking a family nearby and taking off from the scene.\nThe suspect, identified as 28-year-old Daterryn McBride, reportedly entered a Motel 6 near Interstate 17 and Northern Avenue late Sunday night, said something to employees in the lobby and fired multiple shots, hitting three other people.\nTwo of the victims, 44-year-olds Brian Harris and Robert Sykes, were killed and a 25-year-old man is in extremely critical condition. A 46-year-old man and a 32-year-old woman shot at while they were fleeing the scene, were stopped by a police officer in the area and transported to a local hospital with non-life threatening injuries.\nAt an apartment complex about a block away from the motel, the suspect targeted a man, woman and their baby, eventually stealing their vehicle at gunpoint. The suspect reportedly let the woman and child go, but took the man in the vehicle and got onto the freeway.\nPolice say the suspect traveled to 19th Avenue and Camelback Road where he was found by police. The suspect ran from the car, across the freeway and then car-jacked another vehicle. Police say the suspect got in several crashes along the way with other drivers.\nThe suspect ended up in a field where he shot himself in the head. The suspect was transported to the hospital in extremely critical condition, and later died.\nPolice are still trying to figure out a motive for the shooting.\nMcBride has several previous felony convictions, including two for misconduct involving weapons in 2012 and 2004, and aggravated assault, according to online information from the Arizona Department of Corrections."}