{"uri": "http://www.12news.com/news/local/valley/2-dead-suspect-attempts-suicide-in-phoenix-shooting-spree/234091042", "title": "2 dead, suspect kills self in Phoenix shooting spree", "dct": "Tue, 07 Jun 2016 00:00:00 GMT", "id": "9f859ce2f7e304e30afd07e281d2555b", "content": "PHOENIX - Two victims are dead, and a total of five shot after police said a man went on a shooting rampage at a Valley motel before fatally shooting himself.\nPhoenix police said it started around 10:30 p.m. Sunday when officers were called to the Motel 6 on Interstate 17 and Northern Avenue.\nInside the lobby area, they found three people shot. Two of them were dead: Brian Harris, 44, was an employee at the hotel; Robert Sykes, 44, was staying at the hotel. The third person-- a 25-year-old who is employed at the Motel 6, is in extremely critical condition.\nKelly Skidmore, Sykes' girlfriend, said Sykes had been staying at the hotel after they had a fight.\n\"The last thing I said to him was 'I hope you get shot,'\" she said outside the hotel Monday morning. \"And that’s what happened.”\nDuring the initial response, an officer saw a red pickup driving erratically near North 27th Avenue and West Northern Avenue, police said. He stopped the truck and found the two occupants -- a 46-year-old man and 32-year-old woman -- had been shot. They were hospitalized with non-life-threatening injuries.\nPolice believe the suspect, Daterryn McBride, 28, shot the pair after shooting the three victims at the hotel for unknown reasons. The couple in the truck had gone to the motel for a room, but ran when they saw the man with a gun, who then fired at the truck, hitting them both.\nShortly afterward, police got a call of a carjacking and kidnapping at a nearby apartment complex. McBride carjacked a family vehicle, taking the husband with him, leaving the wife and the couple's 4-month-old baby, police said.\nPolice spotted McBride near North 19th Avenue and West Camelback Road and chased him onto I-17, where he ditched the car, leaving the kidnapping victim and fleeing on foot.\nPolice say McBride then carjacked a second vehicle and exited I-17 at 16th Street, where he crashed at a dead end and ran from the scene.\nPolice caught up with him a short time later, when they say he shot himself in the head. McBride was taken to the hospital in extremely critical condition and died Monday afternoon.\nA spokesman for the police department said there are upwards of 12 victims in this incident, including the shooting victims, carjacking victims and victims of car crashes McBride caused during carjackings.\nPolice have not identified a motive in the shootings.\n\"He said something to the employees that were in the office,\" Phoenix Police Officer James Holmes said. \"I don’t know what that was, so we don’t know what initially caused him to start this shooting spree.”\nAccording to the Arizona Department of Corrections website, McBride served time in prison for aggravated assault and misconduct involving weapons. He was released in August of 2014.\nCopyright 2016 KPNX"}