{"uri": "http://www.wafb.com/story/29466524/3-year-old-recovering-after-accidentally-shooting-himself", "title": "3-year-old recovering after accidentally shooting himself", "dct": "Fri, 17 Jul 2015 00:19:00 GMT", "id": "7cd7ae225d7ff0c1234e00a0a2a10298", "content": "SHREVEPORT - MONROE, LA. (KSLA) -\nA 3-year-old is in critical condition after accidentally shooting himself in the face with a gun he found in his home.\nPolice say the little boy found the gun in a holster and managed to get it out and pull the trigger.\nThe 3-year-old boy is in pediatric intensive care at University Health. Shreveport police say he is expected to survive, but just how the toddler got his hands on the gun is still under investigation.\n\"I just noticed they were moving in,\" said Danny Black, who lives next door.\nThat is the only activity Danny Black noticed at his neighbors home in the 3600 block of Colquitt road Wednesday at about 8:00 in the evening.\n\"Police came to the house asking if I heard a gunshot, I didn't hear anything because the TV was so loud,\" said Black.\nBlack says he had no clue a 3-year-old boy had shot himself in the face until Thursday morning.\n\"Police were in the yard, that's all we noticed when we opened the door up,\" said Black.\nShreveport Police say the child managed to get his hands on a semi-automatic handgun inside a bedroom and pulled the trigger. The boy's parents and siblings were at home when the shooting happened.\n\"When someone who has a lot of guns, who may be very familiar with a lot of guns, sometimes you have a tendency to get lax in that area, because you're so comfortable some of the safety measures you would generally take part in, you may forget to do it. You become so comfortable with your use of guns, or use of guns, that you don't always think about the possibility of someone else gaining access to that weapon,\" said Corporal Marcus Hines with the Shreveport Police Department.\nBlack is a gun owner himself, and the grandfather of young grandchildren, he says he always tries to practice gun safety.\n\"They're locked up in a safe,\" said Black.\nNo charges have been filed, but police are still investigating.\nCopyright 2015 KSLA. All rights reserved."}