{"uri": "http://www.nbc-2.com/story/32174849/police-id-victims-from-cape-shooting-spree#.V1isg-QYEk5", "title": "Victim in Cape Coral shooting spree hoping for word on motive", "dct": "Wed, 08 Jun 2016 15:54:00 GMT", "id": "ee5840fa398fb066995461d394614c8c", "content": "CAPE CORAL -\nPolice have identified two victims who were shot and killed during a violent rampage Sunday night in Cape Coral.\nUSING OUR APP? WATCH VIDEO HERE\nJeremy Taylor, 54, was the motorcyclist shot and killed in the 2600 block of Skyline Boulevard, and Sean Strickland, 26, was the Circle K employee killed 45 minutes later at 1603 Cape Coral Parkway.\nA third victim, Richard Huwiler, 61, suffered a non-life-threatening wound at the store when Christopher Moran, 31, opened fire.\nPolice said Moran gunned down Strickland then pointed the gun toward Huwiler and fired, but missed. Pellets sprayed his hands.\n\"He wasn't there to rob the store. He didn't rob anything,\" Huwiler said. \"I hope they figure out somehow. I don't know what he was on.\"\nWitnesses said Moran left the store in a red Mazda with a woman and a child. The pair has been identified as Maria Rodriguez, 32, and 14-month-old Christopher Moran Jr.\nMinutes later, Moran was shot and killed during a shootout with officers at the intersection of Skyline Boulevard and Cape Coral Parkway W.\nRodriguez and the child are still in the hospital, but police have not revealed why.\nRodriguez and the baby remained hospitalized Wednesday. Their injuries are unknown.\nSearching for a motive\nScars will fade for Huwiler, but the memories might not. He hopes police find out why this happened.\n\"Something triggered this guy, and I am hoping Cape Coral police -- which [are] doing a great job -- I hope they can get a grip on it too and maybe we can solve some potential happenings from happening again,\" he said.\nPolice have not released a motive for the shootings.\n\"A motive is something we are working very hard to ascertain right now,\" said Cape Coral Police Department representative Dana Coston.\nThe officers involved in the shooting are, per standard protocol, on administrative leave.\n\"The motorcyclist and the parents of Sean,\" Huwiler said. \"That's so traumatic to me right now it's unbelievable.\""}