{"uri": "http://www.nbc-2.com/story/32149347/shooting-reported-in-cape-coral#.V1Tf0uSvzKO", "title": "3 dead, including gunman, in Cape Coral shooting spree", "dct": "Sun, 05 Jun 2016 22:21:00 GMT", "id": "fa0e3aa9c50fff9f46ac1a3662a9dfc4", "content": "CAPE CORAL, FL -\nThree people are dead, including the gunman, after a shooting spree in Cape Coral Sunday evening.\n- Using our app? CLICK HERE to watch video\nThe Cape Coral Police Department held a news conference Sunday night to detail the deadly rampage. When asked if it was a random or planned shooting spree, Sgt. Dana Coston said that remains under investigation.\nFirst scene: 2600 block of Skyline Boulevard\nPolice responded to three separate locations as part of the investigation, with the first in the 2600 block of Skyline Boulevard S.\nDriver Jessica Verhaagh witnessed the horrific scene unfold just before 6 p.m.\n\"Basically, a motorcyclist pulled up to Skyline. There was no questions asked. He made sure he was looking at him and shot him,\" she said.\nPolice found the motorcyclist dead at the scene when they arrived.\n\"All I seen was a black glove and a black leather jacket and one shotgun,\" said Verhaagh.\nSecond scene: Circle K (Chiquita Boulevard/Cape Coral Parkway W.)\nWhile working the first scene, police received a call about a second shooting at the Circle K located at the intersection of Chiquita Boulevard and Cape Coral Parkway W. just before 6:30 p.m.\nWitnesses say the gunman shot toward several people, including a mother and her child.\n\"They said he has a gun. Get down, get down. Everybody, get down,\" recalled Dana Noah, who witnessed the shooting at Circle K. \"I heard gunshots. That's when I knew it was real. It was a real active situation.\"\nRichard Huwiler was inside the store when the gunman approached the clerk.\n\"I heard a loud boom. I thought it was a balloon, and then I saw the other guy going down behind the counter,\" said Huwiler.\nWitnesses say the suspect fatally shot the clerk.\n\"I went 'oh.' And then, there was a woman with a kid behind me. [The suspect] turned and looked me in the eye and cocked the thing [gun]. She [the woman] said I've got the baby. And he blasted over the kid's head at me, and I'm just glad I ducked at the time I did,\" said Huwiler.\nHuwiler's said the gunman then turned toward him and fired. He ducked, but his hand was caught in the crossfire.\nWitnesses said the woman and the child left the gas station with the gunman.\nThird scene: 5100 block of Skyline Boulevard\nOfficer found the suspect about four minutes later at the intersection of Skyline Boulevard and Cape Coral Parkway W. Police stopped the vehicle near the 5100 block of Skyline Boulevard.\nWitnesses said they saw between 10-12 police cars driving down Skyline Boulevard. Seconds later, they heard between 50-60 shots -- followed by the blaring of a car horn.\n\"They checked the area. They really, very carefully, cautiously approached the car with I think a dozen people,\" said Wolfgang Selgr, a witness.\nInvestigators say the suspect \"violently resisted\" and was armed. The gunman shot at police and officers returned fire. The gunman was shot and killed.\nThere were two passengers in the car with the suspect at the time. Both passengers were injured and taken to the hospital.\nPolice officials say no officers were injured. They say this is still a very active and fluid investigation."}