{"uri": "http://www.southeastgeorgiatoday.com/index.php/8-newsbreaks/32601-tragic-death-in-toombs-county", "title": "Tragic Death in Toombs County", "dct": "NODATE", "id": "929cf16b960887dbd330411b3d2fc5dc", "content": "October 25-- Investigators believe the death of a 24-year-old Toombs County man Saturday night was accidental.\nAccording to Captain Jordan Kight of the Toombs County Sheriff's Office, his preliminary report is that 29-year-old Brandon Phillips had no idea it was his cousin, Calem Copeland, whom he shot in his home at 998 Johnson Corner Road.\n\"At this time it appears to be what we believe to be accidental. The best way to describe it is identification of an intruder versus a friend playing a prank.\n\"He thought he heard someone enter his home and had his pistol in his bedroom for protection. As he was coming down the hallway, it appears Mr. Copeland jumped out to scare him and to pull a prank on him. The lights weren't on in the hallway and he didn't recognized his face. You're talking about a split-second decision when two people turn a corner, one has a gun and the other one is jumping out.\"\n\"It's a very tragic situation. It's very sad for both sides of the family and we here at the Sheriff's Office, our hearts go out to these folks,\" Captain Kight said.\nThe Sheriff's Office issued the following press release late Monday.\nAccording to Sheriff Alvie (Junior) Kight, the Toombs County Sheriff’s Office and the Georgia Bureau of Investigation (GBI) Eastman Office are investigating a shooting that occurred at the residence of BRANDON PHILLIPS located at 998 Johnson Corner Road in Lyons, Toombs County. On 10/23/2016, at approximately 2:25 P.M., Toombs County 911 received a phone call from FALLON WILLIAMSON stating that CALEM COPELAND had been shot at PHILLIPS’ residence.\nWhen deputies arrived on scene they discovered WILLIAMSON, COPELAND, and PHILLIPS at the residence. Inside of the residence, Deputies discovered WILLIAMSON providing medical treatment to COPELAND who suffered from a gunshot wound. A deputy joined in providing medical attention to COPELAND until EMS arrived on scene. During this time additional deputies began to take control of the residence and witnesses until the GBI Crime Scene unit could arrive to assist in processing the scene. COPELAND was transported to the Meadows Regional Medical Center in Vidalia by ambulance, where he later succumbed to injuries from the gunshot wound.\nCOPELAND’s body has been sent to the Georgia Crime Lab for an autopsy. Sheriff Kight advises that at this point no arrests are anticipated based upon the preliminary investigation. This case is still ongoing at this time as the Sheriff’s Office, GBI, and the Middle Judicial Circuit District Attorney’s Office continue to investigate the circumstances surrounding this incident. Sheriff Kight asked that citizens respect the privacy of the persons and families involved in this tragic situation during this time."}