{"uri": "http://www.azcentral.com/story/news/local/phoenix/2015/04/17/phoenix-five-murdered-abrk/25930963/", "title": "Deadly Phoenix dispute shatters family", "dct": "Fri, 17 Apr 2015 00:00:00 GMT", "id": "82d0691b49d54ade9f0825867f57e754", "content": "They were three immigrant brothers who were trying to make their mark on the highly competitive limousine-service business.\nOn Thursday, police say, a dispute over how to run the business sent the middle brother into a rage that left four members of his family dead before he turned the gun on himself in the north Phoenix home they shared.\n\"It's obvious that he went through great lengths to make sure each of them were dead,\" said Phoenix police Sgt. Trent Crump. He said each of the victims appeared to have been shot multiple times.\nOfficers identified the killer as Driss Diaeddinn, 50. The victims were both of Diaeddinn's brothers, one of their wives and their mother.\nDiaeddinn's wife and his two children, ages 3 and 10, along with his sister, managed to escape and dial 911.\nCrump, a Phoenix police spokesman, identified the slain brothers as Dodi Fayed, 56, and Reda Diaeddinn, 38. Also slain were Kenza Benzakour, 76, the gunman's mother, and 26-year-old Meriem Ben Yahia, his sister-in-law. Court records show an alternate spelling of the last name as Diaeddine.\n\"Witness information at this time indicates there had been an ongoing business dispute between the three brothers. One of the brothers, who is considered the suspect at this time, obtained a semi-automatic handgun and ultimately shot and killed four family members,\" Crump said in a statement.\nHe said the two slain brothers and the siblings' mother, Benzakour, were found downstairs. Police believe Benzakour heard gunfire in the 2,300-square-foot home and was walking down the stairs when she was slain.\nPolice arrived after the shooting was apparently over and prepared for a standoff situation. They used a megaphone to try to communicate with the occupants, addressing the family in Arabic.\nAfter receiving no response, a SWAT team used a robot to search the house prior to sending in a dog and officers.\nWhen police went inside, they found Diaeddinn dead in an upstairs room with an apparent self-inflicted gunshot wound, Crump said. Ben Yahia was also found in an upstairs bedroom.\nFriends and acquaintances said.the brothers operated ExStyle, a discount transportation company, using SUVs and luxury cars such as Cadillac Escalades and Lincoln Town Cars.\nThey launched their own business after working for ExecuCar, a large transportation company. Fellow drivers said the spinoff business initially appeared to be successful but said the brothers were under pressure to sustain their low-cost, high-volume business model.\n\"I knew Dodi really well, also kind of knew Reda, not Driss,\" driver Sunny Singh said. \"I would hang around with Dodi; we'd go to the gym together. He never said anything about Driss or Reda, just always said, 'My brothers worked very hard.' Dodi was a very friendly person.\"\nHe said Dodi Fayed had an easygoing manner.\n\"He was a forgiving person. He'd give me a second chance,\" Singh said. \"Don't go to work on time? He'd let it go.\"\nFayed also was a pastry chef who dreamed of opening his own Moroccan restaurant, called Chez Dodi, in Scottsdale. He worked on the restaurant for months, but the project dragged on and apparently never came to fruition.\nZahi El-Rahi, another driver, said he worked with the brothers for a year and a half, ending in 2012.\nEl-Rahi said he knew the entire family and would often visit home near 44th Street and Bell Road, where the slayings occurred.\nWhile El-Rahi described the family as close and hardworking, he said that Driss Diaeddinn was known as a hothead and that others knew to be wary of him.\n\"Some of the other drivers didn't like working with Driss; he had a temper,\" he said.\nNeighbors in the normally quiet neighborhood were shocked by the bloodshed. Don LeTendre said he used the transportation service at least seven times for trips to Phoenix Sky Harbor International Airport.\n\"They were very neat, very kind, great people,\" LeTendre said. \"We had no issues at all.\"\n\"I feel for whoever is left. It's a damn shame,\" he said. \"My heart goes out to them.\"\nThe family owned a second house on the south side of 44th Street and Bell Road, where they would store their cars to avoid encountering problems\nwith a homeowners association.\n\"It's unbelievable,\" said Keith Bronston, another neighbor. \"You didn't have any idea what was going on behind closed doors.\"\nGawi Mos, a family friend who came to the scene Friday afternoon, said he was shocked to hear what had happened. He said he was aware there were business issues, but the family members themselves were fine.\n\"It's a nice family,\" he said."}