{"uri": "http://www.azcentral.com/story/news/local/phoenix/2015/04/16/phoenix-police-barricade-situation-paradise-valley/25905629/", "title": "Barricade situation leaves 5 dead in north Phoenix", "dct": "Thu, 16 Apr 2015 00:00:00 GMT", "id": "f2c7b90f5237d1eee71dcb18fd8c5638", "content": "Police say five people were found dead inside a north Phoenix home Thursday after a dispute over the family business erupted in gunfire.\nAuthorities did not immediately release the identities of the gunshot victims but said all five were adults and related to each other.\nThe bodies of three men, all brothers, and two women were located inside the home after an hours-long barricade situation in a residential neighborhood near 44th Street and Bell Road. A SWAT team used a robot to search the house prior to sending in a dog and officers, said Sgt. Trent Crump, a Phoenix police spokesman.\nA police perimeter remained in place well into the night, as investigators padded around the scene in booties to document evidence and detectives went door to door.\nOfficers arrived at the home in the 4300 block of East Anderson Drive around 2 p.m. Witnesses at the scene said they heard the sound of muted gunshots about an hour later.\nA woman was able to flee with two young children during the ordeal. About an hour into the standoff, another woman emerged from the house and said she had been hiding.\nOne of the women told officers that it was a family dispute gone wrong, Crump said.\nPolice used a megaphone to try to communicate with the occupants of the home, addressing the family in Arabic. Crump said they had origins in Morocco.\nSeveral neighbors described the residents as being \"invisible\" until Thursday. One neighbor said the family owned a transportation service and, because the HOA allowed only two vehicles in the driveway at any one time, purchased a home in an adjacent neighborhood in order to park their fleet.\n12 News reporter Gia Vang and Republic photojournalist David Kadlubowski contributed to this article."}