{"uri": "http://www.arkansasonline.com/news/2016/dec/18/little-rock-police-offers-reward-information-3-yea/", "title": "3-year-old shooting victim identified; Little Rock offering $20,000 reward for information", "dct": "Sat, 28 Jan 2017 16:48:24 GMT", "id": "c373ca845bbd0fb399ee1cfe2e65bca7", "content": "4:20 P.M. UPDATE:\nA pastor familiar with the King family identified Saturday's shooting victim as 3-year-old Acen King.\nScottie Long of The Mercy Church on Scott Hamilton Drive disclosed the name Sunday afternoon. Police said King died Saturday night after he was shot in the backseat of his grandmother's car during a road-rage confrontation in southwest Little Rock.\nThe city of Little Rock is offering a $20,000 reward for information on anyone involved in the shooting.\nThe Arkansas Democrat-Gazette's Ryan Tarinelli contributed information to this report. Read Monday's Democrat-Gazette for more.\nPREVIOUS:\nThe city of Little Rock is offering a $20,000 reward for information concerning the shooting death of a 3-year-old boy Saturday night, police said Sunday.\nIn a news release, police said the money would be awarded to whomever provides tips that lead to the arrest and conviction of those involved in the road-rage homicide.\nPolice said the child was shot during a confrontation in southwest Little Rock. His grandmother, 47-year-old Kim King-Macon, had stopped her 2006 Dodge Charger at a traffic light in the 6700 block of Mabelvale Cutoff Road. The 3-year-old and a 1-year-old were in the car, Arkansas Online reported.\nAccording to a news release, King-Macon was waiting to turn west on Mabelvale Cutoff Road while it rained. A black Chevrolet Impala pulled up behind the Charger and honked its horn, and King-Macon responded by honking her own horn as she waited for traffic to pass. She told police a black man then got out of the Impala and shot once.\nKing-Macon told police she thought he had fired the shot into the air, so she drove the J.C. Penney at the Shackleford Crossings shopping center in west Little Rock, where she was meeting other family members to drop off the kids. She discovered that her grandson had been shot when she went to get him out of the car before 6:30 p.m.\nThe boy was taken to a hospital, where he died from his injuries. The shooting marked the second time in a month that a toddler had been shot and killed in Little Rock. A 2-year-old girl died after she was shot in a car South Harrison Street and West Charles Bussey Avenue on Nov. 22.\nPolice have also offered a $20,000 reward for information regarding her death.\nAs of Sunday morning, police had no further description of the suspect in Saturday’s homicide, said Officer Richard Hilgeman, a Little Rock police spokesman.\nThose with relevant information can call (501) 371-4636 or (501) 340-8477 to submit tips."}