{"uri": "http://www.kokomotribune.com/news/documents-reveal-shooting-details/article_4ea2307e-9c7c-11e6-abae-37e84b80ca08.html", "title": "Documents reveal shooting details", "dct": "Thu, 27 Oct 2016 00:00:00 GMT", "id": "f70a5d28b3c5e353c78e6afc759a5604", "content": "KOKOMO - A probable-cause affidavit released Thursday states LaMarcus McGraw may have been armed and fired the gun during an altercation Sunday in which he was allegedly shot and killed by Kaleil S. Rucker.\nMcGraw, 17, was shot multiple times behind the Village Pantry at 904 W. Jefferson St., in what investigators believe to be a drug deal that turned violent.\nThe affidavit contains multiple statements officers obtained from witnesses, as well as the suspect, Rucker, 21, who was arrested on a charge of murder and misdemeanor charges of possession of marijuana and dealing marijuana.\nOfficers were dispatched to the Village Pantry at 12:24 p.m. Sunday regarding a reported shooting. While en route to the scene, a description of the suspect was broadcast to officers, describing the suspect as a black male, wearing a black hooded sweatshirt and blue jeans.\nAn officer approaching the Village Pantry in his patrol car observed a man walking east on West Walnut street matching the description. The officer left his vehicle, gun drawn, and ordered the suspect, later identified as Rucker, to put his hands behind his head.\nRucker initially didn’t fully comply, according to the affidavit, putting one hand on his head, and the other behind his back. Multiple officers approached the scene, and in one of their affirmed statements, he described Rucker’s pose as though “he was contemplating whether he was going to comply, or fight us.”\nFaced with multiple verbal commands and officers with drawn weapons, Rucker complied and lay on his stomach, hands on his head. Officers confiscated a seven-round Taurus 617 .357 revolver from his pocket and a plastic bag with a green plant inside.\nAfter being read his Miranda rights, documents state Rucker told the officers McGraw had shot at him, with one bullet cutting a hole through his shirt, but missing his body. He stated he pulled his weapon, fired back around three times and fled the scene on foot.\nLater investigation revealed five of the seven rounds in Rucker’s pistol had been fired.\nA 15-year-old male who was arrested at the scene on charges of aiding, inducing or causing robbery, possession of marijuana and dealing marijuana, was also mentioned in the affidavit. He was found at the scene of the shooting when officers arrived, and was described in the document as “distraught.”\nAccording to the affidavit, the juvenile told officers that McGraw was his friend, and they arrived on the scene behind the Village Pantry together to meet someone. The juvenile told officers he didn’t know who they were going to meet or why, only that McGraw asked the juvenile for a ride to the meeting place on his moped. Later, in a second interview with investigators, the juvenile said he believed he was going to a drug deal, but McGraw didn’t specifically tell him.\nHe said the suspect rounded the corner of the alley on foot, approached them and asked “who had the money” and pulled out a bag of marijuana. He then said McGraw tried to take the bag from the dealer’s hand, and also began to pull a gun out of his pocket, causing Rucker to pull his gun, too.\nThe juvenile started running east toward Wabash Street once guns were displayed, according to the affidavit. He heard a flurry of gunshots behind him, but didn’t see who was hit.\nAfter a short distance, he looked back to see the suspect running in the opposite direction, so he returned to the alley where McGraw was found. He told witnesses arriving on the scene to call the police.\nAfter telling his story, a second gun was found at the crime scene.\nMultiple witnesses were interviewed by officers and investigators, including one who was in the area, and heard someone ask, “Are you going to rob me?” followed by a series of gunshots. He went to the alley, and saw McGraw on the ground with gunshot wounds. He said he rolled him to his side so he wouldn’t choke on the blood.\nAnother saw Rucker fleeing the scene with a gun in his hand. He said Rucker passed by about 10 feet from him.\nThe witnesses questioned differed on how many gunshots they heard, with reports ranging from three to six.\nThe report said McGraw died after medics arrived at the scene."}