{"uri": "http://www.chillicothegazette.com/story/news/local/2016/04/22/pike-county-mass-shooting-april-22/83380444/", "title": "Ohio AG releases names of Pike County victims", "dct": "Fri, 22 Apr 2016 00:00:00 GMT", "id": "21014b68ec2835e95d9e9b0c1e856463", "content": "Update, 5:35 p.m.: The Attorney General's Office Saturday evening released the names of the victim's of Friday morning's mass shooting in Pike County.\nDeceased were: Hannah Gilley, Christopher Rhoden Sr., Christopher Rhoden Jr., Clarence \"Frankie\" Rhoden, Dana Rhoden, Gary Rhoden, Hanna Rhoden and Kenneth Rhoden.\nThe Attorney General's Office announced that work at each of the four crime scenes has been completed.\nAudio from two 911 calls that came to dispatchers after the discovery of the mass shooting scene in Pike County Friday morning was released earlier Saturday.\nA partial transcription of the initial call -\n“I think my brother-in-law is dead,” said a distraught caller speaking with a female 911 operator while gasping for breath. She said two men, Chris Rhoden and Gary Rhoden, at 4077 Union Hill Road appear to be dead.\n“There’s blood all over the house. My brother-in-law is in the bedroom and it looks like someone has beat the hell out of him,” she said.\nThe call was placed at 7:49 a.m. Friday morning. The woman had driven to the house and discovered the horrifying scene.\n“I think they are both dead,” she said.\nA partial transcription of another 911 call -\n“I need a deputy to come out to close to 799 Left Fork. It’s all that stuff that’s on the news. I just found my cousin with a gunshot wound,” a male caller said. He identified the man with a gunshot wound as Kenneth Rhoden.\nWhen asked if Kenneth Rhoden was alive, the male caller just said, “No. no.” The call came in at 1:26 p.m. Friday.\n“I just went in hollering at him, and checked if he was alright, and I looked up at him and he had a gunshot wound,” the man said.\nA spokeswoman with the Ohio Attorney General's Office said there were no overnight or morning arrests in connection to the investigation of the Pike County mass shootings that occurred Friday, but provided some updates.\nThe AG's office said the Hamilton County Coroner's Office will be performing the autopsies of the eight victims today.\nA call placed to Hamilton County Coroner Lakshmi Sammarco was not immediately returned.\nCincinnati-area restaurateur Jeff Ruby Saturday afternoon offered $25,000 for information that leads to an arrest and conviction in the case.\nHe first posted his intention to offer the reward on Twitter before an official statement from the Attorney General's Office was distributed.\nA victim's advocate provided a short statement on behalf of the Rhoden family Saturday afternoon.\n\"The Rhoden family would like to thank everyone for all the outpouring for prayers and support for their family,\" she read. \"They ask that you continue to keep them in your prayers. They'd like to thank all law enforcement from Pike County and all surrounding counties for their immediate response, especially to Sheriff Charlie Reader for all his hard work.\"\nNewman also thanked the Ohio Attorney General's Office and the Bureau of Criminal Investigations, as well as the first responders and victim advocates. She asked anyone with information about the shootings to contact law enforcement at 855-BCI-OHIO.\nPrevious reporting: PIKE COUNTY – Some might have been sleeping when the killer came for them before dawn Friday.\nMen and women. A teenager. A young mother in bed with her 4-day-old baby.\nWhen it was over, eight were dead. All members of the same family, all shot at least once in the head.\nThe carnage revealed itself slowly Friday as sheriff’s deputies moved from home to home in this rural Appalachian community, drawn first by a 911 call and then by the horrifying realization that the victims were spread across miles.\nThey found four crime scenes in all. At every stop, more blood, more bodies.\n“It’s heartbreaking,” said Ohio Attorney General Mike DeWine, whose office sent more than 30 investigators to the crime scenes. “This is a horrible tragedy.”\nIt’s also a mystery authorities are scrambling to solve.\nOfficials were reluctant to confirm details about the shootings Friday and seemed unsure whether the killer or killers were still at large. Police detained a “person of interest” in Chillicothe late Friday for questioning, but DeWine said the person was one of 30 people interviewed in connection with the case, some of whom were from Chillicothe.\nDeWine said evidence from the crime scenes suggested none of the dead committed suicide. If that finding holds up, he said, it would mean at least one suspect remains on the loose.\n“So obviously we have one person … who is armed and dangerous,” DeWine said. “And there may be more than one. There may be two. There may be three. We just don’t know at this point.”\nHe said every precaution would be taken to protect other members of the victims’ family.\nPike County Sheriff Charles Reader chalked up the uncertainty about possible suspects to the complexity of the investigation. He said it involves four crime scenes spread throughout the county, which is about 70 miles east of Cincinnati.\n“It’s very early,” Reader said. “I cannot confirm the gunman is not dead.”\nAt a later press conference, Reader said there was “no specific threat to the community” and it appeared the family had been targeted and DeWine said it was “highly unlikely” that a murder-suicide had taken place.\nAuthorities urged anyone with information that could help to call them at 855-BCI-OHIO.\n“Every tip that comes in, we’re running down,” DeWine said.\nOfficials would not confirm possible motives or the identities of the victims, other than that they all are members of the Rhoden family, a large family well known in the community.\nSeven adults and one 16-year-old boy are among the dead. Three small children, including the 4-day-old baby, survived.\nDeWine said the baby was asleep in bed with its mother when the mother was killed.\nThe first sign of trouble came at 7:53 a.m. when the sheriff’s office received a 911 call reporting a possible fatality at a home owned by Christopher Rhoden at 4077 Union Hill Road, just off Ohio 32.\nTwo bodies were found there. While deputies were responding to the scene, they were flagged down by people on the road and directed to two more houses at 4199 and 3122 Union Hill Road.\nFive more bodies were found at those homes. Later in the day, officials were alerted to a fourth crime scene on Left Fork Road, where the 16-year-old was found dead.\n“We’re treating this as a mass murder,” Reader said. “This is not something you prepare for.”\nAlthough officials wouldn’t identify victims, Pastor Phil Fulton, of Union Hill Church, said one of the dead is 37-year-old Dana Manley Rhoden, Christopher Rhoden’s ex-wife.\nLeonard Manley, who said he’s the father and grandfather of some of the victims, said one of his daughters discovered the bodies when she went to Union Hill Road to feed dogs and chickens, part of her normal routine.\nWord of the slayings – and rumors about what happened – spread quickly through the small community, and family and friends began to gather at the Union Hill Church. Family members didn’t want to talk publicly about the shootings, but Fulton said he would preach about it Sunday.\n“We’ll be offering prayer for the families,” he said. “Love your kids. Love your families.”\nOthers in the area had more immediate concerns about their own families. Some were alarmed that authorities seemed uncertain about whether the killer could still be roaming their community.\nAt the Dogwood Festival in Piketon Friday night, there was a smaller crowd and fewer children than Tina Miller would have expected. The conversations started with the usual greetings, she said, but inevitably turned to, “did you hear what happened?”\n“It’s just sad,” Miller said. “You can look at everyone’s faces and know that something’s wrong.”\nMindy Gee said she worked with one of the victims. “It’s hard, because I would see her here,” she said. “It’s just a lot of heartache. It’s just an emotional day.”\nSheriff Reader said his deputies and state investigators are doing everything they can to figure out what happened to the Rhoden family and why.\nAt an evening press conference, he was asked whether residents should lock their doors and stay alert until the case is resolved.\n“I would,” he said.\nAbout seven miles from the crime scenes, Peebles High School and Elementary School were on lock down for several hours after the bodies were discovered.\n“It’s just very shocking,” said Principal Tim Davis. “It’s sad when it happens anywhere. But when it happens here, it’s very, very devastating.”\nRose Yates, who was walking with her 3-year-old son Friday night in Piketon, said she won’t feel comfortable here again until authorities find out for certain what happened.\n“That stuff doesn’t happen around here,” she said. “We just have to watch ourselves. It’s really scary, and it’s really close.”\nContributing: Sara Nealeigh, Dan Horn, Chris Balusik, Jona Ison, Jessie Balmert, Hannah Sparling, Cameron Knight, Sam Greene, Jess Grimm, Kareem Elgazzar, Mike Throne, Chris Graves, Bob Strickley"}