{"uri": "http://www.whio.com/news/crime--law/kettering-high-school-student-shot-was-innocent-bystander-detained/0WtsYLy2wHh7bCjIh0iLjP/", "title": "Autopsy completed for Kettering teen shot to death", "dct": "Fri, 09 Sep 2016 00:00:00 GMT", "id": "7e7825a4fd26424f2cbfeb12749881c4", "content": "A dispute involving teenagers in Kettering on Sunday night after an incident flared up at AlterFest ended with the shooting of a 16-year-old police say had nothing to do with the dispute.\nLATEST DEVELOPMENTS\nAutopsy done today on Ronnie Bowers, 16\nRonnie Bowers is an organ donor\nThree suspects ranging from age 14 to 16 remain in custody\nSuspect Miles Heizer, 18, previously charged with felonious assault in attack with a baseball bat in March, was released\n14-year-old suspect has criminal history stemming back to 2014\nClick here to download our free mobile app for breaking news and news updates\nUPDATE @ 2:51 p.m. (Sept. 8):\nThe coroner’s office has officially ruled Ronnie Bowers’ death a homicide after he died from a gunshot wound to the head.\nUPDATE @ 1:46 p.m.\nThe Montgomery County Coroner’s Office now has the body of Ronnie Bowers and is conducting an autopsy. His mother, Jessica Combs, addressed the media today and said her son was an organ donor.\nFULL REPORT\nA GoFundMe account set up for the family of Ronnie Bowers has raised more than $10,700 of the $10,000 goal, as of early Thursday morning. The family is expected to address the media later today.\nBowers, 16, died Tuesday night after being shot in the back of the head near AlterFest while seeking to leave a dispute in which police said he was “an innocent bystander.”\nThe Montgomery County Coroner’s Office announced Bowers’ death late Tuesday night. He was declared brain dead and his organs will be harvested, according to a coroner’s investigator.\nA memorial service for Bowers is scheduled for Sunday in the Fairmont auditorium, 3301 Shroyer Road.\nFrom 11 a.m. to 2 p.m. the family will receive and greet visitors, according to the high school and Routsong Funeral Home. A service is scheduled for 2 p.m.\nOhio Attorney General Mike DeWine called the fatal shooting of Bowers near AlterFest Sunday night “a horrible tragedy.”\n“It’s a parent’s worst nightmare that your child is randomly shot,” DeWine said. “It’s just horrible.”\nDeWine said there is no easy solution to the juvenile violence that has impacted the area.\n“I’m mostly convinced that what we really need to do is start in kindergarten, first grade, all the way to 12th grade, have something that is age specific … that also has some data behind it that actually works as far as education and prevention,” DeWine said. “I don’t think there’s any easy answer. If there was an easy answer, we would have found it before now.”\nKettering police said Wednesday morning they will wait until the department has an update on the charges in the shooting case before releasing any new information.\nThe Montgomery County Prosecutor’s Office said Kettering Police had plans to meet again with the office to discuss charges against 18-year-old suspect Miles Heizer after he was released from custody Tuesday night, according to Greg Flannagan, spokesman for the prosecutors office.\nThat meeting was scheduled to take place in two weeks. However, it’s unclear whether that will change now that Bowers has died from his injuries.\nThe suspects\nFour people — including three juveniles — were detained in connection to the shooting. Heizer was released from the Kettering jail, pending further investigation, police said Tuesday.\nOf the three juvenile suspects that remain in custody, one has a criminal record dating back to 2014. The two 16-year-old suspects have no prior criminal history with the juvenile court, according to the court administrator.\nHeizer has a previous charge of felonious assault stemming from a baseball bat attack in March. The three other teen suspects in Sunday’s shooting were ordered detained by a judge Tuesday.\nThose three suspects — two of them are 16 and the third is 14 — appeared in the Montgomery County Juvenile Court on felonious assault charges, but there was no mention of who fired the shot that initially injured Bowers.\nThis news organization is not identifying the juveniles by name at this time.\nJuvenile Court Judge Anthony Capizzi said the juveniles will remain in custody until a Sept. 27 court date because they are “charged with heinous crimes” with a “high-level of notoriety.”\n“I expect significant additional filings on this matter,” Capizzi said.\nAccording to the second-degree felony charges, the suspects “knowingly did cause serious physical harm” to Bowers. One of the 16-year-olds also faces a charge of tampering with evidence. He is accused of trying to hide a firearm, Capizzi said.\nAll of the suspects and the victim are students at Kettering City Schools.\nPrior to Heizer’s release from jail Tuesday, Kettering jail records indicated he had been in custody since early Monday morning on a felonious assault charge.\nHeizer was out on bond at the time of the shooting, stemming from a felonious assault arrest in March. The police report from that incident says he jumped out of a car at a traffic light, walked up to another car and hit a former classmate in the face with a baseball bat.\nCourt records show that the case was bound over to a grand jury months ago, but Heizer waived the right to speedy proceedings and there have been no filings in the case since April.\nSunday’s incident\nThe shooting occurred at Willowdale Drive and Ackerman Boulevard about 9 p.m. Sunday.\nKettering Police Chief Christopher Protsman said the shooting had its roots in a weeks-long dispute between teenagers. Those teens were at Alter High School’s festival Sunday night, where the issue flared again.\nProtsman said one group of four teens drove away, trying to avoid the altercation, but the four suspects followed in another car, eventually blocking them in a driveway on Willowdale Avenue, three blocks from Alter.\nProtsman said a physical altercation took place, and Bowers — who was trying to drive away — was shot once in the back of the head. Protsman said Bowers was an innocent bystander who was not involved in the ongoing dispute.\nA second person — a female — suffered a minor injury during the shooting that led to Bowers’ death, according to a Kettering police report released Wednesday.\nKettering police have not released the details surrounding that female’s injuries. A bag of marijuana also was seized during the police investigation, the report says.\nKettering Schools’ response\nKettering Schools Superintendent Scott Inskeep said there were additional counselors, security and police at Fairmont High School on Tuesday morning. He said about 30 students took advantage of time to talk about the incident Tuesday morning.\nDan Von Handorf, Kettering’s director of student services and former high school principal, said students were in shock and disbelief. The shooting came seven months after another Fairmont student, Antoine Jones, was killed in a Trotwood shooting that police said was drug-related.\nHeizer was a close friend of Jones, according to his social media accounts, but Von Handorf said school officials don’t have any information that the two incidents are connected.\n“You have to be prepared. There is no ZIP code that is protected from these types of issues,” Inskeep said. “We’re always keeping an eye out for societal issues that may cause disruption or safety concerns at the schools.”\nSome students mentioned on social media that they were scared or shaken up by the incident. Jace Roberts, a junior at Kettering’s alternative school, said he feels safe at school, but questioned some students’ attitude.\n“Kids these days think they’re untouchable, can’t get in trouble,” Roberts said. “Think they can carry guns around and they’re not going to shoot nobody, but they did.”"}