{"uri": "https://www.dnainfo.com/chicago/20160419/auburn-gresham/foreignlyfe-rap-video-filming-park-ends-with-shooting-one-man-dead", "title": "Rapper Was Targeted In Fatal Shooting At Foster Park, Relative Believes", "dct": "Tue, 19 Apr 2016 08:17:00 GMT", "id": "244cab78fc92db65f9c213213c9df9b5", "content": "AUBURN GRESHAM — Damond Dawson and his friends wanted to grill in Foster Park on Sunday, but Dawson's cousin and former legal guardian, Tiffany Matthews, convinced the young men to revise their plans.\nMatthews told Dawson and his friends that it was too dangerous to be at the Auburn Gresham park, especially at night.\n\"I said, 'You can't be over there' and he knew that,\" Matthews said. \"I told them they could barbeque here and they did.\"\nBut Dawson, 23, did eventually go to Foster Park, 1440 W. 84th St. He was there with friends in the early hours of Tuesday morning shooting a rap video when at 2:19 a.m. someone came up and fired shots at the group, police said.\nDawson was shot in the back of the head and died at the scene, police said. Four others were shot as well, according to police.\n\"Why they went over there, I'll never know,\" Matthews said of her cousin and his friends. \"Out of all people we never thought it would never happen to him.\"\nDawson, of the 1000 block of West 103rd Place, was at the park shooting a music video with a friend who reportedly goes by the rap alias Foreignlyfe.\nThe rapper told reporters he heard \"my homie say, 'Somebody's pulling up.'\n\"We turned around and looked back. Quick as we looked back they started shooting,\" he said.\nThe incident may have been captured on video. Matthews said police told another one of Dawson's relatives that they had the video and were using it in their investigation.\nMatthews said she didn't know the man filming the video but did say she knew many of the other people at the scene. She said it is her belief that the attackers were aiming for the rapper, since it was known that his video was being filmed at the park.\n\"I think he was involved,\" Matthews said of the rapper outside her Washington Heights home. \"[Dawson] was at the wrong place at the wrong time.\"\nDawson had plans to enroll at Olive Harvey to obtain his GED, Matthews said. When she last saw her cousin on Sunday, he was happy and talked about the job prospects he had lined up, Matthews said.\n\"He was a fine young man,\" Matthews said as she cried. \"He had ups and downs, but that gang banging? He had nothing to do with that.\"\nMatthews said she lost an older cousin to gun violence about 20 years ago. But she said the family knew of his lifestyle and weren't particularly surprised by the news.\nThis time, the family has been blindsided by Dawson's shooting death as Matthews struggled to describe her grief.\n\"That was totally different,\" she said. \"This is unexplainable.\"\nDawson was the only one from the shooting to die from his wounds, according to police.\nA 19-year-old woman was shot in her groin and was taken to Advocate Christ Medical Center in serious condition, Pacheco said.\nThree others were listed as \"stable\" at Advocate Christ Medical Center after the shooting: A 20-year-old man was shot in his leg and shoulder, a 25-year-old man had his left leg grazed by a bullet, and an 18-year-old man's back was grazed by a bullet, Pacheco said.\nThe mass shooting has Auburn Gresham residents worried. Three squad cars remained at Foster Park into Tuesday afternoon.\nLisa Lipscomb brought her two nieces and their two friends to the playground at Foster Park ON Tuesday afternoon. She said she heard about the shooting from her nieces' dad, who asked them to stay away from the park.\nBut the girls were pleading with her to get out and run around, she said.\n\"It's worrying,\" she said. \"Even though it's daylight and it's quiet, I know anything can happen. You start to look at every car.\"\nFor more neighborhood news, listen to DNAinfo Radio here:"}