{"uri": "http://www.wcti12.com/news/police-chief-multiple-people-shot-in-greenville/20663354", "title": "Indictment: Greenville shooting spree motivated by race / religion", "dct": "Tue, 24 Sep 2013 21:52:00 GMT", "id": "14e8f5ab0b6576ee3dff57cd0b7b3cf3", "content": "GREENVILLE, PITT COUNTY - The summer shooting spree in Greenville that injured five people, including the gunman, was motivated by race, religion, or related factors, according to indictment documents.\nThe documents, signed on Monday, stated that 23-year-old Lakim Anthony Faust shot and injured the four victims on June 21 because of their \"race, color, religion, nationality, or country of origin.\"\nThe documents also stated that the victims suffered injuries that are \"permanent and debilitating.\"\nFaust is being held at Central Prison in Raleigh under a $6 million bond on four counts of attempted first-degree murder.\nAccording to Greenville Police Chief Hassan Aden, it all started at about 11:44 a.m. on June 21, when Faust shot 64-year-old Timothy Edwards, a Geico insurance adjustor, at the parking lot of the Kellum Law Firm on Greenville Boulevard.\nFaust then allegedly shot three more people at the parking lot of the nearby Walmart. Those victims have been identified as 70-year-old Carroll Oakes, of Grifton; 69-year-old Vernon Leggett, of Greenville; and 50-year-old Haywood Whichard, Jr., of Greenville.\n(CLICK HERE to read what Oakes' family has to say.)\nAll four victims have since been released from Vidant Medical Center. But some of the men have suffered severe and potentially life-altering injuries, police said.\nWhen police cornered Faust, they told him to drop his weapon. But he opened fire on officers, Chief Aden said. Police then shot Faust, but he continued to resist arrest, forcing officers to approach him using a cruiser, Chief Aden added.\nWhen Faust was arrested, police found a pistol-grip shotgun and more than 100 shells on him, Chief Aden said. The suspect was taken to Vidant Medical Center with injuries to his arms and legs as a result of the shootout with officers. He was then transferred to Central Prison in Raleigh.\nWhen investigator searched Faust's apartment at 217 Hartford St. in Greenville, they seized a copy of the Qur'an, the holy text of Islam, and other Muslim books, warrants stated. In addition, officers found a receipt for a shotgun bought from Doc's Gun and Pawn, as well as several boxes of shotgun shells and a gun lock, according to the warrants.\nThe warrants also stated that investigators seized a laptop and a Sony Playstation 3 from Faust's home. The FBI is analyzing Faust's internet browsing history between June 21, 2012 and June 21, 2013, as well as logs of the suspect's emails.\nThe owner of the Kellum Law Firm, Norman Kellum, said his law firm has established a fund to benefit the victims.\n\"These victims and their families are facing astronomical medical and rehabilitation costs. The Kellum Law Firm is establishing a victims' relief fund that we are naming \"Greenville Strong,\" Kellum said. \"All gifts will be tax deductible because the CarolinaEast Medical Foundation will receive and administer those gifts. The Kellum Law Firm is contributing $5,000 and urges everybody to give something.\"\nChecks for the victims can be made payable to the Greenville Strong Fund and mailed to the CarolinaEast Foundation, P.O. Box 1576, New Bern, N.C. 28563. Donations can also be made through carolinaeastfoundation.com.\nKellum also said Faust has no history with the law firm.\n\"He is not a client, never been a client. He just happened to walk through that parking lot,\" Kellum said.\n(CLICK HERE to watch the entire Kellum news conference.)\nAccording to court records, Faust was previously charged with two counts of attempted first-degree murder and two counts of attempted second degree murder for an incident that happened in Baltimore, Md. The charges were filed in November 2004, when Faust was 14 years old. No other details were released about the case.\nFaust was enrolled in a GED program at Pitt Community College in 2006 but didn't finish, said school officials. He was then arrested for trespassing at the school and resisting an officer, and was sentenced to 74 days in jail, according to records. Faust re-enrolled at PCC in 2008, school officials added.\nFaust then performed maintenance and gardening at the Lucille Gorham Community Center in Greenville for one year, beginning in 2010, said ECU officials. Faust was paid by Youth@Work of Pitt County, a non-profit that helps young people obtain job skills.\nIf you are experiencing post-traumatic stress following the shooting, CLICK HERE to download the fact sheet from East Carolina Behavioral Health."}