{"uri": "http://www.8newsnow.com/story/27690496/family-fatal-shooting-of-teen-was-tragic-accident", "title": "Family: Fatal shooting of teen was 'tragic accident'", "dct": "Mon, 22 Dec 2014 16:42:00 GMT", "id": "66e3f34d4445162bd7d5ff1eac466178", "content": "LAS VEGAS — A 14-year-old boy is dead after a gun goes off in the backyard of his Las Vegas home. Police are still investigating Sunday's shooting, but the boy's family said it was an accident.\nThe shooting killed Del'Vonte Jenkins at a home near North Pecos and East Gowan roads around 7 p.m.\nOn Monday, about a dozen family members were at the home supporting Jenkins' mother. Some of them were inside the home on Sunday when they heard a gunshot and ran to the backyard.\n\"I live with him and I wake up everyday with him and he's not here no more,\" said sister Monique Caver.\nShe describes her little brother as someone who could make you smile even when he was on your nerves. \"He was so funny and he's the boy version of me,\" she said. \"That's why it's so hard for me.\"\nThe teen's aunt, Lakisha Hawthorne, was there Sunday night when the shooting happened.\n\"Everybody was in one part of the house and he was in another part of the house and they heard one gun shot. Everybody ran out to the backyard and there he was,\" Hawthorne said.\nWhen police arrived, they found a teenage boy suffering from a gunshot wound. Jenkins was taken to UMC Trauma and was later pronounced dead.\n\"Another one of my nephews came with a gun, and from my understanding, he was showing the gun off,\" said Hawthorne.\nPolice said they are still investigating the shooting. No suspect has been taken into custody and police say there is no motive.\nThe family just says it was a tragic accident.\n\"He's only 14. He didn't get to see 18, not even 21. He didn't deserve to go. He was a good little boy who didn't even go outside and died in his own house in the backyard,\" Caver said.\nJenkins' family planned to hold a vigil for the teen Monday evening near his home.\nCopyright 2017 Nexstar Broadcasting, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}