{"uri": "http://www.kait8.com/story/33442173/family-speaks-after-6-year-old-child-fatally-shot-in-backyard", "title": "Family speaks after 6-year-old child fatally shot in backyard", "dct": "Fri, 21 Oct 2016 02:45:00 GMT", "id": "9507ebe14b622ff944c55534aacbcae5", "content": "SAVANNAH, GA (WTOC) -\nA grieving family speaking out for the first time Thursday night after their 6-year-old boy was shot and killed while playing in his backyard.\nThe Savannah-Chatham Metro Police Department is still looking for the person who killed Rico Hicks on West 50th Street on October 5, just two days before Hurricane Matthew swept through.\nThey barely had time to process what happened before they were forced to evacuate. And then they had to wait for things to return to normal before they could even give him a proper funeral.\nBut they say that's hardly any closure with so many unanswered questions.\n\"All I know is... one of the kids said... he shot Rico, he shot Rico and I remember him pointing but after that, I wasn't worried about that. I was just trying to get some help for him,” said Irene Albert.\nAlbert says she may never get over the fact that her grandson was shot and killed in her fenced backyard. On October 5, she says the 6-year-old was playing with his brother and sister, who are also under the age of 10 when she heard a gunshot.\n\"I jumped up and ran out the back door,” said Albert.\nDuring our interview, we heard what also may have been gunshots in the distance. But the one that Albert heard that day was too close for comfort.\n\"When I got to the backdoor, he was laying right there in the doorway. When I turned him over.. I kind of knew then, but you don't really want to accept that,” said Albert.\nFamily members believe another child in the community may have pulled the trigger, but police haven't confirmed any information about potential suspects.\n\"We believe a lot of people don't know what happened because of the storm and maybe if the story was out there more, we would have gotten answers faster. But as of now, we just want answers so that we can have peace,” said Valerie Hearns.\nFinding peace in this household is harder for some than others.\n\"It's like you replay the whole thing over and over. I can't sleep... I can't eat,” Albert said.\nFor now, at least, she says the siblings that witnessed it are holding up better than her. But in reality, she says, this shooting took three lives because it robbed the other two of their innocence.\n\"I have no idea how that's going to affect them later on in life,” said Albert.\nFamily members tell me the children are getting counseling to help them cope.\nThis is still an on-going investigation. If you have any information, please call police or CrimeStoppers."}