{"uri": "http://www.cbs46.com/story/27970066/shooting-in-dekalb-county-leaves-one-dead-three-injured?autostart=true", "title": "Shooting in DeKalb County leaves one dead, three injured", "dct": "Thu, 26 Feb 2015 10:27:00 GMT", "id": "ed71c1e9272c30bdc4e880b9cf2d0ba4", "content": "DEKALB COUNTY, GA (CBS46) -\nDeKalb County investigators are trying to piece together what led to a deadly shooting inside a home late Wednesday night in the Redan area of the county.\nAccording to Lt. Antonio Catlin of the DeKalb County Police Department, someone inside the home in the 1600 block of Panola Road called 911 at about 11 p.m. When officers arrived, they found four gunshot victims: a woman and three men. One of the men was dead.\nParamedics rushed the surviving victims to Grady Memorial Hospital. Their injuries ranged from minor to serious, Catlin said.\n\"We haven't been able to determine exactly what happened inside the location,\" Catlin said. \"Right now, we have detectives out at the hospital interviewing those witnesses.\"\nThis is not the first time there's been a shooting at the home. In July 2014, two people were shot there. Police are working to determine whether any of the same people were involved.\nBy late morning Thursday, authorities were fairly certain that they had identified the deceased victim, but they had not been able to get in touch with his relatives for confirmation.\nAccording to Mekka Parrish, a spokeswoman for the DeKalb County Police Department, detectives do not believe that Wednesday night's shooting was a stranger-on-stranger crime. Everyone involved knew each other, she said.\nCopyright 2015 WGCL-TV (Meredith Corporation). All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}