{"uri": "http://www.wsmv.com/story/27828010/5-year-old-shoots-another-5-year-old-in-chesterfield", "title": "5-year-old shoots another 5-year-old in Chesterfield", "dct": "Mon, 12 Jan 2015 17:08:00 GMT", "id": "1e90f534f9569896e7f196df2e3b713c", "content": "CHESTERFIELD, VA (WWBT) -\nA Richmond man is facing charges after a 5-year-old used his gun to shoot another 5-year-old, according to Chesterfield Police.\nInvestigators say a child found the gun at the Winchester Greens Apartments and shot his friend. Officers are faulting William Griffin, 28, for the crime. Neighbors say he's the boyfriend of the victim's mother and say he even cares for the child like he's his own. Police say he owned the gun and is being charged with felony child abuse and neglect.\"There was a scream and then my neighbor was knocking on my door saying, ‘help me, my baby',” said a nurse who lives next door to where it all unfolded. She doesn't want to be identified but rushed to the little boy's aid.\n\"If you have an entrance wound, you've got to have an exit, so I rolled him over to see,\" she said. \"I basically sandwiched him in my hands, elevated his feet, loosened his clothing, so he wouldn't go into shock,”\nTen minutes later, emergency medical crews arrived to rush the child to the hospital. Chesterfield police say Griffin left his gun unsecured, providing easy access for three children who were playing upstairs while the adults were downstairs.\n“Children are attracted to and can operate firearms that can cause severe injury or death. They tell you that in the manual,” read Neil Bailey from a gun manufacturer's manual. He sells guns at Bob Moates Sport Shop in Chesterfield and informs every customer of the importance of gun locks, which he also sells.\n\"Most of them will come with two sets of keys and then there are firearms that have locks built into them,” Bailey explained.\nHe also recommends lock boxes for easy access.\n\"It's really sad that the family is broken right now. The mother is at the hospital with the son,” the neighbor said.\nShe is relieved to learn the little boy is expected to pull through.\n\"They're very good people and this was an accident. Accidents happen,” the neighbor added.\nCopyright 2015 WWBT NBC12. All rights reserved"}