{"uri": "http://kxan.com/2016/06/28/austin-police-investigating-13th-homicide-this-year/", "title": "14-year-old shot to death during home burglary", "dct": "Tue, 28 Jun 2016 04:15:00 GMT", "id": "eb82708ac8fea5b568aa7df899b1e441", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nAUSTIN (KXAN) — Austin police say a teenager who is accused of breaking into an East Austin home Monday night ended up being shot to death, possibly by his accomplice. Just after 8 p.m. Monday, police say an unnamed person called 911 to tell them about a possible burglary at a home in the 6000 block of Perlita Drive.\nWhen officers arrived at the home and surveyed the area, they found 14-year-old Axel Kenneth Loera with a gunshot wound. Police believe Loera and his 16-year-old friend broke into the home to steal items but they’re still trying to determine what led up to the shooting. The 16-year-old boy turned himself into police at the Gardner Betts Juvenile Center late Monday night\nAxel’s family tells KXAN they learned that Axel and a few other children broke in through the bottom window of the house on Perlita Drive. The homeowner says the burglars found a gun and ammunition in the upstairs bedroom closet. While police are determining which weapon was used in connection with Axel’s death, the homeowner tells KXAN police did take his firearm as evidence.\n“Whether or not this is accidental or not, we don’t know at this time. Even if it is, recklessly discharging a firearm and causing the death of another person is still manslaughter,” said Lt. Justin Newsom with the Austin Police Department.\nThe suspect is not speaking to police at this time.\nAxel’s sister says her brother was hardworking and was sent to join her at LBJ High School next year.\n“His four years in high school, he was going to spend them with me. Now it just breaks me,” says Axel’s sister Andrea Briones. “He always told people to enjoy life. Live life without worries. He was a hard-working boy.\nThe rest of Axel’s family want to know what exactly happened inside the house.\n“Just know that we forgive you, but just say ‘what.’ That’s the most important thing right now,” says Briones.\nThe suspect is currently charged with burglary but authorities are looking at murder charges.\nThe homeowner says his home is outfitted with surveillance cameras and the information has been turned over to detectives.\nPolice are asking anyone with information to call the Homicide Tipline at 512-477-3588.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}