{"uri": "http://www.nydailynews.com/news/national/n-strip-club-shooting-leaves-3-dead-christmas-article-1.1558062#ixzz2obWQVd00", "title": "Shooting outside New Jersey strip club leaves 3 dead, 2 injured on Christmas", "dct": "Thu, 26 Dec 2013 08:13:00 GMT", "id": "2ad9ecacc937e8a364282e9e049386ad", "content": "An armed man angry because he wasn’t allowed inside a New Jersey jiggle joint Christmas morning opened fire, killing three men — including the bouncer — and wounding two others, officials said.\nThe man tried to enter Slick’s GoGo Bar in Irvington with his gun, but was stopped by a bouncer after he was patted down and the weapon was found around 12:45 a.m., according to officials and reports.\nThat’s when the shooter stepped back and blasted the bouncer before shooting at least one other man outside the club, reported the Star-Ledger.\n“It appears the gunman was trying to enter the bar armed and was stopped by the bouncer,” said Chief Anthony Ambrose of the Essex County Prosecutor’s Office.\nPolice believe the shooter fled the scene in a gray car, according to reports.\nPierre Clervoyant, 34, the strip club owner’s son, and bouncer Woodley Daniel, 32, were both rushed to University Hospital in Newark where they later died, officials said.\nA third man — Mushir Cureton, 27, of Newark — was an unintended target and also died, officials said.\nIt was unclear if Cureton was blasted by the gunman or a member of the club’s security team, according to the Star-Ledger.\nA 27-year-old man from Irvington and a 34-year-old man from East Orange were also wounded in the mammary mecca melee, officials said.\nBoth were also rushed to University Hospital in Newark, according to reports.\nThe strip joint is tucked inside an industrial area a few blocks away from the Garden State Parkway.\nThere have been at least two other shootings at the troubled tata temple in recent years, including a 2010 incident that left one man dead, the Star-Ledger reported.\nSo far, no arrests have been made.\nThe Essex County Sheriff’s Crimestopper’s program is offering $10,000 for any information leading to the arrest and conviction of the shooter."}