{"uri": "http://www.nola.com/crime/index.ssf/2016/12/central_city_homicide_victim_s.html#incart_river_index", "title": "Central City homicide victim survived 3 other shootings, mother says", "dct": "Mon, 02 Jan 2017 15:31:58 GMT", "id": "0a21461e0d9cde85cfd73e1b12e30adf", "content": "The man shot to death in Central City Wednesday afternoon (Dec. 21) had been wounded by gunfire three other times, his mother said, including a November quadruple shooting a block from where he was killed.\nLynette Dowell identified the victim of Wednesday's homicide as her son Kareem Dowell, 25. His body was found before 1 p.m., lying in the 2700 block of St. Andrew Street next to the wheelchair his mother said he had been confined to since his leg was amputated following an August 2012 shooting.\nDowell said her son, the father of two boys ages 7 and 3, also survived shootings in August and November of this year. The latter shooting, which wounded three others, took place at Magnolia and Felicity streets - a block from where Kareem Dowell was killed.\nThere were four victims in a Friday afternoon (Nov. 25) shooting in Central City, New Orleans police said.\nKareem Dowell's brother was also at the scene of Wednesday's shooting, but declined to be interviewed. The victim's brother, however, identified his brother as the man photographed being taken by stretcher from that quadruple shooting. Kareem Dowell's uncle sat, head in hands, on a stoop on Clara Street near the yellow police tape that stretched across St. Andrew. Investigators placed at least six green evidence cones on the ground, three around his wheelchair and one next to where black screens had been placed to shield his body from public view.\n\"He's gone! He's gone!\" Lynette Dowell screamed before breaking down in tears.\nA man was found dead in an apparent homicide Wednesday afternoon (Dec. 21) in the Central City neighborhood, New Orleans police said.\nKareem Dowell's uncle, who asked not be identified by name, said Kareem Dowell is the second son his sister has lost to gun violence. He said her eldest son Arthur Dowell -- Kareem Dowell's brother -- was shot to death in 2007.\nTimes-Picayune archives show Arthur Dowell was gunned down while on a bicycle May 25, 2007, at Second and South Miro streets, also in Central City. Arthur Dowell was 18 when he was shot to death.\nKareem Dowell's uncle said his nephew was \"a damn good daddy\" to his sons. He said people in the neighborhood enjoyed seeing his nephew \"riding them two boys on his lap in that damn wheelchair.\"\nAs the Orleans Parish Coroner's Office worked with police to move his nephew's body off the street just before 3 p.m., Kareem Dowell's uncle talked about how his nephew used to wheel himself in his chair to pick up his sons from school.\n\"How you going to explain that to them children?\" Kareem Dowell's uncle said.\nCorrection: An earlier version of this story gave an incorrect age for Kareem Dowell. He was 25, according to the Orleans Parish Coroner's Office."}