{"uri": "http://www.nola.com/crime/index.ssf/2016/11/central_city_shooting_2.html", "title": "4 victims in Central City shooting: NOPD", "dct": "Mon, 28 Nov 2016 15:42:46 GMT", "id": "40a08ab59d3610965b038ab995fdbdef", "content": "Three men and a woman were shot Friday afternoon (Nov. 25) in Central City, New Orleans police said.\nThe shooting occurred about 4:20 p.m. at the intersection of Magnolia and Felicity streets. Officers found four victims, each with a single gunshot wound. One of the men was shot in the back, while another was shot in the thigh and the third was wounded in an unspecified area, police said.\nThe woman was shot in the left shoulder, police said.\nWitnesses said one of the male victims was in a wheelchair.\nA man at the scene who said he knows three of the victims said he had run from the area when he heard gunshots. When he returned, he saw his friends being loaded onto stretchers and into ambulances.\nThe man, who declined to give his name, said his three injured friends were all awake and talking as EMS prepared them for transport. He said one of his friends, the man who was in a wheelchair, was snap-chatting while on a stretcher. His female friend who had been shot was complaining of pain in her arm and shoulder.\nThe third friend was trying to reassure others from inside an ambulance. \"He was like, 'I'm all right, I'm all right,'\" the man at the scene said.\nA woman who lives nearby said she and her adult son were making dinner when they heard several gunshots. The woman, who declined to give her name, said she then found at least two bullet holes inside of her home, one in the ceiling and another high up on a wall near the ceiling.\nThe woman said she has lived in the home for 20 years and though she has heard gunshots right outsider of her door, this is the first time bullets have struck her home.\n\"It was so close,\" she said.\nA bystander who was at the intersection of Magnolia and Martin Luther King Jr. Boulevard said he heard \"a lot of gunshots\" and saw four people get hit. \"I wasn't trying to see,\" he said. \"I was trying to get out of the way.\"\n\"I heard a lot of gunshots, there were plenty of them,\" said another bystander walking along nearby Thalia Street.\nThe bystander, who also declined to give his name, said the area was full of people, both inside their homes and out on the streets, when the shooting occurred.\n\"Anybody could've got hit,\" he said. \"The bullets kept coming.\"\nEMS transported three of the victims to a local hospital, while the fourth was taken by private vehicle.\nThere were several shell casings visible at the intersection of Magnolia Street and MLK, as well as at the intersection of Magnolia and Felicity streets.\nPolice had placed more than 65 evidence cones in the area, including about 55 cones at the on the corner of Magnolia and Felicity streets, both on the sidewalk and the street in front of a barbershop and beauty salon. Another evidence cone was placed about 10 to 20 feet away in the center of that intersection.\nAnother roughly 12 to 15 evidence cones were placed in a tight group on a piece of sidewalk at the corner of Magnolia and Martin Luther King Jr. Boulevard. Those cones were just outside of a building that appeared shuttered but still bore the name of a community pharmacy.\nA year ago, a 47-year-old man was killed outside a corner store four blocks away at South Liberty Street Martin Luther King Boulevard\nNo further information was immediately available.\nMichael DeMocker contributed to this report."}