{"uri": "http://wkrg.com/2016/08/20/5-people-killed-in-gruesome-homicide-including-pregnant-woman/", "title": "Names Released of Five People “Gruesomely” Murdered in Citronelle, Including Pregnant Woman", "dct": "Mon, 22 Aug 2016 14:03:00 GMT", "id": "7377ad3fcd626b75f4634cfbf6191e54", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nMONDAY 12:00PM: DERRICK DEARMAN AWAITING EXTRADITION TO MOBILE COUNTY\nDerrick Dearman came into the Greene County Sheriff’s Office in Mississippi on Saturday and told authorities he had killed someone, or more than one person in Citronelle.\nDearman is a resident of Greene County. The office also revealed that Dearman has a criminal history that ranges from disorderly conduct, telephone harassment, and resisting arrest in February 2015 to burglary of a dwelling in December 2015. Dearman was released on a $10,000 bond for the burglary charge.\nDearman was placed into custody on Saturday until deputies could verify the incident. After Mobile County Sheriff’s confirmed they were investigating the case, Dearman was booked into Greene County Jail and held for questioning. He refused extradition, and was transported to George Regional Jail de to overcrowding at the Green County facility and to be segregated from other inmates.\nAt around 7:30 this Monday morning, Dearman signed extradition papers and is now awaiting transport by the Mobile County Sheriff’s Office.\nSUNDAY 10:30AM: NAMES RELEASED, DISTRICT ATTORNEY CONFIRMS EXTRADITION PROCESS IS FORTHCOMING\nCITRONELLE, AL (WKRG) — The Mobile County Sheriff’s Office has released the names of the five victims killed in a “gruesome” and “vicious” murder Saturday at a home in Citronelle. It’s being called one of the worst mass killings in Alabama history.\nRobert Lee Brown, 26-years-old\nChelsea Marie Reed (5 months pregnant), 22-years-old\nJustin Kaleb Reed, 23-years-old\nJoseph Adam Turner, 27-years-old\nShannon Melissa Randall, 35-years-old\nAuthorities say the murderer, 27-year-old Derrick Dearman, turned himself in to the Green County Sheriff’s Office and is cooperating with investigators. Dearman, who is said to have let his girlfriend and an infant survive, is in the process of being extradited from Mississippi to Alabama.\nAfter examining the crime scene, Mobile County District Attorney Ashley Rich said it was the most disturbing murder scene she’s ever seen.\n“[In my] 20-year career as a prosecutor, I’ve never seen a scene where there were five people that were brutally and viciously murdered,” Rich said. “That’s what we have here.”\nDearman is believed to have used multiple weapons to commit the savage murders at the home on Jim Platt Road on Saturday morning. Dearman’s girlfriend, 24-year-old Laneta Lester, was staying at the home to avoid Dearman, who said to be abusing her.\nAround 1:00am Saturday morning, police were called to the Citronelle home to report Dearman trespassing on their property, however, he left before officers arrived at the location.\nShortly after, Dearman returned to the property, gained access to the home and attacked the five victims while they were sleeping. Several weapons were used and multiple firearms were later recovered at the crime scene.\nLester and a 3-month-old infant were the only ones spared. The parents of the infant were not identified.\nSLIDESHOW:\nAfter the attacks, Dearman forced Lester and the infant into his vehicle to travel to his father’s home in Mississippi.\nDearman, along with his father, went to authorities to turn himself in, while Lester went to Citronelle Police to give her account of what had happened.\nWhen investigators arrived at the scene of the murders, they found one of the most disturbing crimes scenes they had ever seen.\n“I’ve been doing this for 27 years and I would say that I’ve seen a couple of triple homicides, but not five in one location,” said Captain Paul Burch of the MCSO.\nDue to the horrific nature of the crime scene, authorities predict to be on site for days.\nWith one of the victims being five months pregnant, Dearman will be charged with six counts of murder.\nNews 5 has crews returning to the scene and will bring the latest when it becomes available. A press conference is expected on Sunday or Monday, when new information is expected to be revealed.\nThere isn’t a lot that we know yet about the suspect, Derrick Dearman.\nBut we take a look at the crime scene he left behind and posts on his social media accounts to try to learn a little more.\n27-year-old Derrick Dearman is from Leakesville, Mississippi. While he has been arrested before, we don’t know the full extent of his criminal history.\n“He does have a criminal history, not sure what all is in his past but he did have an active burglary warrant as well,” says Captain Paul Burch with the Mobile County Sheriff’s Office.\nOfficials say Dearman did have a history of drug use, but don’t know yet whether he was on drugs at the time of the murders.\nDearman has at least four Facebook pages. On one of them, he recently changed his background photo to a bonfire last month.\nFolks there are now leaving messages of hate and disbelief. Some wondering if drugs were involved, others calling for the death penalty.\nOn another Facebook page, Dearman posted several memes about relationships and loyalty. They were all posted over a year ago and may or may not be in reference to Laneta Lester.\nExperts say people who abuse their partners have bad and unpredictable tempers. This may be why the crime scene was described as so gruesome.\n“Just the injuries that were inflicted upon each victim. I mean, it was what we would term as overkill. And it was a small home and to see that many victims in that close proximity, and there was a lot of blood.”\nHe is waiting to be extradited sometime this week to mobile county metro jail.\nOfficials say Dearman used several weapons in the mass murder including a gun.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}