{"uri": "http://www.fox10tv.com/story/32806421/names-of-citronelle-murder-victims-released-by-officials", "title": "Names of Citronelle murder victims released by officials", "dct": "Sun, 21 Aug 2016 14:56:00 GMT", "id": "f9c95cf0d541e5c5b69fcd40a2df4996", "content": "CITRONELLE, AL (WALA) -\nThe Mobile County Sheriff's Office has released the names of the five people who were murdered in their home in Citronelle. The names are:\nRobert Lee Brown, 26 years-old\nChelsea Marie Reed, 22 years-old\nJustin Kaleb Reed, 23 years-old\nJoseph Adam Turner, 26 years-old\nShannon Melissa Randall, 35 years-old\nSheriff's investigators say Chelsea Reed was five months pregnant with a boy. Also in the house was a three-month old infant that belonged to one of the murder victims.\nAccording to investigating officers, 34 year-old Laneta Lester was staying with her sister at the home on Jim Platt Road in Citronelle. Sheriff officials said she was trying to leave an abusive relationship with murder suspect Derrick Dearman of Leakesville, Mississippi.\nAround 1:00 a.m. someone inside the house called 911 saying Dearman was on their property, say investigators. Citronelle police arrived on the scene, but Dearman apparently had left, say officials.\nBetween 1:15 a.m. and daylight, Sheriff deputies say, Dearman broke into the house and attacked the adults while they were sleeping. Captain Paul Burch, with the Mobile County Sheriff's Office, said the victims \"put up a fight.\" Mobile County investigators also say Dearman used several weapons.\n“Firearms were used as well as other instruments,\" says Burch.\nAfter the murders, Sheriff officials say Dearman forced Lester and the infant into a vehicle and drove to Mississippi. Investigators say Dearman released Lester and the baby as Dearman, accompanied by his father, went to the Green County Sheriff's office to turn himself in.\nLester and the baby went to Citronelle Police to give her account of the murders, say officials.\nInvestigators say Dearman will be charged with six counts of capital murder because one of the victims, Chelsea Reed, was pregnant, say sheriff's deputies.\nInvestigators said it was one of the most gruesome crime scenes they have ever seen.\n“You always wonder…how one human being could do the things that Dearman did to another human being. This wasn’t, you know, one shot and someone falls down and it’s over with, this was a horrible horrible scene and I can only imagine what the victims were going through as it was happening,” says Burch.\n“There is no doubt that Dearman is responsible…we think he is solely responsible,\" Burch continues, \"“People attacked in their sleep and murdered brutally…fits every bill of capital murder.\"\nCaptain Paul Burch says the 27 year-old Dearman will be extradited to Mobile County \"immediately.\"\nFOX10 News will bring you the latest information on these murders when it is released by investigators.\nAll content © 2016, WALA; Mobile, AL. (A Meredith Corporation Station). All Rights Reserved."}