{"uri": "http://www.montgomeryadvertiser.com/story/news/crime/2016/07/08/update-police-officer-fatally-shoots-man-selma/86876650/", "title": "UPDATE: Police officer fatally shoots man in Selma", "dct": "Fri, 08 Jul 2016 00:00:00 GMT", "id": "ff9bbe51f96bb48507beea839220ca43", "content": "SELMA – An apparent domestic dispute led to the fatal police shooting of a man who had just shot his girlfriend, then wounded a police officer who returned fire, killing the gunman.\nDallas County District Attorney Michael Jackson said Friday that Earnest (Scoop) Fells was fatally shot by a police officer late Thursday after he wounded the officer.\n“(Fells) shot his girlfriend in a hand in front of some children in the house on King Street and then fired at police when they arrived,” said Jackson. “One of the officers returned fire, striking Fells, who was killed.”\nSelma Police Lt. Sam Miller said in a statement issued Friday that one of the officers who responded to the distress call along with other officers “sustained non-life threatening injuries.”\nMiller said officers were attempting to enter the house where the disturbance occurred when shots were fired at them “and an officer returned fire striking” the gunman.\nThe suspect later identified by Jackson as Fells was pronounced dead at the scene, said Miller, who indicated that the woman who had been shot in a hand was treated in Selma and then taken by helicopter to Baptist South Hospital in Montgomery.\nJackson said Fells apparently had been “upset” that his girlfriend was “a little late coming home” and fired at her, striking her in a hand. He said the two had frequently argued.\n“He had talked about killing himself,” said Jackson, who indicated that Fells had operated a washing machine business on Water Avenue.\nJackson said the incident will be presented soon to the Dallas County Grand Jury.\nSelma Police Chief John Brock said the officer who had fired the fatal shot has been placed on administrative leave pending a report from the State Bureau of Investigation."}