{"uri": "http://www.seattletimes.com/seattle-news/crime/3-victims-of-capitol-hill-shooting-released-from-hospital/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_seattle-news", "title": "Police examine video of drive-by shooting on Capitol Hill", "dct": "Mon, 23 Nov 2015 17:08:00 GMT", "id": "ad3b7a510b9fd2cbd95800967777403d", "content": "Plywood covered the opening of a plate-glass window that was blown out by weekend gunfire at the QFC grocery store on Pike Street and Broadway on Monday morning, but that was the only obvious sign of the violence that erupted on the Capitol Hill corner.\nThough five people were injured in the drive-by shooting around 1 a.m. Sunday — four from gunshots and one from flying glass — no one was seriously hurt, according to Seattle police. Witnesses reported hearing an argument nearby before shots were fired from a silver sedan that then sped west on Pike Street, police said.\nThree of the five people who were injured had been discharged from Harborview Medical Center by Monday morning and a fourth victim, who was listed in satisfactory condition, was expected to be discharged later in the day, said hospital spokeswoman Susan Gregg.\nThe fifth person is in satisfactory condition.\nPlay VideoPlayMuteCurrent Time 0:00/Duration Time 0:00Loaded: 0%Progress: 0%Stream TypeLIVERemaining Time -0:00Playback Rate1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptionsAudio TrackFullscreen\nThis is a modal window.\nCaptions Settings Dialog Beginning of dialog window. Escape will cancel and close the window. Text Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps Defaults Done\nThe Seattle Police Department’s Gang Unit is leading the investigation and detectives “are combing through all the video they were able to get” from nearby businesses, as well as one witness’s dashboard camera, said Det. Patrick Michaud, a police spokesman.\nIt could take awhile to view all the footage to see if video-surveillance cameras in the area “caught anything before, during and after” the incident to help detectives build a timeline for the shooting, he said.\nMichaud couldn’t provide any additional information about where the argument may have started or what it was about but said those details will likely emerge as the investigation continues.\nHe encouraged any witnesses who may have video of the incident or those who haven’t yet spoken to officers about what they saw to call the department’s nonemergency line at 206-625-5011.\nIn response to the shooting, police plan to increase nighttime foot patrols in the area. Last year, after an increase of street crime on Capitol Hill, Seattle police instituted added patrols to the area.\nSam Osborne was in bed early Sunday morning, working on his computer, when he heard “a pretty long burst of gunshots” about a block away from his apartment building. Seconds later, he heard the first police sirens heading to the shooting scene, he said, noting the site is near the Seattle Police Department’s East Precinct, at 12th Avenue and Pine Street.\n“The cops got there very quickly,” he said, estimating that a dozen shots were fired.\nThe 23-year-old jumped out of bed, threw on his shoes and ran to the intersection to see if he could offer any help. He noticed plenty of people out, many of them smoking in front of area bars.\n“I was stone-cold sober … but I think everybody was drunk and didn’t know what was happening,” Osborne said.\nWhen he got to the corner, paramedics were already loading a woman onto a stretcher, he said.\nOsborne saw one person lying in front of the plate-glass window, and another man, who had been shot in the leg, hopping on one foot in the middle of Pike Street without a shirt on. Police “got him under control” and escorted him to an ambulance, Osborne said.\n“With 12 shots fired in that quick a succession, it’s a miracle nobody’s dead,” he said Monday."}