{"uri": "http://www.miamiherald.com/news/special-reports/hialeah-mass-shooting/article1953794.html", "title": "Hialeah killer showed signs of trouble before mass shooting", "dct": "Sat, 03 Aug 2013 00:00:00 GMT", "id": "03247d32c6c8acc13cf914f035b22faf", "content": "In the days before his death, Pedro Alberto Vargas watched movie after movie involving shootings, seeking creative inspiration for his own draft screenplay.\nThe infatuation worried his elderly mother, who recounted her son’s actions to a relative shortly after Vargas shot and killed six neighbors on July 26.\n“He has mental problems, like disorders or related to nerves?” an operator asked 83-year-old Esperanza Patterson in a 911 call hours before the rampage.\n“No, no,” Patterson said. “But what he is doing is writing novels.”\nExactly how Vargas, 42, went from being a dedicated son, avid gym-goer and talented graphic designer to the enraged man behind one of the worst massacres in Hialeah history may always remain a mystery.\nBut from a review of public records and interviews with people who knew him emerges a portrait of a troubled loner who over the past five years appeared to have developed a pattern of anonymously harassing his former co-workers.\nHis habit was discovered three days before the shooting. He faced no significant consequences — yet he couldn’t let the matter go.\n“He possibly took his motives to the grave,” said Carl Zogby, a Hialeah police spokesman.\nVargas was born in Havana on Oct. 3, 1970, the only child to teachers who lived on 16th Street in the city’s Vedado suburb. To many in his family he was known as Albertico. His father, who taught literature, died in 1991 or 1992, according to testimony Vargas gave in a July 23 deposition.\nBetween 1990 and 1994, Vargas studied at the University of Pedagogical Sciences in Havana, graduating with a bachelor’s degree in technical education with a focus on construction, transcripts show. His best grades were in English and physical education.\nHe briefly lived with a girlfriend, though they never married. After his father’s death, Vargas and his mother moved in with his grandmother, a relative of Patterson’s said.\nThe family that moved into their vacated Havana apartment complained about how filthy it was, asking if the previous tenants had kept pigs in the bathroom, according to a former Vargas neighbor in Havana who asked not to be identified.\nVargas’ mother won a U.S. visa lottery in 1995 and left for Miami, where she had a sister. Vargas himself won the same lottery two years later and moved to Miami on May 2, 1997. He was 26 years old. Mother and son eventually became U.S. citizens.\n“It was just lucky,” Vargas said in the deposition. “We wanted, like everybody, to leave Cuba and come here, looking for freedom and better possibilities, work.”\nIn 1999, Vargas and his mother moved into the one-bedroom Hialeah apartment at 1485 W. 46th St. where they would live for the next 14 years.\nHe began taking classes at Miami Dade College, graduating in 2004 with an associate’s degree in graphic design and a 3.5 grade-point average.\nAs a student, Vargas worked briefly at a now-shuttered print shop and interned at the University of Miami, where he helped design a media guide for an athletic team. Even then he cared for his mother, a former UM intern coordinator said Friday, describing Vargas as an intense perfectionist.\n“He was extremely mature and responsible,” said the coordinator, who asked not to be identified.\nUpon graduating in 2004, Vargas went to work for the media services department at MDC’s North Campus. Yet he continued to live with his mother, splitting rent and utility expenses, Vargas testified in the deposition.\nHe slept on the couch most nights, though sometimes he slept next to his mother in the only bed in the apartment.\n“They lived in their own world,” said the mother’s relative, who asked not to be identified. “She adored her son. To her, he was such a good young man, he loved her so much.”\nPost-it notes\nTwelve numbered Post-it notes found in Vargas’ apartment last week appeared to be a storyboard, perhaps for his planned screenplay.\n“Louie’s home,” one of them says. “Very Spartan. Louie f--- the whore ... Louie ask her to stay she refuses unless he pays for the rest of the night. Louie insults her.”\nThough Vargas dreamed of buying his own house, the relative said, he didn’t want to leave his mother, particularly after she had knee surgery. Yet she had been on a Miami-Dade waiting list for public housing for herself since 2008, records show, and had applied for housing assistance on seven occasions in Hialeah since 1996, wanting her son to build his own life.\nBank statements obtained by El Nuevo Herald show Vargas had more than $92,000 in a savings account a year ago. But he lived poorly in a dingy apartment with aged furniture and often wore dirty clothes to the several local LA Fitness gyms he frequented to lift weights for hours.\nA gym acquaintance, Jorge Bagos, said the bald Vargas once complained he lost his hair through steroid use. A toxicology screen performed as part of his autopsy is pending.\nVargas had a concealed weapons permit and owned a Glock 9mm semiautomatic pistol he carried with him when he drove at night, he said in the deposition. He didn’t explain where he went, noting only that he did not frequent bars.\nHis career at Miami Dade College went smoothly at first, according to his personnel file, which includes his Cuban and American college transcripts. In work references, colleagues described Vargas as hard-working and talented.\n“Pedro’s work is top-notch,” wrote one of his graphic design instructors, Elio Arteaga.\nArteaga, who now works at DeVry University in Broward, remembered Friday that one assignment required students to design a “DVD interface” for a movie of their choice. Vargas picked The Matrix and designed realistic illustrations of its characters.\nBut despite his talent, said Arteaga, who was visited Thursday evening by Hialeah police digging into Vargas’ past, Vargas “was a little bit socially awkward.”\nOther co-workers called Vargas quiet and buff, often drinking protein shakes at lunch.\nVargas’ performance evaluations were positive until his last year on the job, when a new supervisor wrote that Vargas was difficult to work with.\nHe “lacks social skills,” Elmo Lugo wrote. “It is hard for him to accept change.”\nVargas responded with a letter saying his job description had been unfairly expanded to include managerial work. Attached were three emails from MDC employees who lauded Vargas’ graphic design work.\n‘A 2nd personality’\nBut Vargas didn’t get along with everybody, said Nick Murrell, who used to organize special MDC events for which Vargas designed printed materials.\n“He was always very cordial to me, very polite, very respectable,” Murrell said. But with colleagues he didn’t care for, Vargas could be “abrasive, rude and curt.”\n“There was a second personality that was evident,” he added. “But just because somebody is a little off doesn’t mean they’re going to go and shoot somebody. I never would have believed that he was capable of something so horrible.”\nVargas was forced to resign in 2008 after MDC found he had downloaded inappropriate files from the Internet, including several related to sex and seduction and a computer hacking tutorial that linked to the Anarchist Cookbook, a manual for assembling homemade explosives. Vargas disputed the allegations.\nSeveral months after his resignation, at least two of his former MDC supervisors reported receiving anonymous threats via email, texts and Facebook. Though they suspected Vargas, police were only able to trace the messages to a Hialeah public library.\nVargas then went to work as a graphic designer for another Miami company, but was fired after three months.\nEmployees from that firm also received anonymous emails, according to a source familiar with the case. Managers suspected the recently fired Vargas, but police were unable to identify the emails’ origin.\nIn May 2012, Vargas, through a temp agency, began working at Bullet Line, a promotional products company. He was let go in October after Bullet Line said it no longer had enough work to require Vargas’ services.\nWeeks later, several Bullet Line employees began receiving troubling messages. The company reported the problem to police — and hired an attorney, Angel Castillo Jr., to investigate.\nCastillo sued Yahoo to try to determine the anonymous user sending the emails. Through the lawsuit, he obtained records from the John F. Kennedy Library in Hialeah, where the emails originated.\nCastillo looked for former Bullet Line employees who used the library’s computers on the days the emails were sent. Vargas’ name popped up most frequently.\nSeveral hours into his July 23 testimony, Vargas admitted to authoring the messages. Castillo told him he would close the case if Vargas wrote an apology to his former co-workers and promised not to send any more messages. Vargas sent the apology four hours later.\n“It is time for me to show maturity and a promise not to repeat this mistake ever again,” he wrote.\nBut Vargas continued to worry about the case. He told his mother he feared losing his money, the mother’s relative said.\nAt 1:37 p.m. on July 26, a perturbed Vargas called 911 to report someone was following him and he was the victim of brujería — sorcery — that had begun with Castillo. Before that, Vargas had only once crossed Hialeah police’s radar, in May 2012, to report stolen hubcaps.\nHis mother told 911 her son had been acting strangely. She thought he needed a psychiatric evaluation. Police dispatched two officers but called them back after the mother said Vargas had left with a container to buy gasoline.\nVargas visited the Kendall office of Castillo, who was out. Police believe Vargas was intent on killing the lawyer.\nWhen Vargas returned home, carrying the gasoline and a bag full of cash, he set fire to the money. His mother suffered burns trying to put out the flames with her feet. The smoke prompted 911 calls and a visit to apartment 408 from the building’s husband-and-wife managers, Italo and Samira Pisciotti, 79 and 69, respectively.\nVargas shot them dead.\nParamedics and police officers pulled up outside minutes later. Vargas shot at them from his balcony but missed, instead hitting 33-year-old Carlos Gavilanes, who was entering the building across the street. He died next to his unharmed 9-year-old son.\nVargas then made his way to apartment 304, kicked in the locked door and killed Patricio Simono, 64; his girlfriend, Merly Niebles, 51, and her daughter, Priscilla Perez, 17. Priscilla had been hiding in the bathtub.\nIn apartment 523, Vargas took Sarrida and Zoeb Nek hostage. Police negotiated with him for four hours before charging in, killing Vargas in a gunfight and rescuing the hostages.\nVargas, wearing a white undershirt, blue plaid long-sleeved shirt and jeans, was trying to reload his pistol, police said, and had two full magazines of ammunition.\nHis mother, the relative said, has been hospitalized and is devastated.\n“She carries the pain of her son, but also the pain of the people who died,” the relative said. “She’s crying all the time.”\nOn Friday, nearly a week after the shooting, Vargas’ body lay in the Miami-Dade medical examiner’s office.\nNo one had claimed it for burial.\nMiami Herald staff writers Joey Flechas and David Ovalle, and El Nuevo Herald staff writers Enrique Flor, Julio Menache and David Noriega, contributed to this report."}