{"uri": "http://www.sooeveningnews.com/article/20150916/NEWS/150919307", "title": "Teen suffers gunshot wound", "dct": "Sat, 28 Jan 2017 19:35:04 GMT", "id": "23631cf9a09125122284dedfd727e285", "content": "The Chippewa County Sheriff's Office is using Monday's accidental shooting in Bruce Township as an opportunity to remind all local residents to be careful as they prepare for the upcoming hunting seasons.\nChippewa County Undersheriff Mike Bitnar explained that a long-gun, described as a .22 rifle, had broken and was undergoing repairs when it accidentally discharged - propelling the bullet into the arm of a teen-aged boy.\nThe boy was conveyed to War Memorial Hospital where he underwent treatment for injuries that were not considered life-threatening. His name is not being officially released.\nDeputies questioned all of the involved parties and witnesses related to this incident and determined the gunshot wound was accidentally inflicted. While it was described as preventable, it does not appear as though any criminal charges will be forthcoming related to this incident.\nDeputies also observed that alcohol does not appear to be a factor.\n\"We're just reminding everyone of the safety rules for firearms,\" said Bitnar saying it was a two-part report on the Monday accident.\n\"It was approximately one year ago, another child from our county became a victim of unsafe firearm practices with a much more tragic result,\" according to a Chippewa County Sheriff's Office press release referencing the death of a Sault Area Middle School student when a gun discharged in a vehicle. \"When tragedy strikes, it involves many more people than the victims and their families. EMS, fire, police, teachers, classmates of these children all suffer. Please be responsible and safe.\"\nIn issuing the official reminder Chippewa County Sheriff Deputies are urging the public to:\n- Treat all firearms as if they were loaded.\n- Always point firearms in a safe direction.\n- Store your weapons in a safe place or attach gun locks to them.\nDeputies also concluded their press release by reminding parents and other adults that it is their duty to teach children these important safety lessons to prevent any future tragedies and injuries."}