{"uri": "http://pittsburgh.cbslocal.com/2014/11/21/police-6-shot-outside-of-clairton-speakeasy/", "title": "Police: 6 Shot At Clairton Speakeasy", "dct": "Fri, 21 Nov 2014 06:40:00 GMT", "id": "b8cd3a9ab19702653b5a89cec370efde", "content": "PITTSBURGH (KDKA) – Clairton and Allegheny County Police continue to investigate after a half-dozen people were shot overnight inside what investigators describe as a “speakeasy.”\nIt was about 3:30 a.m. when Clairton Police got a number of 911 calls about gunfire that began inside the establishment on the 600-block of Miller Avenue.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nOn Friday afternoon, workers from the City of Clairton made sure no one would go back into the building, which is now condemned.\nA group of young men, not believed to be local to Clairton, confronted a group already inside and then the gunfire rang out.\n“From what we’re piecing together, it sounds like there was a group of young men who arrived, who are not local to Clairton. We’re not sure where they’re from, and shortly after they arrived, there was some type of fight and then the shooting following thereafter,” said Allegheny County Police Lt. Andrew Schurman.\nIn all, six people were shot, and victims as well as patrons scattered. Two were in serious condition at mid-day. Three people were transported to hospitals from the scene. Three other victims showed up later at area hospitals by their own means.\nAll of the victims are men in their early 20s.\nThe gunfire started in the building, but may have spilled out into the street.\n“There is a car that showed up at one of the hospitals with bullet holes in it, so it may have,” said Lt. Schurman.\nThe sign on the door said members only 21 or older, but investigators called what went on inside as a speakeasy where liquor was sold without a license.\n“In speaking with the Clairton police, the understanding that I have is that this establishment is not a licensed business, and in some capacity, they are selling alcohol illegally,” said Lt. Schurman. “They used the term ‘speakeasy’ to describe it. Obviously, they were looking into what was going on in this building prior to the shooting.”\nAllegheny County Police are continuing to investigate and look for witnesses.\nAnybody with information about the shooting is asked to call Allegheny County Police.\nYou May Also Be Interested In These Latest News Stories\nJoin The Conversation On The KDKA Facebook Page\nStay Up To Date, Follow KDKA On Twitter"}