{"uri": "http://www.kansascity.com/news/local/crime/article3858638.html", "title": "Murder charges are filed in the drive-by shooting death of 6-year-old Angel Hooper", "dct": "Wed, 12 Nov 2014 17:29:00 GMT", "id": "006365b5098397425dfc41c89008c81b", "content": "Two men allegedly involved in a drive-by shooting that killed a 6-year-old girl and enraged the community have been charged in the child’s death, prosecutors announced Wednesday.\nJackson County prosecutors charged Howard Chase IV, 19, and Leandre Smith, 21, each with second-degree murder, unlawful use of a weapon and two counts of armed criminal action.\nAngel Hooper was with her father leaving the 7-Eleven at 10615 Blue Ridge Blvd. on Oct. 17 when someone in a passing car fired multiple gunshots toward the store. She was the only person hit.\n“She remains one of Kansas City’s most tragic homicide victims,” Jackson County Prosecutor Jean Peters Baker said during a news conference. “The individuals responsible for this very tragic and very senseless death of Angel Hooper are going to be held accountable.”\nAngel was not the target of the shooting, Baker said.\n“Our hearts and prayers remain with this family as they grieve and as they await justice,” Baker said.\nA relative of Angel said the family was still dealing with the grief and bracing for what would have been the girl’s seventh birthday in December.\n“It’s been surreal,” said Ashley Newson, a cousin to the girl’s mother. “I am very happy that we get to close this chapter … and get to move on further with the healing process.”\nThe chain of events that led to the shooting began hours before the killing when two women met to fight in a parking lot at 72nd Street and Indiana Avenue, according to court documents filed in support of the charges.\nChase was at the scene of the fight and was among several others armed with guns, according to the allegations. One of the participants in the fight later told police that as she left in a black Mazda, one of the passengers in the car fired a shot in the air.\nLater that night, the Mazda was found peppered with bullet holes and abandoned on the side of the road, according to court records. When detectives tracked down the owner, they were told that the car had been shot as it pulled into the parking lot of the 7-Eleven where Angel was killed.\nWitnesses at the scene of the shooting reported that shots had been fired from a white Pontiac Grand Prix.\nOn Oct. 23, the documents state, police identified the owner of the Pontiac, who told them Smith was her boyfriend and regularly drives her car, including on the night Angel was killed.\nSmith, who was wanted in another case, was arrested Oct. 28 and told detectives, according to the charges, that he and Chase were together in the Pontiac that day but denied that they were involved in the killing. He claimed to be at another location, but according to the court documents, cellphone records did not support his claim.\nOn Oct. 30, another witness was questioned by police. That witness alleged that Chase told him he and Smith had been involved in a “shootout” at the 7-Eleven. Chase told him that the guns used in the incident had been destroyed, according to the court documents.\n“They won’t find them,” Chase allegedly told the witness.\nOn Tuesday, another witness contacted police and said he had been told by Smith that he and Chase shot at somebody at the 7-Eleven. Smith allegedly told the witness that they shot at somebody who they believed had shot at a relative earlier in the day.\nOne of the participants in the earlier fight is a cousin of Chase, according to the court documents.\nChase was taken into custody Tuesday and denied being in the Pontiac or being involved in the homicide.\nBut according to the court documents, cellphone records show that his phone was in the vicinity of 107th Street and Blue Ridge Boulevard “within minutes” of the homicide.\nProsecutors asked that Chase and Smith be held without bond.\nAfter the little girl’s killing, community members responded with rallies, prayer vigils, a makeshift memorial and handmade signs expressing outrage. A reward fund grew to $21,000 as police and city officials pushed the public to provide tips in the case.\nNews of the charges being filed prompted gratitude and relief.\n“What I am most excited about is that someone has come forward (with tips),” said the Rev. Ronald Lindsay, pastor of Concord Fortress of Hope Church in south Kansas City. “(But) it is a tragedy that it has taken so long for people to come forward.”\nPat Clarke, an anti-crime activist and president of the Oak Park Neighborhood Association, commended Kansas City Police Chief Darryl Forté and investigators for the arrests. But he said more needs to be done to eliminate urban violence.\n“This is a good day when you finally pull in somebody for a homicide. But it is an even greater day when you convict them for it,” Clarke said. “There are other homicides that remain unsolved. The community needs to start taking responsibility for it.”\nMike Gregory, manager of Paul’s Drive-In on Blue Ridge Boulevard, said news of the charges answered a prayer.\n“The Police Department always has done an outstanding job for us, and I knew that they would catch them,” Gregory said.\nJames Williams of the Razor’s Edge Barber Shop on Blue Ridge Boulevard said the news was a big relief.\n“Everybody has been on edge regarding this, so that somebody has been caught and could be brought to justice — that is awesome,” Williams said.\nThe Rev. Eddie Reed, pastor of New Hope Missionary Baptist Church in Independence, whose congregation includes Charity Guinn, Angel’s mother, said there is no such thing as closure in such a case.\n“But I am happy that they found someone,” he said, “and I’m glad for the family.”\nSmith already was facing an unlawful use of a weapon charge filed in connection with a June 2013 incident near 73rd Street and Indiana Avenue.\nOfficers responding to a disturbance call allegedly saw him carrying what turned out to be a stolen .45-caliber handgun.\nAccording to court records, the gun was cocked and loaded. Smith told investigators he had bought the gun for $350 on the street and carried it for protection. It had been stolen from a home in Sugar Creek.\nThe Star’s Brian Burnes and Mark Morris contributed to this report.\nTo reach Tony Rizzo, call 816-234-4435 or send email to trizzo@kcstar.com.\nTo reach Glenn E. Rice, call 816-234-4341 or send email to grice@kcstar.com."}