{"uri": "http://www.chicagotribune.com/news/local/breaking/chi-1-dead-4-wounded-in-south-side-shooting-20130625-story.html", "title": "1 dead, 4 wounded in South Side shooting", "dct": "Tue, 25 Jun 2013 09:55:00 GMT", "id": "75bc784255e27dfec87d5dd2b2119337", "content": "A woman was killed and four other people were wounded early this morning in a drive-by shooting in the Park Manor neighborhood on the South Side.\nAround 2:30 a.m., a car carrying five people was near the intersection of 73rd Street and King Drive when another car pulled alongside, said Police News Affairs Officer John Mirabelli, citing preliminary information.\nA person inside the second car opened fire, striking the five in the other car, Mirabelli said.\nMarissa Boyd-Stangley, 19, of the 7400 block of South Eberhart Avenue, suffered wounds to her head and body and was pronounced dead at 6:05 a.m. at the morgue, according to the Cook County medical examiner's office.\nA 20-year-old man suffered wounds to his chest and was taken to Advocate Christ Medical Center in Oak Lawn in serious-to-critical condition.\nAnother 20-year-old man suffered a wound to his shoulder and was taken to Saint Bernard Hospital and Health Care Center, where his condition was stabilized, Mirabelli said.\nAn 18-year-old man and a 19-year-old woman were both shot in the hand and were taken to Jackson Park Hospital and Medical Center, he said.\nA neighbor said he was awaken by the shots, then heard someone at his door.\n“A woman was shot in the hand,” he said. “She walked up to our door and asked us for help.”\nThe neighbor said the woman was calm, but one of the men who was wounded was jumping up and down and yelling about a gang. The woman who died was lying on the ground outside of the car, he said.\n“Whoever the shooter or shooters were, they caught (the victims) by surprise,” the neighbor said. “It appeared as if they followed the victims and caught them at a stop light.\n“I don’t know if it's related but there were large groups, a lot of people, hanging out on both sides of 74th Street and Vernon yesterday.”\nHe said police removed bullets from the driver’s side door, trunk and back windows of the car.\nNo description of the gunman or the car was available."}