{"uri": "http://www.al.com/news/birmingham/index.ssf/2016/04/man_toddler_injured_in_shootin.html", "title": "'They shot my baby:' Man, toddler injured in shooting on roadway in Ensley", "dct": "Sun, 03 Apr 2016 18:08:05 GMT", "id": "0a8b74d37bfe1d97d9696d701942733d", "content": "A man and a toddler were shot and injured Saturday evening while traveling on Warrior Road in Ensley.\nThe shooting occurred on Warrior Road near the Mystik gas station at Avenue L at around 6:10 p.m., according Birmingham police Sgt. Bryan Shelton and a witness at the scene. A Buick occupied by three adults and a young male child sustained the gunfire.\nFarris Ahmed, a clerk at the Mystik, said the gunfire erupted between two vehicles traveling on Warrior Road past the gas station and towards 40th Street and Pike Road. None of the shooting occurred in the parking lot, he said.\n\"When I heard the shots, I went down,\" Ahmed said, illustrating how he ducked below the counter.\nThe Buick stopped less than a mile away at Spur Groceries on Pike Road where police and two ambulances responded.\nShelton said the child is in stable condition at Children's of Alabama. The man was transported to UAB Hospital. His condition is unknown.\nAnjelica Williams, 25, walked out of her house on Pike Road and saw the commotion across the street. The Buick and only one police car was there at the time, she said.\n\"I was coming out of the house to sit on the porch and eat and just enjoy the weather,\" Williams recalled.\nBut, instead of enjoying the weather, Williams saw a father fighting to save his young son's life.\n\"The dad had the child on the trunk of the car doing CPR on his baby,\" Williams said, adding that she heard the toddler cry. \"(The dad) was holding the wounded area.\"\nShe said the dad, who wasn't injured, was hysterical.\n\"(The dad) completely broke down,\" Williams said, adding that the father's hands were covered in blood, and he was sobbing over his child.\nShe said he was telling emergency personnel, \"Man, they shot my baby.\"\nThe man who was shot was slumped inside the car when she first walked outside, Williams said. She later saw him move.\nShelton said investigators don't yet know the motive behind the shooting, and if the men were targeted.\nPolice were unable to provide any information on a possible suspect vehicle while at the scene early Saturday evening.\nAhmed said witnesses at the scene saw a gray Dodge Charger.\nWilliams said the scene across from her house was \"very scary.\n\"It makes you think of your loved ones,\" she said. \"We as a community have to do better.\""}