{"uri": "http://www.kentucky.com/news/local/crime/article44418864.html", "title": "From April 15: Police release photo, want to talk to man about fatal shooting at Lexington bowling alley", "dct": "Mon, 15 Apr 2013 20:39:00 GMT", "id": "dbfdc50559c5dcf03f699f56195e9000", "content": "Police released a photo Monday of a man whom detectives want to talk to about a shooting that left one dead and four injured just before midnight Sunday at Lexington's Eastland Bowling Lanes.\nThe man's image was captured on surveillance cameras in the bowling alley.\nLexington Police Sgt. Pete Ford said during a news conference Monday that detectives do not know who the man is. Ford said the man was not considered a suspect or person of interest in the shooting death of Steven Reynolds.\nThe man could \"have information that is crucial to this investigation,\" Ford said. \"This is just somebody we'd like to talk to.\"\nNo arrests had been made as of Monday evening. Lexington police spokeswoman Sherelle Roberts said police were \"working on identifying suspects at this point.\"\nPolice did not release many details about the shooting, the scene of which was described as pandemonium.\nThe coroner identified Reynolds, 22, of Lexington early Monday. Authorities did not release the names of the injured.\nReynolds was pronounced dead at 12:26 a.m. Monday at University of Kentucky Chandler Medical Center, according to the Fayette County coroner's office. He died of a gunshot wound, a news release said.\nRoberts said the most seriously wounded person was taken to UK Hospital and underwent surgery.\nThe bowling alley apparently was hosting an event for college-age people, Roberts said.\nDanny Collins, president of Collins Bowling Centers, which owns Eastland, said the event was called Soul Bowl and featured a disc jockey. There were about 160 people at the party, which began at 9 p.m. Sunday and was scheduled to end at midnight, Collins said.\nA group of people confronted others who were bowling, and alley officials decided to end the event after the confrontation got physical, Collins said. The shooting started as they were getting everybody out of the building, he said. No bowling alley employees were injured, he said.\nFord said initial calls to police described the situation as \"a riot.\"\n\"Once the gunfire rang out, you can expect some pandemonium to occur,\" Ford said. That environment made it difficult for officers to locate witnesses and preserve evidence, he added.\n\"It's a difficult situation because you don't know who's involved and who's not involved, and it's just a chaotic scene, so we are trying to piece together everything,\" he said. \"Right now this is like having a thousand-piece puzzle, and we're just trying to put everything back together.\"\nFord confirmed accounts of minor altercations in the bowling alley before the shooting.\nFord said he did not know how many people fired shots. He would not say whether police had recovered a weapon.\nHe also said he did not know how many victims remained hospitalized late Monday afternoon.\nThe bowling alley was closed Monday, and Collins said he expected to reopen Tuesday afternoon.\n\"We're a family-oriented business,\" he said. The event targeted people who liked to bowl later at night, but it \"was a nice environment\" and \"a clean-run\" event, Collins said.\n\"We've been in business for 50 years, and nothing like this has ever happened.\"\nCollins said he no longer would hold the Soul Bowl.\nFord said police didn't want the incident to reflect badly on the bowling alley.\n\"I do believe this is an isolated event,\" he said. \"We would encourage everyone to go back and visit with this facility in the future. They will continue to do what they can do to make it a safe and pleasant environment for everyone involved.\"\nReynolds' uncle James Reynolds said during a telephone interview that his nephew \"was a good young kid\" and the father of a young son.\n\"This violence needs to stop,\" Reynolds said.\nSeveral people posted condolences for Steven Reynolds on the social network website Twitter. One of them was Winston Guy Jr., a former safety on the UK football team who now plays for the Seattle Seahawks. He said the news made him cry.\nDuring a telephone interview, Guy was in tears as he talked of growing up with Reynolds in Lexington's Winburn neighborhood. Guy said he had not seen Reynolds in a few years, but \"I'm hurt because in my eyes he was like a brother.\"\n\"He was somebody's son, he was somebody's cousin, he had a sister. Life is too precious, too short,\" Guy said."}