{"uri": "http://www.kentucky.com/news/local/crime/article44419155.html", "title": "From April 16: Victim of shooting at Lexington bowling alley describes 'war zone'", "dct": "Tue, 16 Apr 2013 21:00:00 GMT", "id": "eafa90e9ef06d938c9e6ed372725b03f", "content": "One of the five men shot at Eastland Bowling Lanes Sunday night described the scene as a \"war zone\" and \"battlefield,\" with more than one person shooting.\nMalcolm Williams told the Herald-Leader Tuesday that he doesn't think he and his friends were the intended targets. Williams, 22, said he was \"good friends\" with Steven Reynolds, also 22, who died from a gunshot wound. He said Reynolds was shot in the chest.\nWilliams said he didn't know what caused the free-for-all or who shot him.\nFists and bullets started flying shortly before midnight Sunday during the bowling alley's Soul Bowl event, where about 160 people had gathered. The sound of gunfire sent the crowd running in all directions, police and witnesses said.\nPolice said Tuesday they had no suspects.\nWilliams, who said he was shot in the collar bone, said he thought shots were fired both inside and outside the bowling alley.\n\"A fight broke out and the next thing you know shots just rung from everywhere,\" he said.\nWilliams described Reynolds as a giving person who had a young son.\n\"I've known him almost my whole life,\" he said. \"I've been knowing him since I was 8 years old. We went to elementary school together.\"\nThree other friends were shot as they tried to get out the front door, Williams said. A police report identified them as Jeffery Holland, 20; Dominique Mason, 24; and Vincenzo Happy, 23.\nWilliams said Holland was shot in the leg, Mason was shot in the head and Happy was shot in the ribs.\nKathy Johnson, a spokeswoman for University of Kentucky Chandler Hospital, said she did not have information on the conditions of any of those men Tuesday. Information on hospital patients involved in criminal cases is sometimes restricted.\nHowever, Williams said Holland and Happy were doing OK. Mason was in more serious condition and possibly suffered some brain damage, but was able to speak when he woke up from surgery Monday night, he said.\nDanny Collins, president of Collins Bowling Centers, which owns Eastland, said alley officials had decided to end the event after people began fighting inside. The shooting started as they were getting everybody out of the building, he said.\nWilliams said he didn't know what people were fighting about, but he and Reynolds were trying to push their way through a crowd that had gathered around an altercation. They wanted to see who was fighting, \"to see if it was one of our friends,\" he said.\nAbout that time, they heard a gunshot and started heading for the front door, he said. They got shot near the doorway as gunfire erupted in the parking lot, he said.\n\"We were not shooting. We were not fighting,\" he said. \"We were just trying to have a good time.\"\nOn Monday, Lexington police released a surveillance photo of a man they wanted to talk to about the shooting, but they had not identified him Tuesday, Lexington police Sgt. Pete Ford said.\nFord said police had not determined how many people were shooting. He noted that the pandemonium made it difficult to gather evidence or find those involved.\nFew people had come forward with tips.\n\"We are waiting for information,\" he said. \"Due to the amount of the people that were there, we're sure someone has information that can help us.\"\nPolice called the incident an isolated event and said it should not reflect poorly on Eastland Bowling Lanes.\nCollins said it was the first time in the bowling alley's 50 years in business that such an incident had occurred. He said Eastland would no longer hold the Soul Bowl.\nHOW TO HELP\nAnyone with information is asked to contact the Lexington Division of Police at (859) 258-3600 or (859) 258-3700. Anonymous tips can be submitted to Bluegrass Crime Stoppers at (859) 253-2020; by texting \"tips2020\" plus your message to CRIMES (274637); or online at Bluegrasscrimestoppers.com."}