{"uri": "http://www.weau.com/home/headlines/4-dead-1-hurt-in-shooting-on-Wisconsin-bridge-302379031.html", "title": "NEW INFORMATION: Family calls man killed in Wisconsin shooting kind, gentle", "dct": "Mon, 04 May 2015 00:58:00 GMT", "id": "f445a33dbdf0263e502652fd933df05b", "content": "MADISON, Wis. (AP) -- The family of a man killed after a gunman opened fire on a bike trail in an eastern Wisconsin city says he was a gentle person.\nThirty-one-year-old Adam Bentdahl of Appleton was killed on Sunday after police say military veteran Sergio Daniel Valencia del Toro opened fire on the path in Menasha. Jonathan Stoffel of Neenah and his 11-year-old daughter Oliva were killed, too. Stoffel's wife, Erin, was wounded before del Toro killed himself. Police said del Toro was apparently upset over an argument with his ex-fiancee.\nBentdahl's family said in a statement Monday they are saddened by his senseless death. They said he was a kind and gentle person with a bright personality. They added they're praying for the Stoffel family as well as del Toro.\n--------------------------------------------\nMENASHA, Wis. (AP) -- Police have revealed more about what may have motivated a gunman to shoot four strangers before killing himself on a recreational bridge in Menasha.\nThe city's police chief, Tim Styka identified the dead Monday as 33-year-old Jonathan Stoffel, of Neenah, his 11-year-old Olivia Stoffel and 31-year-old Adam Bentdahl of Appleton. Stoffel's wife, Erin, was shot three times, but survived and is hospitalized in critical condition.\nThe chief says the 27-year-old gunman, Sergio Valencia del Toro, fatally shot himself after randomly shooting the others near a pavilion on the bridge Sunday night. Styka says del Toro and his fiancee had recently called off their wedding and had argued before the shooting.\nErin Stoffel and two other children, ages 5 and 7, made it off the bridge with the older child running for help.\n----------------------------------------------------\nMENASHA, Wis. (AP) -- The person who survived a shooting that left four others dead on a Menasha recreational trail bridge remains hospitalized in critical condition.\nTheda Clark Medical Center spokeswoman Megan Mulholland said Monday the survivor is a woman in her 30s.\nMenasha police say a gunman opened fire on the bridge Sunday night in a random shooting on the Fox Cities Trestle Trail bridge. Chief Tim Styka says the shooter is among the four dead.\nPolice continued their investigation into the shooting Monday.\n-------------------------------------------\nMENASHA, Wis. (AP) -- Four people are dead and another in critical condition, after a shooting on a popular pedestrian bridge in eastern Wisconsin. Investigators believe it is a random act of violence.\nOfficer Aaron Zemlock, a spokesman with the Menasha Police Department, said that the shooting happened around 7:30 p.m. Sunday on the west end of the Fox Cities Trestle Trail bridge.\nMenasha Police Chief Tim Styka said late Sunday night that the shooter was among those who died. The man was pronounced dead at a hospital.\nStyka said the lone surviving victim was undergoing surgery at Theda Clark Medical Center. None of the victims were immediately identified.\nAccording to Styka, officers do not believe there is any other threat to the community at this point. He said no responding officers fired their weapons."}