{"uri": "http://fox4kc.com/2016/11/06/breaking-frantic-mother-arrives-at-research-medical-with-baby-who-had-been-shot/", "title": "Witnesses: Frantic mom brings baby to KC hospital wrapped in bloody blanket", "dct": "Sun, 06 Nov 2016 21:26:00 GMT", "id": "27b880538a48058d7b5cc792b9b40278", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nKANSAS CITY, Mo. -- A little girl is recovering in the hospital after she was shot Sunday night. She is the third child to be shot in the metro within the last two weeks.\nA heavy police presence surrounded an SUV outside Research Hospital where witnesses said a woman ran into the facility screaming that her baby had been shot around 7:45 p.m., Sunday. The little girl is approximately one-year-old. Witnesses said the mother was holding a baby wrapped in a bloody blanket.\nPolice searched Sunday night near Emanuel Cleaver II Boulevard and The Paseo. They also used crime scene tape to block off the area around the white SUV the family drove to the hospital while they searched it for clues.\nPolice said the child's father arrived at the hospital, also shot. He is said to be in stable condition, while his daughter is in critical condition.\nPolice are in contact with the parents and are investigating the incident.\nAs of Monday morning, investigators said they still aren't sure who fired the shots that hit the little girl, but initially they were investigating it as a possible drive-by shooting.\n\"Another child shot,\" Jackson County prosecutor Jean Peters Baker tweeted late Sunday. \"Infuriating! Some problems are complex. But not this one-kids can be safe w/ simple & inexpensive gun safety measures.\"\nFriday night deadly shooting of one-year-old boy shot in Kansas City, Kan.\nOn Friday night, one-year-old Antonio Rucker Jr. was accidentally shot and killed while picking up a pizza at Little Caesars in Kansas City, Kan.,with his mom and father. Antonio was pronounced dead at Children's Mercy Hospital. There reportedly was a gun inside the car, as well as the child’s mother and one other person, while the child's father was inside getting a pizza. Police are still working to determine how the gun was fired.\nJermone Green, 3, killed when his brother mistakes gun for a toy\nAt the end of October a 3-year-old Jermone Green was accidentally shot by his older brother near 19th and Topping Avenue. A grieving grandfather told FOX 4 his grandson picked up the gun, thought it was a toy and then shot his baby brother. The shot killed Jermone instantly."}