{"uri": "http://racinecountyeye.com/police-man-says-shooting-woman-accidental/", "title": "Police: Man Says Shooting Woman was Accidental", "dct": "Thu, 03 Nov 2016 00:00:00 GMT", "id": "8a555ddd6c77580767cbfa02b291080a", "content": "Racine police say a 21-year-old man is facing up to 25 years in prison after he told them he accidentally shot a woman.\nKeeon Trice was assigned a $10,000 cash bond at his initial appearance Wednesday when he appeared in Racine County Circuit Court to formally face a single count of felony first degree reckless injury by use of a dangerous weapon. If convicted, he faces up to 25 years in prison and/or up to $100,000 in fines.\nAccording to the criminal complaint, police and rescue were called at 5:18 p.m. Oct. 27 to the 1200 block of Marquette Street for a report of a woman suffering from a gunshot wound. She was found on the sidewalk outside the residence with injuries to her right arm where a bullet went through and then entered her side and lodged near her spine. The woman was later airlifted to Froedtert Hospital for treatment.\nPolice say Trice, the victim’s boyfriend and another person all told conflicting stories, and further investigation determined that Trice and the other witness came over to the woman’s home that she shared with her boyfriend. While the witness and the woman’s boyfriend were in one room, Trice and the woman were in another.\nOfficers say the boyfriend and the witness said they heard a gunshot from the other room. When the two went to see what happened, they saw the woman was shot and Trice said it was an accident and the “gun just went off.” The trio fabricated a story about the woman being shot outside, but later admitted that Trice was the one who shot her.\nThe woman was placed in ICU at Froedtert and was scheduled for surgery but able to tell police what happened, the complaint reads. She corroborated the story her boyfriend eventually admitted to about her being shot inside their home. Trice was handling the gun by racking the slide when he accidentally fired it. She said she was sitting down and Trice was standing behind her right side, which corresponded with her injuries.\nTrice remains in the Racine County Jail on a $10,000 cash bond and will next be in court Nov. 9 for his preliminary hearing."}