{"uri": "http://www.unionleader.com/crime/Men-arraigned-in-beating-shooting-of-man-in-flag-squabble-11082016", "title": "Men arraigned in beating, shooting of man in flag squabble", "dct": "Tue, 08 Nov 2016 16:07:00 GMT", "id": "0cb77543f78e75f996357bc911fd3b35", "content": "New Hampshire Union Leader\nMANCHESTER -- Two men, accused in the shooting and beating of another man in a dispute over a Free State symbol on flag, were arraigned Tuesday in 9th Circuit Court - Manchester.\nMichael Sirois, 22, of 11 Tenney Road, Chester, was arraigned on felony charges of first-degree assault and second-degree assault. He is free on $100,000 cash/surety bail, pending a Dec. 7 probable cause hearing.\nJason Gerry, 21, of 306 Fremont Road, Sandown, was arraigned on a second-degree assault charge; driving while under the influence, second offense; driving without proof of financial responsibility; and operating after suspension. He posted $6,000 cash/surety bail pending a probable cause hearing on Dec. 7 and a trial on Dec. 20.\nAccording to court documents, Sirois has no criminal record while Gerry has convictions for driving under the influence; disorderly conduct, two counts; criminal threatening, two counts; controlled drugs, acts prohibited; simple assault; criminal mischief; resisting arrest/detention, and criminal threatening, fear of bodily injury.\nAt least three people witnessed the fight and shooting early Saturday morning outside 131 Amory St., a congested neighborhood on the city's west side.\nJarrod Ean-Dixon, 36, of 131 Amory St., was allegedly sucker punched by Gerry who, later, when Ean-Dixon was down on the ground, kicked him in the face. Then, police said, Sirois fired three or four shots at point blank range, wounding Ean-Dixon in the abdomen.\nEan-Dixon's injuries are serious, but he is expected to make it, according to a Facebook posting by Free State Project Founder Jason Storens.\nEan-Dixon was active in the Free State Project, according to movement leaders.\nThe Saturday morning incident happened in a flap over the use of a porcupine on a yellow \"Don't Tread on Me\" flag. Traditionally, the flag, known as the Gadsden Flag, features a curled snake posed to strike.\nPolice said Sirois believed the porcupine defiled the flag. The porcupine, however, is featured on the home page of the Free State Project website.\nAccording to court documents, one woman told police she heard a group outside on Amory street about 2:20 a.m. arguing about a flag and heard someone say, \"Why would you bring that to my house?\" The argument became physical with Sirois and Gerry pushing Ean-Dixon, and then Gerry and Ean-Dixon having a fist fight.\nKasondra Williams, 20, of Raymond broke up the fight by pulling Gerry away.\nWhile Williams held back Gerry, Sirois and Ean-Dixon continued to fight. Sirois yelled to Gerry, \"I'm about to shoot this kid in seconds,\" according to the sworn affidavit of Detective Lucas A. Hobbs.\nEan-Dixon continued fighting and eventually he fell to the ground. Gerry broke free of William's grip and ran over and \"delivered a hard kick to the facial area of Ean-Dixon,\" Hobbs wrote.\nWitnesses told police Sirois then pulled a gun from his waistline and fired three or four shots at point blank range at Ean-Dixon. Williams yelled out she had been shot and was seen bleeding and limping towards a white BMW. Sirois, Gerry and Williams all got into the BMW and took off, according to witnesses.\nPolice obtained the license plate on the BMW from witnesses and officers stopped it minutes later at Putnam and Dubuque streets. The car had a large amount of blood on the bottom rear passenger's door. Gerry was allegedly driving the car, while a wounded Williams was in the back seat with Sirois, police said.\nInvestigators recovered a black handgun from the rear passenger's seat.\n."}