{"uri": "http://www.unionleader.com/crime/two-found-shot-on-west-side-of-manchester-two-in-custody-20161105", "title": "Two found shot on West Side of Manchester, two in custody", "dct": "Sat, 05 Nov 2016 20:45:00 GMT", "id": "2c6fdf0eef1843f9a1fae192762e512d", "content": "New Hampshire Union Leader\nMANCHESTER — Kristin Geiger was awoken early Saturday morning by three people, two men and a woman, having an argument outside on Amory Street, not far from her apartment building.\n“There was a lot of shouting,” she said. Between the haze of sleep and wakefulness, she said it seemed as though the three argued for as long as 20 minutes. Then came the gunshots.\n“I hit my husband and we both rolled onto the floor,” she said. Geiger said there had to be between five and 10 shots fired. “It sounded like they emptied a clip,” she said.\nPolice said the shooting happened at 2:22 a.m., across from the 134 Amory St. fire station. Jarrod Ean-Dixon, 36, of Concord, was shot several times, police said, and was taken to a hospital.\nAccording to police, Ean-Dixon got into a heated argument with Michael Sirois, 22, of Chester, who was with Jason Gerry, 21, of Sandown and Kasondra Williams, 20, of Raymond.\nSirois, Gerry and Williams left the home after but due to car trouble, the three found themselves back in front of the home where Sirois and Gerry then engaged in a fight with Ean-Dixon.\nPolice said during the fight Sirois shot both Ean-Dixon and Williams.\nSgt. Loui said Sirois was the only one involved who was armed.\nManchester police said the argument was over a flag displayed at the residence that was considered by one of the suspects to be offensive.\nThe flag hanging in a window was the yellow, “Don’t Tread on Me” flag created by American colonial statesman and general Christopher Gadsden during the American Revolution. The Continental Marines and US Navy had adopted wide use of the flag, and more recently the tea party.\nBut the flag that started the Amory fight had a porcupine instead of the iconic rattlesnake.\n“Mr. Sirois felt that was a desecration of the flag. He got very upset about it and the altercation ensued,” said Manchester Police Sgt. Ken Loui.\nWhen police arrived, Geiger’s husband, Steven, went outside to see what was happening. He said workers across the street at Domino’s Pizza told him a woman in a white BMW was changing a tire as two guys on the corner at Cartier and Amory streets “scuffled on the ground.”\nSteven Geiger said he only learned that a woman had been shot and that was through news reports.\n“I presume she didn’t finish changing her tire because there’s one on the sidewalk,” he said, pointing to it.\nYellow crime tape cordoned off the sidewalk in front of closed storefronts at 129 Amory St. A Cornerstone Baptist Church sign is still affixed to the building, although the church has moved to Pinardville.\nLate in the morning, two detectives inventoried and photographed evidence at the scene. Ten yellow markers crowded an area of the sidewalk. Yellow tape also cordoned off an area on the other side of the street, outside the pizza shop at 150 Amory St.\nEan-Dixon was transported to a local hospital and police said the shooting has left him in stable but critical condition.\nAfter police stopped Sirois’ car, Williams was found to have a gunshot wound in the leg, was treated for it at the hospital and has since been released.\n“The shooting of Ms. Williams was apparently as the result of reckless conduct with that firearm,” he said.\nSirois was arrested and has been charged with first-degree assault with a deadly weapon for the shooting of Ean-Dixon and second-degree assault with a deadly weapon for the shooting of Williams. Sirois was being held at Hillsborough County jail on $100,000 bail, and is expected to be arraigned on Monday at 9th Circuit Manchester District Court.\nJason Gerry was also arrested and charged with second-degree assault for his actions during the fight. As the driver of the car, Gerry was also charged with driving while intoxicated, driving without giving proof, and operating after suspension.\nGerry was being held at Hillsborough County jail on $6,000 bail, and he too will be arraigned Monday.\nManchester police stress the public is no longer in danger but asks for anyone with information about this incident to contact the Detective Unit at 792-5500 or 792-5500 or Manchester Police Crimeline at 624-4040.\nMeanwhile in light of this latest violence, the Geigers are looking to leave.\n“All I know is we are looking for a new apartment,” Steven Geiger said.\n."}