{"uri": "http://www.azfamily.com/story/28392513/payson-mom-speaks-after-child-killed-in-gun-accident", "title": "Payson mom speaks after child killed in gun accident", "dct": "Fri, 16 Jan 2015 04:22:00 GMT", "id": "73f7ec7c4a5b5bea184f227857a2d6ba", "content": "PHOENIX -- Jessica Tappan's 18-month-old son, Mathias, died last summer at the hands of his then 2-year-old brother.\n\"It's the most horrific thing a mother could go through,\" Tappan said.\nThe mother and her boys were at a neighbor's house in Payson last May when Uriah found the neighbor's loaded and cocked gun, and accidentally shot Mathias.\n\"I seen him fall to the floor, and I go run and pick him up. And I can still hear the ringing in my ears; that's how close I was,\" Tappan said.\nShe moved to Phoenix after the death, and cannot work due to seizures and a degenerative disease. She lives on food stamps and now has post-traumatic stress disorder.\n\"Major reminders of me screaming when I was at the door of that apartment, blood all over me,\" Tappan said.\nBut there is a certain 3-year-old who keeps Tappan in the present and not the past.\nHer son, Uriah, doesn't understand what happened that day. He knows his brother is in heaven and he needs his mother.\n\"It's been a big struggle trying to stay joyful during this time with my 3-year-old. That's my main concern is to take care of him and wake up every day,\" Tappan said.\nAnd soon, she has to leave the apartment a friend has let her borrow.\n\"We have just been praying just for something to happen. We don't know. We have no idea what's going to happen from now on,\" Tappan said.\nWhile the future is unclear, her mind is set on just one thing.\n\"I just want my son to have a stable life. I don't want him to have to go through any pain that I'm going through,\" Tappan said. \"Thank God he's happy. That's my main goal in life is for him to be in a happy and joyful environment.\"\nTappan also wants to encourage all parents to ask if there is a gun in the house before they let their children into other people's homes.\nShe wishes she had asked if her neighbor had a gun.\nThe Gila County Attorney has not decided whether to file charges in the case. A spokesman for the office said prosecutors are waiting for lab results.\nIf you would like to help Tappan, go to www.gofundme.com/K3IELG.\n---\nPrevious reports said Uriah was 3 when the shooting occurred. Tappan said those reports were incorrect. Uriah was 2 and is now 3.\n---\nRELATED:\nBoy, 3, kills baby while playing with gun"}