{"uri": "http://www.mcalesternews.com/news/area-man-dies-from-gunshot-wound/article_ede91fff-497f-58c7-b0cc-29e06dacc6f4.html", "title": "Area man dies from gunshot wound", "dct": "Tue, 02 Feb 2016 00:00:00 GMT", "id": "1141158a5253664ac22d1e1a2633d799", "content": "An area man has died of what authorities say appears to be a self-inflicted gunshot wound that reportedly occurred while he was drawing and putting a handgun into a holster.\nMichael David Miller II, 35, of Lakeview Drive in rural Pittsburg County, died early Saturday at the McAlester Regional Medical Center, according to sheriff’s reports.\nA witness told sheriff’s deputies that Miller was standing in front of a mirror at his residence, drawing a weapon from a holster and then putting it back in the holster when the witness heard a gunshot. The witness reported that Miller turned and said he had shot himself in the leg, according to reports.\nThe witness and another friend at the residence, who was awakened by the gunshot, reported that Miller said he had accidentally shot himself. After calling 911, they helped Miller to a truck.\nPittsburg County deputies who were traveling down Lakeview Drive on the way to the scene met the vehicle in front of Talawanda Ranch, according to sheriff’s reports. Two people in the back of the truck were holding Miller, who was wrapped in a blanket, the report states. Miller had a wound in the front part of his leg, near the waist line, according to a statement from Deputy Michael Coffman. Deputies Cody Vaughn and Cory Cantrell attempted to find a pulse and began chest compressions on Miller, according to Coffman.\nWhen an ambulance arrived, paramedics began medical treatment. Miller was subsequently transported to McAlester Regional Health Center, where he was later pronounced deceased, according to sherif’s reports.\nPittsburg County Sheriff Joel Kerns said the matter remains under investigation and that his office is awaiting a report from the State Medical Examiner’s office before issuing a final report."}