{"uri": "http://www.ktvb.com/news/local/man-shares-safety-message-after-accidental-shooting/379356267", "title": "Kuna man paralyzed in accidental shooting urges gun safety", "dct": "Wed, 28 Dec 2016 00:00:00 GMT", "id": "1a709ec22fbb2bc5b1af22bceaa42417", "content": "BOISE - A Kuna man is recovering in the hospital after an accidental shooting left him paralyzed. The Ada County Sheriff's Office says on November 18th, 20-year-old Jacob Tewalt was driving around listening to music with his friends. The car came to a stop in a Hubbard and Meridian roads neighborhood. It was during that stop the sheriff's office says a 14-year-old in the seat behind Tewalt had a gun in his lap that accidentally went off.\nThe bullet went through the seat and hit Tewalt in the back. Ever since that day, Tewalt has been in a hospital bed recovering. Doctors says he still has more than a year left before he'll be done with physical therapy. Tewalt says he'll probably never be able to walk again, but he's not letting that dampen his spirits.\n\"It's a bump in the road, but we'll relearn how to do stuff and pretty soon it will just be normal,\" Tewalt said.\nTewalt tells KTVB that November 18th was just a regular night and that he had hung out with those same friends a number of times in the past and never had any issues.\n\"I felt the concussion of it hitting the seat and then once I realized that I couldn't get out of my car or move my legs. I could feel the pain and the burning and the pressure on the left side,\" Tewalt said.\nTewalt was rushed to the hospital where he spent two-and-a-half-hours in surgery and another three days in the intensive care unit. His family was by his side the whole time.\n\"They took 30 percent of his kidney, the end of his small intestine. The bullet stopped right before it went through his large intestine. It did hit his spine,\" Diana Boyll, Jacob's mother, said.\nThe incident left him paralyzed from the waist down. He says one day he may gain some sensation and feeling back in his legs, but doesn't think he'll ever walk again. However, he's not giving up.\n\"Eventually, I would like to try and get a car and get it all set up and stuff so that I can get back to having a semi normal life,\" Tewalt said.\nThe family is doing everything they can to ensure that Jacob does live a normal life. They've already started looking into ways to make their home wheelchair accessible.\n\"At 20 you should be picking out a car, not a wheelchair,\" Boyll said.\nHe and his family say the shooting may have been an accident, but it all could have been prevented with gun safety and education.\n\"The results are very real, and it doesn't just affect the person unfortunately that gets the bullet, it has affected our entire family,\" Boyll said. \"It is a bump in the road, but it's a permanent bump in the road.\"\nA permanent bump that Jacob hopes will be a lesson for others.\n\"Make sure you know what you're doing when you're handling a firearm of any type,\" Tewalt said.\nThe Ada County Sheriff's Office says the 14-year-old boy has been charged with misdemeanor counts of injuring another by careless handling and discharge of a firearm. The sheriff's office added there is no evidence of alcohol or drug use.\nJacob's family has set up a GoFundMe account to help with medical bills and house improvements.\nCopyright 2016 KTVB"}