{"uri": "http://news10.com/2016/01/04/dad-charged-after-son-accidentally-shoots-kills-little-brother/", "title": "Dad charged after son accidentally shoots, kills little brother", "dct": "Mon, 04 Jan 2016 17:08:00 GMT", "id": "8431cad7275a5775d421b8054e1b2c63", "content": "GOODLETTSVILLE, Tenn. (WKRN) – A Goodlettsville father has been indicted on two felonies in the accidental shooting death of his 5-year-old son.\nIt happened on Nov. 21 just before Thanksgiving after the child’s big brother got a hold of the father’s loaded handgun and pulled the trigger.\nThe 5-year-old boy was hit in the head and died at the family’s apartment off Moss Trail.\nTheir father, 31-year-old Robert Turner, is charged with felony criminal negligent homicide and reckless endangerment.\nPolice say it was his semi-automatic handgun with a laser site that was used in the accidental shooting.\nTurner is accused of messing around with the laser, pointing it at the wall so their cat could chase it.\nHe allegedly put the gun down for 30 seconds when his 7-year-old picked it up and accidentally pulled the trigger, killing his little brother.\nNashville self-defense expert Buford Tune told News 2 that a gun is nothing to be played with, laser or no laser.\n“You have a semi-automatic, it has a light trigger, usually a 5 to 5.5-pound trigger any kid can press,” Tune said.\n“Leaving it laying there, I have a big problem with that,” he added.\nTune says education is the key.\n“You can say, ‘Stop! Don’t touch it! Go tell an adult! Get away from it. Don’t pick it up! Don’t touch it; go tell someone!’” he explained.\nTurner is scheduled to be in Davidson County court on Jan 13. for his arraignment.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}