{"uri": "http://wjhl.com/2015/11/23/goodlettsville-tenn-police-say-5-year-old-boy-was-shot-by-older-sibling/", "title": "Goodlettsville, Tenn. police say 5-year-old boy was shot by older sibling", "dct": "Mon, 23 Nov 2015 15:08:00 GMT", "id": "abf45dcd61a9febceaa1fb0ae2971fc9", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nGOODLETTSVILLE, Tenn. (WKRN) – Goodlettsville police have determined that a 5-year-old boy who died over the weekend was shot by an older sibling.\nIt happened at an apartment complex in the 400 block of Moss Trail around 5:30 p.m. Saturday.\nPolice said their investigation revealed the children’s parents were at home at the time of the shooting.\nPrior to the shooting, the dad had been watching television with the two children and was playing with the family’s cat with a laser mounted onto a gun.\nPolice said the man later went into the kitchen and forgot to put the firearm out of the children’s reach.\nThe older child picked up the gun in an effort to get the cat to chase the laser. Police said the child was unfamiliar with how the laser worked and instead pulled the gun’s trigger, firing one shot.\nThe 5-year-old victim was struck and killed.\nThe father stated he kept a weapon nearby for protection.\nThe Davidson County District Attorney’s Office is reviewing the case and will determine if the father will face any charges.\nAdditional information was not released.\nCopyright 2015 WKRN. All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}