{"uri": "http://wtkr.com/2013/08/12/one-dead-three-wounded-in-portsmouth-shooting/", "title": "One dead, four wounded in Portsmouth shooting", "dct": "Mon, 12 Aug 2013 05:57:00 GMT", "id": "eb227462f4b4f59b6194495f85699c4b", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nPortsmouth, Va. - One person is dead and four others are wounded after a shooting in Portsmouth.\nAccording to police the shooting happened in the 1100 block of Mt. Vernon Ave. just before midnight on Sunday, August 11 at the London Oaks apartment complex.\nPolice received 911 calls related to gunshots in the area of 1115 Mt. Vernon Avenue. Additional calls were received related to people suffering from gunshot wounds.\nOfficers and medic units responded to the scene and found an unresponsive man inside one of the apartments.\nAron Turner, age 31, of the 3900 block of Trailwood Court in Chesapeake was pronounced dead at the scene.\nOfficers also found two men in the parking lot adjacent to the building suffering from gunshot wounds. Both men were transported to Sentara Norfolk General Hospital.\nFor several minutes, emergency communications continued to receive calls indicating other people had been shot. Medical staff at Sentara Norfolk General Hospital reported a man had walked into the emergency room area with a gunshot wound.\nMaryview Hospital medical staff reported another man had entered their emergency room, also suffering from a gunshot wound. The victims reported being shot while at 1115 Mt. Vernon Avenue. At this time, the four victims, who survived the shooting, are at Sentara Norfolk General Hospital in serious to guarded condition, police say.\nDetectives discovered all five victims, who range in age from 29 to 34, were visiting the occupants of the apartment, when the suspect(s) entered the front door armed with guns. After firing multiple times in the direction of the victims, the suspect(s) ran away in an unknown direction.\nThis case is still under investigation. Police are asking anyone with information to call the CRIME LINE at 1-888-LOCK-U-UP. You may also text “Portsmouth” plus your tip to 274637 (CRIMES) or go to portsmouthpd.us, click on the CRIMELINE link and enter your tip.\nYour information is anonymous and police do not ask your name. If your information leads to an arrest, you could be eligible for a cash reward up to $1000.\nStay with NewsChannel 3 for updates."}