{"uri": "http://www.wlky.com/news/police-respond-to-report-of-serious-shooting-near-churchill-downs/40164358", "title": "Coroner identifies victims from double homicide", "dct": "Thu, 23 Jun 2016 09:22:00 GMT", "id": "051814a685283cc2b72989f9d242d290", "content": "LOUISVILLE, Ky. —\nFour people were shot in a Louisville apartment Tuesday night. Two died and two others are recovering.\nThe shooting was reported Tuesday night near Taylor Boulevard and Algonquin Parkway.\nMonte Compton and Donte Jefferson were both pronounced dead at the scene from a single gunshot wound.\nFamily members said the victims who died are related.\nThe mother of one of the victims lives just down the street from the shooting scene.\nNeighbors described hearing several gunshots around 10 p.m. Tuesday.\nPolice are still working to track down the shooter and are asking for the public’s help.\nThe shooting was reported at an apartment building in the 2800 block of Rodman Street.\nThis double homicide brings Louisville's 2016 homicide count to 51.\n\"We've been up all night long. We don't know what happened,\" Janice Jefferson Mitchell, aunt of the victim, said.\nMitchell said she rushed to the scene Tuesday when she heard her nephews could be the victims.\n\"When we got down there they said there was two black males in the house that was already dead,\" Mitchell said.\nShe watched as detectives collected evidence -- waiting to find out if her family members were gone.\nA man walking by the apartment Wednesday afternoon said he's known the men since they were kids.\n\"We played on the same playground right there on the park and shot basketball together and pretty much hung out, too,\" the man said.\nHe said he saw one of the men a few weeks ago.\n\"He seemed like there was no trouble. No violence, no trouble, no nothing,\" he said.\nMitchell said she doesn't know what happened behind the door, but she's focused on helping her sister grieve.\n\"I'm trying to hold her because I know what she's going through and that's my sister and I love her. I love her dearly and I'm just trying to keep her calm for right now,\" Mitchell said.\nAccording to detectives, the woman who rented the apartment and another man, both in their 20s, were also shot.\nThey were taken to University Hospital.\nThere is no word on the condition of the two victims who were taken to University Hospital.\nPolice have not said what the motive was or who might have been involved.\nAnyone with information on the case is asked to call police."}