{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-shootings-violence-20161212-story.html", "title": "2 killed, 4 wounded in Chicago over 8 hours Monday", "dct": "Tue, 13 Dec 2016 07:36:00 GMT", "id": "6db0381467fcf91688222df557a06625", "content": "Two people were killed and at least four others were wounded in shootings in Chicago over eight hours Monday, according to police.\nA 49-year-old man was shot in the head around 12:30 p.m. in the 800 block of East 40th Street in Bronzeville, police said.\nOfficers responded to a call of a person down and found him unresponsive with a gunshot wound to the head, police said. He was pronounced dead on the scene.\nHe was identified as Lawerence T. Matchem, of the 4400 block of South LaCrosse Avenue, the Cook County medical examiner's office said. Some public records spell his name as Lawrence Matchem.\nHe was pronounced dead at 12:44 p.m., according to the medical examiner's office. No other details were available.\nEarlier on the Far South Side, 53-year-old Quenten Wright was shot in the head around 11:45 a.m. in the 11400 block of South King Drive in Roseland, according to police. He was taken to Advocate Christ Medical Center in Oak Lawn, where he was pronounced dead at 3:31 p.m., according to the medical examiner's office.\nPublic records indicate Wright was in front of his home when he was killed. No other details were available.\nIn other shootings:\n• In the Englewood neighborhood, a 24-year-old man was in a home in the 7400 block of South Harvard Avenue when he was shot in the leg about 5:50 p.m., according to police. He was taken to Advocate Christ Medical Center, where his condition was stabilized. The gunshot wound was believed to have been accidentally self-inflicted, an official said.\n• An 18-year-old man was shot in the 5400 block of South Honore Street in the Back of the Yards neighborhood just before 4 p.m. The man went to Holy Cross Hospital for treatment with a gunshot wound to the back and was transferred to Mount Sinai Hospital, where his condition was stabilized, according to police. The man told police he was standing on Honore when he heard shots and felt pain.\n• About 3:25 p.m., a 32-year-old man was shot in the 700 block of West 77th Street in the Gresham neighborhood, police said. The man suffered gunshot wounds to the legs and was taken to Advocate Christ Medical Center in serious condition. The man was working when someone approached and fired shots, hitting him, police said. The man has a long criminal history, and police were investigating whether he may have been targeted.\n• Earlier, an 18-year-old man was shot around 10 a.m. near Madison Street and Lavergne Avenue, police said. He went to the 5000 block of West Washington Street and called for medical help. He was taken to Mount Sinai Hospital in good condition with a wound to the left ankle.\nCheck back for updates."}