{"uri": "http://www.pressconnects.com/story/news/public-safety/2016/08/31/jc-shooting-11-year-old-involved-incident/89641790/", "title": "JC SHOOTING: Boy shot in arm, suspects in custody", "dct": "Wed, 31 Aug 2016 00:00:00 GMT", "id": "d6b6b8c393a4be48a176d35671b16438", "content": "Police say an 11-year-old boy was shot in the arm Tuesday night in a Johnson City residence.\nAuthorities have taken into custody and charged two suspects — a 16-year-old male and 17-year-old-male — Johnson City Police said Wednesday. Due to their ages, police have not released their names or any other information about the suspects.\nThe boy's gunshot injury was not life-threatening, according to Johnson City Police Chief Brent Dodge. He was transferred to Upstate Medical Center in Syracuse and released Wednesday morning.\nThe victim and the suspects all knew each other and this was not a random attack, police said.\nThe 16-year-old male was charged with assault in the first degree, a class B felony. He was also charged with criminal possession of a weapon in the second degree, a class C felony. The 17-year-old male was charged with assault in the first degree, a class B felony.\nBoth suspects were arraigned in Johnson City Court and remanded in the Broome County Court.\nPolice were called just before 10:30 p.m. Tuesday to 7 N. Broad St., and investigators determined the shooting took place while the suspect was a guest in the home of the victim, Dodge said.\n\"We're still investigating the motive and exactly how it happened,\" Dodge said of the shooting.\nInvestigators also are looking for the gun used in the incident.\nOn Wednesday morning, the crime scene tape was taken down from around the residence, but neighbors also were seeking answers about the incident.\n\"It was terrible,\" said a visibly shaken Christine Jenny, who has lived in a nearby North Broad Street apartment for about 17 years.\nCrouching on the sidewalk outside 7 N. Broad St. on Wednesday morning, Jenny recalled how the apartment quickly swarmed with police and emergency responders the previous night.\nJenny said she did not hear any gunshots, though she was still awake when the incident happened, but she said the sight of her home turning into a crime scene was disturbing.\n\"It was creepy, because all of these years of being here, I never thought it would happen,\" she said. \"I always see it on TV ... not real life.\"\nThe section of North Broad Street, its sidewalks sporadically littered and lined with apartment buildings bearing crumbly exteriors, already had its share of problems, Jenny said, mimicking the sound of a bombshell explosion.\n\"It used to be quiet, it used to be just parties ... you know, the usual stuff,\" she said. \"But all of a sudden, this (shooting) happened.\"\nReporters Katie Sullivan and Maggie Gilroy contributed to this story."}