{"uri": "http://pittsburgh.cbslocal.com/2013/10/20/homewood-shooting-leaves-2-dead/", "title": "Homewood Shooting Leaves 2 Dead, At Least 4 Injured", "dct": "Sun, 20 Oct 2013 23:50:00 GMT", "id": "14f5216785af02818203c7c3a63b3807", "content": "HOMEWOOD (KDKA) – Police are investigating after two people were shot and killed in Homewood early Sunday morning.\nAccording to the medical examiner’s office, the shooting happened inside a building near the intersection of Kelly Street and North Homewood Avenue around 3 a.m.\nThe victims have been identified as Jasmine Morris, 20, of Penn Hills, and Demetrius Broadnax, 27, of Wilkinsburg.\nOfficers were patrolling the area when they noticed several people running from a private club. Two women approached the officers and stated they had been shot.\nWhile the officers were helping the women, the club’s owner approached them and said there were two other people shot inside.\nThe officers then found Jasmine Morris, 21, of Penn Hills, and Demetrius Broadax, 27, of Wilkinsburg, on the ground and unresponsive. Both were pronounced dead at the scene.\nNumerous shell casings were found at the scene as well.\n“Her friends came to my house and said that Jasmine had been shot,” Morris’ mother, Lisa Briggs, said.\nBriggs rushed to the scene when she heard about her daughter, who had only been in the club for about 15 minutes. At least four others suffered non-life threatening gunshot wounds. So far, no motive was given for the shootings.\nTwo or three other people also went to local hospitals with non-life-threatening gunshot wounds, which are believed to have been suffered at the same club.\n“Six people’s lives, six people’s families have been affected by this one person’s decisions to go in this club and take people’s lives,” Briggs said.\nMorris had three children – two boys and a girl.\n“They don’t have their mother, 21-years old and pretty as a picture,” Briggs said. “Why? But, he’s going to answer to us why and even if we don’t get the answer he will be caught no matter what, even if he doesn’t say a word.”\nPolice are currently looking to see if surveillance footage captured the incident inside the club.\nAnyone with information is asked to call the Pittsburgh Bureau of Police Homicide Unit at (412)-323-7161.\nIf you’d like to donate to the family, you can at any PNC Bank, under the Jasmine Morris Memorial Fund, c/o Lisa Briggs.\nRELATED LINKS"}