{"uri": "http://www.local10.com/news/crime/2-dead-4-wounded-in-shooting-during-vigil-for-teen-killed-in-brownsville", "title": "2 dead, 4 wounded in shooting during vigil for teen killed in Brownsville", "dct": "Sun, 28 Aug 2016 01:40:00 GMT", "id": "3c36e420fb61e19566b6b720341651c8", "content": "MIAMI-DADE, Fla. - A family mourning the loss of a teenager who was shot dead was victimized again. A gunman sprayed bullets killing another beloved teen on Saturday, Miami-Dade police said.\nSix were shot -- 2 killed and 4 wounded -- outside of a home in the 1900 block of Northwest 83rd Terrace in Miami-Dade, Detective Dan Ferrin said.\n\"There was shooting for about two minutes,\" Bianca West said. \"It felt like 20.\"\nThe two killed were 15-year-old Isaiah \"Zay\" Solomon and 22-year-old Tafari \"Fari\" West.\nAmong the four wounded was Pastor Vernon Gillum's 20-year-old daughter Verneisha Gillum. Police said the other victims were two 28-year-old men and a 37-year-old man.\nThey were all at a Friday night vigil to honor the memory of 19-year-old Devonair \"Lil' Deb\" Blake, who died after he suffered 13 gunshot wounds to the back Aug. 19 in Brownsville. He left behind a baby boy.\nWest, Blake's maternal aunt, said one of the wounded was his dad. Isaiah was Blake's cousin. His mom, Sirena Harrell, of Miramar, used Facebook to share her grief.\n\"I lost my baby, my rider, my first heartbeat ... My spirit is empty. I have no more life in me. I don't even know how I'm going to raise my other child,\" she said.\nMiami-Dade police reports receiving the call of the shooting about 12:40 a.m. Miami-Dade Fire Rescue responded and pronounced Isaiah and West dead at the scene.\nParamedics treated a victim and released him, police said. Rescue took Gillum and two others wounded to Jackson Memorial Hospital's Ryder Trauma Center.\nGillum was recovering from surgery. She was shot in the upper shoulder area, according to her dad. All of the injured were in stable condition.\nHours after the shooting at his wake, Blake's family held his service and funeral. During his service at the Mt. Calvary Missionary Baptist Church in Miami's Liberty City, there were pleas for peace.\nCopyright 2016 by WPLG Local10.com - All rights reserved."}