{"uri": "http://www.local10.com/news/crime/families-mourn-2-killed-in-brownsville-shooting", "title": "Families mourn 2 killed in Brownsville shooting", "dct": "Sun, 28 Aug 2016 19:06:00 GMT", "id": "43809cade7e2a8ff3f17d07db0deab71", "content": "MIAMI-DADE COUNTY, Fla. - Isaiah \"Zay\" Solomon, 15, was one of two people fatally wounded during a Saturday morning shooting that took place during a vigil for a slain teenager at Northwest 19th Avenue and Northwest 83rd Terrace.\nTafari \"Fari\" West, 22, also died in the shooting.\nAmong the four wounded was pastor Vernon Gillum's 20-year-old daughter, Verneisha Gillum. Police identified the other victims as Anthony Johnson, 26, Patrick Blake, 40, and Elwood Higgs, 36.\nBianca West said the family members had gathered at a home to mourn another relative, Devonair \"Deb\" Blake, 19, who was shot 13 times in the back on Aug. 19 in Brownsville.\n\"They were shooting for about two minutes. It felt like 20,\" West said. \"(The) only thing I was saying to myself was, 'Let me cover my head,' because if I do get shot, I just don't want to get shot in my head.\"\nSince the shooting, Solomon's mother has taken to social media to comment about her loss.\n\"I lost my baby, my rider, my first heartbeat, who had a special place because he was my first heartbeat. I love/loved him more than every breath in me,\" she wrote on Facebook. \"I would move the world for him if he needed. I would have given my life in order for him to keep living. My spirit is empty. I have no more life in me. I don't even know how I'm going to raise my other child because I have nothing left in me and I have no clue how I'm going to go on. Please save, God won't put anything on me that I can't handle cause I would reply, you are a damn lie. I can't handle this.\"\nShe ends the post with a reminder of how her son was killed.\n\"BTW he was murdered standing a wake,\" she wrote. \"He was innocent.\"\nPolice are investigating the incident. Anyone with information is asked to call Miami-Dade Crime Stoppers at 305-471-TIPS.\nA $13,000 reward is being offered for information leading to an arrest.\nCopyright 2016 by WPLG Local10.com - All rights reserved."}