{"uri": "http://www.kltv.com/story/30263419/arrest-warrant-reveals-new-details-about-fatal-gang-shooting-at-bunnys-truck-stop", "title": "Arrest warrant reveals new details about fatal gang shooting at Bunny's truck stop", "dct": "Wed, 14 Oct 2015 22:47:00 GMT", "id": "ce421d888b4bfecc43a909718ddc042f", "content": "SMITH COUNTY, TX (KLTV) -\nWhen Ladarius Brooks and two friends started to pull into the parking lot of Bunny’s truck stop in Tyler on Aug. 29, they were met by a “big gold Lincoln” blocking their way. Brooks said the driver of the Lincoln refused to move the car, so Brooks got out and yelled to the driver to “get out of the way.”\nThat’s when the driver of the Lincoln got out and pulled a “chopper,” slang for an AR-15, and began shooting into the crowd, according to an arrest warrant related to that night.\nBrooks said he ran for cover when the driver started shooting. Police say more than 70 shots were fired that night, by four people. According to police, the shooting was the result of an earlier altercation between rival gangs at a Tyler club named Flamingo’s.\nREAD MORE: Sheriff: Gangs involved in fatal Tyler truck stop shooting, arrests expected soon\nBrooks and his friends, Kelan Blanton and Seth Bolden, escaped uninjured. Others were not so fortunate.\nLaPrida Deshaun Shears, 25, of Tyler, was killed in the crossfire. Three others were injured. Five people have been arrested so far and charged with crimes related to the incident that night on northeast Loop 323.\nREAD MORE: Identity released in Smith County truck stop homicide\nAt a Sept. 15 press conference in Tyler, Smith County Sheriff Larry Smith said two groups – with ties to Longview and Tyler gangs – were responsible for the shooting. A multi-agency investigation into gang activity in Smith and Gregg counties began.\nArrest warrants and other documents are beginning to reveal what happened the night LaPrida Shears died.\nBrooks, of Longview, had borrowed a car from a friend that night, a tan 2003 Ford Crown Vic. When the shooting ended, the Crown Vic had four bullets embedded in its frame: Two in the grill, one into and through the hood, and one in the driver’s side passenger door. The car wouldn’t make it back to Longview – it was seized by police as evidence.\nPolice also collected video evidence and identified people involved in the shooting. One of those identified in that footage was Phillip Potts Jr., of Tyler. When he was arrested 19 days after the shooting, he was dressed in the same clothing he had on that night in the parking lot of Bunny’s. A black t-shirt, grey-colored jean shorts, and white tennis shoes were collected as evidence, the report says.\nPotts is sitting in Smith County Jail, charged with aggravated assault with a deadly weapon with a $300,000 bond. Potts has refused to make any statement about the Bunny’s incident, according to the arrest warrant.\nPotts arrest came after an ATF agent told Smith County Sheriff’s Office that a man named Phillip Potts had been recently attempting to “get rid of” an AR-15 assault rifle. The agent also said a car was parked in the backyard at a residence on West 24th Street in Tyler – a gold-colored Lincoln, according to an arrest warrant.\nDeputies went to that address, and with permission from the property owner, they collected for evidence a bronze 1994 Lincoln Town Car. The warrant notes that the vehicle had “two clearly-visible bullet holes – one in the front windshield, and the other in the frame of the windshield.”\nThe Lincoln had been parked “as close as possible, against the back of the house where it could not be seen by passerby on 24th street,” according to the warrant. The Lincoln belonged to Potts and had been parked there “a day or two after the Bunny’s shooting,” the warrant states.\nNo one has been charged with the death of Shears, nor has any arrest been confirmed as directly tied to Shears’ death.\nSmith County Sheriff’s Office, the Longview Police Department, Gregg County Sheriff’s Office, and Jacksonville Police Department, with assistance from federal agencies, continue to investigate.\nKNOWN ARRESTS RELATED TO BUNNY’S SHOOTING:\nDeKaylen Daniels, 20, of Longview was arrested Oct. 8 on Fifteenth Street by Longview police and charged with aggravated assault with a deadly weapon. Extradited to Smith County Jail and being held on $300,000 bond.\nD’Mio Antunez Ingram, 24, of Longview arrested on Birdsong Street by Longview police and charged with aggravated assault with a deadly weapon. Remains in the Gregg County Jail on a $300,000 bond.\nPhillip Paul Potts Jr, 32, of Tyler, was arrested on West 24th Street by Smith County Sheriffs deputies and charged with aggravated assault with a deadly weapon and a warrant for possession of a controlled substance. Remains in Smith County Jail on $310,000 in bonds.\nIDENTIFIED BY POLICE AS PERSONS OF INTEREST IN SHOOTING:\nLamond Demarcus Martin, 21, of Longview, as a person of interest in the Bunny’s shooting. Martin was arrested Oct. 7 by Gregg County sheriff’s deputies on warrants for tampering with physical evidence for a September 2014 incident, and warrants for unlawful possession of a firearm, possession of a controlled substance and possession of marijuana related to an April 2015 incident. He remains in the Gregg County Jail.\nTyson D. Dixon, 22, of Longview was also named as a person of interest by Sheriff Smith. Dixon was arrested in the same Fifteenth Street raid that yielded Daniels’ arrest. Dixon was arrested on an outstanding warrant for theft under $50, and bonded out a day later.\nCopyright 2015 KLTV. All rights reserved."}