{"uri": "http://www.indystar.com/story/news/crime/2015/03/24/found-dead-westside-home/70371218/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=FeedBlitzRss&utm_content=4+found+dead+in+Westside+home", "title": "Coroner IDs 4 people slain in Harding Street house", "dct": "Tue, 24 Mar 2015 00:00:00 GMT", "id": "691b3c8b36d7dd5ce6e14dbddd2077e7", "content": "UPDATE: Officials have identified the four Indianapolis residents killed in Tuesday morning's quadruple homicide on the Near Northside.\nThe Marion County Coroner has identified the victims as 18-year-old Davon Whitlock, 32-year-old Tiara Turner, 41-year-old Terri Betties and 48-year-old Sherry Taylor.\nEARLIER: Concerns of violence in an Indianapolis neighborhood were fully realized when four people were found slain Tuesday morning in an unassuming brown home on Harding Street.\nInside, three women and one man each had been shot multiple times, police said. The home was ransacked.\nHours later investigators were still working to identify possible suspects and determine a motive.\nAs the time passed, anxieties grew.\n\"It's very troubling. I said to some people earlier that I am beyond just being upset about this,\" said the Rev. Charles Harrison, leader of the Ten Point Coalition. \"We just cannot tolerate this kind of violence and madness in our city.\n\"I think people in these neighborhoods have to start being outraged.\"\nThe owner of the home in the 3100 block of North Harding Street, near West 30th Street and the Central Canal, called police around 9:45 a.m. after she discovered the four victims, Indianapolis Metropolitan Police Department officer Chris Wilburn said.\nTelevisions were toppled over in the \"ransacked\" home, Wilburn said. He said there were signs the suspect or suspects forced their way in.\nInvestigators said each victim was shot multiple times, but they would not say where the four were hit.\n\"There were a significant amount of shots,\" Wilburn said.\nPolice did not immediately say who the victims are or how they are connected to the homeowner who found them.\nCharles Richardson said his sister, Carmon Lisenby, was the person who discovered the victims. He said he was called to his sister's house Tuesday morning, unsure of what he would find.\nPolice allowed him to cross the crime scene tape to be with his sister, who he said was distraught.\n\"I comforted her,\" Richardson said.\nBut she couldn't elaborate on what she saw, he said.\nRichardson said his sister went with detectives to police headquarters to give a statement shortly after police came to the home.\nLike the rest of the group, Richardson said he was waiting to learn who the victims were. His family feared the victims may be their family members, as some stayed in his sister's home.\n\"We are praying,\" he said.\nA crowd of neighbors who gathered in the morning stayed late into the afternoon, waiting for information about the victims and the crime.\nMany cried and appeared anguished. Some spoke in loud, angry tones. One woman vomited.\n\"Please bear with us,\" IMPD Police Chief Rick Hite told the anxious group at one point.\nOver time, as more people came to stand outside the police tape marking the crime scene, community members began to lean on one another. Strangers who had been neighbors for years were being formally introduced.\nAbout 2 p.m. one man who lives in a home near the corner of Harding Street and Congress Avenue stepped onto his front lawn holding a fresh pot of coffee. He offered cups of warmth to anyone who needed it.\nWilliam Alexander, an associate pastor at House of Joy at 3620 E. 38th St., said he came to offer support to those unnerved by the shooting.\nHe added that coming together as a community is the only way to endure such tragedy.\n\"I was shocked because this is where I used to live, and I know they were trying to make a positive change in this area,\" he said. \"It's sad, it's heartbreaking and my prayers go out to all the families.\"\nThe neighborhood is near one of six focus areas highlighted by IMPD last year for extra attention because of their disproportionate amount of violent crime.\nMichael Coleman, a resident of the neighborhood, said the street appeared normal that morning until police rushed to the area.\nHe said he was rattled by the police activity.\n\"I'm trying to get out of here in the next month,\" Coleman said.\nOther neighbors echoed his sentiment.\nStanley Brown, a 59-year-old lifelong Indianapolis resident, said he recently invested in vacant lots nearby, hoping it would pay off if the neighborhood becomes targeted for redevelopment.\nBut he is now wondering if that investment was a mistake.\n\"I don't know if I should try to hold onto it or sell it,\" Brown said.\nOn Saturday less than a half-mile away, a man shot and killed his brother in the 2900 block of East Riverside Drive. The shooter said he believed his brother was an intruder.\nHarrison said the members of his coalition, a faith-based group that works the streets to curb violence, have noted how \"hot\" the area has been recently.\nAgain he said that outrage would prompt action.\n\"If we say black lives matter, that has to be for everyone. We can't just be upset when a black person is killed by a police officer or a white male. We have to be equally outraged when blacks are killing blacks,\" he said. \"I think you're going to see us do something to mobilize this whole area within the next four or five days. We've got to respond to this as a community.\"\nInvestigators are asking anyone with information about the shootings to call Crime Stoppers of Central Indiana at 317-262-TIPS. Callers may also text \"INDYCS\" plus tip information to 274637, or CRIMES.\nCall Star reporter Madeline Buckley at (317) 444-6083. Follow her on Twitter: @mabuckley88."}