{"uri": "http://www.nola.com/crime/index.ssf/2015/09/mothers_day_shooting_suspects_4.html", "title": "Mother's Day shooting gunmen plead guilty to federal charges", "dct": "Wed, 09 Sep 2015 22:50:22 GMT", "id": "146e1619ca01538d918ee403cff322a0", "content": "Two men who opened fire during a 7th Ward Mother's Day parade in 2013, leaving 20 people injured, pleaded guilty to federal charges Wednesday (Sept. 9).\nBrothers Akein \"Keemy\" Scott and Shawn \"Shizzle\" Scott entered guilty pleas to racketeering and conspiracy charges, as well as counts related to a total of five shootings they committed as members of \"FnD,\" a street gang that took its name from the intersection of the Frenchmen and Derbigny streets.\nThe Mother's Day shooting, in which 19 people were struck by gunshots as the Scott brothers fired at a rival gang member, was one of five shootings committed by FnD members.\nThe brothers entered their pleas standing alongside a third brother, 23-year-old Stanley \"Stizzle\" Scott, in U.S. District Judge Ivan Lemelle's courtroom. Each of the three face 20 years to life in prison when they are sentenced in January.\nTheir joint plea deals with prosecutors do not require them to testify against the lone FnD member still facing trial, their older brother, Travis \"Trap\" Scott, Assistant U.S. Attorney Matthew Payne said. Travis Scott is set to go to trial next month as the alleged leader of FnD.\nNew Orleans Police say Akein Scott, 22, and Shawn Scott, 26, took up positions on opposite sides of Frenchmen Street as the May 12, 2013 parade passed near North Villere Street, and opened fire at a rival gang member, identified in court records by the initials \"J.T.\"\nThe melee was retaliation for a prior shooting that wounded Stanley Scott by members of the Prieur and Columbus Boys, a rival gang also known as \"PCB,\" police said.\nNineteen bystanders were wounded, including J.T., who was struck five times, according to court records filed along with Akein, Stanley and Shawn Scott's guilty pleas. Another person was trampled as panicked parade-goers fled the shooting.\nProsecutors allege FnD members trafficked heroin and crack cocaine in the 7th Ward dating back to 2006. Nine FnD members, most of them members of the Scott family, were charged in a federal indictment in 2014.\nSurveillance video showed the densely packed crowd along the parade route scattering amid the gunshots, images that shocked even city residents accustomed to occasional outbreaks of violence along parade routes.\nAmong the those struck by bullets were two 10-year-old children, who suffered graze wounds. The shooter shown in the video, according to court records, was then 20-year-old Akein Scott.\nIn the weeks that followed, organizers hosted a \"do over\" of the parade and multiple fundraisers were held for the injured even as police conducted a manhunt for the shooting suspects.\nIn court records, FnD members who have pleaded guilty have admitted to selling drugs over a territory bounded by Elysian Fields Avenue, North Johnson, Interstate 10, St. Anthony Street and North Claiborne Avenue.\nThe center of the gang's operation was the Frenchmen Meat Market, where workers would hold guns behind the counter for FnD members, and would let patrons swap food stamps for cash that they then handed over to FnD members for heroin or crack.\nSurveillance video from the store's own cameras was noted as evidence prosecutors intended to use at trial, with footage showing FnD members making numerous drug deals inside the store.\nTravis Scott often carried an AK-47 rifle he called \"monkey nuts,\" a reference to the massive drum magazine that could hold 100 rounds, according to court records.\nAkein Scott, now 22, sold drugs at the store several days a week, mostly in the afternoon after returning from school, one unnamed witness said in court records. As one of the younger members of the gang, Akein often was told to hang onto firearms for older gang members, because as a juvenile, he would face less serious penalties from authorities if he was caught with the weapons.\nIn court records, Akein Scott admitted to pulling the trigger himself in four shootings during the year before the 2013 Mother's Day parade, joining Shawn and Stanley Scott in a shootout in front of the Frenchmen Meat Market in which a 14-year-old girl riding in a passing vehicle was shot in the leg.\nOn Mother's Day 2013, Akein Scott is seen on surveillance video as the second-line parade moves down the block, stepping out from the side of a building with a pistol raised and firing into the terrified marchers, according to court records.\nWhen asked about his background by Judge Lemelle on Wednesday, Akein Scott was the only one of the brothers to have completed high school, stating that he attended college in \"Talladega\" and studied business administration. His lawyer, Julie Tizzard, said Akein Scott had been enrolled in college when he was arrested in 2014.\nStay with NOLA.com for more on this developing story."}