{"uri": "http://www.wdsu.com/news/local-news/new-orleans/nopd-seeks-mothers-day-shooting-suspect-seen-in-surveillance-video/20120216", "title": "NOPD seeks Mother's Day shooting suspect seen in surveillance video", "dct": "Mon, 13 May 2013 23:16:00 GMT", "id": "3d9c71321db8e27892fd12d427976e50", "content": "NEW ORLEANS —\nNew Orleans police have a clearer picture -- literally -- of who they are looking for in connection with the shooting that wounded 19 people at a Mother's Day second line in the Seventh Ward.\nThe New Orleans Police Department released surveillance video of the shooting early Monday morning. It shows a man approaching a large crowd and firing numerous shots, then leaving the scene.\nMayor Mitch Landrieu has called for witnesses to step forward and help solve what has become one of the worst shootings in years in the city of New Orleans.\nMany of the wounded remained hospitalized on Monday -- some recovering from serious injuries.\nThe gunman -- or gunmen -- opened fire on a second line taking place in the 7th Ward on Mother's Day afternoon. The toll increased steadily throughout the day, with initial reports of \"several\" injuries, then a dozen.\nThe victims include 10 adult men, 7 adult women, a 10-year-old girl and a 10-year-old boy, police said. At least four people were in surgery mid-afternoon and patients had been taken to four area hospitals.\nRemarkably, no one was expected to die from their injuries.\nNew Orleans Police Department Superintendent Ronal Serpas said one of the shooters appeared to be a dark-skinned man, 18-22 years old, with short hair and wearing a white shirt and blue jean shorts. The person seen on the surveillance video fit that description.\n\"These kinds of incidents are not going to go unanswered,\" Landrieu said Sunday evening at an impromptu news conference at LSU Interim Hospital. \"We're going to be very aggressive. There were hundreds of people out there today, so somebody knows who did this and the way we're going to stop the violence together in the city is for everybody to come together, and we really need help.\"\nThe group which organized the parade, The Original Big 7 Social Aid and Pleasure Club, released a statement Monday on its Facebook page.\nThe group expressed its gratitude and thanks to all those who expressed support, love and concern following the shooting.\n“We are praying for all the families affected by this senseless violence yesterday,” the release said.\nThe release called the crime an outrage to what the second lining culture represents.\n\"Second lining is about community and celebration, not trauma and violence,” said the statement. “Yesterday’s shooting was in no way a product of second line culture or somehow set in motion by the parade or its route, as some critics may suggest. Our parade brings together different folks from across the city – black, white, Latino, the young and the old, and lots of families – to celebrate the best of New Orleans. We feel embarrassed that the world is now viewing our city and our community through a lens of violence. We support a thorough investigation of the shooting and pray the perpetrators will be brought to justice.”\nLandrieu has called the entire community to participate in a Community Response at the site of Sunday's shooting, Frenchmen and N. Villere streets. Everyone is invited.\nFederal investigators told CNN they have no indication that the shooting was an act of terrorism.\nAnyone with information is asked to call Crimestoppers at 504-822-1111. The reward for information in the case stands at $10,000.\nPrevious story\nRelated:\nSign up for our email newsletters to get breaking news right in your inbox. Click here from your desktop computer to sign up; on our mobile website, use the drop down to the right to \"Get Email Alerts.\""}