{"uri": "http://usnews.nbcnews.com/_news/2013/05/12/18213691-at-least-19-injured-in-new-orleans-mothers-day-shooting?lite", "title": "At least 19 injured in New Orleans Mother's Day shooting", "dct": "Mon, 13 May 2013 07:26:00 GMT", "id": "85ba3a7ad0bcd6ef4730e8720175f78d", "content": "Gunfire erupted at a parade to celebrate Mother's Day, injuring 19, including two 10-year-old kids. Police are searching for three people seen running from the scene. NBC's Gabe Gutierrez reports.\nAt least 19 people were injured on Sunday when multiple gunmen opened fire on a Mother’s Day parade in New Orleans, police said.\nA 10-year-old boy and 10-year-old girl were grazed by bullets but were in good condition, New Orleans Police spokesman Garry Flot said in a statement. A woman and a man were in surgery Sunday evening, but there were no fatalities and most wounds were not life threatening, police said.\nAt least three people were spotted running away from the scene after the shooting on North Villere Street in the 7th Ward neighborhood at 1:45 p.m. At least one suspect was described as a man between the ages of 18 and 22.\nNew Orleans Police Superintendent Ronal Serpas said there may have been as many as three shooters, and that two different types of weapons were likely used.\nThe victims were marching in what is known as a second line parade, which are common in New Orleans: A brass band plays while marching in the streets, while a “second line” of people follows the band, celebrating.\nOfficials said the parade was two blocks long and included about 400 people. The crime scene was about 1.5 miles from the heart of the French Quarter and near the Treme neighborhood, which has been the centerpiece for the HBO TV series \"Treme.\"\n“These are unusual circumstances. We have second lines which occur in the city of New Orleans virtually every weekend at this time of the year,” Serpas said. “We had a full complement of police officers. It appears that these two or three people just for a reason unknown to us, started shooting at towards, or in the crowd. It was over in just a couple seconds.”\nBystanders comfort a shooting victim after gunfire injured 19 people during a Mother's Day in New Orleans on Sunday.\nMayor Mitch Landrieu said the shooting was part of \"the relentless drum beat of violence\" on the streets of New Orleans.\n\"It’s a shame and its got to stop,\" he told The Times-Picayune from outside New Orleans' Interim LSU Public Hospital. \"You see it cascading across the country but we have more of it than anyone else.\"\nDetectives were conducting interviews and retrieving surveillance video from around the scene. Landrieu urged anyone with information about the shooting to come forward.\nHe added: \"These kinds of incidents will not go unanswered. Somebody knows something. The way to stop this violence is for you all to help.\"\nSecond lines have been targets for violence in New Orleans in recent years. In the past, shooters have targeted a specific person in the crowd, which authorities say may have been the case Sunday as well. But Landrieu dismissed the notion of outlawing the Louisiana tradition.\n“It’s not the second line that did the shooting,” he said. “The cultural events are very important to us, it’s like calling for an end to Mardi Gras because someone takes an opportunity to shoot someone during one of our parades.”\n“Second lines have been with us for a long, long time,” Landrieu added. “They are an important part of our culture and our heritage.”\nMary Beth Romig, a spokeswoman for the FBI in New Orleans, told The Associated Press that federal investigators have no indication that the shooting was an act of terrorism.\n\"It's strictly an act of street violence in New Orleans,\" she said.\nThe Associated Press contributed to this report.\nPopular Discussions"}