{"uri": "http://www.upi.com/Top_News/US/2013/05/12/About-19-wounded-in-New-Orleans-Mothers-Day-parade-shooting/UPI-65901368404258/", "title": "About 19 wounded in New Orleans Mother's Day parade shooting", "dct": "Sun, 12 May 2013 20:17:00 GMT", "id": "f7718c9dc2b0a824547d6fe9fbc9c322", "content": "NEW ORLEANS, May 12 (UPI) -- Gunfire erupted during New Orleans' Mother's Day second-line parade, leaving about 19 people wounded, police said.\nCity police Superintendent Ronald Serpas said the shooting broke out about 2 p.m. on Frenchmen Street, The (New Orleans) Times-Picayune reported.\nThe victims included a girl, about 9 or 10 years old, who appeared to be in stable condition after reportedly being grazed on her side by a bullet, police spokeswoman Remi Braden told the newspaper.\n\"In fact, many of the victims were grazed, some by bullets that ricocheted,\" Braden said in an email. \"At this point, there are no fatalities, and most of the wounds are not life-threatening.\n\"But all medical conditions are not known at this time as victims were rushed to nearby hospitals.\n\"Detectives are conducting interviews, retrieving any surveillance video in the area and, of course, collecting all evidence. This is an extremely unusual occurrence, and we're confident that we will make swift arrests.\"\nShannon Roberts, 32, said she was at a hospital, waiting for word about her 21-year-old nephew, who was shot in the arm and stomach, a 37-year-old niece shot in the arm and a 39-year-old cousin hit in the back.\n\"All innocent bystanders got hit,\" Roberts said. \"When I got the call saying they were shot, I wasn't thinking at all, I was just shivering and crying ... just hoping they be alright.\"\nShe called on the shooters to \"turn they self in.\"\n\"The city need to stop the violence. It's hurting our families,\" she said.\n\"Mothers should not have to be crying any day no less Mother Day.\"\nSerpas said there were about 300 to 400 people participating in the Mother's Day second line brass band parade.\nHe said the victims included three or four people who were in surgery, but he did not know their conditions.\nSerpas said three people were seen running from the shooting scene.\n\"We can tell you without a doubt that we will find these guys,\" he said. \"We will bring them into custody and make them pay for the crimes they committed today.\"\nNOPD investigates shooting at mother's day second line on Elysian Fields and Villere. Multiple people shot twitter.com/MHernandezWWL/…\n— Monica Hernandez (@MHernandezWWL) May 12, 2013"}