{"uri": "http://www.delawareonline.com/story/news/crime/2016/11/28/person-injured-wilmington-shooting/94535584/", "title": "Teen shot Monday in Wilmington; 1 in 5 victims are youth", "dct": "Mon, 28 Nov 2016 00:00:00 GMT", "id": "a7984693ac6772df86356696f3eb951d", "content": "Damian Giletto/The News Journal\nA 15-year-old boy flagged down a passing school bus after he was shot in the arm and stomach early Monday morning in Wilmington, according to city police.\nHe was identified as a ninth-grader at John Dickinson High School on Milltown Road in Milltown, according to Red Clay Consolidated School District spokeswoman Pati Nash.\nWilmington has seen a sharp increase from last year in the number of juveniles shot – one in every five shooting victims has been under the age of 18 this year.\nOf the 137 shooting victims Wilmington saw at this time last year, 17 were juveniles – about 12 percent. So far this year, there have been 139 people shot in Delaware's largest city, and 30 of those victims have been children. That's just over 21 percent.\nThe number of children shot so far this year is already 10 more than the total number of juveniles shot in 2015, according to The News Journal's shooting database.\nRev. Derrick \"Pastor D\" Johnson, director of Wilmington's Gang and Violence Focus Program, said the spike should be a wake-up call of how little has been done to address youth violence, even with such things as teaching young people about conflict resolution.\n\"There is something missing in what we are attempting to get across to them,\" Johnson said. \"We're not teaching them conflict resolution skills. We're not.\"\nJohnson said there are realities that inner-city youth face daily, such as what to do after arguing with a gang associate or feeling indebted to someone\n\"These are some of the realities of their lives,\" he said.\nOn Monday, Officers were called about 6:50 a.m. to the area of West 27th and North Van Buren streets for a report of shots fired, said Sgt. Andrea Janvier, a spokeswoman with the Wilmington Police Department.\nThe boy got the attention of a passing school bus and let them know he was shot, she said. Police found him at the scene with apparent gunshot wounds to his left arm and stomach, Janvier said.\nHe was treated at the scene by New Castle County Paramedics before he was transported to Nemours Alfred I. duPont Hospital for Children, where he was considered stable, Janvier said.\nNo suspect information was available from police Monday morning, she said.\nNash said counselors will be made available to students at the high school Monday following the shooting. Further details on the boy were not released.\nAnyone with information should call Detective A. Ford at (302) 576-3606.\nContact Brittany Horn at (302) 324-2771 or bhorn@delawareonline.com. Follow her on Twitter at @brittanyhorn."}