{"uri": "http://www.battlecreekenquirer.com/story/news/local/2016/10/26/stolen-items-found-after-shooting/92778662/", "title": "Stolen items found after shooting", "dct": "Wed, 26 Oct 2016 00:00:00 GMT", "id": "7ef44e6a06c09776106ecc442ea26d71", "content": "A Pennfield Township man, who shot himself, and his wife face possible charges as police attempt to return thousands of dollars worth of stolen property found Tuesday.\nWarrants are likely for possession of stolen property for the man, 45, and charges could be brought against his wife, 37, as the investigation continues, Detective Bryan Gandy of the Calhoun County Sheriff Department said Wednesday.\nGandy said property worth $75,000 or more was found at the couple’s home in the 22000 block of East Avenue North in Pennfield Township.\nDeputies went there at 7:15 a.m. Tuesday to investigate a reported shooting, according to Sgt. Chris Bacik.\nGandy said deputies found the man in the driveway of the home with a gunshot wound to his left leg. Both he and his wife said the man accidentally shot himself with a handgun police retrieved at the scene.\nThe man was taken to Bronson Battle Creek for treatment of the injury and Gandy said he doesn’t expect any charges stemming from the shooting.\nGandy said as deputies conducted their investigation of the shooting they found several items on the property that were stolen.\nHe said deputies first found a car-hauler trailer attached to the couple’s SUV and found it had been taken early Tuesday morning in Schoolcraft. Deputies found items in the garage and yard of the home including another stolen car-hauler taken in Tennessee, a mower and off-road John Deere Gator taken from Hastings, a motorcycle reported stolen in Kalamazoo and several other mowers, chainsaws, and power tools.\nMost of the items that have been identified were taken from businesses and homes outside the Battle Creek area beginning in August, he said.\nGandy said it appears the man was using the items at the home. Officers are not sure whether other stolen items were sold.\nThe couple are from the Battle Creek area but lived in Tennessee for a while before moving back to the area in October and renting the home on East Avenue.\nThe sheriff department is working with other departments that have reports of the thefts. In some cases police had video of the thief, but had not been able to identify him. The man, and perhaps his wife, could face charges connected to the thefts in other jurisdictions.\nDeputies also found materials to make methamphetamine at the home.\nContact Trace Christenson at 269-966-0685 or tchrist@battlecreekenquirer.com. Follow him on Twitter: @TSChristenson"}