{"uri": "http://www.wmcactionnews5.com/story/33583039/multiple-people-shot-at-least-1-dead-in-shooting-at-zodiac-park", "title": "Teenager killed, 2 injured in Zodiac Park shooting were Horn Lake High School students", "dct": "Wed, 02 Nov 2016 01:43:00 GMT", "id": "164194948b555a2cace6bef0dfe27a94", "content": "MEMPHIS, TN (WMC) -\nA 16-year-old girl is dead and multiple others injured in Zodiac park, near the intersection of East Holmes Road and Tchulahoma Road. This is right on the Tennessee and Mississippi state line.\nMemphis police said the shooting happened at approximately 8:15 p.m. Six people came up to the victims and opened fire. The shooters were reported to have their faces covered with bandannas. According to police, the shooting happened as the result of an ongoing disagreement over a cellphone.\nPolice said five women and one man were injured in the shooting. A 16-year-old girl was killed.\nA 16-year-old girl, a 21-year-old girl, a 17-year-old girl, an 18-year-old girl, and an 18-year-old boy were all taken to the hospital in critical condition. The 16-year-old, 21-year-old, and 18-year-old girl were later downgraded to non-critical condition.\nThe 17-year-old girl and 18-year-old boy are both still in critical condition.\nAll of the victims are from Mississippi, according to Memphis Police Department.\nDeSoto County Schools released a statement Wednesday morning. They said the 16-year-old and two others who were injured were Horn Lake High School students.\nWe are deeply saddened to learn of the tragic loss of a Horn Lake High School student in this off-campus incident in Memphis.\nShe was a good student who was highly regarded by her teachers. Our thoughts and prayers are with her family, the students and staff at Horn Lake High School, and our community. School counselors are available to students daily; however, additional support staff are at the school today to assist students and staff.\nOur thoughts and prayers are also with the two students who were injured in this incident, and we hope for a full recovery.\nA neighbor said they heard at least 17 shots fired.\nExclusive Chopper 5 video shows two of the victims taken by ambulance to Regional Medical Center in critical condition.\nThe park is located right next to a neighborhood. One neighbor was walking his dog when he heard the shots and said he immediately called 911.\n\"It was kind of startling because usually it's peaceful and I walk my dog in the evening and I don't run into problems like this, so it was disheartening to see a nice park where people can't enjoy themselves,\" the neighbor said.\nPolice said the suspects left the scene in a tan car.\nNo arrests have been made at this time.\nAccording to police data, there have been approximately 20 incidents near the part in the last month. Many of the crimes were simple assault or vandalism.\nCopyright 2016 WMC Action News 5. All rights reserved."}