{"uri": "http://www.fox13memphis.com/top-stories/16-year-old-girl-dead-5-others-injured-in-zodiac-park-shooting/462937247", "title": "Ages of victims released in shooting that left teen girl dead and 5 injured", "dct": "Wed, 02 Nov 2016 12:43:00 GMT", "id": "e7a33ead7666f8d373a437120313337e", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nMemphis police have now released the ages of all of the victims from a shooting that left a 16-year-old girl dead Tuesday night.\nPolice said the teen was killed and five others were injured after a shooting in the 5200 block of Zodiac, in Zodiac Park near the Mississippi state line.\nPolice said six suspects came up to the victims and started shooting.\nMPD said the suspects' faces were covered with bandanas.\nSources told us the bandanas were red, but police have not said whether they think there is any gang involvement.\nThe teenage girl was pronounced dead at the scene.\nPolice said three people, a 16-year-old girl, 18-year-old boy, and a 21-year-old woman, were taken to Regional One in critical condition, but their conditions have been downgraded to non-critical.\nA fourth victim, an 18-year-old girl, was taken by private vehicle to Baptist DeSoto, but was transferred to Regional One. No condition information is available on that victim.\nA fifth victim, a 17-year-old girl, was taken to Le Bonheur by a private vehicle and is listed as critical.\nFriends of the victims told FOX13's Zach Crenshaw most of the teenagers out at the park were from Horn Lake High School and gathered at Zodiac Park for a fight.\nPolice told FOX13 all of the victims were from Mississippi, and the shooting may have stemmed from a disagreement over a cell phone.\nThe principal of Horn Lake High School came to Regional One Medical Center to console families and students.\nWednesday morning, the DeSoto County School district released a statement saying, “\"We are deeply saddened to learn of the tragic loss of a Horn Lake High School student in this off-campus incident in Memphis. She was a good student who was highly regarded by her teachers. Our thoughts and prayers are with her family, the students and staff at Horn Lake High School, and our community. School counselors are available to students daily; however, additional support staff are at the school today to assist students and staff.\"\nThe suspects fled in a tan, 2-door vehicle. No arrests have been made.\n#BREAKING: 5 PEOPLE SHOT Zodiac Park at Holmes near Tchulahoma #Fox13News pic.twitter.com/yo8aQSeIzp\n— Mearl Purvis (@Mearlonfox13) November 2, 2016\nIf you have any information, call CrimeStoppers at 528-CASH.\n© 2017 Cox Media Group."}