{"uri": "http://www.click2houston.com/news/multiple-people-injured-in-officer-involved-shooting", "title": "Mother called family meeting before fatally shooting 2 daughters", "dct": "Fri, 24 Jun 2016 17:37:00 GMT", "id": "447dec0a6705b778562be438d9938254", "content": "FORT BEND COUNTY, Texas - New details have been released in a family violence case in which a mother killed her two daughters on a neighborhood street before being fatally shot by an officer in Katy.\nFort Bend County Sheriff's Office investigators said Christy Sheats, 42, shot and killed her two daughters, Taylor Sheats, 22, and Madison Sheats, 17.\nOver the weekend, a member of the Sheats family, living in Alabama, wrote on Facebook that Taylor Sheats was to be married Monday in a small ceremony.\n\"They were to be married Monday. And later again after graduation from college with a big wedding,\" Ann Sheats Wooten wrote.\nIt is unclear whether the fateful family meeting called by Christy Sheats on Friday was to discuss the pending wedding.\nAccording to officials, Christy Sheats had arranged a meeting with the family Friday at their home in the 6000 block of Remson Hollow Lane near Blanchard Grove Drive. When her daughters and husband, Jason Sheats, gathered in the living room, investigators said the mother pulled out a five-shot, .38-caliber handgun and shot the two women.\nOfficers said the daughters and their father managed to run out of the house, using the front door. Investigators said Madison Sheats collapsed and died, while Jason Sheats ran to the end of the cul-de-sac.\n“We heard the dad say, 'Don't do this. They're our kids,'” neighbor Fazz Zainuddin said.\nChristy Sheats chased Taylor Sheats down the street, shooting her again, deputies said. According to a witness, the mother then went back inside the house and reloaded her gun. When she returned, a witness said Christy Sheats shot Taylor Sheats again.\nWhen a Fort Bend County deputy and Fulshear Police Department officer arrived at the home around 5 p.m., investigators said Christy Sheats was still holding a gun. Her daughters were lying in the street nearby.\n“The cops were behind the trees and behind the cars, and they told the mom to put the gun down and, obviously, she did not,” Zainuddin said.\nWith one shot, the Fulshear police officer killed Christy Sheats, Fort Bend County Sheriff Troy Nehls said.\nWhether the purpose of the family meeting had been to discuss the wedding isn't clear yet, but it appears Christy Sheats had issues.\nChristy Sheats' former employer, John Hollis, who owns a tattoo removal business in west Houston, characterized her as a sometimes troubled person and an erratic employee.\n\"She had that very sweet, southern, Alabama look and sound with that accent, but whenever they (customers) weren't here, it wasn't always like that. She was different,\" Hollis said.\nHollis said that he had tried to contact Sheats by phone to remove erroneous information she posted to her \"LinkedIn\" account regarding her role with the company and her time at the company.\nHollis eventually fired her, he said Monday.\n\"I think she was a lady who was going through a very difficult and traumatic time with whatever was going on at home,\" Hollis said.\nAccording to the Fort Bend County Sheriff's Office, deputies have responded to 14 calls for service at the home since January 2012. Investigators said some were alarm issues but, due to legal constraints, the office cannot release details regarding the calls at this time.\n“This is sad, knowing a good family and this is what happened,” Zainuddin said.\nInvestigators said one daughter died at the scene and the other was flown to a hospital, where she later passed away. Their father wasn’t injured but was still taken to the hospital.\n“He was going through a very difficult time,” Nehls said.\nNeighbors said the parents may have been having marital problems.\nAccording to Facebook, Taylor Sheats attended Lone Star College and loved to draw.\nMadison Sheats was a student at Seven Lakes High School. She once wrote on her Facebook wall, “Moms and dads are a promise from God that you will have a friend forever.”\nInvestigators and neighbors are still trying to piece together what started this tragic incident.\n“The mother was nice. You wouldn't expect it if they told you this is what was going to happen,” one neighbor said. “I don't think anybody, at least a sane person, would do that.”\nCopyright 2016 by KPRC Click2Houston - All rights reserved."}