{"uri": "http://theadvocate.com/news/neworleans/13833714-148/high-profile-harvey-hustlers-trial-underway", "title": "High-profile Harvey Hustlers trial underway in Gretna", "dct": "Mon, 02 Nov 2015 09:40:00 GMT", "id": "bc8d57d68a9d5c36c86c9eec7dfd9f7f", "content": "Jurors heard opening statements Thursday in the trial of two West Bank men, one of whom prosecutors say was the leader of the Harvey Hustlers street gang and the other a key player in its drug distribution network.\nThe racketeering case, which included indictments of 39 people in state and federal courts on drug and weapons charges, is linked to seven murders. It got underway with jury selection earlier this week in 24th Judicial District Court in Gretna.\nProsecutors say gang members brought huge quantities of cocaine from Houston to the Scottsdale area of Harvey for the better part of a decade.\nJefferson Parish Assistant District Attorney Doug Freese told jurors that testimony will show Robert “Little Rob” Williams, the alleged leader of the Harvey Hustlers gang, took part in a cocaine deal with co-defendant Alcus “Bug” Smith at a Manhattan Boulevard daiquiri shop in 2013 and orchestrated a botched hit on a rival gang member that left two women and three children shot in their home, among other charges.\nIn addition to the drug deal he is accused of conducting with Williams, Smith is alleged to have taken part in the killing of Donte Hall, who was gunned down by three assailants in a Marrero neighborhood in November 2013. Prosecutors say Smith wanted Hall killed because he suspected Hall had set him up in a previous drug deal that went wrong.\nMany of the witnesses expected to testify have pleaded guilty in state and federal courts to racketeering and other charges, and Williams’ and Smith’s attorneys told jurors their clients are being set up by men trying to pin the blame on anyone but themselves.\n“Most of these individuals will have a reason not to tell the truth,” said Eddie Jordan Jr., who represents Williams. “They are looking for a break; they are looking for a deal.”\nJordan told jurors they will not be able to find Williams was the leader of a crime syndicate because investigators found no money and no real estate, two things that typically define a drug kingpin.\nMatthew Goetz, who represents Smith, said his client isn’t a member of the Harvey Hustlers, never got out of his car at the daiquiri shop the day of the alleged drug deal and is not even accused of possessing drugs anywhere in Jefferson Parish.\nHe said there is no evidence Smith had a beef with Hall, and the witness who will testify about Hall’s murder was a suspect who concocted a story to save himself.\nProsecutors say Smith ran a separate enterprise, with associates in Dallas and Houston, that effectively merged with the Hustlers as a part of their drug dealing.\nFreese told jurors many of the witnesses were co-conspirators because of the nature of the organization and its criminal activities, but the fact they are seeking lower sentences in return for their testimony doesn’t necessarily mean they aren’t telling the truth.\n“These are not good guys,” he acknowledged. “They are not going to make your Christmas card list.”\nWilliams is charged with racketeering; distribution of cocaine; two counts of conspiracy to distribute cocaine, heroin and marijuana; and three counts related to illegally possessing a stolen firearm as a felon.\nSmith is charged with second-degree murder, racketeering, distribution of cocaine and two counts of conspiracy to distribute heroin, cocaine and marijuana.\nOthers indicted in state court were Brandon Motton, Carlnell Pierce, Charles D. Gumms, Willie Thornton, Charlie A. Gumms, Lashawn Davis, Davante Robertson, Ellis Landix, Paul Smith, Keitrel Gumms, Bryant Gumms, Derrick Gumms, Richard Chess, Kerry Reynard, Stephanie Bradley, Corey Trent, Kentaz Gayden, Rasheed Smith and Nathan Carter.\nThose charged in the federal indictment were Harry Smoot, Lance “Life Taker” Singleton, Frankie Hookfin Jr., Ray Woodruff, Isaac “Ike” Smith, Terrence “Streets” Kelley, Clifford Sonnier, Andre Addison, Joequell Lewis, Christopher Brown, Terrell Wade, Richard Thomas, Savannah Houston, Glen Houston, Denver London, Jarrin Harris, Joesia Wilson and Brittany Conner.\nThe trial is expected to continue into next week."}