{"uri": "http://www.rgj.com/story/news/2014/11/08/police-call-in-northwest-reno/18735509/", "title": "Police: 2 children, man dead in northwest Reno shooting", "dct": "Sat, 08 Nov 2014 00:00:00 GMT", "id": "d9c49a187126b273e07d2f498ddfcb51", "content": "7:28 p.m. update\nPolice on Saturday were at the scene of a deadly shooting in a northwest Reno home where police said the bodies of two children and a man were found.\nShooting circumstances were not clear.\nMarcella Corona/RGJ\nNames of the three and their ages were not immediately released. Police would not say whether the three in the Stone Valley Drive home were related.\nPolice said no one else was inside when the shooting occurred and that officers were not looking for any suspects.\nA handgun was used in the shooting, Officer Tim Broadway said.\nNeighbor Rosa Poljak said that about 4:30 p.m. Saturday she heard sounds outside the home where the shooting occurred.\n\"We heard a lady yelling and screaming, that (people) there had been shot,\" Poljak said via telephone from a home next to the shooting scene.\n\"It was very distressful, very bad,\" Poljak said.\nPolice arrived a short time later.\nPoljak said she did not know that woman or those living in the home well and that on Halloween she had last seen a man living in the next door home.\nPoljak said that police had not provided her with any details of the shooting.\nOfficers on Saturday evening had blocked Stone Valley Drive to incoming traffic. By 7 p.m., neighbors with a police escort were being allowed to drive to their homes.\nEarlier, Sparks police had reported that its department was helping handle other calls in Reno while Reno officers responded to the Stone Valley Drive home.\nPolice remained at the scene into the night.\n7 p.m. update\nPolice said they responded to the call along Stone Valley Drive about 4:30 p.m. Saturday and found two children and a man dead in the home.\nTheir ages ages and identities have not been released.\nPolice said they are not looking for any suspects.\nCircumstances of the shooting are not known.\n6:49 p.m. update\nTwo children and a man were killed in the shooting, Reno police officer Tim Broadway said.\nTheir names and circumstances involved were not immediately known.\n6:33 p.m. update\nPolice say they got the call of a shooting at a home in Reno just before 4:30 p.m. Saturday. Waiting on updates from a Reno police official.\n6:25 p.m. update\nNeighbor Rosa Poljak said that about 4:30 p.m. Saturday she heard sounds outside the home where the reported shooting occurred in a home along Stone Valley Drive.\n\"We heard a lady yelling and screaming, that (people) there had been shot ,\" Poljak said via telephone from a home next to the shooting scene.\n\"It was very distressful very bad,\" Poljak said.\nPolice arrived a short time later.\nPoljak said she did not know that woman or those living in the home and that she had last seen on Halloween a man living in the home next door.\nPoljak said that police had not provided any details of the shooting.\n5:36 p.m. update\nReno police have responded to a call of a shooting at a home near Stone Valley Drive and Mae Anne Avenue. Officers have blocked Stone Valley Drive to incoming traffic.\nThe circumstances of the shooting were not immediately known Saturday.\nEarlier, Sparks police reported that its department was helping handle other calls in Reno.\n5:25 p.m. update\nReno police Sgt. Alan Salter told RGJ reporter Emerson Marcus that \"several\" people are reported dead. He did not provide a specific number and is en route to the scene to assist.\n5:20 p.m.\nAuthorities are responding to a report of a possible shooting in northwest Reno.\nCircumstances are not known, and a shooting has not been confirmed.\nThe Sparks Police Department said it was called to assist in covering parts of Reno while Reno police investigate the circumstances.\nThe RGJ has a reporter en route to gather more details.\nCheck RGJ.com as more information becomes available."}