{"uri": "http://www.valdostadailytimes.com/news/local_news/man-charged-in-shooting-incident/article_9d39a689-f9a6-58c3-a13d-ebd273c0cb97.html", "title": "Leroy Brown charged in shooting incident", "dct": "Wed, 18 Jan 2017 00:00:00 GMT", "id": "c531faeef92aa36932775bf922994bbb", "content": "VALDOSTA, Ga. – A man faces multiple charges after police responded to an aggravated assault call Saturday night.\nLeroy Brown, 58, is charged with aggravated assault, aggravated battery, possession of a firearm during the commission of a crime and criminal damage to property, according to a Valdosta Police Department report.\nThe incident started with a reported disturbance at Hill Street Booze, 414 E. Hill Ave., at approximately 9:40 p.m. Police responded to a call of two subjects arguing with one possibly having a firearm.\nReports of shots fired were received while police were en route to the location. Upon arrival, police did not find any injured person but learned that the victim had been transported from the scene to the hospital by a friend, according to reports.\nValdosta Police detectives and crime-scene technicians with the Valdosta Regional Crime Lab also responded to the scene to assist the investigation.\nThe investigation revealed that a man got into a verbal altercation with a customer in the store. As the customer tried to leave, the man pulled a pistol and shot the customer in the arm, according to reports.\nWitnesses attempted to restrain the man after the shooting, but during the struggle, the man's gun discharged, striking him in the leg. He was found at a private residence after the altercation and was taken to the emergency room for treatment. He was then booked into Lowndes County Jail, according to reports.\n“The Valdosta Police Department commends the citizens who attempted to restrain the offender in this case from continuing to discharge his firearm in an attempt to commit further violence. The witnesses in this case who assisted Valdosta Police Officers while investigating are also recognized,” VPD Lt. Adam Bembry said in a statement.\nDesiree Carver is Lifestyles Editor at the Valdosta Daily Times. She can be reached at (229) 375-5777."}