{"uri": "http://www.wkbw.com/news/police-blotter/accidental-shooting-death-leads-to-manslaughter-charge-for-east-aurora-man", "title": "Accidental shooting death leads to manslaughter charge for East Aurora man", "dct": "Mon, 07 Nov 2016 10:24:00 GMT", "id": "acdcca1a9f84246ef660a17537445856", "content": "Autoplay:Elma shooting leaves teen dead and another charged with manslaughterCONNECTING...XELMA shooting\nEAST AURORA, N.Y. (WKBW) - An East Aurora man is facing felony charges connected to the accidental shooting of a friend.\nErie County Sheriff's deputies arrested 19-year-old Jake Klocek from East Aurora after a shooting at a residence on Dorris Drive, Elma.\nThe shooting happened about 8:40 p.m. Sunday November 6th. Deputies say the victim, Anthony King, 19, was shot with a handgun in the stomach.\nKing was taken to the Erie County Medical Center where he later died from his wounds.\nBoth King and Klocek graduated from Iroquois Central High School in 2015 and police say the two knew each other.\nKlocek is charged with second-degree manslaughter and second-degree criminal possession of a weapon.\nHe was arraigned in Elma Town Court and ordered held on $50,000 bail with a return date of November 14th at 7:30 p.m.\nDuring the arraignment, Elma Town Justice Robert Pierce called the shooting a tragedy for both families.\nThe Erie County Sheriff's Office has not released the circumstances surrounding the shooting.\nThe investigation is ongoing but neighbors say the owner of the property was out of town when the shooting occurred.\nSunday's events are also affecting Iroquois Central Schools were a crisis team was put into effect to help students who knew King and Klocek.\nWKBW Legal Analyst Florina Altshiler explains the charge of manslaughter.\n\"Recklessly is defined as disregarding a substantial risk that is known...that would result in something like this-death,\" she said. \"If you're playing with a gun, you should expect that it may go off. That's a known risk.\"\nIt is unclear where the gun came from and why the teens had it.\n\"It's a felony, so at the absolute minimum he'll be facing a year in jail, but he's probably looking at more like five to ten.\""}