{"uri": "http://ktvo.com/news/local/detectives-investigate-shooting-at-green-city-motel", "title": "Detectives investigate shooting at Green City Motel", "dct": "NODATE", "id": "0f12e9f1a639377b07958539653c403a", "content": "GREEN CITY, Mo. —\nUPDATE: KTVO has now learned new details about a northeast Missouri shooting.\nIt happened Tuesday night at the Green City Motel and Party Mart.\nThe victim and his mother each contacted KTVO Wednesday night by email to tell us what happened.\nBoth say the shooting was definitely an accident.\nWe are told the two men involved are brothers. One is from Unionville, Missouri and the other from Oskaloosa, Iowa.\nWe are not releasing their names.\nThe victim claims that his brother and the brother's girlfriend were fighting when he arrived at the motel.\nHe entered their room and overheard his brother threaten to commit suicide.\nThat brother, who had a handgun, then locked himself in the bathroom.\nThe victim says he kicked the bathroom door open. The door hit his brother in the head, knocking him off balance.\nThat's when the gun discharged, shooting the victim in the pelvis.\nHe was flown to University Hospital in Columbia where, as of Wednesday night, he was listed in fair condition.\nThe Missouri State Highway Patrol's Division of Drug and Crime Control is still investigating the incident.\n------------------------------------------------------------------------------------------------------------\nNortheast Missouri authorities are investigating a Sullivan County shooting.\nIt happened Tuesday night at the Green City Motel and Party Mart along Highway 6 in Green City.\nThe Sullivan County Sheriff's Office called in the Missouri State Highway Patrol's Division of Drug and Crime Control to assist in the investigation.\nSergeant Brent Bernhardt from the highway patrol told KTVO the shooting involved two people in a room at the motel.\nInvestigators are not sure if the shooting was an accident or a criminal act.\nThat is what they are trying to figure out.\nThe injured person was reportedly flown to a hospital for treatment of a gunshot wound to the pelvis.\nThe highway patrol is not releasing the names of those involved in the shooting as the investigation continues to determine if it was accidental or intentional.\nDetectives were on the scene overnight collecting evidence at the scene of the shooting.\nBernhardt said this is an ongoing investigation."}