{"uri": "https://www.facebook.com/permalink.php?id=313979908643128&story_fbid=540014446039672", "title": "West Point Police Department", "dct": "Sat, 28 Jan 2017 21:09:24 GMT", "id": "b679026d5dbd90485fb37eb0f1ec6b2c", "content": "7 victims of Sunday shooting released from area hospitals\nby Asia Ashley\nAll victims of Sunday night’s shooting at Union Street Park are believed to have been released from hospitals, according to LaGrange Police Capt. Dale Strickland.\nPolice are still looking for the three suspects, two of which have been identified as Lewis Antonio Shells, of Cedar Street, and Xavier Edmondson, of LaGrange. The third suspect has not been identified.\nAccording to police, a gathering had been held throughout the day at Union Street Park and into the evening. A fight ensued within the group and the three suspects fired shots into the crowd.\nThose injured and transported to West Georgia Medical Center include: Rockella Moore, who was shot in the foot; Chancey Bradford, who was shot in the arm; Leroy Hall, who was shot in the stomach; Demetris Harris, who was shot in the head and Raphel Shells, who was grazed on the head. Rodzennske Tucker, was shot in the leg and was located at Lanier Memorial Hospital in Valley, Ala. Emmanuel Roberts was shot in the neck and was flown to the Columbus Medical Center and was released this morning.\nStrickland said that they do believe alcohol was a factor and has received information that the incident may have been gang-related.\nDue to the severity of the incident, which took place around 9:30 p.m. Sunday, most of the scheduled officers at that time responded to assist with the scene, causing a delay in some 911 calls.\n“We were dealing with a number of injuries and a large outdoor crime scene,” said Strickland. “Most of our officers had to assist.”\nAccording to Strickland, in serious incidents the LPD’s policy is to contact off-duty officers to assist with incidents and calls. As needed, the Troup County Sheriff’s Office and Georgia State Patrol assists with calls. A deputy did responded to the shooting scene for canine assistance, where a 9 mm shell casing and a Beretta .25 caliber handgun was found.\nOperators dispatch officers according to the severity and nature of the calls. A damage to a vehicle call would not be as serious as an assault or domestic call, said Strickland.\nRead more: LaGrange News - 7 victims of Sunday shooting released from area hospitals"}