{"uri": "http://www.delawareonline.com/story/news/crime/2016/01/11/two-people-shot-browntown/78658594/", "title": "Community shocked by Browntown shooting; 1 killed", "dct": "Mon, 11 Jan 2016 00:00:00 GMT", "id": "b6852d8c6c4d1872e4e426f098c5779a", "content": "Police have released few details in a shooting Monday night that left one man dead and four others injured in the Browntown area of Wilmington.\nA preliminary investigation shows that multiple men forced their way into a home in the 900 block of Brown Street at about 8 p.m. Monday with the intention to rob those living inside, Sgt. Andrea Janvier said. Gunfire then ensued and multiple people were critically injured in the exchange, she said.\nA 20-year-old, whose name has not yet been released, died later at Christiana Hospital from multiple gunshot wounds to his lower extremities, she said.\n\"I thought we were one of the lucky neighborhoods but it knows no boundaries,\" said Ron Krystopolski, past president of the Browntown Community Association. He's lived in the neighborhood for 60 years and seen drug activity move into the neighborhood up and down Maryland Avenue.\nBut the shooting came as a surprise to nearby residents, many of whom own their homes and have lived in the neighborhood for many years. Krystopolski said the community isn't a bad area either, largely made up of blue collar workers, but more transient residents have moved in.\nA number of marked and unmarked city police cars sat on the block Tuesday afternoon, with officers conducting follow-up interviews and searching the roofs of nearby buildings. Two K-9 units were also present Tuesday following Monday night's fatal shooting.\nOfficers were first called to the brick row home on the 900 block for a 911 call reporting two people shot – a 28-year-old man and a 51-year-old woman, Janvier said. The man had a gunshot wound to his right leg and the woman had a gunshot to her stomach, she said.\nThe man and woman were treated by county paramedics on scene before they were transported to Christiana Hospital. The man was described as stable but the woman was admitted in critical condition, Janvier said.\nWhile officers were still at the row home, police were notified of two more shooting victims who arrived at St. Francis Emergency Room in personal vehicles, Janvier said. One man, identified as 49 years old, was shot in the left hand and stomach, she said. He was admitted in serious but stable condition.\nThe second man was 21 years old and had gunshot wounds to his shoulder, leg and stomach, Janvier said. He was in critical condition at Christiana Hospital, where both he and the 49-year-old were ultimately transported.\nA fifth shooting victim arrived at Wilmington Emergency Room shortly after in a personal vehicle, Janvier said. The 20-year-old man had multiple gunshot wounds to his lower extremities and died from his injuries.\nThe investigation is ongoing and police ask those with information to contact Detective Randy Nowell at (302) 576-3632.\nPolice closed off several blocks of Brown Street Monday night as they spoke to neighbors and investigated.\nKrystopolski said at this point, the mayor needs to step up and turn over police department deployment numbers to the state. Police are already doing all that they can and could use the help, he said.\n\"At this point, anything and everything can help,\" he said. \"Whatever the mayor can do, he needs to do.\"\nHolly Maddams, executive director of Girls Inc. – located on the neighboring block of Brown Street – said no programs at the center were in session during the time of the shooting and that most programs are typically completed by 8 p.m., when the shooting was reported.\nThe center, which serves young girls in low-income neighborhoods, is slated to leave the Browntown neighborhood in the coming months, though the shooting has nothing to do with the decision to move, Maddams said Tuesday.\nThe organization will relocate to another neighborhood similar in demographics to Browntown, she said, though a permanent address has not been established yet.\n\"We've never actually been in the building when something like this happens in the neighborhood,\" Maddams said. The center has procedures in place should a crisis ever occur during program hours, though they've never had to use them, she added.\n\"This goes to show that the youth in this city need organizations like us and the many others like us,\" she said. \"We certainly can't change the situation on our own.\"\nOn Monday night, family members at the scene would not comment, but said they were heading to Christiana Hospital. Scanner reports indicated that police were searching for four suspects.\nResidents, who were drawn out into the cold Monday night by curiosity over the heavy police presence, said the neighborhood is usually quiet. Many know each other through the area's civic association.\nOne woman, who would not give her name, said she moved to Browntown from Brooklyn, New York, and thought the area would be safer.\n\"It's usually calm, collected here,\" she said while standing on her front porch. \"This is something new.\"\nShe added that most in the neighborhood are working class and rarely, if ever, cause problems.\nBefore Monday, the city had only one shooting so far this year. Last year, 131 people were hit by gunfire in the city, 26 of them fatally.\nWilmington Councilwoman Sherry Dorsey Walker called Monday's shooting a tragedy and a \"blatant disregard for life.\"\n\"It really is disheartening because the residents of Browntown have worked diligently through the Browntown Civic Association to make a difference in the community,\" she said. \"When we have people who come into the community and commit these acts of violence, it becomes very disheartening to those who have worked so hard to make a difference in their neighborhoods.\"\nJessica Masulli Reyes contributed.\nContact Brittany Horn at (302) 324-2771 or bhorn@delawareonline.com. Follow her on Twitter at @brittanyhorn."}