{"uri": "http://www.shelbystar.com/20131223/police-4-hit-in-shooting-suspects-sought/312239900", "title": "Police: 4 hit in shooting; suspects sought", "dct": "NODATE", "id": "79952217ae022a9b4491bf8d84eeadc3", "content": "Police say four people were hit in an overnight shooting in Shelby.\nFour people were hit by gunfire but none face life-threatening injuries after a Sunday night shooting, according to Shelby Police.\nPolice believe at least two people were in a vehicle from which the shots were fired at a house on Jose Street, southwest of Uptown Shelby, said Shelby Police Capt. Rick Stafford.\n“Those in the house aren’t being cooperative enough to steer us in a direction of who was involved,” Stafford told The Star on Monday. “There’s some information being looked at that they may know the shooter or shooters.”\nOne woman was shot behind the ear and was transported to a Charlotte hospital for observation, Stafford said.\nThe other victims were hit in the leg, the back and the face in the cheek, respectively, Stafford said, and they were treated and released from the hospital.\n“One was a juvenile,” Stafford said. “None of (the injuries) appear life-threatening.”\nThe shooting was reported to police at about 8:13 p.m. Sunday night.\nStafford said police believe the vehicle that carried the suspects may be an early 2000s model silver Honda Accord.\nHave information for police?\nIf you have information on the shooting, call Shelby Police at 704-484-6845 or Crimestoppers at 704-481-8477.\nUpdated 10:15 a.m.\nPolice say four people were hit in the overnight shooting in Shelby.\nOne woman was shot behind the ear and was transported to a Charlotte hospital for observation, said Shelby Police Capt. Rick Stafford.\nThe others were hit in the leg, the back and the cheek, respectively, Stafford said, and they were treated and released from the hospital.\n“One was a juvenile,” Stafford said. “None of them appear life-threatening.”\nThe shooting was reported to police about 8:13 p.m. Sunday night.\n\"Those in the house aren’t being cooperative enough to steer us in a direction of who was involved,\" Stafford said. “There’s some information being looked at that they may know the shooter or shooters.\"\nStafford said police believe there were at least two people in the car from which the shots were fired. He said the car may have been an early 2000s silver Honda Accord.\nIf you have information, call Shelby Police at 704-484-6845 or Crimestoppers at 704-481-8477.\nOriginal post\nOne person was shot Sunday night during a party in Shelby, according to police.\nThe incident happened on Jose Street, southwest of uptown.\n“Somebody fired from a car at the house,” Shelby Police Chief Jeff Ledford said.\nLedford said the victim’s injuries were not life-threatening.\nHe said no arrests have been made in the shooting.\n“Detectives are following leads and interviewing witnesses,” Ledford said.\nThe Star will have more information as it becomes available.\n-- Matthew Tessnear"}