{"uri": "http://www.kctv5.com//story/33317973/5-year-old-child-shot-in-kansas-city-during-drive-by-shooting#.V_RPlbtj6Y0.twitter", "title": "Neighbors shaken after 5-year-old boy shot in Kansas City neighborhood", "dct": "Wed, 05 Oct 2016 00:53:00 GMT", "id": "4de1e03b3de840962e7d2bd9fa2a4102", "content": "KANSAS CITY, MO (KCTV) -\nA 5-year-old boy who was shot in Kansas City Tuesday night remains in the hospital.\nThe boy was shot in the leg and buttocks shortly after 7 p.m. Tuesday night at 415 Denver Avenue.\nFamily members say Joel was one of three children under the age of 5 who were home during the shooting. His grandfather says Joel was standing next to his bed playing with a tablet when he was shot.\n\"I just feel bad,\" said Artmio Sanchez, the boy's grandfather. \"We just keep an eye to be sure - and pray for us.\"\nThe family let KCTV5 into their home shortly after the shooting. Bullet holes were found throughout the home.\nThe shooting happened two blocks north of Independence Avenue on the city's northeast side.\nNeighbors say the shooting has left them on edge.\nWhen Tony Olivieri found out his neighbor's son had been senselessly shot in a drive-by shooting, it shook him.\n\"It hits to the heart,\" Olivieri said. \"If that was my son, I don't even want to talk about....it's such an innocent soul.\nManny Abarca is an official with the Indian Mound Neighborhood Association. He said this shooting will only motivate his association more to work hard at preventing crime.\n\"Now it just shows us we need to keep doing the work we're doing to prevent this stuff from happening,\" he said. \"The way we look at it in this neighborhood, crime has happened to our family members. We want to figure out what we can do to stop these incidents from happening.\"\nLast year, a 5-year-old was fatally shot. This summer, three people were killed near Budd Park.\nLeaders say surveillance cameras installed at Budd Park just down the street from Joel's home have made a difference.\nNo suspect information has been released.\nCopyright 2016 KCTV (Meredith Corp.) All rights reserved."}