{"uri": "http://www.nola.com/crime/index.ssf/2013/04/harvey_quintuple_shooting_vict.html", "title": "Harvey quintuple shooting victims: 67- and 63-year-old women and 3 toddlers", "dct": "Mon, 22 Apr 2013 22:43:00 GMT", "id": "3d33122b931a67cf57c0d3272afca4c0", "content": "Authorities have said the gunmen who loosed a barrage of bullets through the door of a Harvey apartment on Monday morning were targeting someone inside the home. But their victims were three toddlers and two women, ages 63 and 67, hardly the targets one would imagine, considering the amount of deadly force unleashed by the suspects.\nHowever, Jefferson Parish Sheriff's Office investigators say there were at least two other people inside the apartment during the shooting, who were unharmed. Col. John Fortunato, spokesman for the Sheriff's Office, declined to identify the two people and whether they were indeed the intended targets.\nBut deputies have four men in custody after a chase across the Crescent City Connection into New Orleans. Investigators are also looking into whether the suspects are connected to any of the other shootings that occurred on the West Bank between Sunday evening and Monday morning.\nThe quintuple shooting occurred at an apartment in the 2300 block of Laplaco Boulevard in Harvey. There was a knock at the door around 4:20 a.m., and one of the women got up and answered it. When she asked who was there, a voice responded, \"The police,\" Fortunato said.\n\"The moment she opened the door, a barrage of semiautomatic gunfire erupted,\" he said. \"We found a substantial amount of shell casings right outside the door.\"\nFortunato said investigators also noted several bullet holes in the door. The three children are believed to have been sleeping in the living room, near the front door. The toddlers, all age 3 or younger, suffered gunshot wounds, as did the two women. It's unclear where the two uninjured inhabitants were in the apartment at the time of the shooting.\nThe victims are expected to survive their injuries. A 23-month-old boy is in critical but stable condition at Children's Hospital in New Orleans, Fortunato said. The two women are in stable condition at Interim LSU Public Hospital in New Orleans.\nOn Monday morning, several Sheriff's Office deputies were working an unrelated case at Helen Cox High School when a vehicle peeled out of the apartment complex parking lot across the street from the school and sped away. Some deputies gave chase while others responded to the reports of the shooting that had begun to pour into the 911 dispatch center, Fortunato said.\nThe deputies chased the vehicle across the Mississippi River bridge and onto the Pontchartrain Expressway, where the driver lost control and possibly slammed into a guard rail near the Earhart Boulevard exit, according to Fortunato. The suspects ditched the vehicle and ran down the off-ramp.\nOne of the men leaped over the railing and injured his leg, Fortunato said. He was the first to be apprehended. The other three were discovered by Deputy Brian Maytag and his canine partner lying on top of one another in the bushes near a home improvement store just off Earhart Boulevard.\nThe Sheriff's Office recovered three weapons: one in the vehicle and two from the off-ramp. Investigators plan to look into whether the suspects are connected to any of the other shootings that occurred Sunday night. Fortunato said detectives will check the weapons against shell casings and other evidence recovered from the crime scenes. \"It's going to take quite some time,\" he said.\nInvestigators have not released the names of the suspects taken into custody and what, if any, charges they may face. Stay with NOLA.com for more information about this story as it develops."}