{"uri": "http://www.nola.com/crime/index.ssf/2013/04/relatives_1-year-old_injured_i.html", "title": "1-year-old seriously injured in Harvey quintuple shooting, relatives say", "dct": "Tue, 26 Apr 2016 11:04:00 GMT", "id": "a2c4e9dd17537494314ac6ef0c68c2ed", "content": "Relatives of the 1-year-old girl injured in a quintuple shooting at a Harvey apartment confirmed Thursday that she was seriously injured by the bullet that struck her in her the back. The baby, known as \"Petunia\" or \"TuTu\" to family members, is still hospitalized in critical condition, according to Lionel Slater, 49, a cousin, and another relative who declined to be identified.\n\"TuTu\" is one of three children and two women shot early Monday morning when authorities say four gunmen knocked at the door of an apartment in the 2300 block of Lapalco Boulevard, then opened fire with an AK-47 and a .40-caliber pistol. A 2-year-old boy and a 3-year-old girl also injured in the shooting had been released from the hospital as of Thursday. The boy was shot in his leg; the girl was shot in her leg and arm and had a graze wound on her neck.\nThe two women, ages 67 and 63, were still being treated at a local hospital for gunshot wounds to their legs. The older woman was scheduled for another surgery to remove a bullet, the relative said. Both women are expected to be released from the hospital in the coming days.\nMeanwhile, Jefferson Parish Sheriff's Office investigators have booked four men in the shooting. Frankie Hookfin Jr., 21, of 405 Dandelion Drive, Waggaman, and Davante Robertson, 19, of 600 Deerfield Road, Terrytown, were booked with five counts of attempted second-degree murder, according to arrest reports. Charlie Gumms, 18, of 2140 of Esplanade Place, Terrytown, and Lashawn Davis, 20, of 2840 Glenbrook Drive, in unincorporated Gretna, were booked with five counts of being a principal to attempted second-degree murder, the report said. According to state law, principals are accused of aiding or abetting in the commission of a crime, even though they may not have been there or directly committed the offense.\nHookfin was booked with an additional count of aggravated flight from an officer, the arrest report said. He was allegedly behind the wheel of the Honda Accord that nearby Sheriff's Office deputies saw screech out of The Lapalco Apartments parking lot just seconds after they heard the gunfire Monday morning, according to authorities.\nWhile some deputies went to the apartment to check on the victims, others chased the vehicle through Harvey, onto the West Bank Expressway and across the Crescent City Connection, sometimes at speeds of more than 100 mph, the arrest report said. The chase ended when the car slammed into a guard rail on the Pontchartrain Expressway near the Earhart Boulevard exit in New Orleans. Authorities have said Hookfin leaped over the overpass railing, and injured his leg and head in the fall. He was taken into custody and hospitalized.\nThe other three suspects were discovered lying on top of one another in the bushes near a home improvement store just off Earhart Boulevard. Investigators also recovered an AK-47 later linked to the shooting and a 9mm pistol.\nJefferson Parish Sheriff Newell Normand said in a news conference earlier this week that the motive for the shootings may be linked to a fight at a bar in eastern New Orleans six weeks ago. The argument apparently stemmed from allegations that one of the four suspects may have been involved in another murder.\nDuring the news conference, authorities said the suspects were no strangers to law enforcement, with several arrests in their criminal histories. At least three have previously been accused of murder but never convicted, according to court records.\nHookfin was arrested along with Samuel Ridgely III and booked with two counts of first-degree murder and one count of attempted first-degree murder in connection with the March 7, 2010 murders of Kedrich Stewart, 17, and Lynnard Collins, 15, at a Waggaman playground. A 16-year-old boy also suffered gunshot wounds to the legs in the incident.\nJefferson Parish Assistant District Attorney David Wolff on Wednesday said his office refused the charges against Hookfin in 2011 because of insufficient evidence. A witness recanted a statement that connected Hookfin to the crime. Ridgely was indicted with the murders and attempted murder, Wolff said. A motion hearing in the case is scheduled for May 10.\nIn October 2009, Hookfin pleaded guilty to assault on a school teacher. He was originally given a six-month suspended sentence and 12 months of probation, according to Jefferson Parish court records. But a judge revoked the probation in 2010 and reinstated the original sentence.\nDavis was arrested along with his twin brother, Dashawn Davis, and a third man, Jerome Johnson, and booked with second-degree murder in the April 8, 2011, shooting of Michael Walker, 22, in Terrytown. The district attorney's office refused the charges against all three suspects in August 2011 because of insufficient evidence, Wolff said.\nOn March 28, Davis pleaded guilty to attempted possession of a firearm with obliterated serial numbers and attempted use of a firearm in connection with drugs or violence, according to Jefferson Parish court records. He was sentenced to three years and eight months in prison. He was released from prison on April 10, 12 days before the Harvey shootings, according to Pam Laborde, spokeswoman for the state Department of Corrections. He had received credit for time served in jail before his sentencing.\nGumms was arrested and accused in the May 6, 2011, murder of Elvis McClellan, 19, in Marrero. Gumms was arrested as a juvenile along with two other suspects. Wolff said the district attorney's office refused the charges but referred the case back to the Sheriff's Office for further investigation because of issues with witnesses in the case.\nGumms has been convicted of possession of a stolen vehicle, according to Jefferson Parish court records. He pleaded guilty in February and was sentenced to two years of probation."}