{"uri": "http://www.khou.com/story/news/local/neighborhood/2015/03/02/hcso-child-may-have-shot-himself-in-ne-harris-county/24260901/", "title": "HCSO: 5-year-old shoots 6-year-old brother while playing with gun", "dct": "Mon, 02 Mar 2015 00:00:00 GMT", "id": "1b06a967ea2c7612f0d8ee2852812453", "content": "HARRIS COUNTY, Texas – A 5-year-old boy shot and critically injured his 6-year-old brother at their home in east Harris County, deputies said Monday.\nRelatives say the young brothers loved to play cops and robbers.\n\"He may have picked up the wrong weapon thinking that it was a toy,\" said Thomas Gray, an uncle. \"But this weapon was not a toy and it was a real gun and he actually pointed it at my other nephew and fired it.\"\nThe shooting was reported around 10:30 a.m. Monday in the 16800 block of Faring Road.\nThe little boy named Hayden was taken by ambulance to Memorial Hermann Hospital with a gunshot wound to the stomach.\n\"He was transported and immediately taken into surgery,\" said Deputy Thomas Gilliland with the Harris County Sheriff's Office. \"What I can tell you is he's critical but stable and was conscious as he went into surgery.\"\nDeputies said the children were playing with an unsecured gun in a front bedroom when it went off. Their mother and two younger sisters, ages 2 and 3, were home at the time, but there were no other injuries.\nThere was a toy gun on the family's front lawn.\nThe uncle said the real guns are usually kept in a safe place.\n\"We have a safe in here,\" Gray said. \"So I have no idea if it was in the safe or we were walking around with it and set it down somewhere. I have no idea.\"\nSo far, no charges have been filed in the case but that could change.\n\"They can be charged with making a weapon accessible to a child which is a class a misdemeanor,\" Gilliland said.\nThis is the third incident involving children and guns since Friday in the Houston area.\nGilliland urged gun owners to be careful.\n\"Firearms being accessible to children and other adults, make sure they are secured. Make sure they are locked up,\" Gilliland said.\nHCSO is also offering free gun locks this week.\n(Photo: Rucks Russell / KHOU 11 News)\nAlso read:"}