{"uri": "http://www.wftv.com/news/news/local/police-4-shot-outside-daytona-beach-nightclub/nnYsn/", "title": "Search on for gunman after 4 shot in Daytona Beach", "dct": "Sat, 05 Sep 2015 18:39:00 GMT", "id": "ee8aecfeb41eeadeb9fe151332a9d161", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nDAYTONA BEACH, Fla. - Four people were shot outside a Daytona Beach club Saturday and the shooter is still on the loose, police said.\nPolice were told by the victims in the hospital that before the shooting near the Biarritz Club, the unidentified gunman got into a fight with several people.\nThe man left the area after the fight and came back with a gun.\nReports said the man fired multiple rounds outside the club and struck four people who weren’t involved in the fight. Three of the victims suffered non-life-threatening injuries, while another was shot in the stomach and is fighting for his life.\n“Being a mother and knowing that’s your child and your child is shot, you’re not hearing where she’s shot or nothing, I freaked out,” said Lisa McMillian, the mother of victim Latoya Kennedy.\nMcMillian hasn’t slept since she got the call at 3:30 a.m. saying that her daughter was shot in the leg.\nMcMillian said Kennedy wasn’t at the club, but at the park next door, getting an early start on celebrating her birthday.\n“I wish they’d get guns off the street. I mean, when we were coming up, we fist-fought,” she said.\nPolice said all four victims went to Halifax Medical Center, where they told police what happened.\nNo one was able to get a good look at the shooter. McMillian said she’s worried what could happen if there’s more violence outside the club, which is feet away from Bethune-Cookman University dorms.\n“I thank God that there wasn’t (a) death involved, but it could have been much worse. Innocent people, I mean, nobody should get shot, whether you’re innocent or not,” said McMillian.\nDetectives are working to identify the gunman. They do know that the shooter was about 4 ½-feet tall, black and likely to be between 20 and 30 years old.\nAnyone with information is asked to call police."}