{"uri": "http://www.freep.com/story/news/local/michigan/detroit/2016/04/16/6-month-old-baby-shot-dead-detroits-west-side/83128968/", "title": "Police: Two men in custody in slaying of 6-month-old", "dct": "Sat, 16 Apr 2016 00:00:00 GMT", "id": "380d80ee354bec7dbd333fc060f498ac", "content": "Jennifer Dixon Detroit Free Press\nSix-month-old Miracle Murray was slain today during a shooting on Detroit's west side.\nHours after the bullets flew, two men were taken into custody in connection with the crime, police said.\nPolice said they believe the shooting is connected to the fatal shooting of 3-year-old Aniaya Montgomery in Detroit on Easter Sunday that resulted in the indictment of three men by a one-man grand jury in Wayne County Circuit Court.\nDetroit police spokesman Sgt. Michael Woody said one of the suspects in Miracle's shooting today had initially been investigated in the Easter shooting, but was eliminated as a suspect. Woody said \"there is a gang nexus involved\" in today's shooting.\nMiracle was killed when shots were fired at a house on Winthrop near Clarita on Detroit's west side about 1:30 p.m., police said. A 24-year-old man was also struck and was in serious condition. Witnesses said he was shot in the hip and leg. His relationship to the baby is unclear, Officer Dan Donakowski said.\nIn addition to the two suspects in custody, police said there might be a third unidentified suspect.\nTia Murray, who said she is a relative to the baby and saw the shooting, said people were in the front yard when she heard gunfire.\n\"I was coming around the corner, I heard the gunshots up and down the street,\" said Murray, who said she drove the baby to the hospital, but it was too late.\n\"I ran all kinds of red lights,\" she said.\nMurray said the baby was named Miracle because her mother had complications during pregnancy.\n\"She made it to six months, that's a miracle to me,\" Murray said.\nKyra Street, who said she is Miracle's 21-year-old sister, said she was in the yard with her two young children and felt a bullet whiz by her face.\n\"I looked right back at him when he was shooting,\" Street said. \"I'm real lucky.\"\nContact Jennifer Dixon: 313-223-4410 or jbdixon@freepress.com."}