{"uri": "http://www.nbcwashington.com/news/local/Student-Shot-Suitland-High-School-prince-georges-co-410650005.html", "title": "Student Shot Near Suitland High School; Search for Gunman Underway", "dct": "Fri, 13 Jan 2017 00:00:00 GMT", "id": "76013ff4099721f6ca701a67d0c8829b", "content": "A high school student opened fire near a high school in Prince George's County, Maryland, Friday afternoon, shooting a fellow student and sending a bullet through the window of a school building, police say.\nThe student fired multiple shots in an apartment building parking lot within sight of Suitland High School in District Heights, police said. The search for the shooter is ongoing.\nA teen boy was shot in the leg and is expected to recover.\nThe school was placed on a lockdown that later was lifted.\nMany parents rushed to the school, fearful that their children had been shot.\n\"Police can't tell you anything, the school can't call parents and let anybody know anything,\" one mother said, nearly in tears. She said she had two daughters who attend the school.\nUpon learning that boys had been involved in the shooting, not girls, the mother exhaled and clutched her hand to her chest.\n\"Thank you,\" she said.\nAccording to the initial investigation, a group of students left the school and argued in the apartment building parking lot, a Prince George's County Police Department spokeswoman said.\nOne student opened fire and hit the teen. A classmate dragged him into the high school for help.\nPrince George's County police and fire and rescue was called to the scene about 12 p.m. Soon after, they found the victim near the school annex building, which houses art and music classes.\nHe was taken to a hospital with non-life-threatening injuries.\nPolice later found a bullet lodged in the ceiling of that school building. A student and a teacher were inside the classroom but were not hurt.\nAt least five shell casings were found.\nSuitland High is a performing arts school known for its students' achievements.\nA witness told News4 he saw three students involved in the conflict: one who was shot, one who helped the victim and another who ran away.\nPrince George's County Fire Chief Marc Bashoor posted on Twitter that this was \"NOT an active shooter\" situation.\n#Breaking: A male student has been shot outside Suitland High School in the annex area. Police are searching for a suspect.#NBC4DC\n\"The investigation has moved into the neighborhoods, where we're currently searching for the suspect,\" Lt. David Coleman said.\nStudent Kelai'ah Wheelen said she just wanted to go home.\n\"It was terrifying,\" she said.\nAnyone with information for police is asked to call 301-772-4910. To leave a tip anonymously, call 866-411-TIPS, send a text message with PGPD plus your message to CRIMES or visit www.pgcrimesolvers.com."}