{"uri": "http://chicago.suntimes.com/news/man-gets-probation-after-son-fatally-shoots-3-year-old-brother/", "title": "Man gets probation after son fatally shoots 3-year-old brother", "dct": "Thu, 20 Oct 2016 09:02:00 GMT", "id": "28af21732c119d8e87684bf72f261026", "content": "A man who faced charges after his 6-year-old son found a loaded gun and accidentally fatally shot his 3-year-old brother in the head last year in their Humboldt Park home has been sentenced to probation.\nMichael Santiago, 26, pleaded guilty Monday to endangering the life or health of a child before Judge Alfredo Maldonado, according to Cook County court records.\nSantiago, a former gang member, bought a revolver to protect himself after testifying at the murder trial of another gang member, prosecutors said last year. He did not have a concealed-carry license or an FOID card.\nSantiago’s 6-year-old son got his hands on the gun in the family’s apartment in the 1000 block of North Francisco just after 9 p.m. on Oct. 17, 2015, and accidentally shot his 3-year-old brother as the toddler ate a bowl of macaroni and cheese, authorities said.\nThe boys were under the supervision of their grandfather, who was in an upstairs apartment when he heard the shot.\nThe grandfather carried Eian H. Santiago from the family’s apartment in the 1000 block of North Francisco about a block to Norwegian American Hospital. Eian died shortly thereafter.\nSantiago warned his elder son that the Smith & Wesson .32-caliber revolver — bundled in a pair of pajama pants atop the refrigerator in the family’s garden apartment in Humboldt Park — was to be handled “only by adults,” prosecutors said.\nPolice said the boy was playing cops and robbers with the gun.\nThe toddler’s death is hardly an anomaly: A joint investigation by USA Today and The Associated Press published earlier this month found that during the first six months of this year, minors died from accidental shootings — at their own hands, or at the hands of other children or adults — at a pace of one every other day, far more than limited federal statistics indicate.\nIn Illinois, there were 42 such accidental shootings during a 2½-year span,from Jan. 1, 2014, through June 30 of this year, the investigation found. Thirty of those shootings were in Chicago.\nEarlier this month, a 3-year-old boy fatally shot himself in the head while playing with his father’s gun in north suburban Waukegan, police said."}