{"uri": "http://www.nola.com/crime/index.ssf/2016/09/1_dead_in_central_city_shootin_1.html#incart_river_home", "title": "1 dead in Central City shooting, coroner confirms", "dct": "Mon, 12 Sep 2016 16:43:00 GMT", "id": "255357ebb5c652a73336c3c7043444b5", "content": "One of the victims from a shooting Sunday night (Sept. 11) in Central City has died from his wounds, the Orleans Parish Coroner's Office announced Monday. The victim was 63-year-old Earnest McKnight.\nThe confirmation comes just hours after New Orleans police said one of six people were shot in the incident had a life-threatening gunshot wound to the head. The remaining four men and a woman received what police called \"non-life-threatening injuries.\"\nThe victim count is the highest for a single shooting this year, Superintendent Michael Harrison said. He said detectives believe the gunfire was possibly meant for two people, and at least some of the wounded may possibly have been bystanders.\nReports differed Sunday night as to whether five or six people had been shot, after police initially issued an alert about 8:30 p.m. saying that the shooting had left three people wounded. NOPD spokeswoman Dawne Massey gave an update an hour later that stated police had revised the number of people shot from three victims to as many as possibly six.\nAt the scene of the shooting Sunday night, officers had placed dozens of evidence markers at the intersection of South Claiborne Avenue and First Street, where shell casings lay scattered outside a convenience store called South Claiborne Market. Witnesses standing in the neutral ground along South Claiborne said they heard around 20 shots.\nOne man, who asked not to be identified, said he saw the shooter park a truck near the market, exit the vehicle and \"peek around the corner to see if he was there.\" The man said the shooter then opened fire at someone who was halfway down the block near an apartment complex.\nThe man said bystanders were also struck, including one person in a wheelchair. The shooter fled in the truck, he said.\nThe block where the apartment complex sits was the scene of at least one other shooting, when two men were shot in April 2015.\nInvestigators are searching for surveillance video and witnesses, and are probing whether Sunday night's shooting is related to other incidents in the area."}