{"uri": "http://www.wwltv.com/news/report-bystander-dies-gang-members-targeted-in-new-orleans-mass-shooting/318018903", "title": "After 63-year-old man killed, neighbors worry about gang activity", "dct": "Wed, 14 Sep 2016 00:00:00 GMT", "id": "36993176fb3aa1a8a18731e3faf82632", "content": "NEW ORLEANS - The 63-year-old man killed in Sunday's mass shooting near First Street and Claiborne Avenue was described by friends as a hard working landscaper and a well-liked neighbor on Rex Place in the Central City neighborhood of New Orleans.\nWanda Phillips, who lived next door said Earnest McKnight loved to work in the garden in front of his house.\n\"We would have a conversation every morning and he would ask me how I was doing,\" Phillips said. \"He helped me to cut the grass across the street.\"\nMcKnight had just walked down the street to buy a pack of cigarettes at the corner grocery story when shots rang out Sunday. A bullet hit him in the head and he later died at University Medical Center. He was one of six people shot at the scene.\nMcKnight's other next door neighbor Nate Daniels said unfortunately, he was in the wrong place at the wrong time.\n\"I heard about the shooting, but I didn't know that he got hit until the next morning,\" Daniels said. \"That hurt me deeply.\"\nMeanwhile, The New Orleans Advocate newspaper is quoting a law enforcement source that claims the two \"intended targets\" of the shooting, Arnold Learson and Nathan McCray are members of 3-N-G, a notoriously violent street gang that controlled the drug trade in the neighborhood near their namesake Third and Galvez in Central City.\nEarlier this year, 19 of its members were convicted and sent to jail in a massive state racketeering case.\nWWL-TV crime analyst Jeff Asher worked for the NOPD during 3-N-G's reign of terror.\n\"Likely, due to their involvement in the drug trade, it led to territorial wars, it led to lots of retribution, it led to lots of gun violence,\" Asher said.\nAsher added that it is too soon to say whether Sunday's shooting represents a resurgence in gang related violence in the city.\nBut, he said right now, New Orleans is on pace for a 17 percent increase in shootings compared to last year.\n\"I wouldn't go so far as to describe any sort of trend,\" Asher said. \"It's certainly a troubling data point, six person shot and one person killed is a terrible tragedy and its certainly sad to see.\"\nWith the mass shooting still fresh on their minds, neighbors know what a surge in gang violence could mean for their quality of life.\n\"I'm worried about my family,\" the neighbor Daniels said. \"Me and my baby could have been walking around there, going to the store at that time. It could have been us.\"\n(© 2017 WWL)"}