{"uri": "http://www.dailymail.co.uk/news/article-3841390/Sprinter-Tyson-Gay-s-15-year-old-daughter-shot-dead-Kentucky-restaurant.html", "title": "Olympic sprinter Tyson Gay's 15-year-old daughter is shot dead in late-night shoot-out at Kentucky fast food restaurant", "dct": "Sun, 16 Oct 2016 16:01:00 GMT", "id": "b138a3440889066e9262a9c6c7b1f79d", "content": "Olympian Tyson Gay's 15-year-old daughter has been shot dead at a Kentucky restaurant.\nTrinity Gay, herself a rising track star, was shot in the neck at Cook Out restaurant in Lexington early Sunday morning.\nShe died at the University of Kentucky Medical Center, the coroner's office for Fayette County said in a statement.\nTyson, who will be flying back to Lexington Sunday, told LEX 18: 'She didn't make it. I'm so confused. She was just here last week for fall break. It's so crazy. I have no idea what happened.'\nScroll down for video\nHer mother, Shoshana Boyd, told the New York Daily News: 'She was so innocent, she was so innocent.\n'She wanted to be the fastest woman in the world, and they took that away from her.'\nOfficers went to the parking lot of the restaurant near the University of Kentucky campus at about 4am after witnesses reported gunfire was exchanged between two vehicles, Lexington police said in a statement.\nThe vehicles have been described as a gray Dodge Charger and a dark-colored sports car with tinted windows.\nPolice spokeswoman Brenna Angel said police don't believe Trinity, who died shortly before 5am, was in either of the cars involved.\nOfficers located one of the vehicles and stopped two people for questioning, the statement added.\nPolice were still searching for the second vehicle and are continuing to investigate.\nSophomore Trinity had followed in her sprinter father's footsteps and was making a name for herself as a Lafayette High School athlete.\nShe was a sprinter and finished fourth in the 100 meters and fifth in the 200 meters at the state Class 3A high school track meet in May, records show.\nShe also ran on a 4x200 relay team that finished fourth. Her father also ran at Lafayette and still holds the state record in the 100 set in 2001.\nJulian Tackett, commissioner of the Kentucky High School Athletics Association, wrote on Twitter: 'Shocked to hear of death of Trinity Gay. A life of such potential cut so tragically short. Sympathies to Tyson and entire family.'\nOlympic Gold medalist and sprint coach Ato Boldon, from Trinidad and Tobago, tweeted: 'Condolences to Tyson Gay and his family... 15-year-old girl dies after shooting at Lexington restaurant.'\n'#Sad news for a member of our @usatf Family this morning,' US Olympic sprinter Lauryn Williams ‏wrote. 'As you head to church pray for @TysonLGay His daughter was killed last night.'\nAnd shot-putter Darrell Hill wrote: 'Praying for your peace @TysonLGay. Everyone please say a short prayer for Tyson's family.'\nMeanwhile, the official Twitter account of USA Track & Field, tweeted: Sending our thoughts & prayers to @TysonLGay & his loved ones as they mourn the tragic & senseless loss of his daughter, Trinity.'\nTyson is the fastest sprinter in history not to have an Olympic medal after a career nagged by doping disqualifications.\nThe 2007 world 100- and 200-meter champion and four-time US 100m champion suffered a hamstring injury at the 2008 Olympic trials and did not medal at Beijing.\nAt the 2012 London Olympics, Gay was on the US 4x100 relay that finished second to Usain Bolt-led Jamaica but the Americans were stripped of the medal in 2014 based on a positive test by Gay in May of 2013 that he blamed on an unnamed third party.\nGay served his suspension and returned to run again two months ago at the Rio Olympics where the Americans ran third in the 4x100 relay behind Jamaica and Japan, only to be disqualified because of a faulty exchange between teammates Justin Gatlin and Mike Rodgers."}