{"uri": "http://www.mlive.com/news/grand-rapids/index.ssf/2016/10/woman_shot_outside_after-funer.html#incart_gallery", "title": "Woman shot outside after-funeral gathering for 28th Street homicide victim", "dct": "Thu, 20 Oct 2016 22:51:00 GMT", "id": "4d405264a8483bb59539a3cfa70b3a98", "content": "GRAND RAPIDS, MI -- A shooting that injured a woman Thursday happened outside of an after-funeral gathering for Juwan Boykin, a man killed in an Oct. 9 shooting spree at a 28th Street party.\nLeaders with Urban Family Ministies, in a Facebook post, confirmed that a gathering for the 28th Street victim was taking place Thursday evening.\n\"Tonight many of you may see the news regarding a shooting at the Urban Family Ministries building. We opened the building for the repast of the young man shot in the 28th street shooting a few weeks ago,\" according to the post.\n\"A woman was shot and is in the hospital. Please be praying for her recovery. The staff and volunteers are safe,\" the post continued.\nGrand Rapids police said the 52-year-old woman was shot in the shoulder area about 7:20 p.m. Thursday, Oct. 20 in front of 543 Eastern Ave. SE. She was last known to be in critical but stable condition at an area hospital.\nA witness who did not want to be named said about 50 people were at the gathering when multiple shots were fired. She said about half of the attendees were standing outside, along Eastern Avenue.\nPolice were at the scene quickly because officers already were in the area, investigating an earlier report of shots fired from a bicyclist. Those officers heard the shots fired at 7:20 p.m.\nBoykin, 21, was at a birthday party inside a commercial building at 1850 28th Street, near Kalamazoo Avenue SE, when someone opened fire on a large crowd of people. The building was once a clearance center, but was no longer in operation.\nBoykin was killed and eight others were injured. The injured involved four men ages 20, 27, 29, and 34 and four women ages 19, 24, 35 and 35.\nSeveral people leaving the Eastern Avenue gathering Thursday declined to comment.\nPolice also said they were having difficulty finding witnesses to talk about the shooting outside of Urban Family Ministries.\nRelatives of Boykin earlier said they believe he was in the \"wrong place at the wrong time\" and not an intended target.\nHe was the father of a 4-year-old daughter and two sons, ages 2 and 1.\nFamily set up a GoFundMe page to help cover costs of his funeral. He was expected to be buried in the Detroit area."}