{"uri": "http://www.rrstar.com/article/20141230/NEWS/141239958/10447/NEWS", "title": "Rockford detectives transport quadruple homicide suspect to Winnebago County Jail", "dct": "NODATE", "id": "6e159179ed13760923947d63344d5a86", "content": "Hide caption Calvin L. Carter photo PROVIDED\nROCKFORD - Rockford Police Department detectives headed to southern Illinois early Tuesday morning to retrieve a 22-year-old man suspected in the brutal Dec. 20 slaying of a former girlfriend, her two young sons and her longtime boyfriend.\nCalvin L. Carter, 22, faces charges of first-degree murder with a handgun in the killings. Carter is expected to make an initial court appearance at 1:30 p.m. Wednesday in the Winnebago County Criminal Justice Center.\nAmateur boxer Demontae Rhodes, 24, his girlfriend Martia L. Flint, 24, and her children Tyrone Smith III, 6, and Tobias K. Smith, 4, were found shot to death inside a red-brick duplex in the 3200 block of Montrose Avenue.\nFlint and Rhodes were childhood friends. They began to date four years ago. Rhodes was helping raise her children and was a father figure to them. The couple had split up for a few months earlier this year and dated others before recently reconciling.\nInvestigators and family members have declined to say precisely when Carter had a relationship with Flint and for how long. On Dec. 23, police announced they had recovered a weapon detectives suspect was used in the shootings and other evidence, but would not say where the items were found.\nOn Saturday, Carter turned himself into Madison County authorities in southern Illinois near St. Louis on an unrelated retail theft warrant.\nIt stemmed from a May 2013 retail theft charge in St. Clair County. He was accused of stealing a Wii entertainment system and had been released on a recognizance bond. A St. Clair warrant was issued for his arrest when he did not show up at court dates.\nCarter and others were being sought for questioning by Rockford authorities in connection with the Dec. 20 killings when he surrendered. Detectives from Rockford went to the Madison County Jail to interview Carter over the weekend, Assistant Deputy Chief Patrick Hoey said.\nWhether Carter gave the detectives a statement was not clear.\nFirst-degree murder charges against Carter were announced Monday just hours after family members buried the homicide victims following emotional memorial services attended by hundreds of people at Rockford First.\nThe news conference was called as soon as authorities obtained a first-degree murder warrant and the timing was not influenced by the funeral services, said Marilyn Hite Ross, the Winnebago County State's Attorney's criminal bureau chief.\nCarter is facing four counts of first-degree murder. More charges are possible pending a continuing investigation and a review by a Winnebago County grand jury. If convicted of first-degree murder, he could be sentenced from 45 years to life in prison.\nJeff Kolkey: 815-987-1374; @jeffkolkey"}