{"uri": "http://wishtv.com/2016/12/15/two-greenwood-elementary-schools-on-lockdown-due-to-shooting-in-area/", "title": "3 shot, 1 dead after Greenwood robbery", "dct": "Thu, 15 Dec 2016 10:50:00 GMT", "id": "760f6b15d47e73c556743bf6ef9e8cfd", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nGREENWOOD, Ind. (WISH) — A man has died and two others are injured after shootings in Greenwood Thursday morning.\nThe Greenwood Police Department said three people were shot in the ordeal and the department is still investigating. GPD said it occurred in the 500 block of N. Meridian St. around 10:20 a.m.\nA police official said one man shot in the chest had died. Two other men were also shot. Officials have not released their conditions.\nA pair of elementary schools were placed on lock down due to the nearby robbery and shooting.\nDr. Kent DeKoninck with Greenwood Community Schools said in a tweet that Northeast and Isom Elementary schools were on lockdown due to police activity in the area.\nThat lockdown was lifted just before 11:15 a.m.\nGPD adds police were called to the scene for a robbery. Two of the victims were found on the scene suffering from a gun shot wound. Detectives found a pickup truck a couple blocks away from the shooting scene with a woman inside. Police believe the vehicle was tied to the suspect.\nInvestigators later learned two people showed up to a Greenwood church on Madison. One had a gunshot wound, the other had a story on how their vehicle broke down. Those at the church called 911, and police arrested the pair, believing they are connected to the deadly shooting scene on North Meridian.\nAssistant Greenwood Police Chief Matthew Fillenwarth says all of those involved in the shooting are currently in custody. Police have not determined who will be charged in the case. Fillenwarth, was adamant that the shooting was not random, and that those who live in the home were targeted for some reason.\n“It’s so sad,” said Ashley Rodriguez a neighbor.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}