{"uri": "http://wfla.com/2017/01/21/4-year-old-fatally-shot-in-auburndale-police-say/", "title": "4-year-old Auburndale boy accidentally shoot self in face, dies", "dct": "Sat, 21 Jan 2017 22:24:00 GMT", "id": "88893f4a2381db4cab7c40cfc49ed386", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nAUBURNDALE, Fla. (WFLA) – A 4-year-old child left unsupervised accidentally got ahold of a loaded gun and shot himself in the face in Auburndale, police say.\nOfficers were called Friday night to a home in the 100 block of Lakeside Hills Loop where they said a child was found with a gunshot wound.\nOn Sunday, Investigators said they were initially called to the home for a report of a child hitting their head on a table. When officers arrived, they discovered Avion Cymani Weaver, 4, with a gunshot wound to the cheek.\nThe child was taken to Arnold Palmer Hospital and later died.\nInvestigators said that Avion was inside the family’s apartment watching TV by himself. His mother’s live-in boyfriend, Demeko Desean Robinson, 26, was outside with friends at the time of the incident.\n“It is apparent that Avion found Robinson’s loaded pistol and while handling it, he accidentally shot himself in the face,” a police release stated.\nCharges are potentially pending following a complete case review, officials stated.\nA mother and father were caught on camera, passed out, in…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}