{"uri": "http://wwmt.com/news/local/shooting-investigation-in-kalamazoo", "title": "Update: 15-year-old boy arrested in Kalamazoo Township shooting", "dct": "NODATE", "id": "635cf584d04b40b7134ac56fffdec66e", "content": "KALAMAZOO, Mich. (NEWSCHANNEL 3) – A 17-year-old girl is fighting for her life after being shot in the chest in Kalamazoo Township Wednesday morning.\nNow, a teenage boy is in custody, and police allege he shot her in the chest, before fleeing the scene.\nIt happened shortly before 2 a.m. at the Country Meadows Apartment complex on Sunnyside Drive, in Kalamazoo Township.\nTownship Police Chief Tim Bourgeois says the teenage boy was brought into custody Wednesday morning by his parents.\nPolice say several people witnessed the shooting as it happened in the apartment complex.\n\"It's a tragedy when anyone gets shot...but when it's a 15 year and 17 year old...even more so,\" Bourgeois said.\nA 17 year old girl remains in critical condition tonight after police say she was shot once in the chest inside the Country Meadows Apartment complex.\nThe girl was found lying on the floor of one of the apartments when police discovered her around 2 a.m. Wednesday.\n\"I hope she's okay, wherever she's at,\" said resident Anthony Gonzalez. \"I hope her family is praying for her too.\"\nMultiple witnesses told police the 15-year-old shooter took off running.\nInvestigators remained on scene through the morning as the suspect was on the loose. But police caught a break when the suspect's parents brought him into the station.\n\"We looked and began to contact relatives, and relatives brought him to the station this morning because they knew he was being sought,\" said Bourgeois.\nCellphone video shot by a neighbor shows police taking the suspect back to the scene in an effort to find the handgun police believe he used in the shooting.\n\"It's a rather large area, but we've extensively searched it multiple times, and to this point, we have not been able to locate it,\" Bourgeois said.\nSome people living in the apartment complex say they feel shaken up after what happened, as many were woken up by the sound of the shooting.\n\"I've been seeing a lot of stuff going on out here. I lived here for awhile and I never knew this place was gonna end up like this,\" said resident Tango Shingledecker.\nThe 15-year-old is being held at the Kalamazoo County Juvenile Home.\nThe case will be forwarded to the county prosecutor's office for review, and the prosecutor could decide to charge the teen as an adult."}