{"uri": "http://www.wistv.com/story/26682554/juvenile-accidentally-shot-at-lexington-home", "title": "Eighth grader dead after shooting at Lexington home", "dct": "NODATE", "id": "b8b27238ca091e7696313dc0507172a4", "content": "LEXINGTON, SC (WIS) -\nA Lexington community is heartbroken after a possible accidental shooting Wednesday afternoon.\nPolice say 13-year-old Ethan Hunter Payne was shot and killed while inside his home with two other juveniles.\n\"I pray the family has some peace at some point soon,\" said Jenny Schneider with the Willowbrooke Homeowner's Association. \"It's just gotta be very hard to have to go through this.\"\nAcross the Willowbrooke neighborhood in Lexington you'll find neighbors like Schneider shocked and emotional.\n\"I don't think it would be easy for any family,\" Schneider said. \"You know, we view our families as very close, and parents are not supposed to outlive their children.\"\nThe Lexington Police Department said a 13-year-old was killed Wednesday afternoon at home.\nThere were three juveniles inside the home but no adults when investigators believe the teenager was possibly shot accidentally.\nPayne was taken to the hospital where he died of a single gunshot wound about 30 minutes after the shooting.\nPayne was a student at Lexington Middle School.\n\"The thought that someone has to bury their son is excruciating,\" Schneider said. \"I can't begin to imagine what the feeling is like.\"\nAs officers continue to investigate, neighbors like Schneider have turned their efforts to fundraising for the family.\n\"There's burial costs, there's clean-up costs of the home, and just anything that they need that they may not have the funds to cover,\" she said.\nA neighbor, who didn't want to be identified, said the victim's father is in the Army, stationed at Fort Jackson.\nHe witnessed the aftermath of the afternoon shooting.\n\"It was almost surreal,\" the neighbor said. \"You know, it was hard to believe. It was like a bad dream when I was hearing what happened and who was involved. It was just very tragic.\"\nWhich is why he and others want to help the family any way they can.\nDonations can be made to the Ethan Payne memorial fund at any Wells Fargo location and at http://www.gofundme.com/fcgkdk.\nCopyright 2014 WIS. All rights reserved."}