{"uri": "http://www.wral.com/child-hospitalized-after-raleigh-shooting/15134440/", "title": "7-year-old shot; homeowner charged with assault", "dct": "Tue, 24 Nov 2015 00:00:00 GMT", "id": "5cc151630a0de8f92cedaed1f2c6f670", "content": "Video Playback Not Supported\nPlay Video\nPlay\nMute\nCurrent Time 0:00\n/\nDuration Time 0:00\nLoaded: 0%\nProgress: 0%\nStream TypeLIVE\nRemaining Time -0:00\nPlayback Rate\n1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptions\nFullscreen\nAutoplay:\nOn / Off\nThis is a modal window.\nThis video is not supported on your platform. Please make sure flash is installed.\nCaptions Settings Dialog\nBeginning of dialog window. Escape will cancel and close the window.\nText Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps\nDefaults Done\nNeighbors stunned by 7-year-old's shooting\nAre you still watching?\nYes, ContinueNo\nRaleigh, N.C. — Wake County sheriff's deputies blanketed a northeast Raleigh neighborhood Wednesday and found a gun they believe was used to shoot a 7-year-old Tuesday night.\nThe owner of the home at 4204 Ferriday Court, 21-year-old Brandon Ross, was arrested Tuesday evening and charged with assault with a deadly weapon inflicting serious injury in connection with the shooting of 7-year-old Joseph Meacham.\nHe was being held in the Wake County Detention Center on a $100,000 bond.\nIt was not clear how Ross and Meacham are related.\nPolice were called to the home at about 6:15 p.m. Tuesday, but they found the boy had been taken to WakeMed North in a private vehicle. The child was transferred from there to Duke Hospital where he was listed in stable condition Wednesday afternoon.\n\"When we arrived on the scene, the child had already left,\" said Wake County Sheriff Donnie Harrison.\nOn Wednesday, deputies were working to determine how the child was shot, who was in the home at the time and who was responsible for the children there.\nHarrison said three other children, ranging in age from 7 months to 10 years old, and three adults were present at the time of the shooting."}