{"uri": "http://www.arklatexhomepage.com/news/local-news/family-seeks-answers-into-teens-murder", "title": "Family seeks answers into teen's murder", "dct": "NODATE", "id": "c8684e04cd7f86eeed978a1a8407840b", "content": "NATCHITOCHES-- - \" I got to bury my baby and their children are still here. That hurts,\" says Termisha Byrd, mother of 14-year-old Louis Byrd III who was gunned down in a convenience store parking lot Sunday.\nPain from a mother mourning the murder of her son, her baby.\n\"He jumped in my bed 3 times before he left yesterday. It was my birthday. He said happy birthday momma, I love you. I said get momma a cup of ice. He wasn't gone 20 minutes and now he's gone,\" says Byrd.\nAuthorities say the shooting happened around 3 Sunday afternoon.\n\"Officers were notified of a shooting that took place at the 1200 block of Texas Street,\" said Detective John Greely, PIO Natchitoches Police Department.\nThere, they found Byrd with multiple gunshot wounds.\n\"He was transported to the Natchitoches Regional Medical Center where he died of his wounds,\" Greely said.\nSurveillance video is being used as evidence from a store across the street to help gather suspects.\n\"Right now we have several people of interest, and we are still exploring our options,\" Greely said.\nFamily members say the gunmen should already be behind bars.\n\"Those boys just jumped out the car and started shooting. They had the boys and they let them go, talking about self-defense. It's bull. I was up there. I looked at my baby. He was on the ground face down. When they turned my baby over, I could see a gun on him, anyone could see it. If he would've pulled it out, it would've been on the ground, but it wasn't on the ground. It was in his jogging pants,\" Byrd said.\nNow this mother demands answers, and prays that justice is served.\n\"Somebody needs to be charged. My baby is gone. If it was white on black crime, somebody would have been in custody right this moment,\" Byrd said.\nPolice say another man was shot in the hand on yesterday and has been released from the hospital.\nThe family is holding a vigil tonight at the Super Stop where the shooting occurred."}