{"uri": "http://www.wyff4.com/news/deputies-respond-to-possible-carjacking-near-anderson-county-school/35963248", "title": "3 of 4 suspects charged after K-9 was killed appear before judge", "dct": "Fri, 23 Oct 2015 13:10:00 GMT", "id": "63ff5414a1cfabf6e702c22cf0e2130c", "content": "ANDERSON COUNTY, S.C. —\nThree of the 4 people arrested in connection to the death of an Anderson County Sheriff's Office K-9 appeared before a judge Friday morning.\nShirlandria Shaqua Dixon, Martivious Craig, and David Fitzgerald Morris were in court.\nDixon is charged with filing a false police report in connection to a carjacking that preceded the fatal shooting of a K-9. Her bond was set at $20,000.\nWarrants say that Dixon gave a false report of being kidnapped by several armed men who got in her car at the Dollar General in Seneca and forced her to drive them to the Dollar General in Townville.\nDeputies also took Morris into custody Thursday in connection to the shooting. He was arrested during a traffic stop on Shockley Ferry Road, officials said. The judge said Morris is charged with two counts of attempted murder and one count of cruelty to a police dog. He was denied bond Friday morning.\nAccording to Morris' arrest record from the State Law Enforcement Division, he has been charged with many crimes in the past including assault, assault and battery, burglary, fraud and conspiracy.\nCraig turned himself in to Seneca police Thursday. The judge said he is also charged with two counts of attempted murder and one court of cruelty to a police dog. He was also denied bond Friday morning.\nCraig is also a suspect in a home invasion in Seneca that happened on Monday. Officers said stolen items from that home invasion were found in the red car that the suspects ditched Wednesday before the shooting. In the past, Craig has been charged with unlawful storing of a machine gun.\nSergio Martin, 23, of Anderson, was arrested Wednesday evening. He was denied bond Thursday afternoon. The judge said because Martin committed a violent crime while he was out on bond from a previous violent crime (burglary), it is mandatory that he not be given bond in connection to the new charges.\nMartin is charged with attempted murder and cruelty to a police K-9, according to warrants.\nThe warrants say the men fired multiple shots at the K-9's handler, Deputy Brandon Surratt.\nMartin is being held in the Anderson County Detention Center.\nWYFF News 4 obtained Martin’s arrest record from the State Law Enforcement Division. It\nshows more than a dozen arrests and convictions dating back to October 2011. The crimes include petty larceny, two fuel tank break-ins, three incidents of criminal domestic violence, two burglaries, assault and battery, DUI, giving false information, shoplifting, driving under suspension, two arrests for possession of marijuana, hindering officers, weapon sale, violation of probation, grand larceny, unlawful carrying of a weapon, loitering to sell drugs, financial identity charge and multiple incidents of failure to make court appearances. In several cases, the sentences were suspended and reduced from years to a few months, or time served.\nThe longest period of time Martin spent in prison was 332 days in 2013, according to the SLED records\nA conviction of shooting and killing a police K-9 carries a sentence of one to five years in prison.\nAnderson County Sheriff John Skipper said the carjacking happened at the Dollar General parking lot in Townville. He said an officer spotted the stolen car on Highway 24 and approached the car.\nThe suspects ran into the woods, and because deputies knew at least one was armed, they sent Hyco in after them.\nSkipper said Hyco was taken to a Magnolia Veterinary Clinic where he was pronounced dead.\n\"It's one of us. It's one of our work mates. We are out here with those dogs every day,\" said Skipper.\nDeputies don't know for certain if Martin actually pulled the trigger, but because he was \"part of it,\" he is being charged with the shooting, Skipper said.\nBen Mallard, owner of East Coast Sign and Lighting, says his surveillance cameras show the red car come down the road at 1:17 p.m. He said the suspects ditched the car in front of his business and two or three suspects jumped out, heading toward the woods.\n“We heard the sirens and next thing we knew, we looked out the door and there were police cars, sheriff's cars everywhere,” Mallard said. “And it wasn't 10, 15 -- 20 seconds later, we heard the shots off in the woods and I guess about five minutes later they brought the dog out.\n“To see that dog come out, an\nd them holding it, and you could see they were very concerned about the welfare of their K9, and it was very sad to see the dog injured knowing I just heard the dog being shot.”\n“I heard the gunshots and the first thing was duck for cover, of course. Having a bunch of sheriff's (deputies) around I didn't feel too worried about that, but I didn't want to be on the wrong end of a stray shot.”\nAccording to Skipper, Hyco was in service for six years and one of the most experienced K9s on the force.\nHyco and Surratt, along with another ACSO K9, completed the American Police Canine Association’s level 3 certification in 2012 which recognized them as among the top certified units in the country. The certification qualified Hyco and his partner for tracking, narcotics detection, building searches, article searches, aggression control and obedience.\nIn May 2014, Hyco was attacked by a suspect who was trying to evade arrest by hiding in an air conditioning duct. Deputies said Russ Grant, 34, was hiding in a home on Centerville Road. When Hyco located the suspect in the duct, Grant punched and kicked the dog, wrapped his legs around the dog’s lower bo\ndy and tried to choke him, deputies said.\nHyco and Surratt fought back until Grant released the dog, and other officers helped to pull Grant from the duct. Grant was charged with operating a chop shop, resisting arrest and attempting to kill a police dog. (Full Story)\nSurratt and Hyco were awarded the 2012 APCA President's Award for Professional Excellence.\nHyco had more than 100 apprehensions during his career.\nSkipper said it will cost the department about $14,000 to replace the K-9.\nAn Upstate woman is trying to raise money to help replace the K-9.\nAmy Hammond is printing Hyco bumper stickers and is asking $5 for them.\nYou can pick one up at AgentOwned Realty at 4022 Clemson Boulevard or East Coast Signs at 106 New Prospect Church Road in Anderson.\nYou can also email Amy at Amyjhammond@gmail.com."}