{"uri": "http://www.orlandosentinel.com/news/breaking-news/os-glitz-ultra-lounge-murder-arrests-20160624-story.html", "title": "4 arrested in Glitz Ultra Lounge fatal shootings", "dct": "Fri, 24 Jun 2016 17:26:00 GMT", "id": "367044c61dd20d6c8fe2562a9162582a", "content": "A shooting that left 2 dead and 10 injured occurred at Glitz Ultra Lounge by International Drive. At least 3 shooters are sought after by Orlando Police.\nFour men have been arrested in the February mass shooting at Glitz Ultra Lounge that killed two clubgoers, police announced today.\nChristian Enrique Castro Cotto, 26, Luis Gadiel Cruz Nazario, 21, Carlos Joshua Perez De Armas, 21, and Jose Angel Hernandez, 30, are charged with second-degree murder with a firearm for the Feb. 7 attack.\nNazario had previously been arrested in February on charges of attempted murder, aggravated assault and battery with a firearm, shooting into a structure, using a firearm to commit a felony and illegally carrying a concealed weapon, police had said.\nJose Jaime Brull-Lopez, 23, was also arrested back in February in connection to the incident, police said. He faces charges of shooting into or throwing a deadly missile into a structure, and use of a firearm in commission of a felony. He was also arrested the day after the shooting on charges of carrying a concealed weapon and tampering with physical evidence.\nJoseph Villalobos, 22, and Jonathan Avila Rojas, 33, were left dead after the shooting, which occurred at a club in Orlando's tourist district – on Universal Boulevard just south of International Drive. Ten others were injured, some of whom contacted attorneys to investigate whether the club could have done more to ensure clubgoers' safety.\nThe incident -- which occurred more than four months before Orlando became home of the nation's deadliest mass shooting that killed 49 and injured 53 at Pulse nightclub -- prompted questions of security inside nightclubs.\nBoth venues hosted about 300 patrons when their deadly shootings began – at Glitz just before 1 a.m. and Pulse just after 2 a.m.\nOne Glitz clubgoer raised concerns to the Sentinel that the club's security guards only checked his upper body, failing to check all the way down to the feet, like most clubs do, to make sure weapons weren't hidden inside shoes.\nThe club's security staff and three off-duty OPD officers were working at Glitz Sunday morning when the gunshots began,\nPolice arrested Nazario on unrelated heroin trafficking charges in January, records show. He and another man sold an informant 5.7 grams of heroin for $525 in September 2015, officers said.\nOrlando police recorded 54 incidents at the Glitz Ultra Lounge in the year before the shooting, including a shooting in the club's parking lot that injured two.\nThe investigation is still ongoing and no additional information is being released at this time, according to a police news release. The full report on the investigation will likely be available by the end of July.\nNeither victim had an extensive criminal background."}