{"uri": "http://www.orlandosentinel.com/news/breaking-news/os-glitz-shooting-bond-hearings-20161114-story.html", "title": "Defendant in club shooting gets bond; details emerge", "dct": "Tue, 15 Nov 2016 17:25:00 GMT", "id": "d2285a18bec20015b258b32475872def", "content": "The night at Glitz Ultra Lounge ended with two people dead and another eight injured, half of them described by police as innocent bystanders who had nothing to do with the alleged gang fight in front of them.\nBut it started with an attempt at a peace offering, according to court proceedings Tuesday.\nThe Feb. 7 shooting at Glitz, a now-defunct club on Universal Boulevard, left two dead: Joseph Villalobos, 22, and Jonathan Avila Rojas, 33. In a bond hearings for two of the four suspects Tuesday, police for the first time publicly described what led to their deaths.\nThe people involved were allegedly members of two rival gangs with ties to Puerto Rico: Los Lobos, of which Villalobos was allegedly a member; and Los Alqaedas, which police said counted Avila Rojas as a prominent member.\nThe two groups had been feuding because of rumors that a member of one had ratted out a member of the other in exchange for a lighter sentence in a federal case. That night, both groups were at Glitz: Los Lobos on an upstairs balcony and Los Alqaedas downstairs, Orlando police Detective Teresa Sprague said in court Tuesday.\nChristian Castro-Cotto, who was upstairs with Los Lobos, saw members of Los Alqaedas and started raising his arms at them, as if to challenge them, Sprague said.\nAvila Rojas, who was standing by the bar, saw Castro-Cotto and decided he did not want things to get violent that night. He grabbed Joseph Villalobos' brother and asked him to get the leader of Los Lobos down so they could talk and smooth things over.\nThe leader came down with nine other people. Luis Gadiel Cruz-Nazario, 21, and Carlos Perez De Armas, 22, who were both armed, stood on either side of Avila Rojas, Sprague said. Police do not believe Avila Rojas was armed, possibly because he had a federal criminal record, and think the other two may have been assigned to protect him.\nCastro-Cotto approached Cruz-Nazario with a drink in his hand, Sprague said.\n\"Que paso?\" Castro-Cotto said — \"what's happening?\"\nCruz-Nazario responded: What do you mean, what's happening?\nInstead of responding, Castro-Cotto took his glass and smashed it into Cruz-Nazario's face, video evidence shows. Cruz-Nazario later told police he thought he had been shot because of the force.\nCruz-Nazario allegedly pulled out his gun and started to fire, in retaliation. Perez De Armas saw him and fired his gun as well, police said.\nMembers of Los Lobos fired back. By the end, two people were killed, four alleged gang members were injured, and four innocent bystanders, three women and one man, were hurt as well.\nOrlando police arrested four people in June on second-degree murder charges: Castro-Cotto, Cruz-Nazario, Perez De Armas and Jose Angel Hernandez.\nCastro-Cotto and Perez De Armas, who were being held on no bond in Orange County Jail, had bond hearings Tuesday.\nCastro-Cotto's attorney argued that he did not have or fire a gun during the incident and should be entitled to a bond. Circuit Judge Alicia Latimore granted him a $65,000 bond, but withheld her decision on whether to allow Perez De Armas' release until she could review more evidence.\nThe other two suspects in the shooting were already been released from jail.\nCruz-Nazario was released on his own recognizance in August because of a procedural issue — he was arrested twice on different charges stemming from the same Glitz incident, court records show. Less than a month later, he was shot killed in a Belle Isle. Officials with the Orange County Sheriff's Office, the investigating agency, have not said whether his killing was related to the Glitz shooting.\nJose Angel Hernandez was released on a $20,000 bond Aug. 22. He is still awaiting trial.\nglotan@orlandosentinel.com or 407-420-5774"}