{"uri": "http://www.cbs58.com/story/29180652/second-suspect-charged-in-double-homicide-at-37th-and-nash-street", "title": "Second suspect charged in double homicide at 37th and Nash Street", "dct": "Thu, 28 May 2015 17:16:00 GMT", "id": "cc3065b30d4324a0094ec6aa94253f25", "content": "Second suspect has been charged in connection with the fatal shootings on May 1 near 37th and Nash Street.\nMario Lovert Granville was charged with two counts of first degree reckless homicide and three counts of first degree endangering safety.\nThe first suspect to these shootings was arrested on May 8.\nDevon Loggins, who resides at the house where the homicides occurred,was arrested on May 8 for this crime.\nLoggins was charged with two counts of first degree reckless homicide, three counts of first degree recklessly endangering safety and possession of a firearm by a felon.\nThe two homicides happened just before 1:00 a.m. on May 1 in the 3700 block of N. 37th Street.\nTwo victims, a 25-year-old Milwaukee man and a 26-year-old Milwaukee man, died at the scene. Three victims, a 25-year-old man, a 26-year-old man, and a 33-year-old man, were all transported to a local hospital for treatment of non-life threatening injuries.\nCBS 58's reporter Sarah Barwacz spoke with the mother of the victim on the phone.\nThe mother said the homicides stemmed from a family dispute that spiraled out of control.\nThat mother said the homicide victims are an uncle, Damario Jones, and his nephew, Montrell Burdine.\nFamily told CBS 58, Jones had a child with a women and the two families got into fight and it turned to gun shots.\nMany in the neighborhood were surprised by the loud gun shots early in the morning.\nMilwaukee Police continue to search for the known suspect.\nA pastor from Pastors United said their will be a vigil today at 37th and Nash Street for the victims. The vigil will be at 6:00 p.m. The pastor also says he's gathering with other pastors to create a center for people to resolve their resolutions.\nPastor Malcolm Hunt says, \"We are looking to set up a conflict resolution center where people have a problem and they want to resolve that problem before violence they can give us a call we can sit down and talk it out instead of shooting it out or fighting it out.\""}