{"uri": "http://www.wfsb.com/story/30496646/toddler-shoots-kills-himself-after-finding-loaded-gun", "title": "Toddler shoots, kills himself after finding loaded gun", "dct": "Thu, 12 Nov 2015 03:11:00 GMT", "id": "e19650e174b25a19f8c9f30a2ea2f870", "content": "JACKSON, GA (CBS46) -\n2-year-old Jaydon Clay died Wednesday night after accidentally shooting himself in the face.\nThe incident occurred around 6 p.m. at a home on the 500 block of Carr Avenue in Jackson, Ga., which is about 50 miles southeast of Atlanta.\nThe mother of the child told police she was putting away groceries when she heard the gun go off.\nPolice said the child was playing with his twin brother in the living room, while their mom was in the kitchen. The toddler found a loaded .45 caliber Ruger pistol and accidentally shot himself.\nPolice are investigating if a convicted felon may have brought the gun into the house without the mother's knowledge.\nThe mother's boyfriend was interviewed by police Thursday evening. Police said he was very upset, but came in willingly to the police station to be questioned.\n\"She lived with someone else as far as I know. As I say they've just been here about three weeks,\" said neighbor Ricky Scott.\nConnecticut State Police have made a second arrest in the case of the…\nNeighbors who spoke with CBS46 News said this is a shock to the entire community.\n\"They're new neighbors and I just met them for the first time a couple of weeks ago,\" said neighbor Caleano Ponce. \"For us to hear about this is kind of difficult for us to deal with.\"\n\"I'm still not over the shock as of yet. Like I say, I have a grand myself and anytime something happen to a kid like that it hits me very hard,\" said neighbor Sammie Watson.\nThe Georgia Bureau of Investigation said the autopsy on Clay was completed. The Butts County Medical Examiner ruled the cause of death was gunshot wound to the head. The manner of death is pending further investigation and forensic testing.\nThe identities of those involved have not been released.\nNo charges have been filed in the case.\nCopyright 2015 WGCL-TV (Meredith Corporation). All rights reserved."}