{"uri": "http://www.newsday.com/long-island/crime/man-shot-in-head-while-driving-in-hempstead-nassau-cops-say-1.12308055", "title": "Nassau police intensify anti-gang patrols in Hempstead after shootings", "dct": "Tue, 13 Sep 2016 22:27:00 GMT", "id": "4c6a5e17cfff8ca6557e922367adaadc", "content": "Slaying of Josue ‘Joshua’ Guzman, 15, may be gang-related, cops say\nPolice: Another nearby shooting comes amid a spike in reports of gunfire\nNassau police are intensifying patrols in Hempstead with an anti-gang focus after two shootings within 24 hours — including the killing of a 15-year-old boy — with both occurring during an uptick of gang shootings in the village, officials said Tuesday.\nNo arrests have been made in the two shootings — including the slaying of Uniondale High School student Josue “Joshua” Guzman, 15, who was shot as he walked down the street with two people at about 1 a.m. Monday in the vicinity of the Linden Triangle, home to scores of shootings in the last decade, police said.\n“Our investigation suggests that Joshua may have been associating with people that he does not normally associate with, possibly gang members as of late, and we’re looking at this case with that in mind,” said Nassau Chief of Department Steven Skrynecki.\nPolice said they don’t believe the two shootings are connected.\nPolice have surveillance video showing Guzman walking with two other people before the shooting, Skrynecki said, adding that Hempstead and Nassau detectives are scouring the area looking for more video evidence, seeking witnesses and “expediting” the processing of ballistic evidence.\nPolice would not release the video to the news media, citing the ongoing investigation.\nOfficers responding to a ShotSpotter gun detection system call found Guzman dead on the street at Linden and Laurel avenues.\n“We do believe there are witnesses to this incident and possibly persons with valuable knowledge,” Skrynecki said. “This is a sad and tragic incident — this man was only 15 years old.”\nCrime Stoppers has increased the reward for any information in Guzman’s killing to $10,000, Skrynecki said.\nIn the later shooting, which occurred about a mile away, a 20-year-old man, believed by police to be a member of the Crips gang, was shot once in the forehead as he drove a silver 2004 Ford Escape in the area of Terrace and Atlantic avenues about 10:10 p.m. Monday, police said. He crashed into several parked cars, police said, and was found sitting outside the car when police arrived.\nMultiple shots were fired at the vehicle, and another man inside escaped without injury, police said.\nThe killing of Guzman and the shooting on Monday come amid a spike in reports of gunfire in Hempstead, according to Village Police Chief Michael McGowan. Before June, the village averaged about one shooting a month. In June, there were three; five in July; six in August and nine so far in September, said McGowan. Not all of the shootings resulted in a victim, McGowan said, but the chief said they all appear to be related to gang warfare.\nIn one shooting in late August, three men — ages 17, 19 and 20 — were shot on Terrace Avenue in Hempstead. McGowan said the shooting appears to be gang related. No arrests have been made.\n“Clearly in the last few weeks, in the last few months, there seems to be an uptick in shooting incidents that involve gang activity,” said Skrynecki. “We are keeping a very close eye on that here in Nassau ... This is something that we are combating at all times and there are peaks and valleys with this type of activity. Things pop up, and we are generally successful at identifying the people involved and making arrests.”\n— With Ellen Yan"}