{"uri": "http://www.clickorlando.com/news/deputies-investigate-after-2-shot-near-orange-county-winn-dixie", "title": "2nd man arrested in shooting near Orange County Winn-Dixie", "dct": "Thu, 21 Jul 2016 18:18:00 GMT", "id": "afff17ad51c7daf1ba1a2e1e0cc2a0df", "content": "ORANGE COUNTY, Fla. - Orange County deputies have arrested a second man man in connection with a shooting near a Winn Dixie on Hiawassee Road last month.\nHenry Brandon Floyd, 23, was charged with first-degree murder, attempted first-degree murder with firearm and robbery with a firearm on Monday. Days earlier, Darrius Miller was arrested on first-degree murder and attempted first-degree murder with a firearm and robbery with a firearm.\nThe shooting was near a shopping complex parking lot on Hiawassee Road and Clarcona Ocoee Road.\nThe victim killed was identified as 16-year-old David Lee Grimmage. The three other adult victims were not identified, but deputies said they were treated for non-life-threatening wounds and are expected to survive.\nDeputies said two groups in separate cars met and, somehow, it escalated into a shootout. Both of the cars sped off. One car had a wounded man and woman inside. Orange County Fire Rescue said they made it to a church further up the street before being taken to a hospital. Their conditions were unknown.\nThe other car drove more than 5 miles to the Orlo Vista neighborhood. The driver was going so fast, he lost control on the corner of Livingston Street and Powers Drive, plowing into someone's fence, barely missing the house.\nThe mangled fence and pieces of the car scattered the yard. The group would only get two more blocks before neighbors said the people inside ditched the car. A 15-year-old boy was dead from a gunshot wound inside.\nOrange County deputies said they believe the shooting was not a random act of violence.\nNews 6 was on scene where the parking lot of the Winn-Dixie shopping plaza was taped off.\nCopyright 2016 by WKMG ClickOrlando - All rights reserved."}