{"uri": "http://www.wsaz.com/news/headlines/12-Year-Old-Girl-Dead-in-Accidental-Shooting-in-Catlettsburg-Ky-321337051.html", "title": "UPDATE: Family Mourns 12-Year-Old Girl Killed in Apparent Accidental Shooting", "dct": "Tue, 11 Aug 2015 19:57:00 GMT", "id": "d7ad4fac99c5bbc4c8884ac87311f8ce", "content": "UPDATE 8/11/15 @ 6:14 p.m.\nBOYD COUNTY, Ky. (WSAZ) -- Family members said Halee Marshall, 12, was helping her oldest brother move into a new home in Catlettsburg, when something went horribly wrong.\nHer mother said when Halee's brother went to grab a gun out of his truck from his girlfriend, it went off unexpectedly and killed Halee.\nThe family said they're mourning the loss of a girl they said was \"pure joy.\"\n\"I heard a big boom, I didn't know what it was, I had no idea, I thought good grief what was that, and it was her,\" said Shana Marshall, Halee's mother.\nThere's nothing to compare to the kind of loss Marshall said she's feeling now.\nHer daughter, Halee, a 7th grader at Boyd County Middle School, is gone.\n\"I was just in shock, I ran down the road screaming for my baby and I couldn't do nothing,\" she said.\nMarshall said Halee was helping her 20-year-old brother move into a new home.\nShe said his girlfriend was helping them grab his 12-gauge shotgun out of a truck, but when she handed it to him, he reached for the gun and it fired.\n\"All I know was her daddy come into the house and said Halee's been shot and she's dead,\" Marshall said.\nInvestigators said CPR didn't work and by the time paramedics arrived, Halee was gone.\n\"I prayed and I prayed and I prayed, I prayed so hard,\" Marshall told WSAZ's Dan Griffin.\nHalee's mother said her daughter was full of joy and loved her family more than anything.\n\"She was my life, and that's been ripped away from me now and I'll never have it back,\" she said.\nShe said she'll now rely on God to work through losing such an important part of her life.\nThe family said their next step is to plan Halee's funeral, which could be a big financial challenge.\nThey're hoping they may be able to get some help with it all.\nThe Boyd County Coroner said he doesn't consider the shooting to be suspicious or anything more than an accident.\nHe also said he doesn't believe drugs or alcohol were factors.\nWe also spoke with the Catlettsburg Police Chief who told us he also doesn't find the shooting to be anything more than accidental.\nHe said he doesn't expect any charges in the case.\nBoyd County School leaders released this statement about Halee's death:\n\"Halee was a long-standing student in the Boyd County School System, where she had been in attendance throughout her academic career. Halee began her schooling experiences at Catlettsburg Elementary, where she attended from kindergarten through fifth grade, before progressing to Boyd County Middle School.\n\"Her friends and teachers declare her as 'the sweetest young lady in the world.' Her humble demeanor was one in which she provided peer support and easily made friends with all she encountered.\n\"Words cannot begin to describe the deeply rooted pain and heavy hearts of our district. Every child is precious and uniquely made, and losing Halee reminds us of the fragility of life.\n“We lost a vibrant young soul, in which words cannot accurately capture her humble nature, and genuine heart”. Halee 'had a smile that could light up a room.'\n\"She cared deeply and invested her efforts into making others feel special and loved. It is rare that these qualities would be defined in such a young person, but Halee exuded them all and set an example for how to care and support others.\n\"Halee’s legacy will live beyond her reach, as what she taught us during her short stay here on Earth are lessons that will last throughout our lifetime. She will be remembered for choosing to love and place a mark on the hearts of all those she encountered.\n\"Boyd County Schools will continue to miss and celebrate Halee’s life, as her name is written among the greatest of names.\"\nKeep clicking on WSAZ Mobile and WSAZ.com for the latest on this story.\nUPDATE 8/11/15 @ 9:50 a.m.\nCATLETTSBURG, Ky. (WSAZ) -- The Boyd County Coroner has released the name of a young girl who was apparently accidentally shot and killed by her brother.\nThe shooting happened about 8:15 p.m. Monday in the 600 block of 28th Street in Catlettsburg.\nCoroner Mark Hammond tells WSAZ the victim was 12-year-old Halee Marshall.\nHe says the family was moving into the home and unpacking a pickup truck.\nHammond tells WSAZ the gun, a 12 gauge shotgun, belonged to Marshall's brother and he was taking it into the house when it accidentally fired. Hammond says he didn't realize the gun was loaded.\nThe girl was shot one time. She was pronounced dead at the scene.\nAt this time, Hammond says there is nothing suspicious in this case and the shooting appears to be accidental. Hammond says neither drugs nor alcohol were involved.\nMarshall was a student at Boyd County Middle School. Grief counselors are at the school Tuesday.\nAn autopsy is being performed on Marshall Tuesday in Frankfort. Hammond expects preliminary results by the end of the day.\nKeep clicking on WSAZ Mobile and WSAZ.com for the latest on this story.\nORIGINAL STORY 8/10/15 @ 9:30 p.m.\nCATLETTSBURG, Ky. (WSAZ) -- A 12-year-old girl is dead in an apparent accidental shooting at a home in the 600 block of 28th Street, police at the scene say.\nThe incident was reported at 8:17 p.m. Monday.\nFamily and neighbors at the scene tell us the girl had just started seventh grade at Boyd County Middle School.\nA family member said the shooting happened as the family was just moving into the home and unloading their belongings.\nPolice are not releasing the names of those involved at this time.\nIt's also unknown if any charges will be filed.\nKeep clicking on WSAZ Mobile and WSAZ.com for the latest on this story."}