{"uri": "http://www.king5.com/story/news/local/kent/2015/04/17/kent-baby-shot/25927155/", "title": "Baby's family wants answers in Kent shooting", "dct": "Fri, 17 Apr 2015 00:00:00 GMT", "id": "e546817eecdb3478f747c070f4b8231d", "content": "SEATTLE – Police are no longer saying road rage prompted a drive-by shooting in Kent that left a 1-year-old girl in critical condition.\n\"This does not appear to be a random incident at this time and we continue to follow all leads that present themselves,\" Kent police said a statement Friday.\nMilajha Grant was on life-support at Harborview Medical Center Friday. Her family says doctors have declared her brain dead, but are continuing to do tests.\nThe family is frustrated that little new information has been released since the shooting Thursday afternoon.\n\"Milajha Miracle Grant,\" said Precious Grant, Milajha's aunt.\n\"Miracle's her middle name because she's a miracle,\" said Grant, breaking down. \"Heart beating strong because she's a fighter. She's a soldier and she's made it through so much. That's why she's a miracle baby.\"\nMilajha was shot in the head as she sat in a car with her parents. Police said a black car pulled alongside at an intersection and the driver and a passenger in that vehicle opened fire before driving off.\nDetectives in Kent initially suggested road rage as a motive, but Commander Jarod Kasner backed off from that assessment Friday.\n\"We are looking at that, but other possible reasons as well,\" said Kasner.\nPolice didn't provide further details on what they believe led to the shooting.\nGrant concurred that it was not road rage. She said the family is frustrated that police have not released more information.\n\"This was done in broad daylight and you guys don't have no information?\" said Grant. \"A bunch of people seen this and we wake up to no new information. But my niece is laying on a hospital bed fighting for her life. Somebody knows something. Get it out there.\"\nGrant made a plea to anyone who has information about the shooters.\n\"What would you do if it was your family? What would you do if this was your child, your niece, your nephew, your grandchild? What would you do? How would you feel?\" said Grant.\nAnd Grant had a message for the shooters.\n\"People decided to get up and say, 'Let's lock and load our guns and shoot up a car … and forget whoever's in the car. How are you guys sitting back feeling right now knowing that you guys didn't get nobody but a 1-year-old innocent child?\" said Grant. \"My family is torn apart right now. All we want is answers.\"\nKING 5's Chris Ingalls and the Associated Press contributed to this report."}