{"uri": "http://www.kirotv.com/news/news/kent-release-new-information-fatal-shooting-1-year/nk8ZB/", "title": "Kent police say fatal shooting of 1-year-old was gang-related", "dct": "Mon, 04 May 2015 10:24:00 GMT", "id": "eb56fab4d4f744c4ceec82e0e9389d9e", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nUPDATE, MAY 20: Four persons of interest in the shooting were arrested on unrelated charges. Click here to read details about Malijah's case.\nORIGINAL POST: Kent police released information about a “vehicle of interest” as well as a photo of the suspect vehicle in a drive-by shooting in Kent that killed a 1-year-old girl. Officials say they have confirmed the shooting was gang-related.\nQuick Facts:\n1-year-old Malijha Grant shot on Apr. 16 while in car with parents\nBlack four-door sedan with tinted windows is suspect vehicle\nPolice say shooting is connected to 12-15 others between Seattle and Tacoma\nParents say they are not in gang\nThe victim, Malijha Grant, died after she was shot last month as she rode in a car with her parents on April 16. Another car had pulled up alongside them and two people inside opened fire. She died two days later.\nKent police said the shooting is connected to a series of 12 to 15 gang-related shootings that have occurred between Seattle and Tacoma and the cities in between in the month before the girl was killed.\nAt an 11 a.m. news conference Monday, investigators released still images of the suspect vehicle that was caught on nearby surveillance fleeing from the crime scene. It is believed to be a black four-door sedan with dark tinted windows. The make and model are not yet known.\nPolice said they also want to talk to the driver of a car that was behind the suspect vehicle. It is not known if the vehicle was involved in the crime, but police want to speak to any possible witnesses.\nThe car is a gray four-door 2007 Pontiac Grand Am, with Washington license plate 678ZRL. It is noted as having a burned out and damaged rear passenger side brake light. According to investigators, it was stolen in Renton on Apr. 10 and has not been recovered.\nPolice said whoever was in the car witnessed the shooting but did not stop and has not made attempts to contact police to be interviewed.\nPolice said property that was in the stolen vehicle has been recovered in the Skyway area of King County, but the car itself has not been recovered.\nThe victim’s parents attended the news conference, angry that their daughter's killer remains free.\n“The media is painting me to be a hardened gangster and I’m not. I’m a grieving father. I mean what gangster gets respect out of this,” he said, gesturing toward photos of his dead daughter. “My family has been a target of gang violence that has nothing to do with us,\" he said.\nNo arrests have been made, but police say they have leads and they know that members of the public have information about the shooting.\nAnyone with information about the crime is asked to call 911 or contact the Kent Police Department tip line at 253 856-5808. Crime Stoppers of Puget Sound is also offering a cash reward of $1,000 for information leading to the arrest and charges of the suspects involved. Call the hotline anonymously at 1-800-222-TIPS (8477) or submit the information online at www.crimestoppers.com."}