{"uri": "http://www.channel3000.com/news/2-remaining-suspects-in-shooting-of-5yearold-taken-into-custody/37749838", "title": "Court document: Shooting that killed 5-year-old was gang retaliation", "dct": "Tue, 02 Feb 2016 01:18:00 GMT", "id": "a54ae8f36f7aaa5fe99732482c64b6c0", "content": "Photos courtesy Beloit Police Department\nBELOIT, Wis. - Two men wanted in connection with the shooting death of a 5-year-old in Beloit are now in custody, according to a release from Beloit police.\nPolice said tips led them to Eric Salazar-Mota and Sergio Ortiz-Raygoza, who were found outside Wisconsin. Both will be extradited to Rock County.\nLast week, 18-year-old Hugo Martinez, of Beloit, was arrested in connection to the shooting.\nIsaac W. Torres, 24, was arrested in Illinois Wednesday, and is the fourth suspect in the shooting, officials said.\nThe four men are faced with first-degree homicide charges, officials said.\nAccording to a criminal complaint, six people were in the car during the shooting. One of the men in the car told police the shooting was a retaliation for the death of a La Raza gang member and brother of Ortiz-Raygoza last year in Beloit.\nThe shooting was allegedly done by a Latin King gang member. Police have previously said Ramos' dad had former ties to the Latin Kings.\nThe criminal complaint also said Ortiz-Raygoza was the driver of the car and the one who orchestrated the shooting. A police informant named Martinez as the shooter.\nBeloit police said Thursday they believe they recovered a suspect vehicle in western Rock County.\nAfter receiving tips on their dedicated tip line, Beloit police said they found a red Chevy Blazer they believe may be connected to Austin's death and Salazar-Mota and Ortiz-Raygoza. The vehicle is being processed for evidence.\nThe shooting was reported near the intersection of Shopiere Road and Prairie Avenue at about 7:15 p.m. Jan. 22. At least one shot struck Austin in the abdomen. He was pronounced dead at the hospital.\nPolice said they believe Austin Ramos Sr., the 5-year-old's father, was the intended target of the drive-by shooting.\nPolice have set up a dedicated tip line for the case: 608-364-6865."}