{"uri": "http://www.wcyb.com/news/one-dead-and-four-injured-in-volunteer-parkway-shootings/40399320", "title": "One dead, four injured in Volunteer Parkway shootings", "dct": "Thu, 07 Jul 2016 17:30:00 GMT", "id": "c51c20676145ffe2341250e346b66709", "content": "We have an update on the overnight shootings on Volunteer Parkway in Bristol, Tenn. One person is dead and four others are injured.\nAccording to the Bristol Herald Courier, the person killed was Jennifer Brewer Rooney, 44. She was a newspaper carrier traveling to pick up papers Thursday morning. She was shot, apparently at random. Her vehicle went over an embankment.\nAlso shot several times and wounded was the front desk clerk at Days Inn on Volunteer Parkway. That's according to Kiran Patel, manager of the motel.\nOne police officer was slightly wounded and was among the four others taken to the hospital. That officer has been treated and released.\nAccording to police, the shooter had at least two weapons and fired shots at the Days Inn and at several vehicles traveling on Volunteer Parkway.\nConcerning the fatal victim, the Bristol Herald Courier released the following statement:\n\"Based on information we have received, we can confirm a Bristol Herald Courier newspaper carrier is one of the victims in last night's shooting on the Volunteer Parkway. We are shocked and saddened that this individual lost their life in this senseless act of violence. Jennifer Rooney was a wonderful person. Her family is in our thoughts and prayers.\"\n---\nAccording to authorities, Bristol, Tenn. police responded to an active shooter on Volunteer Parkway between Weaver Pike and Hill St. shortly after 2 a.m. Thursday. According to police, a man shot at vehicles and then exchanged gunfire with officers.\nThe shooter was taken to the Bristol Regional Medical Center. One of the officers involved had minor injuries and other officers were not injured. Additional victims from the public were also taken to the hospital. There is no word yet on how many victims there are.\nThe Sullivan County Sheriff's Office along with the Bristol Virginia Police Department are assisting the Bristol Tennessee Police Department with the incident. There are multiple crime scenes along Volunteer Parkway that are now secured. Police said public safety has been restored to the area."}