{"uri": "http://www.mlive.com/news/grand-rapids/index.ssf/2013/03/new_roosevelt_bar_where_4_were.html", "title": "New Roosevelt Bar, where 4 were shot last month in Grand Rapids, to close under deal with city", "dct": "Tue, 12 Mar 2013 12:06:00 GMT", "id": "6d3503a747b725f4394e3dea98aad67a", "content": "GRAND RAPIDS, MI – A hearing on non-renewal of New Roosevelt’s liquor license has been cancelled due to a settlement between the city and the bar’s owner.\nGrand Rapids City Commission on Tuesday, March 12, approved a deal that will close the bar at 1447 Grandville Ave. SW immediately. The agreement enables bar owner Rosalia Rivera to keep possession of her Class C liquor license with intent to sell it.\nRivera was not immediately available for comment.\nCity Attorney Catherine Mish said the settlement permits Rivera to retain “financial interest in the liquor license, but the city solves the public safety problem that was in existence at that location.”\nRELATED: Roosevelt Park Neighborhood Association leader says 'bad neighbor' should close\nGrand Rapids police and the Roosevelt Park Neighborhood Association sought non-renewal of the bar's liquor license due to violence on the property. Three men and a woman were hit by bullets when someone fired at a back door of the bar where patrons were trying to leave around 2 a.m. Feb. 22. Two men were shot in the leg, another in the foot and a woman was hit in the neck. None of the injuries were life-threatening.\nIn November, 27-year-old Grand Rapids man Wellington Guevara was shot and killed outside the bar at 2 a.m.\nRELATED: Grand Rapids bar may lose liquor license after shootings that left 1 dead, 4 hurt\nThe agreement also gives Grand Rapids some additional authority over transfer of the license, if it gets sold for use within the city. For example, Rivera would have to get the city’s pre-approval of any new licensee. The city also may be able to deny approval based on a new licensee's planned hours of operation and amount of food to be sold, relative to alcohol sales.\nCity leaders said the New Roosevelt closing could work similar to transfer of the liquor license once held by Margarita Grill, which closed in 2008 after a pattern of violence."}