{"uri": "http://www.journal-news.com/news/documents-outline-family-feud-hamilton-shootings/yhoqKzxjnzSEhJ1PKYcM8H/", "title": "Documents outline family feud in 2 Hamilton shootings", "dct": "Thu, 06 Oct 2016 00:00:00 GMT", "id": "3b4edc563a18f358270ea70d253307b4", "content": "Feuding families, ties to a street gang and a $5,000 payment were all part of two fatal shootings this summer in Hamilton, according to court documents obtained Thursday by the Journal-News.\nTrial dates could be set this month for the eight people — four of whom face the death penalty — charged in the fatal shooting at Doubles Bar and a fatal drive-by shooting on Central Avenue.\nCornell McKennelly II shot and killed Kalif Goens at about 2 a.m. July 24 near the Main Street bar, according to Butler County prosecutors.\nDuring the same shootout, three other people shot and wounded members of the Gilbert family, according to court documents:\nRodrick Curtis Jr. shot and wounded Tavaris Gilbert\nMondale Goens — Kalif’s brother — shot and wounded Katrina Price and Jariaus Gilbert\nCory Cook II shot and wounded Orlando Gilbert, who was killed days later in the Central Avenue drive-by shooting\nAfter the Doubles Bar shooting, Michael Grevious II recruited Zachary Harris to kill Orlando Gilbert for $5,000, according to court documents.\nHarris and two ex-convicts, Tony Patete and Melinda Gibby, drove about 90 miles from Fairfield County, Ohio, to Butler County and spent several days driving around Hamilton in search of their target.\nThen on Aug. 3, a Chevrolet pickup truck driven by Gibby pulled up next to a black Ford Mustang occupied by Orlando Gilbert and Todd Berus.\nPatete, the front seat passenger of the truck, opened fire with an AK-47 multiple times, killing Gilbert and Berus, according to court documents.\nProsecutors claim that Harris orchestrated the drive-by shooting from the backseat of the pickup truck.\nThe defendants are associated with either the Goens or Gilbert families, who are “feuding factions in Butler County,” Assistant Prosecutor Brad Burress wrote in the court document.\nBoth the Goens and Gilbert families have members that are part of the “Blood” street gang, according to Burress, and many witnesses have told Hamilton police that they fear for their safety if they cooperate with police.\nFor those reasons, prosecutors want to keep the identities of 12 witnesses confidential, according to the court documents.\nIf that request is granted by a judge, the identities of the witnesses, who gave written, audio and video statements, would be kept secret until the first day of the trial.\nThe four defendants from the Double Bar shooting are scheduled to be in court today, where their trial dates will likely be set. They are:\nCornell McKennelly II, 37, of Franklin St., Hamilton, charged with murder\nMondale Goens, 21, of Maple Ave., Hamilton, charged with two counts of felonious assault\nRodrick Curtis Jr., of North 7th Street, Hamilton, charged with felonious assault\nCory Cook II, 23, of 9th Street, Hamilton, charged with felonious assault\nThose facing the death penalty in the shootings are scheduled to be back in court Oct. 18. They are:\nZachary Harris, 24, of Columbus, charged with two counts of aggravated murder\nTony Patete, 23, of Newark, two counts of aggravated murder\nMelinda Gibby, 35, of Lancaster, two counts of aggravated murder\nMichael Grevious II, 23, of Maple Ave., Hamilton, one count of aggravated murder"}