{"uri": "http://www.cincinnati.com/story/news/2016/07/24/1-dead-several-wounded-bar-shooting/87499000/", "title": "Chief: Man fatally shot brother in Hamilton bar", "dct": "Sun, 24 Jul 2016 00:00:00 GMT", "id": "8ec4a66539a472e8678aca684cd201b7", "content": "A feud between families could be behind a deadly Sunday night shooting at the Doubles Bar and Nightclub in Hamilton, police said.\nHamilton Police Chief Craig Bucheit characterized the aftermath of the shooting, which started some time before 2 a.m. and led to 50 911 calls, as a \"chaotic scene\" in a Monday afternoon press conference.\nAt the scene, Mondale Goens, 21, was arrested in connection with the shooting that left his brother Kalif Marquis Goens, 22, dead and seven others wounded. It's not yet clear if Goens intended to shoot his brother, Bucheit said.\n\"I will tell you, of the eight people who were injured, three of those were from one family -- from the Gilbert family -- they were all from the same family,\" Bucheit said. \"We're looking into the possibility that there was some -- some feud or some difference between those groups.\"\nAll of the seven injured are expected to survive with some already treated and released, Bucheit said.\nGoens was charged with one count of murder and two counts of felonious assault in connection with the shooting. Bond was set at $2 million and Goens is expected to be arraigned Aug. 1 before Hamilton Municipal Court Judge Daniel Gattermeyer, court officials said.\nThe frantic 911 calls released to the media indicated between 15 and 20 shots fired. Bucheit, however, could not yet confirm the number of shots.\nOne caller could be heard screaming as she fled the bar and another was asked by the dispatcher if she could see the shooter.\n\"I'm under the table, I'm not getting up,\" the caller said. \"There's gunshots and somebody got shot.\"\nThere were between 100 and 200 people in the club when the gunfire erupted, Bucheit said.\n\"We have received cooperation,\" Bucheit said. \"But given the number of people who were present -- the number of witnesses who were there -- the cooperation, frankly, is shameful.\"\nBucheit said he's not sure how many shooters there were, but \"so far we've identified one; there could be more.\"\nDoubles, located less than three miles from the Hamilton Police Department, is a \"problem establishment,\" Bucheit said.\n\"I met with the management team yesterday personally and we're going to follow up with them and address those issues,\" Bucheit said. \"This type of incident is completely unacceptable and will not be tolerated and we're going to work with them to make sure an event like this does not occur again.\"\nThe bar does not have surveillance cameras, Bucheit said.\nBucheit asked for the community's help in gathering more information about the shooting and to call the Investigative Division of the HPD at 513-868-5811, Ext. 2002."}