{"uri": "http://www.wlwt.com/news/family-insists-doubles-nightclub-shooting-suspect-did-not-murder-brother/40896956", "title": "Family insists Doubles nightclub shooting suspect did not murder brother", "dct": "Tue, 26 Jul 2016 22:36:00 GMT", "id": "b1a3ff3ce42ebc0dbf541f062647cce6", "content": "HAMILTON, Ohio —\nA Hamilton grandmother wants to set the record straight when it comes to her grandson.\nTwetny-one-year-old Mondale Goens is accused of killing his brother, 22-year-old Kalif Goens, inside a Hamilton nightclub.\nThe family said there's way more to the story.\nAnn Ridley said this is not a case where Mondale Goens walked into Doubles Nightclub and started shooting.\nShe said both of her grandsons were at the club together with friends Saturday night.\nRidley believes a feud between two groups led to eight people getting shot, including Kalif Goens, who was killed.\n\"He was a dancing machine. He was very comical. He was the life of the party, and Kalif loved everybody and got along with everybody,\" Ridley said.\nHis family said everyone loved him.\n\"Kalif, the funniest guy you ever want to meet,\" said Michael Grevious, Kalif Goens' stepfather.\nAt Hamilton High, his alma mater, Kalif Goens' family said he was homecoming king runner-up. His biggest fan and best friend since childhood was his brother, Mondale Goens, their family said.\n\"They would not ever hurt each other. They stood up for each other, and everybody out there knows Mondale would not have did that to his brother,\" Ridley said.\nMondale Goens is charged with Kalif Goens' murder. Impossible, their stepfather said.\n\"Mondale is not a monster. Mondale did not kill his brother, no,\" Grevious said.\nOne woman who called 911 said she heard at least 20 shots fired inside the club Sunday morning. Hamilton police said Monday they had connected at least three of the victims to Mondale Goens.\nChief Craig Bucheit said there may have been more than one shooter. The Goens family said there had to have been.\n\"Mondale's in jail for this, but all of these bullets that were flying, all of these casings and stuff, that just lets you know somebody else was in there firing too,\" Ridley said.\nRidley believes members of another family who didn't like her grandkids were the ones behind the chaos. With an estimated 100 to 200 people inside the club when the shootings happened, she's urging witnesses to call police.\n\"People know out there. They just got to be man, woman enough to stand up and come forward,\" Ridley said.\nShe said she's tired of hearing people say, \"Don't snitch.\"\n\"Don't snitch. Don't snitch, ya know, that is so childish, ya know, and you've got people's lives at stake,\" Ridley said. \"I think that's why people are getting away with so much crime because they don't want to snitch.\"\nHer family is now on a mission to get people to fess up.\n\"They just need to tell the truth,\" she said. \"Cause I ain't going nowhere. I'm going to fight this til the end, that's what I'm going to do. Both of them are my babies.\"\nPolice called this a very complex investigation. Bucheit also said the cooperation he's getting from witnesses is shameful.\nThey're relying on witnesses to come forward, especially since he said there are no surveillance cameras inside the club.\nThe seven others who were shot are all expected to be okay.\nOf those, three were from the Gilbert family. Police are looking into the possibility of an ongoing feud between the Gilberts and Goens."}