{"uri": "http://www.wtvm.com/story/34016281/mpd-overnight-recap-16-year-old-shot", "title": "MPD Overnight Recap: 16-year-old shot", "dct": "Fri, 09 Dec 2016 17:02:00 GMT", "id": "b06a64a18fdba0d33c291fb2a90f1e46", "content": "MOBILE, AL (WALA) -\nThis is a part of the daily crime report distributed by the Mobile Police Department. These crimes occurred on December 8, 2016.\nAssault 1st / Burglary 1st 7:58 a.m. Anne Place Apartments, 2284 Schillinger Rd.\nOn Thursday, December 08, 2016, at approximately 7:58 a.m. officers responded to Anne Place Apartments located at 2284 Schillinger Road for a report of Two Individuals Shot. The female victim stated her ex-boyfriend, arrested person, Lakendrick Dubose, 27, entered her apartment and physically assaulted her. During the assault a 16-year-old male juvenile present at the apartment exchanged gun fire with Dubose. Both Dubose and the juvenile male were struck and were transported to a local hospital. Dubose was treated, released and later arrested. The juvenile male victim is currently listed in stable condition.\nTheft of Property 3rd/ Receiving Stolen Property 3rd 5:00 p.m. Fat Boy Chopper, 5956 Three Notch Rd.\nOn Thursday, December 08, 2016, at approximately 5:00 p.m. officers responded to Fat Boy Chopper located at 5956 Three Notch Road for a Theft of Property report. The reportee stated arrested persons, Thomas Anderson, 53, and Terry Walker, 54, unlawfully removed property from the business.\nBurglary 1st / Menacing / Possession of Marijuana 9:21 p.m. 1900 block of Belle Cour Dr S\nOn Thursday, December 08, 2016, at approximately 9:21 p.m. officers responded to the 1900 block of Belle Cour Dr S for a report of Domestic Violence. The victim stated her ex-boyfriend, arrested person, Jacorey Williams, 19, forced entry to the residence while armed with a handgun and threaten to cause her physical harm. Williams was in possession of Marijuana at the time of his arrest.\nAll content © 2016, WALA; Mobile, AL. (A Meredith Corporation Station). All Rights Reserved."}