{"uri": "http://www.whec.com/news/stories/S4040886.shtml?cat=565", "title": "Rochester Police Department: Multiple people shot in Rochester", "dct": "Fri, 23 Sep 2016 12:36:00 GMT", "id": "06084c3828a94db0c8faed6307a94023", "content": "The Rochester Police Department confirms that eight people were shot and one person is dead after a shooting on State Street Sunday morning.\nThe shooting happened shortly after 2 a.m. Sunday at the Mexican Village bar located at 547 State Street in the city.\nPolice heard the shots in the area of State Street and Lyell Avenue, and were quick to respond to the scene. None were witnesses to the actual shooting itself.\nAccording to investigators, the shooting likely stemmed from a fight that started inside the bar. Once the fight went outside multiple shots were fired. The bar owner told News10NBC that there was not a fight inside the bar all night. He says the shooters were waiting outside of the bar and then proceeded to open fire.\nA 29-year-old man of Rochester was found dead at the scene. Six other victims were located in the area of the nightclub and all were transported to Strong Memorial Hospital.\nOne additional victim was dropped off at Rochester General Hospital in a private vehicle. All seven surviving victims appear to have non-life threatening injuries.\nThe victims range in age from 21 to 30 years of age. Seven of the victims are male, one victim is female.\nStrong Memorial Hospital tells us that two of the patients they received are in guarded condition, two are in satisfactory condition, and two have been discharged.\nAccording to police, one of the male victims, 26, is in guarded condition. The other people who were shot do not have life threatening injuries.\nAt a Press Conference that was held Sunday afternoon, Rochester Police said that there is no evidence at this time to indicate that there is a danger to public safety related to this incident.\n\"As we strive to make our city better, all of our efforts begin with a love and appreciation for human life and the knowledge that every man, women, and child has a right to reach their full potential,\" Mayor Lovely Warren said in a statement issued on Sunday. \"We cannot and will not tolerate this level of depravity and wanton disregard for human life.\"\nPolice also said that there were about forty people in and around the vicinity of the shooting, and that they are still working on interviewing people to gather more information.\nPolice say that they are also processing the crime scene and looking over physical evidence, as well as taking additional investigative steps.\nThe investigation remains highly active, and police urge that anyone with any information regarding this crime to contact them at 911 or to call Crimestoppers at 423-930.\nNews10NBC will continue to track any new developments and bring you updates as we learn them."}