{"uri": "http://www.whec.com/news/stories/S4042535.shtml?cat=565", "title": "State St. mass shooting victim discusses scary moments as shots rang out", "dct": "Tue, 09 Feb 2016 18:00:00 GMT", "id": "eb1242472d17cf786bb304ddbfeb36b8", "content": "Rochester police have released the names of eight victims who were shot in a mass shooting Sunday morning.\nErnesto Ayber, 29, was killed during a shooting outside the Mexican Village bar on State Street early Sunday morning. Seven others were injured, including:\nJeffrey Benson, 21 of Rochester\nJorge Colon, 26 of Rochester\nJose Lugo, 21 of Rochester\nElsie Berrios, 25 of Rochester\nRobert Garcia, 30 of Rochester\nDominic Rosario, 23 of Rochester\nDavid Rosario, 26 of Rochester\nRobert Garcia, Dominic and David Rosario are listed in satisfactory condition. All others were treated and released from the hospital.\nJeffrey Benson says the first shots were fired in a parking lot across from the bar. He was working security that night and says he saw fighting, but never thought it would turn into a shootout.\n\"They start shooting and everything, and the person who dies, gets shot right in front of me,\" says Benson. \"Then I get hit in the arm.\"\nBenson says he was trying to break up a fight when gunfire erupted outside the Mexican Village bar and eight people were shot -- including Benson.\nSpotts: \"What's going through your mind as this is happening?\"\nBenson: \"Not again. I want to go home to my daughter. I was kind of scared, honestly.\"\nThat's when Benson raced for cover. He says two people were shooting at each other before speeding away in a car.\n\"I got up to move back to the bar and then saw another car coming down the driveway with someone sitting in the passenger window sitting down with a gun aimed out the window,\" Benson says. \"So I go back to my cover and I see that he's firing at the bar towards the bar at people running back and forth from the bar.\"\nWe spoke with two of the other victims. Neither wanted to go on-camera, one was shot in the ankle as he was running away.\n\"They're innocent people,\" says Benson. \"I saw them come there just to have fun and saw them all bleeding. I was like 'what's going on? Why? Who would do this?'\"\nBenson says the men who were shooting had not been to the bar that night. He says he didn't recognize any of them. We found out the bar does have metal detectors and won't allow weapons of any kind inside.\nNo arrests have been made yet in the case at this time. Police ask anyone with information to call 911 or Crime Stoppers at 585-423-9300."}