{"uri": "http://www.pnj.com/story/crime/2014/03/22/charges-filed-against-father-in-death-of-west-pensacola-toddler/6720403/", "title": "Charges filed against father in death of West Pensacola toddler", "dct": "Fri, 21 Mar 2014 00:00:00 GMT", "id": "2295cfd19fcb2b874c63e3d29116735b", "content": "A West Pensacola man has been charged in the self-inflicted shooting death of his 2-year-old son, the Escambia County Sheriff’s Office announced Friday.\nSheldon Cleavon Salter, 28, is facing one count of culpable negligence in the March 1 death of his son, Sheldon Salter Jr., according to his arrest report.\nCulpable negligence implies that Salter acted acted without reasonable caution and put another person at risk of injury or death. There was a thorough investigation of the circumstances of the shooting before the state decided to file charges, Assistant State Attorney Greg Marcille said Friday.\n“In situations like this, we look at the facts of each individual case,” Marcille said. “If a weapon is left within easy reach or access of a child and it results in the injury or death of a person, we take those situations very seriously.”\nSalter told deputies that on the day of the shooting, he, his son and the child’s mother, Jenna Fitzhugh-Thomas, were watching TV at their home in the 1500 block of Fairfield Drive, the report said.\nWhile the parents were sitting on a couch, they sent Salter Jr. to get a fresh diaper out of the family bedroom, Salter said in the report. The toddler entered the bedroom and found Salter’s loaded Glock pistol between a mattress and box spring.\nSalter said that after a minute or so of waiting for the child to return, he started to move toward the bedroom to check on him. Before he could get to the bedroom, he heard a gunshot, he said in the report.\nHe found the child lying on the bed with a gunshot wound to the head and the gun on the floor near an open closet, according to the report. Fitzhugh-Thomas immediately contacted the Sheriff’s Office.\nDuring their crime scene investigation, deputies found a bag of marijuana on the couch and a digital scale with cocaine residue in the refrigerator, the report said.\nSalter was charged with one count of culpable negligence because he left the firearm in a state where it was capable of inflicting the injury that resulted in his son’s death, a Sheriff’s Office news release said. He was also charged with one count of possession of drug paraphernalia.\nThe negligence charge is a third-degree felony punishable by up to five years in prison upon conviction, Marcille said. He also said Fitzhugh-Thomas will not be charged in the incident.\n“At this time, the evidence we have indicates that Mr. Salter is the individual who handled the weapon,” Marcille said.\nSalter was processed at Escambia County Jail on Thursday night and released shortly afterward on $17,500 bond, according to jail records.\nHe is scheduled to appear in court April 10."}