{"uri": "https://www.abqjournal.com/793110/interpol-takes-custody-of-mexican-man-wanted-for-killing-wife-4-daughters-in-roswell.html", "title": "Interpol takes custody of man wanted in the killing of his wife, 4 daughters in Roswell", "dct": "Thu, 16 Jun 2016 17:17:00 GMT", "id": "7e53d75d9477f6a366d4249b29b687a2", "content": "ALBUQUERQUE, N.M. — The Mexican man police suspect of fatally shooting his wife and four daughters in their Roswell home is headed back to the U.S. after the launch of formal extradition proceedings, officials said Thursday.\nJuan David Villegas-Hernandez was initially held by Sonora state police on Sunday — a day after police in Roswell said the 34-year-old shot and killed his wife, Cynthia Villegas, and their daughters — ages 14, 11, 7 and 3.\nRoswell police waited to confirm the identity of the man in Mexican police custody as initial reports indicated he had attempted suicide and was in a hospital. They announced on Monday that they could confirm Villegas-Hernandez, 34, was in Mexican police custody.\nOn Tuesday, Gov. Susana Martinez met with relatives of the victims and said her office would work with federal officials and authorities in Mexico for the quick extradition of Villegas-Hernandez.\nBut on Thursday, state Attorney General Hector Balderas, whose office is in charge of all extraditions to the sate, said Villegas-Hernandez had just been taken into the official custody of Interpol for formal extradition proceedings.\n“I am thankful for the hard work of our state, federal, and international partners, and Villegas-Hernandez is now in the custody of Interpol in Hermosillo. He is being processed and will then be transferred to Mexico City pending extradition,” Balderas said in a statement.\nVillegas-Hernandez returns to face grand jury indictments on five counts of first-degree murder for the shooting deaths of his wife, 34, and the four girls, Yamilen, 14, Cynthia Janet, 11, Abby, 7, and Ida, 3. A grand jury also indicted him on four counts of intentional abuse of a child resulting in death for each child, said Roswell police spokesman Todd Wildermuth.\nCynthia Villegas had recently asked for a divorce, police have said.\nWildermuth said his department has handed off extradition effort to the state AG’s Office.\n“We’ve put it in their hands,” he said.\nAuthorities have said Villegas-Hernandez has dual citizenship in the United States and Mexico, according to the Associated Press, so he must be extradited and cannot be deported.\nThe Associated Press contributed to this report."}