{"uri": "http://www.timesfreepress.com/news/local/story/2016/mar/02/apison-toddler-accidentally-shot-head-medical-examiner-says/353067/", "title": "Apison toddler accidentally shot himself in the head, authorities say", "dct": "Wed, 02 Mar 2016 00:00:00 GMT", "id": "869e697b105151f6c74fa1e9fad378fd", "content": "This story is developing and will be updated.\nThe 3-year-old boy killed Monday was playing with a gun when he accidentally shot himself in the head, according to the Hamilton County Sheriff's Office.\nGavin Pittman was inside his family's minivan when he shot himself, according to the sheriff's office. The van was parked outside the family's home at 4724 Gates Lane in Apison.\nThe sheriff's office has not said whether anyone else was in the van with Gavin when he found the gun or what sort of gun was used.\nThe boy's family declined to speak with the Times Free Press on Monday. Sheriff's spokesman Matt Lea has not said whether investigators are pursuing any criminal charges against adults.\nThe family has lived at the Apison home for several years, neighbors said.\n\"They definitely care about those kids,\" Janet McElroy said on Monday. \"They love their kids.\"\nOn Tuesday, advocates for a bill that would make it a crime for adults to leave loaded weapons accessible to children pointed to Gavin's death as an example of why the law is needed.\n\"Just yesterday in Apison, Tenn., outside of Chattanooga, a 3-year-old was shot and killed in his family's car outside the family's home,\" Beth Joslin Roth, policy director for the Safe Tennessee Project, told reporters in a Legislative Plaza news conference.\n\"We are awaiting more details\" on the Apison death, Joslin said, \"but if this child accidentally shot himself or was shot by a sibling, that would be the second child so far in 2016 that has died in this way. Three other Tennessee children have been injured in unintentional shootings so far this year.\"\nStaff writer Andy Sher contributed to this report.\nStay with the Times Free Press for more on this developing story."}