{"uri": "http://www.wgrz.com/news/crime/buffalo-teen-charged-with-shooting-8-people/108312515", "title": "Buffalo teen charged with shooting 8 people", "dct": "Tue, 29 Mar 2016 00:00:00 GMT", "id": "66b53fa895f608b6bfc90a392d1f51c4", "content": "BUFFALO, NY - A Buffalo teen is being accused of shooting eight people, killing two of them, since October 2014.\nDiamond Lewis, 19, is accused of shooting eight different people at four different locations in Buffalo. Two of those victims died.\n\"This one individual negatively affected a lot of lives throughout the community,\" said Mayor Byron Brown.\nInvestigators say the first homicide took place October 14, 2014. The victim, David Skipper, Jr., 22, was shot on Erb Street.\nThe second homicide occurred on Warren Street June 6, 2015. Alonzo Scott, 18, was one of five people shot that day. Scott died, and another man was paralyzed.\nOn August 13, 2015, Lewis is alleged to have fired several shots from a vehicle at Playter and Kent Streets in Buffalo, targeting a man, but striking the 18-year old female bystander.\nOfficials say a 13-year-old girl was shot on January 25, 2016 on Fillmore Avenue when Lewis allegedly fired into a group of people.\n\"The grand jury has accused Mr. Lewis of shooting what anybody would say are innocent victims and that truly is an injustice that we are working so hard to eradicate,\" said interim district attorney Michael Flaherty.\nLewis was arrested the next day at ECMC while being treated for a superficial gunshot wound.\n\"My client and his family maintain his innocence with regard to everything that's gone on,\" said Jeffrey Santoro, the defense attorney for Lewis.\nLewis is charged with murder and several assault and attempted murder charges. He has been remanded to jail without bail. He faces up to 25 years to life on each murder count and 200 years on the other charges.\nPolice believe that Lewis is connected to other crimes in the city.\nPolice are still looking for information related to the crimes Lewis is accused of -- they say there could be others he allegedly conspired with. If you have any information police urge you to give them a call, you can leave them an anonymous tip."}