{"uri": "http://tbo.com/pasco-county/multiple-deaths-after-shooting-in-new-port-richey-20150209/", "title": "Sheriff: Moon Lake slayings may be ‘targeted hit’", "dct": "Mon, 09 Feb 2015 00:00:00 GMT", "id": "807b45b98c992c1b8e87d3ab5ca967a3", "content": "Moon Lake shooting\nMOON LAKE — Three people were killed early Monday in a possibly drug-related incident at a mobile home in the Moon Lake Estates community, the Pasco County Sheriff’s Office said.\nAs authorities sought two suspects Monday, Sheriff Chris Nocco said the killings “may be a targeted hit,” adding that the agency seeks help from the public in learning more.\n“Anybody who commits crimes like this could harm others,” Nocco said. “It’s a very unfortunate situation.”\nFound dead inside the mobile home at 9552 Adler St. were Justin Huckeby, 25, and Shane Newland, 42. The sheriff’s office had not released the identity of the third victim late Monday, saying deputies were still working to notify next of kin.\nThe sheriff’s office reported it was searching for two suspects: 26-year-old Christopher Lee Duncan and 38-year-old Dora Delgado. The pair are considered armed and dangerous, deputies said, and were last seen driving a blue Ford SUV with Florida license plate CDA A98.\nDeputies responded just before 5 a.m. to reports of shots fired near Banbury Avenue and Adler Street, records said. The trailer is about 100 yards east of Moon Lake Road.\nArden Anderson, who owns the trailer, said Newland moved into it about seven months ago.\n“One of our neighbors told us something happened this morning, but I don’t know anything,” Anderson said. “He’s been a good tenant; always paid his rent on time. They were in a band, so there was some noise sometimes but that’s about it.”\nNewland is well-known to law enforcement. His first arrest in Pinellas County for dealing in stolen property was 25 years ago. He also was convicted in Pinellas for dealing marijuana in 1993.\nNewland had been in and out of the Land O’ Lakes Jail since 1998 on charges ranging from obstruction to domestic battery to possession of marijuana. His last convictions in 2011 were for aggravated assault, burglary and felony theft.\nIn a June 2014 Facebook post, Huckeby talked of being off drugs for four months and striving to do better for his children.\nHuckeby had been arrested several times in Pasco since 2010 on charges ranging from probation violation, loitering or prowling, domestic battery, and possession of cocaine, jail records show.\nBilly Huckeby Jr., described his younger brother as a “magnificent person” with a penchant for blues music and talent for guitar.\n“He was very non-selfish, and he never let people know about it,” he said.\nAccording to Justin Huckeby’s Facebook profile, he was an Oklahoma native, as well as a fan of the Pittsburgh Steelers, Boston Celtics, San Antonio Spurs and Oklahoma City Thunder.\nOn a nearby street, resident Johnny Antonio said he was up at 5 a.m. Monday, but didn’t hear any gun shots.\n“Usually, it’s like the Fourth of July out here,” he said. “You have to worry if you don’t hear any gunshots. You have to keep everything around here tied down.”\nAt the Sunoco convenience store at Banbury and Moon Lake Road, Bruce Clark stood in the shade Monday morning, as deputies and law enforcement officials milled around the area. The trailer on Adler is about 100 yards from the store.\nClark said the neighborhood is ripe with crime.\n“I was up at 5 o’clock, but I didn’t hear any gunshots,” Clark said. But by the time he walked to the convenience store, neighbors already were filling him in.\n“News travels fast across Moon Lake,” he said.\nTracy Adkins, 46, of Hudson, said she knew the mobile home’s residents.\n“I don’t know if there was drugs in that house or not,” she said. The occupants never told her that they feared for their safety, she said.\nWith sheriff’s investigators working the scene Monday, the victims’ friends and family members met near the convenience store, where they were briefed by authorities. Rain poured as they waited for information.\nThe community has known better times.\nNotables such as Joseph Kennedy, baseball legend Babe Ruth and financier Cornelius Vanderbilt, as well as Hollywood actresses Gloria Swanson, Lana Turner and Lillian Gish were known to stay at Moon Lake Gardens and Dude Ranch, a log cabin-style resort commonly known as “the lodge.”\nThe lodge burned down in 1996.\nNowadays, the area of roughly 4,000 people is known for its abundance of single-wide mobile homes, many of which are dilapidated. The area has a history of generating tragic news.\nIn May 2010, a 1-week-old boy was mauled to death by a pit bull mix while his 16-year-old mother dozed in the same room at their home in Moon Lake. Six months earlier, a 22-month-old boy was killed by a Rottweiler-Labrador mix at a birthday party in the community.\nMoon Lake Road, itself, has claimed several lives in recent years.\nBetween January 2010 and August 2013, seven people were killed in vehicle-, bicycle- and pedestrian-related crashes, according to a Florida Department of Transportation study.\nMore than $2 million in safety improvements on the road have since been made by the county.\nAnyone with information about Monday’s killings can submit an anonymous tip on the sheriff’s office website or call (800) 706-2488.\nReporter Laura Kinsler contributed to this story.\nkmorelli@tampatrib.com\n(813) 259-7760\ngfox@tampatrib.com\n(813) 371-1860"}