{"uri": "http://www.itemlive.com/news/police-weekend-shootings-appear-targeted/", "title": "Police: Weekend shootings appear ‘targeted’", "dct": "Mon, 16 Jan 2017 00:00:00 GMT", "id": "b3b3a4492837057cdf2b054ebaf5fe47", "content": "ITEM PHOTO BY DAVID WILSON\nA Lynn police van circles into an apartment complex on Hanover Street around 10:15 p.m. Saturday.\nBy GAYLA CAWLEY\nLYNN — Lynn Police believe the six shootings throughout the city over the weekend were not random events and some victims may have been targeted. Five men were shot, one fatally, and one woman caught in the crossfire narrowly missed being struck by a bullet that went through the driver’s side window of her car.\n“We can’t say these are all linked together,” said Lynn Police Lt. Rick Donnelly. “It’s quite possible some of them are linked. But at this time, we can’t say that and at this time, it’s all under investigation … It doesn’t appear that anything’s random. It appears that it’s targeted individuals. I would say to the public be cautious. We don’t think these are random incidents. We think these people have a plan and know what they’re doing. That’s how it appears to us.”\nDonnelly said the shootings occurred between Friday at 2:50 a.m. and Saturday just after 6:30 p.m.\nPolice responded to Melrose Wakefield Hospital just before 3 a.m. on Friday to find a 21-year-old man from Lynn with non-life-threatening injuries from two bullet wounds. The man told police he had been shot at Austin Square in Lynn near the 7-Eleven.\nLater that evening, at 8:13 p.m., police responded to a fatal shooting on Chestnut Street. Hanky Betancourt, 29, of Lynn, was taken to Union Hospital, where he was pronounced dead. No arrests have been made, according to the Essex County District Attorney’s office.\n29-year-old fatally shot on Chestnut Street\nAt 11:17 p.m. that same night, a call came in for shots fired on Hamilton Avenue. Donnelly said several shell casings were recovered and a house on the street was struck with gunfire.\nOn Saturday, shortly before 4:30 p.m., police responded to a report of gunshots on Neptune Boulevard. Donnelly said several shots were fired and two cars were hit. There were no victims.\nAbout an hour later, police made their way to Goodridge Street and spoke to 51-year-old Lynn native Lorraine Blowers DePietro. Donnelly said she was an innocent bystander at the wrong place at the wrong time, and is lucky to be alive.\nDePietro told The Item on Sunday that she was driving her brother-in-law’s gold SUV by Goodridge Street shortly after 5:30 p.m., when a bullet went through her driver’s side window and lodged itself in the leather seat she was sitting in, narrowly missing her body. She was left with a burning mark and a bruising welt from where the bullet whizzed by.\nDePietro said police told her the weekend shootings were retaliatory from Betancourt’s fatal shooting, but Donnelly wouldn’t confirm that statement.\nShortly after, police received a call from the Salem Hospital Emergency Room for a 26-year-old shooting victim. The man told police he was walking on Goodridge Street when he was shot. His injuries were non-life-threatening, Donnelly said.\nPolice then responded to a double shooting on Hanover Street shortly after 6:30 p.m. Authorities found two Lynn men, 17 and 19, who had both been shot in the lower legs. Both were taken to Massachusetts General Hospital with non-life-threatening injuries, but Donnelly said they weren’t cooperating with police.\n“It appears to be some type of drug deal gone bad,” he said.\nCity Councilor Brian LaPierre said the Human Rights Commission meeting scheduled for 6 p.m. tonight at City Hall, room 402, will shift its focus to helping people understand why the violence is happening and also put together some measures to ensure the safety of Lynn’s citizens. He said he thought the meeting would provide an appropriate space for people to come to and hopefully feel some sense of comfort.\nLaPierre said the six shootings over the weekend are disturbing.\n“We’re on edge to say the least,” LaPierre said. “It’s frightening when it can happen so close by to where you live.”\nIn response to the shootings, the Stop the Violence Lynn Committee called an emergency meeting on Sunday. Fred Hogan, a member, said the meeting was called by Antonio Anderson. Anderson is one of the new members of the subcommittee that Stop the Violence is putting together, made up of a group of men under 30 who have a better grasp of what’s going on in the city at this time, Hogan said.\nHogan said the younger men have been working to make direct phone calls to people involved in the violence over the weekend, trying to keep heads calm and prevent further action. He said the incidents look like retaliatory gang shootings. Part of the work Stop the Violence does, he said, is trying to educate the younger kids, targeting them before they make the decision to get into gangs.\n“This situation that went on, it was just kind of out of control,” Hogan said. “We don’t know if it’s over. Antonio, he’s been making a lot of phone calls and trying to talk (people) down … Sadly, in the way we live now, you never know when something’s going to go off. That’s why we’re so upset when something like this is going on in the city. This city can be so good. You have some things you have no control over.”\nLynn Police Lt. James Shorten said on Sunday one arrest is part of the investigation, and may or may not be related. Matthew Sao, 24, of 121 High Rock St., was arrested Saturday night and charged with firearm-related offenses, drug possession with intent to distribute, violation of the city knife ordinance, receiving stolen property and failure to stop/yield.\nDonnelly said the arrest was made after a motor vehicle stop was conducted. Drugs and a gun were found in the car, he said, but declined to provide further details.\n“Right now, it’s being investigated 24/7 by the detectives,” Donnelly said of the shootings. “The police are on high alert.”\nGayla Cawley can be reached at gcawley@itemlive.com. Follow her on Twitter @GaylaCawley."}