{"uri": "http://www.itemlive.com/news/police-log-1-16-2017/", "title": "Police log: 1-16-2017", "dct": "Mon, 16 Jan 2017 00:00:00 GMT", "id": "c8c898afede449b5583402d7a7b02a18", "content": "All address information, particularly arrests, reflect police records. In the event of a perceived inaccuracy, it is the sole responsibility of the concerned party to contact the relevant police department and have the department issue a notice of correction to the Daily Item. Corrections or clarifications will not be made without express notice of change from the arresting police department.\nLYNN\nArrests\nMacauthur Belin-Jr., 49, of 9 Milton St., was arrested and charged with violation of an harassment prevention order at 12:02 p.m. Sunday.\nAlan Iraheta, 23, of 60 Rock Ave., was arrested and charged with interfering with a police officer, assault and battery on a police officer and assault and battery with a dangerous weapon at 12:38 a.m. Saturday.\nLurina Rivera, 31 of 32 Range Ave., was arrested on warrant charges of use of a motor vehicle without authority, larceny from a building and larceny of a motor vehicle at 10:35 a.m. Friday.\nMatthew Sao, 24, of 121 High Rock St., was arrested and charged with possession of a firearm without a firearm identification card, carrying a loaded firearm weapon, firearm violation with one prior violent crime, receiving stolen property, failure to stop/yield, violation of the city knife ordinance and drug possession with intent to distribute at 12:10 a.m. Sunday.\nAccidents\nA report of a motor vehicle accident at 7:41 a.m. Friday at Market and State streets; at 8:08 a.m. Friday at Eastern Avenue and Stanwood Street; at 10:07 a.m. Friday at 527 Western Ave.; at 12:21 p.m. Friday at 100 Johnson St.; at 3:45 p.m. Friday at 1127 Western Ave.; at 4:18 p.m. Friday on Western Avenue; at 4:48 p.m. Friday at 674 Western Ave.; at 5:05 p.m. Friday at Broadway and Euclid Avenue; at 11:57 p.m. Friday at 35 Washington St.; at 10:51 a.m. Saturday at Spencer Street and Western Avenue; at 10:51 a.m. Saturday at 841 Western Ave.; at 1:43 a.m. Sunday at 50 Lynnway; at 7:40 a.m. Sunday at 112 Exchange St.\nA report of a motor vehicle accident with personal injury at 3:12 p.m. Friday at 1103 Western Ave.; at 9:56 p.m. Friday at Chestnut Street and Western Avenue; at 11:42 a.m. Sunday at Nahant Rotary at 1 Lynnway.\nAn report of a motor vehicle hit and run accident at 3:29 p.m. Friday at 107 Victory Road; at 6:25 p.m. Saturday at 190 Lewis St.; at 6:57 p.m. Saturday on Collins Street.\nAssaults\nA report of an assault and battery at 4:57 p.m. Friday on Sewall Street.\nA report of an assault at 5:25 p.m. Saturday on New Park Street.\nA report of an assault and battery with a dangerous weapon at 5:14 a.m. Sunday on Central Square.\nBreaking and Entering\nA report of a motor vehicle breaking and entering at 5:53 a.m. Friday at 110 Park St.\nA report of a breaking and entering at 11:57 a.m. Friday at 12 Rogers Ave.; at 6:08 p.m. Friday at 10 Minot St.\nComplaints\nA report of a disturbance at 3:59 p.m. Friday at 3 Mountain Ave.; at 6:44 p.m. Friday at 309 Boston St.; at 7:21 p.m. Friday on Pleasant Street; at 10:47 p.m. Friday at 12 Fortesque Terrace; at 11:34 p.m. Friday at Kiley Playground at 61 Burrill Ave.; at 11:39 p.m. Friday at 19 Rockaway St.; at 12:28 a.m. Saturday at 125 Marianna St.; at 1:20 a.m. Saturday at 3 Carleton Terrace; at 1:58 a.m. Saturday at Goldfish Pond on Lafayette Park; at 1:24 p.m. Saturday at McDonalds at 60 Boston St.; at 3:04 p.m. Saturday at 173A Union St.; at 4:30 p.m. Saturday at 7 Brookline Ave.; at 5:05 p.m. Saturday at 26 Mall St.; at 7:09 p.m. Saturday at 170 S Common St.; at 7:24 p.m. Saturday at 44 Estes St.; at 8:27 p.m. Saturday at Chestnut Street and Lafayette Park; at 11:46 p.m. Saturday at Essex Avenue and Essex Street; at 9:57 a.m. Sunday at Santander Bank at 39 Exchange St.; at 11:23 a.m. Sunday at 26 Washington St.\nA report of a gunshot at 8:13 p.m. Friday at 390 Chestnut St.; at 11:17 p.m. Friday at 18 Hamilton Ave.; at 9:47 a.m. Saturday at 60 Rock Ave.; at 4:25 p.m. Saturday at 293 Summer St.; at 5:40 p.m. Saturday at Mandee’s Pizza at 65 Goodridge St.; at 5:54 p.m. Saturday at Salem ER at 300 Washington St.; at 6:34 p.m. Saturday at 38 Hanover St.; at 11:27 p.m. Saturday at Beacon Hill and Lawton avenues.\nOverdose\nA report of an overdose at 9:01 a.m. Friday on Circle Avenue; at 1:52 p.m. Saturday on Lewis Street; at 3:37 p.m. Saturday on Fortesque Terrace; at 7:07 a.m. Sunday on Tracy Avenue.\nTheft\nA report of a robbery at 10:02 a.m. Friday at 17 Beede Ave.; at 3:12 a.m. Sunday on Central Square.\nA report of a larceny at 11:50 a.m. Friday at 26 Bailey St.; at 12:35 p.m. Friday at 427 Lynnway; at 3:28 p.m. Friday at 28 Childs St.; at 9:19 p.m. Saturday at 38 Burrill Ave.; at 12:39 a.m. Sunday at 38 W Neptune St.\nA report of motor vehicle theft at 4:05 p.m. Friday at 11 Grosvenor Park.\nVandalism\nA report of motor vehicle vandalism at 8:05 a.m. Friday at 7 Chase St.; at 12:19 p.m. Friday at 32 Cherry St.; at 5:21 p.m. Friday at 22 Newhall St.; at 9:26 a.m. Sunday at 655 Western Ave.\nA report of vandalism at 1:01 p.m. Friday at 11 Margin St.\nMARBLEHEAD\nComplaints\nA caller reported her boyfriend may have done some cocaine and subsequently had a seizure at 12:36 a.m. Sunday on Victoria Lane. She had been stopped for speeding and then told the officer the story.\nA report of a barricaded roadway at 6:13 a.m. Sunday on Atlantic Avenue. A man reported he witnessed two youths in the roadway, who were putting large pieces of wood in the road to block traffic When he went to remove the wood a second time, the two kids ran off.\nOverdose\nA report of an overdose at 6:33 p.m. Friday on Pleasant Street. A caller reported his friend overdosed in the motor vehicle. One person was taken to Salem Hospital.\nPEABODY\nArrests\nEdwin Martinez Burke, 25, of 16 Hardy St., Apt. 1, Salem, was arrested and charged with disorderly conduct and obstruction of justice at 7:30 p.m. Friday.\nTimothy M. Burke, 28, of 95 Middle St., W Newbury, was arrested and charged with disorderly conduct, assault with a dangerous weapon and threat to commit a crime at 7:30 p.m. Friday.\nBrandon Devin, 19, of 48 Blakely St., Lynn, was arrested and charged with nighttime motor vehicle breaking and entering for a felony and larceny at 2 a.m. Saturday.\nAccidents\nA report of a motor vehicle accident at 3:58 p.m. Friday on Summit Street. A car into a ditch was reported; at 2:38 p.m. Saturday at South Peabody Liquor Mart at 87 Lynnfield St. A vehicle striking a building was reported; art 3:27 p.m. Saturday at 2 Spring Pond Road and 272 Lynn St.; at 6:15 p.m. Saturday at Trader Joe’s at 300 Andover St.; at 6:15 p.m. Saturday at Trader Joe’s at 300 Andover St.; at 7:14 p.m. Saturday at McDonalds at 133 Main St. Jader Barbosa, 58, of 354 Cabot St., Beverly, was summoned for unlicensed operation.\nA report of a motor vehicle hit and run accident at 12:49 p.m. Sunday at Bagel World Bakery & Deli at 10 Sylvan St.\nAssaults\nA report of an assault and battery with a dangerous weapon at 7:30 p.m. Friday on Thorndike Street. A caller reported her boyfriend made threats to cause bodily injury to her and stated he had a firearm in the area of her house. The caller stated he said he would have a shoot out with police if stopped.\nBreaking and Entering\nA report of a motor vehicle breaking and entering at 2 a.m. Saturday at John Larson’s Service at 289 Lynn St. Brandon Devin, 19, of Lynn, was arrested.\nComplaints\nA report of a disturbance at 12:21 a.m. Saturday at 34 Keys Drive; at 6:12 a.m. Saturday at 18 Swampscott Ave.; at 7:09 p.m. Saturday at O’Fado at 72 Walnut St.\nOverdose\nA report of an overdose at 11:37 p.m. Friday on Elmwood Circle. The man was taken to Union Hospital; at 1:41 a.m. Sunday on Hampshire Road.\nTheft\nA report of a larceny at 2:42 p.m. Saturday at 17 Dublin Road.\nVandalism\nA report of vandalism at 11:16 a.m. Saturday at 52 Russell St. A resident reported orange from a paintball on his car; at 9:15 a.m. Sunday at Peabody Mobile Park at 252 Newbury St. A rock through the windshield was reported."}