{"uri": "http://www.wlwt.com/news/report-2-shot-dead-in-hillsboro/39889342", "title": "Sheriff: Suspect arrested in West Chester burglary, rape case", "dct": "Sat, 04 Jun 2016 11:41:00 GMT", "id": "f6b2e7455b321f1a5c01b52fbd10fb82", "content": "HILLSBORO, Ohio —\nA man shot his 1-year-old daughter dead before turning the gun on himself, Highland County Sheriff Donnie Barrera said.\nThe incident happened around 3:15 p.m. Friday at a home along Trenton Street, just outside of Hillsboro in Highland County.\nOfficials said Timothy Harewood, 35, of Hillsboro, was found dead in the yard from an apparent self-inflicted gunshot wound.\nInside the home, police said, a 1-year-old girl was found shot to death.\nAccording to investigators, Harewood was at his father's house when a fight escalated. Officials said Harewood went inside the home, grabbed a gun and shot his 1-year-old daughter while she was sleeping. He then went outside to where his girlfriend -- the child’s mother -- was sitting with family members and attempted to shoot her, officials said.\nWitnesses said the gun misfired, and Harewood turned the gun on himself.\n\"It's really devastating to the officers because a lot of the officers that responded to the scene tonight have children of the same age,” Barrera said.\nNeighbors who knew Harewood are shocked, saying it’s out of character for the 35-year-old father.\n“They (were) always out in the yard playing,” neighbor Lawrence Turner said. “He just built a swing-set and she just started walking about a couple weeks ago. They seemed to be getting along pretty good but now you hear all kinds of stories.\"\nBarrera said the Harewood’s girlfriend was struck on the side of the face during the incident. She was taken to Highland District Hospital for treatment. She has since been released.\nHarewood had a conceal carry permit and was an instructor for conceal carry permits, Barrera said.\nThe incident remains under investigation."}