{"uri": "http://www.samessenger.com/scott-e-noel/", "title": "SCOTT E. NOEL", "dct": "Wed, 30 Mar 2016 00:00:00 GMT", "id": "9090ea9fce5f5ca05b587ece74841baf", "content": "BAKERSFIELD – Scott E. Noel, age 22, passed away accidentally while cleaning his gun collection at his home in Bakersfield on Sunday, March 27, 2016.\nHe was born in St. Albans on July 8, 1993 the son of Mary (Murray) Westcom and Kevin Noel.\nScott was a 2011 graduate of MVU in Swanton and the past three years he has been employed in the receiving department at Century Arms in St. Albans. Scott was passionate about anything to do with guns from gun-smithing and shooting to collecting and was an advocate and believer and the 2nd Amendment ‘Right to Bear Arms.’ He also liked to tinker on and fix cars and trucks, especially his Jeep, and cooking. He held a special place in his heart and loved to spend time with his nieces, Keira and Ava.\nHe is survived by his mother, Mary Westcom and her husband, Brian, of Bakersfield; his father, Kevin Noel, of Swanton; his brother, Caleb Reynolds and his significant other, Emily Jacques, of Highgate; his nieces, Keira and Ava; his paternal grandmother, Elizabeth Noel, of Swanton; his maternal grandmothers, Diana Sartwell, of Highgate and Dorothy Westcom, of Bakersfield; and his maternal grandfather, Ken Murray and his wife, Elmira, of Alburgh. Scott was predeceased by his paternal grandfather, Roland Noel, Sr.; his maternal great-grandparents, Miles and Phyllis Sartwell, and Grace and Medor Murray; and his maternal grandfather, James Westcom.\nVisiting hours will be held Saturday, April 2, 2016 from noon until 2 p.m. at the Spears Funeral Home, 96 Dickinson Ave., Enosburg Falls. A memorial service will follow at 2 p.m. with Rev. Kerry Cameron officiating. Interment will be held at the convenience of the family in the Highgate Center Cemetery.\nFor those who wish, contributions in Scott’s memory may be made to Vermont Turkey and Young Guns Club, C/O Steve and Joyce Lafar, 694 Gore Road, Highgate Center, VT 05459\nMessages of condolence may be sent to Scott’s family online through www.spearsfuneralhome.com."}