{"uri": "http://triblive.com/news/editorspicks/6956093-74/iverson-shayne-stephanie", "title": "Newborn faces recovery after stray bullet pierces skull in Saltsburg home", "dct": "Sat, 18 Oct 2014 10:30:00 GMT", "id": "d472b8be26de7cbd4de46eb74a648dbc", "content": "Donate at any S&T Bank branch for “Shayne Iverson Fund.” Donate online to the “Shayne Iverson Medical Fund” at gofundme.com/f43kdw.\nA Bake Sale and Texas Roadhouse Buffet Lunch fundraiser for Shayne Iverson and family will be held Thursday at Newhaven Court at Lindwood, Greensburg. For more information, call 724-853-2505.\nIn the frantic seconds after a bullet from a hunter's rifle shattered a living room window and pierced their newborn's skull, Jeremie and Stephanie Iverson struggled to understand what had happened.\nAs father and son quietly cuddled on the couch just past 7 on the evening of Sept. 25, the baby's head suddenly snapped back from the bullet's impact.\nThen came the blood, followed by a millisecond of heart-stopping silence when they weren't sure if Shayne, the son they brought home from the hospital two days earlier, was dead or alive.\nA single, reassuring sound gave them their answer.\n“We heard him cry, and it was the best sound,” said Jeremie Iverson, 42, who lives with his wife and two other children in an area peppered with cornfields and silos just outside Saltsburg, Indiana County.\n“I'm holding him, he's sleeping, and we heard a loud pop,” said Iverson, speaking in some of the greatest detail since the shooting happened.\n“I felt his head go back. … There was a lot of blood. I freaked out.”\nStephanie Iverson, 30, wrapped the child's head with towels as her husband regained composure and began making calls to 911 and state police.\nSince then, the Iversons' days have turned into weeks in Children's Hospital of Pittsburgh, talking to their son, holding his tiny hands, and praying that medicine will save the boy whose life forever changed with a tragedy that gained national attention.\nThe bullet exited through his eye socket, blinding him in that eye and possibly compromising vision in the other eye.\n“Their life is their family. Stephanie will not leave that baby's side,” said family friend Karen Severini of Jeannette.\nSo on Monday, as Shayne marks his 1-month birthday, the Iversons will continue their vigil, hoping for the best.\nA safe haven\nSurrounded by grassy hills and separated from neighbors by vast acres, Jeremie Iverson considered his family's home along a winding, two-lane road dotted with campers and combines as their safe place.\nIt was a refuge where kids could run free and parents would know they would be OK.\nJeremie, a carpenter, and Stephanie, an activities director at a nursing home, led a simple, happy life — two people whom friends described as “completing each other.”\nAfter Shayne's birth, Stephanie told Severini that “we have everything we could ever ask for.”\nFor the Iversons and those around them, the sound of hunters' rifles was nothing new, especially in fall.\nYet “it's always been my fear of this happening,” said Bill Nelson, 34, father of a 3-year-old girl, who lives across the road from the Iversons on a 130-acre farm.\nBut most people, like the Iversons, accept that there will be hunters in the rural area.\n“It's a fact of life. You live out in the woods, and something might happen,” said Anthony Buttekoff, 49, whose father's nearby home was struck twice by bullets.\nThe hunter whose bullet struck Shayne has not been identified. The bullet had a “one-in-a-million chance of hitting the home and the baby inside,” said P.J. Hruska, president of Saltsburg Borough Council.\n“You'd have a better chance of hitting the lottery 20 times in a row,” he said.\nNo decision on whether to file charges can be made until authorities get the results of ballistics tests, a spokesman for Indiana County District Attorney Patrick Dougherty said.\nNone of that matters to the Iversons.\n“We're not holding a grudge,” Jeremie Iverson said.\nThey have more pressing concerns.\n“To us, it doesn't matter what they decide; it won't change our situation.”\nRough start\nFrom the start, life wasn't easy for Shayne.\n“It was a difficult delivery. He was breach,” Jeremie Iverson said. “Stephanie had a C-section and blood transfusions.”\nOn the night of the shooting, as their son was loaded into a helicopter and flown to Children's Hospital, the thought of losing him crossed the couple's minds.\n“They had to remove a blood clot. His brain was swelling,” Iverson said.\nIt became a waiting game — to see how he weathered that first night and each thereafter.\nOn Thursday, the baby was back in surgery. Doctors want to try to save the vision in his other eye and to repair facial damage.\nThe surgery “went well but he will need more surgeries,” his father wrote in a text message Thursday night following a long day for the family.\n“A lot of waiting, but we are happy with the results. Still a long road to recovery,” he said.\nHelping thy neighbor\nSince the shooting, the Iversons have not been to work. Life revolves around the hospital and Shayne's recovery.\nStephanie Iverson sleeps at the hospital. Her husband shuttles back and forth, 70-plus miles, each day to help with their other children, Caden, 9, and Gabi, 2.\n“It's been tough. Friends have been helping out,” Jeremie Iverson said. “You do what you have to do.”\nAlmost immediately, the people of Saltsburg, population 845, rallied behind the couple.\n“We've sent a lot of prayers to that family. If prayers were money, they would be rich,” said Elizabeth Rocco, who became the town's mayor in January.\nThe Iversons say they are humbled by the outpouring of support.\n“People have been sending cards and letters from all over,” Jeremie Iverson said. “Every day we get cards from people we don't even know … Ohio, New Jersey, North Carolina, New York. People have held prayer services in New Mexico.”\n“We thank everyone. ... It means a lot,” Stephanie Iverson said.\nThe bills for Shayne's care will be staggering, beginning with the $16,000 helicopter ride.\nTwo fundraisers are under way, including an online effort that raised almost $14,000 in 19 days. More are planned, borough residents said.\nGoing forward, people will continue to pitch in any way they can, Rocco said.\n“We are a community that really embraces our neighbors,” she said. “We step up to help those who need.”\nCraig Smith is a Trib Total Media staff writer. Reach him at 412-380-5646 or csmith@tribweb.com."}