{"uri": "http://www.nola.com/crime/index.ssf/2016/10/miracle_baby_comes_home_1_week.html#incart_river_index", "title": "'Miracle baby' comes home, 1 week after being struck by gunfire in Algiers", "dct": "Sat, 29 Oct 2016 13:18:41 GMT", "id": "1e6e9bf4c42759dee9c3dc0341a53410", "content": "(Jonathan Bullington, NOLA.com | The Times-Picayune)\nAlong a quiet street in a West Bank neighborhood Friday, all eyes were on Kelvin.\nThe 5-month-old's attention, however, had been fixed on his left hand, which he earnestly tried to fit in his mouth. His focus shifted quickly to the similarly statured dog nestled in the arms of a neighbor who walked over to check on the family.\n\"Is that Kelvin?\" she swooned. \"You're a miracle baby.\"\nAs she spoke, Kelvin removed his left hand from his mouth and extended it out to her dog, who cautiously met it with a sniff.\nKelvin smiled. He laughed. And his entire family laughed with him.\nThe moment seemed unlikely a week earlier, when Kelvin Moses was struck by gunfire that killed his father and left another man wounded. After more than two hours of surgery at University Medical Center, and a trip to Children's Hospital, Kelvin returned home Thursday (Oct. 27).\n\"He's a fighter,\" said Kelvin's grandmother, Terry Butler. \"But he's got a long road to recovery.\"\nKelvin was sitting in father Lenord Moses' lap when someone opened fire on Moses' car about 9 p.m. Oct. 20 outside Cypress Run apartments, 6101 Tullis Drive in Algiers.\nFive-month-old Kelvin Moses remained in intensive care Friday (Oct. 21) after being struck by gunfire that killed his father and left another man wounded the night before, Moses' relatives said.\nOne bullet hit Kelvin in his buttocks and damaged his rectum, said his mother, Keyana Morris. Two other bullet fragments struck Kelvin in the head. The damage left Kelvin in need of a colostomy bag and without feeling in his left leg, his family said. Though doctors are hopeful that feeling will return.\nLenord Moses, 26, was shot in the head and pronounced dead at the scene. The car's passenger, 26, was also wounded and taken to an area hospital for treatment.\nThe family has set up an online fundraiser to help with expenses connected to Kelvin's recovery.\n\"I just need the help,\" Morris said. \"Me and his father were raising him together, and now his father's gone. Now I have to take care of him by myself.\"\nFor Kelvin's family, their thoughts are haunted by how close they came to losing him. He had been sitting in his car seat shortly before the shooting started, and that car seat was hit more than once by bullets.\n\"I think about the what-ifs all the time,\" said Kelvin's aunt, Chantell Butler.\n\"You look at life different,\" Terry Butler added. \"You never think your family will be touched by this. I pray I never have to go through this pain again.\""}