{"uri": "http://southsidemessenger.com/shooter-accepts-25-year-prison-sentence-for-wounding-4-men-in-lunenburg-county/", "title": "Shooter Accepts 25 Year Prison Sentence for Wounding 4 Men in Lunenburg County", "dct": "Thu, 07 Nov 2013 14:26:00 GMT", "id": "30fde62b746ae91a52750316ee9ff6c6", "content": "Codarrell Lee Yates, a 22-year-old man from Nottoway County, pled guilty recently in Lunenburg Circuit Court to four felony wounding charges, one count of use of a firearm in the commission of a felony, and possession of a firearm by a felon and was sentenced to twenty-five years in prison. He received an additional 93 years suspended upon numerous conditions.\nYates also has an additional five years to serve on Nottoway County convictions this year for grand larceny and breaking and entering.\nAccording to Commonwealth Attorney Robert Clement, a jury trial was planned for November 4th and 5th, but the defendant expressed a willingness to plead guilty in exchange for an agreed-upon sentence. Clement said that he would have preferred a more significant sentence, but due to a “snitch” mentality among nearly all of the witnesses, he felt more secure with a “sure thing” rather than having to count upon reluctant, uncooperative witnesses. “Some refused to talk to law enforcement, and some refused to meet with me,” said Clement. The prosecutor did, however, highly commend one of the victims, Standrekas Woods, for his full cooperation, precise observations, and ability to express his testimony fully and forcefully. Clement added that the victims and law enforcement officers agreed to the disposition.\n“Ironically, those persons who did not want to “snitch” did not realize that Yates “snitched” on one of his closest friends, Robert “Chuckie” Fields, the driver of the vehicle. In his interview in Texas where he was found after the shooting, Yates said he had left the party before the shootings, and that Fields had given him the gun to take to Texas later that day. He said Fields admitted to him in a telephone conversation that Fields had shot the men.\nFields, on the other hand, would not identify Yates as the shooter in his first four interviews until he was shown the video of Yates in Texas blaming him for the shooting. Fields then went ballistic, calling Yates a liar and saying Yates was the shooter. He then looked right into the camera in the interview room and shouted, “You’re (deleted) whacked. You are lying. You’re supposed to be my (deleted) brother, man.” He told the investigator to be sure she showed Yates the video of this interview. “Don’t let him miss it.” He then raised his hands up, showing the handcuffs to the camera, and said, “It’s because of you.””\nYates will be under conditions of good behavior for 118 years, supervised probation for five years upon his release, warrant-less searches and seizures, no contact with the victims, restitution for any medical expenses, not knowingly being within 100 feet of any firearms except law enforcement officers and commercial establishments, and staying out of Lunenburg County for ten years upon his release.\nAccording to Clement, the charges arose from a shooting at 2073 Pleasant Oak Road, Victoria, Virginia after physical altercations between Lunenburg men and Nottoway men during a birthday party for a Lunenburg female on May 18, 2013.\nDetails provided below were taken from a written Stipulation of Evidence signed by the defendant as to what he expected the Commonwealth to prove in court, revealed the following facts:\nAll witnesses would have been in agreement that Richsean Hawkes hosted a birthday party cookout for Destiny Brown, a friend. Approximately 25 to 35 individuals eventually showed up.\nA number of the witnesses became aware that around 11:30 p.m., Robert “Chuckie” Fields drove up in his father’s minivan with six friends from Nottoway. (Fields is the father of the baby of Destiny Brown). A number of the witnesses expressed concern that the “Nottoway” men had come to the party, because of past tensions with Lunenburg County individuals. They would testify that Brandon Townsend of Lunenburg stood on the front porch at one point and angrily yelled at one of the Nottoway men, “What are you looking at?” because of the manner and stance that the Nottoway man posed. Townsend was convinced by some of the women to go back into the house, but came out later and fussed again. One of the Nottoway men yelled something to the effect of not being disrespected in this way. As some of the Lunenburg and Nottoway men became more aggressive, some of the Lunenburg men and women tried to defuse the situation and calm them down. Two of these men who tried to calm things down were the victims, Stan Woods and Dequan Jones. Witnesses would say that Dequan Jones was then jumped and hit from the side, and then fought back. As he was fighting, another Nottoway man tried to get him, but a Lunenburg man pushed him away, and said words to the effect that it would have to be a fair fight, one on one. He pushed the Nottoway man twice to stop him, and they ended up in the road in front of the house. They squared off with each other to fight, and the Lunenburg man hit him in the face with one punch and knocked him out. Stan encouraged Chuckie Fields to get his friend and leave. Chuckie dragged his friend to the minivan, put him inside, and the other Nottoway men got inside also.\n(Some of the Nottoway men said the minivan was surrounded and being hit and kicked, but none of the Commonwealth’s Lunenburg witnesses confirmed this.)\nAt this point, shots were fired. Five or six witnesses would testify that the shots came from inside the minivan which was parked at the back of the driveway facing the house, with five shots fired through the windshield, and two more shots fired from the side after the van had backed into the road and as it drove away.\nThe four victims were hit by the gunfire as described below.\nStandrekas “Stan” Woods is a 2009 graduate of Central High School, and attended one year at the local community college before becoming a correctional officer for the Virginia Department of Corrections.\nStan said that around 11:00 pm or 11:30 p.m., his friend, Richsean Hawkes, called and asked him to come to his house and drive him to town to buy some cigarettes because he had been drinking and did not want to drive. When he came back, he sat on the porch talking to Hawkes and one of the Nottoway men in friendly conversation.\nWhen the arguments began, Stan stopped one Lunenburg man from being aggressive toward the Nottoway man who had been on the porch, pointing out that he had not done anything.\nStan then went to get his younger brother, Dontaris, in order to leave. He saw the fights described above, and peacefully encouraged the Nottoway men to leave. He and his brother walked to his car in the driveway where it was parked just in front of the minivan. He walked around the front of the car, and Dontaris walked behind the car calling out for a friend who had ridden with him. His car was parked on the road further beyond the driveway.\nStan said that as he put the key in lock to the door of his car, he heard two shots, and saw his brother, Dontaris, fall to the ground. He then turned and looked at the minivan, saw two bullet holes in the windshield, and plainly saw the defendant, Codarrell Yates, pointing a handgun toward him from inside the minivan from the back, reaching between the two front seats. The ceiling light was on just above his face, giving Stan a good view of Yates. Stan said Yates yelled, “THAT’S HOW YA’LL WANT TO PLAY ? AIN’T NO REASON TO RUN NOW.”\nStan said he could see Chuckie (Robert Fields) in the driver’s seat, and the light-skinned guy in the passenger seat.\nStan said YATES looked at him dead in the face, pointing the gun at him.\nSTAN yelled “NO!!!” and saw and heard the shot fired by Yates and felt the bullet hit him in the chest.\nSTAN sank down by the car, and played dead. He said he heard two more shots, and then a few seconds later he heard two more shots down the road just as the van accelerated and drove away.\nStan looked up and saw they were gone. He said he ran around the car and went up to the sidewalk where he fell.\nA friend and other Lunenburg men and women got shirts, towels and sheets and applied pressure to the wounds of the four victims.\nStan said he looked up at the moon, which was nearly full, and thought, “This is the last moon I’m going to see.”\nStan was driven to the hospital in South Hill along with Trey Ghee, who had been injured. Dequan Jones and Dontaris Woods were driven to the Victoria Rescue Squad and transported to South Hill. All four men were then transported to MCV Hospital in Richmond.\nDequan Jones also attended Central High School. He would testify concerning the fighting described above, and said he then walked over to his car which was parked a little further up the driveway in front of Stan. He would testify that he heard the gunfire and turned to look, but then turned back to the person he had been talking to. He then suddenly felt a burning pain to his right ear. It turned out that a bullet had cut his earlobe and either the same bullet or a second bullet entered the side of his head at the ear while his head was turned sideways. He said he did not see the shooting itself.\nDontaris Woods apparently was the first man shot, but said he did not see the shooting itself. He was struck in the face and in his left arm near the wrist.\nTreyvious Ghee said he came out of the house and saw the fighting going on. As he and a friend were walking in the yard, he was hit in the side of his head, just above his ear. He fell to the ground unconscious. He also did not see the shooter.\nFemale Witness, who will not be identified here at her request, said that she saw a man standing in the minivan “with hair” (referring, she said, to long braids, like the defendant had) shooting from the side of the minivan as it drove away.\nRobert “Chuckie” Fields was the man who drove the Nottoway men to the party. He is charged as an accomplice (for driving the vehicle as the last shots were fired and getting away from the scene, allowing Yates to flee). He is charged with the same crimes as Yates, except for the possession of a firearm by a felon.\nFields was interviewed by law enforcement at least four times, refusing to identify the shooter, at times stating he just heard the shots and ducked down in the driver’s seat, and stating that one of the friends was still unconscious from being knocked out in the fight, and another friend in the front passenger seat fainted when the first shot rang out. He always strongly denied that he had shot the gun. He later said that the police knew who had shot the gun, but he would not say the name.\nIn exchange for his agreement to testify against Yates and his agreement to waive the preliminary hearing, the Commonwealth has agreed to allow Fields to plead guilty to one count of malicious wounding as an accomplice and receive one year active sentence.\nYates fled to Texas later in the day, driven by a female friend, Deidre Fowlkes. When found by law enforcement officers in Arlington, Texas, Yates ran on foot, and tried to hide in some brush. A tracking dog was used, and he was found lying in some tall grass. At first he would not get up as commanded, but when police threatened to release the dog, he jumped up. He said he had fled to Texas to avoid a sentencing hearing in Nottoway Circuit Court on a conviction of burglary the Monday after the party.\nEvan is the Assistant Editor at the Southside Messenger newspaper in Keysville, Virginia.\nConnect on Facebook View all Posts Visit Website"}