{"uri": "http://www.ksl.com/?sid=42708804&nid=148&title=police-9-year-old-critically-injured-in-kearns-drive-by-shooting", "title": "Police: 9-year-old critically injured in Kearns drive-by shooting", "dct": "Wed, 28 Dec 2016 00:00:00 GMT", "id": "df86250e7c469eb466ecdefbf782419c", "content": "KEARNS — A 9-year-old was flown to a hospital in critical condition after he was shot in the head in a drive-by shooting Wednesday afternoon, police said.\nPolice responded to a report of the shooting near 5285 W. Stockton St. shortly after 2 p.m., according to Unified police detective Ken Hansen.\nHansen said two men were inside a 2010 black BMW 535 that drove down Stockton Avenue and then turned around and came back and one of the individuals fired at least one shot that struck the windshield of a parked SUV where the child was inside.\n\"That round apparently went through the windshield and hit the 9-year-old who was sitting in the center part of the backseat,\" he said. \"There were three children in the backseat — apparently they were being loaded (in) so at that time there was not an adult in the vehicle. They were loading children into the vehicle.\"\nThe child, whose name was not immediately released, was transported to Intermountain Medical Center and has since been flown to Primary Children's Hospital, Hansen said.\nInvestigators believe the shooting is gang-related, but they are not sure who the intended target was, Hansen said.\n\"Unfortunately, like in many cases, it hits innocent victims,\" he said. \"This is certainly a tragic case of someone shooting down the street at a vehicle and it hits the child who is in the vehicle.\"\nNeighbor Cesar Hernandez said he was in his home when he heard the gunshots.\n\"I thought they were fireworks at first and I saw this scrambling going (on outside), so I dropped to the floor,\" he said.\nHernandez was not surprised that the shooting occurred where it did, he said, because the the house where it happened has been the site of trouble in the past.\n\"It just unfortunate there was a child involved this time,\" he said.\nHansen said they are looking for two Hispanic men that were inside the BMW. Authorities said the vehicle was later located and seized by Salt Lake police.\nPolice said both men were wearing Chicago Bulls and \"a lot of red.\"\nPolice said the men are considered armed and dangerous.\nAnyone with information is asked to call 911 or contact the Unified Police Department at 385-468-9819.\nContributing: Ben Lockhart\nPhotos"}