{"uri": "http://www.abc15.com/news/region-west-valley/glendale/glendale-pd-three-killed-five-injured-in-house-party-shooting-police-searching-for-suspects", "title": "Glendale PD: Three killed, five injured, in house party shooting; police searching for five suspects", "dct": "Sun, 31 Jan 2016 17:42:00 GMT", "id": "a589698ce9856f4eb5da90f05016b5b1", "content": "GLENDALE, AZ - Police have identified three young adults who were killed after shots were fired at a house party where five others were wounded, and a group of suspects are still at large.\nGlendale police said a shooting at a home near 67th and Missouri avenues occurred around 3:30 a.m. on January 30. Sean Marquez, 19, of Glendale, Jose Aguirre-Martinez, 19, of Scottsdale, and a 16-year-old from Phoenix were killed when they were shot at. The name of the 16-year-old is not being released because he is underage.\nUpon arrival, police found a large party filled with teenagers and young adults. They suspect as many as 80 to 100 teens attended the party. According to the investigation, a group of five Hispanic men were involved in a verbal altercation inside the home with party goers, and they were asked to leave. As the group of men left the house, they continued arguing in the front yard. One of the men, who was described as being in his late teens to early 20s, entered an older, white 4-door sedan. The group of men entered the vehicle, drove down the street, turned around, and as they drove past the home at a high rate of speed opened fire, striking several individuals who were both outside and inside the home.\nAt the scene, police located two other individuals who were wounded by gunfire, a 15-year-old girl and a 19-year-old man who were both released from the hospital as of Sunday.\nSince the shooting, police learned three other individuals who were at the party also sustained gunshot injuries, bringing the total up to eight individuals who were struck by gunfire. Two 17-year-old boys and a 16-year-old boy were shot as the suspect vehicle fled the scene. All three left the scene prior to police arriving; their injuries were non-life threatening and they did seek out medical attention on their own.\nPolice don't know how many shooters were involved in the incident, however they do believe there was more than one. Officials have not been able to locate any suspects or the vehicle that was used during the shooting.\nAnyone with information is encouraged to contact the Glendale Police Department at (623) 930-3000 or Silent Witness at (480) WITNESS."}