{"uri": "http://www.nydailynews.com/news/national/louisiana-man-kills-wounds-shooting-spree-article-1.1559338#ixzz2oh2cbodF", "title": "La. gunman kills wife, ex-mother-in-law, self in spree that left 4 dead, wounded 3 others: police", "dct": "Fri, 27 Dec 2013 13:56:00 GMT", "id": "53c92e17c09ebd2cce3c90c5600f4f61", "content": "A Louisiana man went on a bloody rampage Thursday, killing his wife, the head of a hospital where he once worked and his former mother-in-law — the wife of a local councilman — before fatally turning the gun on himself, authorities said.\nBen Edward Freeman, 38, began his deadly shooting spree when he burst into a home in the town of Lockport about 45 miles southwest of New Orleans and shot Lafourche Parish Councilman Louis Phillip Gouaux and his wife, Susan, shortly before 7 p.m., authorities said.\nFreeman also wounded the councilman's daughter, Andrea Gouaux - the sister of the gunman's ex-wife - in the shooting, police said.\nSusan (Pixie) Gouaux died before emergency workers arrived, but her husband and daughter survived. Both were listed in critical condition at University Hospital.\nAbout 20 minutes after the violence, Freeman allegedly went to a Raceland home and shot Milton Bourgeois, the CEO of Ochsner St. Anne General Hospital.\nParish Sheriff’s Office spokesman Brennan Matherne said in a statement that Bourgeois was fatally shot. His wife, Ann Bourgeois, was also hit, but she survived, Matherne said.\nPolice soon identified Freeman as the shooter and swarmed his Houma home, where they found his wife — Denise Freeman — dead in a bathtub. Her cause of death was not immediately released.\nThe couple had a history of domestic violence, and courts had issued at least two protective orders, the most recent expiring last month, WDSU reported.\nThe news station also reported that Ben Freeman was ordered to have supervised visits with his children.\nFreeman — who had worked at three area hospitals over the last few years, including the facility operated by Bourgeois — was found dead in a vehicle pulled over along U.S. Highway 90 near Bayou Blue, police said.\nHe apparently died of a self-inflicted gunshot wound.\nPolice said a shotgun was used in all of the shootings.\nWith News Wire Services"}