{"uri": "http://www.cbs5az.com/story/31912440/ammo-explodes-at-phoenix-house-fire-man-found-dead", "title": "Ammo explodes during Phoenix house fire, man found dead", "dct": "Fri, 06 May 2016 20:58:00 GMT", "id": "c69ba096c8cd0267cd3f991437c47b9e", "content": "MESA, AZ (3TV/CBS 5) -\nFire crews were called to the scene of a major house fire in which ammunition was burning and exploding near 12th Street and Peoria Avenue in Phoenix.\nAccording to the Phoenix Fire Department, crews found the body of an 80-year-old man at home.\nSLIDESHOW: Fire sets off ammo at N. Phoenix home\nRAW VIDEO: From the Phoenix Fire Department\nThe man has not been identified, but according to the Phoenix Fire Department, he was a gun dealer who loaded black powder ammunition as a hobby.\nIn the simplest terms, loading ammunition involves priming a cartridge case, adding a powder charge to the case and then seating a bullet on that charge. The victim reportedly used black powder, which is an easy-to-ignite mixture of sulfur, charcoal and saltpeter, rather than the more powerful smokeless powder used in most modern guns and rifles.\nWhile it's not clear what sparked the fire, there are inherent dangers in loading or reloading ammunition, particularly when it comes to storing the components.\n\"[G]reat care must be taken when handling black powder. Things such as static electricity can ignite it,\" explained StarlineBrass.com in an article comparing the black powder and smokeless powder.\nThe presence of the ammunition and loading components made the fire even more dangerous.\n\"There's thousands of rounds of ammo in there. We don't know how many went off, but it was intense to get in there and put that fire out,\" Ardell Deliz of the Phoenix Fire Department said.\nThe first-alarm fire started just after 1:30 p.m. Friday. It took crews about 30 minutes to get a handle on it, but hot spots continued to smolder more than two hours later. The first-alarm assignment means five engines, two ladder companies and four command officers were sent to the scene.\nJared Dillingham tweeted that the North Phoenix neighborhood had been sealed off. Crews were keeping everyone a block away as a safety precaution.\nThe victim's wife escaped without injury.\nPhx Fire says 80yo man who died was a gun dealer who loaded ammunition as a hobby. Unclear what sparked this fire. pic.twitter.com/ZHGZCxPup7\n— Jared Dillingham (@JaredDillingham) May 6, 2016\nNeighborhood sealed off after deadly fire in NPhx. Rounds of ammunition heard going off in home. One man dead pic.twitter.com/yJNRmbnls9\n— Jared Dillingham (@JaredDillingham) May 6, 2016\nRefresh this story for updates as we learn more about this developing situation.\nCopyright 2016 KPHO/KTVK (KPHO Broadcasting Corporation). All rights reserved."}