{"uri": "http://www.miamiherald.com/news/local/crime/article62157577.html", "title": "Police: Feud on Facebook put Miami 6-year-old in deadly crossfire", "dct": "Wed, 24 Feb 2016 08:34:00 GMT", "id": "31b62f704c16c6cc3a3988361c825521", "content": "A virtual argument on social media escalated into a hail of very real bullets that cost 6-year-old King Carter his life, police said on Wednesday.\nOne teenager killed, another injured in two separate Northwest Miami-Dade shootings\nTwo teens, one wearing a GPS ankle monitor, were seeking vengeance over a beef on Facebook when they opened fire outside a Northwest Miami-Dade apartment complex Saturday on a man police would identify only as “Ju Ju.”\nJu Ju returned fire. The shooters survived. The crossfire killed King, a Van E. Blanton Elementary School first-grader on his way to buy some candy.\nAfter obtaining a pair of search warrants, police on Wednesday arrested Irwen Pressley, 17, and Leonard Adams, 18, and charged them with second-degree murder for the death of King and attempted first-degree murder of their intended target. Both were booked into the Turner Guilford Knight correctional facility without bond.\nPressley, on probation for strong-arm robbery, was wearing a GPS monitor on his ankle that police said placed him at the scene at the time of King’s shooting. Police also recovered a 9 mm handgun at Pressley’s home that police say the teen admitted he used to target Ju Ju. Police also said Adams suffered a neck wound from a bullet fired by Ju Ju.\nThe arrests, just four days after the incident, came quickly for a community shaken by a string of shootings of juveniles and children.\nThe child’s murder led to marches, candlelight vigils and pleadings for information or tips. Many in the community, fed up with the almost daily violence, came forward, police said.\n“The support has been overwhelming,” said Santonio Carter, King’s dad. “But it shouldn’t take the death of my 6-year-old son to orchestrate community love. We are not stopping.”\nKing Carter’s Zip code should not have been a death sentence for him\nCountywide, close to four dozen children or teenagers, most of them in poor neighborhoods, have lost their lives to gunfire and dozens more have been wounded since January 2015.\nEven as police scrambled to track down suspects, the cycle of gun violence involving youths continued.\nMiami-Dade Schools Superintendent Alberto Carvalho, who has personally appeared at shooting scenes to appeal for an end to the violence, applauded the work of the police, but also pointed to several shootings since King's death on Saturday.\nOn Wednesday evening, police were investigating two more shootings in Northwest Miami-Dade — a 16-year-old shot in the leg and another teen that was killed blocks away. On Tuesday, a 13-year-old was shot by a woman driving a car in North Miami Beach who thought she was about to be carjacked. The same day a 16-year-old was shot in the elbow by a group of boys on bicycles, as he played outside with friends in South Dade.\n“There's an ongoing carnage that hasn't stopped,” Carvalho said\nThe arrests of Adams and Pressley aren’t likely to be the last ones in an investigation that still has many unanswered questions. Police said “a multitude” of weapons were confiscated and that there were at least three shooters. They wouldn’t say whether it was a bullet from Adams or Pressley that killed Carter. And it wasn’t clear Wednesday whether police had yet matched the bullet that killed the child to any of the weapons they recovered.\nPolice also urged the community to remain vigilant. They’re still looking for an early 2000 model black Lexus that likely has several bullet holes.\nWe lost a 6-year-old. But also two young men ruined their lives.\nAssistant Miami-Dade police director Freddie Ramirez\nAssistant Miami-Dade police director Freddie Ramirez, frustration clear in his voice, lamented that teens were escalating social media arguments into real world violence.\n“We lost a 6-year-old,” he said. “But also two young men ruined their lives.”\nPressley has a lengthy arrest record that began when he was 13, police said. Few of the charges against him have stuck.\nFlorida Department of Law Enforcement records show he was arrested in 2012 by Miami-Dade police and charged with robbery. In 2013, Opa-locka police charged Pressley with armed robbery with a deadly weapon and aggravated assault. Both cases were dropped by prosecutors.\nPressley was arrested again in May 2014 by Miami-Dade police. He was charged with armed carjacking and armed robbery with a deadly firearm. He entered Boot Camp at Miami-Dade Corrections in 2015, which allowed him to wear the monitor he had on at the time of King’s murder. It was not clear Wednesday whether Pressley or Adams had retained attorneys.\nMiami-Dade State Attorney Katherine Fernandez Rundle said that two of Pressley’s cases were dropped because one victim died and another was Ukrainian and prosecutors were having a tough time getting him to return for trial.\n“Little King,” as his father referred to him, was playing with friends in the parking lot of the Blue Lake Village apartments — also known to locals as “Colors” — at Northwest 103rd Lane and 12th Avenue at about 2 p.m. Saturday. His dad had just given him $3, and the child was on his way to buy his favorite chewy candy.\nThat’s when Pressley and Irwen showed up in a black car looking for Ju Ju, police said. They spotted him in a stairwell, according to the arrest affidavit, got out of the car and took aim. Ju Ju returned fire. Adams was hit in the neck but not seriously wounded. Pressley and Adams jumped back into the car and fled.\nDuring the exchange, King was hit in the chest. He was rushed to the hospital, where he was pronounced dead. The community response came fast and strong. An anguished Santonio Carter made a YouTube video of him crying out for his son that went viral. Vigils and marches took place Sunday and Monday. Another is planned Thursday in advance of a Sunday funeral that also will likely be heavily attended.\nFamily, friends, community activists and elected leaders demanded justice for King and begged anyone with information to come forward. A Crime Stoppers reward was upped to $26,000. A group of pastors and activists collected money from friends and their flocks to increase the reward. The killing resonated statewide. In Tallahassee, the state Senate held a moment of silence in honor of King to end its daily session.\nBefore the arrests, Santonio Carter said he received a surprising phone call on Tuesday morning: A voice on the other end of his cellphone that didn’t give a name was “crying and screaming and saying he’s sorry, apologizing,” Carter said.\nThe father’s response: “Thank you. You need to turn yourself in.”\nPolice said they weren’t told about the phone call. And it’s uncertain whether it came from Adams or Pressley, who did not turn themselves in.\nBy Tuesday police had obtained search warrants for Pressley and Adams. They found them at their homes early Wednesday. Adams had a gunshot wound in his neck. Pressley was still wearing the monitor that police said placed him at the scene, police said.\nThey were taken to police headquarters in Doral where they were questioned for several hours. Police said Pressley confessed in a statement and that Adams admitted his involvement. They were charged early Wednesday afternoon.\nMiami-Dade Police Director Juan Perez weighed in from California. “Unfortunately, this is not a victory by any stretch of the imagination as we lost an innocent life,” he said.\nBy Wednesday afternoon Fernandez Rundle and Miami-Dade Mayor Carlos Gimenez had made their way to the news conference at police headquarters to announce the arrests. Also there were homicide bureau Maj. Calvin James and Assistant Director Freddie Ramirez.\n“A ridiculous feud gets turned to violence — violence that can take your life,’’ said the mayor. “There’s something wrong here.”\nKing will be buried at 2 p.m. Saturday at New Birth Cathedral of Faith in Opa-locka.\nHerald Staff Writer David Ovalle contributed to this report."}