{"uri": "http://www.usatoday.com/story/news/nation/2013/06/09/santa-monica-shooting-john-zawahri/2405015/", "title": "Santa Monica shootings claim fifth victim", "dct": "Sun, 09 Jun 2013 00:00:00 GMT", "id": "8735133227c8875072840cb452551a5a", "content": "VPC\nJohn Zawahri is believed to have killed his father and brother at the start of his shooting spree.\nTwo days after a shooting spree shocked the affluent beachfront city of Santa Monica, the rampage claimed a fifth victim Sunday with the death of a woman who had been shot in an SUV.\n\"I am saddened to report that Marcela Franco passed away this morning at Ronald Reagan UCLA Medical Center,\" Santa Monica College President Chui Tsang said on the school's website.\nTsang said Franco, 26, had registered to attend classes this summer. She was a passenger in the vehicle being driven by her father, school employee Carlos Franco, when both were shot. Her father died of his wounds Friday.\nThe heavily armed gunman, who was killed by police in the school library Friday, was identified by Police Sgt. Richard Lewis Sunday as John Zawahri, whose victims included his father and brother, according to the Associated Press.\nThe Los Angeles Times reported that Zawahri, 23, had been angered by his parents' divorce and had some mental health issues in his past. The Times cited several sources in Los Angeles and in Washington, D.C., who declined to be identified because the investigation was ongoing.\nThe Times said detectives believe Friday's shooting spree was sparked by a family dispute. The suspect's past mental health issues occurred when he was a juvenile and are not available to the public, the Times said.\nCNN reported that John Zawahri's attack began when he killed his father, Samir \"Sam\" Zawahri, 55, and brother, Chris Zawahri, 25, in a Santa Monica house.\nAs that house burned, the shooter opened fire on a woman driving by, wounding her, and then carjacked another woman, Santa Monica Police Chief Jacqueline Seabrooks said. Seabrooks has declined to identify the shooter, saying family members were still being notified.\nThe carjack victim, identified by the Times as Laura Sisk, 41, of Culver City, told the Times that when the man, dressed in black and body armor and wielding an assault rifle, approached her vehicle she assumed he was with the police or Secret Service. She noted that President Obama was visiting the city that day.\n\"You're going to drive me to Santa Monica College and let me out,\" the man told her, according to the Times. \"He looked like a SWAT officer,\" she said.\nBut that idea was shattered when the man fired a number of shots into a bus and into a neighborhood. At least one woman was injured, according to witnesses. As she drove, crying and shaking, the gunman reassured her, she said.\n\"He told me to calm down, 'You'll be all right,' \" Sisk told the Times. \"He said he'd let me go if I didn't do anything stupid.\"\nHe did let her go. Police had received multiple 911 calls by the time the gunman arrived at Santa Monica College, a two-year school with about 34,000 students. The gunman was enrolled at Santa Monica College in 2010, Seabrooks said.\nOn campus, he opened fired on Carlos' Franco's Ford Explorer. Franco was killed and his SUV crashed through a brick wall into a faculty parking lot. His passenger and daughter, Marcela, was gravely wounded and died Sunday.\nThe gunman walked across campus, shooting indiscriminately. Students were seen leaping out windows of a classroom building and running for their lives. Others locked themselves behind doors or bolted out emergency exits.\nTrena Johnson, who works in the dean's office, heard gunshots and looked out the window and saw a man shoot a woman in the head outside the library. College Police Chief Albert Vasquez told CNN a woman was fatally shot outside the library; her name had not been released.\nSurveillance photos showed the gunman in black strolling past a cart of books into the library with an assault-style rifle by his side.\nVincent Zhang, an economics major, was studying in the library when he heard a female scream, \"No, no. Please no.\"\nZhang ran out of the emergency exit while others took cover in what Seabrooks called a \"safe room,\" barricaded behind a door.\nThe gunman was killed by police in the library.\nThe superintendent of the Santa Monica-Malibu school district told CNN that Zawahri attended a high school for students behind in academic credits in 2006.\n\"We are shocked and deeply saddened by the tragedy that so far has taken five lives and, once again, shatters our nation's confidence,\" Superintendent Sandra Lyon said.\nPolice had contact with the gunman in 2006, but because he was a juvenile then, authorities couldn't release further information, Seabrooks said.\nContributing: Associated Press"}