{"uri": "http://articles.dailypress.com/2013-05-28/news/dp-nws-hampton-shooting-vigil-20130528_1_gunshot-wound-hampton-commonwealth-monday-evening", "title": "Two teenagers arrested in Hampton carnival shooting", "dct": "Tue, 28 May 2013 00:00:00 GMT", "id": "20f55252f3a0334a658742697eb1e976", "content": "HAMPTON — Police have arrested two juveniles in connection with the Saturday evening shooting that left 16-year-old Ralphael Davis Jr. dead and wounded four other teenagers.\nHampton Commonwealth's Attorney Anton Bell told a crowd of close to 200 about the arrest at a candlelight vigil held for Davis on Monday evening in the Hampton Coliseum parking lot.\n\"This young man was killed senselessly,\" said Steven Brown, a community organizer and friend of the Davis family. \"We will not wait for the next big event to happen, and we will not forget what happened here. This violence needs to stop.\"\nA 15-year-old male and 17-year-old male were arrested and each charged with one count of murder, four counts of maiming and five counts of using a firearm in the commission of a felony, according to Hampton Police.\nPolice did not release the names of those suspects.\nFriends and family described Davis as an outgoing young man who loved his family.\n\"There are so many of you I don't know, and many of you that I do,\" said Dawn Moses, the victim's aunt. \"Ralph touched so many lives.\"\nJay Brooks teaches at Bethel High School where Davis took a class last semester called algebra functions and data analysis. The teacher described Davis as a student who tried his hardest and who wasn't overly boisterous in class.\n\"He was a quiet kid, although he did have a couple friends in class,\" Brooks said.\nBrown and other speakers described youth violence as a disease spreading throughout the community.\nInvestigators accused the suspects of shooting at a group of teenagers during an argument near the Hampton Coliseum Spring Carnival.\nEmergency responders found Davis, of Hampton, suffering from a gunshot wound to his upper torso shortly after 11 p.m. Saturday. He was lying in the road in the 1900 block of Coliseum Drive when paramedics arrived.\nDavis was transported to a local hospital and pronounced dead at 11:14 p.m.\nThe four other victims were found in parking lots of nearby hotels, according to police.\nOrganizers have since canceled the carnival. The event had been scheduled to continue through June 2.\nA 14-year-old male who was shot in the back had improved from critical condition to stable, Hampton police spokesman Jason Price said Monday evening.\nAn 18-year-old male from Hampton and a 17-year-old male from Newport News both suffered gunshot wounds to their legs. A 16-year-old female from Newport News suffered a gunshot wound to her ankle. All three were treated and released from the hospital shortly after the incident.\nIn 2012, shots were fired as the carnival was closing, although no one was injured, according to police.\nMonday evening's vigil was organized by Best Kept Secret, a non-violence organization based in Newport News.\nAnyone with information that will assist police is encouraged to contact the Hampton Police Division at 727-6111 or Crime Line at 1-888-LOCK-U-UP."}