{"uri": "http://wavy.com/2014/04/15/charges-could-be-dropped-in-hampton-carnival-shooting/", "title": "Charges withdrawn in Hampton carnival shooting", "dct": "Tue, 15 Apr 2014 21:07:00 GMT", "id": "a23a9cefdf7bb620a16b657c9529e86e", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nHAMPTON, Va. (WAVY) — A judge ordered the murder charges against two Hampton teens will be nolle prosequi Wednesday.\nThe decision means the charges accusing Ryan Taybron and Eric Nixon of the first degree murder of 16-year-old Raphael Davis at the Hampton Coliseum Carnival last May will be set aside, but can be brought back if new evidence surfaces.\nThe case has fallen apart due, in part, to unreliable witnesses.\n“Our eye witnesses, who are juveniles, are just not participating or wanting to cooperate in this process,” said Assistant Commonwealth’s Attorney Artisha Todd in court Wednesday. “We ask that the charges be nolle prosequi.”\nThe judge was also asked to drop the charges altogether by defense attorneys, who argued the nearly year-long process has been tarnished by speedy trial issues, witness issues, jail time served by both Nixon and Taybron, and other mishaps.\nWAVY.com has extensively reported on Eric Nixon’s wrongful release from Newport News Jail. Ryan Taybron was released from jail pending trial due to speedy trial violations, and Eric Nixon was released due to the same speedy trail concerns in February.\nBut Todd made an impassioned plea for Judge Taylor not to drop the charges: “Ralph Davis was murdered, and what the defense wants the court to do is forever ban the Commonwealth from ever bringing these charges against these two people for a murder.”\nJudge Taylor agreed not to drop the charges: “I have heard sufficient evidence to grant the Commonwealth’s motion, so motion is sustained.”\n“I think [the Commonwealth is] going to re-indict, based on kind of, sort of, might want to,” said Taybron’s attorney, Leslie Siman-Tov.\nBut even if the charges are brought back against Taybron and Nixon, Siman-Tov said very assuredly that the Commonwealth will still deal with the same witness issues.\nOn July 30 during a preliminary hearing, Nixon’s Attorney Greg Bane questioned the witness who was shot allegedly by Nixon. She absolutely cannot say for certain whether Nixon pulled the trigger, and this is direct from the preliminary hearing:\nBane: “Did [Nixon] pull out the gun and shoot it, or were there more than one person shooting?”\nWitness CJ: “I didn’t see him shoot the gun.”\nBane: “You never saw Eric shoot the gun?”\nWitness CJ: “I didn’t see him shoot nobody.”\nBane: “You didn’t see him shoot anybody?\nWitness CJ: “No.”\nBane: “So, you just saw him with a gun?”\nWitness CJ: “Yes, but I didn’t see him shoot nobody.”\nOutside Hampton Circuit Court on Wednesday, Nixon’s mother, Alfreda McCoy, said the main witness wants to be friends with her son on Facebook: “I’m very upset because, if these witnesses are so terrified, then why the hell is she wanting to friend Eric on Facebook?”\nTaybron’s mother, Melissa, told WAVY.com she is upset as well.\n“I’m very disappointed because they may re-indict him, an it starts the whole process all over again,” she said. They need to focus on who did the crime for real. They need to focus on that, and put the time and resources into that, and maybe you will get your killer.”\nPolice now have no one in custody or awaiting trial for the murder of Ralph Davis. Count on 10 On Your Side to keep you updated on any developments in the case.\nNewport News police have been asking the community to start turning in…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}