{"uri": "http://www.nbc-2.com/story/33783154/clewiston-shooting-leaves-1-dead-4-injured", "title": "Clewiston shootings leave 1 dead, 4 injured", "dct": "Wed, 23 Nov 2016 18:55:00 GMT", "id": "3f4d1e7b0ef8332bd5509a56f21b1485", "content": "CLEWISTON -\nOne person was killed and four others injured in a string of shootings across the Harlem community Tuesday night in Clewiston.\nWitnesses said they heard dozens of gunshots outside a restaurant on Harlem Academy Avenue, then more just a few blocks away.\nAt the Harlem Gardens Apartments, 28-year-old Anthony Holder, a father of two, was shot and killed behind his mother's home.\nHolder's mother said she was lying in bed when she heard gunshots. She soon learned those bullets were the ones that killed her son, and now she's hoping deputies can find his killer.\nDeputies said the string of shootings started around 11 p.m. at the apartment complex.\n\"Two little boys, they young, they really young. That's the sad thing about it; they got to grow up without their daddy,\" said Larry Jackson, a friend of Holder.\nDeputies said while investigating Holder's death, they heard gunshots from two other areas in the community.\n\"Last night I hear like 35 gunshots and it was no 9 mm or 22s, it was AR-15's or AK-47s,\" said Delvin Hughes, the father of Tyrell Taylor, who was killed in the Zombicon shooting in Fort Myers last year.\n\"I was just walking out the store, and I just heard rapid fire,\" Jackson said, stating he dropped to the ground until the shooting was over.\n\"Three guys got shot right here, and I know all of them,\" he said.\nTwo of the victims had just returned home from college for Thanksgiving, according to Jackson.\n\"Probably some initiation but I don't know what the motive,\" Hughes said.\nNBC2 is working to find out the conditions of the four people who were injured.\nFDLE is helping in the investigation, and deputies said there are no suspects. Crime Stoppers plans to offer a reward in hopes that someone will come forward with information."}