{"uri": "http://www.heraldonline.com/news/local/crime/article45046719.html", "title": "Police: Rock Hill boy, 3, killed by self-inflicted gunshot wound", "dct": "Mon, 16 Nov 2015 07:00:00 GMT", "id": "24d93a41bb1164a8007e340bdef81329", "content": "As daylight faded Monday afternoon, police investigators were still trying to determine how a toddler got his hands on a gun and fatally shot himself one day earlier in his family’s home.\nSavion Barrow, 3, was taken by EMS ambulance from his home on Amelia Avenue to Piedmont Medical Center, where he was pronounced dead by hospital staff shortly after his arrival Sunday afternoon, York County Coroner Sabrina Gast said.\nCapt. Mark Bollinger, spokesman for the Rock Hill Police Department, said Savion somehow got his hands on the gun and shot himself. He was found in a bedroom of the home when officers responded about 3 p.m.\nNo charges have been filed. Details about the shooting, including the type of gun involved, who owned it and how the child got his hands on it, were limited late Monday afternoon while investigators still worked the case.\n“The detectives don’t want a lot of information out because it’s an active investigation,” Bollinger said.\nfacebook twitter email Share\nPolice give details in death of Rock Hill boy who found gun, shot himself\nPolice say 3-year-old Savion Barrow found a gun and shot himself at his Rock Hill home. This is the second case in Rock Hill within two months in which a toddler fired a loaded weapon.\nby Teddy Kulmala\nSunday’s shooting was the second by a toddler in Rock Hill in barely a month.\nLast month, police charged the great-aunt of a 2-year-old boy with unlawful carrying of a gun after the child was able to get the gun while in the woman’s car, accidentally shooting the child’s grandmother. The grandmother survived.\nA man who answered the door at the Amelia Avenue home Monday said he was Savion’s uncle. He shared pictures of Savion, but said he didn’t have “too much to talk about.”\nThere was at least one other child, a 10-year-old girl, and at least four adults in the home at the time of the shooting, according to a police report.\nNeighbors were stunned Monday that the boy had been killed.\nJacquie McCann, who lives next door to the family, said she could only cry when she heard what happened. She said Savion had an “infectious” laugh and smile.\n“We literally just moved to Rock Hill within weeks of when he was born,” she said. “It’s an interesting perspective from a 3-year-old point of view. It was fun to watch him grow.”\nMcCann said Savion’s family were their first friends after moving onto the block.\n“They’re good people; it’s just tragic,” she said. “We’re just gonna give them time to do what they’ve got to do, then we’ll go over and see if there’s anything else we can do to help them.”\nOther neighbors also were shocked at Savion’s death, recalling how he often played outside.\n“It is just terrible,” said neighbor Tonya Hamm.\nHamm said police were at the house for hours on Sunday.\nChampagne Howell, 20, walked along the news vans and reporters on Amelia Avenue on Monday. She has lived in the neighborhood for several months and said she often saw Savion outside playing.\n“He used to always come up to me and call me his girlfriend,” she said with a chuckle. “For him to be 3 and talking about a girlfriend – you know.”\nAn autopsy was scheduled for Monday afternoon.\nTeddy Kulmala: 803-329-4082, @teddy_kulmala\nAndrew Dys: 803-329-4065"}