{"uri": "http://www.wave3.com/story/33441158/person-shot-killed-in-southwest-charlotte", "title": "Teen shot, killed one day before his birthday", "dct": "Thu, 20 Oct 2016 23:04:00 GMT", "id": "baed579edf367a3fed6e7976bd527a4e", "content": "CHARLOTTE, NC (WBTV) -\nA teenager was killed in a shooting in southwestern Mecklenburg County Thursday. Police are investigating the incident as a homicide.\nThe shooting happened Thursday evening on the 13000 block of Armour Ridge Drive, which is off of Corsica Forest Drive near S. Tryon Street.\nOfficials confirmed that 17-year-old Jahee Tycari Hoke was pronounced deceased at the scene. Police said they are investigating the incident as a homicide, but did not give further details.\nHoke would have turned 18 on Friday.\n\"Real stunning yeah,\" said the victim's grandmother, Trieste Nickelson. \"Wouldn’t believe it. Can’t believe it. Still don’t. Numb.\"\nNickelson described Hoke as \"real out going. Got to be outside. He loved people. He loves to protect someone. He’s a protector and we always – I call him daddy because he thinks he’s our dad. Him and his big brother are best friends.\"\nHis grandmother said Hoke and his family moved from Virginia to Charlotte over the summer. The 17 year old enrolled at Olympic High School and planned to play basketball.\nHoke was on the verge of some rites of passage.\n\"Birthday today – 18\" said his Nickelson. \"Just registered to vote. He was excited to go vote with his mother and going to get those driver’s license.\"\nPolice said they received a call for a fight but investigators have not said what may have led to the shooting. They said it appears the people involved knew each other. They said several witnesses were being interviewed.\nHoke's relatives don't believe he was in the fight.\n\"You know you go to to school and you have your friends, after school you may get together with them, or you may see other on the weekend - that’s it. That’s it\" said his grandmother. \"We’re going to miss him. We’re going to miss him. That’s an empty spot right there.\"\nCharlotte Mecklenburg Police say Hoke is the 48th homicide victim so far this year. At this time last year, the city had 50 homicides.\nCopyright 2016 WBTV. All rights reserved."}