{"uri": "http://www.mlive.com/news/detroit/index.ssf/2016/03/dad_who_left_loaded_gun_in_clo_1.html", "title": "Dad who left loaded gun in closet pleads guilty to son's murder", "dct": "Tue, 08 Mar 2016 20:44:31 GMT", "id": "9784e6cc3295e7e034cba039418ed4d1", "content": "DETROIT, MI -- Christopher Head, a 45-year-old Detroit father, didn't pull the trigger; he wasn't even in the room. Still, Head been convicted in the murder of his 9-year-old son, Daylen.\nDaylen died of a shotgun wound to the head he suffered Nov. 9 in an upstairs bedroom at the father's Detroit home.\nDaylen or his 10-year-old sister -- neither Detroit police nor the Wayne County Medical Examiner have determined or are willing to reveal -- accessed Head's loaded 12-gauge shotgun that rested barrel-down in an unlocked closet feet from the video game system Dalyen played on.\nThe gun discharged, struck Daylen in the head and killed him almost immediately. The manner of death was listed as \"undetermined,\" and according to Dr. Francisco Diaz with the Wayne County Medical Examiner's Office, who shot Daylen and what led to the gun being fired won't likely ever be determined.\nChristopher Head's Detroit-based attorney, Byron H. Pitts, said following his preliminary examination that Wayne County Prosecutor Kym Worthy overcharged the grieving father in reaction to the tragedy, but has little evidence to support the accusations, especially the murder charges\nHead pleaded guilty to second-degree murder, involuntary manslaughter, second-degree child abuse, being a felon in possession of a firearm, possession of a short-barreled shotgun and felonious use of a firearm.\nHis admission of guilt was not part of a plea deal, Worthy spokeswoman Maria Miller said. It was part of what is called a Cobb's agreement, under which Head reserves the right to withdraw his plea if the judge issues a sentence in excess of the recommended guidelines.\nThe guidelines in Head's case call for a minimum prison sentence of six years.\nNot only was Head -- because of his felony record -- not legally allowed to possess a gun, but the gun the gun itself was illegal, the judge said at his preliminary examination.\nThe shotgun in Head's closet, which he said was left there by his landlord and last handled by him a week prior to Daylen's death, had a 15.75-inch barrel. Shotguns are required to have a barrel at least 18 inches long in Michigan.\n\"The court's decision based on wanton and willful disregard.\" Holmes said after binding the charges over. \"At the point Mr. Head placed a sawed-off, loaded shotgun in a closet, unlocked, accessible to children. And now the natural tendency is that a child will find that gun.\n\" ... The gun should never have been there.\"\nHead's prior criminal record includes a plea of no contest to extortion and aggravated stalking and the dismissal of an arson charge in 2006, according to Wayne County online records. He was also found guilty of illegally carrying a concealed pistol in 1989 and cocaine possession in 1994.\nIt was lunchtime on a school day for Daylen, who attended third grade at the Academy for Business and Technology in Dearborn, when he died.\nHead said his children were at his home for a weekend visit, but he was unable to return them to their mother in time for school because of a broken tie-rod on his car.\nDaylen was upstairs in a bedroom playing video games and Head's daughter had just completed washing up in the bathroom, according Head's statement the day of the shooting.\nHead's daughter told her father she was taking some things upstairs.\nDetroit Police Homicide Detective Robert Holmes read portions of Head's statement during the preliminary examination last year.\n\"I kind of blew it off; about 15 minutes later, I heard a boom,\" Head told police. \"As I was running up the stairs (my daughter) was running downstairs yelling, 'Daddy, I didn't do nothing, I didn't do nothing.'\"\nHead said saw his son and the shotgun on the floor. He threw the shotgun into the closet, ran downstairs and said, \"he's gone, call the police, call 911.\"\nDaylen's sister kept saying: \"Daddy, I didn't do nothing, I didn't do nothing, where's my brother, I want my brother, I didn't do nothing.\"\nHolmes read the last words in Head's statement: \"I love my boy and I'm going to miss him.\"\nHead admitted to police the gun was in an unlocked closet. He said he believed the safety was engaged said the children were forbidden from entering.\nJudge Shannon Holmes said it's unreasonable to believe a verbal command to an unsupervised child would be enough to keep Daylen from entering the off-limits closet.\n\"Every 9-year-old I know is going to go into that closet,\" she said.\n.convicted of second-degree murder in the shotgun"}