{"uri": "http://www.enterprisenews.com/article/20150615/NEWS/150617718/0/breaking_ajax", "title": "Brockton men charged in shootings held without bail", "dct": "NODATE", "id": "3f5a8185f7deadad53eddaaccff22d0a", "content": "BROCKTON - Two Brockton men who police said were involved in recent shootings in the city were arrested Sunday and are being held without bail.\nStephen Cabral, 24, and Kelby Correia, 23, were both arrested at 20 Winter St. in Taunton by Brockton and State police Sunday morning.\nCabral shot five people outside Bar Dino's on 1002 Main St. in Brockton Sunday May 24, said Brockton Police Lt. Kenneth LeGrice. One man was seriously injured but survived.\nCorreia shot a 29-year-old Stoughton man in the leg Saturday night outside a busy strip mall at the corner of Oak and Belair streets across from DW Field Golf Course, police said.\nShow more...\nLeGrice said both men were \"part of the same crew.\"\nInside the Taunton house, police found 300 grams of heroin, LeGrice said. They are expected to face drug charges in Taunton.\nCabral was charged with five counts of assault and battery with a dangerous weapon, unlawfully carrying a firearm and unlawfully discharging a firearm within 500 feet of a building.\nCorreia was charged with two counts of assault and battery with a dangerous weapon and unlawful carrying a firearm.\nThe men pleaded not guilty at their arraignment in Brockton District Court Monday. They were ordered held without bail.\nPolice believe they may have been involved in other shootings in Brockton recently, LeGrice said.\n\"We believe that they've been responsible for some of the gun play that's gone on in the city,\" he said.\nIn both cases, LeGrice said, they used video surveillance and information from the public to identify Correia and Cabral as suspects.\n\"We got the public's cooperation which was great,\" LeGrice said.\nIn addition to Brockton police, other agencies that assisted in the investigations were State Police assigned to Plymouth County District Attorney Tim Cruz's office, the Southeastern Massachusetts Gang Task Force attached to the FBI, the Violent Fugitive Apprehension section of the State Police, the State Police gang unit, the State Police Special Tactical Operations team, State Police Air Wing and members of the State Police Troop D Community Action Team.\n\"This has taken a lot of work,\" LeGrice said. \"I personally think Brockton is safer now with the actions of all those units that participated yesterday (Sunday).\""}