{"uri": "http://www.wtae.com/news/4yearold-child-among-two-people-shot-in-mckeesport/37767972", "title": "Attorney: Client living in McKeesport home is target of recent shootings", "dct": "Tue, 02 Feb 2016 23:26:00 GMT", "id": "ae73d3211ff956ade6388d4670b0450d", "content": "McKEESPORT, Pa. —\nA 4-year-old child and a 20-year-old woman were injured in a shooting in McKeesport early Tuesday morning.\nInvestigators say several people were inside a home on Evans Avenue when multiple shots were fired into the house from the back.\nPolice also say shots were fired at this same home several days ago.\nPittsburgh's Action News 4 has confirmed that the home targeted by gunfire is occupied by Rashawn Walker, who lives there on court-ordered electronic home monitoring. Walker has firearms charges pending. He was acquitted in a 2014 fatal shooting and was questioned in connection with a fatal shooting last year.\nWalker's defense attorney confirmed that Walker lives in the home with the four-year-old child and 20-year-old woman injured by gunfire.\nWalker's attorney tells Pittsburgh's Action News 4 reporter Kelly Brennan that it's clear to him that Walker or someone close to him is a target. The attorney will file a court motion Wednesday to have Walker moved for his safety.\nThe woman and child were expected to survive the shooting, which was the third in McKeesport in several days. Police have not said if the incidents are related.\n\"I'm ready to be in tears,\" said Bill Dougherty, a former neighbor.\nDougherty moved to White Oak two years ago to escape the violence.\n\"I think it's disgusting,\" he said. \"Two years ago, my wife almost got shot in my house. I sold it for $5,000 just to get out of here.\"\n\"I have some children here, and 15 shots the other day? We were right there with it,\" neighbor Georgette Salih said. \"The babies aren't safe.\"\n\"It used to be a really good town, but it's gone downhill,\" Dougherty said.\nPolice are asking anyone with information on any of the crimes to call them.\nDownload the WTAE mobile app to stay updated with breaking news throughout the day. (Free in your app store.)\nFollow updates from Pittsburgh's Action News 4 reporter Katelyn Sykes on Twitter @KatelynsWTAE."}