{"uri": "http://bakersfieldnow.com/news/local/coroner-rules-homicide-for-man-found-dead-in-apartment-near-mass-injury-party-shooting", "title": "Coroner rules homicide for man found dead in apartment near mass-injury party shooting", "dct": "NODATE", "id": "9f0a3227f487bdd408a8f1fb08a387a7", "content": "BAKERSFIELD, Calif. (KBAK/KBFX) —\nThe man found dead in an apartment near a mass-injury party shooting is confirmed to have died from a gunshot wound.\nThe Kern County coroner's office on Thursday also confirmed the victim as 21-year-old Miguel Angel Leon Bravo. Friends and family previously shared his name with Eyewitness News.\nAnd, officers say they're convinced Bravo was killed by a stray bullet from the party shooting just up the block.\n\"It appears in all likelihood that he's just an innocent victim who was lying on a mattress inside of his apartment,\" spokesman Ray Pruitt told Eyewitness News on Thursday.\nPruitt said the evidence so far points to that conclusion.\n\"The timeline fits, all the information we have fits, the evidence fits,\" Pruitt said. \"Where he was struck by gun fire is directly in line of sight.\"\nBravo was lying in his small apartment in the 2900 block of Belle Terrace Avenue, about a block south of the party on Stephens Drive.\nEarlier this week, Sheriff Donny Youngblood said investigators believed Bravo's death was related to the party shooting, which took place July 16 on Stephens. Fourteen partygoers, mostly teenagers, were wounded.\nBravo's body was discovered a couple days after the party, along with what appeared to be a hole from a stray bullet in the door of the apartment.\n\"... We believe his death will be related,\" Youngblood said this week during a meeting of the Kern County Board of Supervisors The sheriff brought up the case while speaking on public safety and budget matters. \"It was only 500 yards away, where the round went through the door. It's all indications that that young man was a victim.\"\nInvestigators say a group of people had been kicked out of the party, but some returned, and shot at other partygoers in the street. Pruitt said it's believed three men came back, and they fired at least two guns.\nHe said investigators think at least one person with the group from the party, then returned fire.\n\"It looks like more than likely the person or persons who returned fire toward the suspects were responsible for the bullet that struck him in the head,\" Pruitt said.\nHe also said Bravo had lived in the apartment for only a short time.\nAt the same apartment complex, neighbor Julio Prado said he waved at Bravo a few times. Prado said he also heard the shooting at the party.\n\"I heard shots like that was Friday night, like around 12,\" he told Eyewitness News. \"People screaming, running somewhere to our side of the street.\"\nPrado said that scared him, it was just too close to his family. But at the time, he had no idea someone from his complex had been killed.\nAnd, it was the next day that he stood outside the victim's apartment with another neighbor, worrying about the violence.\n\"I was talking to him and never ever knew there was a young man right there that was already dead,\" he said, \"we didn't even know that there was somebody there for days.\"\nBravo's body was found on July 18 after a friend reported not seeing him for a couple days.\nThe coroner's office on Thursday also officially ruled Bravo's death as a homicide.\n\"It's a homicide investigation now,\" Pruitt said. He said it's an ongoing investigation, and officers have gotten information which they're following up on.\nBut, there have been no arrests yet.\n\"To be quite honest, we've had very little cooperation,\" Pruitt said.\nHe adds it's frustrating because it's believed there were about 100 people there when the shooting at the party happened. Investigators want the public to come forward with information.\n\"So we can identify these suspects and get them off the street,\" Pruitt said, \"before they shoot somebody else.\"\nInvestigators say the public can give them information anonymously by calling Secret Witness at (661) 322-4040."}