{"uri": "http://www.live5news.com/story/25045920/four-wounded-after-shooting-at-a-north-charleston-club", "title": "Suspect arrested in N. Charleston club shooting", "dct": "Sat, 05 Apr 2014 14:30:00 GMT", "id": "511528baa43eb41e2330e8401ba59739", "content": "NORTH CHARLESTON (WCSC) -\nNorth Charleston Police arrested a suspect Friday in a club shooting that injured four people.\nMontreal Joseph Ford, 22, was arrested on charges of attempted murder and the possession of a firearm during a violent crime, following the March 22 shooting at Club Camouflage at 7550 Dorchester Rd., according to police. Ford had been identified as a suspect in that shooting, a North Charleston Police spokesman said.\nAuthorities found the first victim, a 32-year-old man, suffering from a gun shot wound to his leg. Another 32-year-old victim was found inside the club also suffering from a gun shot injury to his leg.\nA police report states that officers found a gun on the bar counter top, with multiple shell casings located in the immediate area. Police also found an ammunition magazine. Victims say a fight between two subjects was being separated by security when one of the subjects pulled out a handgun and began shooting as he left the establishment.\nInvestigators were notified that another victim had been dropped off at Roper St. Francis Hospital. Authorities say that victim had suffered a gun shot wound to his belly button and under his right arm. Investigators state that the victim was uncooperative and initially said that he was shot on Dorchester Road, then changed it to another street.\nPolice say another victim was found following a traffic stop in the area of Dorchester Road and Ranger Drive. According to police, a vehicle was stopped in the area after traveling at a high rate of speed. Investigators say after making contact with the people inside, they found another victim who was then transported to MUSC.\nWitnesses told police that they did not see the shooter, but heard three to seven shots during the incident. Another witness said the shooters were possibly two black males with one being a tall black male with a dreadlock hair cut. Officers say they were told that another black male, short in height, may have been involved.\nOfficials say none of the victims suffered any life threatening injuries.\nPolice say investigators also arrested Anthony Terrell Middleton, who was with Ford at the time of Ford's arrest, and who was found to have an active warrant with the City of Charleston.\nCopyright 2014 WCSC. All rights reserved."}