{"uri": "http://www.abcnews4.com/story/28169852/4-wounded-in-club-shooting-early-sunday-deputies-say", "title": "Arrest made in club shooting that wounded 4", "dct": "Sun, 22 Feb 2015 00:00:00 GMT", "id": "d0f1a758ca82eae6fb5440bba1410032", "content": "CHARLESTON COUNTY, S.C. (WCIV) -- Deputies have made an arrest in a club shooting that happened last weekend.A spokesperson for the Charleston County Sheriff's Office said Stanley Greene of Hazelwood Drive in Charleston is charged with two counts of attempted murder, two counts of assault and battery in the first degree, and possession of a firearm during the commission of a violent crime, for his involvement in the crime.Four people were wounded in a club shooting on Dorchester Road early Sunday morning.\nAccording to Charleston County deputies, the shooting happened shortly before 1 a.m. at the Charlie O's Night Club in an unincorporated area of Charleston County. Deputies say there was an altercation inside the club that led to shots being fired and several people being hit.\nOfficials say shots were also fired on the outside of the club as well.\nSome of the victims were driven to Medical University Hospital while EMS transported others. Deputies say some of the wounds are non-life-threatening while others were more serious.\nAccording to an incident report released Monday, two men were hit twice in the stomach, another man was hit in the leg, and a woman was shot in the arm.\nAnother woman thought she had been shot in the foot but later revealed she had been stepped on by someone wearing a stiletto heel, the report states.\nOfficials said they do not have an update on the victims' conditions.\nCurrently, deputies do not have a motive for the shooting and the victims were not able to give investigators a description of the suspect.Officials said Greene was already in custody at the Sheriff Cannon Detention Center on unrelated charges when these charges were added.The additional charges include being a habitual traffic offender, violating a restraining order and two counts of failure to pay child support.\nThe Charleston County Sheriff's Office is investigating this incident. Anyone with information is asked to contact Charleston County Consolidated Dispatch Center at 843-743-7200 or Crime Stoppers at 843-554-1111."}