{"uri": "https://www.washingtonpost.com/local/public-safety/dc-police-arrest-third-suspect-in-barber-shop-shooting-that-wounded-child-father/2016/02/26/95b372c0-dcd3-11e5-81ae-7491b9b9e7df_story.html", "title": "D.C. police arrest third suspect in barber shop shooting that wounded child, father", "dct": "Fri, 26 Feb 2016 00:00:00 GMT", "id": "84fd00677e06857fa166d0eefb938853", "content": "The third and final suspect sought in a shooting inside a crowded Barracks Row barber shop that wounded a man and his 21-month-old son this month has been arrested, D.C. police said Friday.\nAnthony Chambers, 25, of Southeast Washington was charged with assault with a dangerous weapon. A D.C. Superior Court judge ordered Chambers detained Friday until a preliminary hearing Monday.\nTwo other suspects, Terrance Atchison, 21, of Southeast Washington and Barry Bloomfield, 27, of Southwest, were arrested earlier. Each was also charged with assault with a dangerous weapon.\nThe shooting occurred Feb. 12 about 1:40 p.m. inside Wrenn’s barber shop in the 1000 block of Eighth Street SE near the Washington Navy Yard and an area filled with restaurants and stores.\nPolice said three men dressed in black and wearing masks opened the front door of the shop and two opened fire. The barber said the gunmen aimed at the victim, who was in a chair waiting his turn and holding his son on his left shoulder. The man was struck twice in the left leg and right ankle. His son was struck in the lower left leg.\nPolice said in an arrest affidavit for one of the suspects that the wounded man told detectives “he doesn’t know why anyone would shoot him.” But police said in the affidavit that one of the alleged gunman’s brothers was wounded in a shooting in May in Southwest Washington, and that detectives think the man who was shot at Wrenn’s was responsible.\nThe affidavit says that “would be a motive ... to retaliate.”\nNo charges have been filed in the May shooting in Southwest.\nCorrection: An earlier version of this report misidentified in the quadrant in which Wrenn’s is located."}