{"uri": "http://journalstar.com/news/state-and-regional/nebraska/omaha-police-killed-wounded-in-attack/article_0f237aac-d5ec-5844-bd1a-db58611f9cd7.html", "title": "Third person dies after shootings at Omaha party", "dct": "Sat, 24 Jan 2015 00:00:00 GMT", "id": "f7fbef9f330c1def003678a4df22ad15", "content": "OMAHA — Gunfire erupted during a crowded party in a vacant house in Omaha early Saturday, leaving three people dead and five wounded, and most witnesses refusing to help investigators, according to police.\nAs many as 50 people were in and around the small house near 34th and Blondo streets when shots were fired \"by multiple shooters\" around 2 a.m., Omaha Police Chief Todd Schmaderer said. No arrests have been made, and police said they were confident the shootings were gang-related.\nThe vast majority of people at the scene refused to help police, the chief said during a news conference Saturday evening. He said he understood witnesses' fear but pleaded for them to come forward.\n\"Now that you are away from that scene and have opportunity to be away from any intimidation, I'm asking you for the sake of the community to contact law enforcement,\" Schmaderer said.\nPolice said 19-year-old JaKela Foster and 24-year-old Latecia Fox were declared dead at the scene, while 26-year-old Cameron Harris died several hours later. Schmaderer said it's unclear if any victims were intended targets or bystanders.\nFoster's mother, Kristina Young, waited for hours outside the small tan house on the city's northeast side while investigators gathered evidence. She said she wasn't going to leave until the body of her daughter was taken away.\nYoung said her boyfriend got a call from an aunt shortly before 2 a.m. telling him there was a shooting that may have involved Foster, who had a 1-year-old son. She said a friend later called to say Foster had been shot.\nYoung said her daughter knew the person throwing the party. She said she had asked her daughter not to go, knowing there would be drinking and worried there could be violence.\n\"I've been in Omaha long enough to know generally what happens at these parties,\" she said.\nShe said her daughter agreed and told her she was going elsewhere Friday night, but that she apparently went to the party anyway.\n\"To the person who pulled the trigger, I want to say it's just senseless. It just needs to stop. I now have a 1-year-old grandson that has no mother,\" Young said while fighting back tears.\nThe five people who were wounded were identified as Adrelet Bush, 25; Treveon Lillard, 20; Trenelle Miller, 21; Johnny Tiller, 21; and Jordyn Zyla, 20. Schmaderer said they were in stable condition late Saturday afternoon, though other details about their conditions weren't released."}