{"uri": "http://www.cantonrep.com/article/20131110/NEWS/131119993", "title": "Man killed, 3 wounded in shooting outside Canton bar", "dct": "Sun, 29 Jan 2017 06:36:32 GMT", "id": "cf5d6c841a58aefc2bcfcbb1b665cfc7", "content": "Terrell L. Skinner, 26, 1944 Rowland Ave. NE, was killed in the parking lot of the Whistle Stop bar.\nA city man was fatally shot and three others wounded early Sunday morning in the parking lot of the Whistle Stop bar.\nTerrell L. Skinner, 26, was killed, police said. Police were called about 2:40 a.m. to the scene outside the bar at 1215 Tuscarawas St. W. The bar also is known as the A & R Whistle Stop.\nSkinner suffered several gunshot wounds to the head and body, according to police. He was pronounced dead at the scene by the Stark County Coroner's Office. The homicide is the city's ninth this year, said Police Chief Bruce Lawver.\nHe said the Whistle Stop has not been a trouble spot for police.\nDwight Ellis, 45, 4501 Yale Ave. NW, was charged with aggravated murder and three counts of felonious assault, police said.\nCapt. Dave Davis said that Skinner apparently got involved in a fight outside the bar after it closed. The fight, which started out as a \"pushing and shoving melee,\" involved about 10 people and led to punches and some people getting knocked to the ground, Davis said.\nAfter opening fire at Skinner, it appears that Ellis stood over the victim and shot him again, Davis said, citing footage from a security camera posted about 30 feet from the scene.\nEllis had gotten a handgun out of his vehicle, police said. He has a license to carry a concealed handgun, Lawver said.\nPolice are continuing to investigate what led to the shootings, Davis said.\nEllis was at the scene in his vehicle when police arrived, police said. He does not have a \"significant criminal past whatsoever,\" Lawver said.\nTHREE OTHERS SHOT\nEllis and Skinner did not know each other, Davis said. Ellis apparently had arrived at the Whistle Stop earlier with Amanda Depasquale, 27, of Canton, he said. They had gotten into a dispute inside the bar and apparently started pushing and shoving outside after it closed, Davis said.\nDepasquale and two others got shot - Juanita Depasquale, 45, and Vanessa Van Almen, 24, both of Canton. Each victim was taken to a local hospital, and the injuries were not life threatening, according to police.\nSkinner has a child with Van Almen's sister. (Information has been corrected to fix an error. See correction at end of story. 11:30 a.m. Nov. 12.)\nDavis said he believes that Ellis did not intentionally shoot any of the three women. It's possible that a bullet or bullets struck the ground and then ricocheted into some of the victims, he said. Ten shell casings were found at the scene.\n'HARD TO BELIEVE'\nAmanda Depasquale was shot in the shoulder; Van Almen was shot in the left leg; and Juanita Depasquale was shot in the lower arm, according to police. Juanita Depasquale is Amanda Depasquale's mother, said Pat Huff, a relative.\nHuff said that Juanita Depasquale was struck in the wrist. The same bullet hit Amanda Depasquale in the shoulder, she said. The younger Depasquale was released from the hospital on Sunday, Huff said.\n\"It's just hard to believe,\" she said of the shootings.\nCORRECTION: Shooting victim Terrell L. Skinner has one child with Jessica Catterino and was helping to raise her other child. She is the sister of another shooting victim, Vanessa Van Almen. Their relationships were wrong in this story when first published Sunday. Incorrect information was supplied to the Repository."}