{"uri": "http://www.wmcactionnews5.com/story/28885495/community-reacts-to-4th-suspect-arrested-in-7-year-old-girls-death", "title": "Community reacts to 4th suspect arrested in 7-year-old girl's death", "dct": "Thu, 23 Apr 2015 22:45:00 GMT", "id": "759cb29c660411233b4121869c3927fa", "content": "MEMPHIS, TN (WMC) - The murder of two young Memphis girls are connected now that police officers arrested the brother of 15-year-old Cateria Stokes, who was shot in the head as she slept in her bed on April 10. Carlos Stokes is charged in connection with the murder of 7-year-old Kirsten Williams.\nKirsten's family said they are relieved to hear of a new arrest Thursday, but like neighbors, they're still praying for peace and begging for justice.\n\"I went across there to go and see the little girl, and it just tore me apart,\" said Kirsten's neighbor, Larry Baker.\nBaker was on his front porch when the 7-year-old was gunned down during a drive-by shooting two weeks ago. Investigators have not yet said whether Williams was the intended target.\n\"The blood was running down the sidewalk and I had never hurt like that in my life,\" Baker recalled.\nCarlos Stokes was arrested Thursday morning and charged with first-degree murder. Witnesses told police that Stokes planned the shooting and also opened fire. He is the fourth suspect arrested in connection with the 7-year-old's murder.\nCarlos Stokes is confirmed to be 15-year-old's Cateria Stokes' brother, who lived at the same house where she was shot and killed earlier in the day.\n“If you knew who shot your sister, don't go and shoot another innocent child, that's not right,” said Kim Taylor, Carlos Stokes' neighbor.\nThree other men were charged last week in Williams' death. Police say they are known gang members. Investigators say it's not clear if the 7-year-old girl was the intended target.\n“You've got two innocent young children caught up in something they probably didn't know anything about,” said Taylor.\nA man was shot on the same street the day before the 7-year-old was killed. However, it's not clear if that shooting led up to what some neighbors are calling \"retaliation shootings.\"\n“Shooting a child is messed up,” said neighbor Erico Marion.\n“It's like the children just getting out of hand, they're out of control,” said Taylor.\n\"If anything happened to me I wouldn't be coming back retaliating with a pistol or a gun, I'll try to get back to the bottom of it with the police department,\" said Baker.\nWMC Action News 5's Jerry Askin talked to former gang member, Joe Hunter, who said shooting at a child is breaking a big rule in the gang culture.\nHunter said, \"A drive-by shooting is the most coward thing you can do. Especially when you do it in a neighborhood where you know there are children.\"\nAccording to the affidavit, Carlos Stokes denies having any knowledge of what happened. This is not Stokes' first arrest. He had previous arrests, including disorderly conduct and a few drug charges. Stokes is due in court on Friday morning.\nKirsten Williams' family told WMC Action News 5's Jerry Askin that they are still grieving, but are relieved a fourth man has been charged in her death.\nNo one has been arrested for the murder of Cateria Stokes. If you know anything call Crime Stoppers at 901-528-CASH (2274), text 'AWARD' to 274637 or visit www.528cash.org.\nCopyright 2015 WMC Action News 5. All rights reserved."}