{"uri": "http://www.wmcactionnews5.com/story/28812571/person-in-custody-for-murder-of-7-year-old-girl", "title": "3 gang members in custody for murder of 7-year-old girl", "dct": "Wed, 15 Apr 2015 20:19:00 GMT", "id": "ad856782c37c7caacbcf4c1bb6323aee", "content": "MEMPHIS, TN (WMC) - Three men have been arrested and charged in the murder of 7-year-old Kirsten Williams.\nMemphis police director Toney Armstrong announced the first two arrests just after 4 p.m. Wednesday.\n“When I say we literally turned this city upside down, we literally turned this city upside down,\" Armstrong said.\nJordan Clayton, 21, and Branden Brookins, 19, both face first-degree murder charges.\nArmstrong said both men are known gang members. He says they've been arrested before.\nA third suspect has since been identified. Carl Johnson, 19, was charged with first-degree murder in Williams' death. Johnson is also a known gang member.\nKirsten Williams was shot and killed while playing outside with friends on April 10. Armstrong said the shooting stemmed from a drug deal gone wrong.\nInvestigators have not determined if the shooter meant to shoot and kill the child or someone else at the home, but police say someone at the location was the intended target.\nArmstrong seemed frustrated during his Wednesday address. He blamed the justice system for allowing repeat criminals to walk the streets.\n“For whatever reason, he's out on our streets again, and this time has committed the ultimate act of murder. That murder of a 7-year-old child,\" Armstrong said.\nDistrict Attorney Amy Weirich says Tennessee sentencing laws determine prison time and probation.\n\"Most of these offenders are going to get out of custody,\" Weirich said. \"It's a very small percentage of the criminal defendants we prosecute and put behind bars that actually spend the rest of their life behind bars.\"\nWilliams' visitation is Friday evening. Her funeral is set for Saturday at 11 a.m. Both will be held at Soul Winners Church in Hickory Hill\nWilliams is one of multiple children shot in the last week in Memphis.\nThe three men charged in the 7-year-old's murder are due in court Thursday morning.\nCopyright 2015 WMC Action News 5. All rights reserved."}