{"uri": "http://www.fox13memphis.com/top-stories/1-injured-overnight-in-whithaven-shooting/465558946", "title": "4 injured in shooting outside Whitehaven club", "dct": "Wed, 09 Nov 2016 17:36:00 GMT", "id": "39ee671f38d77c1b1e4440fb34bf37c2", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nFour people are recovering tonight after being shot overnight at a Whitehaven night club.\nEarly Wednesday morning, just before two, Memphis Police tell FOX13 a shooting took place in front of Pure Passion Adult Night Club\nWhile police were working to find the shooter, Memphis Fire Department was putting out a fire that was started on the roof.\nAssistant District Attorney Paul Hagerman told FOX13 the night club was so violent in 2007 his office shut it down.\n\"The club had more than its share of problems back then,\" Hagerman said.\nJust two weeks ago in October, another shooting happened in the parking. One person was shot.\nHagerman said the two recent shootings have put the eyes of the attorney general’s office back on the club.\n\"We've got to prove a connection, prove that they aren't doing things they could be doing and in some way they are operating is contributing to the problem,\" Hagerman said.\nWe called Pure Passion to ask management if they were worried if the recent incidents would cause the District Attorney’s Office from stepping in and closing the club again.\nHagerman told FOX13 he has a solution for the club’s management to allow the DAG’s office to help solve the problem of violence before it gets any worse.\n\"In the past we have had situations like this and done interviews like this and have encouraged the owners of these clubs to get in contact with our office as soon as they can,\" Hagerman said.\nFOX13 has learned in the last four months police have responded to 36 calls at Pure Passion.\nThe Memphis Fire Department told FOX13 the fire did not damage the inside of the business. It was contained to the roof, and it’s still under investigation.\nMemphis Police have no one is in custody, and this is still an on-going investigation.\n© 2017 Cox Media Group."}