{"uri": "http://scallywagandvagabond.com/2016/11/amy-buckley-lance-buckley-daughters-dead-murder-suicide-stafford-virginia/#g4JuSK1T00m8AWGO.01", "title": "Why? Amy and Lance Buckley and two daughters dead in murder suicide", "dct": "Thu, 17 Nov 2016 00:00:00 GMT", "id": "97404db010ded66c362f388dc4350ef5", "content": "Amy and Lance Buckley murder suicide: What led to a Stafford, Virginia father killing his wife and their two infant daughters?\nAmy and Lance Buckley a Stafford, Virginia couple have been found dead alongside their two daughters in a suspected murder suicide.\nStafford County Sheriff’s Office told of finding the parents along with their two infant children, Claire and Abigail, aged 5 and 18 months at the family home Thursday morning.\nTo date police said they were treating the tragedy as a murder suicide.\nHow the family came to die has yet to be revealed.\nThat said a report via fredericksburg.com told of authorities believing the father killed his wife and two young daughters before committing suicide inside their Windsor Forest home.\nThe report told of Amy and Lance Buckley living with his parents at their rural home with their two young daughters, moving in some time last year.\nNews of the family murder suicide led to the husband’s parents being too distraught to speak come Thursday night along with neighbors on the quiet suburban street.\nOf note, the couple had welcomed their second child Abigail in April last year, eleven days before Lance Buckley vanished from home.\nIn turn the father became the subject of a missing person’s appeal after disappearing while on his way to Howard University where he was studying a PhD in microbiology.\nAt the time his wife pleaded for his return, describing him as the ‘love of her life’.\nHe was missing for more than a week before being found safely in Maryland.\nYet to be necessarily understood is what led to the father disappearing and whether family fissure brought strain upon the couple’s marriage?\nWhile police have declined to specify how the family died, a statement released by the sheriff’s office confirmed they were treating it the tragedy as a ‘domestic murder suicide’.\nRead a statement come Thursday evening:\n‘The Stafford County Sheriff’s Office is conducting an investigation into the deaths of four individuals in the Windsor Forest Subdivision in the northwestern portion of the county.\n‘The preliminary investigation has determined the incident was a domestic related murder-suicide.\n‘The ages of the deceased are a 35-year-old male, a 30-year-old-female, a five-year-old female and an 18-month-old-female.’\nNot necessarily understood is whether police had previously been called to the family home or if there had been other reports of disturbance?"}