{"uri": "http://wavy.com/2016/11/06/victim-taken-to-hospital-after-shooting-in-norfolk/", "title": "14-year-old in stable condition after shooting in Norfolk", "dct": "Sun, 06 Nov 2016 13:54:00 GMT", "id": "18baeef85e51736ec281245e73ed04c9", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nNORFOLK, Va. (WAVY) – Police are searching for leads following a shooting at the intersection of West 29th Street and Gosnold Avenue Sunday afternoon.\nNeighbors tell 10 on your side that they’re concerned about the violence in their neighborhood. They described the scene where police found the teenager as hectic.\n“When we were coming through there was tape all over here, all the way back here and all blocked off,” said Lorraine Simons, who was dropping off a friend and saw the scene where police found the teen.\nShe says the situation was scary. “What happened? That’s the only thing that was on my mind. That’s when I hear someone got shot,” said Simons.\nPolice got the call of a teenager with a gunshot wound around 12:30 today. They have not released any information about where he was shot. They say he was dropped off at that intersection\n“It’s sad. You know coming from a neighborhood where there is so much potential, everyone is just getting killed or shot,” said Shanika Meekins, who was visiting family in Norfolk. She lives in Hampton and says she tries to spend as little time in the area as possible.\n“It’s very scary, you don’t know what’s going to happen,” said Meekins.\nThe 14-year-old boy was taken to a nearby hospital. We’re told he’s in stable condition.\n“Usually here around Park Place that’s all you actually see. The shooting, people getting into arguments and carrying on with the gun issue,” Meekins said.\nAbout one month ago, there was a fatal shooting in the same area where first responders found the teen today. The violence has neighbors worried about their safety.\n“It’s a lot of kids out here. And just like now, it’s kids out here and people shoot and don’t even think about bullets that have no name. And its scary, that’s all I can say is its scary,” said Simons.\n10 on your side is still working to learn why the teenager was shot. Police have not released any information on a suspect\nAnyone with information is asked to call the Crime Line at 1-888-LOCK-U-UP.\nStay with WAVY.com for further information.\nNewport News police have been asking the community to start turning in…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}