{"uri": "http://www.aberdeennews.com/news/local/official-taken-to-hospitals-after-police-involved-shooting-work-continues/article_6883eae4-cd7b-5fd3-9f0f-61619c32f5d3.html", "title": "Aberdeen police officer, 1 other injured in incident", "dct": "Mon, 15 Aug 2016 06:00:00 GMT", "id": "f5b89a88c77b58304a1b62910ee94937", "content": "An Aberdeen police officer and one other person were injured during an officer-involved shooting incident early Sunday morning on Aberdeen's east side.\nThe incident happened when police responded to a call at 324 S. Marshall St. at 12:10 a.m. Sunday. \"During the call an officer discharged his duty weapon,\" according to a news release from the South Dakota Attorney General Marty Jackley's office.\nResidents around the apartment building said six or more shots were heard fired in rapid succession.\nAn officer was injured in the incident, and taken to a hospital where he was treated and released, Aberdeen Police Chief Dave McNeil said Sunday afternoon. The officer will be on administrative leave from the department, which is protocol for officer-involved shootings, McNeil said.\nHe declined to name the officer involved.\nThe other person involved, Ehkhu Hser Poe, 21, of Aberdeen, was taken to a hospital where he was being treated for his injuries, according to the release from the attorney general's office. Poe's condition was unavailable Sunday; neither Sanford Aberdeen or Sioux Falls, nor Avera St. Luke's Hospital, had that name on their patient registry.\nIt is not known how Poe or the officer suffered their injuries. McNeil would not say if anyone was taken into custody, referring those questions to the state's attorney's office.\nAberdeen Fire and Rescue battalion chief Stacy Vrchota confirmed Sunday that two people were taken to area hospitals after the incident.\nSara Rabern with the attorney general's office wouldn't comment Sunday on the identity of the officer involved, or the circumstances leading up to the officer discharging his weapon. She expects the officer's identity to be released in the next day or so and a full report of the incident should be ready in about 30 days.\nBrown County Sheriff Mark Milbrandt deferred all questions to the South Dakota Attorney General's office, but said that the Department of Criminal Investigation is investigating the incident.\nThe incident began at around 12:15 a.m. Sunday at the Marshall Apartments, 324 S. Marshall St. That's on the northwest corner at the intersection of South Marshall Street and Fourth Avenue Southeast, behind the Super City Plaza.\nAberdeen Fire and Rescue was called when someone attempted to light furniture on fire in an apartment, Vrchota said. Vrchota believes it was apartment unit 12. Aberdeen police were already on scene, Vrchota said.\nIt was unclear how and if the fire in the apartment and the police-involved shooting outside of the apartment complex are related.\nA half-dozen gunshots were heard by several residents who live in the area and spoke with the American News Sunday morning. Shell casings were visible on the ground on Fourth Avenue Southeast, just off the Marshall intersection. Police early Sunday had placed several safety cones blocking that area, as officers walked the adjoining yards with flashlights.\nOne neighboring resident, Landon Yerdon, said he saw three police officers trying to arrest a man outside the apartments. The man was on the ground at that time and resisting arrest, Yerdon said.\nVideo footage from Yerdon's phone shows a figure lying on the ground with multiple police officers surrounding him.\nThe video shows the person being taken from the scene by medical personnel.\nAberdeen resident Troy Ochsner, watching police work from the Super City parking lot, said he heard what sounded like six to eight shots at around 12:15 a.m.\n“Shots were loud. Police started showing up in droves,” Ochsner said. “It was a lot of shots in succession. It was just 'Boom! Boom! Boom!'\"\nOfficials from Aberdeen Police, Aberdeen Fire and Rescue and Brown County Sheriff's Department were on scene.\nNeighbor Alicia Reed said she heard the sounds nearby as well.\n\"I was only two blocks away. It was a lot of shots. Whatever he had in his gun, he had to have fired it all.\"\nThe investigation continued in the area some 12 hours later, at noontime Sunday.\nFourth Avenue Southeast was still blocked off with crime scene tape from Vivian to Marshall Street. Alleys and some yards were also blocked. Residents were free to go to their apartments on foot, but not allowed through the crime scene. That area started in the northwest parking lot of the Super City Plaza and included a portion of Fourth Avenue just south of the Marshall Apartments building.\nThe Brown County Sheriff Mobile Command Unit was on scene. Officials were working with metal detectors and, a little later, a drone was dispatched and flew over the area.\nA box of burned materials could be seen in the yard of the apartment building, and there was a faint smoke smell in the hallway of the apartment; apartment 12 is on the third floor.\nAmerican News staff members Mondell Keck and J.J. Perry contributed to this report. Follow @smarvel_AAN and @Kelda_AAN on Twitter.\n+10"}