{"uri": "http://www.fayobserver.com/news/crime_courts/boy-gives-dispatcher-harrowing-account-of-fatal-shooting-of-parents/article_a987b70d-6a26-58b4-ab11-fb5ade578aa1.html", "title": "Boy gives 911 dispatcher harrowing account of fatal shooting of parents", "dct": "Thu, 07 Jul 2016 00:00:00 GMT", "id": "0a4e8d8813faf78077273a7c7a913008", "content": "The aftermath of a murder-suicide was captured Wednesday in the harrowing voice of the dead couple's 8-year-old son as he talked to a 911 dispatcher.\n\"I think my dad just killed my mommy and take the baby. Please come. Hurry... I'm scared,\" the boy tells the Cumberland County dispatcher.\nSheriff's deputies say Sherrell McNeill fatally shot Jessica Ann Parker, 32, about 6:15 p.m. Wednesday at a home the couple had shared on Cumberland Road. McNeill, 35, then shot Parker's 2-month-old son in the chest before fatally shooting himself, according to the Sheriff's Office.\nThe infant remained in critical condition Thursday in the intensive-care unit at Cape Fear Valley Medical Center, sheriff's spokesman Sean Swain said in a news release.\nSwain said Parker and McNeill are the biological parents of the 8-year-old who called 911 and his 7-year-old sister. Those children were not injured.\nHe said an argument at the home escalated into the shootings, but he gave no indication of why Parker and McNeill had been arguing.\nThe Sheriff's Office released a copy of the 911 tape Thursday afternoon. On it, the dispatcher calmly tries to extract information from the 8-year-old while waiting for deputies to arrive. Among the many questions, she asks the boy for his name, address, what he's wearing, where he's standing, what kind of gun his father had and where his mother and father were in the house.\nAt one point the frightened boy blurts out: \"My dad had a gun and then, and then, I think he killed my mom and then he held my baby brother and I think he killed him, too.\"\nParker's stepbrother, Shawn Locklear, said Parker had been moving out of the house at 3411 Cumberland Road and moving into one in Spring Lake.\n\"All I really know is that whoever the guy is she had been with split up and she was going to move stuff out of the place and he walked in on her and he did whatever was done,\" said Locklear, 32, of Downing Road in Cumberland County. \"She was supposedly to be in a different house soon. She was leaving.\"\nLocklear said Parker's mother and his father had driven from their home in Georgia to Cumberland County for a family gathering over the July 4th weekend. He said Parker had brought all of her children with her to the gathering, but McNeill didn't attend.\nTwo days later, about 6:15 p.m., Parker's 8-year-old son called 911 to report that his mother had been shot.\nAn obituary notice shows that McNeill and Parker had a child who died on May 12, 2014. Mitchell said the child died of natural causes at birth or shortly after.\nMcNeill went to prison in 1999 on a drug conviction. He faced several other charges, including assault by pointing a gun in 2004, but nothing since 2005, Cumberland County court records show."}