{"uri": "http://myfox28columbus.com/news/local/breaking-shooting-at-high-school-in-west-liberty", "title": "One in custody, one hospitalized after shooting at West Liberty-Salem High School", "dct": "NODATE", "id": "9b93cd6f86c6467e7b7ab43856806cde", "content": "WEST LIBERTY, Ohio (WSYX/WTTE) —\nWEST LIBERTY, Ohio (WSYX/WTTE) — A suspect is in custody after a student was shot Friday morning at West Liberty-Salem High School in West Liberty.\nChampaign County Sheriff Matt Melvin says a 17-year-old student is being held at a juvenile detention center.\nThe student fired shots around 7:35 a.m. hitting 16-year-old junior Logan Cole multiple times with a shotgun.\nThe scene was quickly contained because staff members pinned the shooter to the ground in a common area before officers got to the school.\nLaw enforcement is now calling the staff members heroes, saying they likely saved the lives of other children.\n\"They were in there with an armed suspect and neutralized that threat,\" says Sheriff Melvin.\nCole is at Nationwide Children's Hospital in Columbus. His family tells district superintendent Kraig Hissong that he is in critical but stable condition.\nHis family has released this statement:\nWe are thankful for the Lord’s protective hand on our son. We are also grateful for the outpouring of support from our family, friends, and community. We would like to ask for continued prayers for Logan. Also, we’d like to encourage prayer for the community, the other student, and his family. We are certain they have been deeply hurt as well. We are confident that God has a purpose and plan through this tragedy.\nThe school spent two-and-a-half hours bussing students to reunite with parents at Lions Park. It was an emotional scene as nervous parents waited for their children to get off the buses in that designated safe zone. The district notified parents of the shooting using a phone call system.\nNo motive is being released right now for the shooting, but law enforcement believes as of now that Cole was not targeted and the plan was likely to injure more people.\nSuperintendent Hissong says there was no indication that an attack like this might occur.\n\"I think a lot of us have played that thought in our minds a lot today,\" he says.\nStudents trained about two years ago with the sheriff's office to respond to emergencies like this. The training is called \"ALICE\" and encourages students to be active and barricade classroom doors.\nChampaign and Logan County deputies staked out in front of a home on Sinkhole Road in Champaign County for most of the day. They will be searching the property that is believed to be the home of the shooter.\nThe suspect is being kept at a juvenile facility as has a court date set for Monday. It is likely the charges the suspect faces will evolve over the weekend, according to the County Prosecutor Kevin Talebi.\nThe suspect was initially charged with felonious assault."}