{"uri": "http://www.nola.com/crime/index.ssf/2016/11/4_shot_in_central_city_drive_b.html#incart_most-read_crime_article", "title": "At shooting of 4 in Central City Friday, suspect pulled up in vehicle: NOPD", "dct": "Sat, 26 Nov 2016 18:09:35 GMT", "id": "7efa91073e53ce315a7b734d0a186426", "content": "The shooter who sprayed enough bullets at a crowd in Central City Friday afternoon (Nov. 25) to strike four people and scatter several shell cases did so after pulling up to the scene in a vehicle, New Orleans police said.\nA preliminary NOPD report says the victims were standing at the intersection of Magnolia and Felicity streets when \"an unknown subject pulled up in an unknown type of vehicle, firing several rounds that struck the four victims.\"\nThe report does not include a description of the shooter or of the vehicle he or she used in the drive-by shooting. Police said Friday each of the victims, three men and a woman, were shot once. One man was shot in the back, another was shot in the thigh and a third was wounded in an unspecified area, police said. The department said the woman was shot in the left shoulder.\nThere were four victims in a Friday afternoon (Nov. 25) shooting in Central City, New Orleans police said.\nOne of the injured men was seated in a wheelchair when he was shot, said witnesses. Another bystander said the area was full of people, in their homes and on the streets, when the gunfire broke out. More than 65 evidence cones were placed at the scene.\nA woman who lives nearby said she found two bullet holes inside her home, one in the ceiling and another in a wall.\nAbout 10 hours later in an unrelated incident in Algiers, a 37-year-old woman was struck by a stray bullet as she lay in bed inside a home in the 1700 block of Murl Street.\nNOPD spokesman Aaron Looneys said Saturday no additional information about the Central City quadruple shooting, including a description of the shooter or vehicle, was available. The shooting is still under investigation, he said.\nStaff writer Laura McKnight contributed to this report."}