{"uri": "http://www.courierpostonline.com/story/news/crime/2016/09/23/camden-murder-hill-carter/90901312/", "title": "Suspect caught in Camden girl's slaying", "dct": "Fri, 23 Sep 2016 00:00:00 GMT", "id": "8357131b341aa78fb8c242e31b2f2385", "content": "Jim Walsh/Staff photographer\nCAMDEN - A suspect in the murder of an 8-year-old Camden girl allegedly fled more than 800 miles to avoid arrest.\nHis mother and girlfriend allegedly lied to thwart investigators.\nBut authorities on Friday caught up to 18-year-old Tyhan Brown Jr., arresting the Camden man at an uncle's home in Clarksville, Tennessee.\nAn intensive search continues for additional suspects in the slaying of Gabrielle \"Gabby\" Hill-Carter, who was fatally shot Aug. 24 while riding a bike near her home, said Camden County Police Chief Scott Thomson.\nAuthorities have said Gabby, who would have started third grade this month, was the innocent victim of gang-related gunfire on the 900 block of South 8th Street.\nBrown, who lost his father to gunfire in 2012, is charged with the girl's murder.\nThomson did not detail Brown's alleged role, but said he is believed to be \"the principal actor in what took place that night.\"\nMOURNING GABBY: Community pays final respect\nAt a news conference Friday, Thomson said the remaining suspects \"have been hiding under a rock\" and \"it's only a matter of time before we flip that rock over.\"\nHe called Brown's arrest \"an important piece of the puzzle.\"\nThomson did not say how many suspects were being sought.\n\"This is not a moment for celebration,\" said the chief, flanked by elected officials and law enforcement officers. \"It's not even a moment for pause.\"\nGabby's mother, Meresa Carter, reacted to the arrest by asking friends and family to avoid negative behavior.\n\"We are not goin to start drama. We are goin to let the police do their job,\" she wrote in a Facebook post. \"This is not about how I feel and what chu wanna say or do,\" she added. \"Please this is more than enough.\"\nGabby's stepfather, Will Phillips, had hinted at an arrest Thursday night.\n\"#justiceforgabby is getting closer,\" he wrote in a Facebook post that superimposed Gabby's photo over sand running out in an hourglass.\nOn Friday morning, he sent a message to the slain child.\n\"Wat I tell u baby girl it was only a matter of time,\" Phillips said. \"That time is now. The rest will follow.\"\nGabby's name lives on: Brother born soon after slaying\nAuthorities offered a $76,000 reward for information leading to the arrest and conviction of Gabby's killer or killers, but Thomson said people with knowledge of the crime were not helpful.\nBrown's capture came after his mother, 35-year-old Shakia Land, and his girlfriend, 19-year-old Natasha Gerald, were charged with hindering investigators. The women provided false alibis for Brown, according to the prosecutor's office.\nInvestigators had identified Brown as a person of interest when hindering charges against his mother were announced on Sept. 15. Charges against Gerald, a Sicklerville resident, were announced Tuesday.\n\"The streets do talk,\" said Thomson. \"We had a pretty good idea early on,\" about Brown's alleged role.\nHe declined to detail Brown's background but said the suspect \"is familiar to law enforcement.\"\nThe suspect's father, also named Tyhan Brown, was shot in January 2012 while sitting in a parked car on a North Camden street. The 31-year-old man died three months later.\nA $1,000 reward was offered in that case, but an arrest was not reported.\nThe hefty reward offered for the arrest and conviction of Gabby's killer or killers had limited impact, Thomson indicated.\n\"We did not really receive the support we would have hoped for,\" he said. \"That's not to say the community in and of itself is callous to this.\"\nA murder warrant was issued two days ago for Brown, who is being held in a Tennessee jail on $250,000 bond. The suspect was arrested in a community about 50 miles north of Nashville.\nThomson said it was not known when Brown would be extradited to South Jersey.\nCamden Mayor Dana Redd and Camden County Freeholder Director Louis Cappelli Jr. were among elected officials who attended the news conference outside the city's police station.\n\"This is a great day for Gabby's family,\" said City Council President Francisco \"Frank\" Moran. \"Someone is going to come to justice.\"\nJim Walsh; (856) 486-2646; jwalsh@gannettnj.com"}