{"uri": "http://www.thecalifornian.com/story/news/my-safety/2017/01/13/two-killed-two-injured-sunrise-street-shooting/96548628/", "title": "Two killed, two injured in Sunrise Street shooting", "dct": "Fri, 13 Jan 2017 00:00:00 GMT", "id": "b8bf7751f5c256e940ca0c466c86f1d4", "content": "UPDATE Jan. 13: Two people died and two were wounded during a shooting on Sunrise Street on Thursday night.\nAround 9 p.m., Salinas police officers were on patrol in the area of Garner Avenue and North Sanborn Road when they heard gunshots, said Salinas Police Cmdr. Stan Cooper.\nLess than a minute later, Salinas police received an alert from the ShotSpotter gunshot location system, and that helped them greatly narrow down that the shots came from the 500 block of Sunrise Street. Shortly after that, authorities received a call from family members of one of the shooting victims, Cooper said.\nResponding officers located four shooting victims, and two of the men died at the scene. The others had non-life threatening gunshot wounds, and they were transported to a local hospital.\nIt appears that the men had been hanging out in the front yard of the home when the shooting occurred.\nShortly after the shooting, a citizen contacted police to report a green minivan was seen leaving the area immediately after the shots were fired. An officer heading to the scene saw a vehicle matching that description near East Boronda Road and Constitution Boulevard, Cooper said.\nThe officer began following the minivan while waiting for backup, but with all Salinas police officers available already at the shooting scene, police called in for assistance.\n“As you can imagine, we were extremely taxed on resources handling a large shooting scene and then having to divert back towards his location in order to help him out on that attempted stop so a mutual aid call went out at that time,” Cooper explained.\nDeputies from the Monterey County Sheriff’s Office as well as California Highway Patrol, including its helicopter, responded to assist. About 40 officers or deputies in total responded to the incident.\nThe minivan ended up in the Santa Rita area of North Salinas. Before assistance could arrive, the vehicle stopped and three males fled.\nAn extensive perimeter was set up, and a deputy was able to locate a person of interest in the case. Police were able to locate two other people of interest, and in total, three people have been detained overnight as police investigate their potential involvement in the shooting.\nInvestigators are also speaking with numerous witnesses, conducting vehicle searches and more as the investigation continues. If charges are filed against the three people who have been detained, their identities will be released at that time.\nThe identities of those killed have not yet been released pending notification of more family. One of the men who died was in his mid-20s while the other man was in his late 30s, Cooper said.\nWhile the shooting has a lot of indicators of possibly being gang-related, it has not yet been confirmed that it is a gang related shooting, he added.\nSalinas police had more witness cooperation on this shooting than they normally do, and in particular, the citizen who immediately reported the minivan fleeing the area greatly helped police.\n“If it wasn’t for the witness who initially put out the description of the van, I seriously doubt the officer would have any clue it was involved in this thing so it really speaks to the importance of people seeing things and calling that information in and then us making the determination if that information is valid or not,” Cooper said.\nIf anyone has information on what occurred, they are asked to contact Detective Ken Henrickson at 831 758-7129 or kenh@ci.salinas.us or Detective Ken Schwener at 831 758-7276 or kenneths@ci.salinas.ca.us\nTo remain anonymous, contact the Salinas Police Department Anonymous Tip Line at 831 775-4222 or the We-Tip Line at 1-800-78-CRIME.\nORIGNAL: Two people died and two were wounded during a shooting on Sunrise Street on Thursday night.\nThe shooting occurred around 9 p.m. in the 500 block of Sunrise Street, off North Sanborn Road between Garner Avenue and Del Monte Avenue.\nThe two people who were injured had non-life threatening injuries, according to Salinas police. There are three people who have been detained by police, and the investigation into their potential role in the shooting is ongoing.\nFamily members tearfully returned to the scene on Friday morning as a Salinas police CSI unit visited the scene again.\nA press conference will be held on the incident this afternoon, and more information will be provided at that time.\nIf anyone has information on what occurred, they are asked to contact Detective Ken Henrickson at 831-758-7129 or kenh@ci.salinas.us or Detective Ken Schwener at 831-758-7276 or kenneths@ci.salinas.ca.us\nTo remain anonymous, contact the Salinas Police Department Anonymous Tip Line at 831-775-4222 or the We-Tip Line at 1-800-78-CRIME."}