{"uri": "http://komonews.com/archive/3-killed-1-critically-injured-in-gunfight-outside-auburn-bar-11-22-2015", "title": "3 killed, 1 critically injured in gunfight outside Auburn bar", "dct": "NODATE", "id": "adffa0e590536cebaf8cb48b78185dab", "content": "AUBURN, Wash. - Three men were killed and another man was critically wounded early Easter Sunday morning when a brawl led to a gun battle outside an Auburn bar, police said.\nAuburn Police Cmdr. Mike Hirman said dozens of people were leaving the Sports Page Tavern in Auburn at closing time around 1:45 a.m. when a fight broke out in the parking lot.\nHe said several people pulled out handguns and opened fire, and three men were found dead.\nA fourth man suffered multiple gunshot wounds and was in critical condition when he was taken to Harborview Medical Center in Seattle. His condition was not available Sunday afternoon.\nWitnesses identified the three men killed as 24-year-old Lorenzo Duncan, 26-year-old Nicholas Lindsay and Antuan Greer, who also is in his 20s.\nRelatives describe the friends as men who loved their families and did not run with gangs.\n\"We grew up with each other,\" said one friend of Greer. \"He wasn't even in that type of life for this to even happen to him. I loved that man.\"\nFriends of Lindsay tell KOMO News that he leaves behind two children.\nAnd friends of Duncan describe him as a polite young man who always dressed nicely.\n\"One of those gentleman you'd always want to have around,\" said one friend.\nHirman said police are still trying to figure out what led to the gun violence.\n\"We know there this dispute escalated to gunfire but in terms of why, we don't know that yet,\" Hirman said. \"We've had several dozen people at the scene ... trying to piece together all those stories does take time.\"\nHirman said some of the victims and suspects knew each other.\nPolice detained a person of interest and arrested that person on an unrelated weapons charge. Police have recovered two handguns. They believe several different firearms were used based on shell casings recovered from the scene.\nPolice in neighboring Federal Way and Kent stopped two vehicles that matched descriptions of cars leaving the scene of the shooting.\nThose vehicles were seized, and their occupants were being questioned, said Hirman. The car stopped in Federal Way was riddled with bullets."}