{"uri": "http://www.auburn-reporter.com/news/299950811.html", "title": "Kent man charged with murder in shootings outside Sports Page Tavern in 2013", "dct": "Wed, 15 Apr 2015 22:44:00 GMT", "id": "b2600bd3ad83481819924faa9b172924", "content": "Cleanthony Jimerson stood above Nicholas Lindsay and Lorenzo Duncan as they lay helpless on the ground and coldly fired numerous bullets into their bodies and heads, killing them.\nSo numerous witnesses described to Auburn Police Detectives the March 31, 2013 shootings in the parking lot outside of the Sports Page Tavern on Auburn Way North.\nThis week the King County Prosecutor’s office formally charged Jimerson, 29, with two counts of second-degree murder for the deaths of Lindsay, 24 and Duncan, 23, and with one count of unlawful possession of a firearm.\nAlso killed in the early morning melee was Antuan Greer, 21. But according to the affidavit for determination of probable cause, the document in which Auburn Police lay out their case against Jimerson, a stray bullet, fired by an unknown person, likely killed Greer.\nAs of Tuesday evening, Jimerson was awaiting extradition in a Texas jail. In asking for $5 million bail, prosecutor Charles Sergis described to a superior court judge the alleged shooter’s lengthy criminal record, which includes prior adult convictions for assault and negligent driving and several juvenile convictions.\n“Despite being a convicted felon, the defendant retrieved a gun from his vehicle in the course of a fistfight outside the Sports Page Tavern on March 31, 2013,” Sergis said. “He then returned to the scene of the fight, where he shot and killed both Nicholas Lindsay and Lorenzo Duncan while they were on the ground, defenseless. Several witnesses describe the killing as ‘execution style.’\n“The defendant poses a significant danger to public safety, given the callous disregard for human life he displayed during these crimes. He is likely to fail to appear since he is facing a very lengthy prison sentence if convicted,” Sergis said.\nAccording to what witnesses told detectives, events began to unfold hours earlier inside the bar, when two groups, one of them celebrating a going-away party for a relative of Jimerson’s who was to report soon to the Department of Corrections, got into a verbal dispute. According to the affidavit, the victim group, which was there to celebrate a birthday, included Lindsay, Duncan and Greer.\nAccording to court records, the argument started between two women on the dance floor, one of them of the group that included Duncan, Lindsay and Greer.\nThe physical fight only showed its head outside in the parking lot, five minutes after closing, as about 100 patrons milled into the parking lot and security was herding people to their cars to clear the lot, tavern owner Joe Mahoney told the Auburn Reporter shortly after the shootings.\n“On the dance floor in the building, there was no problem. They were arguing outside about a girlfriend dancing with another guy or something like that. Our security had no problems inside the building, none at all,” Mahoney said.\nLoud talk from one of the women outside led to a fistfight between the men in the two groups, according to the affidavit. According to the affidavit, a few of the fighters went south of the parking lot and out onto Auburn Way North to fight and the rest began moving north through the parking lot, toward where the fatal shots were later fired.\nAt some point a witness began filming the fight on his cellphone, but the video did not show conclusively from what direction the initial shots were fired.\nSeveral witnesses told police that a woman first fired a warning shot into the air to break up the fight. Hearing that, a witness said, a man, perhaps believing that shots were being fired in earnest, ran to his car across the lot and grabbed a gun. An estimated 20-to-30 seconds after the warning shot, multiple individuals pulled out their handguns and began firing.\nAlthough witness accounts of the fatal shootings vary widely, a number of witnesses identified or described Jimerson as the man who shot and killed the two men.\nOne witness recalled that as Lindsay lay on the ground, dazed but trying to stand up, he, the witness, heard the first gun shots. He said he then saw a man standing over Lindsay with a gun. The witness told detectives that while the man, whom he later identified as Jimerson from his clothing, was standing over Lindsay, it appeared he shot him twice, at close range, even though Lindsay had nothing in his hands, “like an execution.”\nAccording to the affidavit, as Duncan came up to help Lindsay, he, Duncan, suddenly wheeled around to run away, whereupon, the witness said, Jimerson shot him in the back, then shot him again while he was on the ground. According to the affidavit, this account matched that given by other witnesses, as did the descriptions of the shooter’s clothing.\nA friend later transported Jimerson to MultiCare Auburn Medical Center with multiple bullet wounds. Duncan, Greer and Lindsay were pronounced dead at the scene. Detectives who processed the scene found more than 16 spent casings, live rounds and bullets from several different caliber weapons, including .9 mm, .45. .40 and .44 caliber bullets."}