{"uri": "http://q13fox.com/2013/03/31/three-people-fatally-shot-outside-auburn-tavern/", "title": "Three fatally shot outside Auburn tavern; family searches for answers", "dct": "Sun, 31 Mar 2013 15:15:00 GMT", "id": "e6e21724a55e42a851b1a89e97defd19", "content": "AUBURN, Wash. — Police are investigating a shooting that left three dead and injured another early Sunday morning in the parking lot of the Sport Page Tavern in Auburn.\nAccording to Auburn police, a physical fight turned deadly just before 2 a.m. when people were exiting the tavern located in the 2800 block Auburn Way North. Police said a fight broke out between two groups and multiple gun shots were fired.\nFour people were hit by gunfire and three of those shooting victims died at the scene.The fourth victim was transported to Harborview Medical Center in Seattle. He was listed in stable but serious condition Sunday afternoon.\nPolice identified the victims as Antuan Greer of SeaTac, Nicholas Lindsay of Federal Way and Lorenzo Duncan of Des Moines.\nOne person of interest has been detained in the case, but police are still looking for more suspects, officials said. Many handguns have been seized.\nFamilies gathered at the Auburn hot-spot Sunday morning to mourn the loss of loved ones.\n“Lorenzo was an amazing young man,” said his uncle Vincent Humphrey. “He was hardworking, very responsible and never had any problems whatsoever.”\nDesha Timmerman, a sister of one of the victims, said it’s a horrible reality that her brother will not get to experience all life had to offer.\n“It was senseless that violence is going on today in this society,” Timmerman said. “Kids can’t go out and have fun and come home and be safe and have disagreements without shooting for no reason. Walk away from fights.”\nAuburn police said the nightclub has recently been a problem area.\nAnyone with information on the shooting is encouraged to call the Auburn Police Tip Line at (253) 288-7403."}