{"uri": "http://www.baltimoresun.com/news/maryland/crime/ph-ac-cn-annapolis-shooting-0606-20160606-story.html", "title": "Man charged in death of 17-year-old girlfriend claims he shot her by accident", "dct": "Tue, 07 Jun 2016 17:08:00 GMT", "id": "66f4009298817bcf816f0e4d23174b79", "content": "A Laurel man facing murder charges in the death of his 17-year-old girlfriend told police he shot her by accident, according to court records.\nRyan Surgeon, 19, was charged with the shooting death of Kymici Brown, of Annapolis. He faces charges of first-degree murder, second-degree murder, manslaughter, assault, reckless endangerment, illegal possession of a firearm and minor in possession of a firearm, court records show.\nDuring a hearing Tuesday in Annapolis, District Court Judge Danielle M. Mosley ordered Surgeon be held without bond and have no contact with witnesses.\nDeputy State's Attorney Claude de Vastey-Jones argued that Surgeon was on probation in another case and poses a public safety risk.\nAnnapolis police received a call shortly after noon Monday that the Annapolis Fire Department had responded to a report of a person shot in the 1300 block of Tyler Avenue in Annapolis, said Cpl. Amy Miguez, city police spokeswoman.\nResponding officers found Brown in a bedroom of the home with an apparent gunshot wound to the chest, police said. Brown was taken to the Anne Arundel Medical Center, where she later died from her injuries.\nSurgeon, described as Brown's boyfriend, was inside the home when officers arrived along with a woman, who identified herself as Brown's aunt, police said. Brown's aunt told police the couple spent the night at her home.\nThe aunt told police she was returning home when she heard a “pop.” She called out Brown's name but there was no answer, and she began knocking on her door and calling out because she forgot her keys, police said.\nEventually she was able to gain access to the home and saw Surgeon running down the stairs toward her, police said.\nSurgeon told her he needed help, and she followed him into a bedroom upstairs, police said. She told police she found Brown lying unresponsive on the floor.\nPolice said the woman helped Surgeon perform CPR on Brown.\nSurgeon later told police that he “accidentally shot Brown in the chest” while “playing around” with a handgun after he had smoked marijuana.\nMiguez said Surgeon had brought the gun into the home, but it’s unclear whether the gun was registered in his name.\nSurgeon told police that as the couple was getting up from the bed, he picked up the gun, cocked the hammer back and initially pointed it toward the floor.\nHe told police he began “playing around with the handgun and dancing” while holding it. He said the gun went off after he attempted to “de-cock the hammer,” shooting Brown, police said in charging documents.\nPolice said that Surgeon was sobbing and expressed remorse for shooting Brown.\nBrown was a junior at Broadneck High School in Cape St. Claire, where she ran track, said Bob Mosier, spokesman for Anne Arundel County Schools.\nHer death marks the fifth homicide in Annapolis this year."}