{"uri": "http://www.wdrb.com/story/23911589/residents-hoping-for-an-arrest-in-deadly-radcliff-shooting", "title": "Residents hoping for an arrest in deadly Radcliff shooting", "dct": "Fri, 08 Nov 2013 02:23:00 GMT", "id": "047285c9ca00cf2dce8851e643a88dc7", "content": "LOUISVILLE, Ky. (WDRB)---Five days after a deadly shooting inside a Radcliff building, the cleanup process is underway.\nA group of people returned to the scene Thursday, dragging items out to throw away.\nOur camera wasn't allowed inside, but when we stopped by, we could see bloodstains on the carpet.\nRadcliff Police officers were called to Shelby Avenue on Saturday morning around 3 a.m. for a deadly shooting.\n\"When our officers arrived, there were cars literally lined from 31W all the way back to the scene...people trying to leave the scene,\" says Officer Bryce Shumate with Radcliff Police.\nNearby neighbors watched the scene unfold as people were quickly leaving.\n\"Yeah, it's a little strange. Even in Radcliff. It doesn't seem like it's something that should be going on. It's a lot of people there and everything,\" says neighbor Kelly Amoroso.\nAuthorities found 47-year-old Darren Johnson of Radcliff inside, dead from a gunshot wound.\nHis friends were fearful to speak on camera on Thursday, worried that something could happen to them if they do.\nTwo other men were transported to the hospital with gunshot wounds. Another man showed up at a nearby hospital. Police say he was also linked to the party going on inside the building.\n\"Should the public be concerned at this point\", WDRB's Tamara Evans asked him.\n\"We'll we've got somebody that is out in our public that was involved in the shooting incident that night, and they're not in custody yet, so any information that helps us to find this subject always makes our community safer,\" says Officer Bryce Shumate.\n\"So is it fair to say at this point that the person who died, Darren Johnson, is a victim,\" WDRB's Tamara Evans asked.\n\"The case is still under investigation,\" Officer Shumate replied.\nPolice do say that they still need the public's help to solve this case and to help determine what happened inside this building early Saturday morning.\n\"Nothing is too minor for them to call in. Any information that they can give us will help our detectives in the investigation,\" says Officer Shumate.\nThe building where the shooting happened is a clubhouse for a local motorcycle club, but people affiliated with the group say they had leased the building out to another group on Friday, and it wasn't their event. The shooting happened early Saturday morning. We're told a party was going on inside.\nAnyone with information on the shooting can give Radcliff Police a call at their anonymous tipline. The number is 270-351-TIPS.\nCopyright 2013 WDRB News. All Rights Reserved."}