{"uri": "http://www.post-gazette.com/local/city/2015/11/02/Suspect-sought-in-shooting-death-of-11-year-old-in-Mount-Oliver/stories/201511020120", "title": "Mount Oliver teen shot in his home improves as his brother is mourned", "dct": "Mon, 02 Nov 2015 15:43:00 GMT", "id": "651e9e9251d8a825b5517647255cccbf", "content": "Maria Cain didn’t know why she heard loud bangs outside her Mount Oliver home Sunday night until she saw flashing red and blue lights through her living room window and heard screaming sirens tear down her usually quiet street.\nWhen she ran to her front porch, she heard her neighbor Amanda McKnight yelling, “They shot my boys!”\nA lone ambulance arrived in the 400 block of Hays Avenue, and Ms. Cain realized when she overheard police talking that her daughter’s 11-year-old best friend had been fatally shot.\nAllegheny County police said they believe someone knocked at the family’s door Sunday night, and when it was opened, shots were fired inside the home, killing David McIntyre, 11, and critically injuring his 16-year-old brother, Christopher “CJ” Mikula-Conrad.\nDavid, a sixth-grader at Pittsburgh Classical Academy in the West End, was pronounced dead at 8:48 p.m. in his home of gunshot wounds to the head and trunk. His death was ruled a homicide by the Allegheny County Medical Examiner’s office.\nCJ, a student at Pittsburgh Carrick High School, where he was on the wrestling team, was in stable condition, Allegheny County police Lt. Andrew Schurman said.\nMonday was scheduled to be the first day of off-season conditioning for the wrestling team, said coach Len Orbovick, who considered canceling the session after hearing of the shooting.\n“He’s a good kid,” Mr. Orbovick said of CJ, who recently started working one day a week at Maietta Restaurant on nearby Brownsville Road. “He was one of my JV wrestlers last year, as a ninth-grader. He was popular, he was one of the guys. And he worked hard.\n”My kids are pretty upset about it, and they’re all very concerned for him and his family. But I decided to keep things as normal as possible and go ahead and have the workout. Most of the guys came. We talked about Chris and how we could support him and his family and maybe going to visit him. We talked about counseling services that are available through the school, and of course, I told them I’m always there for them. The attitude with most of them is to move forward and try to make him proud.\n“What’s tough is that these kids have [experienced] this kind of thing before. We lost a football player at the beginning of football season to gun violence. I mean, this isn’t new to these guys, and it sucks.”\nThe boys’ stepfather, David McKnight, declined to comment when he briefly returned to their street-level brown brick home to collect some things before leaving again.\nAcross wide Hays Avenue, and up a flight of steps, Ms. Cain, 33, answered concerned phone calls and comforted tearful neighbors on her porch, overlooking David’s home.\n“I know my kids won’t be answering the door. We’ll be locked down, and I’m seriously thinking about moving, because it won’t be the same coming out here and not hearing his voice,” Ms. Cain said of David.\nShe was one of more than a dozen shocked neighbors and friends who aimlessly milled up and down the street, greeted each other with hugs and tears and created a memorial of balloons, a Pittsburgh Penguins teddy bear and a prayer candle on the family’s front porch.\nEveryone knew David.\nNeighbors remembered him as a friendly, hyper 11-year-old with big, round cheeks who took care of his own and even was willing to help neighbors take out their trash.\n“That boy knew what love was. Not only did he know what it was, he knew how to give it back tenfold,” Beth Krut, 47, of Mount Oliver said of her daughter’s friend. “You only get that from one place. You get it from your parents.”\nMs. Cain said David went to Bible school with her daughters and walked them to the nearby store, always sure to call and let her know they’d arrived safely.\nA GoFundMe site, “Funeral Fund for Little David,” raised more than $5,250 for the family within hours of its creation.\n“David was well liked by students and staff. The sixth-grader enjoyed art and reading, and he would often be found in the school’s library,” district officials said in a statement. “Our thoughts are with the family at this time as they deal with this tragedy.”\nThe district said counselors at Pittsburgh Classical Academy would support students or staff members who may need it and sent home a letter Monday to families at the school containing strategies to help children “in coping with this loss.”\nAt least five county detectives spent Monday morning interviewing neighbors, but no arrests have been made. Anyone with information about the shooting is asked to contact county homicide or Mount Oliver police.\nDan Majors contributed. Lexi Belculfine: lbelculfine@post-gazette.com or 412-263-1878. Twitter: @LexiBelc.\nFirst Published November 2, 2015 9:53 AM"}