{"uri": "http://lubbockonline.com/filed-online/2016-03-19/family-12-year-old-levelland-boy-said-shooting-was-accidental-hospital#.Vu4YNMf0hlI", "title": "Family of 12-year-old Levelland boy said shooting was accidental; hospital confirms boy is recovering well", "dct": "Sat, 19 Mar 2016 16:25:00 GMT", "id": "2ae2e2f84723bcab2d6fde666950c2e5", "content": "Family members of a 12-year-old Levelland boy who was reportedly shot in the head Saturday afternoon said the shooting was accidental.\nHis older sister, 18-year-old Heaven Garcia, said she has two children of her own and the accident left her terrified, yet thankful at the same time.\nShe said while she did not see the accident, she heard a loud “boom.” When she walked into the living room, she said, she saw what had happened and called 911.\n“He had blood running down his face and it was ashy,” she said.\nLevelland police responded before 1 p.m. to the house in the 1400 block of 12th Street. Police said they had received several 911 calls to the home in reference to the gunshot victim.\nWhen they arrived, police said, they found the boy had been shot in the head by a 34-year-old man. Soon after, police determined it was a possible accidental discharge of a weapon.\nHe was taken to Covenant Women’s & Children’s Hospital in Lubbock where a hospital representative said he was in stable condition, possibly good condition.\nThe boy’s other sister, 16-year-old Audrie Garcia, said the accident occurred as her mother was showing a male relative a few firearms.\n“My mom wanted to get rid of the guns,” she said.\nThe male relative was looking at the guns on the bed while the boy was in the room’s closet, she said.\nAfter hearing the noise, she said, she walked into the room and saw her brother on the floor in the closet. She said her mother begin yelling for her to call 911.\nOlder sister Heaven said her brother was doing fine, although he does have some pellets embedded in his face and shoulder.\nBoth Heaven and Audrie said they are thankful that was the extent of his injuries.\n“I want people to know that he’s fine,” Audrie said. “He’s going to heal well, and thank you for all the prayers.”\nLevelland police said the case is under investigation.\nlucinda.holt@lubbockonline.com\n766-8722\nFollow Lucinda on Twitter @AJ_LucindaLHolt"}