{"uri": "http://www.wsiltv.com/story/32602676/carbondale-police-identify-officer-injured-in-sunday-shooting", "title": "Carbondale Police identify officer injured in Sunday shooting", "dct": "Tue, 16 Aug 2016 22:22:00 GMT", "id": "31ddb33bbf382c57f219e3050cde1715", "content": "CARBONDALE -- Carbondale Police have identified the officer shot in the line of duty Sunday night as 26-year-old Trey Harris. He's been with the department for just over three years.\nOfficer Harris has been released from a St. Louis area hospital but will require further medical treatment as he recovers.\nIf you'd like to donate money to help officer Harris, Carbondale Police request you to bring it in person or mail it to the Carbondale Public Safety Building, located at 501 South Washington Street in Carbondale.\nMeantime, local, state and federal law enforcement continue their search in Jackson and Williamson counties for leads on the suspects in Sunday night's shooting.\nCarbondale Police don't have detailed descriptions and ask anyone with information on their whereabouts to contact them at (618) 457-3200.\nManhunts like this often require extra resources and Carbondale Police are teaming with other agencies in their search for the suspects.\nThis is a very active investigation and at this point police say they're following up on some new leads.\nCarbondale Police are working with the U.S. Marshals, Illinois State Police and the Jackson County Sheriff's Office right now. But that doesn't count all the local departments that stepped up during the initial incident.\nEarlier this spring, we saw how draining these manhunts can be on local departments and their resources. Back in May, local authorities searched the Shawnee National Forest for eight days to find Dracy Pendleton, a man accused of shooting a central Illinois police officer.\nRecords News 3 obtained through the Freedom of Information Act show the Illinois State Police district in Ullin racked up close to 800 hours of overtime in that month alone.\nWhile we don't know if that's the only reason behind the surge, it goes to show local law enforcement uses a lot of manpower to track down someone who's harmed one of their own."}