{"uri": "http://thetelegraph.com/news/86925/carbondale-officer-shot-during-pursuit-sunday-night-condition-serious-no-shots-fired-by-officers", "title": "Carbondale officer shot during pursuit Sunday night, condition ‘serious’; No shots fired by officers", "dct": "Mon, 01 Aug 2016 00:00:00 GMT", "id": "ef3313a2a5698d1dbcfc6aec4ad29822", "content": "CARBONDALE — During a police pursuit, a suspect fired several gunshots at pursuing officers while fleeing a vehicle, striking a police officer and the police car, ending the pursuit Sunday night, according to an Illinois State Police news release.\nOfficers of the Carbondale Police Department were on patrol in the 700 block of N. Robert A. Stalls Street when they determined gunshots were being fired. While driving toward the source of the gunshots, the officers saw a tan, four-door vehicle driving away from the area at a high rate of speed. The officers attempted to stop the vehicle and a pursuit was initiated. No shots were fired by Carbondale police officers. The shots fired by the suspect occurred at 11:38 p.m. Sunday.\nThe officer was immediately taken to Memorial Hospital of Carbondale where he was initially treated for a gunshot wound. The officer’s condition is reported to be serious and he has been transported to a St. Louis area hospital for additional treatment.\nThe investigation into the incident is being led by the Illinois State Police, which is standard Carbondale Police Department procedure in incidents concerning an officer involved shooting. Assisting with the investigation is the Jackson County State’s Attorney’s Office, the Jackson County Sheriff’s Department and the SIU Department of Public Safety. The investigation into the incident is continuing.\nAnyone with information about this incident is encouraged to contact the city of Carbondale Police Department at 618-457-3200. You also can call the Carbondale/SIU Crime Stoppers anonymous tip line at 618-549-2677 or the Murphysboro/Jackson County anonymous tip line at 618-687-2677.\nAnonymous tips also can be made by selecting the “Crime Stoppers” tab located on the main page www.carbondalepolice.com. Cash rewards for information, which leads to an arrest, also are made anonymously, stated the Carbondale Police Department on its website."}