{"uri": "http://www.heraldonline.com/news/local/crime/article64028647.html", "title": "Police: 1 dead, 1 injured in Friday shooting in Rock Hill", "dct": "Fri, 04 Mar 2016 13:15:00 GMT", "id": "3bf73d2d5cffba545d211fd8e2d07907", "content": "One person was killed and at least one other injured after a midday shooting about six blocks east of downtown Rock Hill on Friday.\nThe fatal shooting occurred just hours after gunfire riddled three Rock Hill homes Thursday night.\nPolice responded just after noon Friday to a shooting on Keels Avenue, where they found several shell casings in the roadway. A short time later, several residents in the 600 block of Cauthen Street placed 911 calls requesting EMS for two men in a car with gunshot wounds.\nPolice say the car had several bullet holes in it when officers arrived. Investigators worked into the evening trying to piece together what unfolded at the two scenes.\nOne of the men, 18-year-old Jarrius Harding, was fatally shot, officials said. Autopsy and toxicology were conducted Friday afternoon.\nFriends of Harding at the scene knew him as “Deon” and described him as “a typical teenager.” Harding turned 18 on Feb. 12.\n“He was like my own child,” said Nikisha Whitlock, who lives on Cauthen Street and said the victim was her son’s best friend. “He’d be at my house every day. It hurts so bad just to wake up to a son of yours dead in front of your yard.\n“He was just a baby. He didn’t deserve this,” she said.\nHer cries muffled at times by Whitlock’s shoulder, Stormie Moore said Harding was like a brother to her.\n“We love you, Deon,” she said between sobs.\nfacebook twitter email Share\nFriends mourn teen killed in Rock Hill shooting\nFriends describe the victim who died in Friday's mid-day shooting in Rock Hill as an outgoing, typical teenager who was always smiling. Authorities have not released the teen's name as of this posting. This is Rock Hill's first homicide.\nby Teddy Kulmala\nThe injured man was taken to Piedmont Medical Center. Authorities said a third man in the car was not injured and was being questioned by detectives at police headquarters.\n“Right now, we have as many questions as you folks and the public have,” Rock Hill Police Capt. Mark Bollinger said to reporters on Friday afternoon.\nA man who lives near Main Street and Keels Avenue said he heard six or seven gunshots around 12:30 p.m. Witnesses told police a man ran from the scene. A dark car was seen fleeing, and police believe that was the car found on Cauthen Street.\nA heavy police presence was seen most of the afternoon on Black Street near South Jones Avenue and East Black Street. A portion of Keels Avenue were blocked to traffic. Bloodhounds were brought in to help track any suspects, but an arrest had not been made as of Friday evening.\n“We’re still trying to piece together why they came to this house,” Bollinger said.\nMeghan Rasor lives on Cauthen Street just feet from where the car stopped. She said she heard a “blood-curdling scream” and then sirens.\n“I just came outside and there were about 15, 16 police cars, a fire truck and two ambulances,” she said. “One of the ambulances left very quickly, and the other stayed for a while.”\nAnthony Wilson was working in his yard about three blocks from Keels Avenue when he heard the gunshots.\n“It was just like, ‘Pow-pow-pow-pow-pow-pow,’ ” he said. “... It’s just getting normal for the whole town. From how I see it, people are shooting everywhere. It don’t matter if it’s good neighborhoods, bad neighborhoods – just a bunch of foolish people with guns.”\nFriday’s shooting was the city’s first homicide for 2016, and the fourth shooting in Rock Hill in less than 24 hours. Police have not said if this incident is connected to three shootings reported Thursday night.\nAt about 8:20 p.m., three people were injured in the first shooting at a home on Arlington Avenue and taken to Piedmont Medical Center with non-life-threatening injuries.\nSeven people, including a 3-year-old and a 5-year-old, were inside a home in the 600 block of Lige Street when shots rang out there minutes later but none were injured, police said.\nA third shooting was reported about 10:50 p.m. on the 1100 block of Pearson Drive. Police say there were five people in that house but none were injured.\nTeddy Kulmala: 803-329-4082, @teddy_kulmala"}