{"uri": "http://www.democratandchronicle.com/story/news/2015/09/14/city-shooting-suspect-due-court/72247558/", "title": "Names released in deadly house party shooting", "dct": "Mon, 14 Sep 2015 00:00:00 GMT", "id": "51cc120bdd4b0199629c6f282116a2ef", "content": "A Rochester man pleaded not guilty Monday morning in a fatal shooting that happened early Saturday.\nWilliam B. James, 30, of 120 Garson Ave., is charged with one count of second-degree murder in connection with a shootingat 36 Woodward St. that left two people dead and at least three others wounded. He is being held without bail.\nJames is accused of killing John Rudolph, 36, of Rochester, by shooting him several times at the party with a handgun, according to the criminal complaint filed with the Rochester City Court clerk's office.\nJames also allegedly made a recorded video statement to police in which he waived his Miranda rights and \"admits to being at the location and being involved in a dispute with the victim which led to the shooting,\" according to the criminal complaint.\nThe other person killed was Herbert Thomas, 34, of Rochester, according to police.\nPolice on Monday also released the names of three others shot at the party: Elizabeth Washington, 24; Shaquanda Moody, 25; and Imani Williams, 26. All are from Rochester.\nPolice previously said there were two people fatally shot and four wounded. Assistant Monroe County District Attorney Brian Green said the sixth victim was James, who was shot in a leg.\nJames was in a wheelchair when he was arraigned in Rochester City Court Monday.\nPolice would not release a mug shot of James.\n\"We are not releasing the photo at this time of the suspect because we still have to conduct ID procedures. Once the ID procedures have been conducted, I will release the photo,\" Rochester Police Investigator Jacqueline Shuman said in an email.\nWendell Washington, who attended the arraignment, said his daughter, Elizabeth Washington was shot in the back and the bullet went through her spine and she was not able to communicate. She has two children, ages 3 and 5, he said.\n\"She was there with her cousins celebrating somebody's birthday,\" Washington said.\nJames' birthday was Friday.\n\"Things got to stop when it comes down to violence,\" he said.\n\"A lot of things go through my mind, but at the end of the day I've got to thank God just for my baby being alive fighting for her life,\" Washington said.\nPolice said 30 to 50 people were in the house during the dispute. Police were at the house about two hours prior to the shooting, but when police arrived, only two people were on the porch and they were dispersed.\nCiminelli said that police are not looking for another suspect."}