{"uri": "http://www.democratandchronicle.com/story/news/2015/09/12/five-people-shot-one-fatally-rochester-house-party/72141520/", "title": "Victim's mother begs for violence to end", "dct": "Sat, 12 Sep 2015 00:00:00 GMT", "id": "882d3168be81577ad26744e2fa5b5e9a", "content": "Herbert Thomas loved to cut hair and dreamed of opening his own line of barber shops.\nHe got tattoos with the names of his sisters, nieces and nephews and dreamed of starting his own family, telling relatives that he would need a recliner big enough to fit all his children on his lap.\nInstead, Thomas, 34, became another casualty of gun violence in Rochester this summer.\nA shooting early Saturday at a house party on Woodward Street on the northeast side of the city left two dead and four others wounded.\nPolice announced Saturday night that they had arrested a suspect, William James, 30, a city resident, and charged him with second-degree murder.\nAuthorities have not identified the victims. But Thomas’ family — including one of his cousins, Monroe County Legislator and city firefighter Ernest Flagler-Mitchell — said they were certain he was one of the people killed.\nFlagler-Mitchell said another cousin, whom he declined to identify, was with Thomas at the party and also was shot, but survived. Family members were unsure why the two men were at the party.\nThomas’ mother, Brenda Williams, said the community cannot accept the killings of so many young black men.\n“I want us to stop hating each other so badly,” she said. “I want the violence to stop.”\nSaturday’s killings came a little more than three weeks after a drive-by shooting left three young men dead outside the Boys & Girls Club on Genesee Street, and about 2½ weeks after the fatal shooting of 24-year-old Rashod “Shoddi” Lewis on Portland Avenue.\nPolice said they arrived at 36 Woodward St. in the city’s Marketview Heights neighborhood around 4:26 a.m. and found between 30 and 50 people at the house.\nAt least four victims were taken to area hospitals. One survivor remained in critical condition on Saturday night, according to police.\nNeighbors said the house where the shooting occurred has been a consistent nuisance for the past year, hosting frequent, out-of-control parties in a neighborhood that otherwise had been stable. Residents said officers visited the home just hours before the shooting and several other times in the past week alone.\nIn March, two women were shot during a late-night party at the same house; they were treated at a hospital and released. Several residents said Saturday that they heard shots at the house since then, and that a small crowd beat a teenager in the street nearby about two days before the latest shooting.\nThe city filed a nuisance abatement proceeding in court last month against the owner of the home, who is listed as Sheldon O. Smith.\nA foreclosure proceeding also is pending against Smith, who is listed in different public records as living in Long Island or Houston. He could not immediately be reached for comment. A man with the same name is listed as the owner of an East Main Street property where the city sought to demolish an unsafe home in 2013.\nStories of violence\nJayla Simmons, who lives next door to the Woodward Street house, said that shortly before the shooting, a relative told her that she heard a man enter the neighboring home and say that he saw someone who shot him in the past.\nSimmons said she called police, and shooting erupted soon thereafter. She saw two women jump out a window to escape. Simmons said she fled to the other side of her home, where she hid behind a couch.\nShe said she moved to the neighborhood about a month ago. She has children, but they have been staying with a grandparent because Simmons doesn’t think it’s safe for them at her apartment. She said she’s been using a board to help reinforce her door.\n“It's this house,” Simmons said. “Everything else is fine. It's this house.”\nOther neighbors shared similar stories, saying that revelers often block driveways with their cars and spill into nearby yards. Kiara McCoy said she called police to complain about a party around 2 a.m. Saturday. Officers showed up, but the party resumed soon after they left, she said.\nKatrina Cook, another neighbor, said police were at the house a few days in a row.\n“This street is loaded with kids,” Cook said. “You still have a community that looks out for each other here.”\nResidents, businesses and nonprofits have been working hard to revitalize this part of Rochester, and the city has invested about $4.4 million in Marketview Heights since 2008 to bolster homeownership and address blight. Two weeks ago, residents held a block party on nearby Weld Street to celebrate progress in the neighborhood.\nMartin Pedraza, a member of a neighborhood group called the Marketview Heights Collective Action Project, said he was frustrated that problems persisted at the house even after the shooting there in March.\n“It should have been shut down or had the people moved out of there,” Pedraza said.\nA formal statement from the Collective Action Project applauded police for making a swift arrest, but also said the group hopes to work with the city to speed up proceedings against problem properties like this one in the future.\n\"We are a community that celebrates diversity, culture, family and friendship,\" the statement said in part. \"Violence has no place in our neighborhood.\"\nA knack for drawing, fashion\nThomas’ sister, Glenda Gano, said she got a series of calls about the shooting early Saturday. Several members of his family arrived at the scene Saturday morning. \"Where's my child?\" cried Williams, Thomas’ mother.\nPolice officers tried to comfort the family.\nThomas was one of five children, coming from a family of people who work and serve the community, Gano said. He called his mother almost daily and thrived on spending time with his nieces and nephews.\nHe had worked as a barber since he was a teenager and was gaining a following for his work, Gano said. He also had a passion and a knack for drawing and fashion.\nThomas died as he prepared to be a pallbearer at an aunt's funeral, Gano said.\n“He was jovial and kind,” she said. “He was always about his family.”\nCounty Executive Maggie Brooks and Rochester Mayor Lovely Warren called Flagler-Mitchell on Saturday to offer their condolences.\nLess than a mile away, Rochesterians walked through the Public Market, largely unaware of the incident.\nArthur Evans of Rochester said he couldn’t believe how often he hears about gun violence in the news. He said the city is still trying to recover from the shootings at the Boys & Girls Club last month.\n“That’s sad and my heart goes out to the families who lost a relative,” Evans said.\nAt the scene, Flagler-Mitchell said he planned to work in the County Legislature on the issues of violence, mental health and guns. He questioned where illegal firearms are coming from.\n\"The hate, it's demonic,\" he said.\nDespite her loss, Gano expressed faith in Rochester.\n“This city is not dead,” she said. “It shall rise from the ashes of all these homicides, and we can come back stronger than ever.”\nIncludes reporting by staff photographer Lauren Petracca and staff writer Khristopher J. Brooks."}