{"uri": "http://www.freep.com/story/news/local/michigan/2016/11/03/fatal-shooting-inmate-courthouse/93233214/", "title": "Fatal shooting of inmate at courthouse called justified", "dct": "Thu, 03 Nov 2016 00:00:00 GMT", "id": "20d7786a67c1a8bcdc3b70d3a95e18fa", "content": "BERRIEN COUNTY — New documents released Wednesday by the Berrien County Prosecutor's Office state that the shooting of an inmate at the courthouse in July was justified and no criminal charges will result.\nThe inmate, 44-year-old Larry Gordon of Coloma, was in Berrien County Jail awaiting a court appearance on several charges.\nGordon, appearing in court on July 11 for a misdemeanor domestic violence charge, was awaiting trial at a later date on additional charges stemming from an incident from April 20, when he grabbed the gun of a court officer who was escorting him and began shooting.\nAuthorities say he tried to take hostages — other bailiffs and officers engaged with the suspect before they shot and killed him.\nBailiff Ronald Kienzle and Chief of Courthouse Security Joseph Zangaro were shot and killed by Gordon in the incident. Deputy James Atterberry was also injured in the shooting.\n►Related: Berrien County shooter's past included pipe bombs, guns, teen sex tapes\n►Related: Berrien shooter faced life in prison on kidnapping, sex charges\n►Related: 'Our hearts are torn apart,' says sheriff after deadly courthouse shootings\nMichigan State Police records show Gordon was charged with kidnapping, sex assault and obstructing police in April 2016.\nThe report was comprised of interviews with witnesses to the shooting, courthouse video and letters written by Gordon.\nThe report shows that Gordon suffered two gunshot wounds to the chest. One wound passed through his left forearm and entered the left side of his chest passing through the heart. The second wound entered the right side of his chest somewhat lower than the first.\nThe report from the prosecutor’s office included a letter Gordon had written and given to another inmate the morning of the shooting. It references his daughters and the fear that facing up to life in prison he may never see them again. He also repeatedly apologizes and references his daughters. “I hope that one day you girls will forgive me for messing up our family and our lives,” Gordon wrote."}