{"uri": "http://wwmt.com/news/local/four-people-shot-at-a-berrien-county-courthouse", "title": "UPDATE: Sheriff identifies suspect, deputies killed in Berrien courthouse shooting", "dct": "Mon, 11 Jul 2016 00:00:00 GMT", "id": "319799b63d6dd7216990177ee19ad0ca", "content": "Larry Gordon, 44, has been identified as the shooter in the incident at the Berrien County Courthouse.\nSAINT JOSEPH, Mich. (NEWSCHANNEL 3) - Four people were shot in the course of an incident at the Berrien County Courthouse, and three people are dead, including the shooter.\nTwo bailiffs were killed in the shooting, and the suspect--identified as 44-year-old Larry Darnell Gordon--has also been confirmed dead.\nIn a press briefing just after 4 p.m., Berrien County Sheriff Paul Bailey confirmed that \"several other people\" were taken to Lakeland Hospital, where they are listed in stable condition. In a second briefing at around 9 p.m., Sheriff Bailey confirmed that Gordon was the alleged shooter.\nBailey also confirmed in the 9 p.m. press briefing that it's believed that Gordon was trying to escape custody, and this was not a broader attack on police.\nThe two sheriff's department employees killed in the course of the incident were Joseph Zangaro and Ronald Kienzle. Both had been with the trial court for over 10 years. Zangaro was a retired Michigan State Police trooper, and Kienzle was a U.S. Army veteran.\nDeputy James Atterberry, who has worked with the sheriff's department since 1998, is reported to be in intensive care, but doing well. Sheriff Bailey says he underwent surgery for gunshot injuries to his arm sustained in the incident.\nBailey reported that a disturbance began on the third floor of the courthouse at around 2:25 p.m.\nGordon was being escorted into court, from a holding cell in the courtroom building, when he allegedly went for the gun. Atterberry was injured attempting to get the gun back.\nGordon then opened fire, killing Zangaro and Kienzle.\nJust after 3:30 p.m., Governor Rick Snyder announced on Twitter that Michigan State Police has secured the scene and is beginning its investigation into the shooting.\nU.S. Representative Fred Upton, from St. Joseph, offered a statement late Monday afternoon:\n\"What occurred today in my hometown breaks my heart. My thoughts are with our entire community - our friends and neighbors. This tragic event reminds us all too well that our law enforcement officers have their lives on the line every day not knowing what that day will bring. We have lost two very able public servants and we all grieve for them and their families. As we learn more about this horrific situation, one thing is clear: we must do better to prevent these types of tragedies from occurring.\"\nNewschannel 3 conducted a live phone interview with Rep. Upton at 5:30 p.m. Monday evening.\nMichigan Supreme Court Chief Justice Robert P. Young, Jr. offered a statement just before 5:00 p.m.:\n\"Our prayers and condolences go out to those affected by today's shooting at the Berrien County Courthouse. This tragic incident is another sad reminder that courthouse employees put their lives at risk every day to serve the people of Michigan. As we await further details and the results of the ongoing State Police investigation, we stand ready to implement steps to further strengthen courthouse security to better protect both employees and the public.\"\nGov. Snyder also announced at around 5:15 p.m., that he is on his way to Berrien County for a briefing on the incident.\nNewschannel 3 also reached out Monday evening to Kalamazoo Public Safety and Battle Creek Police Departments to offer them the opportunity to comment on the events in St. Joseph.\n\"Another direct and tragic hit on this profession,\" said Battle Creek Police Chief Jim Blocker. \"Battle Creek officers today yet again have our heart in hand. Prayers to the family of these brave officers and to the Berrien Court personnel.\"\n\"The entire KDPS family sends their condolences to the families of those killed and injured in the courthouse shooting today in Berrien County,\" said Kalamazoo Public Safety Chief Jeff Hadley. \"These are painful situations to endure and to all the people of St. Joe, and Berrien County, our prayers are with you.\""}