{"uri": "http://wjla.com/news/nation-world/last-moments-and-victims-of-the-berrien-county-shooting", "title": "Last moments and victims of the Berrien County courthouse shooting", "dct": "Tue, 12 Jul 2016 00:00:00 GMT", "id": "4b839176b1b6fa98c4d9c80012b941b7", "content": "Warning: The audio in the video above may be disturbing to some listeners. (WWMT)\nWarning: The audio in the video above may be disturbing to some listeners.\nSAINT JOSEPH, Mich. (NEWSCHANNEL 3) - Shots ring out inside the Berrien County courthouse, as an inmate tries to break out and the call for help as the shooting at a West Michigan courthouse unfolds.\nThe first shots were fired before 2:30 p.m. as a deputy was transporting the suspect from a holding cell to a courtroom.\n\"We got him cornered on the second floor. He has a gun with a hostage.\"\n\"There's shots fired!\"\n\"Shots fired! One down! One down!\"\n\"We got an officer down! Officer down!\"\nTwo courthouse bailiffs were shot and killed. Another deputy and a woman also shot and are in the hospital.\nThe gunman is dead.\nCommunity members in St. Joseph are remembering those victims Tuesday morning, they have worked at the courthouse for many years, touching many lives along the way.\nThe two bailiffs, Joseph Zangaro, 61, and Ronald Kienzle, 63, who were killed had been with the trial court for more than 10 years.\nZangaro was a retired Michigan State Police trooper. He was a graduate of Lakeview High School and a former Battle Creek Police Officer. He was the head of courthouse security in Berrien County.\nKienzle was a U.S. Army veteran and a retired sergeant from the Benton Township Police Department.\nJames Atterberry, the deputy injured in the attack, has worked with the sheriff's department since 1998. He's in intensive care right now, but it is reported that he is doing well. He suffered a gunshot wound to the arm in the incident.\nKenya Ellis was identified as the woman injured in the courthouse shooting. Her family confirmed that she was a Benton Harbor resident. Police have not officially released her information or any update on her injuries."}