{"uri": "http://www.fox2detroit.com/news/local-news/173039392-story", "title": "Berrien County courthouse shooting suspect, victims identified", "dct": "Tue, 12 Jul 2016 01:38:00 GMT", "id": "84a1e490a19bb74198df07f739eb2819", "content": "A jail inmate trying to escape from a western Michigan courthouse wrestled a gun from an officer Monday, killing two bailiffs and injuring two more people before he was fatally shot by other officers, a sheriff said.\nThe 45-year-old suspect, Larry Darnell Gordon, was at the courthouse for a hearing on multiple felony charges but in court for sex crimes.\nBerrien County Sheriff Paul Bailey identified the bailiffs late Monday as 61-year-old Joseph Zangaro and 63-year-old Ronald Kienzle. He said they were \"close friends\" of his.\n\"Our prayers are with the families of Joe Zangaro and Ron Kienzle,\" said Sheriff Paul Bailey. \"They were well-respected people in our community. They had been in law enforcement for over 40 years. They were loving guys and their lives were tragically ended today.\"\nZangaro was head of court security. He retired from the Michigan State Police as commander of the Bridgman Post in Berrien County. Kienzle retired as a sergeant of the Benton Township police department after serving in the U.S. Army.\nWounded in the shootings was Deputy James Atterberry. He remains in stable condition at Lakeland Hospital. Bailey did not identify a civilian woman wounded in the shooting.\nBailey said authorities had \"no warning signs\" that the suspect would be violent. Two bailiffs were fatally shot by Gordon who wrestled the gun free from an officer then shot four people including wounding a deputy and a civilian.\n\"There were police cars everywhere, ambulances and people just stopping in the road as its happening,\" she said.\nBeing there just minutes after the shooting she started recording with her phone.\n\"I'm going to take a video and put it on Facebook so everyone knows what's going on and know not to come here,\" she said. \"Because no reporters there yet.\"\nAs quickly as she was able to get information out there, it was coming back to her.\n\"I had a friend who was a police officer saying 'I'm on lockdown here, this is what I know, there are two police dead already,'\" she said.\nVolkenstein recalls the absolute shock on peoples' faces as they ran from the building as the courthouse was locked down.\nSoon after that, she says the lockdown was lifted and word to began to spread that the threat was essentially over.\nThe other victims are a sheriff's deputy and a civilian, although their injuries aren't life-threatening. The sheriff says the inmate was killed by other officers. No names have been released.\nBerrien County courthouse shooting suspect, victims identified"}