{"uri": "http://www.mlive.com/news/kalamazoo/index.ssf/2016/07/inmates_fight_with_deputies_le.html#incart_big-photo", "title": "Inmate's fight with deputies led to fatal courthouse shootings", "dct": "Tue, 12 Jul 2016 08:31:00 GMT", "id": "a61b1ef004de1d459569d1a386f3bf8a", "content": "ST. JOSEPH, MI - A jail inmate who was being transported from a Berrien County Courthouse holding cell Monday grabbed a security officer's handgun, triggering a fight that left him and two security officers dead.\n\"A fight occurred with that inmate on the way to the courtroom and the inmate was able to disarm one of the officers,\" Berrien County Sheriff Paul Bailey said. \"We are still investigating to find out what officer. The inmate was able to get that gun and shoot the deputy and shoot and kill two bailiffs. He then shot a civilian in the arm and was taken down by two other bailiffs that came to render aid along with several other officers.\"\nBoth bailiffs, who had worked in the Berrien County Courthouse for at least 10 years, were killed in the scuffle that Bailey said took place at about 2:15 p.m. in a corridor outside a courthouse holding cell.\nThe inmate was subsequently killed in a shootout with responding police officers. Bailey said he was still working to learn what charges the inmate was facing.\nThe sheriff's deputy who was injured during the incident was recuperating at Lakeland Medical Center and was in stable codntion Monday afternoon.\nBailey was not able to offer a condition for the civilian who was shot in the arm.\nHe would not name those killed and injured at a 6 p.m. press conference held outside in 90-degree weather within site of the 811 Port St. courthouse in downtown St. Joseph.\nThat will not happen until his department is sure their families have been notified, said Bailey, who was joined by Michigan Gov. Rick Snyder, who said, \"This is a terrible day in a wonderful community.\"\nSnyder said he wanted to assure the Berrien County Sheriff's Department the use of various state resources including investigative help from the Michigan State Police and its crime lab, as well as any counseling resources staff may need.\n\"I ask that all Michiganders put your prayers out, your thoughts and prayers for the families of the loss law enforcement officials,\" Snyder said. \"... This is a particularly tough time for law enforcement so I ask that everyone reach out and try to be as supportive or law enforcement across the state and across the country as possible.\"\nHe said, \"This is a terrible event to have happen and we need to rally together to support one another.\"\nMLive writer Al Jones may be contacted at ajones5@mlive.com. Follow me on Twitter at ajones5_al."}