{"uri": "http://www.freep.com/story/news/local/michigan/2016/07/11/bailiffs-killed-berrien-county-courthouse-were-both-retired-cops/86963814/", "title": "Officials release names of Berrien County bailiffs killed in court", "dct": "Mon, 11 Jul 2016 00:00:00 GMT", "id": "e1c1b59ec96790de8645edaca87e0a8f", "content": "One was a retired Michigan State Police officer, the other was a former Benton Township police sergeant\nST. JOSEPH -- The two bailiffs killed inside the Berrien County Courthouse were both retired cops — one a former Michigan State Police officer and the other a retired sergeant for Benton Township, according to law enforcement sources in the small tight-knit community.\nRetired Benton Township Police officer Kim Fowler knew both Ron Kienzle and Joseph Zangaro well. He said he worked with Kienzle for a quarter of a century at Benton Township and Zangaro, a retired state police lieutenant, was his neighbor.\nRelated Berrien County shooting stories:\nHe said he was stunned by the news. He called both men \"100% police officers carrying on in their retirement by being in the courtroom.\"\n“There are always sporadic incidents everywhere in the country,\" Fowler said. \"Fortunately nothing has happened recently here, but I guess it was our turn in the barrel.”\nDeniece Fisher, retired St. Joseph police officer, also knew both men well.\n\"They were two great officers who didn’t deserved what happened to them,\" Fisher said. \"I was absolutely stunned, and very saddened and anger that this happened. I can't wrap my head around it.\"\nFisher is active maintaining the Berrien County Law Enforcement Memorial on the bluff in St. Joseph overlooking Lake Michigan and the ceremony held there every May.\n\"I was hoping in my lifetime I wouldn’t have to read another name being placed on that memorial,\" Fisher said. \"And now next year I have to read the names of two very good friends.\"\nFisher said the last time a law enforcement officer was killed in the line of duty in Berrien County was in 1984 when Michigan State Trooper Robert Mihalik was shot to death during a traffic stop in Shoreham, just south of St. Joseph.\nWilliam Tucker, who retired from the Berrien County Sheriff's Department in 2005, said both officers were his friends..\n\"He was a cop’s cop, but he knew where the line was,” Tucker said of the retired state trooper killed Monday inside the courthouse."}