{"uri": "http://www.mlive.com/news/kalamazoo/index.ssf/2016/07/larry_gordon_held_eight_hostag.html#incart_river_home", "title": "Courthouse shooter used woman as human shield, held 8 hostages", "dct": "Fri, 22 Jul 2016 17:16:00 GMT", "id": "e290b0469f0e8610b09ab9dc4a6648d3", "content": "BENTON HARBOR, MI -- Larry Gordon tried to escape the Berrien County courthouse by using a woman as a human shield and while holding 8 people hostage, video released by authorities Friday shows.\nThe chilling video captures some of the chaos of the July 11 shooting that left two retired police officers dead, a sheriff's deputy and a civilian wounded, and ultimately, Gordon shot and killed by responding cops.\nThe security surveillance from the third-floor courtroom and lobby area does not show the shootings but offers frightening audio of the intense moments inside the Michigan courthouse.\nThe video covers four minutes from 2:19 p.m. to 2:22 p.m. when Gordon wrangled a gun from Berrien sheriff's Deputy James Atterberry Jr. and shot him before Gordon shot and killed bailiffs Joseph Zangaro and Ronald Kienzle.\nAs Atterberry escorts a handcuffed Gordon to a holding cell, someone is heard saying \"No, no, no, don't shoot.\" That plea is followed by two gunshots and the judge telling everyone to leave the courtroom. Investigators say the second gunshot was when Kienzle was killed while responding to the commotion.\nIn that same minute, banging is heard outside of the courtroom and Joe Zangaro, security director for the courthouse, requests help on the third floor. He unlocks a door leading to the hallway that leads to the holding cells. As he opens the door, Zangaro is fatally shot by Gordon, Berrien sheriff's Sgt. Greg Sanders said while explaining the video and audio to reporters on Friday, July 22.\nThe second minute of the video and audio depicts more fear as authorities respond and others seek safety.\nSomeone is heard saying \"he's got a gun,\" a warning that is followed by a loud bang and a cry of \"please help me.\"\nGordon says he'll be in hiding but that if his ex-wife and daughter need anything, he'll be \"like superman\" and fix it.\nGordon, still handcuffed, runs out of a room holding a revolver in his right hand. A bailiff tries to grab the gun, but Gordon rushes past him. The officer draws his pistol and considers shooting Gordon but doesn't becase of concerns about the people in the background, according to Sanders.\nOther bailiffs can be seen taking cover on both sides of the lobby to contain Gordon.\nIn the lobby, Gordon tells police \"I got hostages,\" while pointing the gun at them. Bailiffs order Gordon to \"put it down, put that gun down now,\" but he doesn't follow the command.\nGordon instead instructs a hostage to use a court sign to hit a glass door in an attempt to escape. Gordon yells \"open that up, right now,\" and \"hit it harder.\" The words are followed by banging\nOne bailiff, who thought the banging was Gordon shooting hostages, moved through a courtroom to try to flank the sex assault suspect. Gordon can be heard ordering the hostages around and ordering them to break a glass door leading to the southwest corner of the building.\nGordon apparently changes his escape plan on the fly, using a woman as a human shield and holding the gun to her head. He disappears from view as several hostages follow him and others break free.\nAbout nine gunshots are fired - it's not clear at what - but it allows a moment for the woman used as a shield to escape.\nFour more gunshots are heard, then bailiffs and officers help three more hostages escape, leading to the gunfire that killed Gordon.\n\"He took a shot to save the hostage's life,\" Sanders said of one bailiff or deputy.\n\"They continued to fire until (Gordon) was no longer a threat.\"\nGordon was facing a host of charges for allegedly keeping a teenage girl in a shed behind the house he shared with his ex-wife.\nHe was facing five counts of first-degree criminal sexual conduct, three counts of production of child sexually abusive material, two counts of assault by strangulation and single counts of kidnapping, possession with intent to deliver methamphetamine, and third-degree criminal sexual conduct.\nGordon wrote a letter to his ex-wife that said he could not stand the thought of living behind bars with a blemished name and unable to raise his children.\nMichigan courthouse shooting timeline"}