{"uri": "http://www.marshfieldnewsherald.com/story/news/2016/07/18/milwaukee-shooting-suspect-out-bail/87261410/", "title": "Milwaukee shooting suspect was out on bail", "dct": "Mon, 18 Jul 2016 00:00:00 GMT", "id": "e01c52525a5f167c1a661634a80c24cf", "content": "The 20-year-old West Allis man suspected of shooting a Milwaukee police officer before killing himself was out on bail after he was accused of punching a close family friend so hard it left the man paralyzed.\nMilwaukee police identified the suspect Monday as Tomas A. Uriegas who was found dead of an apparent self-inflicted gunshot wound about 2:30 a.m. Sunday on the city's south side.\nAbout a half-hour earlier, Uriegas reportedly approached the passenger side of Officer Brandon Baranowski's squad car and fired multiple shots into the car, according to police.\nBaranowski was wounded in the arm and chest. He remained hospitalized for his injuries Monday morning and is expected to undergo surgery later in the day, a police spokesman said.\nBaranowski and another officer had been dispatched in separate squad cars for domestic violence property damage calls in the 3500 block of S. 17th St.\nIn each of the two incidents, the assailant was not at the scene when police arrived. Uriegas is suspected in the domestic violence incidents for which the police were originally called.\nUriegas was charged with aggravated battery in April after he was accused of punching his mother's longtime boyfriend. A witness said Uriegas punched the man unprovoked, lifting him about six feet off the porch and making him loose consciousness, according to a criminal complaint.\nThe man was hospitalized and was \"essentially paralyzed, only experiencing slight feelings in his arms and legs\" at the time prosecutors issued charges, the complaint says.\nThe man had known Uriegas since he was about a year old and said Uriegas had a \"troubled youth, dropping out of high school and engaging in alcohol consumption and drug use,\" according to the criminal complaint.\nUriegas' bail was set at $500, which he posted on June 14, online court records show. He was scheduled for a plea and sentencing hearing in the case on Aug. 1. His attorney, Kiley Zellner, was not immediately available Monday morning.\nAt the time of the battery case, Uriegas had an open deferred prosecution in Milwaukee County after he stole and used a relative's credit card."}