{"uri": "http://www.sfgate.com/crime/article/Police-seek-shooters-in-S-F-slayings-6006512.php", "title": "Trendy Hayes Valley neighborhood shaken by 4 gunfire slayings", "dct": "Sat, 10 Jan 2015 00:00:00 GMT", "id": "4f5e8da588e450370002ac974e9e1102", "content": "Police in San Francisco scoured the city Saturday, searching for killers who gunned down four men in what likely was a gang-related attack in Hayes Valley late Friday.\nPolice Chief Greg Suhr said Saturday that police gang task force and homicide units are combining efforts so they can act quickly to counter any possible gang retaliation.\n“We need to figure out why this happened. If we can discover that, then we will know if there is another shoe that is going to fall,” Suhr said. “We need to be out in front of that.”\nAuthorities do not believe the public is in danger in the thriving neighborhood known for its boutiques and popular restaurants.\n“Right now it looks like an all-out assault on these guys,” said Lt. Toney Chaplin of the San Francisco Police Department homicide detail. “It’s hard to pin down” what might have motivated the attack, he said.\nHe said the victims were all adults in their 20s. Officers have stepped up patrols around the area, and the gang task force is joining SFPD’s Northern Station to saturate the area.\n“We’re definitely making sure there is a high presence out there, a high visibility,” Chaplin said.\nThe victims were found shot at about 10 p.m. in a stolen black 2005 Honda that was double-parked near the corner of Laguna and Page streets, police said. All four men died at the scene.\nWhile Suhr said police know the identity of the victims, their names were not immediately released. One victim was identified Saturday by his aunt, Kim Barnett, who drove to San Francisco from near Sacramento to view the scene of the crime Saturday.\nShe said her nephew was Manuel O’Neal, who was in his early 20s. She insisted he wasn’t in a gang. “He was a very good kid, very intelligent, smart and caring,” she said. “It hurts. He traveled the whole country with my family.”\nBarnett said O’Neal has been in and out of school in recent months and traveled from the Sacramento area to visit his mother in San Francisco.\nOne resident, who did not want to be named but said he watched police perform CPR on the victims late Friday, said, “It was very surreal to watch.”\nHe said he heard police telling one of the victims, “We’re trying to help you. Let us help you.”\nSusan O’Connell was in bed and was startled by the sound of gunfire.\n“I heard what sounded like grenades go off,” she said. “I’ve never been that close to gunfire.”\nLate Friday, yellow tarps covered the bodies of the victims around the sedan parked on Laguna Street near the curb, pointed toward Market Street. The car still had its amber lights and taillights on. Yellow evidence markers were strewn around the car.\nSuhr said four guns were likely involved in the massacre, with two guns found inside the stolen car with the victims.\nTwo different calibers of shell casings were recovered on the ground near the car, and multiple shots were fired, he added.\n“We’ve got four victims in a car here,” one of the first officers who arrived at the scene said on the police radio. “We’ve got multiple gunshot wounds here,” another officer reported.\nAfter dispatchers asked whether it was safe for paramedics to enter the area, an officer responded, “It is clear for them to come in. Get them in here quick, please.”\nNo arrests have been made. San Francisco police described a possible suspect vehicle as a newer-model silver Scion that could have been heading toward Highway 101. California Highway Patrol officers were alerted.\nPolice are also searching for any street surveillance video that might have caught either the attack or the fleeing car.\nResidents who called 911 reported hearing as many as 15 shots. The gunfire was also captured by ShotSpotter, the city’s gunfire-detection system. Bullets hit at least one parked car.\n“We thought it was firecrackers at first, but then we heard the police,” said neighbor Robin Levitt, 62.\nOn Saturday morning, Victoria Austin, 61, a priest at the nearby San Francisco Zen Center, put up a memorial on a post that said, “1/9/15/ drive-by 4 people rest in peace,” with flowers attached.\n“I was awakened by sounds, saw the flashing lights,” she said. “I had hoped violence and the causes of violence in the neighborhood were done. It’s not over. It’s a shock to everyone.”\nOfficers cordoned off several blocks with yellow crime scene tape and canvassed the neighborhood for witnesses. Neighbors gathered at the tape, hoping the four victims were not their loved ones.\n“We’re just trying to make sure everybody’s kids are OK,” said a woman who asked to be identified only as Toni. “I just don’t want to get that phone call.”\nOn Saturday morning, news of the killings was reverberating through the busy shopping district along Hayes Street, three blocks north of the crime scene. Shoppers dipped into clothing stores while dozens waited in line for brunch at the district’s many restaurants.\nDonald Simms, 47, manager of the men’s clothing store Sean, said, “Random violence can happen anywhere. It doesn’t affect my perception of the neighborhood.”\nThe killings added to a grim start to the new year in San Francisco, which reported 45 homicides in 2014.\nOn Wednesday, a man died after being shot near Candlestick Park. Last Sunday evening, two police sergeants shot and killed a despondent man who allegedly pointed an Airsoft replica gun at them outside SFPD’s Mission Station.\nAuthorities urged anyone with information on the killings to call San Francisco police at (415) 575-4444 or text a tip to TIP411 with “SFPD” at the beginning of the message.\nChronicle staff writers Evan Sernoffsky and Vivan Ho contributed to this report.\nHenry K. Lee, Jaxon Van Derbeken and Hamed Aleaziz are San Francisco Chronicle staff writers. E-mail: hlee@sfchronicle.com, jvanderbeken@sfchronicle.com, haleaziz@sfchronicle.com Twitter: @henryklee, @jvanderbeken, @haleaziz"}