{"uri": "http://www.timesfreepress.com/news/local/story/2015/aug/25/16-year-old-catoosa-county-boy-dies-stepbrothers-gunshot/321607/", "title": "16-year-old Catoosa County boy dies from stepbrother's gunshot", "dct": "Tue, 25 Aug 2015 00:00:00 GMT", "id": "aa716a75e909c512e3fc38acb44b026a", "content": "To view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nA 16-year-old Catoosa County boy died last night when his stepbrother shot him in the gut.\nCapt. Chris Lyons said the teenagers were in their Edgewood Circle home when one of the boys accidentally fired a .38 revolver. The Catoosa County Sheriff's Office received a 911 call at 11:24 p.m.\nLyons said the department is not yet prepared to discuss specifically how the gun went off. Lyons also declined to provide the shooter's or the victim's name because they are teenagers. The shooter is 17.\nThe victim was shot once, Lyons said. He was pronounced dead at the scene. His body is going to the Georgia Bureau of Investigation's crime lab in Atlanta, where a medical examiner will perform an autopsy.\nLyons said other people were inside the home at the time of the shooting. He does not expect the sheriff's office to file charges against the shooter.\nThe GBI is helping the sheriff's office investigate the boy's death.\nA 16-year-old Catoosa County boy died late Monday night when his stepbrother shot him in the abdomen at this house located at 385 Edgemond Circle, seen on Tuesday, Aug. 25, 2015, in Ringgold, Ga. Capt. Chris Lyons said the teenagers were in their Edgewood Circle home when one of the boys accidentally fired a .38 revolver. The Catoosa County Sheriff's Office received a 911 call at 11:24 p.m. Lyons said the department is not yet prepared to discuss specifically how the gun went off. Lyons also declined to provide the shooter's or the victim's name because they are teenagers. The shooter is 17. The victim was shot once, Lyons said. He was pronounced dead at the scene. His body is going to the Georgia Bureau of Investigation's crime lab in Atlanta, where a medical examiner will perform an autopsy.\nPhoto by John Rawlston /Times Free Press."}