{"uri": "http://www.mcall.com/news/breaking/mc-pa-11-year-old-fatal-shooting-20140504,0,1115287.story", "title": "Police: Eleven-year-old boy shot dead by uncle at Pike County home", "dct": "Mon, 05 May 2014 00:00:00 GMT", "id": "dd3e94df12dd90129a0bfb63c88a3c21", "content": "An 11-year old boy, looking at guns with his cousin and uncle, was shot and killed Saturday afternoon in Pike County. His uncle has been charged with criminal homicide.\nThe family is devastated, police say.\nThe name of the child has not been released, but police say he lived in Wayne County and attended the Wallenpaupack Area School District. His initials are H.P, according to police records.\nThe uncle, Chad Olm, 34, was incarcerated in Pike County Correctional Facility in lieu of $250,000 bail, where he remains locked up. He was arraigned Sunday morning.\nPolice notified the school of the death, and the school will have grief counselors available this week.\nState police were called at 5:35 p.m. Saturday to Keystone Drive in Wild Acres, a gated community in Delaware Township.\nThe home is owned by William Olm, the victim's grandfather. The child was visiting the home where his uncle, Chad Olm, lives in a room in the basement next to the laundry room.\nChad Olm has a safe in his room with a keypad lock, where he stores four guns.\nAccording to police records, this is what Chad Olm said happened:\nOlm was in his bedroom with his son and his nephew, both age 11. The boys asked to see his guns, so he opened his security safe.\nOlm told police that he does not leave his guns loaded.\nHe opened the case and showed them his .357 Magnum revolver, which had been wrapped in a sleeve.\nHe handed it to his nephew and then to his son. They thought it was cool because it had a big scope on it. They wanted to pull the trigger and he let them, the police report said.\nNext, he took out a .22 revolver. He removed the pin and cylinder and then put it back together again and handed it to his nephew and then to his son.\nThen Olm showed the boys a 9 mm pistol that had been stored in a case, and let each boy hold it.\nLast, he took out a Glock 27 .40-caliber handgun that has a laser sight. Olm said there was no magazine in it, but he did not work the action to check or clear it.\nHe was holding the pistol and showing the boys the laser on the ceiling and the wall.\nThen, Olm pointed the laser at his nephew.\nOne of the boys (Olm could not recollect which one, according to court papers) said: \"Look, you have a red dot on your forehead.\"\nHis nephew reached out for the gun, and Olm pulled the trigger.\nThe gun went off.\nThe bullet struck the child in the forehead, above an eye. He began bleeding and fell over.\nWhen police arrived, the child's body was found on the floor of the bedroom and there was a single bullet hole in the corner of the room, near the ceiling. The gun was on the clothes washer in the laundry room.\nThe victim's parents were not there at the time of the incident. They arrived after police.\nState police Chaplin the Rev. Thomas Muldowney was called to speak with the family.\nThe victim has two siblings, one older and one younger.\n\"It's horribly tragic. The family is devastated,\" Blooming Grove State Police station commander Lt. Chris Paris said. \"It goes to show that the safe handling of firearms is a must. The family has lost something that they can never replace.\"\nThe state police Troop R Major Case team was called to handle the case. The team is comprised of members of the Dunmore, Blooming Grove and Honesdale barracks.\n\"One of the troopers remarked that it makes you go home and hug your kids,\" Paris said.\nOlm was charged with criminal homicide for pointing a loaded gun equipped with a laser site at a child. He is also charged with recklessly endangering another person because his son was a short distance away; and also charged with endangering the welfare of children.\nHe is being held in Pike County Correctional Facility.\n___\nDistributed by MCT Information Services"}