{"uri": "http://www.wdbj7.com/content/news/One-dead-two-others-hurt-in-shooting-in-Danville-402000406.html", "title": "Danville Police Chief: 'We cannot let our young people continue on this path of self-destruction'", "dct": "Sat, 19 Nov 2016 00:17:00 GMT", "id": "bf4a2d384cab206f02db630100a30eee", "content": "DANVILLE, Va. (WDBJ7) **UPDATE**\nDanville Police Chief Philip Broadfoot held a news conference at 11 a.m. Saturday at the Danville City Council Chambers. He addressed recent violent criminal activity, including the homicides on Thursday and Friday.\nTwo recent homicides on Thursday and Friday night were the 13th and 14th homicides of the year in Danville. That number has not been reached since the Danville Police Department began keeping records in 1953.\nBoth recent homicides are being actively investigated. A 15-year-old boy was killed Thursday and a 21-year-old man was killed Friday. The two homicides don't appear to be related at this time.\nChief Broadfoot says the Danville Police Department will begin to adjust schedules and give overtime to make sure there are more officers on the streets of Danville. Chief Broadfoot says he will reach out to surrounding law enforcement agencies to help with this homicide problem. He said that he hasn't had to reach out to surrounding law enforcement regarding a large amount of homicides.\nChief Broadfoot says a common denominator in these homicides include groups of young men involved in drug and/or gang activity. He wants to encourage the people of Danville to say something to police if they see something.\nAccording to Broadfoot, there were only three homicides in the City of Danville in 2012. And in 2014, another three homicides. Broadfoot is concerned with the rise of homicides just a few years later.\nCheif Broadfoot's full statement is to the right of this story.\n**UPDATE**\nThe Danville Police Department is investigating a triple shooting that left one person dead, and injured two others.\nThey identified Jacquel Stamps, 21, as the victim of Friday night’s shooting. They say he was found in a driveway on the 200 block of Kemper Rd. EMS crews pronounced him dead on the scene. His body will be sent to the Medical Examiner’s Office in Roanoke for an autopsy.\nIn addition to Stamps, police say they found a 14-year-old boy with gunshot wounds on Neathery Ln. He was taken to Danville Regional Medical Center where he was treated and released.\nPolice say another 17-year-old boy showed up at Danville Regional Medical Center. He was also treated and released.\nPolice say an initial investigation revealed there was a party at a house on Kemper Rd. when multiple shots were fired just before 10:30 p.m.\nAnyone with information on this shooting is asked to contact Danville Crime Stoppers at (434) 793-0000, the Danville Police Department at (434) 799-6508, or online at crimetips@danvilleva.gov . All information will remain confidential.\n**ORIGINAL POST**\nOne person is dead and two others were hurt in a shooting in Danville on Friday night.\nThe shooting happened in the 200 block of Kemper Road.\nThere is no information at this time about a suspect or a description of a suspect.\nPolice believe the shooting was isolated to one home.\nThe investigation is ongoing.\nThis is the 14th homicide this year in Danville.\nThe Danville Police Department is planning on holding a news conference at 11 a.m. Saturday at Danville City Hall. WDBJ7 plans to live stream the news conference.\n3 individuals reported to be shot. 1 of the 3 confirmed deceased. No suspect info at this time. Investigation is continuing.\n— Danville VA Police (@DanvillePD) November 19, 2016\nDPD and rescue personnel currently on scene of a reported shooting in the 200 block of Kemper Rd.\n— Danville VA Police (@DanvillePD) November 19, 2016"}