{"uri": "http://www.nola.com/crime/index.ssf/2016/05/5-year-old_laplace_girl_dies_a.html", "title": "5-year-old LaPlace girl dies after shooting herself with handgun", "dct": "Mon, 23 May 2016 11:44:28 GMT", "id": "8b777866f26557947e6039a54b67050e", "content": "A 5-year-old girl from LaPlace was killed Saturday (May 21) after she shot herself while playing with a handgun, the St. John the Baptist Sheriff's office said in a news release.\nDeputies identified the girl as Haley Moore.\nAuthorities responded about 9:45 a.m. to a medical emergency at a home on Country Club Drive in LaPlace. The child was transported to a local hospital where she died.\nThe girl's father told deputies that she shot herself while playing with a handgun. The weapon had not been stored in a secure location, deputies said.\nThe Moore family's next-door neighbor, Joy Ursin, said that between 9:30 and 9:45 a.m., her husband ran into the house calling her name. When she came outside, she saw her husband with Moore's two other children.\nHer husband told her that the 5-year-old had been shot and she said she tried to comfort Haley Moore's siblings while police tried to calm their father.\n\"All I can say is it's an unfortunate thing because Eric is a disabled military veteran and one thing is he has his guns, but he's not ignorant to the fact of the danger, especially when his kids are around,\" Ursin said.\n\"He would always stress how he had to secure (them), what he had to go through when the kids came. He made sure of that because he would get his kids every other weekend,\" she said.\nMoore and his wife are separated, Ursin said. This was his weekend to have the children, she said.\nUrsin said she was told that Eric Moore was taking a shower during the incident, but the oldest daughter was present when the 5-year-old shot herself.\nUrsin said she was told Haley was wounded into the stomach. She said Moore told them he was getting ready to take the children to get something to eat after his shower.\n\"They had a full schedule planned,\" she said. \"He was gonna take them to see 'Angry Birds' and they were all excited about that. And then this tragedy.\"\n\"His kids are his life, so this to him is devastating,\" Ursin said.\n\"He would always bring them over every other Saturday when he would get them and I would have treats for them,\" she said.\nHaley Moore's siblings attend LaPlace Elementary School and counselors will be at the school on Monday to talk with children about the shooting, according to a message St. John Parish School Superintendent Kevin George.\nDeputies did not release any additional information.\nReporter Will Nobles contributed to this report.\n***\nStay with NOLA.com | The Times-Picayune for more on this breaking story."}