{"uri": "http://chicago.suntimes.com/news/15-shot-2-fatally-in-monday-violence-across-city/", "title": "15 shot, 2 fatally, in Monday attacks across city", "dct": "Mon, 28 Nov 2016 22:35:00 GMT", "id": "02d87adaba07c537bd6c7d8d3e893043", "content": "A 17-year-old boy and a 20-year-old man were killed, and at least 13 more people were wounded in shootings across Chicago on Monday.\nThe homicide victims were found dead about 6:15 p.m. inside a vehicle parked in the 4500 block of South Wolcott in the Back of the Yards neighborhood on the South Side, according to Chicago Police. The teen had been shot in the abdomen, the man in the head. The Cook County medical examiner’s office has not released their names.\nThe latest attack happened about 9 p.m. in the hallway of a South Chicago neighborhood apartment building in the 8700 block of South Escanaba, where a masked gunman shot a 21-year-old man in the chest and a 17-year-old boy in the foot, police said. They were taken to Christ Medical Center in Oak Lawn, where the man was listed in serious condition. The boy was stabilized, police said.\nAbout the same time, two people robbed a 54-year-old man in the 3800 block of West Lexington Lawndale and then shot him in the foot, police said. He was taken to Mount Sinai Hospital in good condition.\nShortly after 7 p.m. in Brighton Park on the Southwest Side, a 36-year-old man was shot in the back in the 2400 block of West 47th Place and taken in critical condition to Mount Sinai, police said.\nJust after 4 p.m., three men were shot in Auburn Gresham. They were sitting in a vehicle parked in the 8700 block of South Wood when an SUV pulled up and someone inside opened fire, police said. One 23-year-old man was shot in the head and taken in critical condition to Christ Medical Center, along with another who was grazed in the head and shot in the shoulder. His condition was stabilized, police said. The third man, 26, was shot in the hip and taken to the same hospital in serious condition.\nAbout 9:30 a.m., more Back of the Yards gunfire left three men wounded in the 5200 block of South Ashland. A 19-year-old man was shot in the abdomen and taken to Stroger Hospital in serious condition along with a 37-year-old shot in the upper thigh listed in critical condition. The third victim, 18, was stabilized at Mount Sinai with a gunshot wound to the buttocks, police said.\nEarly Monday, a 24-year-old man was shot in the leg by one of four people who robbed him about 3:10 a.m. in the 7200 block of South King Drive in the Park Manor neighborhood. His condition was stabilized at Stroger, police said.\nThe day’s first shooting happened about 12:40 a.m. in West Rogers Park. Two women, ages 23 and 28, were walking in the 6100 block of North Maplewood when two people walked up and demanded cash, police said. When the women said they didn’t have any, one of the robbers shot the younger woman in the foot, and the older was grazed in the leg. Their conditions were stabilized at Saint Francis Hospital in Evanston, police said.\nAdditionally, a 41-year-old man was beaten to death with a bottle about 6:30 p.m. in Englewood. The violence followed a Thanksgiving weekend that saw 66 more people shot across the city, leaving eight dead."}