{"uri": "https://www.thenewsjournal.net/one-injured-shooting-williamsburg/", "title": "Woman injured in Thursday shooting released from hospital", "dct": "NODATE", "id": "43addfa6e0c4984149e16c51baea7dcd", "content": "A Williamsburg woman, who had to be airlifted to Knoxville after being shot Thursday morning, was expected to be released from the hospital Tuesday.\nThe shooting took place about 9 a.m. Thursday at 137 Mt. Morgan Road residence of Chris Creekmore.\nWhen officers arrived at the scene, they discovered Natasha R. Archer, 31, lying outside the residence with a single gunshot wound to the right shoulder/chest area, according to a police department release.\n“Officers quickly secured the shooter and the scene,” Chief Wayne Bird said in a news release.\nWhitley County EMS treated Archer at the scene. Williamsburg Fire and Rescue set up an emergency-landing zone in the parking lot of the Kentucky Splash Waterpark where an emergency medical helicopter landed.\nThe helicopter transported the victim to the University of Tennessee Medical Center.\nWilliamsburg police determined through their investigation that Creekmore and Archer were acquainted, and Archer had stopped by to visit Creekmore.\n“Williamsburg Police Department investigators have interviewed two witnesses and Creekmore. The preliminary investigation suggests the shooting may have been accidental but no conclusion will be made until after the victim can be interviewed,” Bird said in a news release.\nBird said early Tuesday afternoon that police hadn’t had the chance to speak with the victim yet.\nAt this time no charges have been filed against Creekmore.\nDue to the location of the shooting, nearby Williamsburg Independent School went into lock down at 9:30 a.m. as a precautionary measure and lifted the lock down six minutes later once the scene was secured.\nSuperintendent Dr. Amon Couch said the lockdown procedure worked “like a dream.”\nWilliamsburg police are investigating the shooting, and were assisted at the scene by the Whitley County Sheriff’s Department and Kentucky State Police.\nThose taking part in the investigation included: Williamsburg Police Chief Wayne Bird, Deputy Chief Jason Caddell, Detective Bobby Freeman, Whitley County Sheriff’s deputies John Hill and Todd Shelley, and KSP Sgt. Les Moses."}