{"uri": "http://www.northjersey.com/story/news/bergen/woodcliff-lake/2016/11/27/man-self-inflicted-gunshot-wound-found-county-park/94509850/", "title": "Boy with self-inflicted gunshot wound found in county park", "dct": "Sun, 27 Nov 2016 00:00:00 GMT", "id": "d4e2228b05434b94f314f2f93fa332e1", "content": "WOODCLIFF LAKE — A boy appears to have shot himself in the head in Wood Dale County Park, authorities said. Officials from Pascack Valley Regional High School, where the boy is believed to be a student, have said that the victim remains in critical condition.\nPolice, who did not release any information about the victim because he is underage, said he was discovered in the park by a pedestrian around 7:30 a.m. Sunday. He appeared to have a gunshot wound to his head, police said.\nPascack Valley Regional High School District Superintendent Erik Gundersen sent out an email Sunday evening to parents.\n\"On Sunday morning a Pascack Valley High School student was involved in a tragic event and is in critical condition,\" Gundersen said in the email. \"At this time, we are not able to share additional information, as we must respect the privacy of the student and the family.\"\nThe email also noted that a \"specially trained district crisis response team\" will be available to students throughout the week.\nIn a second email to parents sent Monday afternoon, Gundersen said that the student remains in critical condition and that the district will continue to provide counselors to students \"for as long as necessary.\"\n\"As per recommendations from experienced therapists, the district is not organizing or hosting a vigil or other formal gathering. Instead, we encourage students to speak to our counselors or their parents for support,\" the email states.\nAnthony Cureton, a spokesman for the Bergen County Sheriff's Office, said the victim was taken to Hackensack University Medical Center and was in stable condition on Sunday. As of Monday morning, Cureton said he did not have an update on his condition.\n."}