{"uri": "http://www.dentonrc.com/local-news/local-news-headlines/20161215-blotter-deceptive-license-plate-leads-to-arrests.ece", "title": "Blotter: ‘Deceptive’ license plate leads to arrests", "dct": "Thu, 15 Dec 2016 05:24:00 GMT", "id": "7e92bca9c996c05faddfe884b3e08c8a", "content": "A 23-year-old woman and a 29-year-old man were arrested early Tuesday morning after police found a “deceptive” license plate at the Valero convenience store in the 700 block of Fort Worth Drive.\nThe report did not elaborate on the details of the license plate. Police were initially called to the scene at 4:49 a.m. to investigate a domestic disturbance.\nOfficers were told that someone broke a car window with a rock. But when they arrived, they determined the subjects acted in self defense, and no charges were filed for that report.\nPolice later arrested the 23-year-old woman on four outstanding warrants from the Tool Police Department, located south of Dallas. Her charges included failure to maintain financial responsibility, speeding, failure to appear in court and a violation of a promise to appear. The man was charged with the manufacture or sale of a deceptive license plate.\nThe online report did not indicate why or how police came upon the two suspects, who were taken to Denton City Jail.\nOther reports\n700 block of Interstate 35 East — A 55-year-old man was hospitalized Tuesday night after accidentally shooting himself in the leg in front of the Applebee’s in the 700 block of South Interstate 35 East.\nHis wife, who initially called police at 8:12 p.m., said her husband had been trying to put the gun away when it fired. Police arrived on the scene and placed a tourniquet on the man’s leg before he was taken to a nearby hospital.\nHis current condition is unknown.\n1700 block of Carlton Street — A caller told police on Tuesday afternoon that a 15-year-old girl locked herself in a bathroom and drank bleach during a fight with her mother.\nOfficers responded to the call at about 1 p.m. and were able to gain access to the bathroom, according to a police report. Paramedics quickly took the girl to a nearby hospital for treatment and a mental health screening, the report said. No arrests were made, and her condition is unknown.\n700 block of Londonderry Lane — A 27-year-old man’s motorcycle was reportedly stolen sometime between Sunday and Tuesday afternoon at the Londonderry Oaks Apartment. No arrests have been made.\nRoundup\nFrom 7 a.m. Tuesday to 7 a.m. Wednesday:\nDenton County Sheriff’s Office dispatchers handled 743 service and officer-initiated calls for the agencies they serve, and 40 people were booked into Denton County Jail.\nDenton police posted 18 reports online.\nDenton firefighters responded to 26 medical calls, one vehicle accident and one call for public service.\n— Julian Gill\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}