{"uri": "http://www.ksla.com/story/33724843/mother-arrested-after-1-year-old-child-accidentally-shot-by-sibling", "title": "Mother arrested after 2-year-old child accidentally shot 1-year-old sibling", "dct": "Thu, 17 Nov 2016 00:21:00 GMT", "id": "c97b590401ea61156d4c8cc5c728288f", "content": "BATON ROUGE, LA (WAFB) -\nA 23-year-old woman was arrested by police after her 1-year-old child was accidentally shot by her 2-year-old Tuesday night.\nThe Baton Rouge Police Department arrested and charged Crystal Kinchen with second-degree cruelty to a juvenile.\nPolice said the shooting happened around 7 p.m. Tuesday, Nov. 15 at the intersection of Greenwell Springs and North Foster. Officials added the two children were with Kinchen in a vehicle while a male companion was inside a nearby store.\nAccording to the probable cause report, the children were not secured in child seats or seatbelts.\nThe 2-year-old boy reportedly picked up a handgun that was wedged between the driver's seat and the center console and was playing with it when it accidentally went off and hit his 1-year-old sister in the face.\nKinchen told police she thought the gunshot was a firecracker, but the male friend discovered her daughter on the floor of the vehicle. According to the police report, Kinchen admitted during an interview she was preoccupied with her cell phone.\nOfficers say Kinchen was talking on her phone and checking Facebook when the boy grabbed the gun and shot his sister.\n\"You have to be responsible,\" said Sgt. L’Jean McKneely with the Baton Rouge Police Department. \"That's why we arrested her. You have two kids in the vehicle; you weren't paying attention to what they were doing. The 2-year-old crossed over and grabbed the handgun, and you never noticed.\"\nThe gun and car belonged to the male friend, but he will not face charges.\nOfficers say Louisiana law allows gun owners to place their weapons anywhere in their cars, but they have to be cautious.\n\"Ultimately, it's just being responsible. Being accountable for having that handgun, or any type of dangerous weapon inside of a vehicle,\" McKneely said.\n\"You have guns, you're supposed to know how to handle them. You should have them locked up, you know,\" said Floyd Patterson Jr.\nPatterson was taking a break from work Tuesday night at Miracle's Hair Creations and Tattoos on North Foster Drive when he saw the chaos unfold in the nearby parking lot at the Family Dollar Store.\n\"Basically, I just heard a pow,\" Patterson said. \"And I heard a baby holler, you know. Then the car shot through the parking lot, and went through the red light.\"\nOfficials say Kinchen and the male drove the child to the hospital, where she is listed in critical condition.\nKinchen was booked into the East Baton Rouge Parish Prison where she is being held on a $15,000.\nCopyright 2016 WAFB. All rights reserved."}