{"uri": "http://www.delawareonline.com/story/news/crime/2014/09/30/two-year-old-shot-in-valley-run-in-delaware/16472909/", "title": "2-year-old in critical condition after shooting", "dct": "Tue, 30 Sep 2014 00:00:00 GMT", "id": "bde27b09d2732f92486242dc2063bcc2", "content": "A 2-year-old boy was in critical condition late Tuesday after shooting himself in the head with a handgun inside his family's Brandywine Hundred townhome, New Castle County police said.\n\"We're not sure how it occurred, and we're not sure how he got possession of the weapon,\" Officer Tracey Duffy, a county police spokeswoman, said outside the home while detectives streamed in and out.\nThe 10 a.m. shooting came in the first block of Cliffside Court in the Valley Run development off Carpenter Station Road, between Naamans Road and the Pennsylvania line. A landlord who works in the rental office called police at about 10:05 a.m., County police Sgt. Jake Andrews said.\nArriving county paramedics found the child with an apparent gunshot wound to the head and performed first aid, paramedic Sgt. Michael McColley said.\nThe toddler was rushed to a state police helicopter and flown to Nemours/A.I. DuPont Hospital for Children in Rockland where he underwent surgery.\nA preliminary investigation revealed the toddler and his mother were the only ones in the home, police said.\nHours after the shooting, officers remained at the two-story, end-of-row brick and vinyl home that was cordoned off with crime scene tape. A red umbrella was all that was visible above a wooden fence that enclosed an outdoor patio.\nOfficers were canvassing nearby homes and interviewing people at the scene.\nRenita Kimp, who lives in the Valley Run development and was out for a walk with a friend when she saw the police activity, said, \"I think it's horrible. I can't believe something like that happened. Why would parents have a gun in the house with a 2-year-old?\"\nValley Run resident Michael Forrester, 26, was riding by the victim's house on a bicycle when he stopped to look at all the commotion.\n\"It's one thing to keep a loaded gun in the house for protection, but how did the baby get hold of it?\" he said. \"You should keep all guns out of the reach of children.\"\nUnintended shootings in which a minor is injured are not tracked in Delaware, making it difficult to determine how often accidents like this have occurred.\nA search through The News Journal's archives found at least four incidents in the last decade. This includes:\n•April 2013: An 11-year-old boy shot his 7-year-old brother in the hand with a 9mm handgun they found in a Wilmington home. Their grandfather had earlier found the gun in the back yard. He had hidden the weapon in a cabinet and was planning to take it to police when the boy found it.\n•September 2006: Scotty O'Brien shot and killed his lifelong friend, Jimmy Brady, with a Smith & Wesson handgun the boys stole from a Claymont home. The two 14-year-olds skipped classes at Brandywine High School and broke into the basement of the home and took fireworks, several pieces of jewelry, a Sony digital camera and two Smith & Wesson handguns, one of which O'Brien fired into the floor of his apartment before shooting Brady. He was convicted of manslaughter. O'Brien has served his sentence.\n•July 2004: A 14-year-old New Castle area boy playing with his father's handgun while watching an action movie on television shot his 16-year-old brother in the neck when the gun accidentally discharged. A couple of days earlier, a 17-year-old shot himself in the head while playing Russian roulette with a handgun.\nDelaware has a weak child access prevention law, according to Everytown for Gun Safety, a gun control group started by former New York City mayor Michael Bloomberg.\nThe organization points out that it is a misdemeanor in Delaware to intentionally or recklessly store or leave a loaded firearm where it may be accessed by a child under 18 if a child obtains the firearm and causes serious injury or death. It also is a misdemeanor for a parent or guardian to knowingly, intentionally or with criminal negligence allow a child under 18 to purchase or possess a firearm.\nThe misdemeanor is punishable by up to 1 year in prison and a fine of up to $2,300, according to the state Attorney General's Office.\nDuffy said detectives are looking into everything and at this point was unsure if any charges would be filed against the parent.\nContact Terri Sanginiti at (302) 324-2771 or tsanginiti@delawareonline.com. Contact Esteban Parra at (302) 324-2299 or eparra@delawareonline.com."}