{"uri": "http://abc13.com/news/boy-8-shot-in-face-by-younger-child-in-texas-city/247963/", "title": "Boy, 8, shot in face by younger child in Texas City", "dct": "Thu, 07 Aug 2014 00:00:00 GMT", "id": "c461972ad0b2a6de13ff24320bad8650", "content": "TEXAS CITY, TX (KTRK) --\nAn 8-year-old boy was airlifted to a hospital after he was shot in the face by a younger child inside a Texas City apartment.\nNeighbors at the Harbor Oaks Apartments say they're used to the sirens, the investigators, the yellow crime scene tape. But this time, the victim is only 8 years old and police say the shooter is even younger than that.\n\"Parents shouldn't leave their guns around because a lot of kids think that they're play guns being that they have play guns to play with,\" neighbor Mary Tripnett said.\nTexas City police say three boys, aged 7, 8 and 9, were home alone in this apartment late Thursday afternoon. The 7-year-old found a handgun inside and shot the 8-year-old in the face.\nNeighbors called police. The boy was transported via LifeFlight to Memorial Hermann Hospital, where he is undergoing surgery. His condition won't be released until he is moved to the pediatric ICU.\n\"I don't know how a parent leaves their kids unattended to like that,\" neighbor Demetrius Williams said. \"Every parent with a kid automatically feels like, hey that could've been my baby.\"\nAs night falls, there's still no sign of any adults at the apartment, and neighbors are left wondering how three children could be left home alone with a loaded gun.\n\"He was a pretty good man. To me, he was always there. I don't know what happened to him, if he just ran out to do something or what,\" said Ronaldo Castillo, who's friends with the father of at least one of the children.\nTexas City police are still working on finding out who had custody of these children and why they were left home alone. Charges are expected to be filed against the adult who was supposed to be responsible for the children.\nCPS is also launching its own investigation.\nThe child who pulled the trigger won't be facing any charges because he's younger than the age of 10."}