{"uri": "http://www.detroitnews.com/story/news/local/detroit-city/2016/08/18/cop-facebook/88940390/", "title": "Cop on 7-year-old victim: ‘He’s why we do what we do’", "dct": "Thu, 18 Aug 2016 00:00:00 GMT", "id": "e57f276c82fa66f783a01f5d97058f16", "content": "A Detroit police officer vividly recalls rushing to an area hospital with his arms covered in the blood of a child shot during a domestic dispute Tuesday on the city’s east side.\nOfficer Chris Rabior detailed the harrowing incident in a Facebook post late Wednesday that has more than 650 reactions and more than 400 shares. On his page, Rabior lists his occupation as “Police Officer at Detroit Police Department.”\n“Just prior to what should have been the end of my shift, I found myself lifting the nearly lifeless body of a seven year old boy from the back of our scout car and onto a stretcher for staff waiting on his arrival,” Rabior said. “My partner expertly drove at ludicrous speeds to get him there while I gave his mother instructions on how to control the bleeding between giving updates to dispatch on our ETA and location.”\nUnder Rabior’s status, he posted a link to a story about the little boy, who was shot around 10:45 p.m. Tuesday on the 3600 block of Fairview.\nA man, identified by police as Torrey Craft, had argued with the boy’s mother a day earlier, before returning to try and visit a child they have together. But the woman’s brother blocked him and “the suspect attempted to shoot him and struck the child,” Officer Nicole Kirkwood said.\nCraft turned himself in around 2 p.m. Wednesday at the department’s 5th precinct.\n“My hands should have been busy tapping away at a keyboard, writing a report about the four guns we got off the street earlier in the shift,” Rabior said of the hectic moments after the shooting. “Instead my hands were covered past my elbows in the blood of a child.”\nIt remained unclear if the victim is the child the suspect was attempting to visit, police said. He was outside with several other people when he was shot.\nThe gunman fled the scene following the shooting in a Chevrolet TrailBlazer. Prior to his surrender, police said an extensive search was underway.\nThe investigation is ongoing and police expect to submit a warrant packet to the Wayne County Prosecutor’s Office for review, according to Officer Jennifer Moreno.\n“I know a lot of people wonder why the hell I would ever want to work as a police officer in Detroit,” Rabior said at the beginning of his post. “It’s an absolutely crazy place to work. I’ve been shot at. I’ve been assaulted. Pretty good odds my nose has been broken once or twice.\n“I’ve seen terrible things. I know the smell of gunfire, the smell of death, the smell of decomp. I’ve had to listen to firsthand accounts, and see the results first hand, of how horrible people can be to one another.\n“I’ve been the focus of hatred directed towards me solely based on the uniform I chose to wear. I’ve been threatened by gang members. I’ve been promised shootings by people we’ve caught on felonies that ‘next time, we’re gonna bang it out.’ ”\nBut Rabior used Tuesday’s night’s rescue as proof his job is worth all that risk.\n“(The boy) made it through surgery. He’s listed critical due to his age and the amount of blood he lost. But he’s alive,” Rabior said. “I don’t know his name, but I’ll never forget his face. He’s why we do what we do.”\nHFournier@detroitnews.com\n(313) 223-4616\n@HollyPFournier"}