{"uri": "http://abc7ny.com/news/shooting-at-teen-birthday-in-nj-church-leaves-1-dead-2-hurt/1463927/", "title": "Shooting at party in Jersey City church leaves 1 dead, 2 hurt", "dct": "Wed, 10 Aug 2016 00:00:00 GMT", "id": "398375248ed568164c2c8f08e5ba201b", "content": "JERSEY CITY, New Jersey (WABC) --\nPolice are searching for the gunman who targeted and fatally shot a teenager, also wounding two girls, during a party at a Jersey City community center.\nThe victims were attending the party at the Holy Ghost Tabernacle Ministries on Communipaw Avenue when shots were fired near the front door just after 11:30 p.m. Tuesday.\nThe gunman walked into the double doors of the crowded community hall and opened fire within 30 seconds of entering.\nThe man who was killed was 17 and was shot twice in the head. He was the target of the gunfire and had a gun with him at the time.\nHe was rushed to Jersey City Medical Center where he later died. He has been identified as Leander Williams of Jersey City.\nThe two girls, 12 and 14, also were struck by shrapnel from the bullets. One ran to the Crown Fried Chicken for help.\nThey were both taken to Jersey City Medical Center in stable condition, and were treated and released.\nAll the victims are from Jersey City. The 17-year-old is not believed to be a current high school student, and was armed.\n\"This was not a random act,\" said Jersey City Mayor Steven Fulop. \"The victim in this situation was attending a party at the community hall and the victim at the time that he was shot also possessed a loaded handgun at the party. Also important to recognize that the victim has been arrested several times in the last year for possession of a handgun and burglary.\"\nThe party was in Lincoln Center, which is a church hall belonging to the Holy Ghost Tabernacle.\nFulop said, \"It's a community hall rented out for a private event, unaffiliated with the church.\"\nA mother of one of the teens who attended the party said she could see the chaos from her front porch.\nTequan Adams was at the party, helping the DJ when he said the shooter began firing from near the entrance.\n\"I don't think anyone saw anything because every light was off. By the time the lights came on, we saw everybody running and the body was on the floor,\" he said.\nThe Hudson County Prosecutor's Office has taken over the investigation.\nDetectives have an idea of who the shooter might be, and are actively looking for him."}