{"uri": "http://www.nj.com/hudson/index.ssf/2016/08/shooting_victim_was_carrying_loaded_gun_at_back_to.html", "title": "Shooting victim was carrying loaded gun at 'back to school' event at Jersey City church hall, officials say", "dct": "Wed, 10 Aug 2016 19:04:12 GMT", "id": "f9901f75731cfd843a644c37b820d3e2", "content": "UPDATE: Authorities release ID of 17-year-old shooting victim\nJERSEY CITY -- A 17-year-old boy was carrying a loaded gun when he was fatally shot at a \"back to school\" event being held at a church hall Tuesday night, officials said.\nDuring a press conference at Berry Lane Park this morning, Mayor Steve Fulop and Jersey City Public Safety Director James Shea said the 17-year-old victim -- whose identity has not been released -- was shot twice in the head at about 11:30 p.m. at the Holy Ghost Tabernacle Ministries church hall.\nShea said two girls, ages 12 and 14, were injured during the shooting, though it's unclear whether the girls were hit by bullets or bullet fragments. When asked for their conditions, Shea said \"they're fine.\" Jersey City spokeswoman Jennifer Morrill said the two girls were not targets of the gunfire.\nThe church hall was rented out for a private event that was not sponsored by the ministry group, Fulop said. A witness at the scene this morning told The Jersey Journal she saw a young man run inside the building and shoot the victim at point-blank range.\nFulop, who said a loaded gun was found on the victim's body, emphasized that the incident took place at a \"crowded party\" and was not random -- a similar point he has stressed following several fatal shootings recently. Questioned if that was supposed to make residents feel better, the mayor said \"that's where the facts are today.\"\nAccording to a source with knowledge of the investigation, the shooting happened at around 11:30 last night during a party at the Pentecostal church on Communipaw Avenue.\n\"Whether it makes people feel safer or not safer, the facts don't point to a random act and I'm just conveying the fact that the victim was deceased with a loaded handgun on him and in the past two years we have had several similar charges with this individual,\" he said.\nShea said multiple surveillance videos of the incident have been retrieved. He did not confirm if the city's closed circuit televisions on the corner near the shooting were operational.\nAdditional information has not yet been made available by the Hudson County Prosecutor's Office."}