{"uri": "http://www.nydailynews.com/news/crime/phoenix-police-link-seventh-homicide-killer-killers-article-1.2708895", "title": "'Serial shooter' on the loose in Phoenix linked to seven killings, three other acts of violence", "dct": "Tue, 12 Jul 2016 18:58:47 GMT", "id": "9d6b0742625f75cd589bf16ec4cd69c7", "content": "The same serial killer or killers who gunned down six people in Phoenix are linked to a seventh homicide and three other shootings, police said Tuesday.\nInvestigators also released a composite sketch showing a dark-haired man described as thin and lanky, possibly in his early ‘20s, as Phoenix Police Chief Joe Yahner asked the public for help tracking down any suspects.\n“Someone out there knows who did this,” Yahner said in a statement. “We need our community to call us or Silent Witness and help us solve these cases, bring justice to these families and victims, and prevent more violence from occurring.”\nDetectives probing a string of street killings between April 1 and June 12 in the Maryvale area of western Phoenix added other shootings outside the neighborhood to the investigation after reviewing all incidents after Jan. 1 that could be related, police said.\nPhoenix police Sgt. Jonathan Howard said all the victims in the shootings were shot at night inside or near a car in residential areas. Investigators have yet to determine a motive for the crimes or find any common traits of age, race or gender among the victims, Howard said.\n“I’m not asking people to be fearful,” Howard said. “I’m asking for them to raise their level of awareness to a healthy level.”\nPolice added the fatal April 19 shooting of 55-year-old Krystal Annette White along a street east of downtown, two aggravated assaults, and one criminal damage incident to the list of those investigators have connected to the same shooter or shooters.\nPlay Video\nPlay\nMute\nCurrent Time 0:00\n/\nDuration Time 0:00\nLoaded: 0%\nProgress: 0%\nStream TypeLIVE\nRemaining Time -0:00\nPlayback Rate\n1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptions\nFullscreen\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done\nCLOSE\nSkip in Skip\nx\nEmbed\nx\nShare\nThe Phoenix Police Department met with members of the community on Wednesday, July 6, 2016. Ben Moffat/azcentral.com\nA 16-year-old man and a 21-year-old man suffered non-life threatening injuries in shootings March 17 and 18, and an empty vehicle was shot up June 12 in the other newly linked incidents.\nThe suspect or suspects fired on the empty car minutes before police said they shot and killed Angela Linner, Maleah Ellis, and Stefanie Ellis in front of the Ellis’ W. Berkeley Rd. home. The night of April 1, the killers gunned down Diego Verdugo-Sanchez in front of a house on W. Turney Ave., investigators said.\nHoracio De Jesus Pena was killed June 3 on W. Flower St., and Manuel Castro Garcia died after he was shot on W. Coronado Rd. a week later, according to police.\nThe nonprofit Silent Witness has offered a $30,000 reward for credible tips in the case. The shootings happened a year after a series of unsolved Phoenix-area highway shootings.\nInvestigators met with Maryvale-area last week to discuss the recent spate of killings, The Arizona Republic reported.\n“I think that our neighbors are really anxious about it and I understand. We have little ones and we’re used to playing in the afternoon and we’re a little nervous right now,” resident Rosa Manjavar told the newspaper. “But I just hope that if we work together with the police department, if we work as a team, something is going to come up pretty soon.”\nWith News Wire Services."}