{"uri": "http://www.wacotrib.com/news/courts_and_trials/police-make-arrest-in-trendwood-apartments-shooting/article_6de76bdb-33dd-5d1b-a6da-4b67c66bb18f.html", "title": "Police make 1 arrest in Trendwood Apartments shooting", "dct": "Tue, 23 Aug 2016 15:03:00 GMT", "id": "0e665faa39221fad57cc6fd319b4a6f6", "content": "Nathaniel James Hailey was arrested after police reported that Hailey was one of several people seen outside the East Waco apartment complex, at 1700 Dallas Circle, late on July 26. Two men reportedly became involved in an argument that spread into a physical fight in the parking lot at Trendwood, the arrest affidavit states.\nAccording to the arrest affidavit, several subjects in the area were armed with guns, including Hailey. The fight was reportedly brief before Hailey had pulled out a pistol and pointed it at one of the subjects who was fighting.\n“Hailey made several threats then fired twice at (one man’s) feet,” the arrest affidavit states. “(The man) and the vast majority of the crowd began to run at that point.”\nSeveral people connected to Hailey also began to shoot, and when one of the subject’s ran past a car, a woman was struck by the gunfire, the arrest affidavit states. According to police reports, the 30-year-old woman suffered a gunshot to her lower back, and the 5-year-old victim had injuries to her eye from shattered glass.\nPolice reported one of the men involved in the initial fight saw the woman fall to the ground and attempted to help her, the arrest affidavit states. The man said he did not know whose bullet actually hit the woman, but Hailey started the shooting and fired shots at the man as he ran from the area, the document states.\n“There are approximately four different suspect shooters in this case, and 42 shell casings were located in the parking lot,” the arrest affidavit states.\nThe woman and child were taken to an area hospital for medical treatment. Police reported that doctors were unable to remove the bullet, believing it would do more damage if it was removed, the arrest affidavit states. Police were unable to compare the bullet lodged in the victim to any firearm.\nWaco police Sgt. W. Patrick Swanton said seven vehicles and at least one apartment were hit with bullets during the shootout. Several people were detained for questioning, and five people were later arrested on outstanding warrants or on trespass charges because they had previously been warned not to be at Trendwood.\nInitially, Swanton said the five suspects who were arrested were considered people of interest in the shooting. As of Tuesday afternoon, Hailey was the only person charged in the shooting.\n“This is still an active investigation, and it is safe to say that more arrests may come from the ongoing investigation,” Swanton said.\nHailey remained in McLennan County Jail on Tuesday afternoon in lieu of a $50,000 surety bond."}