{"uri": "http://www.fox29.com/news/229723938-story", "title": "Police: 16-year-old shot and robbed of iPhone in Germantown", "dct": "Wed, 18 Jan 2017 03:08:00 GMT", "id": "b9e2362d757de373a39e93547fc8cd32", "content": "PHILADELPHIA (WTXF) - A book bag left on the corner of the 6500 block of East Wister Street in Germantown is a disturbing reminder of the violence killing young people in Philly. The 16-year-old who was carrying that backpack is alive but in the hospital tonight. He’s in stable condition. The teen was shot in the hip. Police say someone walked up to him, shot him and stole his iPhone.\n“It was one quick pop and that was it,\" said a woman who lives on the block where it happened. She's afraid to show her face but says she had a feeling someone had been shot before she opened her door to police and a crime scene outside.\n\"There's no fire crackers and there's no holiday so I figured that's what it was,\" she said.\nPolice: 16-year-old shot and robbed of iPhone in Germantown\nPolice say the teen was standing on the bus stop when it happened around 3:30. The suspect walked up demanded the teen hand over everything he had before pulling the trigger.\nSonia Saunders owns a daycare center across the street from where it happened.\n\"The children are my first priority,\" she said. Saunders said they stayed inside and locked the doors.\n\"It's just a shame. I just pray. It's just terrible. I don't know what else to say.” Saunders says what happened is the norm around here and other areas and she says stopping it is not just the responsibility of police but others in the community.\n\"We need the men to take their place. That's all I ever begged for and asked for. I begged for and screamed for them to take their place because that's what we need,\" said Saunders.\nThe woman who didn't want to be identified says she's a mother and she can't help but think about what the mother of the 16-year-old is going through.\n\"For someone to get shot over something as stupid as an iphone I just think it's tragic. I know the mother is probably hurting knowing that her son got robbed for something that only cost 100 or 200 dollars anymore.\"\nPolice have not made an arrest or recovered the weapon."}