{"uri": "http://www.khou.com/story/news/crime/2015/06/11/third-ward-quadruple-shooting-early-thursday/71052310/", "title": "Teen killed in Third Ward quadruple shooting", "dct": "Thu, 11 Jun 2015 00:00:00 GMT", "id": "b5918e58a39da37f2d2f057e8dd8bdf9", "content": "HOUSTON – A teenager was killed in a quadruple shooting in Houston's Third Ward, police said early Thursday.\nThe shooting was reported on Burkett near Holman before 4 a.m.\nThe dead teen was identified as 17-year-old William Orobio.\n\"We're going through a lot to lose someone that's closest to us, that means everything to us, has two kids,\" said Jasmine Eldridge, a cousin of the victim.\nOrobio had just finished his junior year at Yates High School.\n\"I don't know why would they harm him. He's a good child,\" Eldridge added. \"He's not disrespectful or anything like that.\"\nAt least one of the other three people shot was said to be unresponsive as he was taken to the hospital.\nAll of the victims were in their older teens or early 20s.\nPolice said a fight between rival gangs at a nightclub on O.S.T. near State Highway 288 might have led to the shootings, but the investigation is still underway. A detailed description of the gunman was not available.\nInvestigators are still trying to get witnesses to open up, so they can find out who drove up to the corner and unloaded dozens of shots.\nThird Ward neighbors say they felt like they were trapped in a battlefield with dozens of shots flying every which way.\n\"It was like a disaster man. Cars was everywhere,\" Louis Carter said.\nNeighbors say shots were fired in several locations of this community near TSU Wednesday night and into the early morning.\n\"I feel like it's going to be a war zone. I don't even want to be out here no more. It's gonna be a war zone,\" one resident said.\nResidents tell KHOU 11 News that gun violence is spiraling out of control in the community.\nMae Smith has watched her neighborhood go from quiet to crime-ridden.\n\"Didn't worry about no one coming in your door,\" Smith said. \"But now, you can't even go to the store and come back because if you do, they're in there taking what you got.\"\nOr in the latest case, taking a life.\n\"I feel bad about it because there's no need to take anyone's life,\" Smith said.\nIf you know anything about the shooting, please call Crime Stoppers at 713-222-TIPS (8477)."}