{"uri": "http://wane.com/2016/09/14/victims-of-triple-homicide-at-sports-bar-idd/", "title": "Victims of triple homicide at sports bar ID’d", "dct": "Wed, 14 Sep 2016 10:24:00 GMT", "id": "d540af0aecd50ed250cc504543c1becd", "content": "FORT WAYNE, Ind. (WANE) The three men killed in the early Tuesday shooting of five people at the Sports and Spirits Bar along East Wayne Street have been identified.\nNicholas Lee Powers, 30; Demario Laquan Burnett, 21; and Jerry Trivon Coleman, 31 all died of gunshot wounds, the Allen County Coroner said early Wednesday. The deaths of each men were ruled homicides, a collection that pushed the county’s total to 34 in 2016.\nFort Wayne Police were called were before 2:30 a.m. Tuesday to the sports bar at 1723 East Wayne Street. When officers arrived, a crowd of people was found inside and outside the bar, according to Public Information Officer John Chambers.\nPeople were cleared out of the building, which police spokesman Michael Joyner described Tuesday as “packed,” and officers and paramedics found the victims. Paramedics gave them medical attention, but the men were pronounced dead.\nTwo other people – both juveniles – were taken privately to a hospital and in good condition.\nWitnesses told police they heard gunshots inside the bar and saw a person running from the scene. Investigators were working to collect more information from witnesses.\nTuesday was not Fort Wayne Police’s first time at the Sports and Spirits Bar. According to department records, officers have been called to the bar 436 times in the last ten years. Twelve shootings were reported in that time, along with seven stabbings and 19 claims of shots being fired.\nHours after the last call, owner Burke Baughman voluntarily relinquished the establishment’s liquor license back to the state and said they do not plan to reopen. It ended a court battle over the bar’s liquor license that dated some two years.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}