{"uri": "http://www.reviewjournal.com/crime/homicides/coroner-ids-jewelry-store-worker-accidentally-killed-henderson-robbery-attempt", "title": "Coroner IDs jewelry store worker accidentally killed in Henderson robbery attempt", "dct": "Mon, 23 Jan 2017 09:58:00 GMT", "id": "0e27ab39f68b49b8bc3dfdf775a2220f", "content": "Kimberlee Ann Kincaid-Hill was the motherly type, though her only “child” was a black schnauzer named Gretel.\nShe took care of her elderly mother and visited her daily, and she was always the first person to bring in treats and wish co-workers a happy birthday.\n“This was a very special human being,” said Kincaid-Hill’s friend Maria Ryder-Curry. “She was just the nicest, kindest person you ever want to meet.”\nA security guard fatally shot Kincaid-Hill, 57, by accident Saturday night during an armed robbery attempt at the Jared The Galleria of Jewelry store where they both worked in Henderson. The guard’s round missed the robbery suspect and struck Kincaid-Hill in the chest. She later died at Sunrise Hospital and Medical Center.\nOfficer Scott Williams, a Henderson police spokesman, said the unidentified robbery suspect entered the store and threatened Kincaid-Hill. The security guard then challenged the man, determined there was a threat and fired the shot that missed the suspect and killed Kincaid-Hill.\nThe gunman ran from the scene empty-handed and was still at large Monday.\nThe shooting occurred just minutes before the store’s 9 p.m. closing time. Ryder-Curry, who lives nearby, said she saw the large police response but didn’t think much of it. When she turned on the morning news the next day, she saw her friend’s store had been the site of an attempted robbery and an employee had been killed.\nThe would-be robber will face murder charges because Kincaid-Hill was killed during the crime. The security guard will not face charges in connection with the accidental shooting, Henderson police spokeswoman Michelle French said Sunday.\n“I just hope that this person that did this, if they have any decency and any love left in their heart, they turn themselves in,” Ryder-Curry said.\nJared posted a statement Sunday on Twitter about Kincaid-Hill: “We are shocked and saddened to learn of the loss of our team member and extend our sympathies to her family, friends and colleagues.”\nKincaid-Hill had been working at the store since September.\nMichelle Zimkus stopped by the Jared, where she and her husband regularly shopped, to lay flowers Monday afternoon at a makeshift memorial.\nZimkus said Kincaid-Hill would remember her from prior visits and pick up conversations where they had left off. Kincaid-Hill also remembered jewelry preferences and could help Zimkus’ husband choose items when he shopped alone.\n“It’s devastating,” Zimkus said, reflecting on Kincaid-Hill’s death. “It’s heartbreaking overall.”\nAnyone with information about the robbery can call the Henderson Police Department at 702-267-4911 or Crime Stoppers at 702-385-5555 to remain anonymous.\nSaturday’s incident is the second local jewelry store robbery in just over a week. A man armed with a handgun made off with an undisclosed amount of jewelry on Jan. 13 from the MJ Christensen Diamond Centers at 8980 W. Charleston Blvd. No one was injured.\nThis is the first homicide investigated by the Henderson Police Department in 2017 and the 14th homicide of the year in Clark County.\nContact Blake Apgar at bapgar@reviewjournal.com. Follow @blakeapgar on Twitter. Contact Rio Lacanlale at rlacanlale@reviewjournal.com or at 702-383-0381. Follow @riolacanlale on Twitter."}