{"uri": "http://www.news4jax.com/news/police-identify-man-killed-in-driveby-in-nw-jax/36253734", "title": "2nd body found in ditch day after drive-by shooting identified", "dct": "Thu, 05 Nov 2015 22:52:00 GMT", "id": "82f7677189830812c448a7fadc8079c6", "content": "JACKSONVILLE, Fla. - Police continue to search for the shooter in a drive-by shooting from Tuesday night after they found another body in a ditch along West 10th Street Wednesday afternoon that they said is a result of the shooting that killed an 18-year-old, 19-year-old and left three other men hospitalized.\nOfficials said the intense rainfall the night of the shooting was so severe that the body found Wednesday was hidden by water.\nThe Jacksonville Sheriff's Office said Tuesday's shooting occurred just before 6 p.m. on Ella Street, near Kings Road. Police identified the man killed as Anthony Ray, whose body was also found in a ditch. They have not named the other three victims, who had non-life-threatening injuries.\nPolice identified the body found Wednesday as Trayvon Deshay Lundy, 19. They said heavy rain while they were gathering evidence Tuesday night made it difficult to spot the body.\nLundy's body was also found in the ditch along West 10th Street.\nAccording to detectives, Wednesday's shooting followed some sort of argument between the men and whoever was in the car.\nPolice said they did not know how many men were in the car, but said they think there was more than one person.\nJSO is searching for the car, which they described as a red Toyota Camry with a blue front passenger door.\nAnthony Ray's father said his family was devastated by what happened.\n\"This is outrageous for me, very outrageous. I don't know how to feel right now. It's more shocking than anything,\" said Roy Ray.\nRay said his son was a good son but he couldn't speak for what type of activity he may have been involved in.\nOne of the men shot Tuesday night is out of the hospital. He told News4Jax he was shot in the neck and should make a complete recovery.\nNews4Jax Crime and Safety Analyst, Gil Smith, said that police will now use what information they've been able to get out of the surviving victims but said it may not be a lot.\n\"The survivors may not be cooperative, they may not be giving information because they may fear for their lives. With these people being so young, 18 to 19 years old, there's a strong likelihood it may be gang-involved. We don't know that for sure, but in these types of situations where you have this type of a shooting and they're that young, it usually involves gang members,\" Smith said.\nAnyone with information on the shooting or the location of the car is asked to call Crime Stoppers at 866-845-TIPS. Callers can remain anonymous and could be receive a reward of up to $3,000.\nCopyright 2015 by News4Jax.com. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}