{"uri": "http://scallywagandvagabond.com/2016/09/megan-quinn-sloss-shot-dead-brother-gun-accident/", "title": "Megan Sloss shot dead by brother after gun accidentally goes off", "dct": "Thu, 22 Sep 2016 00:00:00 GMT", "id": "cae224cb7c201e8ddde2a9a802f2be62", "content": "Megan Sloss an Iowa graduate is accidentally shot dead by her brother as they drove to target shooting. Gun went off as Spencer Sloss was giving pointers.\nMegan Sloss a 24 year old Iowa graduate student has died after a gun her brother was showing her accidentally discharged, striking and killing her.\nThe incident happened as the brother, Spencer Lee Sloss, 26 was showing his sister how to clean his gun.\nThe incident told the Sac County Sheriff’s Office happened over the weekend as the pair were driving to a family event.\nInvestigators say Megan Quinn Sloss was in the driver’s seat while her brother was in the passenger seat when the brother’s Sig Sauer 9mm gun went off circa 11.40 am as they approached Lake View.\nA report via the dailymail told of the pair en route to a family event in Ida County where they planned to do some target shooting.\nUpon being struck in the hip, the brother called 911 where upon Megan was eventually transported to Mercy Medical in Des Moines where she died from her injury.\nOfficials say Spencer Sloss has a valid permit to carry the handgun. No charges have been brought against him, and the shooting remains under investigation.\nAccording to her obituary, Megan Sloss was pursuing a Master’s degree in social services and planned to spend her career helping children and adults in need.\n‘Saddened to lose Hawkeye Megan Sloss, a grad student looking to help others in need,’ the University of Iowa tweeted Tuesday, reported the Iowa City Press-Citizen.\nSloss was also working at Iowa KidSight and the University of Iowa Hospitals and Clinics.\n‘She was the homecoming queen, a beautiful dancer, a teacher, a good friend to many and a lover of the little things in life,‘ the obituary reads. ‘She had an uncommon devotion to God and her Church. She had a beautiful and kind spirit that touched many lives.’\nMegan, who loved dance, was a member of the Central College Dance Team when she attended school. The team posted a tribute to her on its Facebook page, calling her “a talented, beautiful lady.”\nMegan Sloss is survived by her parents, Curtis and Brenda Sloss, and two older brothers, Spencer and Kyle."}