{"uri": "http://www.wfmz.com/news/news-regional-berks/reading-shooting-victim-my-first-reaction-was-to-run/41534164", "title": "Reading shooting victim: 'My first reaction was to run'", "dct": "Tue, 06 Sep 2016 21:55:00 GMT", "id": "63adc6a6ee17d9523b28ad6d630b73ab", "content": "READING, Pa. - One of the four people wounded by gunfire in Reading on Labor Day is speaking out about the ordeal he endured.\n\"I thought it was fireworks,\" the victim, who did not want his name released, told WFMZ's Amanda VanAllen from his hospital bed on Tuesday.\nThe man and three other people were shot when someone with a gun opened fire in the 600 block of Moss Street shortly before 5:30 p.m. Monday.\n\"It just happened out of nowhere,\" said Mary Rodriguez, a neighborhood resident. \"The guy came running from the alleyway and just started shooting everybody, shooting at anybody who was out here. It was crazy.\"\n\"My first reaction was to run towards the backyard, but it was already too late 'cause my left leg got hit,\" said the victim, who fractured his left calf but did not require surgery.\nThe victim said he didn't recognize the gunman, and described him as a black man wearing a black shirt.\n\"I was at the wrong place at the wrong time yesterday,\" he said.\nTwo of the other three victims were last reported to be in serious condition.\n\"Through the evidence we have collected, we believe there are two firearms involved, so at this point, we believe there's at least two shooters involved,\" said Capt. Damond Kloc, Reading Police Department. \"We don't know if it was two shooters shooting at a group of people or an exchange of gunfire yet, but, once again, it's still very early in the investigation.\"\n\"It's a shame. It's a shame what this world is coming to,\" Rodriguez said. \"There's a whole bunch of kids every day on this block, and I'm talking about little, little kids.\"\nAnyone with information that can help is urged to contact Crime Alert Berks County via anonymous text to 847411, starting the message with keyword alertberks, or by calling 877-373-9913.\nA cash reward is being offered for information that leads to an arrest."}