{"uri": "http://www.latimes.com/local/lanow/la-me-ln-14-shot-bakersfield-20160716-snap-story.html", "title": "14 people wounded in shooting at Bakersfield house party", "dct": "Sat, 16 Jul 2016 18:15:00 GMT", "id": "2c19969a2293bb369bf164f09aa2efda", "content": "Three young men who were told to leave a Bakersfield house party returned early Saturday morning and opened fire into a crowd of more than 100 teenagers, injuring 14 people, authorities said.\nThe shooting occurred about 1 a.m. in the 600 block of Stephens Drive and left two people in critical condition, said Ray Pruitt, a spokesman for the Kern County Sheriff’s Department. All of the victims are expected to survive.\nPruitt described the suspects as black males between the ages of 16 and 19, but he said that as of Saturday night, no arrests had been made.\nA girl who lives at the home where the shooting occurred was given permission to throw a party by her parents and promoted the party on social media, Pruitt said.\n“At some point, people who were not invited showed up,” he said. The party swelled to at least 150 revelers and “at some point, it got out of control,” Pruitt added.\nAuthorities believe a verbal confrontation took place between two different groups in the backyard of the house, and several people were told to leave the party.\n“They did leave, and we believe it was those individuals who left the party that came back and opened fire on the crowd,” Pruitt said, adding that investigators believe the shooting was gang-related.\nThe sheriff’s department said the incident was initially believed to be a drive-by shooting, but Pruitt said investigators now believe the three males got out of a vehicle, walked up to the crowd outside the home and opened fire before fleeing in the vehicle.\nAuthorities also believe that at least one person in the crowd returned fire.\nPruitt said his department does not have a description of the vehicle, and deputies have been having difficulty getting victims and witnesses to identify the shooters.\nThe shooting occurred on a suburban street lined with tract houses not far from the freeway interchange of California 99 and 58.\nVic Hager, 63, lives across the street from the house where the party and shooting took place.\nIn a phone interview Saturday, he said there were at least 150 people at the party. Most attendees appeared to have been dropped off because the street was not filled with cars, he said.\nThe party got a little noisy, Hager said, adding that “it wasn’t out of line.”\nPruitt, the sheriff’s spokesman said he was not aware of any noise complaints reported before the shots were fired.\nHager said he had just gone to bed about 12:30 a.m. when he heard what sounded like fireworks.\n“Then the pops got a little slower, and I realized it was a gun, and by the time I looked out my window, everyone was scattering,” Hager said.\nNEWSLETTER: Get essential California headlines delivered daily »\nHe estimated that at least 15 shots were fired but said he had no idea who opened fire. When he looked out his window, he said he heard people screaming and saw at least three teens injured and lying on the ground.\nA short time later, law enforcement vehicles and ambulances arrived, clogging the street. Hager said most of the people being transported to hospitals were sitting upright on gurneys or in wheelchairs and appeared to be conscious.\nHager said a woman who lives in the house told him that her husband was shot in the neck, but that he had been released from the hospital. Hager said he set up an awning, fans and other accommodations for the family, who were camped in his yard Saturday morning as they waited to return to their home.\nHe said he believes the family includes a man and his wife, a high school-age daughter and possibly a son, but he declined to identify them. He praised the family as the “best neighbors,” who watch over his property when he and his wife leave town. He emphasized that they are not “gang-banger-type people.”\nThere is a possibility the parents could be held liable for violating Kern County’s “social host ordinance,” Pruitt said, because authorities believe the parents allowed juveniles to come to a party where alcohol was served. He said deputies found a number of alcohol containers in the backyard.\nALSO\nProfessor who killed man she says raped her gets six years in prison\nDecaying carcass of 22-ton whale just won't leave Orange County coast\nAfter mother killed by car, bear cubs are being raised by wildlife caregivers\nUPDATES:\n5:45 p.m.: This post was updated with new details from the Sheriff’s Department about the shooting and the assailants.\n5:25 p.m.: This article was updated more information from authorities.\n11:50 a.m.: This article was updated with reaction from a neighbor.\n9:10 a.m.: This article was updated with tip line information.\n8:30 a.m.: This article was updated with the location of the shooting.\nThis article was originally published at 7:40 a.m."}