{"uri": "http://www.bakersfield.com/News/Breaking-News/2016/07/16/Fourteen-people-shot-outside-party-in-south-Bakersfield.html", "title": "In south Bakersfield, seconds of shooting, then chaos", "dct": "Sat, 16 Jul 2016 00:00:00 GMT", "id": "c2dcebfc5a9509147ab736b58ca68143", "content": "It was just before 1 a.m. Saturday when Walter Vides got back to his south Bakersfield home from a late shift at work. Across the street, his neighbor’s daughter was throwing a house party with more than 100 people in the front and back yards. Minutes later, he heard a barrage of gunfire, then chaos.\nKids as young as 13 were riddled with bullets, running to escape the two gun-wielding teenagers and a third who police suspect were tossed from the house party and came back for revenge. They injured 14 people, firing off more than 30 rounds into the night. They are still on the loose.\nWhen Vides looked out his door, he saw a 16-year-old girl shot in the shoulder fleeing across his driveway to take cover behind his garage, a 13- or 14-year-old boy bleeding from his leg trying to hop his fence and scores of others running for their lives.\nAt least one party guest returned fire, police said. They believe the shootout in the 600 block of Stephens Drive was gang-related.\nAnother bullet grazed the head of a man named Jesse, who Vides said owns the home where the party took place. It ripped off part of his ear, Vides said. That man arrived home Saturday before noon, still in a hospital gown with a blood soaked bandage wrapped around his head.\nThat man’s daughter, who police say had her parents’ permission to throw the party but attracted unwanted guests by posting the event on social media, was also shot, Vides said.\nThe early morning shootout marks the worst in the city this year as the number of violent shootings in the Bakersfield area rises to at least 50 since the start of April, according to a tally by The Californian. No fewer than two dozen people have died as a result, topping last year's total of 15 gunfire-involved homicides across Bakersfield.\nWhile party-goers were standing in the street and in front of the house party, a vehicle drove up. Three men, described as black teenagers between 16 and 19 years old, exited, and two opened fire into the crowd, said Ray Pruitt, a public information officer with the Kern County Sheriff’s Office.\nHe said investigators were having trouble getting information from victims and witnesses, adding, “We believe that people who were at the party know who these suspects are.”\nWhile Pruitt said the victims appeared to be random targets, Vides said the assailants chased some party-goers down the street as they fired shots. About a block from the house party, police pulled at least one stray bullet from the passenger side of Cecilia Noriega’s Toyota Scion, which took fire while parked in her driveway.\nInvestigators drew 32 yellow circles on the pavement of Stephens Drive, marking the spots where spent shell casings lay just a few yards from asphalt stained dark red."}