{"uri": "http://www.fresnobee.com/news/local/crime/article85282307.html", "title": "Toddler fatally shot by gunman in front of parents in southeast Fresno", "dct": "Wed, 22 Jun 2016 10:22:00 GMT", "id": "77a59e1ff6899e9dcfe2e27737b5c0df", "content": "Visibly distraught, Fresno police Chief Jerry Dyer vowed Wednesday to “do everything we can” to bring to justice the shooter who gunned down 20-month-old Rashad Halford Jr. in front of the toddler’s parents.\n“A tragedy occurred in our city last night,” said Dyer, who took several minutes to compose himself before addressing the media at police headquarters.\nThe father and another man were wounded in the shooting, which happened about 11 p.m. Tuesday at an apartment complex at South First Street and East Platt Avenue.\n“I cannot remember the last time we had a child shot in our city like this,” Dyer said.\n“The family is absolutely broken. We have a 20-month-old child who has been shot and killed in our city and it is difficult to make sense out of that.”\nDyer provided a chronology of the events leading to Rashad Jr.’s murder:\nIt was a warm summer evening and a number of people living at the complex, along with friends, were sitting on and around an electrical box and milk crates. Rashad Halford Sr., 28, was sitting on the box and Rashad Jr. was leaning on his dad. Then, Rashad Sr. saw a man in a black hoodie walking toward him. (The man might have walked past previously, Dyer said.) As the man came closer, he pulled the strings on the hoodie tighter, presumably to obscure his face.\n“What’s up?” he asked, before pulling out a handgun and firing at least 10 rounds at Rashad Sr., who fell to the ground. Rashad Jr. and Willis Mucelroy, 42, also fell. Rashad Sr. then pulled his wounded son to his chest and held him before passing him to his mother.\nAll three were rushed to the hospital. Rashad Jr. died several hours later. His father, who was hit by several bullets, remains hospitalized, as does Mucelroy.\nDyer said the gunman is African American, standing about 5-foot-10 and weighing 200 to 215 pounds. He had an Afro-style haircut and was wearing jeans and white shoes.\nThe chief said the shooting might be gang-related and added that Rashad Sr. had gang connections when he was a juvenile. Dyer said he spoke to Rashad Sr. at the hospital and believes he has changed his life as an adult.\n“No family deserves this,” Dyer added.\nAs for the gunman, “It was very apparent that he knew there was a baby present,” he said.\nFor police officers, Dyer said “there is as sense of personal responsibility” about the shooting, “and we take it extremely hard.”\nAnyone with information about the shooting is asked to call Crime Stoppers at (559) 498-7867, where a reward of $3,000 may be awarded for information leading to an arrest.\nJim Guy: 559-441-6339, @jimguy27"}