{"uri": "http://www.trentonian.com/general-news/20161208/shooting-bank-robbery-and-drugs-december-8-2016-trentonian-police-blotter", "title": "Shooting, bank robbery and drugs: December 8, 2016 Trentonian Police Blotter", "dct": "Thu, 08 Dec 2016 21:43:00 GMT", "id": "61002bfe93cb33516fc176cc731fa177", "content": "The information below was provided by police unless otherwise noted.\nShooting: A 17-year-old male was shot in both legs Wednesday night. Officials say police were sent to the hospital around 8:10 p.m. and spoke with the victim who didn’t provide much information. The victim underwent surgery for non-life-threatening wounds, and the circumstances surrounding the shooting are still under investigation.\nLawrence\nBank Robbery: Paul Wolak, 24, was arrested Wednesday evening after he allegedly robbed First Choice Bank on Whitehead Road. Officials say Wolak entered the bank wearing a black bandana as a mask over his face and demanded money from a teller. He then left the bank with an undisclosed amount of cash and fled on foot toward the Trenton Freeway. Police units responding to the suspect alert that was broadcast apprehended Wolak as he ran along the freeway in the area of Glenview Drive. Wolak is charged with robbery, theft, obstructing the administration of law and hindering apprehension. He was released from police custody after posting $75,000 bail.\nPot Bust: Dowrnisha Sylney, 20, of Willingboro, was arrested after police allegedly found several burnt marijuana cigar blunts inside a vehicle she occupied during a traffic stop on Rancocas Road.\nAdvertisement\nPot Bust Too: Juan Cano, 25, of Plainsboro, was recently arrested after police allegedly found drug paraphernalia containing marijuana residue in a car he occupied. Police say Cano was in a vehicle parked under the cloak of darkness at the the dead end portion of Old Meadow Road. Officials say Cano was in possession of a glass mason jar containing a black “Chromium Crusher” grinder with marijuana residue, a multi-colored glass pipe with marijuana residue, as well as a glass mason jar containing two lighters and “Raw” rolling papers.\nTheft from Auto: Approximately $11,072 worth of various items were stolen out of a 2010 Honda that was parked at the Market Fair on Route 1.\nAnother Pot Bust: Anton Shvets 24, of Princeton, was arrested after police allegedly found him in possession of a black metal “Cali Crusher” grinder containing marijuana.\nBristol, Pa.\nTheft from Garage: Welding equipment valued at $5,000 was stolen out of a garage located in the 1400 block of Hardy Street.\nPurse Theft: A purse containing cash was stolen from the 100 block of Wildflower Road. The loss is estimated at $55.\nMissing Charger: A phone charger valued at $20 was stolen out of a 2015 Dodge that was parked in the 3300 block of Glenrose Avenue.\nTheft from Auto: The in-dash radio and loose change were stolen out of a 2008 Mercury that was parked in the 1000 block of Arthur Avenue. The loss is estimated at $250.\nMissing Phone: A Samsung phone valued at $120 was stolen from the 100 block of Lloyd Street.\nStolen Decorations: Several Christmas decorations were stolen from the front lawn of a home located in the 200 block of Blueridge Drive. The theft and damage is valued at $125.\nVandalism: Someone punctured two tires on a 2011 Kia that was parked in the 100 block of Goldenridge Drive. The damage is estimated at $250."}