{"uri": "http://www.freep.com/story/news/local/michigan/detroit/2016/08/03/diallo-davis-easter-aniaya-montgomery/87993244/", "title": "Man gets 9-20 years in prison in girl's Easter slaying", "dct": "Wed, 03 Aug 2016 00:00:00 GMT", "id": "6933d5057952df2fb2fd463e3c54e525", "content": "Aniaya Montgomery was killed in the 16800 block of Riverview on the city’s west side March 27.\nA Detroit man will serve nine to 20 years in prison for his involvement in an shooting that left a 3-year-old girl dead and two adults wounded in a house on the city's west side in the early morning hours of Easter Sunday.\nDiallo Davis, 23, who wasn't the gunman who shot the girl, appeared before Judge Timothy Kenny in Wayne County Circuit Court and briefly addressed the courtroom before he was sentenced, expressing remorse for his part in the girl's death.\n\"I'd like to say I'm sorry for the death of the little girl,\" Davis said. \"That was never my intention. I want to say sorry to the family and to my family for letting everyone down.\"\n►Related:Bank robbery suspect fatally shot at Detroit motel, police say\nAniaya Montgomery was killed March 27 in a barrage of gunfire inside a house in the 16800 block of Riverview. Two others, a 26-year-old man and 39-year-old man, were also shot, but survived.\nThe prosecutor's office alleges that at about 2 a.m., Davis and three other men went to a home located in the 16800 block of Riverview in Detroit and fired shots that killed the girl.The child was taken to a local hospital, but she was pronounced dead on arrival.\nNo one from Montgomery's family was present in the courtroom.\nDavis was charged with first-degree murder, felony murder, two counts of assault with intent to murder, first-degree home invasion, discharge of a firearm in or at a building causing death, discharge at a building causing injury, felon in possession of a firearm and felony firearm. But in a deal reached with the Wayne County Prosecutor's Office, he pleaded guilty to assault with intent to commit murder.\nAnother defendant, 19-year-old Reginald Street, also appeared before Kenny Wednesday for what was supposed to be a sentencing hearing, but Wayne County Assistant Prosecutor Athina Siringas said he \"failed to comply with his plea agreement.\" So, the judge set a Aug. 31 docket conference and a tentative Nov.16 trial date.\nStreet was charged with first-degree murder, felony murder, assault with intent to murder and home invasion. Under his original plea deal, he pleaded guilty to second degree murder and felony firearm. Street appeared briefly in the courtroom and glanced back at a row filled with his family members, while he addressed the judge.\nDuring previous court proceedings, Siringas said Street and another man, Paul Kendall, were the shooters and had both given statements to the police about their involvement.\nSiringas said Kendall, who committed suicide in the Wayne County Jail in April, entered the home and was the one who shot the 3-year-old. Kendall was facing charges that included first-degree murder, attempted murder, home invasion and felony firearm.\nJonathan Burks, another man charged in connection with the homicide, is the brother of a person who had an earlier confrontation and gathered people together before the shootings. Burks is also charged as a habitual offender and facing several charges including first-degree murder, felony murder, assault with intent to murder and home invasion. His case is ongoing, according to the prosecutor's office.\nContact Katrease Stafford: kstafford@freepress.com or 313-223-4759."}