{"uri": "http://ktla.com/2014/09/03/4-men-wounded-in-south-l-a-shooting-2-other-people-shot-in-previous-incident/", "title": "4 Men Wounded in South L.A. Shooting; 2 Other People Shot in Previous Incident", "dct": "Wed, 03 Sep 2014 18:56:00 GMT", "id": "84c9b8cab9a49501ee268d7a74da0f0a", "content": "Six people were wounded by gunfire in two separate incidents Wednesday in South Los Angeles, authorities said.\nThree men were shot “in the leg or foot” about 9:45 p.m. near the intersection of East 27th Street and Stanford Avenue in South-Central, according to Lt. John Pinto of the Los Angeles Police Department. Another man suffered a graze wound.\nThe victims fled the scene and were found by first responders at two other locations, in the 900 block of East 27th Street and the 400 block of East Adams Boulevard, Pinto said.\nThe three men who were shot in their extremities were transported to local hospitals in unknown condition. Their injuries were not life-threatening, authorities said. It was unclear if the fourth victim was taken to a hospital.\nNo description of the shooter or shooters was immediately available.\nIn an earlier incident about 4:50 p.m., a 17-year-old girl and 24-year-old man were struck in a car-to-car shooting in the Vermont Knolls area, according to the LAPD.\nThe girl was shot in the head, and the man was hit in the abdomen, said LAPD Lt. Sal LaBarbera. Both vehicles left the scene, near the intersection of South Vermont and West Manchester avenues.\nThe male victim drove toward the Police Department’s 77th Street station, about a mile and a half away, at 7600 South Broadway, LaBarbera said. He dropped off the girl before stopping across the street from the building.\nThe girl and man were transported to a hospital, where they were listed in critical and stable condition, respectively, authorities said.\nThe shooters, believed to be gang members, were described only as four male African-Americans, according to the Police Department. They remained at large."}