{"uri": "http://www.abcactionnews.com/news/region-polk/one-dead-two-seriously-injured-following-polk-co-home-invasion", "title": "Second death report in Polk home invasion, one released from hospital", "dct": "Sat, 09 Jul 2016 21:59:00 GMT", "id": "8c5194bd5883ac8ea921514b0b12813b", "content": "Autoplay:Second death report in Polk home invasion, one released from hospitalCONNECTING...XOne dead, two seriously injured following Polk Co. home invasion\nWINTER HAVEN, Fla. - UPDATE: Ricardo Garcia Gomez, the 25-year-old suspect in the Winter Haven burglary and home invasion of an elderly couple, was pronounced dead at an area hospital overnight, Polk County sheriff's officials said.\nMary McLees was released from the Winter Haven hospital Saturday after she received treatment for her wounds. She was struck by bullet fragments on the left knee and grazed by a bullet on her right foot.\nOriginal Story I One dead, two seriously injured following Polk Co. home invasion\nOne person is dead, and two others are seriously hurt following a home invasion in Polk County. It happened in a retirement community in rural Winter Haven in the middle of the day.\nPeople who live in Winter Haven Oaks say there are rarely problems in the neighborhood. Many can only recall a few car break-ins in the past, but never anything as violent as what unfolded Saturday. Now, they are heartbroken that a 78-year-old neighbor has died, and that his wife is fighting for her life.\n\"It's just a very sad, sad situation,\" said neighbor Shirley Bischak.\nPolk Co. deputies say around 3:30 p.m. Saturday, they got a 911 call about a shooting on Laurel Oak Drive. When they arrived on scene, they found 72-year-old Mary McLees in the yard, shot twice. Her 78-year-old husband Paul McLees, was still inside the home with the suspect, 25-year-old Ricardo Garcia Gomez. Deputies made a tactical entry into the home and found Paul and Ricardo, both shot.\nNeighbors can't imagine why anyone would want to hurt the beloved couple.\n\"They were always very friendly, saying hi. They went to the pool every day. So yes, it's very upsetting. They were a very nice couple,\" said neighbor Doris Sharak.\nInvestigators believe Gomez went into the McLees' home with a large knife, and forced homeowner Paul McLees to open a safe. Paul pulled out a gun from inside the safe, and started shooting at Gomez. In the process, somehow Paul's wife Mary was shot, but escaped to a neighbor's home where she called for help. But Paul did not survive. Mary McLees and the suspect Ricardo Gomez, were both seriously injured and remain hospitalized.\nNeighbors are now praying for the family and say they'll be taking extra steps to stay safe.\n\"I'm feeling like I need to make sure my doors are locked, even during the day now. Sometimes we do go in and out during the day and leave it open, but I won't now. And maybe looking into some kind of security camera. It's just happening everywhere nowadays,\" Sharak said.\nDeputies say they're not sure why Gomez may have targeted the McLees home. It does not appear he knew the couple personally.\nNeighbors say security will definitely be a topic of discussion at the next homeowner's association meeting.\nIn a statement, Polk Co. Sheriff Grady Judd said:\n\"This is a horrific and tragic situation. We are early in this investigation and hope to be able to piece together how this 78-year-old man who was defending himself and his home was fatally shot. Our thoughts and prayers are with his loved ones.\"\nCopyright 2016 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}