{"uri": "http://www.wtsp.com/news/local/polkcounty/polk-sheriffs-investigating-shooting-in-winter-haven/268432933", "title": "Man dies defending himself, wife in home invasion; Suspect also dead", "dct": "Sun, 10 Jul 2016 00:00:00 GMT", "id": "cdf1ca186a5016ea10b521be91f8cad6", "content": "POLK COUNTY, Fla. -- The Polk County Sheriff's Office has updated the condition of Mary McLees Sunday, who was injured by gunfire during a deadly home invasion in Winter Haven on Saturday.\nMary has been released from Winter Haven Hospital after suffering two gunshot wounds. She was hit in the left knee by bullet fragments and grazed by a bullet on her right foot.\nMary's husband Paul, died while defending her from a robber, Ricardo Garcia Gomez, who broke into their house while armed with a knife. As Gomez threatened Paul with a knife, Paul was able to retrieve a gun from a safe and shot at Gomez, with Mary being caught in the crossfire.\nIn the ensuing struggle, both Paul and Gomez received life-threatening gunshot wounds. Paul died at the scene and Gomez died later at an area hospital.\nAccording to PCSO, Mary provided a portrait of her and Paul and said they were married at the age of 19 and had two children together.\n\"While I am so sad to have lost him, I feel so lucky to have had him for 53 years before yesterday,\" Mary said.\nORIGINAL STORY FOLLOWS BELOW\nA 78-year-old man died Saturday while police say he was defending his home from an armed burglar, who also died as a result of their altercation.\nAround 3:40 p.m. on Saturday, the PCSO Emergency Communications Center received a 911 call in reference to a shooting that had taken place at in the 5400 block of Laurel Oak Drive in unincorporated Winter Haven, which is the home of Paul McLees, 78, and his wife, Mary, 72.\nWhen deputies arrived at the scene, they found Mary outside suffering from two gunshot wounds. She told deputies an armed man was still in her home with her husband.\nDeputies made a tactical approach into the home and located Paul and the suspect, identified as 25-year-old Ricardo Garcia Gomez, in a back bedroom, both of whom were suffering from gunshot wounds.\nAccording to the investigation so far -- which is in its very early stages and is subject to change -- Gomez entered the McLees' home armed with a large knife. While Gomez was forcing Paul at knife point to open a safe, Paul pulled a firearm out of the safe and began shooting at Gomez. In the process, Mary was shot twice. She was able to escape and run to a neighbor's home to call for help.\nPaul was unable to be revived by first responders at the scene, and died at the scene.\nGomez was taken to an area hospital with life-threatening injuries and is undergoing surgery. He passed away overnight Sunday, according to the Polk County Sheriff's Office.\nPolice do not know at this time why Gomez chose to rob the McLees.\n\"This is a horrific and tragic situation,\" said Polk County Sheriff Grady Judd. \"We are early in this investigation and hope to be able to piece together how this 78-year-old man who was defending himself and his home was fatally shot. Our thoughts and prayers are with his loved ones.\"\nPolice say Gomez has one prior arrest in Polk County, in 2010 for Driving with License Suspended/Revoked and Harassing a Working Police Dog.\n(© 2017 WTSP)"}