{"uri": "http://www.wsoctv.com/news/local/15-year-old-seriously-injured-in-east-charlotte-shooting/466884890#", "title": "15-year-old boy dies days after being shot in east Charlotte", "dct": "Wed, 16 Nov 2016 10:10:00 GMT", "id": "c4bede530c3a13deb6a3841a1b02b037", "content": "The shooting happened just feet away from John Pinckney's home.\n\"That would be heart wrenching to see something like that,\" said Pinckney. \"It's not something you ever want to hear happen, especially if you're a parent.\"\nAnother neighbor described to Channel 9 what he witnessed Sunday night.\n\"I was home, I was cleaning up in the garage and my son came in and was like, 'Dad, I heard gunshots,\" a neighbor said. \"Probably not even five minutes later the police were out, and I came outside to see what was going on, and I seen them put him in an ambulance.\"\nThe neighbor asked Channel 9 to conceal his identity, fearing whoever shot his neighbor could hurt his family.\n\"He's a good kid,\" he said of the 15-year-old, who was also a good friend of his son.\nHe told Channel 9 on Monday that Ellis was a student at Independence High School. Charlotte-Mecklenburg Schools said counselors are always on hand if a student needs it during tough times.\n\"[My son] is really tore up right now. I've been trying to console him about it because they were really good friends, used to play basketball out here, traded clothes, everything, like brothers,\" he said.\nNeighbor tells us the 15-yr-old boy goes to Independence High School @wsoctv pic.twitter.com/ZuQpKdOzDn\n— Elsa Gillis (@ElsaWSOC9) November 14, 2016\nThe neighbor said he's tired of hearing of young kids getting shot and wants to see something done about it.\n\"Maybe get some more activity centers around here, something where these kids are not in trouble all the time.\"\nOfficers are looking for witnesses and have not released a suspect description.\nAnyone with information about this incident is asked to call 704-432-TIPS.\nRead more top trending stories on wsoctv.com:\n© 2017 Cox Media Group."}