{"uri": "http://www.fox9.com/news/210623357-story", "title": "Baby, 20-year-old man killed in south Minneapolis shooting", "dct": "Sun, 09 Oct 2016 19:24:00 GMT", "id": "6f49dca77815ea7f1534973ab9ec121e", "content": "MINNEAPOLIS (KMSP) - A seven-month-old baby boy and a man were shot and killed near Stewart Park in the Phillips neighborhood of south Minneapolis Sunday afternoon.\nThe shooting took place at 26th Street and 11th Avenue S. at approximately 1:25 p.m. Both victims were in the backseat of a parked car when they were shot, according to Minneapolis police.\nMinneapolis police spokesperson Corey Schmidt says the shooting was a targeted attack.\nBaby, 20-year-old man killed in south Minneapolis shooting\n“This is a targeted incident so we don’t believe that any members of the public that are here in the park should be worried about another shooting occurring here,” Schmidt said.\nJulia Johnson, the older sister of the male victim, identified him as Gustav Christianson, 20. Police say Christianson was not the father of the child and his sister does not know the relation between the two.\n“All I know is he’s lying over there dead. That’s all I know. I don’t know why. I don’t know how,” Johnson said.\nJohnson said she had heard Christianson was with a female, who fled the scene. Christianson was not the father of the child, but police believe the boy was the son of the woman he was with.\nChristianson had previously been involved in a gang, according to his sister. He had also recently gotten out of jail and was in a treatment program, she told Fox 9.\nRecords show Christianson had served time at the St. Cloud Correctional Facility in March 2014 for second degree assault with a dangerous weapon. He was released this past June and has been a fugitive since July 29, according to the Minnesota Department of Corrections website.\nPolice are currently interviewing witnesses to determine who was involved in the shooting. No suspects are in custody."}