{"uri": "http://www.kare11.com/mb/news/crime/man-baby-dead-in-mpls-shooting/332313650", "title": "Baby, man fatally shot in Mpls. shooting", "dct": "NODATE", "id": "ba8e26ea7f9ccf0c5083d45f5a9fdc14", "content": "Heidi Wigdahl, KARE 11\nMINNEAPOLIS - Police say two people are dead, including a baby, after a shooting in the Phillips neighborhood of Minneapolis on Sunday afternoon.\nAccording to police, officers responded to a 911 call of shots fired near 26th Street East and 11th Avenue South around 1:30 p.m. Upon arrival, police found two gunshot victims in the backseat of a car. Police say a man died at the scene. The other victim, an 8-month-old boy, was rushed to Minneapolis Children's Hospital and died there.\nJulia Johnson identified her 20-year-old brother, Gustav Christianson, as one of the victims. She said Christianson lived in north Minneapolis and would have turned 21 next month. Johnson mentioned her little brother used to be involved with the Native Mob gang but was recently released from prison and was in a treatment program.\nAccording to records from the Minnesota Department of Corrections, Christianson was convicted of second-degree assault and sentenced in March 2014. He was released in June 2016. According to the DOC website, as of July 29 he was listed as a wanted fugitive.\n\"I just wish they would stop, put down the guns. Because, you know, like my mom always said, 'Somebody will walk out the door, you never know if they're going to walk back in.' It's hard because I lost my mom and my sister and now my brother,\" Johnson said.\nJohnson said she did not know the relationship between Christianson and the baby, but police said Christianson was not the infant's father.\nPolice believe Christianson was the intended target. They do not believe the public is in danger.\nOn Sunday night, Minneapolis mayor Betsy Hodges released the following statement on Facebook.\nSeveral people were taken in for questioning to try and determine their involvement in this case but as of Sunday afternoon, no arrests had been made. Officers from the Third Precinct will also go back to the neighborhood tomorrow to talk to residents about the shooting.\nAnyone with information should contact police. You can text your tip to 847411 (TIP411). Enter MPD, a space and then the information. All texts are anonymous. People may also call the MPD TIP Line at 612-692-TIPS (8477)."}