{"uri": "http://www.wmcactionnews5.com/story/34316728/teen-dead-another-injured-following-house-party-shooting", "title": "Teen dead, another injured following house party shooting", "dct": "Sun, 22 Jan 2017 16:01:00 GMT", "id": "71941dc0ad78f4c5c899a6cb39524b1e", "content": "MEMPHIS, TN (WMC) -\nA teen is dead and another is injured after shots were fired at a house party in the 4900 block of Blue Wing Street, according to Memphis Police Department.\nPolice said the shooting happened just after 10 p.m. Saturday.\nA 15-year-old and 16-year-old were taken to St. Francis Hospital. Friends identified the 15-year-old as Terrance Maxwell; he died from his injuries. The 16-year-old has not been identified; he is in critical but stable condition.\nInvestigators said the victims were at a house party when they were shot. Two girls were fighting in the middle of the street when a black vehicle drove up and people inside yelled gang phrases. The people inside the vehicle began shooting into the crowd, then drove away.\n“We heard the car screeching, going back the other way,” Billy Rodgers said.\nRodgers lives next door. He said the party had been going on for about two hours when it turned violent. He said a family lives at the house, but the party appeared to be all teens.\n“I heard the fight,” Rodgers said. “It was two girls out here fighting and it went from a fight to gunshots.”\nIn a cryptic Facebook post more than a week ago, Maxwell wrote about being shot and killed.\nNeighbor and parent Timothy White said he’s troubled by the violence and even more disturbed that it centers around teens.\n“That bullet could’ve went anywhere. Those bullets fly,” White said. “It’s sad that we’ve got our children out here killing, and it starts at home with the parents first.”\nNobody has been arrested for this shooting.\nIf you have any information that could lead to an arrest, call Crime Stoppers at 901-528-CASH.\nCopyright 2017 WMC Action News 5. All rights reserved."}