{"uri": "http://www.startribune.com/investigation-continues-into-deaths-of-greenwood-family/326692481/", "title": "Horrific details emerge in family murder-suicide in Lake Minnetonka home", "dct": "Sat, 12 Sep 2015 00:00:00 GMT", "id": "78c7e65a62f7411b6eafd1494901d42d", "content": "Night had fallen in the sprawling house on Channel Drive in the affluent west metro enclave of Greenwood, just a short walk from Lake Minnetonka.\nBrian Scott Short, the 45-year-old homeowner, grabbed a shotgun and headed to the bedrooms of his 17-year-old son, Cole, and his 15- and 14-year-old daughters, Madison and Brooklyn.\nHe walked into the first bedroom, aimed the gun at the sleeping child and pulled the trigger, sources with direct knowledge of the investigation told the Star Tribune on Friday.\nShort then did the same to his other two children.\nStartled by the noise, Short’s 48-year-old wife, Karen, grabbed a cellphone to call 911. But Brian tracked her down in another bedroom and shot her dead. She, like the children, was shot in the head.\nShort then went into the home’s attached garage and turned the shotgun on himself.\nSouth Lake Minnetonka interim Police Chief Mike Siitari confirmed Friday at a news conference that a shotgun was found in the house, though he would not say where.\nOn Saturday afternoon, investigators estimated that the deaths occurred late Monday night or early Tuesday morning and said they had not determined a motive in the killings. Earlier in the day, the Hennepin County Medical Examiner’s office released confirmation of the family members’ names and causes of death. Each died of a shotgun wound to the head.\nBrian Short’s fatal injury is described as “self-inflicted.” The medical examiner said the time of death was listed as 12:07 p.m. Thursday, which is when the bodies were discovered.\nSiitari again on Saturday asked for the public’s patience as police investigate what is being described as a complex and “gruesome” case. “There are many moving parts in an investigation of this magnitude,” he said.\nSiitari had said Friday that he’s trying to balance public requests for information with the progress of the investigation. “We will do our best to work through this tragedy.”\nThe bodies were found Thursday by officers carrying out a welfare check at the request of Short’s co-workers after he didn’t show at work for a couple of days. His children missed school Tuesday and Wednesday.\nAfter entering the home, the officers first found that the family’s small dog was unharmed. As they moved from room to room, body to body, the extent of the carnage became clear.\n‘A very tragic loss’\nThe house, built in 1998, was sold in September 2011 for $2 million to the Shorts, according to Hennepin County property records. The family moved to the 5,600-square-foot mansion, with an eight-car garage and a panoramic view of St. Albans Bay, from a 4,200-square-foot house in Lakeville.\nBrian Short, a nurse, founded the website AllNurses.com, which provides information and resources for and about the nursing profession.\nThe AllNurses.com website posted a message about the family’s death that read in part: “No matter what the details are, the results are still the same … a very tragic loss for the extended families, friends, co-workers and this nursing community.” The company also wrote that it would continue Brian Short’s legacy of serving the nursing community despite the loss of a “stellar leader.” By Friday, several hundred people had left condolences on the website.\nSeveral relatives of the Shorts, still in shock, declined to comment Friday.\nNews of the deaths hit hard at Minnetonka High School, where Cole, Madison and Brooklyn went to school. Classmates and teachers mourned the teens’ deaths, friends wore orange shirts to honor them, and grief counselors were on hand all day.\nThe tree-lined street where the family lived was quiet, with a memorial made up of flowers, a teddy bear and other mementos growing outside the Shorts’ house.\nGreenwood, a community of about 700, is next to Excelsior, where Short had his business headquarters in a historic building.\nThe South Lake Minnetonka Police Department, which patrols four small cities, has only 14 full-time officers and last responded to a homicide in 2013, in Shorewood. The officers who responded to the scene were still shaken up, Siitari said, and the investigation is taxing the resources of the small department, which is being assisted by the Hennepin County Sheriff’s Office.\nWhat little he has been able to share with the public, Siitari said, is meant to inform and reassure the community that there are no known ongoing threats.\nPublic records show no bankruptcies or state tax liens against Brian Short or his company.\nHe was facing a federal lawsuit from a New Jersey-based company, although it is unclear whether it posed much of a legal or financial threat to his business. In the lawsuit, Achieve Test Prep alleged that AllNurses.com failed to delete anonymous defamatory comments from its website and was sending business to a competitor.\nThe suit was filed in New Jersey, but on Aug. 28, the judge ordered that the case be moved to Minnesota.\nA couple of 17-year-old Cole’s friends told the Star Tribune this week that Cole had told them the family was planning to sell the house soon because it was too big for them.\nAbout three months ago, the family abruptly ended weekly cleaning services with Polina’s Cleaning Services. The family had paid for the service for about seven months.\n“It was really strange; out of nowhere they said they were stopping,” said company representative Roman Peysakhovich. When he asked Karen Short why, she gave no reason, he said.\n“They seemed like a great family,” he said. “Everything was perfect.”\ndavid.chanen@startribune.com 612-673-4465 kelly.smith@startribune.com 612-673-4141"}