{"uri": "http://www.recordnet.com/article/20160611/NEWS/160619932", "title": "One killed, dozens of shots fired in Oak Park", "dct": "NODATE", "id": "47466d1affa39431601f23ffe5a6aa02", "content": "Hide caption Police begin investigating Saturday's shooting in Oak Park, where one man was killed and at least three other people were wounded when gunfire erupted near Oak Park Ice Arena. JASON ANDERSON/THE RECORD\nSTOCKTON - One person was killed, at least three others were wounded and countless lives were endangered when gunfire erupted Saturday night at Oak Park in central Stockton.\nThe shooting occurred about 8:15 p.m. on the north side of the park just west of Alvarado Avenue. Witnesses said 60 to 80 shots were fired when two groups of people exchanged gunfire.\nWhen the shooting stopped, one man lay dead between two vehicles parked next to the Oak Park Ice Arena. A friend of the victim's family said he was a 30-year-old Cambodian man who was attending one of several parties that were being held at the park.\nA second male victim was taken away by ambulance. There was no immediate word on his condition.\nThere were unconfirmed reports that a number of other gunshot victims were located in a sport utility vehicle that was stopped by police as it fled the scene.\nShow more...\nWitnesses said the shooting started with two short bursts of gunfire followed by a rapid and sustained exchange of gunfire. Some of the shooters continued to fire as they fled south through the park on foot.\nRandy Sadberry, 60, said he saw one of the gunmen fire eight to 12 rounds into a white vehicle from a distance of three to four feet. One of the groups then fled toward the bathrooms at the center of the park.\n\"There were several parties out here, like baby's birthday parties,\" Sadberry said. \"It was extremely dangerous. Everybody was getting down on the ground. This is insane.\"\nDavid Aceves and about 30 other friends and family members were holding a party on the north side of the park to celebrate his nephew's baptism.\n\"It sounded like nonstop shooting for at least three minutes,\" he said, estimating that there were more than 100 people in the park at the time. \"I'm on that side of the park and I'm hearing shots ricochet off the walls. I could hear bullets zooming by.\"\nAs darkness set in, police were finding shell casings throughout the park. At one point, two officers drew their weapons and entered the bathrooms in search of suspects.\nAnyone with information about the case is asked to call the Stockton Police Department at (209) 937-8377, the Investigations Unit at (209) 937-8323 or Crime Stoppers at (209) 946-0600. Crime Stoppers pays cash rewards up to $10,000. Callers can remain anonymous.\nCellphone users can text information to 274637 (CRIMES) by entering the keyword \"TIPSPD\" followed by their tip. Internet users can visit the Police Department's Facebook page and click \"Submit a Tip.\"\n- Contact reporter Jason Anderson at (209) 546-8279 or janderson@recordnet.com. Follow him at recordnet.com/crimeblog and on Twitter @Stockton911."}