{"uri": "http://dfw.cbslocal.com/2017/01/04/facebook-argument-leads-to-shooting-in-allen/", "title": "Facebook Argument Leads To Shooting In Allen", "dct": "Wed, 04 Jan 2017 05:42:00 GMT", "id": "3b96e05c40b450e338f0f59c570ca75c", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nFollow CBSDFW.COM: Facebook | Twitter\nALLEN (CBSDFW.COM) – Police in Allen are investigating a shooting that started with an argument on social media. Four people were injured, but a total of 16 people were involved in the incident. The call for help came in late Tuesday, just before midnight, from a home located in the 500 block of Hawthorne Drive.\nThe situation began with a post on Facebook about an incident that took place a few days ago in Dallas, but details about that post and that incident have not been discussed by officials.\nAfter the online post, a group of nine people from Dallas drove to the Allen home to confront seven people there. The situation escalated when the people inside of the home walked out with various weapons, including knives and what is believed to be an airsoft rifle.\nThat display of weapons triggered gunfire from the Dallas group. Four people from the Allen home were injured, with three of the victims going to a local hospital in Allen and the other victim being taken to a hospital in Plano for treatment. According to authorities, all four of the victims are expected to survive.\nA neighbor recalled hearing between eight and 10 shots. “First, I thought the neighbors were arguing, or maybe they got into it because, I don’t know, they always had seemed to have issues over there,” stated James Ramsey. “Anything can happen when shots are fired. You can ricochet or go somewhere else.”\n“It was like something you would see on ‘The First 48.’ It was so scary,” said witness Lisa Coleman, who recorded the shouting before bullets sent her looking for cover. “I heard this one guy saying, ‘You want some of this? You want some of this? I can get you too.’ And that’s when you heard about eight rounds of gunshots.”\nThe nine people from Dallas have all been detained by police, and one of them has since been arrested. He has been identified as Devonte Wade. The 20-year-old man is charged with aggravated assault with a deadly weapon. More arrests are expected to be made.\nOfficials have not released the names of anyone else involved in this incident, only saying that they were both men and women who are all most likely under 30 years old — some of them teenagers.\nColeman actually knows one of the teenagers, a senior in high school. “When they were putting her in the ambulance, I kind of waved at her and said it’s going to be okay,” she said. “I was crying. She was crying, screaming from pain.”\nNeighbors said that this rental home is a magnet for trouble. Coleman estimated that more than a dozen calls have been made to police about something happening at this property within the last five years.\n“The good news is — if there’s any good news — is that the people responsible for it are being detained or in custody,” said Sgt. John Felty with the Allen Police Department."}