{"uri": "http://www.al.com/news/birmingham/index.ssf/2016/08/10-year-old_boy_dead_after_sho.html", "title": "'He was my baby': 10-year-old boy dead after shooting inside Homewood apartment", "dct": "Mon, 01 Aug 2016 18:50:00 GMT", "id": "50fb39b365a457ff689eebd4df89fccf", "content": "A 10-year-old boy died early this morning after av shooting by another juvenile in Homewood.\nThe Jefferson County Coroner's Office identified the victim as Jordan Gray.\nThe shooting happened about 11:15 p.m. at Elevation apartments on Lakeshore Drive. The boy was taken to Children's of Alabama, where he was later pronounced dead.\nHomewood police this afternoon said the 16-year-old cousin - Cenius Williams III - has been charged with reckless manslaughter and is being adjudicated as an adult. He is being booked into the Jefferson County Jail with bond set at $15,000.\nWilliams was arrested June 28 on two counts of first-degree robbery, accused of robbing two women at knife-point 10 days earlier, court records show. He was currently out on $80,000 bond for those cases, and prosecutors today filed a motion to revoke that bond because of the new reckless manslaughter charge.\nSources tell AL.com the teen shooter told police he found the gun in a bag at the apartment pool and hid it for a couple of weeks. He was playing with the gun when the 10-year-old boy walked in the room and was shot in the head.\nThe teen initially said his young cousin was shot by someone from outside the window, sources said, but Sgt. Keith Peterson said he couldn't confirm or deny that account.\nThe 16-year-old is in custody.\nJordan's family and friends gathered this morning at his eastern Birmingham home, in shock over the boy's death.Jordan was spending the summer with his father at the Homewood apartment complex where he was shot.\n\"He was my baby,'' said his grief-stricken grandmother, Faith Jordan. \"He was a good little boy.\"\n\"All we know is his cousin had a gun and he was playing with the gun and Jordan got shot in the head,'' she said.\nJordan's mother, Aladrienne Jordan, lost her boyfriend last year to a fatal shooting in Fairfield.\nJordan was about to enter the fifth grade at Huffman Academy. \"He was a really nice young man. We were looking forward to seeing him this school year,'' said Huffman Academy Principal Dr. Kathleen Lindsey. \"We know his classmates and the staff are devastated by this event. We are praying for his family.''\nHe loved playing basketball at the YMCA, and also loved playing video games, especially basketball video games. \"He was quiet,'' his grandmother said. \"He was silly. He was just a little boy.\"\nTaleshia Cook lives next door to the Jordan's family and said two of her four sons played with Jordan all of the time. \"This really hits home,'' Cook said. \"It's real scary. He was so mannerable, and always answered with 'yes ma'am.'''\nCook's 10-year-old son, one of Jordan's close friends, asked his mother this morning if Jordan would come back when the world ends. \"I don't think they too much understand, but they know he's not coming back,'' Cook said. \"I told them we'll all meet again.\"\nUpdated at 4:30 p.m. with the arrest of Jordan's cousin."}