{"uri": "http://www.myarklamiss.com/crime/update-3-new-arrests-brings-total-to-8-in-madison-parish-club-shooting", "title": "UPDATE: 3 New Arrests Brings Total to 8 in Madison Parish Club Shooting", "dct": "Sat, 28 Jan 2017 17:07:48 GMT", "id": "dffe1bfaa110bdc19113539b5f35047c", "content": "Madison Parish Sheriff Larry Cox confirmed to KTVE/KARD three new arrests have been made in a Madison Parish club shooting that happened more than two weeks ago.\nThat shooting occurred in the early morning hours of Sunday, January 12 at the 103 Klub on the Madison/Richland Parish line.\nSix people were injured in that shooting, all of which have been released from local hospitals.\nSince that time, five men were arrested and remain behind bars held without bond.\nNow, Cox said three more men have been arrested in the last several days.\n22-year-old Marcus Oliver of Tallulah, brother to already arrested suspects Mario and Jeremy Oliver, was arrested on Monday.\nHe is charged with 5 counts of Attempted Second Degree Murder, 1 count of Possession of a Firearm by a Convicted Felon, 1 count of Possession of a Firearm on the Premises of an Alcoholic Beverage Outlet and 3 counts of Aggravated Criminal Damage to Property.\nThen, 31-year-old Robert Holloway of Tallulah, brother to already arrested suspect Henry Holloway, was arrested on Tuesday.\nHe is charged with 5 counts of Attempted Second Degree Murder, 1 count of Possession of a Firearm on the Premises of an Alcoholic Beverage Outlet and 3 counts of Aggravated Criminal Damage to Property.\nFinally, 20-year-old Ronnie Hendrix of Tallulah was arrested Wednesday.\nHe is charged with 5 counts of Attempted Second Degree Murder, 1 count of Possession of a Firearm on the Premises of an Alcoholic Beverage Outlet and 3 counts of Aggravated Criminal Damage to Property.\nThese three new arrests bring the total of arrested suspects to eight. All are currently behind bars held without bond.\nCox said the investigation still continues from here. While Cox said the shooting was not gang-related, the shooting was between two different groups of people.\nKeep it tuned to KTVE/KARD as we continue to bring you all the latest developments.\n------------------------------------------------------------------------------------------------------\nUPDATE:\nA fifth arrest was made around 5:45 p.m. in connection to the Madison Parish shooting.\nLamar Miller, 26, was arrested Tuesday evening.Two more arrests were made late Monday night. The Madison Parish Sheriff's Office arrested 32-year old Mario Oliver and 25-year old Jeremy Oliver.\nAll three men are from Tallulah.\nLike the other suspects, the three men are facing five counts of Attempted 2nd Degree Murder, one count of Possession of a Firearm by a Convicted Felon and three counts Aggravated Criminal Damage to Property.\nThe Madison Parish Sheriff's Office is expecting more arrests.\n--------------------------------------\nJan. 13\nMajor Neal Horath with the Madison Parish Sheriff's Office has confirmed to KTVE/KARD two arrests have been made in the Sunday morning bar shootings at the 103 Klub, formerly the 80/20 Club.\nThat shooting injured six people. Four of them have now been released from local hospitals.\n\"Yesterday, we started interviews and it led to where we had arrrested Henry Holloway. He was arrested for five counts of Attempted Second Degree Murder. Also arrested was DonDeeThomas. He was arrested today around lunch for the same charge,\" Horath said.\nHorath said they arrested 22-year-old Henry Holloway Sunday afternoon and 34-year-old DonDee Thomas Monday at noon.\nHorath said both were shooters that morning and deputies still have warrants out for several other suspects at this time.\nHolloway and Thomas were both charged with five counts of Attempted 2nd Degree Murder, one count of Possession of a Firearm by a Convicted Felon and three counts Aggravated Criminal Damage to Property.\nHorath said each of the attempted murder charges carries a punishment of up to 50 years in prison.\nDeputies said Holloway and Thomas were both in one group and the shooting was an altercation between two different groups that started outside the club and then went inside.\nHorath said they will continue searching for the remaining suspects and interviewing witnesses.\n\"We're looking for the other suspects in this crime, plus we're taking statements from witnesses and people that are coming forth with more information,\" he said.\nWhile six people recover from their wounds, authorities said they're thankful that violent night wasn't any worse.\n\"Four of the six were released and lucky there wasn't more,\" said Horath.\nRight now, deputies said they want to get the suspects that were in the other group in the fight to get their side of the story.\nDeputies are not releasing the names of the people they're actively search for at this moment.\nTwo of the gunshot victims remain hospitalized and their condition is unknown at this time.\n----------------------------------------------\nMADISON PARISH -- The Madison Parish Sheriff's Office is investigating a shooting at a club this weekend that left six people wounded.\nThe sheriff's office said it happened around 3 a.m. early Sunday morning at the 80/20 club located on the 3600 block of Highway 80 W. at the Madison/Richland Parish line.\nDeputies said six people were wounded in the shooting. They were taken to hospitals in Delhi and Madison Parish.\nDeputies said four of the victims have been treated and released, while two victims remain hospitalized. Their condition is unknown at this time.\nThe Madison Parish Sheriff's Office said the investigation continues, as they expect multiple arrests."}