{"uri": "http://www.fresnobee.com/news/local/crime/article88284427.html", "title": "3-year-old who fatally shot herself in Lemoore is identified", "dct": "Thu, 07 Jul 2016 14:57:00 GMT", "id": "ec52076d88e613fc13230a9276284585", "content": "The 3-year-old girl who fatally shot herself in Lemoore has been identified as Ava Chadderdon of San Diego, the Kings County Coroner’s Office said Thursday.\nThe girl, who was almost 4, found a loaded gun in an apartment bedroom as her family was visiting from Southern California, Lemoore police said.\nThe tragic incident happened July 2 in the 800 block of Dogwood Avenue.\nAt 12:49 p.m. July 2, police received an emergency call that a 3-year-old had suffered a head injury.\nPolice and medical personnel found the child lying on the floor of the apartment with a head wound. A loaded handgun was found near the body. Police would not provide details about the gun’s caliber.\nThe girl had a single gunshot wound to the skull, police said.\nDetective Matthew Smith said the child was unattended in a bedroom when her mother, sibling and the mother’s friend heard a bang.\nThey did not immediately recognize the sound as gunfire and at first believed the child had fallen from the bed, Smith said. When police arrived, they were trying to help the child, he said.\nplace_quote1\nThe girl was taken to Adventist Medical Center in Hanford, where she was pronounced dead.\n“It’s just an unfortunate accident,” Smith said. “It’s hard on everyone. Our hearts go out to the family involved.”\nThe family and others are cooperating with the investigation, police said.\nThe apartment is occupied by two roommates. Both were away at the time, Smith said.\nInvestigators learned that the gun is registered to a friend of one of the roommates, Smith said.\nThe case is being investigated as reckless endangerment of a child resulting in death and negligent storage of a firearm. No arrests have been made, but the gun owner and the roommate could face charges, he said.\nThe case will be turned over to the Kings County District Attorney’s Office this week for review and any filing of charges.\nLewis Griswold: 559-441-6104, @fb_LewGriswold"}