{"uri": "http://www.argusleader.com/story/news/crime/2014/12/19/domestic-violence-behind-shooting-five-sisseton/20659351/", "title": "Domestic violence behind shooting of five in Sisseton", "dct": "Fri, 19 Dec 2014 00:00:00 GMT", "id": "21184d919a0878d6704eea5178f91b06", "content": "Domestic violence was the driving force behind the shooting deaths of four people last month in Sisseton, according to Attorney General Marty Jackley.\nColter Arbach, 22, used two guns to kill Vernon Renville Jr., Angela Adams, Candice Labelle and himself on Nov. 22 at a home in Sisseton, Jackley said at a press conference Friday in Sisseton.\nArbach also injured Karissa Dog Eagle in the attack, shooting her several times.\nJackley said Dog Eagle and Arbach were involved in a relationship, and that Dog Eagle had ended the relationship on the morning of Nov. 22.\nArbach had punched her three times that night inside a house on Fourth Avenue.\nDog Eagle and Adams planned to contact family members after the altercation, Jackley said.\n\"They were going to call a mother. When Karissa told that to Colter, he grabbed the .223 and began shooting in a very rapid fashion,\" Jackley said.\nArbach used a .223 rifle and a 12-gauge shotgun to fire on Renville Jr., whose body was found next to the driver's side door of a Kia vehicle. The bodies of Labelle and Adams were found on the other side of the vehicle. Both passenger side doors of the Kia were open.\n\"Karissa was shot several times in the back,\" Jackley said.\nArbach's body was found outside the home, as well. A total of 18 spent shell casings from the .223 and three shotgun shells were found outside the home. Arbach's blood alcohol content was .123, over the legal limit to drive, but no other drugs were found in his system.\nAutopsies confirmed that all the victims had died of gunshot wounds.\nState investigators worked alongside law enforcement from the Sisseton-Wahpeton Sioux Tribe to piece together the events surrounding the shooting, Jackley said.\nTribal Secretary Robin Quinn thanked police for their help and thanked state and national supporters for their help during what she called a trying time for the community.\n\"I'm asking that our community stay in your prayers and we work to heal,\" Quinn said.\nA fund has been established for the victims' families at gofundme.com/hrg674.\n\"I would encourage South Dakotans to contribute to that,\" Jackley said."}