{"uri": "http://www.ksfy.com/home/headlines/Sisseton-police-searching-for-suspect-in-quadruple-homicide-283579911.html", "title": "Families release victim's names in Sisseton shooting", "dct": "Sat, 22 Nov 2014 07:21:00 GMT", "id": "b07a6dea018bc40da8c66ef026703bc1", "content": "Update:\nFamilies contacted KSFY News with names of the victims from Saturday morning's fatal shooting.\nThey names are Angela Adams, Vernon Renville Jr., and Candace LaBelle of Sisseton.\n\"Anybody that needed him, he was there. He was a big man, big shoulders and big arms to take care of the people. He's going to be truly missed, especially by me,\" said Renville's father, Vernon Renville Sr.\nThe other families said they are grateful for everyone's prayers and support during this time of horrific loss. They also thanked the entire Sisseton Wahpeton Oyate for their continued prayers.\nThe families are holding a candle-light vigil for everyone in the Sisseton Community, Saturday at 8 PM, in front of St. Catherine's Hall.\nKSFY News will continue to keep an eye on the condition of the fourth shooting victim, who is still in critical condition.\nEarlier Story:\nThe suspect in a fatal shooting in Sisseton Saturday morning was found dead in the home.\nThe Division of Criminal Investigation says it's identified Colter Richard Arbach, 22, Sisseton, as one of the deceased individuals at the scene of the shooting incident that occurred at a Sisseton home early Saturday morning.\nThe DCI says a preliminary investigation shows Arbach was the shooter and took his own life. Investigators are still trying to locate other people who may have\nbeen at the scene at the time of the shooting and may have been a witness to what happene.d\nLaw Enforcement does not feel that the public is in danger at this time, but the investigation is ongoing.\nAgencies assisting in this investigation are the Sisseton Police Department, Sisseton-Wahpeton Sioux Tribal Police, Roberts County Sheriff’s Office, South Dakota\nHighway Patrol, South Dakota Game, Fish and Parks and the Division of Criminal Investigation.\nEarlier Story:\nState and local law enforcement in South Dakota are searching for Colter Richard Arbach, 22, the suspect in a quadruple homicide that happened early Saturday morning.\nArbach is from Sisseton and police warn that he is armed and dangerous. If you see him, call police immediately, but do not try to stop him.\nHe's suspected of shooting 5 people at a home in Sisseton; four people are dead and one is critically injured. Police aren't releasing the names of the victims at this time.\nArbach is around 6' and weighs 200 pounds. If you see him or know of his whereabouts, call the Sisseton Police Department at 605-698-7667."}