{"uri": "http://www.kxii.com/home/headlines/Classmates-open-up-about-teen-killed-in-accidental-shooting-372039922.html", "title": "Classmates open up about teen killed in accidental shooting", "dct": "Mon, 14 Mar 2016 19:17:00 GMT", "id": "4987190917d574d942929efab023a182", "content": "PARIS, Texas -- A Paris High School senior is dead after police say she accidentally shot herself in the chest this past weekend (March 12).\n\"It's not a person that she didn't like,\" said Raven's longtime friend, Zarreia Jones.\nJust as spring break begins for students at Paris High School, this week, news of a classmate's fatal accident spread quickly.\n\"This is the hardest thing that I've ever had to do, like I try to keep my tears back and everything, and just be positive, but sometimes, you just have to cry,\" Jones said.\nFriends say Raven Dowd, who was a cheerleader at PHS, was outgoing and always had an upbeat personality, whether she was cheering on the Paris Wildcats or just cheering up a friend.\nHer life ended abruptly Saturday at Ridgeview Town Homes after police say she accidentally shot herself in the chest with a pistol while waiting for her boyfriend to get ready for work.\n\"She was visiting her boyfriend at another friend's apartment, and during the time there, she came in possession of a pistol at the residence and while she had it in her possession, it discharged, striking her in her chest,\" said Randy Tuttle with the Paris Police Department.\nFriends say she never had any trouble making a new friend -- but they say losing a friend like Raven, will be hard to deal with.\n\"Sixth grade is when all of the cliques start getting together,\" said Ty Gray, who was friends with Raven since 6th grade. \"She knew everybody. Everybody liked her. She was a beautiful girl, she was just the nicest person.\"\nPolice say they are working to identify who owned the gun while they wait for preliminary autopsy results.\nFriends are holding a candlelight vigil for the senior at 8 p.m. Thursday in front of Paris High School."}