{"uri": "http://www.news4jax.com/news/florida/putnam-county/police-teen-critical-after-apparent-accidental-shooting", "title": "Family: Teen dies after apparent accidental shooting", "dct": "Mon, 29 Feb 2016 21:16:00 GMT", "id": "cc49619b1be555b74d35b707976050fa", "content": "PALATKA, Fla. - A 17-year-old boy who police said apparently accidentally shot himself in the head with a handgun has died, his family told News4Jax.\nPolice said the boy, 17-year-old Cleveland Fulton, was on life support Tuesday, but his family told News4Jax that he died.\nThe Palatka Police Department said the shooting happened about 5 p.m. Monday on Benham Street in Palatka.\nAccording to police, other teens were there and they were interviewing witnesses to find out exactly what happened.\nFulton, a junior at Palatka High School, was praised Tuesday by his guidance counselor and history teacher.\n“It felt empty (without him today). He was missed,” teacher Kristin Beaudua said.\nGrief counselors were at the high school Tuesday, holding group counseling sessions for students on campus.\n“It’s awful, because you see what they could be. He doesn’t reach his full potential, and he had so much of it,” Beaudua said.\nGuidance counselor Marlene Ogle said Fulton was interested in boxing, was a good student and was bringing his grades up.\n“He was very fun-loving, smiled, very respectful,” Ogle said. “Just a really great kid.”\nFulton's stepmother, who lives in Tampa, said they called him Cleve.\n“I was hurt. He’s my son, even though he’s not my real child. I’ve had him since he was 2 years old,” Doria Fulton said.\nCleveland moved to Palatka last summer to be with his mother. His father and stepmother said they are devastated and wish he hadn't moved away.\n“He just liked to play around and joke with his friends, just have fun,” Doria Fulton said. “We all loved him. He was a sweet child, always my sweet boy.”\nPolice said Cleveland and several other friends got together after school at a friend’s house.\nSomehow, the teens got hold of a handgun and Cleveland either accidentally or intentionally shot himself in the head.\nThe other teens called police, and Cleveland was taken to the Putnam Community Medical Center and then flown to Shands Hospital in Gainesville in critical condition.\nThe Palatka Police Department is still investigating the incident.\nPolice said they aren’t sure who the gun belongs to, but at this point, they said nothing about the case looks criminal.\nCopyright 2016 by WJXT News4Jax - All rights reserved."}