{"uri": "http://www.grandforksherald.com/content/shooter-identified-among-four-dead-sisseton-sd-shooting", "title": "Four die in murder-suicide in Sisseton, S.D., shooting", "dct": "Sat, 22 Nov 2014 20:53:00 GMT", "id": "8293e9b1fd5fa6f6fa530dacc58ac42e", "content": "SISSETON, S.D. – This small city reeled Saturday from reports by authorities that a local 22-year-old man killed three people and critically injured another in a shooting before taking his own life.\nThe South Dakota Division of Criminal Investigation suspects that Colter Richard Arbach, whose body was found along with three others at a residence in the midst of town here Saturday morning, shot the others and committed suicide, according to a news release from the South Dakota Attorney General’s Office.\nSisseton, with a population of 2,450 people, is about 90 miles south of Fargo on Interstate 29 in far northeastern South Dakota, and is on the Lake Traverse Indian Reservation.\nThe victims’ names were not released. The condition of the person who was critically injured was not known.\nA crowd of singing mourners filled the street east of the residence, in the 300 block of Cherry Street East, as officers from the Sisseton Police Department and Roberts County Sheriff’s Department carried bodies into a van. To the west of the residence, two women cried behind the police tape.\n“It’s a damn shame,” said William Ryan, 51, as he took a break from sawing wood a block away from where the shooting took place. “One of them was a classmate of my son’s.”\nRyan, who lives nearby in Browns Valley, Minn., said the last similar shooting incident he could recall was perhaps 20 years ago.\n“Fortunately, it doesn’t happen very often,” he said. “It should never happen.”\nA burst of gunshots woke up Dan Shinerock early Saturday morning, the 51-year-old said as he stood in front of his home, just a few steps away from the police tape blocking Cherry Street East, where investigators worked throughout the day.\n“I got woke up to boom, boom, boom, boom,” Shinerock said. When he ran outside after calling 911, he saw a body hanging out of a car outside the residence where the shooting happened, he said.\n“It’s a depressing place to live,” he said of his city. “You’re trapped in your house all winter long, and it has a high suicide rate.”\nDespite the shooting, Shinerock still feels safe in his neighborhood.\n“I think it was an isolated incident,” he said.\nDetails about the shooting remained sparse Saturday. Sisseton Police and the Roberts County Sheriff’s Office declined to comment and referred questions to the DCI.\nDCI spokeswoman Sara Rabern said the DCI responded to the scene at about 3 a.m. Saturday morning. She declined to say if the deceased were related.\nThe state’s Attorney General’s Office had asked early Saturday for the public’s help locating Arbach, who was described as armed and dangerous. It later said Arbach was among the dead found at the scene and the public was not in danger.\n“We didn’t know where he was” at first, Rabern said. Once authorities analyzed the crime scene, they were able to determine that Arbach was one of the dead, she said.\nInvestigators are continuing to locate other individuals who may have been at the scene at the time of the shooting for their involvement or their eyewitness account.\nThe investigation is ongoing. Agencies assisting include the Sisseton Police Department, Sisseton-Wahpeton Sioux Tribal Police, Roberts County Sheriff’s Office, South Dakota Highway Patrol, South Dakota Game, Fish and Parks and the DCI.\nCurtis Bird and Annie Durkin were taking a walk up Third Avenue East when they stopped to reflect on the shooting.\nBird, 14, described it as “kind of a shock.”\n“Because it’s such a small town,” Durkin, 13, explained.\nBut neither teenager appeared fazed by what happened just a block away.\n“I’m alright,” Bird said with confidence. “I know how to take care of myself.”\nA group of people who answered the door at a house listed for Arbach declined to comment for this story."}