{"uri": "http://newyork.cbslocal.com/2015/06/04/wyandanch-shooting/", "title": "3 People Found Shot To Death Inside Car On Long Island; Gunman At Large", "dct": "Thu, 04 Jun 2015 10:09:00 GMT", "id": "07773b1d9b424309681b70fb0dc4db25", "content": "WYANDANCH, N.Y. (CBSNewYork/AP) — Three people were found shot to death and a fourth person was injured sitting inside a car on Long Island, and police said Thursday that the suspect was still on the loose.\nThe shooting happened shortly before midnight Wednesday on Davidson Street in Wyandanch.\nThe suspect walked up to the SUV and opened fire, fatally striking the male driver and two female passengers, Detective Lt. Kevin Beyrer said.\n“They were sitting in the car just talking,” Beyrer said. “A gunman came upon the vehicle, opened fire into the car. The gunman fled in an unknown direction.”\nKilled were 25-year-old William Madrey of Wyandanch, 23-year-old Stephanie Almedina Rivera of Bay Shore and 23-year-old Ciara Smith of Deer Park, police said.\nA third female passenger, whose identity is being withheld, was hospitalized and expected to live, police said.\nEarly Thursday morning, multiple police vehicles lined the roadway and workers from the medical examiner’s office were on scene.\nShortly before 9 a.m., the SUV was towed away, with bullet holes marking the front passenger door and rear driver’s side window. Officers scoured the area with metal detectors and a K-9 unit looking for evidence.\nNeighbor Shafonski Burnette said she came to the scene after hearing rumblings that one of the victims was her friend’s daughter.\n“It’s heartbreaking,” the 53-year-old said as she stood at the yellow crime scene tape that cordoned off the block. “I’ve lived here a long time. I’m friends with her mother. They live right around the block.”\nBrunette said the shooting brought back bad memories. Her 14-year-old niece had been killed in a drive-by shooting on the same block a few years ago.\n“Now they’re shooting,” she said. “I can’t deal with it.”\nOther neighbors said they regularly hear gunshots and said gang violence and drug activity are common. They said police need to do more.\n“It’s highly unfortunate, but we live in a rough neighborhood and that’s how it is,” one resident told 1010 WINS’ Mona Rivera.\nPolice said Madrey is a previously self-admitted gang member and investigators are looking into whether gang affiliation played a role in the shooting.\nAnyone with information about the shooting is asked to call Suffolk County Crime Stoppers at 800-220-TIPS.\n(TM and © Copyright 2015 CBS Radio Inc. and its relevant subsidiaries. CBS RADIO and EYE Logo TM and Copyright 2015 CBS Broadcasting Inc. Used under license. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report.)"}