{"uri": "http://7online.com/news/3-dead-after-shooting-on-long-island/765774/", "title": "3 dead, 1 hurt after shooting on Long Island", "dct": "Thu, 04 Jun 2015 00:00:00 GMT", "id": "eaae766db7e8621dc32018e59622572e", "content": "WYANDANCH, N.Y. (WABC) --\nPolice are searching for a gunman after four people were shot, three fatally, inside an SUV in Wyandanch late Wednesday.\nThe victims were sitting in the Chevrolet TrailBlazer, parked on Davidson Street, when they were shot at around 11:50 p.m., according to Suffolk County Police.\nTwo women and a man were pronounced dead on the scene. The fourth victim, a woman, was taken to Good Samaritan Hospital in West Islip, where she is in stable condition with a non-life threatening injury.\nThe three deceased victims have been identified by Suffolk County Police as 25-year-old William Madrey, of Wyandanch; 23-year-old Stephanie Almedina Rivera, of Bay Shore; and 23-year-old Ciara Smith, of Deer Park. The identity of the surviving fourth victim is being withheld at this time.\nEyewitness News was there when Madrey's girlfriend showed up to lay flowers at the scene, her crying uncontrollable.\nWe're told she's four months pregnant.\nPolice say they're looking into whether Madrey's past may have contributed to the shooting.\n\"This is a very active investigation,\" said Suffolk County Police Lt. Kevin Beyrer. \"We are investigating whether gang involvement played a role in the shooting. William Madrey is a previously self-admitted gang member.\"\nBut that still doesn't explain who shot him and the three other women who were just sitting talking in the SUV late Wednesday night.\nInvestigators removed the Chevy Trailblazer from the scene on Davidson Street earlier Thursday.\nA bullet hole was still visible in the passenger door.\nJasmine Rivera wants answers, after her cousin Stephanie was among those killed.\n\"She was a very nice person,\" said Jasmine. \"She cared about her family a lot, about getting her life on track. That's what she was doing. Somebody took her from us and we need to figure out who that was.\"\nShe said she had no idea who her cousin was hanging out with. \"I don't know what happened,\" she said. \"I just got the phone call this morning. I don't know what happened.\"\nPolice say they're looking for a male shooter who fled on foot.\nPeople who live in the area say gangs are absolutely a problem.\n\"We have people in this neighborhood who are afraid to go out of their house after dark. We have people who won't even go shopping,\" said Virginia Dawson-Taylor of Wyandanch Community Watch.\nDetectives are working on a motive.\n\"The investigation reveals a gunman came upon the vehicle and opened fire,\" Beyrer said. \"The male and two females were dead on arrival. The surviving victim was taken to an area hospital.\"\nHe said the investigation is still \"wide open.\"\nAnyone with information is asked to call (631) 852-6392."}