{"uri": "http://www.wbrz.com/news/family-says-teenage-girl-is-brain-dead-after-being-shot-in-the-head-thursday", "title": "Family says teenage girl is brain dead after being shot in the head Thursday", "dct": "Fri, 19 Feb 2016 17:44:00 GMT", "id": "1e1206c7db3457660d7a7d64323f15bc", "content": "BATON ROUGE - Family members of the 16-year-old shot Thursday told WBRZ anchor Chris Nakamoto the teenager is brain dead.\nThe family identified the girl as Darneisha Williams, a Broadmoor High School student.\n\"I can't do nothing but pray,\" relative Dimitrius Calhoun said.\nGrief counselors were on hand today at the school to deal with the tragedy. WBRZ has learned she was shot by a 16-year-old, who also is a student at Broadmoor High School.\n\"It's been quiet,\" Gwynn Shamlin, I-Care Executive Director said. \"The kids have been waiting to hear more information. We'll be here until we're needed.\"\nWilliams was shot in the head on Brady Street by a 16-year-old male family member. The unidentified boy was charged with negligent injuring and illegal possession of a firearm by a juvenile.\nFamily members feel a little disenfranchised that a similar case has resulted in no charges yet. They're referring to Addis Police Officer Trey Thibodaux. Investigators say he shot his wife Emiley to death while cleaning out his gun. In that case, the investigation continues and Thibodaux has not been charged.\n\"If they let him go free, why they couldn't let him go free,\" Dimitrius Calhoun, a relative of Williams said. \"It's just the way. It's money and where you live at and who you know and stuff.\"\nCriminal Justice Instructor Paul Guidry couldn't agree more with this family.\n\"I just don't see what's taking State Police so long to bring charges against this individual,\" Guidry said. \"When we have two 16-year-olds playing around with a handgun, gun goes off and someone gets severely injured and they are immediately charged. Why would police have extra preference when it comes to being accountable?\"\nBoth cases were classified as accidental shootings. But tonight, many people are concerned that laws only apply to certain subsets of people.\n\"That police officer should have been charged,\" Guidry said. \"With all the evidence, the guy no doubt didn't mean to have what happened, but it was negligence on his part.\"\n\"It should be equal,\" Calhoun said. \"You commit the crime, you do the time.\"\nWatch for updates to this story all afternoon on WBRZ News 2 television newscasts. Refresh this page for updates.\n*****************"}