{"uri": "http://www.wmcactionnews5.com/story/34164140/coroner-identifies-mother-father-and-kids-shot-to-death-in-lex-co-home", "title": "Lex. Co. investigators suspect murder-suicide in deadly quadruple shooting", "dct": "Wed, 04 Jan 2017 00:33:00 GMT", "id": "87681f8e74027c6825b984d6e842efc5", "content": "LEXINGTON COUNTY, SC (WIS) -\nThe Lexington County Coroner's Office has released the identities of four people found shot dead in an apparent murder-suicide on Old Barnwell Road on Sunday evening and the sheriff's department has announced the search for a man in connection with the shootings is over.\nCoroner Margaret Fisher said the victims are Mariassa Hope Reynoso, 26, of West Columbia, along with two of her children, Elijah Chavez, 4, and Ezra Chavez, 1. Also dead is Jorge Luis Chavez, 25, of Honduras, who is believed to be the father of the two deceased children.\nAccording to Fisher, the four bodies were found inside the home in the 1100 block of Old Barnwell Road near Bobsled Drive around 8 p.m.Sunday.\nFisher said Reynoso had another older child who was not present in the home at the time of the incident and is safe. She said Chavez is believed to be the father of the children.\nLate Sunday night, the Lexington County Sheriff's Office released a picture of Jorge Luis Chavez via social media confirming a search for him.\nAfter the initial report of the shootings and before he was identified by the coroner as one of the victims, the Lexington County Sheriff's Department issued a \"be on the lookout,\" or BOLO, for Chavez.\n\"We knew he was connected to the individuals,\" said Capt. Adam Myrick with the sheriff's department. \"We knew he was connected to that residence. So out of an abundance of caution, that's why we shared his name and his information. We had a very high presence here on this road. So we wanted the community to know what we were doing and why we were here and, ultimately, we wanted them to know that they needed to be mindful for their safety and we also did it because we needed their help.\"\nHours later, at 4:45 a.m. on Twitter, the sheriff's department said the deaths were likely the result of a murder-suicide and that they were no longer searching for Chavez.\nA neighbor in the area tell WIS it was tough to know if was tough to determine if he heard gunshots because fireworks were going on nearby.\n\"Got a little bit concerned to start off with when we heard there was a shooting going on...or had went on,\" said William Davis. \"Then, when we found out there were people actually dead, it made it a little more concerning. Later on during the night, it got real concerning when we heard there was an active search going on.\"\nFisher said she believes all four died of gunshot wounds, but said autopsies will be performed to determine causes of death on Tuesday.\nInvestigators have not said who they believe is responsible for the deaths.\n\"We'll be looking to, again, further solidify our identification of the individuals involved and just follow up on any other leads and determine a timeline and other things that will help us piece together what happened,\" said Myrick.\nThe Lexington County Sheriff’s Department as well as the Lexington County Coroner’s Office will continue to investigate the incident.\nA neighbor told WIS the family recently moved into the home and started renting in the last couple of months. The neighbor said he frequently saw the children playing in the back yard while their mother looked on from the back porch, but he's not sure whether Chavez lived there. They also frequently saw Reynosa's third child, who were told is still alive.\nCopyright 2017 WIS. All rights reserved."}