{"uri": "http://www.gwinnettdailypost.com/archive/snellville-triple-murder-suspect-arrested-in-new-orleans/article_764d0ba7-3ec5-50f7-8e9e-acf354999c99.html", "title": "Snellville triple murder suspect arrested in New Orleans", "dct": "Wed, 23 Oct 2013 00:00:00 GMT", "id": "61e7cbac94c8f25978f3b2a6e7e8b753", "content": "More than a month later and several states away, the man believed responsible for gunning down three people at their Snellville home has been arrested.\nOnline records show Robert E. Bell was booked into jail in New Orleans, La., at about 2:30 p.m. local time Thursday. Gwinnett County police said the 34-year-old, a suspect in the Sept. 15 triple homicide on Anderson Livsey Lane, had been tracked down by the U.S. Marshall’s Service and the Gwinnett County Sheriff’s Office’s fugitive unit, who “developed intelligence on a possible location for Bell in New Orleans.”\n“The local fugitive task force in New Orleans checked the location, a homeless shelter, and located Bell,” police spokesman Cpl. Jake Smith said. “He led law enforcement officials on a brief foot chase before being taken into custody.”\nNo further information about the arrest was available Thursday. Gwinnett County detectives will travel to New Orleans to follow up, Smith said.\nAuthorities believe Angela Benton had taken Bell and his wife into her home when they hit hard times. But as Benton, her 12-year-old son, 19-year-old godson and 23-year-old boyfriend arrived home from out of town on the evening of Sept. 15, Bell was allegedly waiting inside with a semi-automatic rifle.\nAll but the boyfriend, Justin Cato, were shot and killed. Bell reportedly fled on foot — Benton, who was driving Bell’s SUV, still had his keys — and hadn’t been seen since.\nAfter Gwinnett County police initially hypothesized their suspect could be in south Georgia, Tennessee, or Chicago, a pickup truck stolen half a mile from the Sept. 15 murder scene was recovered earlier this month near New Orleans.\nBell will eventually be extradited to Gwinnett to face charges including murder and aggravated assault."}