{"uri": "http://www.kirotv.com/news/news/five-dead-bloody-shootout-federal-way-apartments/nXSkN/", "title": "Police say man shot by Federal Way officers responsible for slaying of 4", "dct": "Mon, 22 Apr 2013 06:55:00 GMT", "id": "cdf51f43b8b5eebf976b475725228f1a", "content": "FEDERAL WAY, Wash. - Police said a man shot and killed by officers in Federal Way first shot and killed his girlfriend and then fatally shot three men at an apartment complex.\nInvestigators said they believe the series of slayings began with a domestic violence incident in which the man first fatally shot his girlfriend in the head at their shared apartment in the complex. He then left their apartment armed with a shotgun.\nOnce outside the apartment he encountered two men. Police said he shot both of them.\nThe resident of another apartment in the building, 62-year-old Roland Scobee, walked out of his apartment, saw what was happening, told another neighbor to call 911, and went back inside.\nPolice said the suspect fired a shotgun to breach the apartment door and then shot Scobee, killing him.\nAbout 9:35 p.m. on Sunday, Federal Way police officers responding to a report of suspicious circumstances arrived to the sound of gunfire at the Pinewood Village Apartments in the 33300 block of 18th Lane South.\nOfficers said they saw a man carrying a shotgun exit a stairwell and commanded him to stop and drop the gun.\nPolice said as the man continued to advance, officers fired at him in attempt to get him to stop.\nWounded, the gunman ran to the parking lot and fell near the bodies of the two men he had shot. As the officers approached, they saw the man reaching for a handgun that was on the ground, investigators said.\nWhen the man continued to ignore commands to stop and kept reaching for the gun, several officers fired at the man, killing him, police said.\nThe suspect and both victims in the parking lot were confirmed dead by medics.\nPolice said the slaying involved at least three crime scenes, including two apartments and the parking lot.\nFive vehicles were impounded pending the service of search warrants. Additional vehicles were damaged by gunfire.\nAs is standard department policy, the eight Federal Way officers who fired their weapons are on paid leave pending the outcome of the investigation.\nPolice said the suspect had a valid concealed pistol license and multiple guns registered to his name. A source identified the suspect as 28-year-old Dennis Clark.\nPolice said there was a record of prior police contacts for verbal domestic violence at the apartment where the suspect lived with his girlfriend.\nThe suspect’s girlfriend, who was thought to be the first victim, was a 25-year-old woman. The second and third victims, who were shot in the parking lot, have no known affiliation with the suspect or the victim.\nOne victim found in the parking lot was a 46-year-old man. Another victim, a 23-year-old man, was shot in the back while trying to run away southbound through the parking lot, police said.\nThe fourth victim, Scobee, lived at the complex and had no known relationship to the victim, but was trying to call 911, police said. He was shot with the shotgun and died.\nSylvia Valdovinos said her son, 23-year-old Ceasar Valdovinos, was one of the victims.\nJimmy Mack, who survived the shooting, lives across the hallway from victim Scobee. He told KIRO 7 he saw the gunman come out of Scobee’s apartment.\nMack said the gunman reloaded his gun and then shot a dozen bullets into his apartment.\n“ I heard more shots and I felt something whiz by my head, “ said Mack.\nMack took cover on the floor between the coffee table and the couch.\nWhen it was over, his apartment was riddled with bullet holes, but he was unhurt. Mack said he thinks it’s likely the gunman was on drugs when he killed four people.\n“We talked in the parking lot. I knew his girlfriend and we were all fine. He had to be loaded on something because we were friends, “ Mack said.\nRelatives of the 25-year-old female victim identified her as Justine Baez. They said she dated Clark for at least four years. Her family, who said they are devastated, doesn’t understand why she was slain.\nBaez' family said their was excited about going to college.\nBaez's uncle said the family had witnessed Clark's violent behavior before and he was in disbelief that Clark was able to carry a gun legally.\n“I’d hate to have another family have to go through something like this,\" he said. \"You know, it might not’ve been 100 percent preventable, but at least, I’m not sure what the system up there is, but he should not have had those firearms, it might’ve saved my niece’s life.\""}