{"uri": "http://www.startribune.com/hunt-on-for-suspects-in-north-side-gunfire-that-killed-1-wounded-others/378283121/", "title": "Police say gangs are behind North Side mass shooting that killed 1, wounded 7", "dct": "Thu, 05 May 2016 00:00:00 GMT", "id": "09e4d211a583ad7553c61466bb334f93", "content": "Minneapolis police continue to investigate the latest outbreak of violence on the city’s North Side — an allegedly gang-related barrage of gunfire Wednesday evening that left a 20-year-old man dead and seven others injured, two of them fighting for their lives.\nDetectives on Thursday were working several leads to solve the shooting near Newton and 16th avenues N., which was captured on camera and widely shared online.\n“We will not tolerate this violence, not as a police department and not as a community,” Police Chief Janeé Harteau said in a statement. “We have good intelligence in this case, and we are aggressively going after those involved.”\nWhile the names of the dead and wounded have not been released, police on Thursday revealed their ages and genders. Wounded were three women — two 20-year-olds and one 25-year-old — and four men, ages 20, 23, 27 and another described only as in his 20s.\nThe 20-year-old man who lost his life was pronounced dead at the scene just before 9 p.m. Wednesday, police said. Friends on social media openly grieved for the man nicknamed “Dolo.”\nMore than four dozen shell casings were collected at the scene, police said, along with two handguns.\nThe shooting victims, as well as nearly a dozen witnesses, were interviewed by detectives, though police said that several were uncooperative.\nHarteau said investigators would work quickly to bring to justice those responsible.\n“Although we’ve noticed an increase in shootings in our city, we don’t believe there’s been an increase in the number of people pulling the trigger,” she said in a statement. “It’s a small section of our population, and the same people are becoming more brazen and more violent.\n“The victims in the most recent incident were the intended targets, but this violence affects everyone,” she said.\nThe dispute apparently began earlier in the day between two groups of gang members and ended with the shooting outside a house in the Willard Hay neighborhood.\nBefore the gunfire, several people were hanging out on the front lawn at that location as a memorial for one of their friends who had been killed last year.\nA video shot at the scene now circulating on Facebook shows several young men mugging for the camera and flashing what appear to be gang signs.\nAfter nearly a minute, the pop-pop-pop of gunfire begins and continues for nearly 10 seconds.\nIn another video posted later by the same North Side resident, a victim is shown being wheeled away on a stretcher.\nPolice used dogs in their search for the suspects, and a law enforcement helicopter scoured the area. Extra officers were called to the scene to help calm a chaotic crowd of dozens of people who gathered afterward.\nOne woman could be heard screaming, “Not my son!” Later, she and a woman who told officers that she was the dead person’s sister pleaded with police to let them go to the body. They were told they couldn’t while investigators worked at the scene.\n‘A child in my arms crying’\nBuzzy Bohn was at the nearby Fourth Precinct police headquarters protesting the recent administrative leave of Inspector Mike Friestleben when she heard the shots.\nThe following day, the Minneapolis Public Schools employee found herself consoling students.\n“I had a child in my arms crying because they wanted it to stop,” Bohn said of the violence.\nAlfredo Barrera, 23, who lives on the block, noted the recent uptick in violence. His 10-year-old sister, Giselle Martinez, said she had just gotten home from fishing with her aunt and uncle when she heard what she first thought were fireworks.\n“But when we heard it really loud, again and again, then we realized they were gunshots.” she said.\nGiselle called for her cousin and brother, who were outside in the yard, to take cover inside the house.\nThe scene the following day bore little resemblance to Wednesday’s chaos.\nKids dribbled basketballs on the sidewalks and tossed footballs in the streets, while other folks worked in their gardens.\nPolice say there is an ongoing gang war between the North Side’s “High-End” and “Low-End” factions — the “Highs,” made up of street gangs like Young N’ Thuggin’, Loud Pack and Taliban hold territory in the northern half of north Minneapolis, while the “Lows,” which include the Stick Up Boys, Skitz Squad, Hitsquad and Valley Boys, run the southern half.\nPolice say that the feud dates to last March and that it has been the cause of more than a dozen shootings and several slayings.\nIn 2015, the North Side recorded about 164 gunshot victims; already this year, it has seen 76 people shot, putting the area on pace to eclipse last year’s total by late September.\nAnd while the number of arrests has plummeted, the number of aggravated assaults — considered a key measure of how safe a city is — has risen by 31 percent, according to the latest police statistics.\nHarteau recently expanded patrols on the North Side by 20 to 30 officers and said they would expand to seven days a week."}