{"uri": "http://www.columbian.com/news/2015/mar/28/two-killed-in-shooting-in-bremerton/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+the-columbian-headlines+%28The+Columbian%3A+Headlines%29", "title": "Two killed in shooting in Bremerton", "dct": "Sun, 29 Mar 2015 00:00:00 GMT", "id": "9326e761feaa021010d525a5432a2963", "content": "Boy, 2, woman die, man injured at mobile home park; suspect still at large\nBREMERTON — Kitsap County Sheriff’s deputies are investigating a double homicide in Bremerton. The suspect remains at large.\nOfficials say a 29-year-old woman and 2-year-old boy were fatally shot early Saturday. A third victim, a man whose age is unknown, was airlifted to Harborview Medical Center in Seattle with life-threatening injuries.\nThe Kitsap Sun reported that the boy’s mother was trying to shield him when he was shot, but the mother was not hurt. The woman who was killed was a roommate.\nThe sheriff’s office released a statement late Saturday identifying the woman who was killed as Heather Kelso of Bremerton. She was an employee of Puget Sound Naval Shipyard and had lived in the mobile home park for three years, the sheriff said. The boy was identified as Kaden Lum, also of Bremerton. He and his mother had lived with Kelso for three weeks. The Sheriff’s office did not release the boy’s mother’s name.\nOfficials say they received reports of gunshots heard at the Kariotis Mobile Home Park just after 2 a.m. Saturday. When they arrived, they found the woman dead and the 2-year-old critically injured. The toddler was taken to Harrison Medical Center in Bremerton, but he later died.\nThe mother and boy had moved into the home three weeks ago, Sheriff’s Lt. Detective Earl Smith told the newspaper. The boy’s father lives outside Kitsap County, Smith said. The third victim was a neighbor who was visiting and was shot as he ran back to his residence, Smith said.\nThe man was shot in the lower abdomen and underwent surgery, Smith said. Detectives were waiting to interview the man, Smith said.\nInvestigators used a police dog to search the mobile home park, but the dog did not pick up the suspect’s scent. “We feel confident the suspect is no longer in the mobile home park,” Smith said.\nTwo other homes were hit with bullets, but no one was hurt, he said.\nThe Bremerton Police Department and Washington State Patrol have joined the Sheriff’s Office in the investigation."}