{"uri": "http://www.fresnobee.com/news/local/crime/article88099967.html", "title": "3-year-old kills herself with loaded gun in Lemoore", "dct": "Wed, 06 Jul 2016 18:00:00 GMT", "id": "7012e5c82ca49dd4040837c3e4e7714d", "content": "A 3-year-old Southern California girl who came upon a loaded gun accidentally shot herself in the head and died, Lemoore police said Wednesday.\nThe girl, who was visiting from out of town, found the gun in a bedroom, police said.\nHer name is not being released because of her age, Lemoore police Detective Matthew Smith said. He said she was almost 4.\nThe tragic incident happened Saturday at an apartment in the 800 block of Dogwood Avenue. Lemoore police released information about the shooting on Wednesday.\nAt 12:49 p.m. Saturday, police received an emergency call that a 3-year-old had suffered a head injury.\nPolice and medical personnel found the child lying on the floor of the apartment with a head wound. A loaded handgun was found near the body. Police would not provide details about the gun’s caliber.\nThe girl had a single gunshot wound to the skull, police said.\nSmith said the child and her family were visiting Lemoore from Southern California. The child was unattended in a bedroom when the child’s mother, sibling and the mother’s friend heard a bang in the bedroom, Smith said.\nThey did not know the sound was gunfire and at first believed the child had fallen from the bed, Smith said. When police arrived, they were trying to help the child, he said.\nIt’s hard on everyone. Our hearts go out to the family involved.\nMatthew Smith, Lemoore Police Department\nThe girl was taken to Adventist Medical Center in Hanford, where she was pronounced dead.\n“It’s just an unfortunate accident,” Smith said. “It’s hard on everyone. Our hearts go out to the family involved.”\nThe family and others are cooperating with the investigation, police said.\nThe apartment is occupied by two roommates. Both were away at the time, Smith said.\nInvestigators learned that the gun is registered to a friend of one of the roommates, Smith said.\nThe case is being investigated as reckless endangerment of a child resulting in death and negligent storage of a firearm. No arrests have been made, but the gun owner and the roommate could face charges, he said.\nThe case will be turned over to the Kings County District Attorney’s Office this week for review and any filing of charges.\nLewis Griswold: 559-441-6104, @fb_LewGriswold"}