{"uri": "http://wset.com/news/local/overnight-shooting-kills-1-injures-several", "title": "Overnight shooting kills 21-year-old and injures three", "dct": "Sun, 18 Sep 2016 00:00:00 GMT", "id": "d8e3c918e6fcbd265932f85d925ffba7", "content": "LYNCHBURG, Va. (WSET) -- A 21-year-old man was killed and three others have been hospitalized after witnesses say someone fired shots from inside their car and drove off. The shooter is still at large.\nLynchburg Police responded to a call for shots fired just after 2:00 a.m. Sunday morning at 421 Rivermont Ave (The Ellington building).\nWhen Officers arrived, they found four victims that had been shot.\nPolice say Shawn L. Johnson Jr., 21 of Lynchburg was shot and killed. He received a gunshot wound to the midsection of his body and was later pronounced dead at Lynchburg General Hospital, according to LPD.\nPolice say Kevin J. Foxx, 30, of Lynchburg is receiving treatment for several gunshot wounds and is listed in critical condition.\nJamall D. Randolph, 28 and Angelena C. Garland, 25 both of Lynchburg are receiving treatment for a non-life threatening gunshot wound.\n\"It makes me feel like it's not safe... it's not safe around here... especially for this little guy right here,\" explained one resident acknowledging her grandson in her lap.\nResidents around the Rivermont Ave. area are shocked after a shooting took place right outside of their homes.\n\"There was a swarm of people yelling 'help me, he's going to die!'\" said Brian Nelson, who says the recent shooting him feel unsafe in the neighborhood.\n\"It makes you fearful in a way because it is so close to home,\" said resident, Grace Hunt. \"I've been here a long time nothing like that has ever happened at the Ellington.\"\n\"I don't think it's right, I don't think it's fair because there is no reason for a mother to have to bury their kids,\" explained Nelson.\nAccording to witnesses at the scene a man fired several shots from a dark colored four-door sedan with an unknown license plate number; no other description was available.\nThe homicide and malicious wounding investigation is ongoing at this time.\nIf you have information regarding this incident, contact Det. Chad Davis at 434-455-6166 or call Crime Stoppers at 1-888-798-5900."}