{"uri": "http://www.dailybulletin.com/general-news/20160715/san-bernardino-triple-homicide-suspect-arrested", "title": "Tips help San Bernardino police catch Rialto gang member suspected of killing 9-year-old, 2 men", "dct": "Fri, 15 Jul 2016 16:51:00 GMT", "id": "8b7ddb3b1d284838906d26793d4e33c5", "content": "SAN BERNARDINO >> The man accused of fatally shooting a 9-year-old boy, his father and another man on July 8 has been arrested.\nTrayvon Eshawn Brown, 26, of Rialto, was arrested Thursday afternoon by San Bernardino police at the Fontana office of his probation officer. Brown, a documented gang member, was booked in the Central Detention Center in San Bernardino on suspicion of murder and is being held in lieu of $1.5 million bail.\nBrown, who’s on Post Release Community Supervision, is also being held on a no-bail warrant for violating the terms of release. Under PRCS, triple non — non-violent, non-serious, non-sexual — offenders who would’ve been placed on parole are instead monitored by local county probation agencies as part of the California Prison Realignment Plan or Assembly Bill 109.\nBrown was convicted in June 2013 for an attempt to evade a peace officer with reckless driving, San Bernardino County Probation spokeswoman Kimberly Epps said.\n“On July 14, 2016 he reported to the Fontana probation office,” she said in an emailed statement Friday. “Probation officers recognized him and detained him on a warrant. Probation contacted the San Bernardino Police Department who responded to probation and assumed custody of him.”\nEpps said records show that Brown was in compliance with his probation and reporting according to his terms of release prior to the shooting.\nOn July 8, police were dispatched about 9:20 p.m. after a report of gunfire at Superior Liquor, 2950 Del Rosa Ave.\nThree victims — Samathy Mahan, 25, Travon “Hefty” Lamar Williams, 26, and Travon Williams, 9 — exited the liquor store when a man who had been loitering in the parking lot confronted them, Police Chief Jarrod Burguan said.\n“They were all shot as they came out of the store,” he explained. “Mahan ran around the corner and Brown followed him and shot him again multiple times.”\nBurguan voiced his dissatisfaction in the laws AB109 and Prop 47 and how they adversely affect the community.\n“We’re finding it’s a reoccurring thing that we’re making contact with these people who are freed on probation,” he said. “Time and time again, we make arrests of someone on PRCS and now a 9-year-old boy is dead.”\nBurguan also said the community was key in solving this crime and thanked them for coming forward.\n“Many times, we investigate crimes and the community refuses to come forward, this wasn’t one of those times,” Burguan said. “People are outraged over this, and this just goes to show that when the community gets involved and calls us with information, we can make an arrest and hold the person accountable for their crimes.”\nAdvertisement\nPolice said an ongoing violent history between Brown and Mahan sparked the triple homicide.\nDetectives said in a written statement that a shooting on June 15th happened at 2871 N. Park Avenue, directly around the corner from Friday’s homicide scene. They say Brown and Mahan fought and according to a witness Brown had been shot during the altercation between the two.\nAfter the triple homicide happened, detectives began receiving dozens of calls from both anonymous and named callers who identified Brown as the shooter.\nAfter Brown’s arrest, he was taken to police headquarters to be questioned by detectives. He’s expected to appear in San Bernardino County Superior Court Monday morning."}