{"uri": "http://www.pe.com/articles/san-807844-harris-sent.html", "title": "SAN BERNARDINO: Friends remember father, 9-year-old son killed in triple homicide", "dct": "Fri, 15 Jul 2016 09:58:00 GMT", "id": "e31c3f315123afd11fb3f3de7331703a", "content": "Friends paid tribute Saturday to the two men and 9-year-old boy killed outside a San Bernardino liquor store, as details about the slayings the night before began to emerge.\nFriday was a particularly violent night for the city with another homicide taking place in the 100 block of West 17th Street and a fatal hit-and-run on East Baseline Street and Crestview Avenue.\nSamathy Mahan, 25, Travon “Hefty” Lamar Williams, 26, and Travon Williams, 9, all of San Bernardino were identified as the three killed Friday night outside Superior Liquor, 2950 Del Rosa Ave., according to a San Bernardino police news release.\nFriends who lit candles outside the store Saturday morning said that Travon Lamar Williams and his son, Travon Williams, were just in the wrong place at the wrong time.\nA soccer ball with the words “We love you Travon” was left among the candles and flowers at the scene of the triple homicide.\nSuperior Liquor store manager Saif Baji, 30, said Travon Lamar Williams and his son came in every day. The two were laughing and joking while leaving the store Friday night, he said.\nThe gunman, who remained at large Saturday, waited outside the store for the victims before opening fire and killing all three, the release states. One of the men died at the scene, while the other man and boy were taken to Loma Linda University Medical Center where they later died, Lt. Brian Harris said Friday.\n“It was a big gun, like a .45,” Baji said of the silver handgun used in the slayings.\nBaji said that Travon Lamar Williams “almost got away” after the shooting began. According to Baji, the gunman shot the boy in the head first, then Mahan and ran after Travon Lamar Williams and shot him several times.\n“I watched him die right before my eyes,” Baji said of Travon Williams. “It was terrible.”\nThroughout the shooting, there was no cry for help — or any words — from the victims or the shooter, Baji said.\nTravon Williams is the youngest homicide victim of 2016 and the deaths bring the total homicide deaths this year in San Bernardino to 38. Twelve-year-old Jason Spears who killed earlier this year near the corner of North Orange Street and East Love Lane was previously the youngest victim.\nAll of last year there were 44 homicides in the city, including the 14 people killed in the Dec. 2 attack.\nThe boy who was killed Friday night was initially reported as a 10-year-old by Chief Jarrod Burguan. It was determined that he was still 9 years old once a date of birth was given for Travon Williams, Sgt. Vicki Cervantes said Saturday.\nPolice believe that Mahan, a documented gang member and a recently paroled felon, may have been the intended target, according to the release.\nTravon Lamar Williams was not into gangs and worked to bring people together, said Aguadia Brown 27, of San Bernardino who attended San Gorgonio High School with him.\n1\n2\nNext Page"}