{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-shooting-violence-20170109-story.html", "title": "2 killed, 6 wounded in shootings in Chicago, including attack near Eisenhower", "dct": "Tue, 10 Jan 2017 07:48:00 GMT", "id": "c7ef9aebf0a28fa4543592abf5406bb6", "content": "Two men were killed Monday in shootings on Chicago's West Side, including an attack a block from the Eisenhower Expressway, police said.\nThe victims were among at least eight people shot in the city from mid-morning Monday to early Tuesday, according to police.\nAround 7:45 p.m, a 26-year-old man was shot in the 1600 block of North Keystone Avenue in the Hermosa neighborhood. Police found the man on the street with gunshot wounds to the head and other areas of his body, according to police. He was taken to Stroger Hospital and pronounced dead.\nAround 9:45 a.m., a man was killed and another was wounded while riding in a car about a block from Interstate 290 in the Lawndale neighborhood, police said.\nThe men, 21 and 23, were in a car going east in the 4500 block of West Lexington Street when a black SUV pulled alongside and someone inside began shooting, hitting both of them in the head, police said.\nThe 21-year-old was sitting in the back seat, and the 23-year-old was in the front passenger seat, police said. The driver, 26, was not injured and took the other men to West Suburban Medical Center in Oak Park, police said.\nThe 21-year-old was pronounced dead at the hospital, and the 23-year-old was stabilized and transferred to Stroger Hospital, police said.\nOther shootings:\n• Just after 1:50 a.m. Tuesday on the South Side, a 32-year-old man was shot in Chatham. He was in a parked car in the 7700 block of South Indiana Avenue when someone fired shots and he was hit twice in the back, police said. He went to Stroger Hospital in serious condition.\n• About 11:50 p.m. Monday on the Far South Side, a 27-year-old woman was shot during an attempted robbery in Roseland, police said. She was walking on the sidewalk in the 200 block of West 111th Place when someone walked up and demanded money, police said. She told him she didn't have any, and the robber opened fire. She suffered gunshot wounds to both legs and went to Advocate Christ Medical Center in Oak Lawn, where she was stabilized.\n• About 11:40 p.m. on the West Side, a 37-year-old man was shot in the South Austin neighborhood. Two people approached and fired shots as he sat in a parked car in the 700 block of North Long Avenue. He was hit in the left arm and went to West Suburban Medical Center, where his condition was stabilized.\n• In the West Side's Austin neighborhood, a 16-year-old boy was shot about 3:10 p.m. in the 300 block of North Laramie Avenue, according to police. The boy was hit in the buttocks and taken to Mount Sinai Hospital, where his condition was stabilized. The teen told police he was walking when he heard shots and felt pain. No one was in custody.\n• About 11:15 a.m. on the South Side, a 24-year-old man was shot in the left leg in the 4500 block of South Vincennes Avenue in the Bronzeville neighborhood, police said. He had been getting into his car around 11 a.m. when shots were fired from a passing van, police said. The man was taken to Stroger Hospital, where his condition was stabilized."}