{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-shootings-violence-20161128-story.html", "title": "3 dead, at least 11 wounded in shootings citywide", "dct": "Tue, 29 Nov 2016 17:16:00 GMT", "id": "956a9103018437776dd77ebbbd2b99aa", "content": "(Terrence Antonio James / Chicago Tribune)\nTwo men and a teenage boy have been killed and at least 11 people were wounded in shootings citywide since midmorning Monday, Chicago police said.\nMost recently, just after 1:30 a.m. Tuesday, 51-year-old Gregorio Aguilar was killed in the Cragin neighborhood on the Northwest Side.\nPolice responded to the 2500 block of North Lavergne Avenue for a call of a person down. Paramedics found that Aguilar had been shot in the lower abdomen. He was pronounced dead at the scene at 1:50 a.m., according to the medical examiner. He lived in the 5000 block of West Deming Place.\nNobody in the surrounding blocks had called 911 to report gunfire, authorities said, and police found just one spent bullet cartridge at the scene. Further information about the circumstances of the shooting were not released.\nAbout 6:15 p.m. Monday, a 17-year-old boy and an 18-year-old man were found unresponsive in a vehicle in the 4500 block of South Wolcott Avenue in the Back of the Yards neighborhood, police said.\nThe boy suffered a gunshot wound to the midsection and the man suffered a gunshot wound to the head, and both were pronounced dead on the scene, according to police.\nThe two were identified as Jamie Cervantes, 17, and Leny Cervantes, 19, of the same address in the 6400 block of South Bell Avenue, who were both pronounced dead at the scene at the scene at 6:35 p.m., according to the Cook County medical examiner's office. They each died from suffering multiple gunshot wounds, the office determined following an autopsy.\nPolice said they had no record of either Cervantes having a criminal or gang background. Their exact relationship was not immediately known.\nIn other shootings:\nAbout 1:40 a.m. Tuesday, a 30-year-old man was shot in Park Manor. He went to University of Chicago Medical Center with a gunshot wound to the leg after being shot in the 7000 block of South King Drive. He said he was driving when he heard gunfire and felt pain.\nJust before 8:55 p.m. Monday, a 21-year-old man and a 17-year-old boy were shot in an apartment building in the 8700 block of South Escanaba Avenue in the South Chicago neighborhood, police said. The man suffered a gunshot wound to the chest and was in serious condition at Advocate Christ Medical Center in Oak Lawn. The boy was shot in the left foot, and his condition was stabilized at the same hospital. The two were in a hallway in the apartment building when a man or boy wearing a mask came in and fired at them, according to police.\nJust before 9:05 p.m. in the North Lawndale neighborhood, a 54-year-old man was shot in a robbery in the 3800 block of West Lexington Street, according to police. The man suffered a gunshot wound to the to the right foot and was taken to Mount Sinai Hospital, where he was in good condition. The man was walking on the block when two men or boys came up to him and told him they were robbing him, and at least one of them took out a gun and fired shots, hitting him, police said.\nJust after 7 p.m., a 36-year-old man was shot in the back and critically wounded in the 2400 block of West 47th Place in the Brighton Park neighborhood , according to police. The man was taken to Mount Sinai Hospital for treatment.\nAbout 4:05 p.m., three men were wounded, one of them suffering critical injuries, in a shooting in the 8700 block of South Wood Street in the Gresham neighborhood, according to police.\nOne 23-year-old man suffered a gunshot wound to the head in the attack and was taken to Advocate Christ Medical Center, where he was in critical condition, police said. A second 23-year-old man, who police originally said was shot in the head and in critical condition, suffered a graze wound to the head and a gunshot wound to the left shoulder. His condition was stabilized at the same hospital. A 26-year-old man suffered a gunshot wound to the hip and was taken to the same hospital, where he was in serious condition.\nThe three were in a van when a dark-colored SUV drove up and someone inside fired shots before driving away, police said.\nPhotos show a silver minivan parked in a driveway, and evidence markers showing the location of at least 10 bullet shell casings strewn along the street.\nAround 10:20 a.m., three men were shot in the Back of the Yards neighborhood on the South Side, according to police.\nThe men were in the 5200 block of South Ashland Avenue when they were shot, according to police.\nA 37-year-old man was hit in the upper thigh and was in critical condition at Stroger Hospital, police said. A 19-year-old was shot in the abdomen and was in serious condition at Stroger, and an 18-year-old was hit in the buttocks and was reported stable at Mount Sinai Hospital, police said. No one was in custody, police said.\nCheck back for updates."}