{"uri": "http://www.komonews.com/news/local/No-arrests-in-slayings-in-Kitsap-County-298036981.html", "title": "Search for gunman continues in Kitsap Co. triple shooting", "dct": "NODATE", "id": "6e5ffb68521deebf425db3acdb84c316", "content": "BREMERTON, Wash. (AP) - No arrests have been made in a weekend shooting that left a woman and her roommate's toddler dead and a neighbor wounded at a Washington mobile home park, a sheriff's official said Monday.\nKitsap County sheriff's Sgt. Ken Dickinson said in a statement that detectives are exploring leads and interviewing people but have no suspects yet.\nHeather Kelso and her roommate's 2-year-old son, Kaden Lum, were shot early Saturday in their home at a mobile home park in Bremerton, across the Puget Sound from Seattle.\nA third shooting victim - a 22-year-old neighbor - is expected to recover after undergoing surgery Saturday at Harborview Medical Center in Seattle, Dickinson said.\nThe toddler's mother was home when the shooting happened and tried to protect the boy, but he died at a local hospital, police said. The mother was unharmed and told police she didn't know the shooter, The Kitsap Sun reported.\nThe mother and son had moved into the home with Kelso three weeks ago, police said.\nKelso, 29, worked at the Puget Sound Naval Shipyard and had lived at the residence for three years. She died at the scene. Kelso has a 4-month-old daughter who wasn't home during the shooting, Dickinson told the Bremerton newspaper.\nThe 22-year-old neighbor had been visiting Kelso's home and was shot in the abdomen as he ran back to his nearby residence. His roommate was among those who called 911.\nTwo other homes were hit with bullets, but no one else was hurt, police said.\nDetectives interviewed the wounded neighbor but got no additional information on a suspect, Dickinson said in an email Monday to The Associated Press. His name wasn't released.\nAutopsies on the two victims were scheduled for Monday.\nGretchen Stanton, a friend and co-worker of Kelso's for years, said Kelso had a big heart and was always ready to help others.\n\"She had charm. She was sweet - a little bit of spunk and very open-minded,\" Stanton told the Kitsap Sun. \"She always worked hard. She really put her heart into everything she did and was very determined to make people happy.\""}