{"uri": "http://www.thedenverchannel.com/news/crime/buckley-airman-shoots-wife-dead-in-aurora-says-he-was-playing-with-handgun", "title": "Buckley Airman shoots wife dead in Aurora, says he was playing with handgun", "dct": "Fri, 26 Aug 2016 16:37:00 GMT", "id": "d913ca564f01f2056bf720df98f0e7a6", "content": "Autoplay:Buckley Airman charged in wife's deathCONNECTING...XBuckley Airman arrested in Aurora fatal shooting\nAURORA, Colo. -- A Buckley Air Force Base airman was charged with manslaughter after killing his wife while playing with a handgun, an arrest affidavit states.\nAirman First Class Brian Lebron-Rivera, 21, had called the Aurora Police Department and told dispatch the gun went off and shot his wife in the head while they were trying to take it from each other's hands.\n\"Sir, I killed my wife, it was my fault,\" Lebron-Rivera told officers moments after reporting the shooting to dispatch at around 6:15 p.m Thursday, according to the affidavit.\nOnce officers arrived at the apartment in the area of East Ohio Place and South Buckley Road, they found Genesis Rodriguez, 20, lying on the ground showing no signs of life. They also found the handgun laying on a countertop, a magazine near the handgun and a live round of ammunition near the handgun and magazine, according to the affidavit.\nRodriguez was immediately taken to the Medical Center of Aurora, but was pronounced dead a short time later.\nLebron-Rivera told detectives he and his wife were \"training\" with the handgun, and that he was teaching her how to react if someone else had a weapon, the affidavit states.\nThe affidavit also notes Lebron-Rivera had just gotten out of the shower and was getting ready to go to work when he took the gun away from his wife, not remembering inserting the magazine into the handgun. He then told his wife, \"whoever gets the gun first has to take it away.\"\nThe arrest affidavit states Lebron-Rivera got to the handgun first, picked up the weapon, chambered a round, pointed the weapon at Rodriguez and fired one shot at her, killing her.\nDetectives also interviewed a neighbor at the scene, who told them that on at least three occasions, she could hear thumping noises that she thought could be related to the couple fighting. The neighbor also told police she heard Rodriguez crying on one occasion, according to the arrest affidavit obtained by Denver7.\nA captain at Buckley Air Force Base said Lebron-Rivera was assigned to the 460th Security Forces Squadron.\n\"Any loss of human life is tragic; right now we are focusing on making sure family and Team Buckley members have the resources they need to cope with this loss,\" said Col. David Miller, 460th Space Wing commander. \"We appreciate the close coordination with the Aurora Police Department and we want to thank the community for their continued support.\"\nLebron-Rivera's bond was set at $50,000.\nDenver7 has unsuccessfully attempted to reach Lebron-Rivera's public defender for comment. Our requests have not been returned as of the publishing of this article.\n---------\nSign up for Denver7 email alerts to stay informed about breaking news and daily headlines.\nOr, keep up-to-date on the latest news and weather with the Denver7 apps for iPhone/iPads, Android and Kindle.\nCopyright 2016 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}