{"uri": "http://www.macon.com/news/local/crime/article49598960.html", "title": "Macon girl dies after being wounded in spray of bullets in Bloomfield", "dct": "Sun, 13 Dec 2015 23:17:00 GMT", "id": "c4a2411f7e9f1cfa0d5eff8a9d86bf23", "content": "At least 17 shell casings were found in a Bloomfield front yard after a 14-year-old Macon girl was mortally wounded Sunday night.\nTashuntis Roberts, a Southwest High School ninth grade student, died in the operating room of Medical Center, Navicent Health at about 9:50 p.m., said Bibb County deputy coroner Lonnie Miley.\nShortly after 6 p.m., Bibb County sheriff's deputies were called to a report of gunshots in the 3900 block of Lindwood Drive, which is a few blocks off Bloomfield Drive.\nAs Roberts was being treated in the ambulance, deputies placed temporary evidence markers on the front lawn. At least 17 could be seen in the dim light.\nSeveral bullets hit the ranch house, which had Christmas lights in each front window.\nThe girl was inside the house when the shooting happened and was stabilized at the scene before she was taken to the hospital.\nAlthough investigators initially thought she was shot at least once in the side, once she got to the Emergency Center, doctors were trying to determine whether she was hit more than once, said Deputy Linda Howard, a public information officer for the Bibb County Sheriff's Office.\n\"We all thought she was going to make it because she was talking the whole time, but she had multiple gunshot wounds,\" Howard said late Sunday. \"This is homicide.\"\nRoberts' father, Tavares Maurice Roberts, was shot and killed in June of 2006 in a room at the Discovery Inn on Chambers Road, Bibb County Coroner Leon Jones said Monday morning.\nIn Sunday's deadly shooting, an incident earlier that day involving the victim's brother might have been the motive, Howard said.\nThe girl was not believed to be the intended target, she said.\nA neighbor reported seeing a car go down the street, turn around and stop in front of the house at 3948 Lindenwood.\nTwo people got out of the car and bullets started flying.\nOne man was sitting on a nearby porch when he heard the shots. He ran into the street with his own weapon and fired several times and the people from the car got back in the vehicle and drove off.\n\"Any of my neighbors on the street, I'm going to look out for them,\" the man said. \"We've never had a problem over here. This street is so quiet you can sit here and hear a pin drop.\"\nThe Bibb County Sheriff's Office is investigating the fatal shooting.\nAnyone with information is urged to call an investigator at 478-751-7500 or leave an anonymous tip through Macon Regional Crimestoppers at 877-68-CRIME.\nTo contact writer Liz Fabian, call 744-4303 and follow her on Twitter@liz_lines."}