{"uri": "http://www.losbanosenterprise.com/2013/04/03/205615/teens-in-los-banos-homicide-case.html", "title": "Teens in Los Banos homicide case to be tried as adults", "dct": "Wed, 03 Apr 2013 18:18:00 GMT", "id": "f348402cb1dfc7d7ca90860c25429f4b", "content": "Two teenagers accused of gunning down an 18-year-old man in Los Banos last month will be tried as adults on murder charges.\nDefendants Christopher Aguayo, 15, and Albert Hernandez, 17, pleaded not guilty to the murder charges during an arraignment hearing in Merced County Superior Court on Wednesday. Los Banos police arrested the pair in the March 4 shooting death of Shane Thomas Moore.\nMoore was fatally shot while inside the garage of a La Mesa Lane home with a group of men. Three others sustained non-fatal bullet wounds. Police have said the defendants and some of the victims are documented gang members, but Moore was not.\nChief Deputy District Attorney Harold Nutt said the pair are being charged as adults because of the serious nature of the crime. If convicted, both could spend the rest of their lives in prison. \"As an office, we've made the decision that when a firearm is used, especially when someone is killed, were are going to look at (trying the defendants) as adults,\" he said.\nHernandez and Aguayo have each been charged with one count of murder, three counts of attempted murder and one count of participation in a criminal street. Those charges include enhancements for alleged use of a gun.\nThe shooting was reported around 9 p.m. March 4. According to police reports, witnesses said some of the victims had been helping someone move into the house. The victims had been gathered in the garage when someone opened fire.\nPolice believe Hernandez was the shooter, while Aguayo acted at the accomplice. Witnesses reported seeing someone hiding behind the vehicle in front of the home when shots rang out.\nA few weeks after the shooting, police arrested Aguayo. The evidence against Aguayo includes a taped phone conversation where he allegedly made certain statements to his brother, connecting him to the crime, according to police reports.\nWhile being questioned by police, Aguayo broke down crying, saying he didn't want to participate in the shooting, and had gotten into an argument with Hernandez prior to the incident.\nAguayo said Hernandez rode off on a bike after the argument, and he then heard gunshots. Aguayo also said Hernandez had admitted committing the shooting afterward.\nAttorney David Capron, who is representing Aguayo, said his client is not guilty. \"He was not involved in this murder or attempted murder,\" Capron said after Wednesday's hearing.\nUnder questioning from detectives, Hernandez initially denied any involvement in the shooting, but later confessed, according to police reports. Hernandez told detectives that killing Moore was accidental, as he was a \"non-gang related\" person. Hernandez did tell detectives, however, that he was aiming at rival gang members -- and he even agreed to write an apology letter to the victim's family.\nDeputy Public Defender Chris Loethen, who is representing Hernandez, said he's still waiting for some evidence in the case to come back from the Department of Justice. \"At this point, without reviewing the results of those tests, I am not in a position to comment further about the case,\" Loethen said.\nHowever, Loethen pointed out none of the witnesses in the case were able to see the shooter's face, and could only describe his clothing.\nThe defendants remain in custody at Merced County Juvenile Hall.\nCity Editor Victor A. Patton can be reached at (209) 385-2431 or vpatton@mercedsun-star.com."}