{"uri": "http://www.americanpress.com/20151106-Boy-Killed-Louisiana-Shooting", "title": "Police probe Marksville shooting that killed a child", "dct": "Fri, 06 Nov 2015 10:03:00 GMT", "id": "17e77263317342e484a9ca07dc5ace51", "content": "By Cain Burdeau / Associated Press\nNEW ORLEANS — State police examined forensics evidence but still had not spoken Thursday with the law enforcement agents involved in a shooting that left an autistic 6-year-old boy dead and his father seriously wounded in central Louisiana.\nState police are leading the investigation into the Tuesday night shooting in Marksville, a town of about 5,700 people. A family member of the dead boy called the shooting unwarranted.\nCity marshals were chasing Chris Few at about 9:30 p.m. Tuesday, after he fled from an attempt to serve a warrant, the coroner in Avoyelles Parish where the shooting occurred had said Wednesday. Few was critically wounded and his 6-year-old son, Jeremy Mardis, died of multiple gunshot wounds to his head and chest, the coroner, Dr. L.J. Mayeux, had added.\nThe coroner said the boy was “caught in the line of fire” and killed. Few was listed in serious condition Thursday, hospital officials said.\nAuthorities have released few details of what took place.\nCol. Mike Edmonson, the head of state police, said at a news conference in Marksville on Thursday that no gun was found inside Few’s vehicle. He said the investigation was just beginning and there were “a lot of unanswered questions” but investigators would be methodical in seeking out the facts.\n“Anytime an individual is killed, especially a child, it’s a tragedy,” Edmonson said. “The investigative team spent 12 hours Wednesday going through the entire scene from a forensic standpoint to get the trajectory of the bullets, find and count the casings and generally put the scene together.”\nHe said video pertaining to the shooting had not been analyzed and that officers involved in the shooting had not been interviewed yet. Three of the officers also work for the Marksville Police Department and one works as a city marshal in nearby Alexandria.\nFew’s 57-year-old stepfather, Morris German, accused the city marshals of indiscriminately opening fire on the vehicle. German said Few was heavily sedated, unable to talk and has bullet fragments lodged in his brain and lung. He described Few as a loving father and added the man’s son “was his whole life.”\n“I know a 6-year-old should not have been shot,” German said. “I don’t care what my son was doing.”\nGerman said he was unaware of any warrants against Few.\nHe called his stepson a law-abiding person who’d once been charged with driving under the influence but otherwise had a spotless record. He said Few works as a river pilot on the Red River and is routinely tested for drugs.\nHe also strongly doubted his stepson was carrying a weapon and said he found it hard to believe he would flee authorities with his son in the vehicle.\n“Anything’s possible, but I can’t see him doing that with his son in the car,” German said. “That doesn’t sound like him at all.”\nMardis was diagnosed with autism, German said, describing him as a delightful child who “loved everything, everybody.” German said the boy had no siblings. The family recently moved to Marksville from Hattiesburg, Mississippi, he said.\nAt his news conference, Edmonson said he had no information about a warrant being served. The sheriff’s and district attorney’s offices said they had no pending warrants against Few.\nFew reached a dead end and was backing into the marshals when they fired, the coroner had said.\nLocal media has reported Few was seen at a bar, TJ’s Lounge in Marksville, arguing with a female friend shortly before the shooting. The bar is less than a mile from where the dead end where the shooting took place.\nA bartender at the lounge confirmed Thursday evening that Few left the bar shortly before 9 p.m. after playing pool with friends, heading out to pick up his son. But he said nothing happened there that might have led to the shooting. He declined to be identified by name.\nEdmonson said investigators received a short written statement from the marshals. He said the marshals stated that the vehicle they shot at was backing up into them. But he declined to provide more details. He added that the marshals now have lawyers.\nThe city marshals work for the city courts and serve warrants, carry firearms and have police powers, according to a city judge, Angelo Piazza, describing their powers as akin to a sheriff in that community."}