{"uri": "http://www.miamiherald.com/news/local/community/miami-dade/homestead/article50776055.html", "title": "5 shot, 1 killed in Goulds grocery store lot", "dct": "Sun, 20 Dec 2015 13:05:00 GMT", "id": "d01e91ff3db7dbda8f164df69213cd47", "content": "One man was killed and four others were wounded in a drive-by shooting in the parking lot of a South Miami-Dade grocery market, Miami-Dade police said Sunday.\nRaheem Shannon, 23, lost his life in Saturday night’s shooting outside Davis Grocery, 21630 SW 130th Ave. in Goulds.\nHis mother is making funeral arrangements as Christmas approaches.\n“It’s just sad right now,\" Alicia SHannon told Miami Herald news partner CBS4 .\" I’m trying to stay strong for my family but it’s hard.\"\nHer son was shot about a block from home\nPolice said a newer model silver car passed by the five men and someone inside the vehicle started shooting, striking all of them. The wounded — Jermaine Lee, 26; Cedric Lyons, 33; Rosseny Lustin, 49, and Tawaig Perpall, 27 — were taken to Kendall Regional Medical Center Center and Jackson Memorial Hospital’s Ryder Trauma Center.\nMiami-Dade police got the call at 11:15 p.m. Saturday. The car was described as “possibly” as Chrysler 200 with tinted windows and a missing passenger side window. Police said they have no motive.\nMohammed Iqbal, who works in the store, said the store was opened during the shooting. Video footage of the parking lot was handed over to police, Iqbal said.\n“People hang out in the parking lot all the time,” he told the Herald.\nFamily members told CBS4 that 23-year-old Raheem Shannon was expecting his first child in five months with his girlfriend.\n“He was just in the wrong place at the wrong time,” said Alicia Shannon.\nSadly this is the second time this year that Alicia SHannon is burying one of her children. She said her 24-year-old daughter, Ebeny Nesmith, was shot near the same convenience store less than six months ago.\n“I want justice served,\" she said. \"You need to come forward and do time for the crime you did. You took an innocent person’s life.”"}