{"uri": "http://dfw.cbslocal.com/2016/05/03/parents-to-voice-kimball-h-s-safety-concerns-at-superintendent-meeting/", "title": "DISD Blames Kimball Shooting On “Breach Of Security”", "dct": "Tue, 03 May 2016 06:47:00 GMT", "id": "914c9515dc9397b2746f2ab16145dea1", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nDALLAS (CBSDFW.COM) – Police with the Dallas Independent School District explained that a “breach of security” made it possible for a student to bring a loaded pistol into Kimball High School on Monday. The teen accidentally shot himself while on campus, and the incident now has some parents wondering what is being done to make sure that an incident like this does not happen again.\nClasses started on Tuesday morning without a hitch. But, a police car was parked in the driveway of the campus, extra officers were on hand, and there were many nervous parents voicing concerns about student safety. Superintendent Michael Hinojosa will be at Kimball High School on Tuesday night, meeting with parents and giving them a chance to ask questions.\nThe meeting was already planned, but was originally scheduled to discuss student achievement. The tone may change after the gun scare on Monday.\nAccording to DISD police, the 15-year-old had a small derringer pistol in his front pocket. It went off, and the bullet struck the teen in the hand and the leg. His injuries are serious, but not life threatening.\nPolice stated that the student with the gun arrived on campus after the school day had begun. He had come to the school with his mother for an unplanned parent-teacher conference. After reviewing surveillance camera video, the district chief said that the metal detector was working properly. However, somebody watching the detector either failed to conduct a more thorough check of the student after it sounded, or let their guard down because the teen was accompanied by a parent.\nThe school was briefly locked down Monday and students were told to “shelter in place” until the campus was secured. When word spread of a shooting, many parents went to the school worried about their children. “This changes a lot of things for a lot of parents,” said mother Eva Alejandro. “Really, how safe are our children?”\nSo far, it is not known why the teen had a loaded gun in the first place. “We’re doing something called victimology — the things that led up to the incident that took place yesterday, what was going on in that student’s life in those days leading up to why he brought this gun on the campus,” said Chief Craig Miller with the DISD Police Department. “I think we’ll have a better idea.”\nWhile authorities are calling this an accidental shooting, parent Lashell Booker believes that the teen may have had an ulterior motive. “It’s not an accident,” she said. “I’m thinking, ‘What are his intentions? Why was the gun in his backpack?'”\nThe community conversation with Hinojosa will take place at 6:00 p.m. on Tuesday night at Kimball High School, located at 3606 South Westmoreland Road. Officials are expecting a big parent turnout."}