{"uri": "http://www.miamiherald.com/news/local/crime/article126993209.html", "title": "MLK Day shootings of 8 people in park sparked by rival gangs, police say", "dct": "Tue, 17 Jan 2017 12:52:00 GMT", "id": "db160482731676ab26c193fdac7b6f8b", "content": "The gunfire that caused chaos at a Brownsville park and left eight people shot during a Martin Luther King Jr. Day celebration was an exchange between rival gangs, police said Tuesday.\nAnd all eight victims, ranging in age from 11 to 30, were simply in the wrong place at the wrong time, investigators believe.\n“All the people struck by rounds were innocent bystanders,” Miami-Dade Police Director Juan Perez said.\nTuesday, a day after the carnage at Martin Luther King Jr. Memorial Park, some of the victims came forward and shared their experience, while community leaders met at the park to express their outrage and beg anyone with information to come forward.\nRemarkably, all the shooting victims survived. Police said only one person who was shot was in critical condition. Yet Tuesday, 20-year-old Gerome Battle was well enough to address the media from his hospital bed at Jackson Memorial Hospital.\nBattle was shot in the buttocks, with the bullet coming to rest near his bladder. He underwent surgery Monday.\n“I took off running and after that the second shot hit me in the butt. I kept running and put my hand behind me and seen the blood on my hand. I just told somebody to help me, help me,” Battle said. “My stomach hurts. They put staples in it. But I’m going to be OK.”\nREAD MORE: Eight people shot following parade\nShawnteri Wilson, 18, led the procession back into Martin Luther King Jr. Park on Tuesday. She leaned on crutches, her left knee taped. A bullet had ripped through the back of her knee and came out the front.\nBehind her, a gaggle of police brass, politicians and preachers followed.\nfacebook twitter email Share\nMLK Day park shooting victim thought her life was over\nShawnteria Wilson, who was shot in the leg, talks to the media at a press conference at Miami-Dade’s Martin Luther King Jr. Memorial Park on January 17, 2017. Wilson was one of the victims after a day of celebration was marred when eight people were shot\nCharlie Trainor Jr. Miami Herald\n“I didn’t see much,” she said. “I just saw a guy with a black shirt and a jacket. I just want someone to come forward.”\nThe shooting began just before 4 p.m. Monday near the playground area of the park at Northwest 62nd Street and 32nd Avenue. Hundreds of people were there in what has become an annual event after the MLK parade, eating and listening to music.\nThe gunfire near an open field in the park’s south end caused a mad scramble. Some were injured during a stampede to get out of the park and others were scraped and burned diving under benches.\nfacebook twitter email Share\nFather reacts to shooting during MLK Day celebration\nStern Ferguson III reacts after shots rang out during the celebration following the annual Martin Luther King Jr. parade in Liberty City.\nStern Ferguson III via Facebook\nAfter a few hours, police finally determined that eight people had been shot. Five of them were 17 and younger, two of whom — an 11-year-old girl and a 13-year-old girl — were treated at the scene and released to their parents.\nOf the six other victims, police said Battle received the most serious wound. Also shot but in stable condition were Wilson, Alfanesha Times, 17, Michael Clarke, 30, Nakya-Senat Butler, 15, and Lajada Benson, 14.\nOn Tuesday, during the press conference in the park, police said they were looking for two black males, both 18 or 19 years old. One was said to be thin with a short haircut and wearing black jacket and khaki pants. The other wore a red shirt and had shoulder- length dreadlocks.\nMiami-Dade Crime Stoppers has upped the reward for information leading to an arrest and conviction of the shooters to $21,000.\nMonday afternoon, within a couple of hours of the shooting, police took two men into custody for questioning. Later in the day they were arrested on weapons charges that police said were unrelated to the shootings.\nTavarius Flowers, 29, and Alexander Brito-Peralta, 28, were charged with carrying concealed weapons. Flowers was also charged with child abuse.\nPolice said they recovered a 9mm Taurus Millenium semi-automatic handgun. Flowers told police he grabbed his gun from his waistband when he heard gunshots and stuck his three kids under the playground set.\nBrito-Peralta was taken into custody, police said, after officers noticed a gun in his waistband. Police said they haven’t ruled out the two being involved in the shootings; they just haven’t yet gathered enough evidence to charge them.\nThe shooting took place just a few hours after civil rights leader U.S. Rep. John Lewis, spoke at the 5000 Role Models of Excellence Project in Miami and urged the audience to “never, ever hate.”\nfacebook twitter email Share\nU.S. Rep. John Lewis makes inspiring speech on MLK Day\nYoung men in the 5000 Role Models of Excellence program received a powerful and inspiring message from U.S. Rep. John Lewis, of Georgia, during their breakfast ceremony on MLK Day. Lewis, who was recently lambasted by President-elect Donald Trump, made no\nEmily Michot emichot@miamiherald.com\nMiami wasn’t alone in gunfire ruining what was supposed to be a day of celebration and remembrance of one of the nation’s great leaders, the Rev. Martin Luther King Jr.\nIn Jacksonville, two teens were shot and one was killed during a shooting at Jacksonville Landing after the parade there had ended. And in Hallandale Beach, one man was killed and two others were injured after gunfire erupted near the route of that city’s Martin Luther King Day Parade.\nThe shootings in Miami-Dade on Monday also brought back fresh memories of another bloody day in the county, 20 years ago. That day, 5-year-old Rickia Isaac was killed by a stray bullet while walking home from the MLK Day Parade.\nThe bloodshed spilled Monday at the park has reinvigorated a fight against youth gun violence that has been waged in Miami-Dade over the past decade. A Miami Herald investigation last year showed that 316 teens and children were lost to gunfire in the decade from 2007 through 2016.\n“Gunshots rang out in a playground where children were playing. And this is unacceptable,” said Miami-Dade Mayor Carlos Gimenez. “It takes all of us to protect all of us. There were hundreds of people in the park during the shooting. People know what happened and we’re asking them to come forward.”\nBattle, who’s likely to spend more than a week in the hospital, said he attends the parade every year and going to the park has become a tradition. He’s a nursing student who said he was shot in the leg a few years ago — also by a stray bullet. He said this time he saw two people throwing punches at each other, then start shooting.\nThen, “We all ran our separate ways,” he said.\nfacebook twitter email Share\nShots disrupt MLK Day celebration\nMiami-Dade Police blocked off NW 32nd Avenue from NW 62nd St and several blocks south after shots were fired during the MLK Holiday near Martin Luther King Jr. Memorial Park in Liberty City.\nCarl Juste cjuste@miamiherald.com"}