{"uri": "http://abc13.com/news/one-dead-after-shooting-in-se-houston/1434506/", "title": "Two men in custody after fatal SE Houston shooting", "dct": "Wed, 20 Jul 2016 00:00:00 GMT", "id": "5653f5c63b159a01e4a383baeab60bf0", "content": "HOUSTON (KTRK) --\nHouston police say it's a tragic case of mistaken identity, when a 33-year-old man was shot and killed in the Third Ward Wednesday morning.\nTwo people are now in custody after the shooting on Napoleon Street and Rosalie Street.\nCrime scene tape blocked the intersection of Rosalie and Napoleon, a few blocks from University of Houston's campus.\nNeighbors, friends and family took in the scene many described as \"all too familiar\" as police investigated.\nIt was just before 4am when shots rang out.\nFriends identified the man killed as Demarcus Tucker. He died before paramedics arrived.\n\"The violence has got to stop. The crime has got to stop,\" said neighbor, Tekia Wilker.\nPolice say Tucker was not the killer's intended target.\n3rdWard residents look on as police continue investigating. Man shot, killed off Scott St #abc13 pic.twitter.com/8Ml3GdGpMO\n— Courtney Fischer (@CourtneyABC13) July 20, 2016\n\"There was a possibility this was a mistaken identity,\" said HPD, Thomas Simmons.\nInvestigators believe the shooter was after someone he made a drug deal with hours earlier, not Tucker.\n\"There was some kind of drug transaction that went on that didn't happen quite the way it was supposed to happen,\" Simmons said. \"Very tragic scene, unfortunately.\"\nPeople in the Third Ward say they're not surprised to hear about another deadly shooting.\n\"They are killing all the children,\" said Glen Olezene, who lives nearby.\n\"It doesn't make sense. Everybody fighting against each other instead of helping each other,\" said Wilker.\nBut how much can one family take?\nTucker's younger brother was killed two weeks earlier. Daquarius Tucker, 19, was one of five people shot on July 4th during a block party in the Fourth Ward. So far, no arrests have been made in that case.\nOne man was arrested this morning, less than a mile from where Demarcus Tucker was gunned down.\nOriginally, two people were taken into custody but police say it's likely only one will be charged with Tucker's death. That man's name has not been released yet.\nWe're following this story on Eyewitness News. Watch for updates on air, online and on our mobile news app.\nKeep checking back on this page to get real-time updates as this story unfolds. To get alerts for breaking news, download the abc13 news app for iPhone or Android. You can also get breaking news alerts sent to you by email."}