{"uri": "http://wavy.com/2016/06/21/police-investigating-after-three-people-shot-in-norfolk/", "title": "17-year-old killed in Norfolk shooting that injured two others", "dct": "Tue, 21 Jun 2016 03:35:00 GMT", "id": "350335ac9f445944b50a2487ca5effb8", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nNORFOLK, Va. (WAVY) — Norfolk police say a 17-year-old was killed and two others are in the hospital after a triple shooting near Military Circle.\nOfficers tell 10 On Your Side they responded to a 911 call just after midnight Tuesday. Paramedics say they found two males at the scene on North Military Highway near Poplar Hall Road with gunshot wounds.\nThey took both victims to Sentara Norfolk General Hospital. One man is expected to survive, but detectives say 17-year-old Don Demetrius Brown, Jr. died at the hospital.\nBrown’s friends and family stopped by the scene Tuesday afternoon.\nA 16-year-old girl said she had spoken to him a few hours before he died. WAVY.com is not using her name because she is a minor.\n“I don’t understand why he wasn’t home, what he could have been doing right here at that time of the night,” she said. “I don’t know. But hopefully, we’ll get some type of answers.”\nThe girl remembered her friend as a fun, loving person who danced everywhere he went.\nBrown’s cousin, Keron Green, said he boxed with Brown, and that the teenager wanted to become a longshoreman.\n“He was a very loving person, a good spirit, fun to be around,” Green said. “He wanted to be better than what he was.”\nMoments after Brown and the other victim arrived at the hospital, a third gunshot victim, a woman who had also been injured in the shooting, came to Sentara Leigh Memorial Hospital. Police say she is expected to survive, and they believe she was a bystander.\nPolice officers handcuffed a man at the scene, and confirmed they brought him in for questioning. They have not said whether he is a suspect, or if they’re looking for anyone else.\nOfficers were on scene investigating for more than six hours.\n10 On Your Side is working to learn the latest in Norfolk Police’s investigation into this shooting. Call the Crime Line at 1-888-LOCK-U-UP if you know anything that could help them.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}