{"uri": "http://wavy.com/2016/06/25/family-hosts-vigil-for-teen-killed-in-triple-shooting/", "title": "Family hosts vigil for teen killed in triple shooting", "dct": "Sat, 25 Jun 2016 23:41:00 GMT", "id": "aab81b8ae528d7f8b4c192a4786a0170", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nNORFOLK, Va. (WAVY) – A Norfolk family will hold a funeral Monday for a teenager killed this week in a triple shooting.\nDozens of people who knew 17-year-old Don Demetrius Brown Jr. met Saturday night, not far from where he lost his life off Military Highway.\n“I pray for anybody else out there who’s going through the same thing that I’m going through, and I just pray that it don’t continue,” said Brown’s mother, Bonaravia Green.\nGreen and her mother addressed the community, saying it’s not too late for change.\nPolice said shortly after midnight Tuesday medics found two men shot near Poplar Hall Road. Brown died at the hospital. The other man and a woman who was injured were expected to recover.\n“It’s gotta stop somewhere. Someone has to put an end to this violence,” said Brown’s grandmother, Gwendolyn Bailey.\nIt’s not clear what led up to the shooting. Following the recent acts of violence, religious and community leaders in Norfolk called an emergency meeting at The Way of the Cross Church Saturday.\nCommunity leader Bilal Muhammad said people need to lay the issues on the table.\n“Let’s tackle with the source it’s coming from. The drugs, the violence, the gangs, the illegal drugs, the illegal guns that’s perpetuating our community, that’s bringing about a more bad example for our grandchildren,” he said.\nThe family ended the gathering by releasing 17 balloons, one for each year the teen lived.\nPolice have not released any information about suspects in the case.\nNewport News police have been asking the community to start turning in…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}