{"uri": "http://www.wvnstv.com/story/23520830/update-suspect-in-huntington-wv-shooting-which-injured-6-apprehended-in-ny", "title": "Suspect in Huntington, WV shooting which injured 6 apprehended in NY", "dct": "Wed, 25 Sep 2013 01:23:00 GMT", "id": "60cdbb0803e73ce3069bfd89472b9207", "content": "HUNTINGTON, WV -\nUPDATE:\nDetectives with the Huntington Police Department say Antonio Michael Smith is now in custody.\nAccording to a release issued by the Huntington Police Department, Antonio Michael Smith was arrested without incident in Brooklyn, New York by the FBI New York Swat Team.\nThe release says Smith was arrested on six counts of malicious wounding and one count of wanton endangerment in conjunction with the recent shooting in Northcott Court on September 24, 2013.\nSmith was also arrested on two Task Force Federal Indictments for Felon in possession of a firearm and distribution of heroin.\nAccording to the release, the apprehension of Smith was a combined effort of the Huntington Police Department, FBI Huntington Violent Crime Drug Task Force (consisting of the Huntington Police Department, Cabell County Sheriffs Dept., West Virginia State Police, and the Barboursville Police Department), and the FBI New York Office.\n_____\nUPDATE:\nWarrants have been signed in the Northcott Court shooting from Tuesday evening in Huntington. Antonio Michael Smith, 31, is wanted for six counts of malicious wounding and one count of wanton endangerment. Smith is originally from Columbus, Ohio, according to Huntington police, but has resided in the Huntington area for several years.\nAnyone with information about where Smith might be is asked to contact the Huntington Police Department tip line at 304-696-4444 or 911.\n_____\nUPDATE:\nHuntington police say the shooting took place at a courtyard near Northcott Court Community Center and started because of an altercation. Victims have not told police what prompted the altercation.\nOne of the victims collapsed at the scene while the rest ran to the Huntington Mart on Hal Greer Boulevard. EMS transported the collapsed victim to St. Mary's Hospital while the other five victims were taken to the hospital by friends.\nAccording to a release from the Huntington Police Dept., they recovered two guns from the scene of the shooting. Police have discovered both guns were stolen after trying to trace the weapons. Police say they found one gun at Northcott Court, where the shooting happened, and one gun behind Huntington Mart.\nTwo of those victims remain in the hospital for treatment. All of the victims received non-life threatening gun shot wounds to their lower bodies.\nThe victims have been identified as:\nJamal R. Tubbs, 21 from Huntington\nAndre Maurice Branch, 36, from Huntington\nSemaj Markes Leondre Figg, 22, from Huntington\nDwight McVernon Green, 23, from Huntington\nJayron Antonio Washington, 19, from Huntington\nMaurice LaVelle Miller, Jr., 23, from Columbus, OH\nTubbs and Branch remain in the hospital and are expected to recover. None of the victims live at Northcott Court Housing Complex.\n_____\nUPDATE:\nFour of five gunshot victims have been treated and released from Cabell Huntington Hospital. The fifth victim is in stable condition. Another victim is at St. Mary's hospital.\nDetectives said they have recovered a second gun from the Marathon Station where the shooting took place.\nPolice are not sure if the gun belongs to a victim or a second shooter.\nThe victims are not cooperating with the investigation, police said.\nPolice believe an argument started along Northcott Court and spilled into the courtyard of the housing complex. Six people were shot. Many of the victims ran across the street to the gas station for safety.\nNeighbors said the gun violence in the area is getting out of hand.\n\"When you're used to this area, you're used to hearing gunshots and stuff. That's what freaks you out; you have to watch your back,\" one man said.\nThere are a lot of families who live in the housing complex where the shooting took place. Parents tell 13 News they keep their kids inside.\n\"The families stay locked in their house while the drug dealers run the neighborhood,\" a father said.\nNo arrests have been made. Police are waiting to review surveillance footage from the area.\n_____\nUPDATE:\nHuntington police have not made any arrests in connection to the shooting.\nLt. John Williams with the Huntington Police Department said some witnesses are not fully cooperating with the investigation. He says the victims in the case will be the key to solving it.\nWe will bring you updates as details become available.\n_____\nUPDATE:\nHuntington police have now confirmed that six people have been injured in a shooting incident at 31 Northcott Court in Huntington, WV.\nFive people are being treated for gun-related injuries at Cabell Huntington Hospital. The sixth victim was taken to St. Mary's hospital to be treated.\nAuthorities believe there is only one person who fired shots. They do not have a description of anyone involved. However, witnesses told investigators that they heard numerous gun shots fired in the area.\n_____\nUPDATE:\nHuntington police have now confirmed the shooting incident started in the apartments located at 31 Northcott Court.\nIt then spilled over in to the street and ended up at the Marathon Gas Station on Hal Greer Boulevard.\nEarlier reports indicated there were five victims shot. Police are now saying there could be more victims.\nSeveral law enforcement agencies have responded to the scene including; The West Virginia State Police and DNR.\nLaw enforcement officials have confirmed a gun and magazine believed to be involved in the shooting were found at the scene.\nThey have also questioned several people but no arrests have been made at this time.\n_____\nUPDATE:\nA shooting has injured five people in Huntington, WV. Cabell County 911 dispatchers say the shooting happened about 8:45 p.m. in the area of 31 Northcott Court.\nOne man, shot in the hip, was taken to the hospital via ambulance. The other four victims drove themselves according to emergency officials at the scene.\nAuthorities say the incident started at the Marathon Station on Hal Greer Boulevard and then moved to the apartment complex located on Northcott Court.\nPolice do not have a suspect in custody at this time."}