{"uri": "http://heavy.com/news/2016/02/fredrick-lochridge-izabella-heffernan-florida-teen-murder-kill-sister-white-dress-shooting-facebook-photos-mother-michele/", "title": "Fredrick Lochridge: 5 Fast Facts You Need to Know", "dct": "Tue, 23 Feb 2016 23:22:00 GMT", "id": "a0250e7b3d6d6293ebf19a4d3cb89397", "content": "A 15-year-old Florida boy is accused of shooting his 10-year-old sister to death and then dumping her dead body in the woods, police say.\nFredrick Lochridge was arrested Sunday in the death of Izabella Heffernan, who was reported missing earlier in the day, the Bay County Sheriff’s Office said.\nThey have not ruled out the possibility the girl was sexually assaulted before she was killed, Sheriff Frank McKeithen said Monday at a press conference. An autopsy will be conducted and the investigation is ongoing.\nLochridge is charged with second-degree murder. The case will be brought before a grand jury, where a first-degree murder indictment can be sought.\nHere’s what you need to know:\n1. He Shot His Sister Twice & Put Her in a White Dress Before Moving Her Body, Police Say\nThe Bay County Sheriff’s Office says Izabella Heffernan was reported missing Sunday by her father, Fredrick Lochridge. According to the arrest affidavit, her body was found in a wooded area in a white sundress and covered by multiple towels.\nHer family was taken in for questioning, including Lochridge.\nYou can read the full arrest affidavit below:\nDetectives said Fredrick Lochridge first admitted to shooting the girl with a .22 caliber rifle in the woods behind his house at about 3 a.m., mistaking her for a deer. He said he shot her in the chest and between the eyes, according to the affidavit. He said he first moved her body into a bus and then into the area where she was found, while hiding the rifle in an abandoned house.\nLochridge then changed his story, detectives said, telling them he saw someone attacking Izabella and accidentally shot her while trying to shoot them.\nHe then gave a third story, investigators said, claiming he was teaching her how to shoot the rifle early Sunday morning and accidentally shot her in the chest.\n“He thought it hit her in the lungs and stated ‘she started making gurgling noises, and I did not know exactly how to deal with that, so I shot her again.'”\nLochridge said he then moved her to the bus, “cleaned her body, and changed her clothes, changing her into a white dress.” He then moved her body to the woods.\nThe rifle was found in the abandoned house, investigators said.\n“We are not 100 percent sure we know exactly why this happened or exactly the chain of events which led to it, but we do know that the 15-year-old shot and murdered his sister,” Sheriff McKeithen said at a press conference, according to WJHG-TV.\n2. The Sheriff Called Him ‘Hardcore’ & ‘Like a 30-Year-Old Murderer’\nSheriff Frank McKeithen told reporters Fredrick Lochridge wasn’t a typical teenage boy.\n“I can tell you this, the 15-year-old boy was not your typical 15-year-old kid that you would see everyday on the street,” McKeithen said, according to WJHG-TV. “He was a hardcore kid. He lied. He was deceitful. He screamed. He cursed. He was like interviewing a 30-year-old murderer when we talked to him.”\nMcKeithen said the boy told deputies his sister was shot before they told him that. The sheriff also said that the boy’s father suspected him of having a role in her disappearance.\n“Apparently the father had already confronted the 15-year-old earlier in the day and thought there was a possibility he had something to do with the missing girl,” McKeithen said. “He had actually handcuffed this boy and brought him back to his house. He failed to tell us that when we originally arrived, and we had no idea that had happened. We had no idea the 15-year-old was a suspect at that time.”\n3. Deputies Dealt With the Family a Few Years Ago When They Were Living in ‘Horrible’ Conditions\nThe Bay County Sheriff’s Office has dealt with the family in the past, Sheriff Frank McKeithen said at Monday’s press conference.\n“About four or five years ago, one of our deputies discovered a family living there in a house,” he said. “There was about six kids, and a man and woman actually living there. The living conditions were absolutely horrible. It was freezing cold, not a lot of heat. We actually took a bunch of the deputies up and worked on the house and tried to get it to where they could have some heat and water and things of that nature.”\nIzabella Heffernan was a student at Waller Elementary School. Lochridge attended C.C. Washington Academy.\n4. He Has Several Posts Related to the Marines on His Facebook Page\nLochridge appears to have an interest in the U.S. Marines, as he has several logos and photos related to the Corps on his Facebook page. He also has photos in a camouflage shirt.\nPhotos on his father’s Facebook page show him on a hunting trip in a wooded area, carrying a riffle. His father is also named Fredrick Lochridge.\n5. His Mother Is Serving 30 Years in Prison in Connection With the Murder of Her Boss\nFredrick Lochridge’s mother is currently serving 30 years in prison in connection with the murder of her boss. Michele Lochridge was convicted of being an accessory after the fact to murder in the 2011 killing of Ashley Pollow, TCPalm.com reported.\nMichelle Lochridge’s boyfriend, Thomas Barnard, was sentenced to life in prison for the murder. He said he killed Pollow, a 58-year-old tax attorney, because he planned to turn in Michelle Lochridge for stealing from him.\n“Thomas Barnard also stated that he and his girlfriend wanted to take over Ashley Pollow’s business and this would be a great way to do it,” police said.\nLochridge was present when Barnard poured drain cleaner on Pollow’s body to dispose of it, police said.\nShe was also arrested in 2000 after her son’s birth for using someone else’s identity and insurance to pay for the hospital bills related to her pregnancy, according to a Sun-Sentinel article from the time."}