{"uri": "http://thepolicenews.net/default.aspx?act=Newsletter.aspx&category=News+1-2&newsletterid=65327&menugroup=Home", "title": "Investigation of Dallas police ambush still incomplete", "dct": "NODATE", "id": "a93d0ad44ca1655a2c9315d5d72fd700", "content": "There are still unanswered questions about the July attack that detectives hope to answer during the investigation\nThe Dallas Morning News\nDALLAS — In many ways, the Dallas Police Department is stronger six months after the July 7 ambush in which officers were killed, but there are still unanswered questions as detectives pick away at the investigation into the attack.\nThe officers were protecting demonstrators protesting police shootings of black men around the country when Micah Johnson opened fire around 9 p.m. July 7. In the initial chaos, police believed there was more than one shooter.\nSeveral hours later, former Dallas Police Chief David Brown ordered officers to use a remote-controlled robot armed with explosives to kill Johnson, who was holed up in El Centro College.\nInvestigators quickly determined that Johnson was the only shooter. They sorted through bullet casings spread across a big downtown crime scene. They reviewed dashcam and surveillance video and 170 hours of body-camera footage. They interviewed the 11 officers who fired their weapons that night and the two officers who used the explosive device that killed Johnson.\nAnd that investigation continues. The FBI is still processing evidence. When that's finished, Dallas police detectives will review it before sending the case to the Dallas County district attorney's office.\nA grand jury will hear the case and determine whether criminal charges are necessary against the officers who fired their weapons and deployed the robot on July 7. It's a routine procedure in all shootings involving police.\nBut there are still many questions that remain unanswered about the ambush and police response to it: What types of guns did Johnson use? What exactly did Johnson say during 4 { hours of negotiations with police? How many explosives did Johnson, who claimed to have booby-trapped downtown, have in his home? How did police use a robot, armed with C-4, to kill Johnson?\nDallas police aren't ready to discuss such details.\n\"The investigation of the attack is enormous in its scope and several federal agencies have assisted in the gathering and processing of all types of evidence,\" Deputy Chief Thomas Castro said in a written statement. Castro is overseeing the investigation.\n\"As the investigation is not complete, it is not appropriate for the Dallas Police Department to formally discuss the incident,\" he said. \"However, we are looking forward to the day when we can fully brief our officers and the public on the events of that day.\"\nThe officers killed that night were: Brent Thompson, a Dallas Area Rapid Transit officer; Dallas police Sgt. Michael Smith; Senior Cpl. Lorne Ahrens; and Officers Michael Krol and Patrick Zamarripa."}