{"uri": "http://www.wfaa.com/news/dallas-shooting-victim-shares-powerful-recount-of-attack/268752748", "title": "Dallas shooting victim shares powerful recount of attack", "dct": "Mon, 11 Jul 2016 00:00:00 GMT", "id": "bcdb889b7c46a92cb546fe0d3a8e59fe", "content": "DALLAS - One of the civilians shot during Thursday's deadly ambush in downtown Dallas shared her account of the tragedy during a press conference.\nShetamia Taylor broke down in tears while sitting alongside her doctors and family Sunday at Baylor University Medical Center. She was shot in the leg and is expected to make a full recovery.\nTaylor began by thanking the Dallas Police Department, \"I want to say thank you to the officers who watched over me and my son during that time... They were really heroes for us.\"\nFour of Taylor's sons were with her during the press conference. She said that as a family, they had decided to attend the Black Lives Matter protest in downtown Dallas because she wanted to show them \"that we can be unified and that it can be a peaceful march.\"\n\"Being a mother of five young black men, I sat down with my kids when I came home from work on Thursday and we talked about everything and I talked to them about how they needed to comply if, for whatever reason, they were ever stopped by the police... Comply, be respectful of self, of them,\" said Taylor.\nWhen Taylor and her family were ready to go home after the protest, they heard the first shot ring out. The second shot hit a police officer, who yelled at them, \"he has a gun, run!\"\nTaylor and her boys were running when she says that she felt the bullet hit her in the back of the leg. She grabbed her son Andrew and laid on top of him behind a car. Officers realized that Taylor had been hit and surrounded her and her son.\nThrough tears, Taylor said \"And then, I saw another officer get shot... Right there in front of me. That was two.\"\nThe officers put Taylor and her son in the back of a police car to take them to the hospital. Taylor said that the back of the car was riddled with bullets and that by the time they made it to the hospital, the tires were completely deflated.\n\"I'm sorry that it happened. I'm sorry that that person thought that that would be OK, or that he thought it would solve something... I'm sorry, I'm sorry, I'm so sorry that they lost their lives. But I'm thankful, I'm so thankful,\" said Taylor.\nTaylor found out later that her three other sons were unharmed but that an officer had died.\n\"I'm celebrating my kids being alive and I'm listening to them telling each other how the officer didn't make it...\" Taylor said through tears.\nTaylor's doctors also discussed her condition and treatment.\nWhen asked about the current state of national affairs and the aftermath of the shooting, Taylor responded, \"It's disheartening. I'm angry and I'm frustrated because of course we want action, but you have to think first before taking that action. I don't know what's going to happen but I'm not going to stop. I want my community to be unified, I want my people to be unified, I want all of us to come together.\"\nA second civilian was shot during the ambush but police have not released information on their condition.\nA GoFundMe account has been set up to help pay for Taylor's medical expenses and to assist her family during this difficult time. If you'd like to donate, click here."}