{"uri": "http://lasvegassun.com/news/2016/dec/15/boys-mother-aclu-want-answers-in-reno-campus-shoot/", "title": "Boy’s mother, ACLU want answers in Reno campus shooting", "dct": "Thu, 15 Dec 2016 00:00:00 GMT", "id": "5458048ab5299f55f58977a48e4b8cef", "content": "RENO — The American Civil Liberties Union of Nevada joined those pressing school district officials in Reno Thursday for more information about the circumstances and policies that led to a campus officer shooting a 14-year-old boy in a high school courtyard a week ago.\n3 Fatigue-Causing Foods\nBoost your energy level every day by never eating these 3 foods\nhaveenergyatanyage.com\nCheryl Pitchford, the mother of the hospitalized boy, was among 100 of his classmates, friends and family who marched to Washoe County School District headquarters on Wednesday to deliver a petition demanding all campus police carry Tasers and pepper spray.\nReno police say the boy was threatening others with knives when a school district officer shot him in the chest Dec. 7 while surrounded by dozens of students.\nSchool district officials have refused to say if their campus officers typically carry non-lethal weapons. They say they can't comment while an investigation continues into the officer-involved shooting that many Hug High students captured on cellphone video and posted on social media.\n\"There had to be another way,\" said Pitchford, whose last name is different than that of her juvenile son.\nDavid Houston, the boy's lawyer, said the teen had been bullied and beaten before he brought two kitchen knives to the school for fear he'd be attacked again and ended up getting shot by the campus officer.\nHolly Welborn, policy director of the Nevada ACLU, said law officers have a duty under state law to use only the degree of force necessary to maintain community safety.\n\"We intend to review the use of force, emergency and bullying policies of the Washoe County School District and monitor developments as the Reno Police Department's investigation of this matter continues,\" Welborn said Thursday after submitting a public records request to the school district.\nThe boy remained in critical but stable condition on Thursday. Houston said earlier he was in a medically induced coma after undergoing surgery following a stroke on Friday.\nDemick La Flamme, the father of a friend of the teen who was shot, organized Wednesday's march.\n\"Lethal force should not be used as a first response — ever. Especially into a crowd of children,\" La Flamme said before they began the 2-mile trek escorted by Reno police cruisers and a half-dozen officers on bicycles. \"If you take any 82-pound, 14-year-old boy and hit him with pepper spray, he's going to hit the ground.\"\nPitchford, La Flamme and more than a dozen others later jammed into the reception area at the school district headquarters to demand someone formally accept the petition. She showed school officials a cellphone photo of her son with an oxygen mask and other tubes in a hospital bed while pleading for School Superintendent Traci Davis to come forward and better explain what had happened.\nDavis told reporters the day after the shooting that the school's emergency response plans worked \"flawlessly\" and praised the officers' \"who acted swiftly to protect the safety of our students.\" She's had no comment since she said in a statement Friday that she still believes \"the officer's judgment saved other students from deadly force.\"\nPitchford said isn't seeking an apology from the superintendent.\n\"She wasn't there. It's not her fault,\" Pitchford said. \"It's her fault for not coming out and saying maybe that there was another way, or maybe it was not flawless — like she said in her news conference ... Because she wasn't there. She didn't know.\"\nIrene Payne, the school district's chief of communications who accepted the petition, said she couldn't comment on the equipment campus officers typically carry. She hugged Pitchford before the group left the office.\nLike officers on the campus of the University of Nevada, Reno, school district police are separate from the Reno Police Department but —like their counterparts — are authorized to carry guns.\nUNR spokeswoman Kerri Garcia confirmed Thursday all their campus officers carry Tasers along with their service weapons. She said pepper spray is optional."}