{"uri": "http://www.ktvn.com/story/33998944/police-hug-high-on-lockdown-after-report-of-shots-fired82", "title": "Reno Police Release Additional Information on Shooting at Hug High School", "dct": "Wed, 07 Dec 2016 19:42:00 GMT", "id": "9a497eb12db10a4d0ba631efdcc0875b", "content": "From Reno Police:\nOver the last two weeks, as part of the Regional Officer Involved Shooting Protocol, detectives with Reno Police, Sparks Police and the Washoe County Sheriff’s Office have interviewed over 100 individuals including, but not limited to, students and faculty at Hug High School.\nDuring the course of the investigation, police say it was learned the 14-year-old boy had brought knives to school on the days leading up to the incident with the intent to initiate an altercation with another student. The altercation with that student did not take place. However, on December 7th, immediately preceding the shooting incident, the 14-year-old was involved in an altercation with a different student. It was during this incident the teen produced two knives and caused a minor cut to the face of the other involved student. The injured student attempted to retreat, but the 14-year-old pursued him through a crowd of students and faculty while swinging the knives.\nAn on-campus School Police Officer was alerted about the fight involving knives and immediately responded to the incident. The officer contacted the teen and gave him multiple commands to drop the knives. Police say the 14-year-old acknowledged the officer’s presence, disregarded his commands, and advanced toward the officer while making challenging statements. The officer fired a single gunshot striking the 14-year-old and stopping the threat. The officer secured the knives and immediately rendered medical aid to the 14-year-old until emergency medical staff arrived on scene.\nMany of the details of this investigation have been corroborated by witnesses and cell phone videos of the incident which were taken by students.\nPreviously on Facebook, Justin Clark identified himself as the father of the boy, Logan Clark, who was injured during a shooting at Hug High School.\nThe incident happened just before 11:30 a.m. about the middle of the campus, during lunchtime, outdoors.\nRPD had previously said that the boy was threatening other students. On Facebook, Clark wrote that his son was bullied and that \"he brought the knives because he was gonna be jumped.\"\nAt last check, the student was still in critical condition. Justin Clark had wrote on Facebook that he has lost part of his lung but \"it looks like he is doing a lot better and will pull through,\" and that the family would know more in the coming days.\nWashoe County Sheriff's Deputies assisted Reno Police, along with state and federal law enforcement such as the FBI.\nAs part of the Regional Officer Involved Shooting (OIS) Protocol, Reno Police Robbery Homicide Detectives responded to the scene and will serve as the lead investigating agency with the assistance of the Sparks Police Department and the Washoe County Sheriff’s Office.\nOfficials say that no other students or officers were injured, and the officer, who was involved in the shooting, will be placed on paid administrative leave per the Washoe County School District Police Department’s policy.\nJustin Clark wrote that the family has hired an attorney and thanked everyone for the support they've received. His statements on Facebook can be seen at the bottom of this story. The attorney, David Houston, spoke to \"CBS This Morning\" and said “It was clear that the child was not being aggressive, but rather was trying to keep people away from him. He was not attempting to hurt people.\" Houston said the boy was showing signs of improvement before suffering \"a major stroke.\"\nA code red lockdown went into effect immediately after shots were fired at the school.\nThe Washoe County School District says an automated call was sent to parents informing them of the situation, and of the school lockdown.\nStudents were held on campus until a controlled release began several hours later. Irene Payne with the Washoe County School District told parents and reporters, \"Your children are our greatest asset. And we will protect them and we want to make sure that they're safe at all times.\"\nDuring a press conference, Superintendent Traci Davis thanked emergency service teams for their quick response, and that emergency plans \"worked flawlessly.\" Earlier she released a statement, which you can read in full at the bottom of this story.\nHouston disagreed saying, “The superintendent cannot possibly have a detailed investigation sufficient to make the pronouncement that the activities or actions of those people was, quote, flawless.”\nAuthorities say that all students were reunited with their parents before 4pm on Wednesday. Classes resumed on Thursday.\nThe police is urging anyone with video or photos to contact them, and to not share the information on social media.\nWCSD Board of Trustees and Superintendent Traci Davis said this during Thursday's press conference:\n\"The event that occurred at Procter Hug High School yesterday was heartbreaking for our Hug High family and community. As a parent, I understand the panic and fear felt by Hug parents.\nThis is a reminder of the value of life and the duty we have to protect the safety of our students and staff each and every day.\nI would like to commend our community and our families at Hug High School for remaining calm and supportive of our children during this difficult time. I have always admired their commitment, love, and care for their children and school family, and the events of yesterday only deepened my admiration.\nI also deeply appreciate the staff at Hug High School for their dedication to their students, and for their perseverance under such difficult circumstances.\nAs a District, our commitment to safety has never wavered. Our schools constantly practice, drill, improve, and refine our emergency procedures, and those practices prepared us well for yesterday’s events.\nEvery school has a safety plan that dictates clear roles for staff members. Every school has an emergency medical response team trained to react in a split-second. Yesterday at Hug High School, both of those plans worked flawlessly. And for that, we are all eternally grateful to everyone involved.\nI would also like to thank our dedicated officers with the Washoe County School District Police Department who acted so quickly to protect the safety of our students. Had it not been for their quick action and professionalism, I truly believe that the outcome could have been much worse.\nAnd I extend my heartfelt gratitude to emergency service teams throughout the county who responded to the situation within minutes. We applaud your work and dedication to keeping our students and community safe.\nAs a parent and an educator, I know how important it is that children be given ample opportunities to ask questions, talk about their reactions to the incident, and be reassured that they, their friends, and their families are safe.\nThe District has provided counselors and mental health services at Hug High School to help students, teachers, and staff cope with their feelings following yesterday’s events, along with extra staff members who have responded to the school to offer their support in a variety of roles.\nI want to thank our community for their numerous offers of help for our school family, because we are truly one family. We feel embraced and supported by our community.\nToday at Hug High School, our students, teachers, and staff are back in the classroom, teaching and learning, just as they do every day in their pursuit of excellence. They are resilient and they are moving forward with their educational mission. In fact, I can report that 100 percent of the staff showed up today.\nI trust that you will give them the privacy and respect they deserve as they resume their studies in the wake of yesterday’s events. I can assure you that we are providing them with the support and help they need to accomplish their goals.\nThis concludes my statement. I know you will understand and respect the fact that I cannot offer further information or answer questions today, as the formal investigation is still underway.\"\nOn December 7th, WCSD Board of Trustees and Superintendent Traci Davis released this statement\nDecember 7, 2016\nIt is our sad duty to inform you that our school family at Procter Hug High School is coping with a shooting that took place on campus today. A student is in the hospital, and a thorough investigation is underway. Reno Police detectives tell us they believe this was an isolated incident, and there is no ongoing security threat at the school.\nAlthough investigators are still gathering information and evidence, we do know that a disturbance was reported shortly before noon which resulted in a shooting. One student was wounded in the incident and was taken by ambulance to a local hospital for treatment. In the course of this incident, safety procedures that are consistently practiced District-wide were followed at both the school level and District level.\nOfficers with the Washoe County School District (WCSD) School Police Department responded immediately, and per the Regional Officer Protocol, contacted other law enforcement agencies for assistance with the case. These agencies include the Reno Police Department, Washoe County Sheriff’s Office, and the FBI.\nProcter Hug High School was immediately placed in a Code Red Lockdown, and officers began a classroom-by-classroom canvass of the school in an effort to find witnesses and any other potential victims in the case. The District reached out to families via the Connect Ed call system with information about the incident, the lockdown, and the fact that the school was secured during the investigation.\nApproximately three hours after the incident, the Code Red Lockdown was lifted, and students were released from the school under controlled, safe conditions. Another Connect Ed call was sent to families with information about reunification processes, and students were sent home from school without further incident.\nOn Thursday, Dec. 8, 2016, classes will be held as usual at Procter Hug High School. Counselors will be available for any student or staff member who needs assistance.\nThe Washoe County School District is committed to cooperating fully with the ongoing police investigation into the factors that led to this incident. Our hearts go out to the students, staff, families impacted, and we stand ready to assist them in any way needed.\nCBS contributed to this report"}