{"uri": "http://www.cbs5az.com/story/23928754/pd-1-dead-3-wounded-in-phoenix-party-shooting", "title": "Community demands justice for teen shot dead at Phoenix house party", "dct": "Sun, 10 Nov 2013 19:47:00 GMT", "id": "301496be0c5d4d3b64eb4e75351571b6", "content": "Phoenix police have identified the 19-year-old victim of a deadly shooting that happened at a house party on the city's southwest side.\nNora Osman died as a result of the shooting Saturday night at 5800 South 53rd Glen, said Phoenix police Sgt. Trent Crump. Three others, an 18-year-old woman and two men, ages 21 and 22, were treated for wounds and released.\nOn Sunday night, dozens from the south Phoenix community marched to where Osman was killed to remember her life and demand justice.\n\"She was a great person,\" Osman's sister, Radwa Osman, said. \"She didn't deserve to die.\"\nPolice say the shooting happened as a house party of more than 100 people was breaking up and some kind of altercation occurred. They said shots were fired from multiple directions.\n\"[The shooting and altercation] had nothing to do with her,\" Radwa Osman said. \"She was at the wrong place at the wrong time.\"\nAll of the victims were shot outside of the house and the suspects were believed to have fled in a vehicle; however, there were numerous vehicles leaving at the time, Crump said. It also appears that shots might also have been fired from someone on foot, he added.\nIn 2010, the city of Phoenix created a Community Engagement and Outreach Team, whose task was to work with police to curb violent crimes specifically in south Phoenix, the same area Nora Osman was killed.\nA member of that team, Shawn Pearson, said that group made significant changes but violent crimes like Saturday's shooting serves as a reminder that there's still progress to be made.\n\"[Teens] are doing these things out of ridiculous motives but they're doing them nonetheless,\" Pearson said. \"We've got to give them something to hope for.\"\nInvestigators have not released any suspect or suspect vehicle descriptions at this point.\nNora Osman's mother told CBS5 News her daughter was in college and studying to become a pediatrician.\nDeqa Osman is asking the community to help bring her daughter's killer to justice and for the violence to stop.\n\"I know whatever we do or whatever happens - it's not going to bring my kid back,\" she said. \"But, I don't want it [violence] to happen no more.\"\nThe Osman family is asking for donations to help with funeral costs. If you would like to donate, stop by any Chase Bank and give to the Nora Osman fund. The account number is 763187648.\nAnyone with information about the incident is asked to call the Phoenix Police Department or Silent Witness at 480-WITNESS OR 480-TESTIGO.\nFor more on this story and other stories, follow Shawn Kline on Facebook and Twitter.\nCopyright 2013 CBS 5 (KPHO Broadcasting Corporation). All rights reserved. The Associated Press contributed to this report."}