{"uri": "http://www.wdbj7.com/content/news/Lynchburg-shooting-victims-mother-seeks-answers-394022861.html", "title": "Lynchburg shooting victim's mother seeks answers regarding son's death", "dct": "Tue, 20 Sep 2016 04:33:00 GMT", "id": "28647e8a81de9db24e4c1fa6797da7b2", "content": "LYNCHBURG, Va. (WDBJ7) Outside a family home Monday, Valarie Turpin showed WDBJ7 the badge her son wore as the coach of a youth football team.\n\"He was a very, very talented and very smart young fellow,\" Turpin said.\nShawn Johnson volunteered with the R.S. Payne Dragons, a team made up of 11- and 12-year-old boys from his neighborhood.\nHe was passionate about sports.\n\"He loved his fishing, he loved his hunting, and he loved his dogs,\" Turpin said, standing composed by shaken following her son's death from an apparent drive-by shooting.\nJohnson was walking with friends along Rodes Street on Sunday morning, after leaving the JazzE Ellington night club. Police say someone pulled up in a vehicle and fired gunshots.\nFour people were hit, including Johnson. He died at a nearby hospital.\n\"I can't express how I feel right now, but I know he's looking down on us and standing right here beside us,\" Turpin said.\nJazzE was hosting a benefit concert for another young man who recently died. Turpin said her son was at the club to support the fundraiser, but she doesn't know why someone would want to kill him outside the event.\n\"If there is anyone out there that has anything to help the police like pictures, cell phone videos, or just talk on the street please come forward so that we can get justice done for my son,\" Turpin said.\nOne of the people shot here Sunday was taken to a hospital with what police call \"critical\" injuries. The other two were not seriously hurt.. No one has been arrested or charged in connection with the shooting.\nJazzE is hosting what it calls a \"Stop the Violence\" event this Thursday. The owner says she wants to get rid of myths about what happened here yesterday, and start an open conversation about violence in the city."}