{"uri": "http://www.komonews.com/news/local/Kent-Police-We-found-car-involved-in-fatal-shooting-of-infant-303342431.html", "title": "Kent police find car involved in fatal shooting of infant", "dct": "Mon, 11 May 2015 00:00:00 GMT", "id": "241b8d672b3b494c53b0792ba6c0c1a6", "content": "KENT, Wash. -- Kent police say they have located one of two cars that they were searching for in connection with the fatal shooting of a 1-year-old girl last month. Police say Malijah Grant was in the back seat of her parents' car when some kind of dispute erupted with two men in a black car. According to investigators, that black car pulled alongside and the driver and passenger opened fire, hitting Malijah in the head.\nKent Police Chief Ken Thomas said last week investigators believe the shooting was related to a series of 12 to 15 recent gang-related shootings in the Puget Sound region.\nLast Monday, investigators released still photos of two vehicles believed involved in the shooting - one the suspect vehicle that was captured on surveillance video, the other a car behind them that was thought to have witnessed the shooting, but didn't make any attempts to stop, render aid, or contact police.\nSeveral tips from the public led officers to finding both vehicles, police said. The two cars were impounded and investigators determined one of the cars is, in fact, the one they suspected had the shooter inside.\nThe other vehicle impounded was determined to have been stolen, but not involved in the shooting. Investigators are saying the second vehicle, still believed to be a Pontiac Grand Am with the burned out passenger side brake light, is still outstanding. (See photo.) Investigators are again asking for the public's help to find that car.\nPolice haven't said if they've tracked down any suspects in the shooting.\nAnyone with information that could help in the investigation is asked to call 911, or contact the Kent Police Department tip line at 253-856-5808.\nCrime Stoppers of Puget Sound is also offering a cash reward of $1,000 for information leading to the arrest and charges of the suspects involved. Call the hotline anonymously at 1-800-222-TIPS (8477) or submit the information online at www.crimestoppers.com."}