{"uri": "http://www.thenewstribune.com/2015/05/20/3801411/four-persons-of-interest-in-fatal.html#emlnl=Crime_Newsletter", "title": "Fatal shooting of Kent baby: Four people in custody", "dct": "Wed, 20 May 2015 17:29:00 GMT", "id": "83ef343a4ed277d5185d566ade681f66", "content": "Four people of interest in the shooting death of a 1-year-old Kent girl are now in custody on unrelated charges.\nMalijha Grant was shot in the head April 16 while riding in her car seat with her parents near their Kent home.\n“We have four persons of interest in the case, and all four are in custody on unrelated charges,” Kent Assistant Police Chief Derek Kammerzell told the city council Tuesday night. “All of them have sought counsel and have not given any statements in relation to this case.”\nKammerzell also told the city council that police served a search warrant at a Kent home on Friday with occupants related to gangs. They seized four guns, three of which were confirmed stolen and associated with convicted felons at the home, and officers took other evidence related to to Malijha’s case, police said.\nIn early May, when police released information about a suspect vehicle, they confirmed the shooting was gang-related. The shooting is connected to a series of 12 to 15 gang-related shootings that occurred between Seattle and Tacoma in the month before the girl was killed.\nAt that news conference, investigators released still images of the suspect vehicle that was caught on nearby surveillance fleeing from the crime scene. It is believed to be a black four-door sedan with dark tinted windows. The make and model are not yet known.\nPolice said they also want to talk to the driver of a car that was behind the suspect vehicle. It is not known if the vehicle was involved in the crime, but police want to speak to any possible witnesses.\nThe car is a gray four-door 2007 Pontiac Grand Am, with Washington license plate 678ZRL. It is noted as having a burned-out and damaged rear passenger side brake light. According to investigators, it was stolen in Renton on Apr. 10 and has not been recovered.\nPolice said whoever was in the car witnessed the shooting but did not stop and has not made attempts to contact police to be interviewed.\nPolice said property that was in the stolen vehicle has been recovered in the Skyway area of King County, but the car itself has not been recovered.\nAnyone with information about the crime is asked to call 911 or contact the Kent Police Department tip line at 253-856-5808."}