{"uri": "http://www.kirotv.com/news/news/police-identify-suspect-murder-malijha-grant/nnQ9G/", "title": "Police identify suspect in murder of 1-year-old Malijha Grant", "dct": "Tue, 25 Aug 2015 16:51:00 GMT", "id": "db2980bf04597192686fa20e62d3a3de", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nKENT, Wash. - Four months after one-year old Malijha Grant was killed in a drive-by shooting, investigators in Kent have now identified an official suspect.\nThe man is one of four persons of interest already in custody on un-related criminal charges.\nDetectives have asked KIRO 7 not to reveal the suspect’s name in order to protect the integrity of their investigation.\nSee photos of baby Malijha here.\nSince Malijha was killed April 16th, one-third of Kent's detectives have been working full-time to bring her killer to justice. On Tuesday, they confirmed the baby's shooting death was most likely part of an on-going gang war, possibly in retaliation for the murder of John Williams in downtown Seattle March 19th.\nWilliams was a member of the street gang known as Low Profile. Malijah's father, Matrise Grant, has been identified as a member of rival gang, Deuce 8, although he has denied such ties. Matrise Grant was behind the wheel of the vehicle when his daughter was struck and killed while seated in her car seat.\nAccording to investigators, the two gangs have been targeting each other for months, and are responsible for up to 15 shootings from Seattle to Tacoma this year.\nThe investigation into Malijha's death has led to other crimes being solved.\n“As a result of this investigation specifically, we have recovered five firearms that have been involved in five different shootings in south King County,” Detective Melanie Robinson told KIRO 7.\nHowever, Robinson said it’s been very difficult to bring charges in Malijha’s murder case because of the street code against “snitching.”\n“I think there’s information out there that people are withholding that would help us,” Robinson said. “What kind of people can withhold such information and not help?”\nEven though a suspect has been identified, investigators believe more people are involved in Malijha’s death and they’re asking that street code be put aside for a baby's justice.\n“Malijha was a person.” Robinson told KIRO 7 on Tuesday. “She mattered. And she didn’t have a chance because of a senseless gang shooting.”\nTo pass along information anonymously, call 253-852-2121.\nWant to talk about the news of the day? Watch free streaming video on the KIRO 7 mobile app and iPad app, and join us here on Facebook."}