{"uri": "http://www.seattletimes.com/seattle-news/crime/babys-death-in-kent-drive-by-may-be-linked-to-gang-feud/", "title": "Baby’s death in Kent drive-by may be linked to gang feud", "dct": "Thu, 30 Apr 2015 10:51:00 GMT", "id": "f3a1d3491254949a35b89c1d111908f4", "content": "A drive-by shooting two weeks ago in Kent that fatally wounded a 1-year-old girl is being investigated as possible gang retaliation for the shooting death of a 24-year-old man in downtown Seattle in March, according to three search warrants filed by Kent police.\nKent detectives are investigating the possibility the death of Malijha Grant is connected to a feud between longtime rival street gangs, the Deuce 8 and Low Profile. The animosity between the two groups appears to have heated up after the March 19 fatal shooting of John Gerald Williams at Third Avenue and Pine Street, a notorious corner in Seattle’s downtown core known as an open-air drug market.\nNo arrests have been made in either homicide investigation.\nA Kent police spokesman did not immediately return phone calls Wednesday, and a Seattle police spokesman said he couldn’t provide a police report about the March shooting because the investigation is ongoing.\nAccording to the warrants filed by Kent detectives, Malijha Grant was strapped into a car seat when two men in a black car opened fire on the silver Chevrolet Impala her mother was driving about 4:30 p.m. April 16. Malijha’s father, who is alleged in the warrants to be a Deuce 8 gang member, was in the front passenger seat.\nEarlier, Malijha’s father had picked up her mother from the Renton restaurant where she works, then the parents picked up their daughter from a baby-sitter’s house, the warrants say.\nThey stopped at a shopping complex at West Meeker Street and Washington Avenue South in Kent, about 1½ miles from their apartment complex. Malijha’s mother drove the family from the shopping center west toward their apartment complex, according to the warrants.\nAs Malijha’s mother turned left onto Lake Fenwick Road from Reith Road, gunshots rang out, shattering the window behind the driver’s seat, the warrants say. The adults ducked down and Malijha’s mother accelerated, hitting a curb and sidewalk.\nA black car — described as looking like a Dodge Charger or Chrysler 300 — pulled alongside the Impala and more shots were fired into the vehicle, the search warrants say.\nMalijha was shot once in the head.\nTwo women driving behind the Impala stopped, and one of them performed CPR on Malijha while the second woman called 911, according to the warrants. Witnesses reported hearing four to eight gunshots, they say.\nMalijha died two days later.\nOne of the warrants obtained by Kent police gave detectives the authority to search the Impala, while the other two allowed them to search cellphones belonging to Malijha’s parents.\nPolice want the couple’s cellphone records to identify potential witnesses “who may have information leading to the identification of the shooter or motive for the shooting,” the warrants say. The phone records can also help police track the parents’ movements with the hope officers can locate “surveillance cameras along the route to attempt to identify the black car described by witnesses as the shooter’s car,” they say.\nAccording to the warrants, a firefighter who responded to the shooting scene overheard Malijha’s mother screaming at the baby’s father, telling him, “This is all your fault!”\nAnother witness, presumably one of the family’s neighbors, told investigators “he had seen a black Charger-type car, not associated with the (apartment) complex, driving through the parking lot … on two occasions in the evenings prior to the shooting,” according to one of the warrants.\nMalijha’s mother told police the baby’s father is a Deuce 8 gang member but that “he has not been very active in the gang after recently being released from custody,” the warrants say.\nMalijha’s father denied he was a member of Deuce 8 and told police “he had no idea why anyone would be shooting at their car,” according to the warrants.\nA search of state and federal court records did not turn up any recent convictions for the father, who appears to have last been convicted in King County in 2011 on a firearms charge. In that case, the father and an associate were in a store in Seattle’s Rainier Valley when the other man opened fire at someone outside, then was shot in the chest by a person returning fire, court records show.\nMalijha’s father served jail time for the 2011 case. He was also released from a Washington prison in 2007 after serving time on a drug charge, according to court records and a spokeswoman for the state Department of Corrections.\nPlay VideoPlayMuteCurrent Time 0:00/Duration Time 0:00Loaded: 0%Progress: 0%Stream TypeLIVERemaining Time -0:00Playback Rate1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptionsAudio TrackFullscreen\nThis is a modal window.\nCaptions Settings Dialog Beginning of dialog window. Escape will cancel and close the window. Text Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps Defaults Done\nA Kent detective wrote about the possible gang connection in the search-warrant affidavit related to Malijha’s mother’s cellphone:\nThere “is an ongoing feud between the Deuce 8 criminal street gang and the Low Profile criminal street gang and … this feud began sometime around March 2015 with the shooting of John Williams in Seattle.”\nAn item posted March 19 on the Seattle Police Department’s online blotter reported that a man was found about 3 a.m. by officers responding to reports of gunshots at Third Avenue and Pine Street. The victim was taken to Harborview Medical Center with life-threatening injuries, the post says.\nAccording to the King County Medical Examiner’s Office, Williams, 24, of Seattle, died at Harborview on March 22 from multiple gunshot wounds.\nWilliams, who had a criminal record as a juvenile and as an adult, was identified as “a self-proclaimed gang member” in charging documents that didn’t identify the gang."}