{"uri": "http://ccpdblotter.com/2016/03/02/patrol-report-03022016/#more-21529", "title": "Patrol Report 03/02/2016", "dct": "Wed, 02 Mar 2016 00:00:00 GMT", "id": "42c522480c826dc5223635ae2b264fb4", "content": "The Corpus Christi Police Department responded to 879 calls for service and generated 201 reports for formal criminal complaints from 7:00 a.m. March 1 to 7:00 a.m. on March 2, 2016. These are samples of the criminal complaints filed by the Corpus Christi Police for that time period.\nDate: 3/01/2016 8:15 AM\nLocation: 12700 Leopard Street\nOffense: Theft of a Firearm\nP.C. 31.03 State Jail Felony\nCase Number: 1603010035\nA 52 year old man reported that his vehicle was stolen out of his driveway in the 12700 block of Leopard Street and inside the truck was a handgun.\nThe man told Officers that he parked his 2012 Ford F250 truck in front of his home and came outside to find it missing.\nInside the truck was a loaded .40 caliber handgun.\nOfficers later found the truck abandoned in the 2800 block of Buffalo Street. The weapon was not located.\nSo far in 2016, 26 firearms have been stolen from vehicles in the city and only 6 of those have been recovered.\nDate: 3/01/2016 9:45 AM\nLocation: 5300 Milam Drive\nOffense: Burglary\nP.C. 30.02 Second Degree Felony\nCase Number: 16003010054\nAn alert neighbor called Corpus Christi Police after she saw two men breaking into a home in the 5300 block of Milam Drive.\nThe neighbor saw two men exit a vehicle that was parked in front of the home. One of the men went to a side window and removed the screen and went in. The other suspect stood at the front door and waited for the other suspect to let him in.\nOnce both suspects were inside they used a trash can to start loading up stolen items from the home.\nOfficers arrived in time to arrest both suspects. One of the suspects was a juvenile and he was taken to the Nueces County Juvenile Justice Center. The other man arrested was Benjamin Zavala (10/02/1987).\nDate: 3/01/2016 7:25 PM\nLocation: 6300 Hanley Drive\nOffense: Accidental Shooting\nCase Number: 16003010161\nCorpus Christi Police Detectives are investigating a shooting that occurred in the garage of a home in the 6300 block of Hanley Drive.\nAn 18 year old man was driven to Bay Area Hospital by another male friend after he accidently shot himself in the stomach.\nThe friend told police that the victim was showing him a handgun when it fired. The friend loaded the victim into his car and drove him to the hospital for treatment.\nDetectives have not been able to speak to the victim to confirm the story due to his injuries, but do not suspect foul play.\nSearch the website Crimereports.com to research all reported criminal activity in Corpus Christi. Anyone who knows any additional information about these crimes should contact the Corpus Christi Police Department at 886-2840. Information about unsolved crimes may be provided to investigators anonymously through Crime Stoppers at 888-TIPS (8477) or online at 888TIPS.com. Information provided to Crime Stoppers which results in an arrest may earn the caller a cash reward."}