{"uri": "http://www.eastbaytimes.com/breaking-news/ci_30086441/oakland-four-dead-two-shootings", "title": "Oakland: Four dead in two shootings", "dct": "Tue, 16 Aug 2016 10:27:00 GMT", "id": "ff28550715a482f80d224a8c80b60366", "content": "OAKLAND — An argument over recycling materials left two men fatally shot, one deliberately and another accidentally, and a person under arrest, police said Sunday.\nThe names of the 53-year-old and 24-year-old male victims were not released. The name of the 54-year-old man arrested on suspicion of murder was also not released.\nThe deadly argument happened about 9:08 p.m. Saturday in the 1400 block of Sunshine Court, where the 53-year-old man whom authorities said was homeless lived in a tent.\nPolice said the other two men, who lived in the area, got into an argument with him because they believed he was stealing recyclable materials from them.\nAfter both men began attacking him, the 24-year-old man tried to pull a gun from his waistband, but it went off and wounded him in the leg, Oakland police Sgt. Omar Daza-Quiroz said. The 54-year-old man then took the gun and shot the 53-year-old man, who died at the scene, police said.\nThe two men then got into a car to take the 24-year-old man to a hospital, but police stopped the car in the area of 82nd Avenue and Utah Street. The 24-year-old man was taken to a hospital, where he died, and the 54-year-old man was arrested. The police investigation is continuing, and anyone with information is asked to call investigators at 510-238-3821.\nThe shootings came hours after a man and woman were found shot to death at an apartment in the 3300 block of MacArthur Boulevard, between Laurel and Midvale avenues. Witnesses saw a suspect fleeing shortly after the shooting, but no gunman has been found, police said. No arrests have been announced.\nCrime Stoppers of Oakland and police are offering up to $20,000 for information leading to the arrest of a suspect, and anyone with information pertaining to the case can call Crime Stoppers at 510-777-8572 or police at 510-238-3821.\nStaff writer George Kelly contributed to this report. Follow Rick Hurd at Twitter.com/3rdERH. Follow Harry Harris at Twitter.com/HarryHarris15."}