{"uri": "http://www.wwltv.com/story/news/local/orleans/2015/09/25/new-orleans-east-family-want-to-see-accused-killer-returned-from-fl-to-face-murder-charges/72780708/", "title": "Family wants to see accused killer extradited to face murder charges", "dct": "Thu, 24 Sep 2015 00:00:00 GMT", "id": "27dc7e2c1d4d843b61294ab648f7681d", "content": "NEW ORLEANS -- Six months after a woman and her 8-year-old daughter were shot and killed inside their New Orleans East home, the main suspect in the case has been sentenced to life in prison. However, the jail time isn't for the murders, but for crimes he committed in Florida as a fugitive.\nRelatives of both victims say they are eager to see Dwayne Martin stand trial for the deaths of their loved ones.\n\"Like I told my brother, this is something you gotta deal with brother. I lost my daughter and I haven't gotten over it yet,\" said Mercedes Brown, who still thinks about her daughter killed four years ago. Now she's grieving for her niece and great niece, who were killed inside their Little Woods home back in March.\nThe New Orleans East family wants to see the man accused of Walesha and Paris Williams' murders slapped with the death penalty.\n\"An eye for an eye as they call it. You kill a life, your life should be taken. You're gonna get educated in the jail house, you're going to learn the system, you're going to get you a lawyer, or be your own lawyer, and be free one day. It's not fair,\" said Brown.\n25-year-old Walesha Williams and her 8-year-old Paris were shot inside their home on Duane Road on March 3. Relatives now say the motive for the shooting was connected to Williams wanting to break up with the alleged gunman, who detectives say was Dwayne Martin.\nAlso shot was a third woman, who played dead but managed to run for help after Martin took off.\n\"Dwayne Martin allegedly committed these two horrific murders in New Orleans East and fled to Florida,\" said Eyewitness News legal analyst Donald \"Chick\" Foret.\nThe fugitive was eventually picked up by Florida authorities after trying to break into a house armed with a hammer, a crime in Florida that is punishable with life in prison. According to the FL Department of Corrections website, Martin got that sentence in August.\nEven though he's behind bars hundreds of miles away, Foret expects Martin to still face justice in Orleans Parish.\n\"The DA's office will take their paperwork, take their [grand jury] indictment, bring it to the Florida judge, have him brought back here for a trial. He will face, I anticipate, two counts of first-degree murder,\" added Foret.\nIt's a day in court that Walesha and Paris' relatives are waiting patiently to see happen.\n\"Two lives were taken, two innocent lives, and something should be done about it. This man should never walk the streets again,\" Brown said.\nA spokesman for the Orleans Parish District Attorney's Office says it has been in touch with Florida prosecutors. The district attorney's office is working to have Martin extradited from Florida to face those double murder charges."}