{"uri": "http://www.wdbj7.com/content/news/Virginia-State-Police-investigating-Halifax-County-Shooting-376889771.html", "title": "UPDATE: Five people shot in Halifax County; suspect shot by deputy", "dct": "Mon, 25 Apr 2016 13:18:00 GMT", "id": "f6d46c2bfdce4d3b5f8d6883c5471795", "content": "HALIFAX Co. Va. (WDBJ7) The Town of Halifax Police Department and command staff are meeting about the shooting.\nPolice chief Kevin Lands says in his 3.5 years as chief, they haven’t had any problems at the VFW.\nLands said about a year before he became chief, a town ordinance was put in place putting limits on events at the VFW.\nCheck back soon for more updates.\nORIGINAL STORY\nSix people were early Sunday morning in Halifax County, including the suspected shooter.\nThey were all hurt at a party at Veterans of Foreign Wars Post.\nThree of the victims were taken here to Sentara Halifax Regional Hospital. A deputy shot the alleged gunman who is expected to be okay. Two others are in the hospital facing serious and life threatening injuries.\nGrindl Martin woke up with a sinking feeling early Sunday morning.\n“It was just a big commotion. Just a big, big commotion and I didn't know what had happened,” Martin said.\nThe VFW post commander says they rented out the space to a birthday party.\nThe commander says the people left the inside and outside a mess. Decorations, trash and shoes were left in the parking lot -- signs of the violent party.\nVirginia State Police say shortly before 2 a.m., the Halifax County Sheriff's Office responded to a parking complaint called in by a security officer at the VFW.\nAfter the deputy got on scene, police say they saw a man firing into a crowd of people.\nWhen the deputy told that man to drop his gun, he didn't and was shot, according to police.\n“It's just horrible. It really is that people can't get together and have a nice time,” Martin said.\nThe post commander says many of the people were in their mid-20's.\nMartin can see the VFW from her house.\nShe says she saw more than a dozen people walking away from the scene.\n\"It's really frightening because it's too close for comfort,” Martin said.\nThe sheriff's tape may be down, but there are still many questions about how the party turned so violent.\nThe post commander tells me the people who had the party brought their own security.\nThe Halifax County Sheriff's Office is handing off both the shooting and use-of-force investigation to Virginia State Police.\nThe sheriff's deputy who fired is on paid administrative leave.\n=================\nVirginia State Police are investigating after a shooting near the VFW in Halifax.\nFive people were injured in the shooting. The shooting suspect was shot by a deputy and is expected to survive.\nThe following is a release from Virginia State Police:\nAPPOMATTOX, Va. – The Virginia State Police are investigating two shooting incidents that occurred early Sunday (April 24, 2016) in the Town of Halifax.\nShortly before 2 a.m. Sunday, the Halifax County Sheriff’s Office responded to a parking complaint called in by a security officer at the VFW Hall on Route 501 in the town of Halifax.\nAfter arriving on scene to address the parking issue, the deputy heard a sudden burst of gunfire and witnessed a male subject firing into a crowd of people. The deputy immediately confronted the shooter. The male subject refused to comply with the deputy’s commands to drop the weapon and the male subject was subsequently shot by the deputy.\nThe male shooting suspect is currently being treated for non-life threatening injuries.\nA total of five other individuals were injured in the initial shooting incident. One is being treated for life-threatening injuries; a second one for serious injuries; and three others have already been treated and released from Sentara Halifax Regional Hospital in South Boston, Va.\nThe deputy was not injured in the incident.\nAt the request of Halifax County Sheriff Fred Clark, the Virginia State Police Bureau of Criminal Investigation’s Appomattox Field Office is investigating both the initial shooting and deputy-involved shooting.\n======================================================\nStatement from Halifax County Sheriff Fred S. Clark: To reinforce my commitment to public safety and transparency within our community, I have requested the Virginia State Police investigate both shootings that occurred early Sunday morning in the Town of Halifax. Because both shooting incidents occurred within minutes of one another and the deputy having witnessed the initial shooting, I felt it best to have the state police lead both investigations. The deputy involved in the shooting has been placed on administrative leave with pay pending the outcome of the investigation."}