{"uri": "http://www.whio.com/news/local/child-champaign-county-apparent-suicide-honored-event/dofUT5Gra9phxDS2NBZcNI/", "title": "Child in Champaign County apparent suicide to be honored at event", "dct": "Wed, 19 Oct 2016 00:00:00 GMT", "id": "3214e585ca447fa31b0e496eb8f12bb7", "content": "UPDATE @ 6:05 p.m. (Oct. 21): The 11-year-old Champaign County child who died in an apparent suicide this week will be honored Saturday evening during the “Jillian’s Enchanted Halloween Ball,” to be held at Mechanicsburg High School.\nTerra Byrd-Group has organized the ball through the Legacy Strongheart Foundation, which she created. The foundation’s mission is to “bring happiness and help to children and young adults affects by illnesses and disabilities.” Byrd-Group taught the child when she was in fourth grade and said the child was active in the Relay for Life.\nSaturday night’s honor involves a moment of silence and the reading of the book, “Jillian and the Bully: A tale of a healthy heart,” written by Linda S. Locke, a retired principal who led South Elementary in the Urbana City Schools district for 17 years. Locke now is an adjunct faculty member at Urbana University.\nIn the story, Jillian learns how to look at the heart of the playground bully at her school and as she finds her voice to speak out, the bully begins to change. Jillian trusts in the power of standing up for herself and using her friend as a support in the process.\nVisitation for the child is scheduled for 2-6 p.m. Sunday at Freshwater, McDonald & Vernon Funeral Home in North Lewisburg. Everyone who attends is being asked to dress in a super hero costume because the child was big into super heroes, Byrd-Group said.\nThe funeral is Monday at the North Lewisburg Methodist Church.\nUPDATE @ 6:41 p.m. (Oct. 19): The Champaign County sheriff confirms that the 11-year-old child has died and the incident is being investigated as an apparent suicide.\nFIRST REPORT (Oct. 19)\nAuthorities say they believe an 11-year-old Champaign County youth has a gunshot wound, dispatchers said.\nSheriff’s units responded to the area of Chatfield Road in Cable at 3:12 p.m.\nDispatchers said that’s all the information they can give out at this time.\nChatfield Road is blocked between Blue Road and Brush Lake Road."}