{"uri": "http://www.vernonfh.com/index.php?P=8&FILENUMBER=2016-203-02", "title": "Bethany Thompson", "dct": "Wed, 19 Oct 2016 00:00:00 GMT", "id": "82bfa626e2cbd5507d8def3ef077facb", "content": "Return to list of obituaries | Email condolences to the family | Send a floral condolence\nAge Entered into Rest Bethany LouAnn Thompson, 11, of Cable, passed away Wednesday, October 19, 2016.\nShe was born December 17, 2004 in Marysville, Ohio. Bethany was currently a sixth grader at Triad Local Schools. She enjoyed swimming, coloring, shopping - especially Goodwill, music, Super Heroes and Pokemon. Every year, she looked forward to attending vacation Bible school and church camp. She loved all animals, horseback riding and her family.\nShe will be sadly missed by her mother, Wendy Feucht and step-father, Jared Feucht; her father, Paul Thompson; her siblings, Elius Feucht and Lanee Thompson; her grandparents, Eulis and Cheslie Blanton and Nancy and Mike LaBarre; her great grandmother, Gladys Blanton; aunts and uncles, April (Dennis) Freville and Miranda (Mark) Kidd; a great-great aunt, Mamie Hicks; her cousins, Ryan, Kaleb, Marri and Maggie; and many friends, including special friends, Angel Penhorwood, Kaylie Jackson and Norman Rodriguez.\nShe is preceded in death by her grandfather, Dwight Thompson and her great grandfather, Jack Blanton.\nA gathering of family and friends will be held from 2-6 PM on Sunday, October 23, 2016 in the FRESHWATER, MCDONALD & VERNON Funeral Home, North Lewisburg. A funeral service will be held at 11:00 AM Monday, October 24, 2016 in the North Lewisburg United Methodist Church, 124 E Maple St., North Lewisburg, OH 43060. Pastor David Warner of the Fellowship Baptist Church, North Lewisburg, will officiate. Burial will follow in Maple Grove Cemetery, North Lewisburg.\nMemorial contributions may be made to the Freshwater, McDonald & Vernon Funeral Home to help offset funeral expenses, 57 W. Maple St., North Lewisburg, Ohio 43060.\nCondolences may be expressed to the family atwww.vernonfh.com."}