{"uri": "http://www.sltrib.com/news/2601906-155/army-veteran-identified-as-shooter-in", "title": "Army veteran identified as shooter in Murray murders-suicide", "dct": "Mon, 08 Jun 2015 12:36:00 GMT", "id": "51130520b01867a36ca3aaec76c97e6f", "content": "On Sunday, however, police say the 30-year-old man fatally shot his fiancee, Jaime Salazar, 34, and their 2-year-old son, Jordan Reeves, in an apparent domestic dispute inside a unit at the Vantana Apartments near 200 East and 6600 South.\nReeves and Salazar had a history of domestic disputes, but on Monday police remained unclear about a motive for the shooting and were trying to determine what caused the dispute to escalate into bloodshed, Murray police spokesman Kenny Bass said.\nThree other children — between ages 8 and 11, and from Salazar's previous marriage — also were in the home, but were unharmed. They were in the care of their father as of Monday, Bass said.\nJust before noon Sunday, police responding to 911 calls of gunfire found the victims inside the home. Bass, noting that the case remained under investigation, did not release details on what kind of firearm was used, how many shots were fired, or specifically where on their bodies the deceased were wounded.\nCourt records show that Reeves had previously threatened Salazar with a shotgun during an August 2014 incident, and according to charging documents, stated that \"he wanted to kill her, her children, and himself.\"\nReeves in January entered guilty pleas in abeyance to third-degree felony counts of aggravated assault and domestic violence in the presence of a child.\nIn exchange, four other aggravated assault counts and three other domestic violence counts were dismissed.\nAs part of Reeves' plea agreement, the case was to be dismissed in 36 months provided Reeves completed substance abuse treatment through the veterans' court program.\nThe program is open to those who have served in the armed forces and qualify for veterans benefits and are on probation or prepared to enter a plea in abeyance. The goal of the court is to connect defendants to veterans' services and help them exit the criminal justice system by graduating from court supervision, court officials have said. The defendants can receive substance abuse or mental health counseling from the veterans' programs or other public or private facilities.\nReeves had been appearing before the judge about twice a month since January, with court docket entries indicating he was \"in compliance\" and doing \"well\" or \"very well.\"\nReeves was last in court on June 4 and was set for another review on June 18, records show.\nThe program, which includes treatment, counseling, peer support groups, home monitoring, weekly contact with attorneys, court and law enforcement and other services, provides more supervision than is available to defendants in other parts of the criminal justice system, Gill notes.\nReeves, he said, was demonstrating through his performance in the program that he was working to solve his problems.\n\"But this is how deep and dark the scars can be,\" Gill said. \"It breaks my heart. These are the residual consequences and costs of war. These are some of the scars and injuries that go beyond the physical injuries.\"\nDuring a December hearing, Salazar had asked the judge to lift a no-contact order. A prosecutor objected and the judge denied the request, the court docket shows.\n» Next page... Single page"}