{"uri": "http://www.kctv5.com/story/29893606/jamyla-bolden-9-murder-suspect-in-custody", "title": "Suspect charged with murder in shooting death of Jamyla Bolden - KCTV5", "dct": "Mon, 24 Aug 2015 04:41:25 GMT", "id": "8a72c301bb0f6fb10e57efa3311bc40d", "content": "FERGUSON, Mo. (KMOV.com) – A suspect is in custody regarding the shooting death of Jamyla Bolden.\nAccording to court records, 21-year-old De'Eris Brown has been charged in the shooting death of Bolden after allegedly confessing he shot into her home.\nBrown has been charged with unlawful use of a weapon: shooting at a building, armed criminal action, second-degree murder, armed criminal action, and unlawful use of a weapon. His bond was set at $750,000.\nAn arrest document states a witness identified Brown as the shooter and an informant also came forward stating the defendant admitted shooting into the home on the night of the murder.\nThe 9-year-old was doing her homework while seated on a bed in the 9200 block of Ellison when she was fatally shot around 9:30 p.m. on August 18.\nAccording to police, the bullets came from outside of the home. Authorities do not believe it was a drive-by shooting and are unsure if it was targeted or random. Police believe Brown was by himself during the shooting.\nBrown was arrested in 2014 after allegedly pulling a pistol on a Subway employee in the middle of the parking lot. Police said at the time that Brown called an employee of the store and said \"I'm coming to your job and going to shoot up the place.\" Police say he later showed up and pointed the gun at the employee saying \"come talk to my nine,\" referring to his gun. No one was seriously hurt in that incident.\nCharges in the incident were later dismissed because prosecutors said the victim did not cooperate.\nIn March, Brown pleaded guilty to robbery charges and was sentenced to 10 years in prison, but the sentence was suspended and he was placed on five-years probation.\nCopyright 2015 KMOV (Meredith Corporation). All rights reserved."}