{"uri": "http://www.columbian.com/news/2015/mar/18/phoenix-shooting-spree-suspect-large/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+the-columbian-headlines+%28The+Columbian%3A+Headlines%29", "title": "Suspect arrested in Phoenix-area shooting that killed 1", "dct": "Wed, 18 Mar 2015 00:00:00 GMT", "id": "9b8804b1e6aed83c98eec7446dd80289", "content": "MESA, Ariz. — A gunman killed one person and wounded five others Wednesday in a rampage that included a motel shooting, a carjacking and a home invasion and ended with a suspect’s arrest at a nearby apartment in suburban Phoenix.\nThe suspect was taken into custody after officers spotted him on an apartment balcony and shocked him with a stun gun. Numerous officers led the handcuffed man to a truck parked outside an apartment complex.\nPolice later identified the man as Ryan Giroux, a 41-year-old ex-convict who has served three stints in state prison since 1994.\nGiroux served prison terms totaling more than eight years for burglary, theft, attempted aggravated assault and a marijuana violation, the Arizona Department of Corrections said.\nHe was first incarcerated in 1994 and returned to prison in late 1995 before being released about a year later. He then returned to prison in mid-2007 and was released in late 2013.\nPolice said Wednesday’s shootings started with an argument inside a motel room that spilled outside, leaving one man dead and two women wounded, Mesa police Detective Esteban Flores said.\nThe gunman then shot a man working at a nearby restaurant. The adult student at the nearby East Valley Institute of Technology was able to run across the street to emergency responders already at the motel, Flores said. The school said in a statement that the victim was one of seven students and an instructor working at Bistro 13 restaurant. The student was treated at a hospital and released.\nThe gunman got away by carjacking the instructor’s car.\nPolice say the man then went to an apartment complex about 2 miles away, where he entered an apartment and shot a man. That victim will survive, police said.\nA police officer found another man in a neighboring apartment building with multiple gunshot wounds, Flores said. He was listed in critical condition.\nThe shootings prompted an intense hunt for the gunman as Mesa police searched the trunks of cars, interviewed witnesses and brought in SWAT and canine units from other agencies. Flores warned people to remain indoors.\nSeveral buildings in the area were placed on lockdown amid a heavy law enforcement presence."}