{"uri": "http://www.nola.com/crime/index.ssf/2016/11/bourbon_street_shooting_invest.html", "title": "Bourbon Street shooting investigation centers on 2 suspected gunmen: NOPD", "dct": "Mon, 28 Nov 2016 00:30:41 GMT", "id": "8e6a5ab4ce60a6a58799a5f8056d03e5", "content": "(CHRIS GRANGER)\nNew Orleans police are working to arrest two suspected shooters, both from outside of New Orleans, in connection with a Bourbon Street mass shooting that killed a Baton Rouge man and left nine other men and women injured early Sunday, NOPD officials said during a Sunday afternoon (Nov. 27) news conference.\n\"We have been able to obtain what we believe to be strong information on who these suspects may be and we're pursuing every lead at this moment,\" NOPD Superintendent Michael Harrison said.\nThough police arrested two men at the scene Sunday on charges of illegal carrying of a firearm, neither of those men are suspects in the shooting, the NOPD said.\nInvestigators believe the two suspected shooters knew each other prior to the shooting and had an ongoing dispute that was reignited when they bumped into each other in the 100 block of Bourbon Street early Sunday, said NOPD spokesman Tyler Gamble after the news conference.\n\"It was an argument that stemmed from a previous argument they had in another place,\" Harrison said.\n\"Then they both fired weapons,\" Gamble noted.\nPolice said the 10 victims are all believed to be bystanders who happened to get caught in the crossfire.\n\"We don't believe any of the victims who were shot were the intended targets,\" Harrison said.\nPolice did not name or provide photos of either of the suspected shooters during Sunday's news conference. You can watch the conference here.\nThe shooting killed 25-year-old tattoo artist Demontris Toliver of Baton Rouge, who was shot in the chest and shoulder-blade area. Toliver was pronounced dead at a local hospital, police said.\nDemontris Toliver, a 25-year-old Baton Rouge tattoo artist in town to celebrate his birthday, has been identified as the man slain during the Bourbon Street mass shooting that wounded nine others Sunday morning (Nov. 27).\nAs of Sunday evening, four of the 9 surviving victims remained hospitalized, police said. These include: a 24-year-old Baton Rouge man who was shot in the chest area and hand, a 21-year-old Lafayette man who was shot in the hip, a 22-year-old Eunice man who was shot in the knee and a 21-year-old Mississippi man who was shot in the outer ankle.\n\"At this time, those who remain in the hospital are expected to make a full recovery from their injuries,\" Harrison said Sunday afternoon.\nAccording to the NOPD, five of the surviving victims had been released from the hospital by Sunday afternoon: a 20-year-old woman from Lafayette who was shot in the wrist, shoulder and chest area; a 25-year-old Lafayette woman who was shot in the thigh, a 37-year-old Zachary man who was shot in the back of the knee, a 22-year-old New Orleans man who suffered a graze wound to the buttocks and a 22-year-old New Orleans man who was shot in the hand.\n\"As you know this is still a very aggressive, still a very active, fast-moving investigation,\" Harrison said at the start of the conference.\nThe NOPD is working with a number of other law-enforcement agencies, including the FBI, the ATF and Louisiana State Police, to identify the shooters and find evidence linking them to the crime, officials said.\nVictims and witnesses have been \"very cooperative,\" Harrison said.\nThe shooting occurred despite extra security measures taken by police in anticipation of large crowds flocking to the French Quarter for the holiday weekend, the Bayou Classic and Sunday's New Orleans Saints game.\nHarrison described those measures, which included additional street lighting and an increased police presence with uniformed officers on foot, in vehicles and on horseback. Plainclothes officers also patrolled the French Quarter. The efforts led to 11 arrests for illegal carrying of guns--though none of those arrested are suspected in the shooting, police said.\nAt the time of the shooting, 40-plus officers, including NOPD officers and state troopers, were within the 100 block of Bourbon Street or at the Bourbon's intersections with Canal and Iberville, which border that block, Harrison said.\n\"We had a very robust plan,\" Harrison said. \"Everything that we could do, we did.\"\nMayor Mitch Landrieu, describing the suspects as having no regard for human life, said, \"It's difficult to police against that, but we are going to find a way.\"\n\"We will go to the ends of the Earth to make sure that we bring them to justice,\" Landrieu said.\nLandrieu and Harrison both emphasized the need for help from the public in the investigation.\n\"If you want a safe community, you've got to step up to the plate,\" Landrieu said. \"It is impossible to believe, given social media and technology, that somebody doesn't have a picture that will really help us here or somebody doesn't have specific information\" about the suspected shooters.\nHarrison urged anyone with any information on the shooting, \"however slight you think that to be,\" to call the NOPD or Crimestoppers.\nHomicide Detective Barrett Morton is in charge of the ongoing investigation and can be reached at 504-658-5300. Citizens can also call Crimestoppers at 504-822-1111 or toll-free at 1-877-903-STOP.\nThis post has been updated to include more comments from NOPD Superintendent Michael Harrison and Mayor Mitch Landrieu."}