{"uri": "http://www.chron.com/news/houston-texas/houston/article/Mother-learns-her-little-girl-killed-in-robbery-10617873.php", "title": "Mother learns her little girl killed in robbery", "dct": "Wed, 23 Nov 2016 00:00:00 GMT", "id": "907a4fd85cf9d6bb7177f1946c0a31fe", "content": "(Update: Since this story first published, investigators have since released photos of a black sedan they believe was used by the suspects in the killing of Ava Castillo. Investigators are asking for the public's help in identifying the vehicle. [FULL STORY])\nDiana Gomez asked for her little girls as soon as she woke up in the hospital Tuesday after being shot during a robbery Monday night at the family's Greenspoint-area apartment complex.\nThe 27-year-old mother who was critically injured couldn't speak Tuesday morning because of a breathing tube, but her sister, Julie Gomez, said she could write messages to family members.\nRight after waking up from sedation at Houston Northwest Medical Center, she asked for her daughters, 4-year-old Ava and 10-year-old Betzida, who also goes by Betsy. They were both also shot during the robbery.\nAbout 1 p.m. Tuesday, Gomez' relatives — along with doctors and a hospital chaplain — entered her hospital room to tell her Ava was gone.\nBecause of the breathing tube, her sister said, \"She couldn't speak. All she could do is cry. But you could definitely see the pain in her face.\"\nAfter being flown to a Level 1 trauma center by LifeFlight, Ava died of her injuries. Betsy was critically injured. Gomez' young son who was also at the scene was not hurt.\nThe family had been unloading groceries about 8:45 p.m. in the parking area adjacent to a row of apartments when robbers approached and demanded Gomez' purse. After a struggle, at least one of the robbers opened fire on the family, shooting as many as a dozen rounds. Three men fled the scene after the shooting in a dark-colored four-door sedan, possibly a Chevy Impala.\nWhen police arrived, Gomez was focused on her children's injuries.\n\"She was in mother mode,\" senior Harris County sheriff's deputy Thomas Gilliland said. \"She didn't even know she had been shot. (She didn't realize) till a deputy noticed that she had blood on her shirt.\"\nGilliland said Wednesday that they have a person of interest in custody. That man was arrested at a motel on a warrant for unrelated family-violence charges. Deputies searched his motel room for evidence, but Gilliland could not say whether they found a gun.\nPolice think the three attackers were \"predator-type criminals searching for crimes of opportunity,\" the deputy added.\nThe robbers may have entered Gomez' apartment complex through an entry gate that other residents said has been stuck open for months. Neighbors also said property managers had not replaced the lights that should have illuminated the small parking lot where the family was attacked.\nThe past six months of crime reports at or just outside the complex include five vehicles stolen along with break-ins at homes and vehicles. A robbery was reported in July and an assault with a deadly weapon the month before.\nThe North Houston District, a commercial development district that includes Greenspoint, issued a statement Wednesday saying that the shooting tragedy \"has touched the hearts of so many in this community and throughout the city.\"\n\"While the North Houston District has seen a 12 percent decrease in violent crime when comparing last year to this year, incidents like this are never easy to accept or understand,\" the statement read. \"We work with a variety of law enforcement entities, including the Houston Police Department and the Harris County Sheriff's Office, to deliver programs that have contributed to an overall reduction in crime. Random acts of violence are not easily preventable, but we know that working with local law enforcement and the community has been an effective way for us to impact crime in general.\"\nManagers at the complex, Mission Falls Apartments on Greens Crossing Boulevard, did not return multiple calls and messages requesting comment Tuesday and Wednesday. Calls and emails Wednesday also went unreturned by the property owner, Lubbock-based Madera Residential, and its president of operations, Jeffery Lowry.\nNeighbors said Tuesday that ambulances seemed slow to arrive after the shooting, but Gilliland said records show the first ambulance reached the complex within five minutes of the first 911 call at 8:48 p.m. The ambulance may have been instructed to wait a couple of minutes as police confirmed the scene was safe, the deputy said.\nThe injured woman's sister said family members gathered to support Diana include their two brothers, Diana's fiance, and the children's father and his family. The sister, Julie Gomez, said their parents were arriving Wednesday from outside the country. The family will plan a funeral service for the slain 4-year-old, Ava.\n\"She was just a sweet, sweet little girl,\" Julie Gomez said of her slain niece. \"Always so happy, so jolly.\"\n\"I think out of the three, she was the spotlight,\" she added, her voice cracking. \"She loved messing with her brother and sister.\"\nJulie Gomez said the girls' brother, Isaiah, was also in the parking lot when the robbery happened but was not injured. He and Betsy are staying with their father; the children share his last name, Castillo.\nThe family has started a GoFundMe page to collect donations toward Ava Castillo's funeral expenses: https://www.gofundme.com/baby-ava-and-gomez-family."}