{"uri": "http://www.clickorlando.com/news/4-shot-at-port-orange-home/29186100", "title": "Man shot his 3 children, self after fight with wife at Volusia home, deputies say", "dct": "Sat, 18 Oct 2014 21:11:00 GMT", "id": "80315e126aeb80524eec5345c9240be9", "content": "PORT ORANGE, Fla. - A 52-year-old man shot his three children, killing two of them, before shooting and killing himself after getting into an argument with his wife at their Volusia County home, according to deputies.\nAccording to the Volusia County Sheriff's Office, the shooting happened around 5:10 a.m. Friday at a home in the 1900 block of Jackson Lane in the Spruce Creek Farms subdivision off Tomoka Farms Road in Port Orange.\n[RAW VIDEO: Mass shooting in Port Orange | AUDIO: 911 call | Schools call parents | READ: Letter sent to Cypress Creek Elementary | Creekside Middle ]\nVolusia sheriff's officials said David Mohney shot and killed his 11-year-old son, David, and 14-year-old daughter, Savanna, before turning the gun on himself.\nMohney's 9-year-old daughter, Lauren, was taken to Arnold Palmer Hospital in Orlando with critical injuries. She was later upgraded to stable condition.\nDeputies said Mohney's wife, Cynthia Mohney, ran to a neighbor's house for help, telling the neighbor that she had been fighting with her husband and he had threatened her with a gun.\nA short time later, the sound of gunshots rang out, according to deputies, who said they found David Mohney and children shot. The girls were found in an upstairs bedroom, and the boy was found in a downstairs bedroom, according to deputies.\navid Mohney was found dead on the kitchen floor with a handgun next to him, deputies said.\nVoluisa County Sheriff Ben Johnson said there was a history of domestic violence at the home. Court records show that David Mohney filed for divorce in May and wanted full custody of the children with the intent of moving to South Dakota.\nHe also requested a protective order in June, asking for his wife to be kept away from him and their children. The protective order claimed that his wife often drank too much and hit him and their children, claiming that she once threw one of the children against a clothes dryer.\nLocal 6 has also learned the Department of Children and Families had to intervene in an allegation of abuse in April.\nA spokesman said the incident involved Cynthia Mohney slapping one of their children on his chest in the middle of a local restaurant.\nThe department advised she get alcohol counseling.\nOfficials said the 9-year-old attends Cypress Creek Elementary School. The other children attended Creekside Middle and Spruce Creek High schools.\n\"We have crisis counselors at each of the schools and will have them there again Tuesday (because Monday is a teacher duty day,\" Volusia County Schools spokeswoman Nancy H. Wait said.\nSchool officials also sent a message to parents, informing them of the mass shooting.\n\"Good afternoon parents, I'm calling from Volusia County Schools. We wanted to make you aware that we received information from the Volusia County Sheriff's Department that a tragedy involving three of our students occurred off campus (Friday) morning. The students are enrolled at Cypress Creek Elementary, Creekside Middle and Spruce Creek High. As we learn more information, we will share that information with you. Crisis teams are at each of the schools today and will be there again on Tuesday to assist students in dealing with this tragic situation.\"\nThe school district said that it'll be planning some positive things to help bring closure to students at those campuses. Crisis counselors were in school today and will also return on Tuesday. Schools will be closed on Monday for what's called a \"teacher duty day.\"\n\"Walking down the hallways everyone was crying, it was scary,\" said Spruce Creek High School student Ashleigh Brinkerhoff.\nBrinkerhoff remembered Savanna as a great athlete.\n\"She was an amazing runner. She was so fast. It's just weird seeing that she's gone now,\" said Brinkerhoff.\n\"It's really sad, I didn't know her personally, but I feel really bad, it's really tragic that that happened,\" said Molly Schemel.\nWatch Local 6 News and stay with ClickOrlando.com for more on this story.\nCopyright 2014 by ClickOrlando.com. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}