{"uri": "http://6abc.com/news/teen-charged-in-accidental-shooting-death-of-friend/1407260/", "title": "2 teens charged in accidental shooting death of friend in Germantown", "dct": "Fri, 01 Jul 2016 00:00:00 GMT", "id": "60e3751a1be87b4921c907eb908b97b5", "content": "GERMANTOWN (WPVI) --\nTwo teenagers have been charged in the accidental shooting death of their 13-year-old friend on Wednesday in the Germantown section of Philadelphia.\nA 15-year-old is charged with involuntary manslaughter. He is believed to have fired the weapon.\nA 17-year-old is charged with recklessly endangering another person. Police believe he loaded the gun with some of the bullets.\nThe victim, identified as 13-year-old Chris Mackey, died after a gun found by a group teenagers went off, police say.\n\"My nephew got shot in his mouth, it went through his head and hit his brain,\" said Eddie Mackey, uncle.\nIn the midst of his grief, Eddie Mackey tells Action News his family is trying to come to terms with the accidental shooting.\n\"My family is grieving beyond what I could ever imagine,\" said Eddie Mackey.\nDozens gathered Thursday on the very block when the shooting took place 24 hours earlier.\nPhiladelphia Cease Fire rallied this as a cautionary tale to lock up guns. But the grim reality is still fresh on Chris' childhood street.\n\"You need to teach your child you don't play with guns, and when you see someone with a gun, you go and tell somebody,\" said Josette Sydnor, block captain.\nA lesson Chris and his family have learned the hard way.\n\"There's no moving forward. That's my brother's son. It's an everyday pain,\" said Eddie Mackey. \"I don't know whats going on. Kids are playing with guns everyday. All I know is I'm hurt.\"\nIt was Wednesday at 5:20 p.m. when police officers were called to the backyard of a home in the unit block of East Walnut Lane.\nThat's where they found Mackey unresponsive and suffering from a gunshot wound to the face.\nHe was rushed to Einstein Medical Center and pronounced dead at 6 p.m.\nTia Reed, who lives on the block, told Action News her son and about five friends, including Mackey, played together almost every day on Reed's basketball court.\nSources tell Action News the kids found a loaded gun in an abandoned house and were playing with it and pulling the trigger, but it didn't fire.\nThey found more bullets next to it, police say, and the 17-year-old allegedly loaded them into the gun.\nThe 15-year-old was holding the gun when it fired, killing Mackey.\nReed says her son's friends ran into her kitchen, terrified. Reed's father called 911.\n\"They're like, 'Oh, my God! He got shot!'\" Reed said. \"It was a lot of emotions.\"\nThe suspected shooter later turned himself in to police.\n\"He went home,\" said Clark. \"He told his parents what had happened. He was distraught (that) he killed one of his best friends. Family members brought him down to the Homicide Unit.\n\"13- or 14-year-old boys who don't live that kind of life... they were scared,\" said Reed. \"I've never seen those children like that, my child like that, so scared.\"\nReed says her son and his friends are good kids.\nClark said none of the boys are known to police.\nReed feels for the victim's family - and for her son, who is mourning his friend.\n\"They were all playing basketball,\" she said. \"Nobody was fighting. There was no altercation, nothing like that. This was a tragedy, something that happened that should've never ever happened.\"\nThe investigation into who owns the gun that was left in that abandoned home is ongoing.\nPolice say who whoever left it there could face charges as well."}