{"uri": "http://www.toledoblade.com/Nation/2016/04/16/Police-Man-who-shot-firefighters-released-from-custody.html", "title": "Police: Man who shot firefighters released from custody", "dct": "Sat, 16 Apr 2016 00:00:00 GMT", "id": "a24dced8e071db368e05ce7bee56038c", "content": "TEMPLE HILLS, Md. — As police worked today to determine why a person opened fire on firefighters who were responding to a call for help at a home in a Maryland suburb of Washington, they shooter was released from custody.\nJohn Ulmschneider, a 13-year veteran of the Prince George’s County Fire Department, died Friday night after he was shot while trying to enter a home to make a welfare check, police said.\nVolunteer firefighter Kevin Swain, 19, also was shot, and was in serious but stable condition after coming out of surgery Saturday, department officials said. Swain, who authorities say was shot four times, is expected to survive.\nFirefighters had gone to the Temple Hills home after the brother of the man who lived there told authorities he was concerned about the man’s safety, said Mark Brady, spokesman for the fire department. The man said his brother had trouble controlling his blood sugar and recently blacked out. He told authorities he was worried because his brother wasn’t answering the phone or the door and his car was parked in the driveway, Brady said.\nWhen the firefighters arrived on the scene, the person inside was unresponsive, so they decided to force entry, police said. As that was happening, the person inside fired several rounds, striking two firefighters and his brother, authorities said. Police said that once officers got into the home, the gunfire stopped.\nThere were no police officers present when the firefighters decided to enter the home, Prince George’s County Police Department spokeswoman Julie Parker.\nBrady said that’s something firefighters do fairly routinely when there’s a concern about someone’s safety. He said anytime there is an incident such as this, the department will review its protocols and possibly make changes.\n“The firefighter medics made a decision that this was indeed a reason they needed to get into that house as soon as possible. Time could have been of the essence,” he said.\nAs of Saturday, no charges had been brought against the shooter and he was released from police custody Saturday evening, according to a statement tweeted by the police department.\nBrady said Ulmschneider was described as a “good old hard working country boy who loved his job.”\nDiana Krieger, whose daughter is married to Ulmschneider’s brother, told The Washington Post that he was a “caring man” who had dreamed of being a firefighter since high school.\n“He wanted to help others, he loved doing what he was doing, being a paramedic and a firefighter, and I really believe that he was doing God’s work,” Krieger told the newspaper.\nMaryland Gov. Larry Hogan ordered the state’s flag to be flown at half-staff in Ulmschneider’s memory.\n“His legacy as a husband, father and firefighter, and his commitment to protecting others, will not soon be forgotten by his loved ones, the community, or Maryland,” Hogan said in a statement.\nThe brother of the man who lived at the home was not seriously injured, Prince George’s County police Chief Henry P. Stawinski III said at a news conference. The person who was inside the home was in custody and cooperating with police, he said. Police have not released their names.\nTwo other firefighters with the Morningside Volunteer Fire Department suffered minor injuries while seeking cover after the shooting. He says one firefighter injured a knee and the other injured her jaw. The two were treated at the hospital and released Saturday.\nThis story has been corrected to reflect that the slain firefighter’s name is Ulmschneider, not Ulmshneider, and that he was 37 years old, not 39."}