{"uri": "http://nbc4i.com/2016/09/13/teen-sentenced-to-172-years-in-prison-for-quadruple-murders/", "title": "Teen sentenced to 172 years in prison for quadruple murders", "dct": "Tue, 13 Sep 2016 11:28:00 GMT", "id": "0ffdb48b80db0ed0ad66811f09dbe81e", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCOLUMBUS (WCMH/AP) — A 17-year-old suspected gang member has been sentenced to 172.5 years in prison after being convicted of aggravated murder and other charges for his role in a quadruple homicide during a robbery at a South Linden home last year.\nJordyn Wade was sentenced Tuesday after being convicted Friday by a Franklin County jury in May in connection to the June 13, 2015 attempted murder of one victim, and the quadruple murders of Michael Ballour, age 41, Daniel Craig Sharp, age 26, Angela D. Harrison, age 35, and Tyajah N. Nelson, age 18, that occurred in the basement of Ballour’s house located in the 1600 block of E. Hudson Street in South Linden.\nWade and his co-defendant Robert Lee Adams, age 27 (at the time of the murders) robbed the victims, ordered them to the basement, and Adams then shot the victims, murdering four of them and wounding a fifth individual. After the shooting Adams and Wade fled the scene. One of the five victims survived the shooting and stumbled from the residence where she sought help. Wade was picked up shortly thereafter.\nAdams could face the death penalty if convicted during his trial scheduled for January. Wade wasn’t eligible for the death penalty because he’s a juvenile.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}