{"uri": "http://www.seattlepi.com/local/article/Charge-Auburn-bar-fight-ended-in-6197876.php", "title": "Charge: Auburn bar fight ended in ‘execution-style’ killings", "dct": "Mon, 13 Apr 2015 00:00:00 GMT", "id": "4c0b4b2f8d8947c866f8e9945b6b51cf", "content": "Two years after a three people were shot dead in a gunfight outside an Auburn sports bar, a Kent man has been charged in two of the killings.\nKing County prosecutors claim Cleanthony Baby Ray Jimerson killed Nicholas John Lindsay and Lorenzo Deshawn Duncan during a March 31, 2013 shootout. Jimerson, 29, was also shot during the early morning gunfight outside the Sports Page Tavern.\nNow charged with two counts of second-degree murder and related crimes, Jimerson was arrested Friday outside Austin, Texas. Prosecutors in Seattle are preparing to extradite him.\nProsecutors claim Jimerson, a convicted felon, grabbed a gun from his car after a fistfight broke out in the bar parking lot. He is alleged to have fatally shot Lindsay and Duncan at close range.\n“He shot and killed both Nicholas Lindsay and Lorenzo Duncan while they were on the ground, defenseless,” Senior Deputy Prosecutor Charles Sergis told the court. “Several witnesses describe the killing as execution-style.”\nCharging papers describe a chaotic clash between two groups of people shortly before 2 a.m. in the parking lot of the Sports Page, located at 2802 Auburn Way North.\nPolice arrived to find Lindsay, 26, and Duncan, 23, dead alongside a third shooting victim, 21-year-old Antuan Greer. Officers recovered spent casing and live rounds in five calibers, indicating several shooters were involved in the gunfight.\nJimerson arrived at an Auburn hospital minutes later. He’d been shot several times, and driven there by his brother. Shot three times, Jimerson was rushed to Harborview Medical Center.\nInvestigators claim Jimerson and several members of his family were at the bar as part of a “going away party” for his brother, who was headed to prison for gun crimes. Lindsay, Duncan and Greer were attending a birthday party that night.\nAn argument on the dance floor spilled out into the parking lot, where a fist fight ensued, an Auburn detective said in charging papers.\nRecounting video of the fight, the detective said Lindsay was knocked to the ground by a “sucker punch.” Greer was trying to pull people away from Lindsay, when the shooting started.\nWhile witness accounts varied, investigators claim several described seeing Jimerson stand over Lindsay and shoot him twice. According to charging papers, Jimerson shot Duncan as he attempted to run from the fight, and then shot him again after he hit the ground.\nJimerson was shot moments later, according to charging papers. He is alleged to have crawled into a car still holding his pistol, and then waited for his relatives to take him to a hospital.\nThe person who claimed to have shot Jimerson told police he did so because he wanted to stop him from killing, the detective said. Another witness told police the shooting “was not a ‘gangster hit’ like it has been rumored but ‘an act of cowardice.’”\nAutopsies of the slain men would show that Lindsay was shot in the upper chest with a bullet that struck his heart. Duncan was shot in the back and in the face, wounds that appear to support witness accounts that he was first show while running away and then executed.\nAccording to charging papers, Jimerson denied shooting anyone and claimed to have been shot while attempting to leave the bar.\nInvestigators claim at least five people were shooting during the gunfight. It is not clear from charging papers whether any suspects have been identified in Greer’s killing, or if he was caught in the cross fire.\nJimerson is subject to a $5 million warrant. He has been charged with unlawful gun possession as well as two counts of second-degree murder.\nSeattlepi.com reporter Levi Pulkkinen can be reached at 206-448-8348 or levipulkkinen@seattlepi.com. Follow Levi on Twitter at twitter.com/levipulk."}