{"uri": "http://www.thegleaner.com/story/news/2016/11/18/17-year-old-girl-dies-henderson-shooting-thursday/94063008/", "title": "17-year-old girl killed in Henderson shooting identified", "dct": "Fri, 18 Nov 2016 00:00:00 GMT", "id": "99c1b7df997c8f5a3fea29b680d2affb", "content": "Henderson police are trying to determine who fired the shot which killed a Henderson County High School sophomore Thursday night during a gun battle in an alley off Powell Street.\nAutumn Burkhart, 17, died during surgery at St. Mary's Medical Center in Evansville. An autopsy has been scheduled for Saturday in Vanderburgh County.\nAnother Henderson resident, Elijah Roberts, 18, a student at Central Academy, was also shot and is being treated at St. Mary's. A third Henderson resident, Joshua F. Bumphus, 25, 1000 block of First Street, has been charged with first-degree assault.\nNo one has been charged with murder since it's not yet been determined who fired the fatal shot, according to Sgt. Russ Stoner of the Henderson Police Department.\n\"We haven't determined if Autumn was hit intentionally or accidentally,\" he said.\nDetails are still coming together, but here is what police have released thus far:\nBurkhart was a friend of Bumphus. Roberts and Bumphus met up around 9 p.m. in an alley which connects Powell and Clay streets in the 1000 block of Powell Street about three doors down from Metzger's Tavern.\nStoner said both Roberts and Bumphus came to the alley armed.\n\"We're still investigating what led up to the shooting, but Elijah is a suspect in a recent burglary that occurred at Joshua's house. We believe the shooting is in retaliation,\" Stoner said. No one has been charged with this burglary, officials said.\n\"They met in the alley. Elijah was in a vehicle and pulled into the alley. It's not been determined if Elijah was alone in the car,\" he said. \"There were multiple people who congregated in the alley.\"\nBurkhart was in the alley, but it's uncertain if she was in the car with Elijah or standing outside of it with other people, including Bumphus.\n\"Witnesses said Joshua went up to the car and started shooting into the vehicle,\" Stoner said. \"Elijah was struck at least twice by bullets.\"\nA lot started happening at once, he said.\n\"Elijah reached for something which turned out to be a handgun. He started firing shots while trying to drive away,\" Stoner said. \"Elijah backed out of the alley, struck a nearby mobile home, turned around and left the scene. He went to a residence in the 800 block of Washington Street where he was located by officers.\"\n\"We don't know where Autumn was when she was struck by a bullet,\" Stoner said. \"She was found between a mobile home and a storage building on Julia Street and transported to the hospital by ambulance.\"\nThe Vanderburgh County Coroner's Office said Burkhart died around 11:30 p.m. during surgery at St. Mary's.\nStoner said Friday that only the handgun which Roberts was reportedly using has been located by police.\nSteve Watkins, owner of Metzger's, said he had returned to the tavern -- which had closed for the night -- to finish up some work-related items when the shooting occurred.\nHe said when he got to Metzger's he saw multiple \"kids\" in the alley.\nThen while at work inside the business, he said, \"I heard what sounded like shots coming from a kid's cap gun. That's what it sounded like from inside the tavern. I never associated it with gun play.\"\nOnce emergency responders started arriving in the area is when Watkins said he became aware of the shooting and that people had been injured.\nNeither Roberts nor Bumphus are considered first-time offenders.\nBumphus -- whose criminal history includes theft, fourth-degree assault and driving under the influence -- was scheduled to appear in a Henderson court Monday, Nov. 21, on domestic related charges, according to information gathered from the Henderson Judicial Center.\nAs for Roberts, he was sentenced in Henderson Circuit Court on April 25 to two years for first-degree wanton endangerment and possession of a handgun by a minor after an alleged drive-by shooting at the John F. Kennedy Community Center. That shooting occurred in August of 2015. City police said Roberts fired into a crowd of people who were at the basketball courts. No injuries were reported.\nRoughly two months later, on June 24, according to court papers, Roberts was released from prison after being granted shock probation. He was placed under the supervision of Probation and Parole, court documents said.\nIn mid-October, less than three months after his release, a bench warrant was issued from Henderson Circuit Court after Roberts failed to pay court costs. Roberts pleaded guilty to contempt of court and paid the fines in full, court records show.\nOn Oct. 31, Roberts was sentenced in Henderson Circuit Court to 30 days for contempt of court. The sentence was conditionally discharged \"with the stipulation that he commit no new offenses or have any further violations of the law,\" court documents show.\nMeanwhile, the Henderson County School District is offering support to high school students and staff in the wake of Burkhart's death.\n(Photo: KELLY WENZEL / THE GLEANER)\nHenderson County High School Principal Chad Thompson said “It was a sad day at Henderson County High School. We lost a longtime student and friend. She was a Colonel – Colonels care for each other, we support each other, and we help each other.”\n\"This morning the Crisis Intervention team provided extra counselors and school psychologists for students and staff at Henderson County High School in response to the tragic death of sophomore Autumn Burkhart,\" a press release from the school system said. \"Students assembled in the auditorium and in small group settings to grieve for their friend and classmate. In addition to school staff, community agencies and surrounding school districts responded by sending in counselors for students and staff.\n\"Students processed their grief by writing poems, creating cards for the family, and creating a picture tribute video of Autumn. Henderson County Schools would like to thank the community for their support and thank the staff at Henderson County High School for providing extra care and support today. Individual counseling will continue to be offered for students. Our sympathy and prayers are extended to the families involved.\""}