{"uri": "http://www.nola.com/crime/index.ssf/2016/05/laplace_dad_thought_gun_used_i.html", "title": "LaPlace dad thought gun that killed daughter was in garage safe", "dct": "Tue, 24 May 2016 18:15:00 GMT", "id": "9792b9af09a76017247bad20a00b9df9", "content": "Eric Moore told deputies he instructed a friend to lock his handgun in a garage safe. The friend told deputies he put the weapon on top of the safe.\nJust how the Springfield XD .45-caliber semiautomatic pistol ended up on a table in Moore's LaPlace home, where authorities say his 5-year-old daughter, Haley, found it and fatally wounded herself, is not clear from the initial police report, released Tuesday (May 24) by the St. John the Baptist Parish Sheriff's Office. The Sheriff's Office has classified the shooting as accidental, but Sheriff Mike Tregre said the agency will send its findings to the district attorney's office to decide whether criminal charges are warranted.\nHaley shot herself once in the chest Saturday, authorities said. That was the morning after Ian Adams of LaPlace visited the house to help his friend clean the place. The two-page police report says Adams told deputies he found the unholstered gun \"wedged between the top of the living room sofa and the wall,\" the report states.\nMoore told a deputy that he instructed Adams to put the weapon inside a security turn dial combination safe in the garage. But Adams told authorities he placed the gun on top of the safe.\nThe two men left the house together Friday night. Adams said Moore dropped him off at his own house.\nSaturday morning, Haley and her two older siblings were dropped off at their father's house by their grandmother, according to the police report. Moore and his wife are divorced, and his wife has said the children were taken to his house for his visitation.\nMoore told a deputy that he was in the shower when he heard a loud \"pop.\" He said he ran to the living room and that his older daughter told him Haley had been playing with the gun.\nHe summoned deputies with a 911 call at 9:44 a.m. They found the girl lying on her left side in a pool of blood in the kitchen and attempted cardiopulmonary resuscitation, according to the report. Paramedics arrived at 9:50 a.m. and took Haley to Ochsner's River Parishes Health Center, where she was pronounced dead, according to the incident report.\nHaley Moore's funeral will occur at 9 a.m. Thursday (May 26) at St. Peter's Catholic Church at 1550 Louisiana 44 in Reserve.\nAfter the shooting, Moore told deputies, he placed the gun on a desk near a computer printer. Deputies found it there, according to the police report. The magazine clip had been removed. There was one spent cartridge.\n. . . . . . .\nCORRECTION: An earlier version of this article, based on the written police report, identified the gun as a Springfield XP .45. But a Sheriff's Office spokesman said it was a Springfield XD .45."}