{"uri": "http://www.latimes.com/local/lanow/la-me-ln-lapd-shooting-20161006-snap-story.html", "title": "16-year-old boy killed by LAPD called 911 before the shooting and left a 'farewell note,' police say", "dct": "Thu, 06 Oct 2016 18:10:00 GMT", "id": "a38b485fea2c57fa3b2f44042e3bd546", "content": "A 16-year-old fatally shot by a Los Angeles police officer in South Los Angeles called 911 himself before the shooting and left his family a “farewell note,” leading investigators to believe he had a “desire to end his own life,” LAPD chief Charlie Beck said Thursday.\nCoroner’s officials identified the boy Thursday as Daniel Enrique Perez, who police say was shot after pointing a realistic-looking replica gun at officers.\nBeck said detectives identified Perez through a cellphone he was carrying, which was used to call 911 about 20 minutes before the deadly encounter. The caller reported a man with a gun matching Perez’s description, Beck said.\nOne of Perez’s parents believes it was the teenager on the recorded call, the chief added.\nBased on that call, the note, Perez’s actions and his “prior history” described by family, Beck said he believed the shooting stemmed from Perez’s “desire to end his own life.” Beck declined to detail that history, saying he would not “put this family through any more trauma.”\n“We are deeply saddened by these events,” the chief said. “The tragedy is hard to describe.”\nThe officer who shot Perez, Beck said, “is devastated.”\nIt was the second deadly shooting by LAPD officers during a roughly 24-hour span, coming soon after the controversial shooting of 18-year-old Carnell Snell Jr., which prompted protests and stirred long-standing frustrations over how police treat residents of South L.A.\nOn Sunday, during a second night of demonstrations over Snell’s death, news spread of the second police shooting.\nOfficers went to 48th Street and Ascot Avenue after someone reported a man with a gun in the area, Beck said earlier this week. The officers spotted someone matching that description — a Latino man with a gray sweater and black pants — and began to approach him, Beck said.\nThat person, now identified as Perez, then turned and pointed a handgun at the officers, Beck said, prompting police to open fire.\nParamedics took Perez to a hospital, where he died later that evening.\nThe gun turned out to be a replica weapon, with its orange tip covered by black paint or pen, Beck said.\nPolice initially described the person shot as a man between the ages of 18 and 22. A second person near the scene was initially detained and questioned but did not know Perez or see the shooting, Beck said.\nThe officers who shot Perez were wearing body cameras. Beck said Thursday he had “no immediate intention” of releasing that footage, which he said “clearly depicts his actions and his death, which are entirely consistent with the officers’ version of events.”\nOne woman who said she watched the shooting from her family’s home across the street told The Times that Perez appeared to put his arms by his side, but that she could not see his hands. Tiffany Peterson, 45, said police fired again when Perez was on the ground.\nBeck said earlier this week that the body camera footage “clearly refutes” reports Perez was shot while on the ground.\n“That did not happen,” he added.\nIn a rare move earlier this week, Beck released a security video from the moments leading up to Snell’s shooting, which showed the 18-year-old holding a handgun. Beck said Snell later turned toward officers while holding the gun, prompting them to fire.\nMany activists and residents of Snell’s neighborhood have questioned the police account of the shooting, including whether he had a gun.\nBeck, generally a staunch advocate of keeping such videos confidential, said he released that footage out of concern for public safety as well as to correct what he described as “significant misinformation” about the events leading up to Snell’s death.\nFollow me on Twitter: @katemather\nALSO\nSlain deputy mourned — even by those he arrested\nLong Beach police believe man caught on video shot and killed mother and 4-year-old daughter\n‘It’s like living in a war zone': Westmont grows more weary of violence after police shooting\nUPDATES:\n5:42 p.m.: This story was updated with additional comments from LAPD Chief Charlie Beck about the shooting and body camera footage.\n3:35 p.m. This story was updated with comments from LAPD Chief Charlie Beck and news of the “farewell note.”\nThis story was originally published at 11:50 a.m."}