{"uri": "http://www.wmcactionnews5.com/story/34266281/shooting-reported-at-cordova-community-center", "title": "3 arrested for shooting at Sweet 16 party", "dct": "Mon, 16 Jan 2017 05:28:00 GMT", "id": "55f36f92009b95ebbd28c3db1bb5f198", "content": "CORDOVA, TN (WMC) -\nPolice rushed to Bert Ferguson Community Center on Sunday night after a teen was shot.\nAccording to Memphis Police Department, there was an invitation-only birthday party at the community center Sunday night when uninvited guests tried to come in.\nThe uninvited guests were asked to leave, and officers helped move a large crowd away from the building.\nAs the group began to dissipate, people inside several cars started firing shots towards the crowd.\nA 15-year-old boy was shot in the foot and taken to the hospital in non-critical condition.\nThat 15-year-old was barely able to walk on Monday with his right foot covered in bandages.\n\"People have families. Like I said, that's my baby brother. Had I lost him, that would've crushed me,\" the victim's brother Chadwick Baker said.\nPolice said the 15-year-old was not the intended target.\n\"We know there were some people trying to get in that weren't supposed to, and when they wouldn't let them in, that's when they came back and started shooting,\" Baker said.\n\"I was scared. I was running trying to get away,\" a 14-year-old witness said. \"After the gunshots, we were trying to get back in, and they wouldn't let anybody in.\"\nOfficers said one of the shooters drove off in a grey Toyota Corolla. MPD tracked and pulled over that vehicle at the intersection of Wesley Woods Drive and Wesley Woods Circle.\nFour people were inside the car (three men and a woman). Police searched the car and found two stolen handguns.\nOfficers arrested Michael Barr, 18, and Javonte Deberry, 20. They are charged with aggravated assault.\nMPD arrested a charged a third person in the crime. That suspect is a juvenile whose identity and age have not been released.\n\"You can't expect to go around shooting up things and not expect to have consequences,\" Baker said.\nCity of Memphis released the following statement about the shooting:\n\"The fact that shootings have occurred near our community centers underscores the local challenges we have with gun violence and the need for us all to work together to address it.\"\nCopyright 2017 WMC Action News 5. All rights reserved."}