{"uri": "http://www.lohud.com/story/news/crime/2016/12/31/shooting-mount-vernon-new-years-eve/96040448/", "title": "Mount Vernon mourns loss of teenager killed in crossfire on New Year's Eve", "dct": "Sat, 31 Dec 2016 00:00:00 GMT", "id": "162e8f12715db532e2fd5a2e104fa770", "content": "Mark Vergari/lohud\nThe city of Mount Vernon grieved New Year’s Eve with the news that a 13-year-old girl was unintentionally shot and killed in broad daylight Saturday afternoon, the city's second fatal shooting in less than a week.\nShamoya McKenzie was a passenger in a vehicle driving near the 300 block of E 3rd Street around 2:30 p.m. when she was shot in the head, city officials said at a press conference later that evening. The teenager was pronounced dead shortly after at Montefiore Mount Vernon Hospital.\nA 28-year-old Mount Vernon man was also found at the scene, near 3rd Street and Pease Street, with a gunshot wound to the arm, according to Capt. Edward Adinaro of the city police department. The wounded man, whose name was not released, was taken to a different, unnamed nearby hospital and is expected to live.\nA police officer stands next to a red Toyota car at the junction of Chestnut Place and 3rd Street in Mount Vernon. The car had a bullet hole on the right passenger side window. (Photo: Colleen Wilson/The Journal News)\nA red Toyota with a bullet hole in the right side passenger window was sitting idly Saturday afternoon where it was taped off and guarded by a police officer. The vehicle was facing east at the junction of Chestnut Place and 3rd Street.\n“We have no suspect information at this time,” Adinaro said. He urged anyone with information to call the Mount Vernon Police Department.\n“Today, Mount Vernon’s heart is not just heavy but it’s broken and to know that one of our youngest, aspiring scholars has succumb to senseless gun violence is just a real tragedy,” said Mount Vernon Mayor Richard Thomas.\nMcKenzie was an eighth grader at the k-8 Graham School in Mount Vernon, where she was a rising star on the school’s basketball team.\nAyo Hart, the coach of Mount Vernon's varsity basketball team, said McKenzie was known for more than just her athletic abilities.\n“She was more than a rising star on the court. She excelled academically,\" Hart said in a text message Saturday night. \"She was a beautiful, intelligent young lady who brightened the room with her smile. She was her mother's only child.\"\nHugh Marriott, a pastor at the Allen Temple AME Church in Mount Vernon, spoke at the press conference and said his daughter played on the basketball team with McKenzie and called her one of the city’s brightest.\n“We have lost a bright, beautiful, young girl who had a lot of promise and represents the best of Mount Vernon,” Marriott said.\nMcKenzie’s family, who Marriott said he saw at the hospital, are in disbelief.\n“It still hasn’t sunk in that they have lost their child,” Marriott said. “We grieve tonight and we look forward to justice being served but also to us getting through this because we’ve seen too many tragedies and we will get through this together.”\nNearly a week ago on early Christmas morning, the owner of the Mount Vernon nightclub Mansion, located on N. Third Avenue, was shot dead and five others injured in front of the club.\nErrol Hillary, 39, was in the process of being removed from the venue when he removed a gun from his waistband and started firing shots. Hillary was arrested at the scene and a grand jury voted to indict him on a second-degree murder charge earlier this week.\nStudents are encouraged to visit Graham School, at 521 E 5th St., from 9 a.m. to 1 p.m. on Sunday where social workers and grief counselors will be stationed. In addition, a remembrance gathering will also be held Sunday from 2 p.m. to 4 p.m. at Mount Vernon High School, located at 100 California Rd.\nMount Vernon police are asking that anyone with information about Saturday’s shooting to call the department's major case unit at 914-668-6841 or the detective division at 914-665-2511."}