{"uri": "http://fox59.com/2016/04/25/father-of-murder-victim-thanks-impd-for-gett-money-gang-investigation/", "title": "Father of murder victim thanks IMPD for ‘Gett Money Gang’ investigation", "dct": "Mon, 25 Apr 2016 20:14:00 GMT", "id": "33d96abae1c6625c6ad26f12f78f085a", "content": "INDIANAPOLIS, Ind. -- Having lost three sons to violence, Clarence Havvard describes last August 26 as one of the worst days of his life.\nThat night, his 32-year-old son Clarence Wade Havvard was gunned down in the 300 block of Bernard Avenue in what a federal and local investigation found was the first fatal attack in a bloody war that pitted two north side gangs against one another and resulted in a massive roundup of suspects last week.\n“It's just so awesome how quickly things come together and clears a path for peace,” said Havvard, standing in the front yard of his home just blocks from where Wade died. “I’m very grateful to you, the police department, the mayor, the FBI, everyone that played a part in this. I get a lot of relief from it but it still doesn’t bring my son back.”\nAccording to the probable cause filed against 15 members and associates of the \"Gett Money Gang,\" a trail of violence dating back to the shooting on the downtown canal on St. Patrick’s Day of 2012 left death and mayhem for more than three years and led up to a fight on the midway at the Indiana State Fair last August 8.\nAn Indiana State Trooper was injured breaking up the brawl between GMG and KG, a gang from the south Butler/Tarkington community.\nGMG was headquartered several miles north in the 6400 block of Scenic Court and the Creekwood Apartments.\nOn August 26, Havvard was fatally wounded as he stood in the yard of a relative of Nicko Hutchins, a member of KG.\nOn September 9, Bryant Jackson was shot to death on Scenic Court.\nCourt documents indicate Jackson, “was considered a brother” to GMG members Chuckie and Tarell Davis.\nThe next day, near 40th and Boulevard Place, “A female…was shot as she drove from her residence.”\nInvestigators found “the .40 caliber casings matched casings from the (Havvard) homicide.”\nTen days later, at the home of Hutchins in the 3900 block of Graceland Avenue, gunmen sprayed bullets at family members gathered for a wake after the passing of an elderly relative.\nDeshaun Swanson, 10, was killed as police searched the crime scene and found “casings matching casings recovered from aggravated assault…on September 10.”\nEarlier in the evening, a relative of the Davis brothers shot a video as he rolled down Graceland Avenue, past the Hutchins’ house, while lyrics of background music warned of “retaliation.”\nThat video was posted on Facebook as a source told FOX59 News that within hours the relative called homicide detectives to claim that despite the warning, he had nothing to do with the killing on Graceland.\nThe murder of Deshaun galvanized the neighborhood, police and media as attention and investigators flooded the community but not before two more people were killed and eventually drug dealing and violence disappeared from the streets.\nPrayer vigils and peace marches became commonplace as residents began their own neighborhood patrol and made contact with neighbors from the northern side of the community.\nFormer U.S. Attorney Joe Hogsett walked the neighborhood weeks before his election as Indianpolis mayor last fall.\nOn November 13, Chuckie Davis, a purported leader of GMG, was identified as the shooter in an unsuccessful drug robbery on Lake Nora Drive.\n“Davis…fired a Glock handgun with an extended magazine,” reads the GMG probable cause. “Shell casings…match those recovered from…homicide of Clarence Havvard.”\nIn December, a weapon matching the description of Davis’ gun showed up for sale on the Instagram account of gang member Daitwon Williams, the accused triggerman of the unsolved canal shootings in 2012.\nMore shootings followed on Scenic Court but throughout the investigations, detectives reported, “All involved refused any further cooperation and nobody has been charged.”\nIn December a federal judge signed off on wiretaps of gang member cell phones to record conversations. That evidence matched with tapes of phone calls from inside the Marion County Jail, along with social media postings, police reports and surveillance videos that led to the gang conspiracy, drugs and weapons charges against GMG.\nClarence Havvard admitted it was frustrating to wait eight months for answers to the murder of Wade.\n“I guess I was a little rushy just trying to make sure we find the killer of my son and the little guy, 10-year-old Deshaun,” he said. “I was just praying on it and eventually things start clearing up and coming to the light.”\nAs tragic as his loss, Havvard is grateful his neighborhood stood up to the violence and banded together to welcome police and outsiders in to help bring the suspects to justice even though they may never be charged with his son’s death.\n“I feel more confident that it will be bringing a lot of peace to the streets,” he said. “The community will be more safer because of the people who will not be out here doing all this shooting and so forth.”"}