{"uri": "http://www.wthr.com/story/30071202/4-shot-including-1-juvenile-on-north-side", "title": "Search continues for suspect who killed 10-year-old, injured 3 in north side shooting", "dct": "Sun, 20 Sep 2015 01:05:00 GMT", "id": "58d5cc2b72ce7804e4a319a8626e9ca2", "content": "A child was shot and three others were injured in a north side shooting Saturday night. Police identified the victim Sunday as ten-year-old DeShaun Swanson. The three other victims that were shot are expected to survive.\nPolice were called to the 3900 block of Graceland Avenue around 8:35 p.m. The juvenile was taken to Riley Hospital for Children where he later died.\n\"If you gonna shoot someone, how bout you shoot yourselves?\" said Megan Reid, the victim's cousin. \"That boy didn’t deserve it. He didn’t even get to live his life or go to college or anything like that.\"\nThe other victims include a second child, who was listed in stable condition Saturday night, and two adults.\nWitnesses told police they saw a vehicle in the area carrying people who may have started shooting at a group standing outside the home. Those outside were gathered to mourn the passing of the family's matriarch - grandmother to the child who died - last week. She lived at the same house. Relatives said they have not even buried her yet.\n\"He's 10 year-old and to be shot in the stomach, and his mother, to have to perform CPR on her own child--that's why Shana's just numb,\" said Shannel Towns, Swanson's aunt. \"She don't know what to do, she don't know where to turn or anything and we just need this person to be held responsible for his action.\"\nSeveral shell casings from several calibers of weapons were found outside the home there. The victims went inside after the shooting.\n\"The family was angry-- very angry!\" said Rev. Charles Harrison of the Ten Point Coalition, which showed up shortly after the shooting in an effort to calm what had quickly begun to turn into a chaotic scene. \"People were calling out the name of Christ and pleading to God for God to do something to help stop this madness. So at that point, we started praying with the family.\"\nSuggested Links\n\"Sometimes the missing component, or the common denominator is the absence of Christ in the life of people, so we come to bring Christ to a crisis,\" added IMPD Sr. Chaplain David Coatie.\nPolice said this incident does not appear to be random, but do not yet have any suspect information. They did confirm that they went to the same house in February as part of an undercover investigation.\n\"We're hearing about turf wars and people fighting over drug trafficking in this neighborhood,\" Rev. Harrison said Sunday morning on Eyewitness News Sunrise. \"So, something is going on and we have to get to the bottom of what it is....Neighbors can, I believe, begin to police their own neighborhood and bring a sense of calm because there are people in this neighborhood who know what happened.\"\nSwanson's murder is the ninth in two weeks. Pastor John Girton with Christ Missionary Baptist Church is halfway through his 30-day camp out near the corner of 30th and MLK, and he's placed nine crosses near his camp for each murder.\nHe's hoping the ninth cross is the last he'll place during his mission.\nDetectives urge anyone with information to call Crime Stoppers of Indiana at (317) 262-TIPS. Callers may also text “INDYCS” plus tip information to 274637 (CRIMES)."}