{"uri": "http://www.tennessean.com/story/news/crime/2016/05/26/police-investigate-shooting-death-nashville-teen/84964210/", "title": "Police investigate shooting death of Nashville teen", "dct": "Thu, 26 May 2016 00:00:00 GMT", "id": "544ad37250ab17bb6f32940cb99ac9a4", "content": "Metro police are investigating the death of a Nashville teen who authorities say suffered a fatal gunshot wound inside a friend's home over the weekend.\nDeAndre T. Kpana-Quamoh, 18, of Milton Drive, died Sunday evening in what appears to be an accidental shooting at a North Nashville residence, police spokeswoman Kris Mumford said Thursday.\nOfficers were dispatched to a home in the 2700 block of Hydes Ferry Road at 10:45 p.m. for a report of a shooting and found Kpana-Quamoh lying on the floor of a bedroom suffering from a gunshot wound.\nA preliminary investigation revealed the teen, who had the gun with him in his possession, was at his friend's home, thought the gun was unloaded and at some point the gun fired, striking him, Mumford said.\nThe teen was taken to Vanderbilt University Medical Center where he was pronounced dead.\nAlthough the shooting appears to be accidental, Mumford said, the case remains open pending the results of an autopsy by the Davidson County Medical Examiner.\nKpana-Quamoh is survived by his parents, Samuel and Terric Kpana-Quamoh (Ramey).\nA four-time Tennessee Secondary School Athletic Association state meet qualifier for East Nashville, Kpana-Quamoh clocked the state’s second-fastest Class A-AA qualifying time with a 39.68 at last week’s Middle Sectional, while also helping lead the Eagles’ 400-meter relay team to a sectional title (42.61).\n“Just like (Kpana-Quamoh’s) father said last night, when he waked into a room or field or track he lit the place up because he had one of those magical smiles,” East Nashville boys track coach Louis Hines said of Kpana-Quamoh, who had received an academic scholarship to attend Alabama State University. “He took care of business in the classroom as well, and his good habits there followed him right onto the track.”\nFamily and friends have created a Go Fund Me site to help pay for the cost of his funeral. To donate visit https://www.gofundme.com/25p3jczw.\nMichael Murphy contributed to this report.\nReach Natalie Neysa Alund at 615-259-8072. Follow her on Twitter @nataliealund."}