{"uri": "http://wiat.com/2016/11/12/one-dead-after-2-people-shot-2-stabbed-in-dekalb-county-on-friday-night/", "title": "One dead after 2 people shot, 2 stabbed in DeKalb County on Friday night", "dct": "Sat, 12 Nov 2016 13:54:00 GMT", "id": "e54251b7626515450af98d6af2832374", "content": "DEKALB COUNTY, Ala. (WIAT) — Four people were harmed in two separate incidents on Friday Night, resulting in one death, according to a release from Sheriff Jimmy Harris.\nThe Sheriff’s Office was informed of a possible shooting in the Kilpatrick area after two victims arrived to an emergency room with a personal vehicle, suffering from gunshot wounds. One victim is a Latin male in his early 20’s, the other a juvenile.\nOne patient was flown to a hospital in Huntsville, and the other to one in Birmingham. Witnesses to the shooting told the Sheriff’s Office that they saw a small, dark colored SUV pull up beside the victim’s white van on Road 9055 and begin firing. Anyone with any information is asked to call DeKalb County Sheriff’s Office at (256) 845-3801.\nThat same night, the Sheriff’s Office and Henagar Police responded to a residence on Road 1945 to a report that a male had been stabbed. When they arrived on the scene, they found Cody Earl Seegar, 29, suffering from a stab wound.\nSeegar was pronounced dead at the scene. According to witnesses, Seegar and another man, 48-year-old Anthony Tracy Shaw, entered a home on Road 1945 to confront the homeowner following a family dispute from earlier in the day, and reportedly began to assault the homeowner.\nShaw and Seegar were both stabbed by the homeowner, and Shaw was transported to Erlanger Medical Center.\nThe investigation is still ongoing.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}