{"uri": "http://www.newsnet5.com/news/local-news/cleveland-metro/woman-who-lost-father-daughter-in-deadly-shooting-speaks-out", "title": "Cleveland woman who lost father and daughter in deadly shooting speaks out", "dct": "Tue, 02 Jun 2015 18:47:00 GMT", "id": "18cdce2225a8079a914185ae30562799", "content": "Autoplay:XFriend of gunman who killed ex girlfriend & her grandfather said suspect had a jealous temper\nCLEVELAND -\nKellie Giovanis sat on the front stairs of her home on Cleveland's west side as she wiped away what feel like endless tears.\n“I have to be strong for my mom,” she said.\nCleveland Police said Giovanis' daughter, 24-year-old Brittany Reid, was shot and killed by her ex-boyfriend Sunday night in the home where she was living with her grandparents on Laverne Road.\nFriends said Reid only dated Kevin Wardzala a few weeks or months, but recently ended the relationship.\nWardzala, who turned 30 years old on Thursday, went to the house on Laverne Road where he shot and killed Reid and her grandfather Bob Clarke, according to police.\nReid's grandmother was shot, but survived.\nGiovanis must now make funeral arrangements for her father and her daughter.\n“At least they're together and I have some comfort in that,” Giovanis said.\n“Brittany was beautiful she was my first born child. She was going to college and working at Marcs in Rocky River. She loved photography and animals. She was a shy artist who wanted to work with animals; she loved animals,” Giovanis said. “My dad was in Vietnam. It was his job as a combat medic to save people's lives, so this doesn't make sense. I miss my dad's smile. I talked to him every day. He helped me in so many ways and he was very funny.”\nJoshua Sulins lived across the hall from the gunman in an apartment building on Cleveland's west side.\nSulins said Wardzala had a temper, was jealous and controlling, but thought he wasn't capable of murder.\nSulins told newsnet5.com's Paul Kiska that Brittany was an “innocent, kind, a great soul.”\nSulins said Wardzala hid using drugs from Brittany and got angry easily. He also said Cleveland Police searched Wardzala's apartment on Monday.\nKevin had cats in there and his nickname was Revan, after a character in a video game he played.\nSulins said both Reid and Wardzala worked for a discount grocery store chain and met through mutual friends.\nA GoFundMe account has been set up to help the family with funeral expenses.\nA memorial service will be held for Bob Clarke and Brittany Reid Saturday at the Faith Presbyterian Church in Lakewood across from the Lakewood Police Department at 2 p.m.\n---\nFollow @PaulKiska\nDownload the newsnet5 app:"}