{"uri": "http://blog.gulflive.com/mississippi-press-news/2014/09/around_mississippi_2_dead_afte.html#incart_river", "title": "Around Mississippi: 2 dead after shooting at Batesville grocery store", "dct": "Sun, 21 Sep 2014 03:49:24 GMT", "id": "476272ac9963d4ce7af42f9ffb35ae93", "content": "Here are some news and notes around Mississippi today:\nIn Batesville, two men are dead after an early Saturday shooting at a rural grocery store near Batesville.\nPanola County Coroner Gracie Grant-Gulledge says the dead men are 20-year-old Quendez Robinson and 24-year-old Rodrick Scurlock. Gulledge says Robinson died of a gunshot wound after being taken to Tri-Lakes Medical Center, while Scurlock died at the store in the Curtis Station community, about 7 miles northwest of Batesville\nBoth were shot about 1 a.m. at the Hilltop Grocery, where a party was apparently in progress. At least two other people were shot and are recovering.\nPanola County Sheriff Dennis Darby tells WATN-TV that two gang rivals may have argued. Deputies say a fifth person may have also been grazed by a bullet. Officials are currently questioning several people.\nIn Jackson, Hinds Community College will expand its nursing and allied health programs in Jackson after agreeing to move Mississippi State extension service employees to college property in Raymond.\nThe Hinds County Board of Supervisors voted Sept. 2 to accept the swap.\nThe college will gain use of 11.5 acres and two buildings. President Clyde Muse says one building will be renovated to house classrooms. The property adjoins the college's current nursing and allied health programs near Central Mississippi Medical Center.\nThe college could use the property for a surgical simulation center to help train students. Plans also call for a lodge for families of burn victims being treated at the hospital.\nThe 11 extension service employees will relocate to Eagle Ridge Conference Center in Raymond, possibly as early as Christmas.\nIn Vicksburg, members of the Mayor's Health Council hope to work out a plan under which the Vicksburg farmers market can accept electronic benefits transactions as part of a plan to improve the health of Vicksburg residents.\n\"If we don't get people healthier, they're always going to be sick and depending on the government's pockets,\" said council member Vanessa Prentiss, who teaches health classes at Kings Empowerment Center. \"This is our city, and we want our city to last and our people to last.\"\nCouncil member Gail Kavanaugh, nutrition director for the Vicksburg Warren School District, told The Vicksburg Post (http://bit.ly/YZ48V8) the system could involve the farmers market manager accepting EBTs -- electronic food stamps -- and issuing tokens that can be traded to market vendors, or allowing farmers to accept EBT payments at their booths.\nThe ability to accept EBT transactions would allow more access to fresh fruits and vegetables for low-income residents, Kavanaugh said. EBT is accepted at several farmers' markets around the state, she said.\n\"It's very important for the community to know this is in the best interest of farmers and the community,\" she said.\nSo far, the move has been a tough sell to farmers, she said.\n\"Many of them are skeptical and don't want the government involved in their business,\" she said."}