{"uri": "http://www.enterprisenews.com/news/20160831/11-year-old-shot-in-face-in-abington-home", "title": "Shock, grief in Abington after boy, 11, shot in face", "dct": "Sat, 28 Jan 2017 14:45:10 GMT", "id": "69b3569ae39ae77ee8e5e9b8bc6d7e92", "content": "A boy was accidentally shot by a handgun inside a Linwood Street home in Abington on Wednesday afternoon.\nABINGTON - Grief counselors have been made available to students at Abington schools Thursday after an 11-year-old boy was shot in the face while inside a Linwood Street home on Wednesday afternoon.\nThe boy was seriously wounded but reported to be in stable condition in a Boston hospital.\nAt 3:21 p.m., two boys inside 159 Linwood St. were involved in a shooting with a handgun, Plymouth County District Attorney Tim Cruz said during a press conference held two hours after the shooting.\nCruz said the victim, who was not identified, was in stable condition after being taken by medical helicopter to a Boston hospital.\n\"I would characterize any gunshot wound as potentially life-threatening,\" Cruz said when asked specifically if the injuries were considered to be life-threatening. \"We believe he's doing okay right now, but any gunshot wound is serious.\"\nThe victim is reportedly a student at the Woodsdale School in Abington, which opened along with other schools in town on Tuesday, Aug. 30. There is no school on Friday, Sept. 2.\nThe principal at Woodsdale, David Summergrad, directed media requests to the district offices on Tuesday morning. Superintendent Peter Schafer was not immediately available to comment when called at 11:45 a.m. Tuesday.\nOfficials stopped short of confirming the shooting as accidental, but believed there was no criminal intent.\n\"Obviously, it's early at this point,\" Cruz said. \"But I would say it's fair to say that we believe that someone did not intend to hurt somebody.\"\nCruz said he was \"not aware of that\" when asked if adults were inside the home at the time of the shooting.\nThe other boy involved is also 11 years old, Cruz said. He was seen after the incident being consoled by neighbors and fire officials on a nearby lawn.\nThe district attorney also said that both boys live in the \"nearby area\" of 159 Linwood St., but he did not specify where the victim lived.\n\"There's not a lot of things we can say right now because, like I said, we're still figuring them out,\" Cruz told the media.\nAbington Police scanner communication starting at 3:17 p.m. and ending at 3:33 p.m. Some communication may not have been recorded or included.\nAbington Fire scanner communication covering the same 16 minutes.\nAbington Police Chief David Majenski and Fire Chief John Nuttal declined to comment on the particulars of the case at the scene, but Majenski said that his responding officers would receive after-care and counseling as a result of being on scene.\nHow effective has the state’s safe-storage requirement for firearms been in preventing accidental shootings?\nVery\nSomewhat\nNot at all\nHow effective has the state’s safe-storage requirement for firearms been in preventing accidental shootings?\nCreate a poll with PollSnack\nHow effective has the state’s safe-storage requirement for firearms been in preventing accidental shootings?\nCreate a poll with PollSnack\n\"As you can imagine, it's a very difficult call to go on,\" Majenski said. \"It's a tragic issue and a tragic situation. It's absolutely difficult for everyone.\"\nThe Abington police chief said the parents of the boys were notified of the incident by the time Majenski and Cruz addressed the media at around 5:20 p.m.\nAn initial call into the Abington Police department indicated a woman found the victim and a gun on a bed inside the home. Cruz would not comment on that, citing the open nature of the investigation.\nA young boy said to be a friend of the victim was seen crying and being consoled outside of the home shortly after the shooting.\nNeighbors and property records identified the owners of the home as Chip and Kelly Halpin, but officials did not identify the victim.\nThe gun was reportedly owned legally.\nThe victim was initially taken to South Shore Hospital in Weymouth before being flown by medical helicopter to the Boston-area hospital.\nAround 6 p.m. State Police were taking photographs at the scene. The Plymouth County Bureau of Criminal Investigation and Crime Prevention and Control Unit were also investigating at the scene."}