{"uri": "http://www.nbcwashington.com/news/local/Man-Wanted-in-Death-of-3-Year-Old-Girl-Arrested-275275711.html", "title": "Police Arrest Man Accused in Shooting Death of 3-Year-Old Girl", "dct": "Tue, 16 Sep 2014 13:15:00 GMT", "id": "11e17f7428537db626d0c42db7194ca2", "content": "Prince George's County police say they have arrested the man wanted in the shooting death of a 3-year-old girl, ending a manhunt that spanned over a month.\nDavon \"Dro\" Wallace was arrested at 7 a.m. Tuesday on Jasper Street in southeast D.C., police said.\nInvestigators say Wallace, 25, got into an argument over clothing at a home in the 6900 block of Forest Terrace Drive on Aug. 10. He left the residence, went back with a gun and fired several shots into that same home, authorities say.\nOne of those bullets struck Knijah Amore Bibb of Northwest D.C., who was at the home to visit her cousins. Police said Wallace's intended target, a boy in his late teens, was not inside the home at the time of the shooting.\nMan Arrested in Shooting Death of 3-Year-Old Girl\nLast month, Knijah's mother pleaded with Wallace to come forward. \"You took a life that can never be replaced,\" she told News4 in an interview last month. \"I found my daughter laying in blood.\"\nKnijah would have turned four this month.\nRecently, the FBI had joined local authorities in their search for Wallace, expanding their search area and offering up to $45,000 for information that would lead to his arrest. Billboards featuring Wallace's picture were placed strategically along interstates and highways in D.C., Richmond, Virginia and parts of North Carolina.\nPolice believed Wallace was receiving help to elude capture in those areas.\nWallace is facing a first-degree murder charge; he was also wanted on a federal warrant for unlawful flight to avoid prosecution.\nAnyone who helped Wallace would also face federal charges for aiding and abetting.\n\"Everybody that was involved should be charged, and do some jail time,\" Knijah's mother said Tuesday.\nPolice are now working to establish a timeline of Wallace's whereabouts during the 38 days he managed to elude capture.\nShortly after the shooting, a Landover man, 24-year-old Brian Ray Campbell, was arrested for allegedly giving a gun and a ride to Davon Wallace."}