{"uri": "http://www.mlive.com/news/flint/index.ssf/2015/05/two_men_charged_in_shooting_at.html#incart_river", "title": "Two men charged in shooting at Southwestern Academy in Flint", "dct": "Wed, 27 May 2015 23:29:00 GMT", "id": "717fc9ea86a429d5a922a62d5902229e", "content": "FLINT, MI -- Two men have been charged and arraigned in a shooting at Southwestern Academy that left seven people injured Sunday.\nRayshawn Lareese Holmes, 18, of Flint, is charged with two counts of assault with intent to murder, carrying a concealed weapon and felony firearm, according to 68th District Court records.\nKisean Keontae Gray, 19, of Flint, is charged with carrying a concealed weapon, assaulting/resisting/obstructing a police officer and possession of marijuana on school property. The two men were arraigned on their charges Wednesday, May 27, according to court records.\nOn Sunday around 2 a.m. Flint police heard gunshots coming from the area of Southwestern Academy. When officers arrived at the school, they saw a large crowd of people and vehicles fleeing the scene, according to a post on the Flint Police Department's Facebook page.\nOfficers saw one vehicle driving erratically across the parking lot, then a male fleeing on foot from the vehicle. That suspect was arrested after a foot chase and a gun was recovered, according to the post. The second suspect was arrested a few hours later.\nSeven gunshot victims arrived at local hospitals from the scene of the shooting. All of the victims are expected to survive, according to the post.\nPolice said the incident was not connected to any organized school activities or functions.\nFlint police are looking into the possibility of a ban to stop people from congregating late at night on Flint schools property.\nFlint Police Chief James Tolbert said the spike in violence over the Memorial Day weekend was \"ridiculous.\"\n\"This whole weekend has been violent,\" Tolbert said. \"The police have to find out why people are engaging in this type of violence.\"\nAnother early Sunday morning shooting that occurred near the intersection of Gillespie and Industrial avenues left a man in critical condition. The shooting took place shortly after the one in the school parking lot, police said, but appears to be unrelated.\nIn an earlier triple shooting, James Willie Doshie Jr., a 17-year-old, died in the hospital after the incident at Atherton East Apartments on Friday, May 22. One other man and a woman were hospitalized, police said.\nAround 10:30 p.m. Saturday, May 23, another man was shot multiple times at Brother's Food Market on Saginaw Street during a carjacking. A man wearing all black took off southbound on Saginaw in the 2004 Kia Sorento. The victim was listed in critical condition.\nThe investigation into each of the shootings is ongoing.\nAnyone with information is asked to call Flint police at 810-237-6800, or to submit an anonymous tip call Crime Stoppers at 1-800-SPEAK-UP, or text CSM and your tip to CRIMES (274637) or online at www.1800speakup.org.\nAmanda Emery is a police reporter for MLive-Flint Journal. Contact her at aemery@mlive.com or 810-285-0792. Follow her on Twitter or Facebook."}