{"uri": "http://www.wtvm.com/story/34281971/friends-react-after-columbus-teen-killed-in-possible-revenge-shooting", "title": "Friends react after Columbus teen killed in possible revenge shooting", "dct": "Tue, 17 Jan 2017 23:33:00 GMT", "id": "785837ef39324a85f15af01a059813f3", "content": "COLUMBUS, GA (WTVM) -\nColumbus police say they believe Monday night’s fatal shooting at Bull Creek Apartments that claimed the life of 17-year-old Destiny Nelson was an act of revenge.\nPolice say they believe this shooting was in retaliation for the killing of 22-year-old Dominique Horton on 32nd Avenue on Thursday, Jan. 5.\nThey do not believe Destiny was involved in the original shooting, but think it was a case of mistaken identity, and that Destiny was not the intended target.\nWe went to the apartments and spoke with friends of Destiny, who were with her minutes before she was shot.\n\"It was tragic a life got taken last night for no reason and it shouldn't have happened to her out of all people,” said friend Ana Marie.\nAna Marie was with her Monday night at the home where she was shot, and she says she left her minutes after it happened\n\"Only if I would've talked to her longer or told her to come inside the house or stay with her just a few seconds more something could've change,\" Ana Marie said\nOne neighbor, who didn't want to be identified, just pulled in from work and heard rounds firing off.\n\"I thought they were hunting in the woods… I’m looking around trying to find out where the gunshots are coming from,\" the neighbor said.\nDestiny was an 11th grader at Early College Academy of Columbus and was dually enrolled at Columbus State University. Her friends say she was genuinely a good person.\n\"She is a sweet girl, I wish this on no family and nobody deserves this, I wish this on no family,” Ana Marie said.\n\"The girl had a bright future ahead of her, she was well respected from day one,” the neighbor said.\nNeighbors say the Bull Creek Apartments is usually a safe place to be and they can't believe this happened.\n\"It was sad man, it’s real sad,” said the neighbor.\nCopyright WTVM 2017. All rights reserved."}