{"uri": "http://www.wifr.com/content/news/14-Year-Old-teen-killed-17-Year-old-injure-in-Friday-night-shooting-400918791.html", "title": "UPDATE: Police looking for 15-year-old suspect in shooting death of 14-year-old", "dct": "Fri, 02 Dec 2016 00:00:00 GMT", "id": "4c4fefc1c0ad78d1d9a9f07419cfa39d", "content": "ROCKFORD, Ill. (WIFR) – Rockford Police are now searching for a teenage suspect they believe is responsible for the shooting death of 14-year-old Jamario Crawford.\n15-year-old Coley Carwell of Rockford has been charged with first degree murder in the shooting death of Crawford. Investigators say around 7:00 p.m. on November 11 they found two shooting victims near North Rockton Avenue and Bruce Street. Crawford was pronounced dead on the scene and the second victim, 17-year-old Lontrell Brantley was shot in the shoulder and recovered.\nCarwell’s bond has been set at $3 million. Police say a photo of Carwell is not available at this time due to his age.\nAnyone with information regarding the incident or Carwell’s whereabouts is asked to contact the Rockford Police Department Investigations Bureau at 779-5000-6551 or Crime Stoppers at 815-963-7867.\n-----\nUpdated: November 11, 2016\nUPDATE: ROCKFORD, Ill. (WIFR) -- The past few days have been a roller coaster of emotions for Jamario Crawford's family. The 14-year-old boy was shot and killed on N. Rockton Ave. Friday night around 7, just blocks from his home. Jamario's mother, LaToya Stewart was at work when she heard the news.\n\"When his friends called and described what he had on, I knew that was him,\" says Stewart.\nThe family remembers the teen as a popular boy with dreams of becoming a rapper when he grew up. They say he always kept them laughing.\n\"Very silly, very goofy. I'm gonna miss it,\" says Stewart.\n\"I was ready to see him go to Prom and college you know,\" says his aunt Nikita Magee. \"I can't see none of that no more. His mama can't see none of that no more.\"\nJamario lost his father to gun violence 12 years ago. His aunt can't believe they're reliving the pain.\n\"We moved out here to get away from the violence in Chicago, and it's haunting us here,\" says Jacquela Smith, one of Jamario's aunts.\nPolice have not identified a suspect at this time. Jamario's loved ones say they don't want the case to be swept under the rug and they won't stop until the shooter's in jail.\n\"We putting pressure on everybody,\" says Smith. \"We're putting pressure on the police, anybody that may know anything, just come forward.\"\nMagee says she has a message for the shooter.\n\"You will not get away with this. It's Rockford and it's too small. I want to let you know and I want to talk to you because I know that you're watching me. You will not get away with it. Justice will be served.\"\nJamario was the oldest of five siblings. His family says they're especially having a hard time explaining his death to his 4-year-old brother who keeps asking to call Jamario on the phone.\nThe family has set up a GoFund Me page for funeral expenses. The link is to the right.\n-------\nUpdated Saturday, November 12, 2016\nUPDATE: ROCKFORD, Ill. (WIFR) -- The Coroner's office has identified the 14-year-old male killed in the 900 block of North Rockton Ave. as Jamario Crawford.\nHe was pronounced dead on the scene at 9:39 Friday night.\n------\nFriday, November 11, 2016\nROCKFORD, Ill. (WIFR) -- A 14 year old boy is killed and a 17 year old is wounded after they are shot at on Rockford's west side.\nPolice say shortly before 7:00 p.m. the two teens were walking southbound in the 900 block of North Rockton Avenue when they were confronted by a teenage boy. Police believe that is when the suspect fired several rounds at the victims and then fled the scene on foot.\nThe 14 year old was pronounced dead on the scene. The 17 year old was taken to the hospital with non-life threatening gunshot wound to the shoulder.\nPolice are not releasing the name of the victims at this time."}