{"uri": "http://www.rrstar.com/news/20161112/he-took-his-last-breath-trying-to-talk-to-me-rockford-woman-says-of-shooting-victim", "title": "'He took his last breath trying to talk to me,' Rockford woman says of shooting victim", "dct": "NODATE", "id": "af87b324babe6e2368ea6d410116ca6d", "content": "Hide caption Jamario Crawford, 14, of Rockford, was fatally shot in the 900 block of North Rockton Avenue in Rockford Friday night, Nov. 11, 2016. There was little sign of the teen's death the following day. KRISTEN ZAMBO/STAFF PHOTOGRAPHER/RRSTAR.COM\nROCKFORD - She was walking in her back door when about six gunshots rang out, forever changing the lives of so many people.\nKeyosha Johnson, 29, of Rockford, had stopped home briefly Friday night, leaving her sister and their children in her car, when the shots sounded in the west-side neighborhood. She called her sister on a cell phone from inside the house and told her to turn the car off. Johnson then called police and rushed outside.\nDown the street, in the 900 block of North Rockton Avenue, someone was on the ground.\n\"He was so small. I could tell it was somebody's child,\" said Johnson, who has a 14-year-old son and two daughters, ages 4 and 1. \"I kind of shook him. I broke down crying because I thought, 'This is somebody's baby.'\"\nThe 14-year-old boy on the ground, Jamario Crawford of Rockford, had been shot shortly before 7 p.m. It looked like he had been hit five times in the back, Johnson said today, with some bullets perhaps exiting through his chest.\nShow more...\n\"I tried to ask him his name, how old he was, if he knew who shot him,\" Johnson said. \"He was trying to talk to me but you could hear the blood gurgling in his throat. The words never came out of his mouth.\n\"He took his last breath trying to talk to me,\" said a visibly haunted Johnson.\nCrawford is Rockford's 24th homicide victim of the year. Last year, there were 20 homicides in the city.\n\"My heart really goes out to his mom,\" said Johnson, her eyes glistening with tears as she explained that her own 4-month-old son died suddenly some time ago.\nA 17-year-old boy who was walking with Crawford also was shot. He suffered a bullet wound in the shoulder, according to Rockford police. The 17-year-old's name hasn't been released. He survived, but police didn't specify his condition. No arrests have been made.\nThe Winnebago County Coroner's office said an autopsy is pending, but didn't specify a date. Crawford was pronounced dead at 9:39 p.m.\nJohnson didn't know at first the 17-year-old had also been shot because he wasn't near Crawford. But then she heard a faint sound.\n\"I thought I heard, 'Somebody help me,' in a real low voice,\" she said.\nThe day after the shooting, Larry Hamilton II, pastor of Second Christian Church, 950 N. Rockton Ave., stood outside his church in the bright sunshine - about two doors away from where Crawford died. He said Crawford's aunt and uncle attend the church and talked with some of the boy's family members about him.\nCrawford's grandmother \"said he was a great kid, had a very promising future,\" Hamilton said. \"Now they have to pick up the pieces and that's a very difficult thing to do. Thanksgiving is coming up, and Christmas is coming up.\"\nHamilton said when he talked with neighbors on the street Friday night, he heard that the teens were walking with a girl and an altercation occurred. He wondered whether the boys were shot because someone didn't know how to deal with anger or frustration.\n\"You have one opportunity at life. Every day you have to take advantage as much as you can,\" he said.\n\"I pray to God that the other boy ends up making it all right so they (are) able to bring the boy's killer to justice,\" Johnson said. \"He took somebody's child's life.\"\nHamilton said he's confident police will catch the shooter. However, he said he'd like the city to create a gun buy-back program so more firearms are taken off the streets and out of the hands of young people.\nAnyone with information about the shooting is asked to call the Rockford Police Department's Investigations Bureau at 779-500-6551 or Rockford Area Crime Stoppers at 815-963-7867.\nKristen Zambo: 815-987-1339; kzambo@rrstar.com; @KristenZambo"}