{"uri": "http://www.news4jax.com/news/georgia/camden-county/st-marys/woman-18-month-old-shot-at-apartment-complex", "title": "Victim's mom urges man wanted in shooting to surrender", "dct": "Mon, 25 Apr 2016 22:59:00 GMT", "id": "53421b98b5c8a25aa8669ecf0fa01943", "content": "ST. MARYS, Ga. - A 24-year-old mother died after she and her 18-month-old child were shot Monday night at a St. Marys apartment complex, authorities said.\nThe woman, identified by family members as Jimeshia Gordon, a mother of two, was airlifted with life-threatening injuries to UF Health Jacksonville, where she died.\nHer 18-month-old daughter, Kamela Gordon, was taken to a local hospital with non-life-threatening injuries. She was treated and released and is with other family members.\nThe shooting happened just after 7 p.m. at the Cumberland Oaks Apartments on Mary Powell Drive, according to the St. Marys Police Department.\nPolice have identified Jimeshia Gordon's boyfriend, 31-year-old Roney Wilson Jr., as a person of interest in the shooting. They are searching for him and said he is considered armed and dangerous.\n\"He lives in several locations. He has a residency here, actually, locally in St. Marys. He's also known in the Nassau County area. He is not unfamiliar with law enforcement. We have dealt with him on numerous occasions over the years,\" said Lt. Shannon Brock from the St. Marys Police Department.\nGordon's mother, Pamela Cummings, begged Wilson to call police and let them know where he is.\n\"She never bothered anybody,\" Cummings said. \"He needs to hurry up and turn himself in and get what he deserves for doing this to my daughter.\"\nThose who knew Gordon said she was a loving mother and a good person. She also had a 4-year-old daughter.\n\"She was loving. She was caring. She went out of the way for her family,\" said Christasia Campbell, Gordon's cousin.\nGordon's family wanted News4Jax to see Kamela to let people know that even though she was injured, she is doing well. When News4Jax saw her, she had a bandage on her her face and a severe gash on her forehead that her family said was from a bullet that grazed her face.\nHer loved ones are heartbroken and said they just want answers.\n\"Why? Why did he kill my niece? Why did he leave our family hurting? Why did he leave us with her two kids? She is young. She is nothing but 24 years old. She didn't get a chance to experience life,\" said Shay Cummings, Gordon's aunt.\nA makeshift memorial with a teddy bear and sign reading \"Rest in Peace\" has sprung up at the location of the shooting.\nWilson's father urged his son to \"do the right thing.\"\n\"We know that nobody is perfect. And at times we lose it. He lost it yesterday,\" the elder Ronnie Wilson said. \"He still has people who love him. I talked to him three times, and I really pleaded with him to come home, because it's happened; it is over. I just pray that God would touch him.\"\nWilson Sr. attempted to call his son again, but it went straight to voicemail.\nRoney Wilson's sister, Veronica, pleaded for him to turn himself in.\n\"If you don't come back, Jesus, they're going to kill you out there,\" she told News4Jax. \"Please come back safe, please. Man, I'm begging you to come back home. Let me come and get you.\"\nI-TEAM investigates Roney Wilson's background\nIncident reports from the St. Marys Police Department, obtained by the News4Jax I-TEAM, reveal Roney Wilson has a list of charges dating back to 2005, when he was charged was for driving without a license.\nAccording to the reports, several incidents happened at the Cumberland Oaks Apartments and throughout the city of St. Marys.\nIn 2007, Wilson was charged with misdemeanor battery. The police report says a woman claimed Wilson beat her up -- punching her in the face, throwing her to the ground and kicking her. The woman had a busted lip and scratches on her legs and arms, the report says.\nIn 2008, he was arrested on charges of probation violation obstruction and more charges of assault and battery, reports show.\nHe also faced charges of firearm possession by a convicted felon and larceny theft over the next several years, according to the reports.\nIn 2015, police said they were called after a woman in a relationship with Wilson claimed she caught him in bed with another woman and when she confronted him about it, he became enraged and began to beat her. He allegedly grabbed her by the neck, throwing her into the bathtub, and wouldn't let her leave, the report says.\nWilson was charged with felony aggravated assault, felony false imprisonment and misdemeanor battery, the incident report says.\nSt. Marys police and the Georgia Bureau of Investigation continue to investigate and anyone with information about Wilson's location is asked to call St. Marys police as soon as possible at 912-882-4488.\nCopyright 2016 by WJXT News4Jax - All rights reserved."}