{"uri": "http://www.al.com/news/birmingham/index.ssf/2016/04/3_wounded_after_gunman_in_cowb.html", "title": "4 wounded, gunman dead after 2-county shooting spree in Alabama", "dct": "Wed, 20 Apr 2016 11:22:00 GMT", "id": "814907098c382622389b0f8137a2a9a7", "content": "A man in a cowboy hat and in a pickup truck opened fire at a Blount County intersection this morning, wounding four people and damaging multiple cars and buildings.\nThe suspect, whose identity hasn't been released, was shot and killed by lawmen after he repeatedly fired on them, authorities said. No officers were injured.\nAuthorities say the man, whose identity isn't known, was involved in an earlier shooting incident in Marshall County, and opened fire again after the intersection shooting in Blount County. \"He's just going around shooting,'' said Blount County sheriff's Operations Officer Tim Kent. \"There's no rhyme or reason.\"\nKent said that the suspect changed vehicles before entering Blount County.\nThe Blount County shooting happened about 7 a.m. in Brooksville on Alabama 278. Kent said the gunman, in a white pickup truck, pulled up to the intersection, stuck a shotgun out of the window and began firing.\nTwo men and a woman inside their vehicles were wounded. They are being taken to local hospitals with injuries not believed to be life-threatening.\nThe gunman then fled down Rocky Hollow Road, where he started shooting again, Kent said. At least one more car was struck at that time. The earlier incident happened in Marshall County when he shot at a concrete truck, but the gunman then went back to Marshall County after the Blount County shooting and shot someone in the chest. That victim is said to be in stable condition.\nLawmen put the Blount County schools on lockdown and searched the area. They issued lookout bulletins to nearby counties, and asked everyone to be aware and take precautions.\nThe suspect was spotted east of Brooksville after 8 a.m. He was involved in a pursuit with Blount County and Marshall County sheriff's deputies, Snead police and Blountsville police. Authorities said he was armed with the shotgun and a handgun.\nKent said the man fired at officers during the chase, and again after he crashed his vehicle. That's when lawmen returned fire and killed him.\nNo officers were wounded.\nTwo Blount County deputies who fired at the suspect are being put on administrative leave for a few days, Kent said.\nThere have been no details released about the suspect or the motive in the shooting.\nDeanna Morgan was working her first shift as a cashier at the Jet-Pep located at the intersection when the shooting occurred.\nShe said she didn't see the shooter in Blount County, but she heard a gunshot.\nA woman ran into the store soon after, screaming that she had been shot, Morgan said. Morgan said the woman was covered in blood, and the owner of the store began to apply pressure with paper towels on the victim's wound.\n\"She just kept saying, 'Am I going to die?' And so I prayed with her,\" Morgan said.\nThe victim called her father while the store owner called police, and she was taken to a hospital by paramedics shortly after they arrived.\nMorgan said that when police arrived, they told her to take cover and lock the door.\n\"They told me to get in the back of the store, and that someone was shooting people.\"\nPolice from Arab, Cleveland, Guntersville, and Snead assisted the Blount County Sheriff's office today.\nThe Alabama Law Enforcement Agency is now handling the investigation.\nAL.com's Ivana Hrynkiw contributed to this report."}