{"uri": "http://www.al.com/news/huntsville/index.ssf/2016/04/father_says_son_in_two-county.html#incart_river_home_pop", "title": "Father says he tried to help 'bipolar' son who shot four people in Tuesday rampage", "dct": "Thu, 21 Apr 2016 16:48:00 GMT", "id": "e905714240705723c888f41502760ac9", "content": "Randy Blackmon sat on his son Daniel's front porch outside Guntersville with tears in his eyes Wednesday afternoon as he waited for the state to release his body.\nDaniel Eric Blackmon, 38, was being autopsied after he was killed in a shootout with police Tuesday after shooting into random cars and wounding four people in Marshall and Blount counties.\n\"He's just going around shooting,'' Blount County sheriff's Operations Officer Tim Kent told AL.com Tuesday. \"There's no rhyme or reason.\"\nThere was a reason, Randy Blackmon said. \"The bipolar (had) come to the top\" a few months earlier, he said referring to bipolar syndrome in his son's personality.\nHe had been with Daniel the night before the shootings, Blackmon said. \"He calls me and says, 'Hey, Dad, there's demons here. Can you come help me?' I said, 'Sure.'\"\nThe office had said Wednesday that the shooter, Daniel Eric Blackmon, was a person of interest in the fire.\nBoth men lived on Blackmon Road, a gravel road 7 miles south of Guntersville, Ala. They worked together in the family trucking business hauling gravel, sand and whatever else building contractors needed across North Alabama.\n\"We looked around, shining lights, and we couldn't find anything,\" Blackmon said of Monday night outside his son's house. \"He said, 'Dad, do you want me to show you the portal of Hell?'\"\n\"Yeah,\" Blackmon said. \"Whatever you want to do.\"\nThe two men drove to Gadsden, where Daniel said the portal was, and back while Daniel talked about the \"good demons\" and \"bad demons\" he'd been seeing. He'd go days without sleep sometimes, and sometimes he'd fall asleep from exhaustion.\nWhen they got home, Daniel turned all the lights on and opened the front door to feel safe. Randy Blackmon went to his own home down the lane. \"I came by (Tuesday) morning and the door was open,\" Blackmon said. \"I went on to work.\"\nBlackmon's friends started calling his cell phone later in the day, but they wouldn't tell him what had happened. Then the Marshall County Sheriff's Office called and did tell him, he said.\nBlackmon said he tried to help his son every way he knew. The sheriff's office knew Daniel, too, he said, because he said they'd picked him up for a hearing when his father tried to have him hospitalized earlier in April. Instead, the ultimate decision was a 150-day program of outpatient therapy and medication.\n\"He wasn't going to do that,\" Blackmon said of the meds. Later, Blackmon would say, \"They let us down. I was trying to get him some long-term care.\"\nBlackmon said his son seemed OK until a few weeks ago, but admitted the younger man had mood swings for several years. He was never violent, Blackmon said, but you didn't know what he would say, how he would react.\nBlackmon's choice was, \"Do I say something or not?\" Something that might set him off?\nIt was a long way, Blackmon said, from the mathematically gifted boy offered an engineering scholarship to the University of Alabama in Huntsville. Daniel Blackmon put college off for a year to earn some money driving trucks with his father. Then he told UAH \"to give the scholarship to someone else,\" his father said. \"He had found what he wanted to do.\"\nNow Daniel Blackmon is dead, and police are saying he was also \"a person of interest\" in an April 10 fire that destroyed the nearby Cedar Grove Church of Christ. \"I'd say he didn't do it,\" Blackmon said Wednesday. \"If you ask anybody who knows him, they'd say no.\"\nBlackmon said he's sorry for what his son did, and he's glad no one was killed. \"I'm sure all he saw was a demon in there,\" he said of the cars Daniel Blackmon fired at on the Alabama roads on Tuesday.\n(Updated at 7:32 p.m. to clarify the location of Blackmon's home)"}