{"uri": "http://www.knoxnews.com/story/news/local/2016/11/23/maryville-college-football-player-charged-fatal-shooting-central-cheerleader/94327172/", "title": "Family: Football player charged in cheerleader's slaying refused to accept breakup", "dct": "Wed, 23 Nov 2016 00:00:00 GMT", "id": "b79b503a7be04d816f5f26774b0607fe", "content": "Angela Gosnell/News Sentinel\nA Central High School cheerleader found dead Monday and the Maryville College football player charged with killing her had ended their romance in recent weeks, although he refused to accept the breakup, the victim's aunt said.\nWilliam Riley Gaul, 18, is charged with first-degree murder in the death of 16-year-old Emma Jane Walker, who was fatally shot in her bedroom while she slept, according to the Knox County Sheriff's Office.\nThe body of the high school junior was discovered about 6:30 a.m. Monday at 6802 Cardindale Drive in North Knox County. It appeared she had been shot from outside the home, authorities said.\n\"She had chosen to move on,\" Jenny Weldon, Walker's aunt, said Wednesday. \"He refused to accept it. He chose not to accept her wishes.\"\nWeldon described her niece as a \"beautiful soul\" who was anxious to graduate high school and begin studying toward her dream of becoming a neonatal nurse.\n\"Her heart was in service,\" Weldon said. \"She was born to be a helper.\"\nAfter the shooting, detectives quickly placed Gaul under surveillance, concerned that he was preparing to destroy evidence connected to the killing, according to the Sheriff's Office. He was taken into custody at the Woodlands Apartments on Cherokee Trail late Tuesday night. Gaul, of Knoxville, remained jailed Wednesday in lieu of $750,000 bond.\nA preliminary hearing has been scheduled Dec. 2 in Knox County General Sessions Court.\nGaul, a 2016 Central High graduate who played on the school's football team, is listed as a freshman wide receiver on the Maryville College roster. Maryville College spokeswoman Chloe Kennedy said Wednesday afternoon Gaul has been dismissed from the football team.\n\"Our student was a wonderful young lady, a cheerleader and honor student with a promising future, whose life was cut too short, too soon,\" Central High School Principal Michael Reynolds said in a statement Wednesday. \"At this time, our hearts and thoughts and prayers are with the family as they go through this grieving process. We thank everyone in our community for their tremendous support.\"\nGrief counselors were on hand at Central High on Tuesday. Friends and family crowded the school's football stands during a vigil at later that night.\n\"We have not ceased to have support and encouragement and love from all over,\" said Weldon, speaking for the family. \"We feel every bit of that.\n\"We adored her, and it's nice to know so many others did as well.\"\nGaul posted several tweets professing his love for Walker, including a lengthy tribute that appeared online several hours after she was found dead.\n\"Living everyday through Emma Walker. I love you beautiful and I know you're in a better place now,\" Gaul's Twitter bio reads.\nA memorial fund has been established at Regions Bank to assist the Walker family with funeral expenses. Contributions can be made at any Regions branch or online."}