{"uri": "http://www.trentonian.com/general-news/20161118/shooting-in-trenton-leads-the-nov-18-2026-trentonian-police-blotter", "title": "Shooting in Trenton leads the Nov. 18, 2016 Trentonian Police Blotter", "dct": "Fri, 18 Nov 2016 21:04:00 GMT", "id": "a3c87ca1f45fd459e6d9a78466df5c06", "content": "The following information was provided by police, unless otherwise noted:\nTrenton\nShooting: The Shooting Response Team is investigating an incident that sent a 17-year-old man to the hospital with non-life threatening injuries around 2:25 a.m. Friday morning. Trenton Police Lt. Stephen Varn said that officers were detailed to Elmhurst Avenue on a report of shots fired where they located evidence of a shooting. Varn said that approximately a half-hour later they received information that a gunshot victim had arrived at St. Francis Hospital. The victim told police that he was in the area of Elmhurst when he heard several shots and realized he’d been hit. He then fled area and parked his car. He received a ride to the hospital and was being treated for his injuries. The investigation is ongoing Varn said.\nFight turns ugly: Police arrested John E. Marshall, 32, of Trenton after a Thursday altercation where it is alleged he pulled a knife on his 34-year-old male roommate on Thursday at 10:51 a.m. in the 700 block of West State Street. Trenton Police Lt. Stephen Varn said officers were sent to the area on report of an assault in progress. He said that when officers arrived they met with the victim who said he and Marshall were involved in an argument the night before where the victim ended up being punched in the left side of his face. On Thursday the pair became involved in another argument where it is alleged that Marshall grabbed a knife and threatened to kill him. Varn said that Marshall also allegedly began to poke the victim in the stomach with the knife as though he was going stab him. Police then arrested Marshall at the apartment with no further incident. He was charged with terroristic threats, simple assault, possession of a weapon and possession of a weapon for an unlawful purpose. His bail was set at $20,000 with a 10 percent option.\nAssault: Police said that they arrested Miguel Acosta, 54, of Trenton after he allegedly punched a 52-year-old woman in the face on Thursday around 2:22 p.m. Police responded to the area of Hudson Street and Hamilton Avenue where they located the victim bleeding from her nose. She told police that a man had punched her, and identified him as Acosta. When police approached Acosta they noticed that he had blood on his knuckles and fingers. He was taken into custody and charged with aggravated assault.\nAdvertisement\nATM Theft: Police arrested 50 year old Dennis McLernan of Philadelphia early Friday morning after receiving an alarm activation from the exterior ATM at Tru-Mark Financial, located 3446 Old Lincoln Highway. Police said that a responding officer observed McLernan walking along Old Lincoln Highway as he responded to the alarm activation. According to police McLernan was dressed in black and was carrying a duffel bag. When the officer attempted to stop McLernan, a foot chase ensued until the officer was able to subdue McLernan. The officer then recovered the duffle bag which contained the $68,000 cash. It was then confirmed that the money was stolen from the exterior ATM at Tru-Mark Financial. McLernan is employed by a security company that is responsible for ATM services and money delivery. Police said that McLernan possessed a key to the ATM and staged damage to appear as though it was forced open. He was charged with burglary, theft and related offenses. McLernan was arraigned and sent to the Bucks County Correctional Facility in lieu of 10% of $75,000 bail.\nRobbinsville\nRandom search: At approximately 9:15 a.m. on Friday, November 18, 2016 the Robbinsville Township Police Department, in conjunction with the Mercer County Narcotics Task Force, conducted a random drug search of Robbinsville High School using several K9 units, including one from Robbinsville. The operation was approved by school administrators and the Robbinsville Township Board of Education as a deterrent to illegal activity in a school setting. The K9 search included, but was not limited to, any items housed in school lockers. During the search, students and faculty were locked down in secure areas and classrooms. Robbinsville High Principal Molly C. Avery sent a letter to all parents via email this morning informing them of the operation."}