{"uri": "http://www.contracostatimes.com/ci_22426767/brentwood-teens-may-have-been-shot-over-nike", "title": "Brentwood: Teens may have been shot over Nike shoes, police say", "dct": "Tue, 22 Jan 2013 14:44:00 GMT", "id": "0575e065405615ed088c32297c912736", "content": "BRENTWOOD — Four teenagers wounded Monday evening in a drive-by shooting may have been targeted for unknowingly wearing shoes denoting a gang affiliation, police said.\nThe teens, who ranged in age from 13 to 16 years old, were standing on a sidewalk in front of a home in the 1100 block of Breton Drive about 6 p.m. when a car with three to four men drove up to them, Brentwood Capt. Tom Hansen said.\nAccording to a report on KTVU-TV, a man in the car asked one of the boys why he was wearing Nike Cortez shoes, to which one of the teens, whose identities have not been released, replied, “Don’t worry about it.” One of the suspects reportedly fired back, saying, “Gang members like to wear those.”\nThe car pulled away, made a U-turn, then came back and fired approximately five shots at the boys, Hansen said.\nPolice described the victims’ injuries as “serious,” and all four boys were taken to the hospital for treatment. Two of them have since been released, and one of the teens who remains in the hospital is undergoing surgery to remove a bullet in his knee.\nBoth the victims’ families and the police insist that none of the teens is a gang member, and they were unaware of any significance between gang affiliations and the pair of sneakers.\n“We have absolutely no reason to believe they are affiliated with any type of gang,” Hansen said.\nA detailed suspect description wasn’t available, but the men in the vehicle were described as white and Hispanic men in their early to mid-20s. No arrests have been made in the incident.\nThe vehicle was described as a white or light-colored, late model, four-door sedan.\nAnyone with information should call Detective Aguirre at 925-809-7726 or Detective Folena at 925-809-7743."}