{"uri": "http://www.times-standard.com/general-news/20160207/police-2-dead-4-hurt-in-shooting-after-mississippi-parade", "title": "Police: 2 dead, 4 hurt in shooting after Mississippi parade", "dct": "Sun, 07 Feb 2016 23:31:00 GMT", "id": "0a810f0294cf0edc8c6b5ed914431303", "content": "PASS CHRISTIAN, Miss. (AP) — A shooting after a Mardi Gras parade in Pass Christian killed two men and wounded four other people Sunday, south Mississippi authorities said.\nCarlos Bates, 29, of Gulfport, and Isiah Major III, 43, of Bay St. Louis both died at the scene, Harrison County Coroner Gary Hargrove told local news media. The victims' hometowns are near Pass Christian on Mississippi's Gulf Coast.\nFour other people were hospitalized, Pass Christian Police Chief Tim Hendricks told the Sun Herald (http://bit.ly/20PHjO1) and WLOX-TV (http://bit.ly/1nRDMjF).\nPolice received a call about a fight shortly after the last parade unit completed the route, and officers learned shots had been fired, Hendricks told the newspaper.\nAdvertisement\nThe shooting occurred about two blocks north of the parade route in Pass Christian (kris-TYANH), a coastal city of 5,300 about 45 miles from New Orleans.\nAbout 50,000 people had attended the St. Paul Carnival Association's parade, Hendricks added.\nCeleste Plaisance told the newspaper, \"I think I heard 12 shots fired. We thought it was fireworks at first.\" She added that when she saw someone had been shot and people were running away, she ran into her mother's house.\nThe bodies, covered in yellow sheets, were near her mother's steps. Police drove through the yard to avoid disturbing police crime scene tape set up to keep bystanders away, she said.\nLater Sunday, shots rang out along the Bacchus parade route in New Orleans, although no one was injured, police said. Officers found a handgun in the area and were searching for a suspect or suspects.\nThe shootings occurred a day after parade accidents in south Louisiana injured a man and a woman.\nPolice in Lafayette, Louisiana, told local media that a man fell from the top level of a float during a Mardi Gras parade there.\nBaton Rouge, Louisiana, EMS spokesman Mike Chustz told The Advocate (http://bit.ly/1QkmxhS) that a float also hit a pedestrian during the Spanish Town parade. Cpl. L'Jean McKneely, a Baton Rouge police spokesman, said in an email Sunday to The Associated Press that he knew only that the woman was taken to a hospital with moderate injuries."}