{"uri": "http://www.kcsg.com/view/full_story/26484043/article-17-year-old-boy-airlifted-to-hospital-after-accidental-shooting?instance=more_local_news1", "title": "17-year-old boy airlifted to hospital after accidental shooting", "dct": "Sun, 22 Feb 2015 08:41:00 GMT", "id": "a76d086db8c1b647aeba990b2a46d8a1", "content": "ST. GEORGE– A teenage boy was taken to the hospital by Life Flight Saturday afternoon after unintentionally shooting himself while recreating in the Warner Valley area.\n“Initial investigation shows that it was accidental,” Washington County Sheriff’s Sgt. Dave Crouse said.\nThe emergency call was received at 3:57 p.m. The boy, a 17-year-old St. George resident, had been in the Warner Valley area, just outside the Washington City limits, shooting guns with some adult family members when he accidentally shot himself with a handgun, Crouse said.\n“I was told it was 9 mm,” Crouse said.\nThe bullet entered the boy’s abdomen area.\nThe teen was conscious and alert when emergency personnel arrived, Crouse said. Life Flight was called in, and the boy was airlifted to Dixie Regional Medical Center.\nHe believes the boy was in stable condition at the time he was transported to the hospital\nCrouse said he believes the boy was in stable condition at the time he was transported to the hospital, but he said he does not know the boy’s current condition.\nResponders from Utah State Parks, the Bureau of Land Management, the Washington City Police Department, the Washington County Sheriff’s Office and Life Flight responded to the scene.\nCrouse said it can be difficult to determine which city has jurisdiction when an emergency occurs in Warner Valley, as the Warner Valley area covers portions of St. George, Washington and Hurricane. For that reason, responders from multiple cities often respond to Warner Valley emergency calls, he said.\n“The victim’s condition is a primary concern more than jurisdiction,” Crouse said.\nThis report is based on preliminary information provided by law enforcement or other emergency responders and may not contain the full scope of findings."}