{"uri": "http://www.washingtontimes.com/news/2013/mar/17/suspect-dc-drive-shooting-was-wearing-gps-device/", "title": "He left a trail for police: Suspect in D.C. drive-by shooting was wearing court-ordered GPS device", "dct": "Sun, 17 Mar 2013 00:00:00 GMT", "id": "54a9db1d9f24390d51b02ef3e5c95739", "content": "The 19-year-old man charged in connection with a drive-by shooting that injured 13 people had circled the Northwest apartment complex that was fired upon in a car for nearly an hour before the early morning shooting, a fact investigators learned when they reviewed the movements recorded on his court-ordered electronic ankle bracelet.\nCourt documents revealing the details were filed on Saturday when Craig Steven Wilson, of Southeast, was arraigned in D.C. Superior Court. Mr. Wilson turned himself in Friday to the District’s Court Services and Offender Supervision Agency, the same agency that issued the Global Positioning System tracking device he was wearing at the time of the March 11 shooting.\nNeither police officials nor the affidavit filed for Mr. Wilson’s arrest have given any inclination about the motive in the shooting, which injured seven men and six women as they stood outside of Tyler House, a 284-unit affordable housing complex at the corner of the busy intersection of New York Avenue and North Capitol Street.\nHowever the court documents indicate that at least two guns were used to fire shots at the crowd from two cars that were captured on surveillance footage zooming past Tyler House when the shooting occurred. Police are still searching for another man they’ve deemed a “person of interest” in the case — 19-year-old Andrew Davon Allen.\nThe surveillance video shows “repeated muzzle flash coming from the passenger sides of both vehicles” and shell casings from two 9 mm handguns were found in the street, the court documents state.\nCasings from two .40 caliber handguns were also found in the area, though they were recovered from along the sidewalk, a possible indication that someone fired back at the cars.\nSeveral of those injured in the shooting suffered graze wounds from the gunfire. One person remains in critical condition and the criminal complaint filed against Mr. Wilson only lists a single complainant.\nThe Metropolitan Police Department has recovered both cars used in the shooting, one of which was registered to Mr. Wilson. The other car belonged to a person who had let an unnamed relative, who was reported to be a close friend of Mr. Wilson, use it the night of the shootings. By the time police found that car, it had been set on fire and destroyed in Southeast D.C.\nAn public defender listed as representing Mr. Wilson in court records could not be reached for comment over the weekend and a number could not be located for family members.\nAbout two hours before the shooting, Mr. Wilson’s GPS ankle bracelet tracked him to the unit block of Patterson Street in Northeast D.C., the same location as the nightclub Fur, which several of the shooting victims had visited that night, according to the court documents.\nA few minutes after 1 a.m. Mr. Wilson left the area of the club, which is located across the street from Tyler House, and the GPS indicated he circled the block where Tyler House is located in a vehicle. At the approximate time of the shooting, 2:08 a.m., Mr. Wilson’s GPS indicated he was around the block from Tyler House, at First and New York Avenue Northwest. But then he moved quickly away from the area, his GPS registering at the entrance to the Interstate 395 tunnel at 2:10 a.m. and later in Southeast D.C. and Temple Hills.\nAs of March 13, CSOSA officials said Mr. Wilson had removed his GPS bracelet by cutting it off.\nMr. Wilson, who was on probation for receiving stolen property at the time of the shooting, is charged with assault with intent to kill. He was ordered held without bond and is scheduled for a preliminary hearing on April 4.\nCopyright © 2017 The Washington Times, LLC. Click here for reprint permission.\nSponsored\nWe were unable to load Disqus. If you are a moderator please see our troubleshooting guide.\nRecommending means this is a discussion worth sharing. It gets shared to your followers' Disqus feeds, and gives the creator kudos!\nRead full terms and conditions\nIt is not the gun that did the damage, it is the CRIMINAL that was allowed to roam the streets who was judged safe to do so. It isn't an issue of how many criminal we have in prisons, it is the issue of how many CRIMINALS we have that should be in prison. Nothing else matters, statistics of where we rank compared to other nations is a red herring. It is a matter of doing what should be done period. if half of our population were vicious criminals would we be saying 50% of population should be in prison to protect the other 50% or \"what would the other nations think of us\"? The government is to protect the citizenry from enemies without and within. Do what that takes. We can not be a nation of quota criminal treatment with artificial limits. Lock up those who should be locked up. Protect the rest of us from them, not what we eat or smoke or drink.\nHe was wearing a GPS tracking device??!! Regardless of the shooting, this guy is clearly guilty of gross stupidity!\nSavages will do what savages do.\nAnother Messiah Zombie performing his civic duty...and, BTW, where were the COPS/court apparatus bureaucrats when the psycho was out terrorizing the 'hood ? Collecting their taxpayer-funded paychecks/benefits. that's where...and we need MORE restrictive gun laws ? What a disgusting mess....\nFortunately he was unfamiliar with firearms; now had he been using a spear or war club the casualties would have been much higher.\nSponsored\nThat proves the lack of intelligence of the 90+% of those who still support obama based upon the color of his skin. His single brain cell must have been tired due to lack of usage.\nI'm really shocked to hear this.\nAstonishing\nhe is trayvon martin...\nTime is wasting. Good article, WT.\nSponsored\nClick to Read More\nClick to Hide"}