{"uri": "https://www.washingtonpost.com/local/police-seek-two-men-in-connection-with-shooting-that-injured-13/2013/03/14/4fa6145a-8cda-11e2-9838-d62f083ba93f_story.html", "title": "D.C. police seek 2 men in connection with shooting that injured 13", "dct": "Thu, 14 Mar 2013 00:00:00 GMT", "id": "af9b0b0c2dfb602d732afa55085c2609", "content": "D.C. police announced on Thursday their first break in Monday’s early morning drive-by shooting on North Capitol Street, posting pictures of two 19-year-olds being sought in connection with the wounding of 13 people outside an apartment building.\nLate Thursday night, police announced that they had issued an arrest warrant for Craig Wilson for assault with intent to kill in connection with the mass shooting. Wilson has a revolver tattoo on his neck and is described as 6-foot-2 and weighing 140 pounds, authorities said.\nThe statement came hours after police officials identified Wilson and Andrew Davon Allen as people of interest in the case.\n“We’re trying to locate and interview two people we believe have information on the case,” Cmdr. George Kucik told reporters outside D.C. police headquarters in the afternoon.“We’re looking to see if anyone knows where they might be.”\nKucik had a message for the men: “Reach out to us. Come in and talk to us.”\nFive hours later, police announced the arrest warrant for Wilson but did not release details or why they considered Wilson a suspect.\nPolice also said they had located one of the two vehicles used in the shooting, which occurred about 2:10 a.m. on North Capitol Street, just off New York Avenue in front of an apartment complex called Tyler House.\nPolice haven’t found the other vehicle, Kucik said, described as a dark blue or black 1999 Mercedes-Benz CLK 320 coupe with D.C. license plates EF7810. Police have posted a $10,000 reward for anyone with information leading to an arrest and conviction.\nMost of the victims suffered minor wounds to their legs and arms, though one was struck in the lower back and critically injured.\nThe number of victims startled a city in which gun violence has been dropping. It occurred at the edge of a neighborhood transitioning into a gentrified district of condos, retail stores and offices. A name given by developers, NoMa, short for north of Massachusetts Avenue, has stuck.\nBut Monday’s violence and the fact that several victims, including three sisters, had just emerged from a mega-nightclub ignited old discussions over gentrification. A D.C. Council member proclaimed the area’s clubs, which existed before the latest burst of redevelopment, to be incompatible with the changing area, while a police commander pointed at crime from Tyler House, a subsidized tower of apartments.\nPolice have not described a motive, and they said little about the case Thursday. Authorities have indicated that they are looking into whether a dispute at the club precipitated the violence, or whether the incident is tied to long-standing beefs between neighborhood crews from Tyler House and those on the other side of New York Avenue in Truxton Circle.\n“There’s a lot to do in this case,” Kucik said. “We’re getting there.”"}