{"uri": "https://www.washingtonpost.com/local/crime/up-to-11-people-shot-on-dc-street-corner-overnight/2013/03/11/d7c5197e-8a39-11e2-a051-6810d606108d_print.html", "title": "13 people shot in a D.C. neighborhood with a violent past and a future in flux", "dct": "NODATE", "id": "b8dbd32a47414210ecfc112dc3689fac", "content": "They tumbled to the sidewalk or ran for cover, scraping and kicking fruitlessly at the locked front door of an apartment building amid a spray of gunfire from two cars speeding down North Capitol Street early Monday.\nThe backdrop was Tyler House, a subsidized-apartment building where violence has visited all too frequently for residents and police. As crime drops across the District and an adjacent neighborhood enjoys a burst of redevelopment, Tyler House remains a stubborn remnant of the area’s history of violence.\nIn the end, 13 people were hit in the drive-by shooting Monday, nearly all of them grazed or struck in their arms or legs. One victim took a bullet to the lower back and was described as being in critical condition.\nPolice said they had few answers to explain the shooting: no motive, no arrests, no information about a gun. Mostly, they and other city officials struggled to assure the public that a quickly gentrifying corner of the city is safe.\n“I’m saving up my money — because I got a baby on the way — so I can get out of here,” said Tonya Brigdes, 36, one of 284 residents of the eight-story Tyler House. Brigdes, who is nine months pregnant, said she has seen crime ebb and flow over the years. But Monday’s shootings, she said, were a startling reminder of how bad the area can be.\nTyler House is surrounded by late-night clubs that police have long blamed for the violence along this stretch of North Capitol Street and New York Avenue. But it is also just blocks from a neighborhood with a new and stylish name — NoMa (for “north of Massachusetts Avenue”) — that city officials and private developers are trying to transform into a thriving center of expensive condominiums, upscale grocers and trendy restaurants.\nThat world seemed far away to the victims and witnesses of Monday’s shooting.\n“Everybody was screaming,” said Jonique Douglas, 21, who had just come out of a nightclub around the corner and was standing in front of Tyler House when the bullets came. “They shooting like directly at us. . . . It coulda been a bloody mess.”\nDouglas said about a dozen people were standing on the sidewalk about 2:10 a.m., minutes after the club closed. A video of the shooting distributed by D.C. police showed cars speeding by and people falling to the ground. Police were looking for two vehicles — one dark, the other a light- silver or gray sedan.\nD.C. police scrambled Monday to piece together what happened and who was involved, although they said no one has been arrested. They did not rule out that someone on North Capitol Street had returned fire; one man said he was struck in the ankle while walking on the other side of the street.\nThe shooting came three years after a similar high-profile shooting in the District; in 2010, nine people were shot, three of them fatally, on South Capitol Street.\nPolice said they don’t think that Monday’s violence was connected to shootings on the other side of New York Avenue, in front of Big Ben Liquors, that left seven people injured on consecutive weekends in October, although no arrests have been made in those cases, either. At the time, police suspected a drug dispute involving people at Tyler House.\nInstead, police on Monday pointed to a nightclub two blocks away that can hold more than 1,200 people and which D.C. Police Chief Cathy L. Lanier has ordered temporarily closed by emergency decree twice since 2011, after a machete attack and a stabbing.\nThe city’s liquor board has investigated 106 complaints at the club since 2004, many involving fights or weapons, and has fined its owners and suspended its license. The holder of the liquor license did not return calls seeking comment.\nPolice said that patrons leaving the Fur Nightclub after its 2 a.m. closing frequently congregate in front of Tyler House, but authorities were unable to say specifically whether a fight or dispute precipitated Monday’s shootings. Authorities said there are many possible motives in a volatile neighborhood, and although residents complained about the clubs, they also noted persistent violence between rival crews.\n“You won’t get the violence down as much as you’d like until you do something about Tyler House,” D.C. Police Cmdr. Andrew Solberg said in an interview about two weeks ago. He said police have been trying to rehab or close down Tyler House for years.\nIn the early morning, when the clubs in the neighborhood close, “a whole lot of people with cash in their pockets come out onto the street, and the guys from Tyler House are waiting for them,” Solberg said in the earlier interview. “That’s when you get the holdups, and that’s the source of the shootings in the neighborhood.”\nLike Tyler House, the clubs existed long before the neighborhood attracted developers — when the area consisted mostly of industrial properties and warehouses and was well out of the way of most residential zones. Today, the mix has changed.\n“The nightclubs are incompatible with the neighborhood,” said D.C. Council member Tommy Wells (D-Ward 6), who is chairman of the public safety committee. He noted that the building occupied by the Fur Nightclub has been sold and that its future is in doubt.\nThe shooting occurred just three blocks from the Metro station that serves NoMa — although the locations are separated by a cultural chasm. The walk from the NoMa/Gallaudet Metro stop toward New York Avenue passes through the main development area and along a desolate block past old car repair shops and loading docks. Yellow construction cranes loom overhead, beacons of new development.\nThe NoMa Business Improvement District estimates that the population will grow in the coming years from 2,800 residents to more than 15,000 and that office and retail space will nearly double. Keeping this area and more than a dozen other development zones around the District safe is a top priority of the police chief.\nOn NoMa’s bustling First Street NE, about a block and a half from the shooting, the lunch crowd was not surprised by the morning violence. “The west side of Capitol Street is pretty rough. It’s pretty sketchy,” NoMa resident Eric Fox said as he walked his dog along a street lined with a Harris Teeter supermarket, a Potbelly sandwich shop and luxury apartments.\n“On this side there are a lot of new apartments,” said Fox, who with his wife regularly sees lights from ambulances and police cars reflecting into their apartment at night. “The west side and the east side are very different.”\nMonday’s shooting brought into sharp relief the clashing interests of the area. Some long-standing residents welcomed development in NoMa, which, notwithstanding the recent violence, has made the area safer, they said. Others defended lower-income residents who they said are too quickly blamed for the violence. H. Lionel Edmonds, pastor of the Mount Lebanon Baptist Church on New Jersey Avenue, said it’s the new residents “who are incompatible with the neighborhood.”\nNoting that a nearby boys club is about to shut down, Edmonds said, “There’s a lot of emphasis on buildings and development, but not enough energy going into young black male youth development.”\nMarc Fisher, Hamil R. Harris, Jennifer Jenkins, Allison Klein and Clarence Williams contributed to this report.\n© The Washington Post Company"}