{"uri": "http://www.live5news.com/story/31746546/coroner-1-killed-3-injured-in-greenville-co-shooting", "title": "Deputies release suspect descriptions in shooting of 4 in Pelzer", "dct": "Tue, 17 May 2016 15:05:00 GMT", "id": "c58b3c3c51747c06d80e3291969e5815", "content": "PELZER, SC (FOX Carolina) -\nAuthorities are continuing their investigation into a quadruple shooting in Greenville County on Monday night.\nThe Greenville County Sheriff's Office said deputies were called to a possible home invasion and shooting on Eastview Road in Pelzer just after 4 p.m. on Sunday. When they arrived on scene, deputies reportedly found one male victim deceased in the front yard of the residence.\nSheriff Steve Loftis said three other victims were found shot at the scene. One victim was airlifted and two were transported to the hospital with serious injuries.\nLoftis said they believe shots were fired inside and outside of the house. He said the suspect or suspects left the scene following the crime.\nDeputies released a description of three suspects who were involved in the shooting at the home.\nDeputies said the incident does not appear to be a home invasion as witnesses provided information leading deputies to believe that the victims were familiar with the suspects. The incident may have occurred over a dispute regarding money over a drug transaction.\nDeputies said suspect #1 was a thin male, 5'5\"-5'7\", between 120 lbs. and 130 lbs., with bags under his eyes. The suspect is believed to be between 22 and 23-years-old and may have been wearing jeans and a black cutoff shirt, according to deputies.\nSuspect #2 is a male suspect between 5'10\"-5'11\", with long dreadlock-style hair that has been dyed blonde, between 160 lbs.-170 lbs., and was seen wearing a bright green and yellow Bob Marley jacket, according to deputies.\nSuspect #3 is a male suspect between 6'-6'1\". He was seen wearing a white hat and a white shirt, and possibly has dreadlock-style hair, according to deputies.\nDeputies said the suspects were possibly seen leaving the scene in a mid-late 2000's model silver Toyota 4-door vehicle. The car was described as having tinted windows and was being driven by a heavy set female with short hair.\nLoftis said this number of gunshot victims is very unusual.\nThe coroner later identified the victim killed in the shooting as Zachary Kyle Whitley, 31, of Saluda Drive in Piedmont. The coroner said the manner of death was ruled a homicide.\nAn autopsy performed Monday showed that Whitley's cause of death was a gunshot wound to the chest, the coroner stated Tuesday.\nThe coroner's office said one of the surviving victims remained in critical condition and two are in serious condition Monday morning.\nAnyone with information about the crime is asked to contact Crime Stoppers at 23-CRIME.\nCopyright 2016 FOX Carolina (Meredith Corporation). All rights reserved."}