{"uri": "http://abc13.com/news/teen-arrested-in-shooting-death-of-15-year-old-boy/1433209/", "title": "15-year-old dies in father's arms; teen in custody", "dct": "Tue, 19 Jul 2016 00:00:00 GMT", "id": "78454d65fb81b51594a957e51a7cc857", "content": "ALVIN, TX (KTRK) --\nA summer sleepover turned into a tragedy, when a 15-year-old boy was fatally shot, dying in his father's arms.\nAlvin police say that at about 5:30am, Emilio \"Milo\" Flores, 15, was shot once in the chest on the back patio of a home in the 3400 block of Oxford. Although details of exactly what happened are still not clear, police say it is believed that Flores was shot by Logan Anderson, 18, who is being called an acquaintance.\nPolice don't have a motive for the shooting and say there don't appear to be any pre-existing conflicts between the two.\nJose Flores lost his son this morning.\n\"Him and a couple of friends were supposed to spend the night together and you know, right around 5 o'clock this morning, I was awakened by a sound that sounded like a firecracker,\" Flores said.\nFlores said he ran to the patio and found his son slumped over and bleeding.\n\"My son was struggling to breathe, so I tried to do the best thing I could, tried to give him mouth to mouth, but that didn't help it,\" Flores said. \"He died in my arms.\"\nFlores said his son's friend told him the shooting was an accident.\n\"His friend was trying to run like crazy, and I asked him what happened,\" Flores said. \"And he said, 'I accidentally shot him.'\"\nPolice say the gun belonged to Anderson, who will be charged with manslaughter. They think Anderson got scared after the shooting and took off. He was located and arrested, and remains in custody at the Alvin Police Department. The gun was found two blocks away.\nTwo other teens who witnessed the shooting were interviewed by police and are not being charged.\nThe investigation is ongoing.\nEmilio's father wants to warn other families and teens to be careful and to pick your friends wisely. Milo Flores was a student within Alvin ISD. His friends say he loved basketball and would have entered the 10th grade in the fall. The family is asking for donations to help pay for burial expenses. To help donate to the GoFundMe account, CLICK HERE."}