{"uri": "http://www.readingeagle.com/news/article/police-investigating-murder-suicide-in-sinking-spring", "title": "Sinking Spring family of 5 dead in apparent murder-suicide", "dct": "Sat, 06 Aug 2016 18:00:00 GMT", "id": "92d4fb629dfe5b0d98b34f80f02ef37f", "content": "A Sinking Spring family of five died in an apparent murder-suicide today in their home in the Brookfield Manor subdivision.\nDistrict Attorney John T. Adams identified the dead as Mark Short, his wife, Megan, and their children Liana, Mark and Willow.All died of gunshot wounds, he said.An active crime scene continued late Saturday as the investigation continued.Around 8:15 p.m., investigators arrived with a warrant to allow them to enter the house. It was issued by District Judge Victor M. Frederick IV, according to Chief County Detective Michael J. Gombar.The district attorney's office will lead the investigation with the help of Sinking Spring and Spring Township police.Neighbors in the first block of Winding Brook Drive expressed shock in seeing the numerous police vehicles and the coroner in their neighborhood.One woman, who wouldn't give her name, described the area as a close-knit community where everyone knew one another.“I cannot wrap my head around it,” she said.Another neighbor, who wouldn't give his name, said he didn't know the family that lived at the house very well, but in his interactions, they were friendly.“I never would've suspected there were any issues,” he said.It was unclear how the bodies were discovered about 3 p.m. and other aspects of the deaths were under investigation.The Salvation Army set up emergency disaster services vehicle at the scene ahead of the expected all-night investigation.The family was featured in an October 2014 story in the Reading Eagle. Willow, then 5 months old, had undergone a heart transplant at 1 week old and her condition had been improving.The New York Times published a feature story on the family in July 2015. It detailed the family's struggles with specialty pharmacies and obtaining anti-rejection medication for Willow.\nWelcome guest! | subscribe | log in"}