{"uri": "http://www.tampabay.com/news/publicsafety/crime/tampa-toddler-shot-in-leg/2303080", "title": "Tampa toddler shot in spray of bullets at Robles Park apartment", "dct": "Wed, 16 Nov 2016 15:10:00 GMT", "id": "49f995c93ec5776a83a00960e5f8bdd1", "content": "Aaliyah Avila, 21 months, was shot in the thigh Wednesday when a bullet went through the front door of the Robles Park Village apartment where she lived and ricocheted off a wall. Tampa police said the spray of bullets may have been intended for her father. [ANASTASIA DAWSON | Times]\nTAMPA — More than 15 shots were fired at a home in the Robles Park Village public housing complex Wednesday, striking a toddler girl in the leg.\nThe bullet went through 21-month-old Aaliyah Avila's right thigh. Tampa police said the wound was not life threatening.\nPolice believe the gunfire was intended for her father, Eduardo Avila, 24. He was outside his home at 404 N Hernandez Court about 12:25 p.m. Wednesday when he was approached by multiple men who were behaving in a threatening manner, said Tampa police spokesman Stephen Hegarty.\nWhen Avila went inside, the men began shooting at the door, Hegarty said. The toddler, mother Raneisha Simmons, 24, and another child were in the apartment. One bullet went through the front door, ricocheted off a wall and hit Aaliyah.\nPolice are still investigating the incident, but no suspects have been named.\n\"What we're talking about is a situation where someone was firing indiscriminately into the house,\" Hegarty said.\nThe family is distraught, but the violence is not unusual for Robles Park, said Dominique Pickett, the mother's cousin.\n\"It's just tragic,\" Pickett said. \"People just need to put the guns down.\"\nGang violence is a problem in the community, said neighbor Reva Iman, resident council president for Robles Park Village. She has worked with the Tampa Housing Authority to address the violence since she moved in about two years ago, she said, and hopes Wednesday's shooting will result in changes.\n\"There's constantly shooting around here,\" Iman said \"You hear the shots, (and) by the time you get there, no one is there. Unfortunately, today a baby has been shot, so how can we combat this to make this community safe?\"\nShe said she was at the resident council office when she heard the shooting and rushed to the apartment, which is around the corner from her own, to see what was going on. By the time she arrived, no one was in sight.\n\"A lot of residents fear for their safety here, so they hate to call the police or go to the front office because they're fearful of retaliation against them,\" Iman said. \"You sit back, you shut your door and you just allow it to happen, and that needs to change.\"\nContact Anastasia Dawson at adawson@tampabay.com or (813) 226-3377. Follow @adawsonwrites."}