{"uri": "http://wfla.com/2016/11/18/teen-arrested-in-shooting-of-tampa-toddler/", "title": "Teen arrested in shooting of Tampa toddler", "dct": "Fri, 18 Nov 2016 14:36:00 GMT", "id": "860f373c9fe442eef204566bbf517525", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nTAMPA, Fla. (WFLA) – A Riverview teenager has been arrested in connection with the shooting of a toddler at a Tampa apartment complex earlier this week.\nJovaris Jose Lundy, 17, of Riverview was arrested and charged with aggravated battery with a deadly weapon, aggravated assault with a deadly weapon, and shooting into an occupied building.\nTampa Police Department investigators say the toddler was inside her family’s apartment when multiple shots were fired at the front of the house around 12:25 p.m. on Wednesday, Nov. 16.\nThe toddler suffered a gunshot wound to the right thigh and was taken to the hospital with non-life threatening injuries. She was released from the hospital on Thursday.\nPolice say the little girl’s father, Eduardo Avila, 24, was the intended target of the gunfire.\nWhile outside the apartment, he was approached by some men who made threatening comments and gestures. Avila went into his apartment and, shortly after he closed the door, an estimated 15 shots were fired at the front door and in the area in front of the house.\nOne of the bullets that went through the front door ricocheted off a wall and struck Avila’s daughter. At the time of the shooting, there were four people in the apartment, including the father, mother, daughter and another child. None of the others were injured.\nAs a result of the investigation, police issued warrants were for two men. Lundy was arrested on Thursday without incident in the Robles Park area not far from where the shooting occurred.\nTampa Police are still looking for the other suspect. Detectives have obtained an arrest warrant for Delvin Soares.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}