{"uri": "http://www.theledger.com/news/20161116/tampa-toddler-shot-in-spray-of-bullets", "title": "Tampa toddler shot in spray of bullets", "dct": "NODATE", "id": "ad92f0d285969bcc04addc463d4f8e8f", "content": "Hide caption Tampa toddler was shot in the leg Wednesday afternoon. At 12:25 p.m., Tampa Police received a call that gunshots were fired at 404 Hernandez Court. The toddler was taken to the hospital with non-life threatening injuries. ANASTASIA DAWSON /TAMPA BAY TIMES\nTAMPA - More than 15 shots were fired at a home in Robles Park Village public housing complex Wednesday afternoon, striking a toddler in the leg.\nThe bullet went completely through the 21-month-old girl's right thigh. She was taken to a nearby hospital with non-life threatening injuries.\nTampa police think the gunfire was intended for her father, Eduardo Avila, 24. Avila was outside his home at 404 N Hernandez Court about 12:25 p.m. Wednesday when he was approached by multiple men who were behaving in a threatening manner, said Tampa Police spokesman Stephen Hegarty.\nWhen Avila went in the house, the men began shooting, Hegarty said. The toddler, her mother and another child were inside.\nPolice are still investigating the incident, but no suspects have been named.\n\"What we're talking about is a situation where someone was firing indiscriminately into the house,\" Hegarty said.\nThe family is distraught, but the violence is not unusual for Robles Park, said Dominique Pickett, a cousin of the child's mother.\n\"It's just tragic, people just need to put the guns down,\" Pickett said.\nGang violence is not unusual for the community, said neighbor Reva Iman, resident council president for Robles Park Village. She has worked with the Tampa Housing Authority to address the violence since she moved in about two years ago, she said, and hopes Wednesday's shooting will result in safety changes.\n\"There's constantly shooting around here,\" said \"You hear the shots, by the time you get there no one is there. Unfortunately today a baby has been shot so how can we combat this to make this community safe?\"\nShe was at the resident council office when she heard the shooting and rushed down to the apartment, around the corner from her own, to see what was going on, she said. By the time she arrived, no one was in sight.\n\"A lot of residents fear for their safety here, so they hate to call the police or go to the front office because they're fearful of retaliation against them,\" Iman said. \"You sit back, you shut your door and you just allow it to happen and that needs to change.\""}