{"uri": "http://www.ky3.com/content/news/390076171.html", "title": "Eight injured, suspect arrested in Joplin shooting spree", "dct": "Sat, 13 Aug 2016 11:13:00 GMT", "id": "702a9a142029a6981a221af9cd2da959", "content": "JOPLIN, Mo. Joplin police have arrested a man who opened fire on three vehicles, injuring at least eight people Saturday morning.\nPolice report officers responded to a call just after 5 a.m. about shots fired in the 1800 block of Connecticut Ave. Four people were injured by gunshots and one was struck by shrapnel.\nJoplin officers located a possible suspect a few blocks away. As they tried to stop the vehicle, officers reported hearing shots being fired from the suspect vehicle. The person in the vehicle fired shots, striking people in a church at 32nd St. and Connecticut Ave. The officers chased the suspect, who officers report fired additional shots at people near 32nd St. and Texas Ave.\nPolice arrested the suspect about 15 minutes after the incident was reported.\nAt 32nd St. and Connecticut Ave., the van the suspect fired upon was stopped at a traffic signal. As the suspect traveled through the intersection police said he fired multiple rounds. Three adult victims were injured either by direct gunfire or shrapnel. One of the victims is listed as critical but stable, one victim is listed as serious but stable and the third victim was treated released.\nAt the 32nd St. and Texas Ave. location, the suspect fired multiple rounds at an oncoming, vehicle. The driver was struck by rounds and the passenger was struck by shrapnel. These two victims were transported to a local hospital. The driver is listed as stable and the passenger has been released.\nPolice identify the suspect as Tom S. Mourning II, 26, Joplin, Mo. Charges have not yet been submitted to the Jasper County Prosecutor’s Office.\nPolice added that two service dogs riding in the church van were also struck by gunfire. One was grazed, the other suffered an injury that required surgery.\nInvestigators have not determined a motive for the shooting, Police recovered a rifle and a handgun. Investigators add that there does not appear to be any relationship between the suspect and the victims."}