{"uri": "http://www.times-standard.com/general-news/20160813/latest-woman-husband-in-critical-after-missouri-gunfire", "title": "Latest: Woman: Husband in critical after Missouri gunfire", "dct": "Sat, 13 Aug 2016 18:38:00 GMT", "id": "727609bf11f1d5c2cfc6ad900008951a", "content": "JOPLIN, Mo. (AP) — The Latest on the shooting in Joplin, Missouri, that injured five people (all times local):\n6:30 p.m.\nA woman who was in a Joplin, Missouri, church van when it was fired on says the group didn't know what was happening when the gunfire erupted.\nVicki Eby told KOAM-TV (http://j.mp/2aUCnoe ) she was in the church van early Saturday with her husband Kenneth, who was driving, and two other people.\nAdvertisement\nShe said they heard \"three pops go off\" but that it was so dark \"we didn't know what was happening.\"\nShe said one of the bullets hit her husband's lung, and that he's hospitalized in critical condition.\nTwo other people were also wounded in a pickup truck nearby.\nA suspect has been taken into custody, but authorities say formal charges haven't been filed.\nPolice also told AP Radio that the suspect's father called police to report the suspect was firing rounds at the family's home.\n___\n1:35 p.m.\nJoplin authorities have identified five people wounded in apparently random shootings as they sat in their vehicles.\nPolice said in a statement that Kenneth Eby; his wife, Vicki Eby; and Heidi Gustin of Joplin's Immanuel Lutheran Church were sitting in a church van at a traffic light when they were shot Saturday.\nThey were headed to St. Louis for a meeting about the church's Comfort Dog ministry. Two dogs were also wounded.\nThe Joplin Globe reports (http://j.mp/2beO4t1 ) Kenneth Eby is in critical but stable condition. Vicki Eby sustained minor injuries. Gustin has injuries considered serious but not life-threatening.\nTwo other victims shot separately in their pickup, are identified as Donal Pugh, who's in serious but stable condition, and Debbie Pugh, who sustained minor injuries.\nA 26-year-old suspect is in custody.\n___\n12 p.m.\nJoplin police say a man has been arrested after five people were injured in two apparently random roadway shootings.\nThe Joplin Globe reports (http://j.mp/2aU2yez) that police have arrested a 26-year-old man suspected in the early Saturday shootings.\nPolice said there's no apparent motive for the shooting.\nOfficers were called to a duplex early Saturday and found no victims.\nPolice tried to stop a vehicle, the driver of which fired shots at a church van that was stopped at a traffic light. Three adults in the van were injured, and two are hospitalized with injuries that are not life-threatening.\nThe suspect is also accused of shooting at a pickup truck and injuring two adults. The driver is hospitalized, the passenger was released.\nPolice say the suspect is being held pending formal charges\n___\nInformation from: The Joplin (Mo.) Globe, http://www.joplinglobe.com"}