{"uri": "http://www.delmarvanow.com/story/news/local/delaware/2015/08/30/ocean-view-child-shot/71422926/", "title": "2-year-old shot by dad in Ocean View, police say", "dct": "Sun, 30 Aug 2015 00:00:00 GMT", "id": "4532c4e4596fe4623ebe519f511cbfe0", "content": "Police: Father accidentally shot daughter while showing his wife a handgun he had just received.\nTroopers are investigating a shooting that occurred in a family residence near Ocean View and left a 2-year-old with injuries.\nAccording to Delaware State Police Superintendent Colonel Nathaniel McQueen Jr., troopers and EMS personnel were dispatched to a residence in the 37000 block of Muddy Neck Road at about 1:10 a.m. Sunday, Aug. 30, after a 911 call was received stating a child had been shot.\nMcQueen stated Joseph M. Jenkins Jr., 38, had shot his 2-year-old daughter in the left leg while showing his wife a gun he had just received. The child's mother immediately contacted 911, and EMS and Delaware State Police Aviation arrived to transport the young girl to A.I. DuPont Hospital, where she is currently being treated Sunday.\nTroopers immediately took Jenkins into custody without incident, McQueen said.\nFurther investigation revealed a burglary report had been taken at about 9 p.m. Saturday from Jenkins and his wife after his shotgun and some cash were stolen from their house. Police say after troopers departed his home, Jenkins left and went to a friend's house, where he obtained a .40 caliber handgun.\nHe returned to his residence at about 1 a.m. and, upon entering, his wife woke up from sleeping on the floor in the living room. Police say the couple's three children — two girls ages 2 and 6, and a son, 10 — were all asleep on a sofa nearby when Jenkins sat on the floor next to his wife to show her the gun. As he pulled back on the slide of the gun and let it go, a bullet fired and struck the youngest child in the leg.\nJenkins was transported to Troop 4 in Georgetown, where he was charged with first-degree assault, possession of a firearm during the commission of a felony and three counts of endangering the welfare of a child. He was committed to Sussex Correctional Institution in lieu of $41,500 secured bond."}