{"uri": "http://www.nbcdfw.com/news/local/Authorities-Try-to-Reconstruct-Scene-of-Familys-Murder-Suicide-225030912.html", "title": "Sheriff: Rice Mother Shot Three Sons, Husband, Self", "dct": "Tue, 24 Sep 2013 15:05:00 GMT", "id": "cdc28be50f655f5f0830055ed9e6f053", "content": "A mother fatally shot her husband and three sons in their North Texas home before killing herself with a single shot to the head, the county sheriff announced Tuesday.\nInvestigators were still trying to determine why 33-year-old Guadalupe Ronquillo-Ovalle killed her family late Thursday or early Friday in Rice, 40 miles southeast of Dallas.\nNavarro County Sheriff Elmer Tanner said the bodies of Ronquillo-Ovalle; her husband, Israel Alvarez, 33; and their sons, ages 4, 8 and 10, were discovered Sunday by Alvarez's father.\nAlvarez and his sons had all been shot in the upper torso. Tanner said there was no indication that Alvarez fired any shots.\nManuel Alvarez, Israel Alvarez's father, called 911 after finding the bodies. In Spanish, he told the operator, \"They're all dead.\"\nThe killings came less than two weeks after Israel Alvarez was charged with family violence. Tanner said investigators could not determine much from his Sept. 11 arrest for a misdemeanor family violence charge, \"other than that was an isolated incident involving family violence.\"\n\"We can only assume that there were problems in the household,\" Tanner said at a news conference.\nMaria Franco, a family friend, said the couple came to her home on Sept. 16, asking for advice about keeping their relationship together. The couple talked about \"normal problems\" they were having, she said.\n\"I didn't hear anything dangerous,\" Franco said.\nManuel Alvarez said his three grandson were just like any other boys.\n\"Just like any other children, you saw them run around. They were normal children,\" he said.\nAccording to a sheriff's office report released Monday, Ronquillo-Ovalle went to her children's elementary school on Sept. 11 to call 911 because Alvarez took away her cellphone and removed the battery. She told a deputy that she was on the phone talking to her sister when Alvarez entered the room and pushed her.\nHe pleaded no contest to the misdemeanor charge, paid a $367 fine and was released after spending two days in jail, records show.\nNo divorce filings or requests for a restraining order were filed, and Ronquillo-Ovalle did not ask for a protective order, according to records.\nIn an audio recording released Tuesday of a 911 call made by Alvarez's father after he found the bodies, Manuel Alvarez said he thought the deaths were due to suicide from natural gas being left on in the home. He had to use a ladder to enter the home through a second-story balcony.\nFranco said the couple's 10-year-old son was best friends with one of her sons. She had to tell her son that his friend was now in heaven.\n\"I don't want to think about it,\" Franco said. \"It breaks my heart.\"\n\"I join hands with students, staff and members of the community in offering our deepest sympathy concerning the tragic loss of three precious children who were students of Rice Elementary and Rice intermediate/ Middle Schools. Together, we honor their memory,\" Judith Pritchett, Rice school district superintendent, said in a statement Tuesday.\nThere is a growing memorial outside the family's home. A local pastor said the community reeling from the deaths.\n\"They're stunned, they're sad, because they love these people,\" pastor Eliseo Aldape said. \"They saw them at grocery store, at different activities at school, and so they grieve.\"\nNBC 5's Ray Villeda and Associated Press writer Juan A. Lozano in Houston contributed to this report."}