{"uri": "http://www.nj.com/essex/index.ssf/2016/11/child_killed_in_orange_shooting_official_says.html#incart_2box_nj-homepage-featured", "title": "Toddler, man shot to death in Orange", "dct": "Thu, 03 Nov 2016 16:15:00 GMT", "id": "65220a941d2ce8d9bd3c84f21a93d42b", "content": "ORANGE -- A shooting left a toddler and a man dead in Orange Thursday afternoon at a house in a neighborhood that residents say is often the scene of violence.\nA man, believed to be in his twenties, and the young boy were fatally shot on Cleveland Street, near Lakeside Avenue, Acting Essex County Prosecutor Carolyn A. Murray and Orange Township Police Director Todd Warren said in a statement shortly after the shooting, which occurred around 3 p.m.\nThe scene, not far from the Cleveland Street elementary school, was flooded with area police officers, including units from the Essex County sheriff's and prosecutor's offices. Shortly after the shooting, children could be seen screaming and running from the area. A crossing guard was seen corralling the children into the nearby school.\nNeighbors in the area said shootings have become an all too common occurrence.\n\"They need to clean up Orange, because this happens all the time,\" one woman, who declined to give her name, said.\"Kids are afraid to even walk to school. It's been getting worse. I don't even want to come outside.\"\nPolice reopened roads in the area Thursday night as members of the prosecutor's office homicide unit continued to work at the scene.\nThree neighbors said the gunfire occurred at a house on Cleveland Street, near Hawthorne Street.\nOne nearby resident, who would not give his name because he said he feared retribution, said he saw a man with a gun run toward the home around 3 p.m. and heard approximately 15 shots. The man fled in a dark colored car and authorities soon converged on the scene, he added.\n\"I saw him with the gun out and go inside [the house]\" the resident said in interview across from the scene. He said he saw police taking several people out of the house.\nAnother neighbor, Jensy Marcelin, who was trying to get back into his apartment behind crime scene tape, called the shooting \"crazy.\"\n\"He's just a baby,\" Marcelin said. \"Orange is bad right now.\"\nReached by phone Thursday, Councilman Kerry Coley described the incident \"just a horrible tragedy.\"\nGun violence is not uncommon in the area.\nOn Monday, two people described only as \"minors\" were shot near North Day Street, a city spokesman previously said. One suffered a gunshot to his thigh and another was shot in the ankle. On Oct. 26, gunfire erupted near North Day and Alden streets but one was injured, the spokesman said.\nThe prosecutor's office, which is leading the investigation, has not released further details. Authorities have not announced any arrests.\nIn a statement late Thursday night, Orange Mayor Dwayne D. Warren called for unity to improve the quality of life in the city.\n\"Today, we suffered tragic losses due to gun violence in our community. We lost two lives today in Orange, due to senseless violence which is all too common across our nation. My heart goes out to the families of the victims involved in this tragedy,\" Warren said. \"We have to find a way to end gun violence in our communities. To prevent future tragedies in our city, we must become better neighbors and do something when we notice that something is not right in our neighborhood.\"\nWarren said his administration has deployed a range of public safety strategies, including an anonymous police tip line. He referred further questions to the county prosecutor's office.\nPolice also discovered a burned car on Burnside Street shortly after the shooting that matched the description of a vehicle seen fleeing from the homicides, sources with knowledge of the investigation said.\nInvestigators Thursday night had shut down Cleveland Street between Lakeside and Park avenues. The investigation seemed centered around a home near the 300 block of Cleveland, about a block up from Lakeside Avenue. The residential neighborhood is also near at least one daycare facility.\nCalls to school district personnel were not immediately returned.\nAnyone with information was urged to call the prosecutor's office tip line at 1-877- TIPS-4EC or 1-877-847-7432.\nNoah Cohen may be reached at ncohen@njadvancemedia.com. Follow him on Twitter @noahyc. Find NJ.com on Facebook."}