{"uri": "http://fox6now.com/2015/06/11/released-menasha-police-issue-final-report-on-trestle-trail-bridge-shooting/", "title": "Released: Menasha police issue final report on Trestle Trail bridge shooting", "dct": "Thu, 11 Jun 2015 12:28:00 GMT", "id": "371126d2e7ecfdb97386178806f86f5c", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nMENASHA -- Menasha police released a report on Thursday, June 11th on the shooting that resulted in four deaths on a recreational bridge. The report says the shooter had a long history of depression, alcohol dependency, suicidal and sometimes homicidal thoughts.\nInvestigators say Sergio Valencia del Toro was intoxicated when he fatally shot two men and a child on the bridge before taking his own life on May 3rd.\nThe report cites del Toro's behavioral health history which showed that while in the Air Force he had either sought or had been ordered to a number of behavioral health interventions. The report says in October 2010, he had gone to an emergency walk-in clinic because he was concerned about the intensity of his mood swings.\nAuthorities say del Toro killed Jon Stoffel, his 11-year-old daughter Olivia and Adam Bentdahl. Stoffel' wife, Erin, was injured.\nThe report also notes a surveillance camera located within a pavilion at Fritse Park captured some of what happened on May 3rd. The report says:\n\"Prior to the shooting, individuals can be observed exiting and entering the Trestle Trail Bridge as well as other individuals utilizing the park area within Fritse Park. At some point, it becomes apparent something is occurring on the Trestle Trail Bridge as individuals that are near the bridge start to abruptly move away from the bridge, some of them actually running.\"\nPolice interviewed Erin Stoffel three days after the shooting -- while she was recovering. The report indicates she told investigators she was walking on the bridge with her family when \"she heard a loud bang; however, didn't recognize what it was.\" Her husband, Jon, and Olivia were behind her at the time. The report states when Erin Stoffel turned around, she saw a man had something in his hand -- \"he said something to the effect of, 'you didn't see anything,\" and almost simultaneously brought the item that he had in his hand out of the bag and at that point he started to shoot all of them.\" Erin Stoffel told police \"she remembers both she and Jon were shot almost simultaneously.\" She also told police \"that her husband Jon said, 'May God forgive you' to the shooter.\"\n\"It's still our belief that this was completely a random act,\" said Tim Styka, Menasha Police Chief.\nErin Stoffel was released from the hospital on Friday, May 22nd. Prior to that release, she issued the following statement from her surgeon at Theda Clark Medical Center:\n\"I am grateful to my friends, family and the community for their outpouring of support and prayers to me and my children. I have a long road ahead of me, but my doctors say I am making progress. It is still hard.\n\"Jon was such an incredible husband and father. I was so honored God chose me to be his wife. He taught me so much and was so selfless, loving and funny. I could go on and on. Olivia was the most sweetest, dear daughter. She had a heart of gold and loved her family and close friends. I miss them so much and the pain is deep.\n\"However, I cherish my visits in the hospital with Ezra and Selah and, with the help of God, will be strong for them. I look forward to joining them at home soon.\""}