{"uri": "http://www.sheboyganpress.com/story/news/local/2015/05/06/witness-saw-gunman-standing-bridge-long-time/70894592/", "title": "Police: Menasha gunman shot victims multiple times", "dct": "Wed, 06 May 2015 00:00:00 GMT", "id": "661eb2ad705cb2d59a96dbfcbf1e63db", "content": "MENASHA – Police said Wednesday that Jonathan Stoffel of Neenah was shot seven times Sunday on the Fox Cities Trestle Trail bridge, and his 11-year-old daughter was shot three times. A third victim, Adam Bentdahl of Appleton, was shot once, according to preliminary autopsy results.\nMeanwhile, Post-Crescent Media learned that the shooter, Sergio Valencia del Toro of Menasha, had been on the bridge at least 45 minutes before opening fire.\nValencia del Toro used a 9 mm semi-automatic pistol to kill the victims, all of whom died on the bridge, police said.\nStoffel's wife, Erin, the fourth person shot by Valencia del Toro, suffered three gunshot wounds during the shooting spree.\nRELATED STORIES\nPolice said Erin Stoffel was improving at Theda Clark Medical Center in Neenah, where she was in serious condition.\nValencia del Toro, 27, died of a self-inflicted gunshot wound to the head from a second handgun that he brought to the bridge, police said.\nWitnesses saw Valencia del Toro on the bridge before shooting. Maxine and Don Pohlman of Neenah walked across the bridge from Fritse Park starting at 6:30 p.m. Sunday, and they noticed Valencia del Toro on their way to the Menasha lock and again on their return to Fritse Park. He was standing alone by his bicycle inside the pavilion on the bridge both times. He stood out to the Pohlmans because he was wearing fatigues for pants and a sweatshirt.\n\"People were saying he came and started shooting,\" Maxine Pohlman told Post-Crescent Media Wednesday. \"He was standing there a long time.\"\nThe Pohlmans completed their walk at 7:10 p.m. and returned home. Police said Valencia del Toro began shooting unprovoked and at close range near the pavilion at 7:30 p.m.\nMaxine Pohlman said it was a pleasant night on the bridge, though windy, and that there were more fishermen than usual. She and her husband have reflected a lot about that night since the shooting.\n\"You think, 'What triggered that response?'\" she said. \"There were a lot of people on the bridge Sunday night.\"\nPolice said Valencia del Toro was armed with two handguns when he biked to the bridge some time after an argument with his fiancee, which occurred before 5 p.m. at their house on Eighth Street in Menasha.\nPohlman said she and her husband had good looks at Valencia del Toro and didn't notice any guns on him. Don Pohlman is a retired detective with the Neenah Police Department.\n\"Don said he would have noticed right away if you could see the guns at all,\" she said. \"You couldn't.\"\nPohlman said Valencia del Toro stood out not only because of his pants, but also because of his lack of interaction. She said people typically are friendly on the bridge, acknowledging one another as they meet. Pohlman said her husband sent a hello to the man but got no response.\nShe also recalled that someone was taking a picture of two people sitting on a bench at the pavilion near Valencia del Toro.\n\"He was very close there and didn't make any effort to get out of the way of the picture,\" she said.\nValencia del Toro's fiancee, Haylie Peterson of Menasha, told Post-Crescent Media on Tuesday that he suffered from major depression and was very irrational. She said their argument Sunday was about her concerns with his depression and that she left the house because \"we agreed we both needed time to process our emotions.\"\nShe said they recently had postponed their wedding but never ended their engagement.\nMenasha police reiterated their earlier statement that Peterson told investigators that the wedding had been called off recently and that the argument \"was a serious disagreement over the relationship status.\"\n\"The investigation to determine what led up to this incident continues, and any information that further identifies the motive for this attack will be released,\" Menasha police said in a statement.\nPolice said a majority of the first responders and dispatchers involved in the tragedy participated in a critical incident stress debriefing, which is designed to reduce distress.\nIn addition, support was provided to the community for the third consecutive day by the Fox Cities Victim Crisis Responders. People seeking counseling after Wednesday are encouraged to contact the Menasha Health Department, 316 Racine St., at 920-967- 3520.\n— Duke Behnke: 920-993-7176, or dbehnke@postcrescent.com; on Twitter @DukeBehnke"}