{"uri": "http://www.postcrescent.com/story/news/local/2015/05/03/authorities-responding-shooting-near-trestle-trail-bridge-menasha/26850787/", "title": "Police: 4 dead, including suspect, in Menasha shooting", "dct": "Sun, 03 May 2015 00:00:00 GMT", "id": "9eeeffafa7efa8430901dc342f814194", "content": "Ron Page/Post Crescent\nMENASHA -- Four people were killed and one person was injured in a shooting spree on the Fox Cities Trestle Trail bridge in Menasha Sunday night, police said.\nAaron Zemlock, the Menasha Police Department's community liaison officer, said the shooting happened at about 7:30 p.m. on the west end of the bridge that spans Little Lake Butte des Morts and connects Menasha and the Town of Menasha.\nThe shooter, a man, was among those killed, Chief Tim Styka said late Sunday night. He was pronounced dead at a local hospital.\n\"At this point we do not believe there is any other threat to the community,\" Styka said. \"We think this was a random act. It does not appear that anyone was targeted.\"\nThe only victim still alive underwent surgery at Theda Clark Medical Center in Neenah, police said. The person was in critical condition.\nIt is one of the deadliest shootings in the Fox Cities' history.\nAbout 30 officers from Menasha, Town of Menasha, Appleton, Neenah, Winnebago County Sheriff's Department and State Patrol responded to the scene within minutes after the shooting was reported, Styka said. Police flooded both ends of the bridge -- at Fritse Park in the Town of Menasha and at the Menasha lock in the city.\nNone of the officers fired their weapons, he said.\nPolice did not identify any of the victims, pending the notification of relatives. Menasha police will release additional information at a press conference Monday.\nJon Bacon, a tender at the Menasha lock, and Judge Finley, a Menasha man who was fishing at the east end of the bridge, told Post-Crescent Media they heard 10 to 12 shots coming from the bridge.\n\"He shot enough rounds to hurt several people,\" Finley said. \"I mean it was just like the old days in (Vietnam): Bang, bang, bang, bang ... and then it got quiet.\n\"I saw people running, and both of us looked at each other and said, 'Those weren't fireworks.'\"\n\"People were running off the bridge in both directions,\" Bacon said.\nFinley said some people took cover by lying down on the bridge. \"They were scared,\" he said.\nPolice were interviewing witnesses late Sunday night. The Trestle Trail bridge will be closed to the public until further notice.\nThe Trestle Trail is popular among Fox Cities residents and visitors. A count showed that 354,631 people used the trail in 2011, an average of 972 people a day.\n\"It is used year-round,\" Brian Tungate, Menasha's parks and recreation director, previously told Post-Crescent Media. \"It is used by residents. It is used by folks from outside the community.\"\n— Duke Behnke: 920-993-7176, or dbehnke@postcrescent.com; on Twitter @DukeBehnke; Jen Zettel: 920-993-1000, ext. 539, or jzettel@postcrescent.com; on Twitter @jenzettel."}