{"uri": "http://www.kiro7.com/news/south-sound-news/police-6-victims-hospitalized-after-string-of-tacoma-shootings/427087649", "title": "Police: 6 victims hospitalized after string of Tacoma shootings", "dct": "Sat, 20 Aug 2016 23:43:00 GMT", "id": "7514e6c0d7e4fb9428e5e2a08244ed36", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nTACOMA, Wash. - Five people are in the hospital after three overnight shootings in Tacoma.\nThe shootings occurred within over 3 1/2 of each other. Tacoma police say they are struggling to figure out exactly what happened.\n\"We're asking people who were here and saw things to please call and let us know what they saw,\" Officer Loretta Cool, a spokeswoman for the Tacoma Police said.\nThe first shooting, a drive-by, was reported just after 10:30 p.m. Friday in the 1200 block of South 11th Street.\nNo suspects were found. A victim was taken to Tacoma General Hospital, authorities said.\nJust after 1 a.m., another drive-by led to the arrest of two people; no one was hurt. Less than an hour later, a third shooting occurred on Pacific Avenue.\nTwo people were found shot on the street. Three others showed up at St. Joseph Hospital.\nThe shooting comes as Pacific Avenue is undergoing a renaissance. Most businesses on the street have surveillance cameras.\nReva Wallace, a supervisor at The Forum, said her restaurant plans to bump up security and install additional cameras.\n\"We run 2-3 security guys a night,\" Wallace said. \"I think that's what you can do is just responsible employees, responsible security and responsible owners.\"\nMany people said they believe the trouble started at a private, all-ages party in what used to be a licensed club in the building.\nThen it spilled outside.\nAll five people shot on Pacific Avenue, including a 21-year-old woman and a 16-year-old boy, as well as the victim from the earlier shooting, are expected to survive.\nTacoma businesses rattled by overnight shooting; at least 2 people shot. 3 other possible victims. @KIRO7Seattle pic.twitter.com/oh2394LxII\n— DeborahHorne (@DeborahKIRO7) August 20, 2016\n© 2017 Cox Media Group."}