{"uri": "http://www.nydailynews.com/new-york/brooklyn/people-wounded-brooklyn-shootings-article-1.2698989", "title": "20 people wounded, one critically, in 10 shootings across NYC on Fourth of July", "dct": "Tue, 05 Jul 2016 09:07:00 GMT", "id": "00e9f18009481778a62593e2e3ff4a94", "content": "A spate of Fourth of July gunfire left 20 people wounded, including seven at a Brooklyn barbecue, across the city Monday night.\nOne of the shootings happened at around 9 p.m., when a 22-year-old man was blasted in the chest on Chauncey St. and Broadway in Bedford-Stuyvesant.\nHe staggered to a nearby FDNY stationhouse for help, officials said.\nEmergency personnel rushed him to Brookdale Hospital in stable condition as police searched for three men and two women who fled the scene of the incident, according to cops.\nA police source linked the attack to an 11:30 p.m. shooting that wounded seven people at an Independence Day backyard bash, which was packed with teenagers as young as 14 years old, on Chauncey St. by Saratoga Ave.\nThe gunman opened fire through a gate and struck four male and three female victims, all of whom are expected to survive. The shooting is gang-related, the source added.\n“It was just a bunch of teens,” Sam Weaver Sr., 43, said of the victims, including his 19-year-old son, Sam, who was struck in the lower back.\nOne man was critically wounded. A second man and two women were shot in the hand while another woman was shot in the thigh. Rescuers took five victims to area hospitals, while two others went to hospitals by private means.\nWeaver’s son was taken to Kings County Hospital in stable condition.\n“As soon as the fireworks stopped, the gunfire started,” Weaver said while leaving for the hospital as it began to pour rain in Brooklyn.\nEarlier in the night, at around 5 p.m., a 24-year-old man was shot twice in the back in East Flatbush. He is expected to survive.\nCops are looking for three men who fled the scene.\nAt 10:15 p.m., gunshots erupted again, this time about a mile away at Wilson Ave. and Cooper St., police said.\nAn 18-year-old man was hit five times in the chest and taken to Brookdale in stable condition.\nIn Harlem, a 20-year-old man survived being shot in the left side of the head just before 8:15 p.m. and was taken to Harlem Hospital in stable condition, cops said.\nAt 11:15 p.m., a 22-year-old man was shot in the right leg on Franklin Ave. by Park Pl. in Crown Heights.\nGunshot victims walked into Richmond University Medical Center in Staten Island and Kings County Hospital in Brooklyn, cops said.\nPolice were also responding to two shootings that occurred after midnight. One person was shot in the Bronx, on Intervale Ave. by Home St. in Foxhurst, while a second was struck in Brooklyn, on Ocean Ave. and St. Paul’s Ct. by Prospect Park."}