{"uri": "http://www.wmbfnews.com/story/25607028/3-people-shot-and-killed-at-myrtle-beach-hotel", "title": "Report provides new details on triple homicide at Myrtle Beach motel", "dct": "NODATE", "id": "344e62bbe1dcd030913f23ae33b246a3", "content": "MYRTLE BEACH, SC (WMBF) – Three people were killed, and another injured in a shooting at the Bermuda Sands Motel on Ocean Boulevard late Saturday night, a police official confirmed. Police continue to investigate, and are asking the public for video and information of the incident.\nOfficers responded to a report of a large fight in front of the motel near First Avenue North at about 11 p.m., stated Myrtle Beach Police Captain David Knipes. Before officers arrived, three shots were fired by a man, striking and injuring Keith Williams. The man who shot Williams was described by police as a black male wearing black pants and a white shirt with writing on the front.\nIt is believed the people involved in the fight then fled to the second floor of the motel, Captain Knipes stated. As officers were tending to Williams, another offender went to the second floor and fired multiple shots at the people involved in the fight, striking and killing three people. It is believed the offender fled out the rear of the hotel.\nDeputy Coroner Darris Fowler has identified the victims as Devonte Dantzler, 21, of Summerville, SC; Jamie Williams, 28, of Ladson, SC; and Sandy Gaddis Barnwell, 22, of Summerville, SC. All three deaths were ruled as homicides. The victims died of trauma to vital organs due to gun shots.\nPolice also arrested two offenders who were involved in the fight before the shootings, according to the police report. They were arrested on other charges related to the investigation, and not related to the shooting of any of the victims.\nMayor Rhodes speaks out\n\"I don't know if there's anything I could say that could satisfy our residents and the business community in our city right now,\" said Myrtle Beach Mayor John Rhodes.\nWMBF News spoke with the Mayor on Monday to see if the city has plans to make changes to Memorial Day Weekend security in the future to prevent crime. The short answer is yes.\n\"I'm fed up with it; I'm mad as hell about it,\" added Rhodes. \"Something has to be done and whatever we have to do to correct this thing, that's the direction we're going in.\"\nThis triple homicide is one of five shootings in Myrtle Beach in less than 48 hours. Rhodes said this crime trend does not reflect the true Myrtle Beach.\n\"This is not Myrtle Beach. This is Memorial Day weekend that has been the black biker rally that all this is taking place,\" added Rhodes. \"This is not what happens the rest of the year, so please don't look at this as something as a habit that happens every week.\"\n\"You always try to prepare for the unexpected. We've had shooting incidents before,\" Capt. Knipes said.\nA witness who did not wish to be identified said that the shooting started from \"somebody fighting in the streets over something that happened in the streets. Somebody told somebody to move out the streets. Basically, that's what happened, that's what escalated from the beginning.\"\nA video apparently shows the scene when the shooting occurred. It was uploaded to Instagram by a user who wishes to remain anonymous. Capt. Knipes stated that police have obtained video of the initial fight in the street, and are seeking any additional cell phone video, witnesses, and information as to the second suspect from the second floor the hotel. The information can be sent to btruex@cityofmyrtlebeach.com, or call 843-918-1382.\nOne block of Ocean Boulevard South was closed down for several hours overnight while South Carolina Law Enforcement investigators and MBPD detectives were on scene, according to Raycom News Network reporter Jody Barr. Investigators were seen on the motel's second floor balcony. Officers spent several hours keeping people away from the crime scene.\n\"You don't want Bike Week to be like that,\" the witness said. \"You want Bike Week to be peaceful.\"\nCopyright 2014 WMBF News. All rights reserved."}