{"uri": "http://www.local10.com/news/florida/orlando-massacre-survivors-trying-to-heal-physically-mentally", "title": "Orlando massacre survivors trying to heal physically, mentally", "dct": "Sat, 18 Jun 2016 10:26:00 GMT", "id": "298ccc1855c1751f65fa2d4a97b561f2", "content": "Felipe Marrero wakes up in his hospital bed at night still thinking he smells gunpowder, nearly a week after the shooting rampage at the Pulse nightclub in Orlando.\nIt's just one of the ways the 30-year-old has suffered after being shot four times in his back and left arm during the attack last Sunday morning that left 49 victims dead and more than 50 wounded. The gunman, 29-year-old Omar Mateen, also was killed in a firefight with police.\n\"It's the same smell that was in the club that night,\" Marrero said in an interview Friday from his hospital bed at Orlando Regional Medical Center.\nThe shock among the city's residents was turning to grief as families buried their loved ones in cemeteries across the city. With more funerals planned in coming days, the city adorned with \"Orlando Strong\" banners has been coming together to support each other.\n\"It's amazing me how the community is getting so close,\" said Monica Roggiero, outside the funeral of shooting victim Anthony Luis Laureano Disla.\nWhile some of the dead are buried, the wounded continue trying to heal physically and mentally.\nMarrero said he was just about to leave the club about 2 a.m. Sunday when he heard the shooting start. He was near the front door, close to the shooter, so he couldn't leave through the club's only exit. He fell to the floor. His friend, Luis Vielma, standing next to him was shot and killed.\nMarrero lifted the edge of a couch near where he was lying and put his head underneath it.\n\"I covered myself, and laid on the ground for at least 30 minutes not trying to make any sudden movements,\" he said. \"I was just trying to play dead.\"\nAnother 30 to 40 minutes passed. People were yelling, screaming.\nThe head of a man lying next to him had been blown apart. Bodies were everywhere, including that of his good friend, Luis.\n\"And the smell of the place was horrible — like gunpowder — and you just smelled death in the air,\" he said.\nHe said the shots stopped for a while and he noticed the police were outside.\nFlashing police lights started seeping into the club, he said, and officers were telling everyone to stay on the ground. Marrero said Mateen would lie among the bodies for a time so police couldn't see him.\nThe shots stopped, as though Mateen were reloading, Marrero said.\nNext, Mateen shot Marrero, hitting his lower back and left arm.\n\"I just lay there and all the blood coming out of my hand, and my arm was destroyed,\" he said. \"The amount of pain was unbearable.\"\nAs shots continued to fly, Marrero said he made eye contact with an officer through the front door. He pleaded for help.\n\"He asked me to crawl to him, and the shooter had gone to another part of the club,\" he said. He believes Mateen had gone to an area where police had punched holes in the walls — where Mateen was eventually fatally shot.\nMarrero told the officer he couldn't move. That he'd been shot in the back.\n\"He said, 'You need to find the strength to do this.'\"\nMarrero says he used his right arm to grab dead bodies around him, got leverage and pushed himself toward the officer.\nThe officer grabbed his hand and dragged him quickly to an empty lot nearby, where paramedics eventually got to him.\nHis vision was blurry, and he'd lost a lot of blood.\n\"I just thought 'This is it,'\" he said.\nThe next day, lying in his hospital bed at Orlando Regional Medical Center, Marrero says he saw Mateen's picture on television and immediately recognized him.\n\"I said 'This guy was right next to me buying a drink,'\" Marrero said.\nHis account of Mateen's whereabouts in the hours before the shooting could not immediately be verified. Marrero said he gave that account to investigators. The FBI declined to comment and has not provided a timeline accounting for Mateen's movements that night.\nMarrero said he's starting to heal but knows he has a long road. He's had multiple surgeries and started physical therapy to try to regain the use of his arm. He started a gofundme account to raise money for medical bills.\nThe ordeal has also affected his sleep.\n\"The other night I woke up, and for some reason I started smelling the gunpowder,\" he said."}