{"uri": "http://www.lohud.com/story/news/crime/2017/01/17/man-charged-shamoya-mckenzie-shooting/96658506/", "title": "VIDEO: David Hardy charged in Shamoya McKenzie shooting in Mount Vernon", "dct": "Tue, 17 Jan 2017 00:00:00 GMT", "id": "515579c0dda867006fbaf3087fa069ca", "content": "McKenzie, 13, was shot and killed on New Year's Eve. Authorities said Tuesday that she was the unintended victim of gang-related gunfire.\nMOUNT VERNON - A local man faces a second-degree murder charge for allegedly firing the stray bullet that killed 13-year-old Shamoya McKenzie in Mount Vernon on New Year's Eve.\nDavid Hardy, 21, also faces a charge of second-degree criminal possession of a weapon in what authorities said was a gang-related shooting. Officials said they expected Hardy would also faces charges of attempted murder tied to his intended target.\nHe made an initial appearance early Tuesday afternoon in Mount Vernon City Court and is due back in court Feb. 2.\nAccording to the felony complaint filed in the case, Hardy was aiming for another person, Prince Scott, and fired multiple times at him with a 9 mm firearm. Scott was wounded in the incident.\nMcKenzie was a passenger in a vehicle that was traveling near the 300 block of East Third Street in the middle of the afternoon when she was struck in the head. She was pronounced dead shortly after at Montefiore Mount Vernon Hospital.\nHardy was ordered held at the Westchester County Jail pending further court proceedings; his assigned lawyer, Peter St. George Davis, did not argue for bail at this time.\nJudge William Edwards said in court that like McKenzie, he had attended Graham Elementary School. He said McKenzie's loss has affected many in the city.\n\"It touches a bunch of us right in our hearts,\" he said.\nHardy was brought out for his court appearance wearing gray sweatpants and a dark gray/green hooded sweatshirt. He had a couple of tears on his face. As he walked in and out of court he looked back at a woman who had identified herself to reporters as his girlfriend.\nAfter court, Davis cautioned against jumping to conclusions, saying he doesn't believe authorities have any physical evidence that ties Hardy to the shooting. He said he hopes the media attention doesn't poison a potential jury pool.\n\"I try cases in court, not in the court of public opinion,\" he said. \"He's still innocent until proven guilty.\"\nHardy also faces a misdemeanor charge of second-degree aggravated harassment stemming from an incident in Mount Vernon on Dec. 29, in which he allegedly threatened to shoot his ex-girlfriend and her father, officials said.\nAuthorities said at a midday news conference that Hardy — who was on parole for a 2012 robbery conviction — had headed to the North Carolina area immediately after the shooting, and had just returned to the city before his arrest this weekend in Mount Vernon.\nMcKenzie's mother stood behind the mayor and district attorney at the news conference. Her family also attended Hardy's court appearance, but did not speak to reporters.\nMount Vernon police had been investigating the fatal shooting along with state police, the state parole division, the FBI and the Westchester County District Attorney's Office.\nWestchester District Attorney Anthony Scarpino called the case an \"ongoing investigation\" and said the FBI had been \"critical\" in tracking Hardy down. He declined to comment on why investigators allege Hardy fired at his intended target, but said \"several gangs\" were believed to have been tied to the matter.\nMOURNING: City grieves for McKenzie\nNew York State Crime Stoppers had initially offered a $2,500 reward for information leading to an arrest and conviction in the case before doubling it to $5,000.\nAlthough only an eighth grader at the K-8 Graham Elementary School in Mount Vernon, McKenzie was a talented basketball player already playing on the junior varsity basketball team at Mount Vernon High School. School officials described her as a stellar student, and her mother said McKenzie dreamed of playing basketball for the University of Connecticut and in the WNBA.\nThe UConn Huskies made McKenzie an honorary member after her death.\nThe investigation into McKenzie's shooting sparked a feud among city officials over staffing in the Mount Vernon Police Department, which Mayor Richard Thomas said had fewer officers on patrol than usual at the time of the shooting.\nOn Tuesday, he hailed the cooperation of many different agencies in solving the case, calling it \"a clear signal that Mount Vernon will move forward\" in addressing crime and other issues.\nAlthough the mayor made no mention of it at his press conference, in a statement issued late Tuesday evening Thomas confirmed that Hardy was \"briefly employed\" as a seasonal worker with the City of Mount Vernon but was terminated last month after he failed to show up to work. Thomas noted in his statement that Hardy was hired under a previous administration.\nThomas did not address how Hardy wound up hired while he was on parole, but said policies and procedures \"are being developed, reviewed and implemented\" to ensure current and future employees are \"properly vetted.\""}