{"uri": "http://abc7ny.com/news/at-least-1-person-shot-on-mount-vernon-street-/1680754/", "title": "Community mourns teen basketball player killed in Mount Vernon shooting", "dct": "Mon, 02 Jan 2017 00:00:00 GMT", "id": "6847004a6c1e50f2c477f8d6d50a137e", "content": "MOUNT VERNON, New York (WABC) --\nGrief counselors will be at Mount Vernon High School Monday as police search for the gunman who killed a 13-year-old student on New Year's Eve.\nNadine McKenzie now turns to her daughter's coaches, and others who helped shape 13-year-old Shamoya, a standout basketball player and student, whose dreams will never be realized.\n\"Put the gun down, put it down. This is a first in my family experience with Shamoya. This was an angel. She doesn't deserve to die like this,\" Nadine said.\nShamoya was riding in the car with her mother and two other family members, when a single bullet slammed through the side window, striking Shamoya in the head. Police believe she was an innocent bystander.\n\"A scholar with a lot of dreams, and someone who was going to do great things in this world, but unfortunately, a senseless heinous act of violence led to her untimely death,\" says Mount Vernon Mayor Richard Thomas.\nThe eighth grade student loved basketball, and others could easily see her potential. She was a player on the Mount Vernon High School Lady Knights basketball team, and was an 8th grade student at the Graham School.\n\"She loved to be around the game, and around the sport and around her teammates. Spending time with her was just amazing,\" said Coach David Newton.\n\"She was on her way, I think that's what hurts so much. She was soaring, she was really soaring. She was on her way,\" says Coach Dwayne Murray.\nIn Shamoya's honor, they released balloons and watched them soar, just as she was doing. While grief counselors will be on hand, others are concerned how students will work through the grief.\nDorothy Vereen is a parent and school monitor.\n\"How are these kids going to react to not having Shamoya right there, you know, laughing and joking? It's hard,\" she said.\n\"It's devastating, it's somebody's baby,\" added parent Dara Joseph.\nThe team posted a tribute to Shamoya on their Facebook page:\nTonight we lost an angel amongst us. Young Shamoya McKenzie was more than a rising star on the court. She was a beautiful, intelligent young lady who brightened the room with her smile. I do not know and pretend to understand God's plan, but I pray that we can all find strength to get through this unimaginable tragedy.\nWe will open the high school gym at 2pm tomorrow for anyone who wants to convene. There will be social workers and grief counselors lined up and Patrice Moore will lead us through prayer. Our babies should not have to bear this weight alone. Let us come together. Family\nA 28-year-old Mount Vernon man sustained a gunshot wound in the arm in the shooting but was not seriously hurt.\nMount Vernon police are continuing their investigation. So far there have been no arrests."}