{"uri": "http://newyork.cbslocal.com/2017/01/16/shamoya-mckenzie-arrest-made/", "title": "Suspect Arrested In Connection To Fatal Shooting Of Mount Vernon Basketball Star", "dct": "Mon, 16 Jan 2017 23:05:00 GMT", "id": "f4548f7f63a5cc32a0da02e642eb968e", "content": "MOUNT VERNON, N.Y. (CBSNewYork) — An arrest has been made in connection to the murder of 13-year-old Shamoya McKenzie — a rising Westchester County basketball star who was killed by a stray bullet.\nFor more than two weeks, family and friends of McKenzie have prayed for justice. It appears their prayers have finally been answered.\nSources tell CBS2 a man in his 20’s was taken into custody Monday morning by Mount Vernon police and federal law enforcement officers.\nAfter the shooting the suspect fled south, only to return to Mount Vernon at some point, according to sources.\nHe’s facing second degree murder charges, according to sources.\nMayor Richard Thomas announced the news at a Martin Luther King Day event earlier Monday to a thunderous applause.\nThe teen basketball star was murdered in the middle of the day on New Year’s Eve. She was shot in the head while sitting in her mother’s car with a bullet meant for someone else.\nFuneral services for McKenzie were held late Friday afternoon.\nAmong the mourners at the Macedonia Baptist Church in Mount Vernon were some of Shamoya’s teachers — still in shock over her sudden and senseless death.\n“Shamoya was just coming home from basketball practice doing what a 13-year-old should be doing with her mom, and it could have been any of our children,” Christine Ceglio said.\nShamoya’s death has so outraged local and state law enforcement that New York State Crime Stoppers announced that the reward for information leading to the killer’s arrest had been doubled to $5,000.\nMcKenzie was laid to rest on Saturday at Mount Hope Cemetery in Greenburgh.\nA local basketball coach spoke with McKenzie’s mother Monday night.\n“It’s been really hard on her, Saturday was brutally hard,” Dawyne Murray of the Mount Vernon Junior Knights told CBS2’s Tony Aiello. “This helps bring some kind of closure. But you don’t want to feel happy about it — you caught a murderer. What you would like to do is have your daughter.”\nThe Westchester County District Attorney’s office will hold a briefing with the media Tuesday morning."}