{"uri": "http://www.wfsb.com/story/29940429/2-arrested-in-bridgeport-ambush-shooting-that-killed-1-injured-8", "title": "2 arrested in Bridgeport 'ambush' shooting that killed 1, injured 8", "dct": "Wed, 02 Sep 2015 11:42:00 GMT", "id": "ba17fb3c874f0a1149e216d3c3be91cf", "content": "BRIDGEPORT, CT (WFSB) -\nTwo suspects have been arrested following a shooting that left one person dead and eight others hurt.\nJamal \"Moo Moo\" Hamilton, 24, and 24-year-old Kevan \"Web\" Bennett were charged through arrest warrants for the shooting at the Trumbull Gardens housing project on June 11.\nPolice said evidence suggests that both men and other unnamed suspects parked a car on nearby Sunshine Circle, split up and ambushed a group of people in the complex's parking lot from several positions. They allegedly sprayed the crowd with gunfire.\nAs they fled, the suspects continued to fire. Police said one bullet struck an elderly woman who was in the shower of her second floor home.\n\"For months, police officers and others have worked tirelessly to solve this heinous crime,\" said Mayor Bill Finch. \"Now we're taking another step forward.\"\nDetectives said they obtained arrest warrants for Hamilton and Bennett and officially charged them on Tuesday.\nThe shooting left eight people injured and killed 37-year-old Savonnie McNeil.\n\"There was no good reason for doing what they did. Never a good reason to use a firearm in anger to settle whatever score,\" said Bridgeport Police Chief Joseph Gaudett.\nBoth were already in custody on unrelated charges, according to police.\nTheir new charges include murder, eight counts of first-degree assault and weapons charges. They both have prior drug convictions and in court on Wednesday, the prosecutor said Bennett's record, which includes assault and gun convictions, along with armed robbery and aggravated assault out of Georgia, speaks for itself.\nThe suspects are being held on a $1 million bond.\n\"I want to thank the Bridgeport Police Department for their hard work on this case, and for bringing us one step closer to finding justice for the victims -- as well as their loved ones -- who have suffered because of this senseless act of violence,\" Finch said.\nWhile police have opened a substation and are using walking beats and installing cameras, the violence hasn't stopped completely.\nOn Tuesday, a man was shot in the same housing complex, leaving neighbors nervous.\n\"We're planning to move, can't be here anymore, can't even bring the kids outside to get some air,\" said Denise Gomez.\nBridgeport police said the investigation is still active and there may be more arrests.\nCopyright 2015 WFSB (Meredith Corporation). All rights reserved.\nConnecticut State Police have made a second arrest in the case of the…"}