{"uri": "http://www.stamfordadvocate.com/news/article/Nine-shot-one-reportedly-dead-in-Bridgeport-6320631.php#page-1", "title": "Eyewitness: Shooters intended to kill everyone", "dct": "Fri, 12 Jun 2015 00:00:00 GMT", "id": "cfce83dc196042c071115563465f55b8", "content": "BRIDGEPORT — Three gunmen who rushed into a parking lot party in the Trumbull Gardens on Thursday, the flash from their semi-automatics searing the early morning darkness, were intent on leaving no witnesses, an eyewitness said.\n“One of them yelled, ‘kill them all’ as they began firing,” a woman resident, still shaken hours later, told Hearst Connecticut Media.\nA Shelton man, 37-year-old Savonie “Vahnnie” McNeil, was killed in the fray, shot in the head. Eight other people were wounded, including a 59-year-old grandmother who was hit by a bullet in the buttocks while she was in the shower in her home nearby.\nMayor Bill Finch held a press conference later Thursday morning at the scene.\n“Our heart goes out to the people involved and to their families,’’ Finch said. “We are outraged. This kind of thing is just senseless. But we have made progress and we have the lowest crime rate in 40 years.\nStanding on the sidewalk near where Finch was talking, Police Union President Charles Paris told a different story.\n“It’s a sad day for the city of Bridgeport,” Paris said. “We need to step up patrols in the area. We are short and we need help. The mayor says crime is down but the shootings are way up, and they need to address that.”\nFinch promised better security at the large North End housing project, and said the Safe Corridors program, which puts security cameras on children’s walking routes to school and buses, would be expanded to Trumbull Avenue.\nBut residents said the mayor’s promises were too little, too late. Mayoral aspirant Joseph Ganim took advantage of their complaints, campaigning just yards from Finch’s press conference.\nThere had been about two dozen people in the parking lot about 1 a.m., sitting on car hoods and enjoying the night. Music was playing.\n“The kids were just out here chillin’, having a good time,” said the woman who witnessed the shooting. “About 24 people were out smoking blunts, drinkin’ Hennie and chillin’.\n“I was just talking to Vahnnie — I’ve known him since he was a baby. He wanted to see some glasses I was selling, his last words to me were ‘Let me see those shades.’ ”\nThe witness, whose name is being withheld, said, “As I was showing him the glasses, this girl Blaze asked me for a cigarette. Music was going on, everybody was having a good time. And then this young guy came by me with this gun. I heard him say, ‘Kill everyone.’ There were these pop-pop-popping (sounds) and I went on the ground. Vahnnie got shot in the head and Blaze fell on top of Vahnnie and played dead. This one boy emptied his clip and told the other boys, ‘Don’t leave no witnesses.’ ”\nPolice Chief Joseph Gaudett said that “at least two shooters, wearing hoodies’’ fired shots at the group of people standing in a parking lot, and then ran away. Gaudett said that he couldn’t confirm that the people who were shot had gathered for an outdoor party, and he wouldn’t say what type of guns were used.\nThe identities of the wounded — five men and three women — have not been released. Most of the victims, who ranged in age from 27 to 59, suffered non-life-threatening wounds. One woman was shot in the stomach, but was expected to survive.\nBruce Nelson said his 32-year-old son, Bruce Jr., was one of the victims.\n“He was shot in the hip,” the elder Nelson said. “He’s in the hospital, and they are going to have to put a rod in his leg.”\nNelson said his son dove under a car when the shooting began.\n“Literally dozens of detectives are following leads, interviewing witnesses and visiting area businesses to determine if security video exists that will bring us closer to finding these gunmen,” Gaudett said. “Investigators are working nonstop and won’t rest until we identify these gunmen and bring them to justice.”\nPolice are investigating a dispute in Norwalk that might be related to the shooting.\n“We have developed leads that we are pursuing, but we need the community’s assistance,” Gaudett said.\nKenneth T Jones, a Trumbull Gardens resident, said he grew up in the complex with McNeil. He said McNeil worked as a barber and for a kitchen cabinet installer, and had several children.\nJones and a man with him, who declined to give his name, said they believe young men from \"across town\" did the shooting.\nThere is a 2-foot gap in the chain-link fence at the back of the Trumbull Gardens. People who live there call it “the hole.”\nA resident named Gloria has been watching the hole from her living room window for nearly a decade. When she sees young men coming through it from Sunshine Circle, she said, she knows something bad is going to happen.\nJust after midnight Thursday she said she saw “A boy with a gun,” coming through the hole.\n“The hole is always going to be there,” said Karen Bracey, president of the project’s residents association. “It’s not like it used to be when the boys would come through the hole and sell drugs on Trumbull Avenue. Now this is a different group of children who come in here cause they feel they need to establish street cred.”\nKenny Jackson, a member of Streetsafe Bridgeport, a grassroots initiative that hires community members, responded to the shooting scene.\n“We are from these neighborhoods. We know the people,” he said. “We’ve walked the same path that a lot of these kids are on. We’ve been there so we can relate to them and they can relate to us.”\nWith nearly 400 units, Trumbull Gardens is one of the Bridgeport Housing Authority’s largest properties.\n“It is spread out,” said Housing Authority Executive Director George Lee Byers. “It has elderly in the high-rises there. It also has single-family and multi-family housing units. It’s pretty diverse.”\nByers said Trumbull Gardens does have security cameras.\n“We just don’t know if those cameras captured where this particular event took place,” he said.\nFinch asked for help from the community to prevent future shootings.\n“I realize that is no consolation to the victims today,’’ the mayor said, occasionally glancing down at his notes. “The vast majority of people here in Trumbull Gardens get up in the morning and go to work, and send their children to school. I urge parents to talk to their young men and tell them to put down the guns.’’\nStaff writers Brian Lockhart, Daniel Tepfer and Digital News Editor Jim Shay contributed to this story."}