{"uri": "http://www.oregonlive.com/portland/index.ssf/2014/12/shooting_reported_near_rosemar.html#incart_maj-story-1", "title": "Families identify 2 victims of shooting near Rosemary Anderson High School in North Portland (live updates)", "dct": "Sat, 13 Dec 2014 07:30:04 GMT", "id": "ce514564b635843c0531a1b3ff1fd127", "content": "Portland Police responded to a shooting Friday afternoon near Rosemary Anderson High School in North Portland. At least three people were taken to Legacy Emanuel Health Center.\nPolice are searching for suspects in the shooting.\nThe school is at 717 N. Killingsworth Court.\n5:06 p.m.: Gov. John Kitzhaber tweets: I am saddened by the shooting today in Portland. My heart goes out to those involved, their families, and their communities.\n3:52 p.m.: Sgt. Pete Simpson said at a 3:30 p.m. briefing that a dispute preceded Friday's shooting, but that it is not known whether it specifically involved the shooter and the victims. Simpson said that the shooters may have gang affiliations, but it's unknown whether that had anything to do with the dispute or the shooting, and it doesn't follow that the victims had anything to do with gangs. \"They are victims,\" Simpson said.\nPolice say they believe there was one shooter accompanied by two others. The suspects fled on foot, Simpson said, heading north on Borthwick and east on Killingsworth. They left the scene quickly and it's unknown whether they had a car nearby. All are at large.\nSimpson said he did not know how many shots were fired. The ATF and FBI have offered their assistance.\n3:41 p.m.: From the Portland Police news conference: Portland police Sgt. Pete Simpson says there are four victims:\nA 16-year-old female, who is in critical condition.\nA 17-year-old male, who is in serious condition.\nA 20-year-old male, who is in serious condition.\nA 19-year-old female, who was grazed by a bullet and treated at the shooting scene.\n3:37 p.m.: Another victim was identified as Taylor Zimmers, a 16-year-old junior at Rosemary Anderson High School. Ryan Zimmers, Taylor's father, said his daughter was in surgery.\nTaylor's aunt, Shawn Zimmers, 40, said she heard about the shooting in a phone call from the girl's father and went to Legacy Emanuel Health Center.\n\"I'm just confused. All of these kids getting shot and killed. It doesn't make any sense,\" Shawn Zimmers said. \"It's not like it was when we were kids.\"\nAshley Zimmers, 17, and Octavia Heaton, 15, two of Taylor's cousins, also waited outside the hospital. The girls, who do not attend Rosemary Anderson, said they were not allowed to enter the hospital to see their cousin.\nThe girls said they had heard that Taylor had been shot in the chest and the side.\n\"This is crazy, but not surprising\" given the recent string of shootings nationally, Ashley Zimmers said. \"This hits too close to home.\"\n3:20 p.m.: All of Portland Public School Connect boys basketball games tonight will have extra security, a spokesman said. It's \"just a precaution.\" Rosemary Anderson is a nonprofit school that PPS Connect contracts with. Of the 290 Rosemary system students, 216 come from PPS Connect. Students in the program can earn a GED or modified diploma. \"These are students who have not found success in our traditional high schools,\" says PPS Connect spokesman Jon Isaacs.\n3 p.m.: Students from Rosemary Anderson High School form a large prayer circle at Legacy Emanuel.\nOliviann Danley, 16, said she saw a boy run into the school, holding coat open and yell: 'Oh my God, did I just get shot?'\n2:51 p.m.: Tanisha Franklin identified one of the shooting victims as Labraye Franklin. She said the 17-year-old is her nephew and a student at Rosemary Anderson High School.\nTanisha Franklin and Karin Williams, another of Labraye's aunts, both identified the teenager as being among the shooting victims. Both had been waiting outside Legacy Emmanuel Medical Center on Friday afternoon for word on his condition.\nAmid all the confusion, both had heard that Labraye suffered wounds in different parts of his body.\n\"When I first got the phone call,\" Tanisha Franklin said, \"I just started praying, 'Please let him be all right.'\"\n\"This is just crazy,\" she said. \"I work at a school and with all these shootings, I get more and more scared every day.\"\n2:26 p.m.: Jacal Hill, a 17-year-old senior, said she was among a mass of students lined up waiting for the school doors to unlock for lunch. Once outside, she had just turned the street corner when she said she heard shots behind her. Scared, she hid behind a car. Now safe, she said, her thoughts are of her friends. \"I just gotta say: Stop the violence.\"\nAt Legacy Emanuel, a spokeswoman said the three victims are being treated, but had no condition updates.\n2:19 p.m.: Parents are waiting as students trickle out of Rosemary Anderson. One boy is telling his dad that he heard a \"pow ... pow... pow... pow.\"\n2:11 p.m.: The shooting near Rosemary Anderson High School is the latest in Portland that police believe have ties to gangs.\n2:10 p.m.: Ralena Gaska, 14, would have attended Reynolds High School this year, but her mom opted against it after the school shooting there in June. Ralena said she was in the cafeteria when she realized something was wrong. At first she thought it was a fight, but teachers quickly ushered students into classrooms. \"Everyone was scared, she said.\nDeNida Gaska, Ralena's mother, said it is troubling that shootings occur in and around schools. \"What happened last year at the end of the school year, I said, 'No.' ... And it happened again.\"\n2:09 p.m.: Derrick Foxworth, former Portland police chief and head of security at Portland Community College, said the school was locked down from 12:24 to 1:29 p.m. and classes continued. The lockdown was done as a precaution and, he said, \"we're back to normal operation.\"\n2:06 p.m.: Sierra Smith, 17, said she was in a government history class when the shooting occurred. Later, Smith said she saw one of the victims inside the school being helped by a teacher.\n\"There was young boy,\" Smith said. \"He was laying on the ground. He had blood coming out of his stomach.\"\n\"It was scary,\" she said\n2:03 p.m.: A woman who says she's the aunt of one of the shooting victims says her 17-year-old nephew was shot in the back and his girlfriend was shot in the ankle, reported Everton Bailey Jr. \"I'm frustrated. I'm sad. The world today is just out of control,\" said Karin Williams. She said she and other family members have not been allowed into Legacy Emanuel.\nThe Portland Community College lockdown alarm has stopped and students are walking around the campus again.\n1:54 p.m.: Tracy Mendoza in a nearby business said, \"We heard the gunshots. We dove under the desks.\" She said she heard five gunshots. She went on to say this of the kids who were shot outside Rosemary Anderson High School, \"They were just standing on the corner at lunchtime.\"\n1:36 p.m.: Lunch at Rosemary Anderson starts at 12:10 p.m., students said. The first police calls came in at 12:14 p.m. Students who were outside on a warm, sunny day ran into the school. Police Chief Mike Reese is on his way to Legacy Emanuel Medical Center.\nPolice are investigating the shooting as gang-related.\n1:32: p.m.: Portland Police Sgt. Pete Simpson said \"Obviously we're thankful we don't have any loss of life.\" The three shooting victims ran into school conscious, breathing. Also, Portland Fire Lt. Rich Tyler said firefighters from the nearby Station 24 were able to provide medical care to the victims inside the school.\nAt North Kerby and Killingsworth Court, parents are being reunited with their students.\n1:18 p.m.: Gresham police said they received a call after the North Portland school shooting of a threat of a shooting at Rosemary Anderson High School East in Gresham, but so far, have not found the threat credible. An investigation is still ongoing.\n1:15 p.m.: In July, Maxine Bernstein wrote about a street mural students were painting to promote nonviolence. It is at the corner of Borthwick and Killingsworth Court, the scene of the shooting.\nHere is some background on Rosemary Anderson High School, a community-based alternative school, has two campuses that serve at-risk students who've been unsuccessful in traditional high schools. The campus on North Killingsworth Court enrolls up to 190 students each year and has been in operation for nearly 31 years.\nThe school serves multiple districts, and typically students attending it have had disciplinary and educational problems at more than one traditional high school, Portland Public Schools spokesperson Jon Isaacs said. The school is not seen overseen by Portland Public Schools.\nIn 2009, Anna Griffin, then a columnist for The Oregonian, wrote about Rosemary Anderson High School and the challenges its students face.\n1:11 p.m.: Lockdown lifted at Jefferson High School and Portland Community College. Portland police says the shooting victims are teenagers, working to confirm that they are students.\nAt this time, police don't know how the shooter left the scene. Officers have cleared the school and the area is now safe and secure.\nHere's what is being said on Twitter: Tweets from https://twitter.com/Oregonian/lists/npdxshooting-12-12-14\n1:05 p.m.: The FBI has put agents at the scene of the shooting as part of its regular task force work, as needed by Portland police, spokeswoman Beth Anne Steele said. The federal agency referred all news information to the police bureau.\n1:03 p.m.: Portland police Sgt. Pete Simpson says investigators believe the shooter is affiliated with a Portland gang.\n12:58 p.m.: Portland police Sgt. Pete Simpson confirmed that the shooting was outside the school at North Borthwick Avenue and Killingsworth Court. He also said:\nThe victims were two males and one female. They all ran inside the school outside Rosemary Anderson High School immediately after the shooting.\nThere is currently not an active shooter at the scene.\nPolice swept through the school to make sure there were no additional victims.\nThe shooter left the scene.\n12:52 p.m.: Tamara King, who lives near the school with her husband and 4-year-old child, was standing on the corner of North Killingsworth Court when she heard five shots in rapid progression. After hearing the shots, she saw at least four children scatter, diving under a car on North Albina Avenue to avoid gunfire. She called 911 at 12:13 p.m., she said. A short time later she saw two kids being loaded into the back of an ambulance.\n12:51 p.m.:\nI'm on scene of the shooting in North Portland. Neighbor Tamara King heard 5 shots in rapid succession. Called 912 pic.twitter.com/LR5V1evWxP\n— Andrew Theen (@andrewtheen) December 12, 2014\n12:49 p.m.:\nPolice found bullet casings outside the school ..near N Killingsworth Court and Forthwick/possibly 3 suspects pic.twitter.com/fyKHo1zdbg\n— Maxine Bernstein (@maxoregonian) December 12, 2014\n12:44 p.m.: Portland police say parents of Rosemary Anderson High School students should respond to North Killingsworth Court and Kerby Avenue.\n12:36 p.m.: Rosemary Anderson High School serves at-risk students who have been expelled or dropped out of public high school. Rosemary Anderson is an alternative high school with a student body of approximately 130 students, most of whom have struggled to succeed at other Portland high schools. The school is renown for its commitment to attend to these students until they reach the age of 25. \"We pretty much force the kids to go to college,\" said Joe McFerrin, the school's president.\n12:30 p.m.: Both Portland Community College's Cascade campus and Jefferson High School are on lockdown.\n-- The Oregonian"}