{"uri": "http://www.mlive.com/news/kalamazoo/index.ssf/2016/09/one_teen_was_shot_accidentally.html#incart_river_index", "title": "One teen was shot accidentally; other teen turned gun on himself, police say", "dct": "Wed, 07 Sep 2016 09:47:29 GMT", "id": "5a39f901579f0f86127fe49aba625e1e", "content": "KALAMAZOO, MI -- One of the two 17-years-olds found dead of gunshot wounds Monday night appears to have shot the other by accident then turned the gun on himself, police say.\n\"The investigation, as well as an eyewitness account, confirmed that one person was shot by accident as a gun was being 'played with' and the other person died from a self-inflected gunshot,\" Kalamazoo Public Safety officers stated in a press release issued Tuesday afternoon by Capt. Victor Ledbetter, head of KDPS' Criminal Investigations Division.\nHe stated, \"The witness confirmed that both people knew each other and there was no argument or altercation prior to the weapon being discharged. Once the first person was shot and died at the scene, the shooter became 'distraught' according to the witness, and then took his own life. The evidence found at the scene confirms this.\"\n\"There was no altercation or dispute. This is just a very tragic incident,\" said Capt. Victor Ledbetter of the Kalamazoo Department of Public Safety.\nDead are Daquarion Hunter, 17, who graduated from Loy Norrix High School this past June, and Marsavious Frazier, 17, who was a student at Phoenix High School, an alternative high school in Kalamazoo.\nPolice did not initially say which teen had the gun.\nBoth teens were found dead on the ground in an alley in the 1500 Block of Clinton Avenue in Kalamazoo's Edison Neighborhood at about 9 p.m. Monday, Sept 5.\nContinuing to respond to social media traffic in which some people stated that police were involved in the shooting, Public Safety emphasized that officers were in no way involved in either shooting.\n\"This is a very unfortunate incident and we remind people to be mindful and serious about the proper and legal handling of firearms,\" the department stated in the press release. \"The firearm in this incident was not stolen, but it was also not properly registered.\"\nThey stated that their investigation continues and more details will be released later.\nOfficers continue to ask anyone who may have information regarding the incident to contact them directly at 269-337-8994 or anonymously via the Silent Observer at 343-2100 or www.kalamazoosilentobserver.com."}