{"uri": "http://www.fresnobee.com/news/local/education/article121130428.html", "title": "After three Clovis West student suicides, parents demand more action", "dct": "Thu, 15 Dec 2016 13:05:00 GMT", "id": "63fbc2bf4631e284f9f42cf209f5b8df", "content": "When Kristine Bernardoni went grocery shopping one day last month, she had no qualms about leaving her son, Trevor, a 16-year-old junior at Clovis West High School, at home.\nHe was a good kid – a football player with strong grades, she said. He attended counseling for an impulse-control problem, but he was not depressed.\nBut when she returned from the store that evening on Nov. 30, she found her 6-foot-4, 210-pound son had shot himself and was dying on the floor. Kristine Bernardoni, an emergency room nurse, sprang into action, but Trevor did not survive.\nTrevor Bernardoni was the second of three Clovis West students who have taken their own lives over the past three months, and his mother said Thursday that she believes the Clovis Unified School District is failing to protect students from a dangerous menace. Other parents have joined her.\nBernardoni was outraged when she learned a third student had killed himself Thursday morning.\n“I need help fighting this,” she said. “I don’t want another kid to die.”\nClovis Unified maintains that it has deployed ample resources to educate students and parents. Students, teachers and staff members are encouraged to ask for help and report warning signs.\nThe suicides may be part of a larger issue, as local government and health officials are working to curb an unusually large number of child suicides across Fresno County.\n‘He never got a driver’s license’\nBernardoni said no one from Clovis West or the district notified her of the student who died by suicide in August. Trevor told her. After her son’s death, she was shocked to find out that other parents did not know how he died, either.\n“Some parents are ashamed,” Bernardoni said. “I’ve told the school and district to talk about it with everyone. Call it suicide. That’s what he did. My son killed himself.”\nBernardoni said she believes a specific incident with another student led her son to shoot himself.\n“He told a friend who dropped him off that day, ‘See you tomorrow,’ ” she said. “My son had a tomorrow.”\nNow, he’s gone.\n“He never got a driver’s license,” Bernardoni said. “He’s not going to graduate. Why don’t parents know about this?”\nBernardoni said she will speak to anyone who will listen about her son’s suicide in the hopes of preventing further deaths. She is using the social media hashtags #HugLikeTrevor and #TellSomeone to help spread awareness.\nAnother parent speaks out\nAbout three months ago, Petra Groger had to comfort her daughter after a close friend and classmate at Clovis West High School died by suicide. Groger spoke to her frequently and got her into outside counseling because “the school is not doing anything.”\nTwo weeks ago, Groger had those tough conversations again when her daughter said Trevor Bernardoni had killed himself.\nWhen she learned of a third student’s suicide Thursday morning, Groger had had enough. She went to pick up her daughter in the middle of the school day.\n“The district is not doing enough,” she said. “Clovis is so concerned with the dress code, tardies and absences – but this is what’s important.”\nThe Fresno County coroner’s office confirmed the deaths occurred on Aug. 31, Nov. 30 and Thursday. All three were ruled suicides.\nThe Fresno Police Department confirmed that the third suicide victim was found dead around 6:30 a.m. Thursday at a home near the high school.\nThe Bee does not generally publish the names of suicide victims.\nGroger said she recently spoke with Clovis West Principal Marc Hammack and asked for mandatory suicide-prevention courses for all students.\n“I was brushed off,” she said. “He told me they try to do the best they can.”\nGroger said her family and others are “trying to cope” with the recent tragedies. Her daughter told her that in addition to the three suicides at Clovis West, two other children who live within the district but are home-schooled have killed themselves this year.\nShe believes it may be a “copycat” trend.\n“Young people see the attention and grieving, and they might think this could be my way out of problems with my girlfriend, my school or at home,” Groger said.\nGroger said she does not want all of the blame placed on the district. It’s important that friends and family talk openly about suicide, bullying and mental health issues, she said.\nThe district responds\nOn Thursday, Clovis Unified School District Superintendent Janet Young released this statement: “This is a heartbreaking loss for Clovis West High School, its community and our school district. We will continue to allocate every resource available to support our kids and our families. Taking care of the entire well-being of our kids is a team effort. We are also asking for our community to be a partner in watching out for our kids. When a family member or friend is experiencing emotional struggles, please reach out to that child’s school and we will act immediately to offer hope, support, and encouragement to help our kids know they are cared for and cared about.”\nDistrict spokeswoman Kelly Avants said more than 12 school psychologists were at Clovis West on Thursday morning to speak to students. A therapy dog was there, too.\nCounselors and psychologists were scheduled to meet with each English class Thursday to discuss how to get help and the importance of telling someone if they notice any possible warning signs in others, Avants said. These visits were scheduled prior to Thursday’s suicide and are the second such talk this year.\nThe district is also developing an anonymous tip line.\nAvants said a number of resources are available at each school site: psychologists, nurses, and both adult-led and peer counseling services. These counselors are trained to help students through a number of social and emotional issues, including the loss of a parent, divorce, eating disorders and suicide prevention.\nTeachers also receive information about resources available to students and how to access them, she said. Parents receive these materials through meetings, community messages and conversations with staff members.\nAvants said each ninth-grade student in the district receives information on suicide prevention and awareness in their health courses.\nClovis West students took to social media Thursday to share remembrances, frustrations with the district and reactions to the most recent suicide. Among them was Caleb Kelly, a former Clovis West football star who graduated in June and attends the University of Oklahoma.\nMy city, my school, my people are hurting and I pray to God to give us all strength\n&mdash; KANAI™ (@calebkkelly) December 15, 2016\nBroader problem\nAccording to officials, an alarming trend has emerged in Fresno County.\nFor the three-year period spanning 2013 to 2015, Fresno County had 10 teen suicides. But there have been 11 this year alone, said Dawan Utecht, director of Fresno County’s behavioral health department.\nStudents frequently face academic, peer and parental pressures that cause them to drink or use drugs, she said, which is a problem for high school students if they must admit drug use in a school setting where there are zero-tolerance alcohol and drug policies, Utecht said.\nThat means getting help through their normal support networks isn’t always possible, she said.\n“I think when kids are struggling emotionally or feel stigmatized or discriminated for all kinds of things, they are self-treating and can turn to drugs,” Utecht said.\nShe said the county health department is arranging training sessions with Clovis Unified and other districts to ensure school staffs are properly trained to recognize potential signs of suicide. A program called “Know the Signs” is being used across California.\n“I know Clovis Unified is very concerned and is working hard to find resources for kids, and I know they are educating their staffs,” Utecht said. “We have a lot of resources available …”\nBecause suicide-prevention hotlines don’t always get the attention of students, there are efforts to develop phone apps to offer students tools to find suicide prevention programs.\n“We set a lot of high expectations for kids – getting high grades, athletic success, getting to college … ” she said. “We are looking at the best ways to reach kids.”\nThe number of teen calls to the Central Valley Suicide Prevention Hotline fell from 193 in 2015 to 152 to date in 2016, Utecht said. The 24-hour hotline number is 888-506-5991.\nFresno Unified School District, with eight high schools to Clovis Unified’s five, has had one student suicide so far in 2016, a Fresno Unified spokesman said.\nFresno County Sheriff’s Office spokesman Tony Botti said his office met with the Fresno Council on Child Abuse Prevention on Thursday morning for their bimonthly Fresno County Pediatric Death Review Committee meeting.\n“The unusually high number of teenage suicides was a topic of conversation and it is being treated as a top priority,” Botti said. “The sheriff-coroner’s office, FCCAP and community partners are working to develop a public service announcement that will educate families about recognizing warning signs, which will hopefully lead to preventing teenage suicides.”\nBotti said the coroner’s office handled four child suicides in 2015.\nStaff writer Marc Benjamin contributed to the story.\nRory Appleton: 559-441-6015, @RoryDoesPhonics\nTo get help\nCentral Valley Suicide Prevention Hotline\n888-506-5991"}