{"uri": "http://articles.chicagotribune.com/2013-08-20/news/chi-cops-5-shot-in-uptown-20130819_1_bang-shooting-uptown-baptist-church", "title": "5 shot in Uptown: 'A constant bang, bang, bang'", "dct": "Tue, 20 Aug 2013 00:00:00 GMT", "id": "5c25c2cb933466a1af169d48c06c90ee", "content": "\"It was a constant bang, bang, bang,\" said Joseph Rogers, a security guard at the nearby Uptown Shop & Save at Wilson and Sheridan Road.\nHe rushed outside to see the white car fleeing west on Wilson and one wounded man on the church steps and three others on the street. \"There was blood everywhere,\" Rogers said.\nPolice say five men between the ages of 21 and 58 were shot. The youngest victim was shot in the head and was in critical condition at Advocate Illinois Masonic Medical Center, authorities said. Police initially said the man had died.\nThree other victims were brought to Weiss Memorial Hospital: a 44-year-old man shot in the knee, a 58-year-old man shot in the hand and a 32-year-old man shot in the ankle. All were in good condition, police said. A 26-year-old man was shot in both arms and was reported stable at Illinois Masonic.\nPolice say the shooting was sparked by a conflict between two gangs in that section of Uptown, and patrols have been watching for any retaliation. The shooting occurred along a Safe Passage route mapped by Chicago Public Schools for the coming year. The getaway car was also found along the route, at McCutcheon Elementary School, 4865 N. Sheridan Rd.\nThe route has been laid out for children who are transfering to Brenneman Elementary this year from Stewart Elementary, one of dozens of schools closed by CPS.\nA hearing officer, retired Cook County Judge Charles Winkler, had opposed the closing of Stewart, saying school officials and police could not guarantee the safety of school children who will now have to walk farther to school.\n“Is there really enough time to get everyone up to speed so the 14,400 children from the closing schools are provided safe passage,” Winkler wrote. \"Will an understaffed Chicago Police Department be able to provide enough officers to assist the Stewart children? Will CPS hire a private security company to furnish properly trained personnel?\"\nMayor Rahm Emanuel acknowledged today that the shooting was \"an early warning sign to all of us to be more on our toes than we were already on our toes.\"\nMonday's shooting occurred shortly before 6 p.m. as the church was holding a prayer service where meals are offered to the homeless. Monday was taco night.\nEric Ray said he heard the shooting from the front pews. He said he frequents the neighborhood but avoids lingering at Wilson and Sheridan.\n\"I normally don't hang out on that corner,\" he said. \"It's a bad corner.\"\nMike Gillhouse, 25, said he moved to Uptown from Wheaton last year and didn't know that shootings erupt in the neighborhood from time to time. Now, he wants to move further south into Lincoln Park or any other neighborhood that is safer.\n\"I guess I was naive. I figured after college ... I'd move to the city and try to find a job out here,\" he said just outside the red police tape cordoning off the intersection of Wilson and Sheridan. \"Just, you know, move away from the suburban bubble so to speak. And I kind of regret that decision now.\"\nHe said he was getting off the CTA Red Line train at Argyle Avenue a few blocks away when he saw the \"blue lights\" at Wilson and Sheridan. Gillhouse said there's been warning signs about the neighborhood ever since he moved there last September.\n\"Just disreputable-looking folk roaming around, you know, (the train) station. Stuff like that,\" he said.\nHe said he commutes to the suburbs for work but still wanted to see what city living was all about. \"I grew up in the suburbs,\" he said. \"(I) thought maybe I'd see what life in the big city was like.\"\nTribune reporter Adam Sege contributed."}