{"uri": "http://chicago.cbslocal.com/2013/08/19/breaking-5-shot-one-fatally-in-uptown/", "title": "5 Wounded In Uptown Shooting", "dct": "Mon, 19 Aug 2013 18:27:00 GMT", "id": "983381e543d4c465933674b30d2bed40", "content": "Updated 08/20/13 – 4:56 p.m.\n(CBS) — Five people were wounded in a hail of bullets from an automatic weapon in Chicago’s Uptown neighborhood Monday evening.\nPolice and several ambulances converged at Wilson Avenue and Sheridan Road Monday evening, following the shooting, which occurred shortly before 6 p.m. near a bus stop in front of the Uptown Baptist Church.\nAccording to 46th Ward Alderman James Cappelman, police have three persons of interest in custody and have recovered video footage from a nearby police camera and cameras from nearby businesses. However, Police News Affairs Officer Daniel O’Brien denied that anyone was in custody, adding there is “misinformation out there.”\nChicago Police Supt. Garry McCarthy earlier said investigators believe, from shell casings found at the scene, that an assault weapon was used in the attack.\n“It’s ironic how things kind of come together. You’ve heard me talk about assault weapons. It looks like there was an assault weapon used in that shooting last night,” said McCarthy.\n“These are not things that belong in an urban setting. There’s no reason for them in a free society. That’s a military-grade weapon that was created to kill people during combat.\nThat corner is located along the “Safe Passage” route for students attending Joseph Brennemann Elementary School, which is receiving students who attended Graeme Stewart Elementary School, which was one of 49 elementary schools shut down by the Chicago Public Schools this summer. Stewart Elementary is around the corner from the shooting, on Kenmore Avenue, just south of Wilson.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nPolice sources said three of the victims are gang members. Two were innocent bystanders. Police sources said three different gangs in the area have been fighting for territory.\nUptown Baptist Church Pastor Michael Allen said he heard the shooting was the result of one gang placing a hit on a rival gang member.\n“He happened to be standing where a group of others were standing, and so folks were caught in the melee,” Allen said. “That’s just tragic.”\nAll the victims of the shooting were men, their ages ranging from 21 to 58. The youngest victim was shot in the head.\nThe victims’ conditions ranged from extremely critical to critical to good, the Chicago Fire Department said in a Twitter posting. Police initially said one person died in the shooting, but later said that victim was in extremely critical condition at Advocate Illinois Masonic Medical Center.\nWitnesses said a white 4-door car pulled up in front of the church, and someone inside opened fire.\n“I heard what I thought was fireworks,” said Joe Rogers, who was working security at the Uptown Shop and Save at the corner of Wilson and Sheridan when he heard the gun shots.\nAllen said the church was hosting a prayer service at the time, and giving out meals to more than 100 homeless people.\n“We heard the barrage of shots outside. There must have been at least 15 to 20 shots fired, and then after that, I went out to find out what was going on, and just saw carnage at the base of the church steps,” he said.\nAllen said pools of blood and the wounded victims lay just outside the church doors after the shooting.\n“I do believe at least two or three of the victims had either just come into the sanctuary, or to our meal, or were just leaving the Monday night meal,” Allen said.\nRogers said there was blood everywhere. He saw a white car speeding away from the scene.\n“I see three people down on the ground; one on his back, one on his side, and one is face down,” said Rogers.\nWith his church sitting along the border between two or three gangs, Allen said he’s committed to the community.\n“This kind of stuff doesn’t scare us off. We’re just going to redouble our efforts to love on the community, and show the love of God to people,” he said.\nNo one was in custody for the shooting as of Tuesday morning. Police were reviewing video from a blue light surveillance camera near the scene.\nIt was the second time in little more than a week that there was a shooting along a designated “Safe Passage” route for a public school. However, neither shooting happened during school hours, when the program’s volunteers, paid “Safe Passage” workers, police officers, and other city employees will be manning the routes to keep kids safe going to and from school.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nMayor Rahm Emanuel said, starting Monday, there 600 newly trained Safe Passage workers, and hundreds more volunteers keeping watch over the routes, including at Sheridan and Wilson.\n“It is our obligation, not just because we work for the taxpayers – although we have a primary – it’s the obligation of every adult to make sure a child is protected. Whether you’re employed, or a city employee, or not,” he said.\nChicago Public Schools CEO Barbara Byrd-Bennett noted there’s much more to the Safe Passage routes than simply placing yellow signs designating certain streets as part of the program.\n“Safe Passage is not just the geographic passage where children walk, it’s a comprehensive strategy … involving multiple resources of the sister agencies,” she said.\nIn addition to having police officers and firefighters helping keep an eye on the Safe Passage routes, the city’s Buildings Department has secured or demolished 300 abandoned buildings on or near the routes; animal control workers will be on the lookout for dangerous dogs along the paths; Streets and Sanitation Department employees have been cleaning up vacant lots; and Park District workers will provide security at public parks along the routes.\nAltogether, representatives from 16 city agencies will play a role in the program once classes begin on Aug. 26.\nThe other shooting on a Safe Passage route happened in Bronzeville on Aug. 11, when one man was killed and another was wounded in the 2900 block of South State Street."}