{"uri": "http://pix11.com/2013/08/06/4-people-shot-in-montclair-new-jersey/", "title": "4 people shot in Montclair, New Jersey; masked suspect on the loose", "dct": "Tue, 06 Aug 2013 04:35:00 GMT", "id": "0539ebc181fffc6733a90abbffe13e50", "content": "Montclair, N.J. (PIX11) -Police are searching for a masked man who gunned down four friends who were just walking down the street.\nThree of them are men in their 20’s who were shot in the leg, arm or backside but police say they are all in stable condition.\nThe fourth friend is an 18-year-old Montclair girl who was shot in the chest and she is now breathing on a ventilator.\n“I heard five shots or six from a large weapon,” Bernard Rawls, a resident and local pastor in the Montclair block of Mission Street and Elmwood Avenue, said.\nAs soon as he heard the shots, Rawls ran outside to help.\n“There were two young men on the porch” he said, “A woman was crying. She was the mother. I tended to the men then seeing he would be okay I consoled her.”\nPIX 11 News was first on the scene just after 1 a.m. this morning. Police say the gunman fired five to ten shots at the group of friends then ran away.\nThey do not have a good description on the suspect because they say he was covered up, wearing some sort of mask.\nMontclair Police Deputy Chief said, “It is not a random act like someone came up and just started shooting up the street. That’s not the case.”\nResidents, like Jamela, who know the victims well, find that hard to believe. She did not want to be identified.\n“They are good kids. Loved music and sports and just tried to live their lives,” Jamela said.\nPastor Rawls agrees to a point but says neighborhood kids have been troubled for awhile.\n“Look around, we have five churches on every corner. How did we failing our children?” he said.\nThe pastor says he worries about retaliation now.\nPolice say they are not strangers to the neighborhood. In fact, they responded to another shooting on the exact same block back in May."}