{"uri": "http://www.gwinnettdailypost.com/local/cities/lawrenceville/shooting-of-lawrenceville-boy-an-accident-police-say/article_2cf97dbc-dafc-5d3e-850e-a773a0ec2f1b.html", "title": "Shooting of Lawrenceville boy, 6, an accident, police say", "dct": "Thu, 07 Apr 2016 00:00:00 GMT", "id": "5b62b2408aadf0e260a12b0dbfb56671", "content": "Some — not all — answers are finally in on how a 6-year-old Lawrenceville boy ended up shot in the chest last month.\nIt was an accident that sent the .22-caliber jabbing a crimson void into Ni-Shawn Moore as he rode his bike near his Cannonball Court home off U.S. Highway 29, the Gwinnett County Police Department revealed Thursday.\n“After an extensive investigation, the lead detective has determined that the shooting was accidental and occurred between the victim and his friend,” agency spokeswoman Cpl. Michele Pihera said. “He hasn’t yet determined if criminal charges will be filed due to the ages of the parties involved.”\nThe friend is under the age of 10, Pihera said, not giving the exact age.\nDetails on exactly how or why the shooting, which wasn’t fatal, happened in the street that day remain unknown. So does the glaring question: How did the children get a gun?\nPihera said she didn’t know whose it was.\nThe case suddenly seems familiar, similar to that of Alan Martinez, an 11-year-old Summerour Middle student who died while reportedly playing with a gun along with a friend in his garage in Norcross. Martinez died the day before Ni-Shawn got shot.\nThe latest news on Ni-Shawn’s case comes after weeks of mystery surrounding the incident, which sent him to an Atlanta hospital in critical condition before he was released days later. Police said they believed there were several potential witnesses who weren’t talking.\nBut Pihera said police in recent days revisited the neighborhood to talk to residents and conducted additional interviews.\nIn the aftermath, there was tension in the neighborhood, which police have described as home to many Bloods gang members.\nA woman on Caboose Court dialed 911 to report that a group of men came and interrupted a kids’ party and Easter egg hunt. “They said somebody shot their kid or something like that,” she said, adding that one of the men had a gun and was threatening to retaliate."}