{"uri": "http://www.theleafchronicle.com/story/news/local/clarksville/2014/08/15/man-shot-dead-police-increase-patrols/14119253/", "title": "2 dead, 6 injured in 4 shootings in 5 days", "dct": "Fri, 15 Aug 2014 00:00:00 GMT", "id": "ce2e21786a0251c8ae3cdf834c77e66d", "content": "CLARKSVILLE, Tenn. – Two men were shot dead and six people were injured in four separate shootings in only five days, leading Clarksville police to ramp up patrols this weekend and ask some businesses to close early.\nAs of Friday evening, no arrests had been made in any of the cases.\nThe latest shooting came Thursday night. Shortly after 9 p.m. Clarksville police were called to the 100 block of Chapel Street, where they found 24-year-old Fran Daniel Caratini of Clarksville on the ground behind one of the apartments.\nCaratini, called \"Frankie\" by his friends, died at the scene. He did not live in the apartment complex and it was unclear why he was there.\nOn Wednesday, six people were injured in two separate shootings just four hours apart. Clarksville Police Department spokeswoman Natalie Hall said police had no definitive evidence Friday that any of the shootings were related.\nVictim linked to slain man\nLast Sunday, another Clarksville man — the uncle of Caratini's young son — was also found shot to death.\nAndre Mitchell, 27, of Clarksville was found dead in the backseat of a vehicle behind a Waffle House on Fort Campbell Boulevard in Clarksville on Aug. 10, according to a CPD press release. At about the same time, Oak Grove Police responded to a call of shots fired at Club Gravity and found shell casings in the area. That case remains unsolved.\nClarksville bail bondsman Jamie Kojac Thomas said Caratini came to see him just two hours before his death Thursday because he had failed to appear in court on a DUI charge on Tuesday. Thomas could have locked him up because a bench warrant had been issued, but Caratini told him that he had arranged through his attorney to appear in court Friday.\nCaratini had his young son with him and told Thomas that the boy's uncle had been murdered last week.\n\"He said his baby's mama's brother was the one found dead (Sunday),\" Thomas said. \"That kind of floored me.\"\nCaratini asked Thomas not to lock him up Thursday night and promised he would appear in court Friday. Thomas said Caratini was a repeat client, and he had posted bond for him over the years on charges ranging from aggravated assault to speeding. Most of the charges were alcohol related, he said. Caratini was scheduled for a violation of probation hearing Sept. 8.\nHe said he had become friendly with Caratini over the years and was upset when he got the call about his death. Caratini had two children, he said.\nClarksville Police have not said there is a gang connection.\nExtra patrols\nPolice Chief Al Ansley said there will be extra patrols this weekend \"in specific areas of interest\" to prevent further violence.\n\"We are on top of it,\" he said Friday afternoon. \"We have extra people on the street. We know what's going on ... We are being proactive to all the violence.\"\nHe said a number of businesses agreed to help police by closing early this weekend. He did not name the businesses, but said he appreciates their cooperation.\nAll of the shootings remain under investigation.\nDetectives went door to door at the apartments on Chapel Street on Friday, talking to people who live in the apartment complex.\n'Too much drama'\nA number of small groups gathered on porches outside to talk to one another Friday, but while several said they knew Caritini, or \"Frankie\" as they called him, no one saw what happened.\nA man who asked not to be identified said his girlfriend heard a gunshot Thursday night and he went outside to find Caritini laying on the ground at the corner of an apartment building. His young step-daughter saw the man too, but by then a number of other people had come outside to see what was happening, he said.\n\"I heard the commotion going on and when I came out, he was just laying there,\" the man said.\nHe said he did not know who shot Caritini, a man he knew only in passing.\nKaren Judge said she arrived home after police arrived Thursday night and was worried only about the safety of her two granddaughters who are spending the summer with her.\n\"I stay to myself because there's too much drama,\" she said. \"I don't bother nobody and nobody bothers me.\"\nSix shot on Wednesday\nPolice were busy Wednesday with two separate shootings that injured six people.\nTwo men were injured after gunfire was apparently exchanged between two vehicles on Caldwell Lane and Edmondson Ferry Road. A light-colored sedan and black sedan were seen driving on Edmondson Ferry Road as a woman heard continuous gunfire at about 4:44 p.m., according to a police report.\nA few minutes later, three men were found in a light-colored Toyota Camry sedan stopped at the intersection of Emory and Stafford streets shortly before 5 p.m., and two of them had been shot.\nFront seat passenger Christopher Fletcher, 28, was shot in his left shoulder. Backseat passenger Christopher Harris' head was grazed by a bullet. Both were taken to Gateway Medical Center for treatment.\nThe driver, Shawnquavi Kelly, 22, was not injured.\nPolice found a handgun inside the car, along with a small amount of marijuana, according to police reports.\nAbout four hours later, four people were shot on Treeland Drive after the driver of a white Ford pickup opened fire on a Cadillac parked in front of a home at about 8:55 p.m.. The Ford F-150 and a white car that was driving behind it both took off at a high rate of speed toward Trenton Road.\nTaylor Barger, 20, of Clarksville was shot in her leg and hip. She was found laying on the ground about 10 feet from the home. Donavon Smith, 27, was shot in his upper left leg. A 16-year-old was shot in one finger while looking out his bedroom window. Lacy McIntire, 21, was shot in her left calf, according to police reports. All were taken to Gateway Medical Center for treatment.\nAccording to a police report, the Cadillac Fleetwood sustained the majority of damage from the gunfire. Bullet holes were also found throughout the home.\nPolice found 24 shell casings on Trenton Road. The police report lists the type of weapon used as a rifle.\nPolice seek help\nThe Clarksville Police is asking anyone with any information on Caratini's case or Mitchell's case to contact Detective Chris Nolder at 648-0656, ext. 5341.\nAnyone with information about the Caldwell Lane shooting is asked to call Detective Nick Newman 648-0656, ext. 5340, or Detective David Bramel at ext. 5161.\nAnyone with information about the shooting on Treeland Drive can call Detective Dennis Honholt at ext. 5260 or Detective Kagan Dindar at ext. 5434.\nTo remain anonymous, call the Crime Stoppers TIPS Hotline at 931-645-TIPS (8477).\nStephanie Ingersoll, 245-0267\nCity government and crime\nsingersoll@theleafchronicle.com\nTwitter: @StephLeaf"}