{"uri": "http://abc13.com/news/two-dead-6-injured-after-terrifying-shootout-in-w-houston/1361533/", "title": "Two dead, 6 injured after terrifying mass shooting in west Houston", "dct": "Sun, 29 May 2016 00:00:00 GMT", "id": "24c48e1b7d1ffab6b3e48b00a65ff403", "content": "HOUSTON (KTRK) --\nA man came into a west Houston auto detail shop and began shooting, killing a man known to be a customer and putting a neighborhood on lockdown Sunday before being killed by a SWAT officer, police said.\nIt started at the shop in the 13200 block of Memorial Drive at around 10:15am. When an officer responded, the suspect shot at the squad car. A photo posted on Facebook by Houston police after the shooting showed 21 bullet holes. Somehow, the officer wasn't hurt.\n\"By the grace of God, he didn't sustain any injuries,\" said HPD interim chief Martha Montalvo.\nSEE ALSO: Woman shot at during rampage speaks out\nMore units and a SWAT team were called in and a perimeter was set up around the scene.\nAt a little after 11am, the suspect was shot and killed by a SWAT team member. We're told that SWAT team member was the only law enforcement officer to fire a weapon.\n\"If he hadn't taken that action that quickly, this likely would have been a lot worse than it was,\" HPD spokesperson John Cannon said.\nPolice say a second shooter was struck by gunfire and taken to the hospital. HPD sources confirm the second shooter was not a suspect, but rather someone who tried to shoot the gunman, but was shot himself.\nThe customer who was killed is a man in his 50s and a regular at the business. Police say he had just pulled up when the gunman shot him.\nTwo Precinct 5 deputy constables were also hit. One of the deputy constables was wearing both a metal breastplate and a bulletproof vest, which may have saved his life. The other was shot in the hand. They've both been treated and released.\nThree other citizens -- two men and one woman -- were wounded in the shootout. None of their injuries are believed to be life-threatening.\nA teen jumped into action to save one of those victims, who had been shot in the thigh.\n\"I saw a guy on the side of road whose leg was bleeding,\" said Nicolas Latiolais.\nNicolas wrapped the victim's vest around his leg until paramedics arrived.\nAccording to HPD, the main gunman had a high-powered weapon, believed to be an AR-15. They say he fired at a police helicopter, striking it at least five times. The suspect opened fire on a total of five police vehicles.\nPolice say it's possible the gunman shot other vehicles during his rampage. They're asking anyone who was in the area and notices bullet holes in their vehicle to contact them.\nFire burned at a gas station next to the auto detailing business. Police say they believe it started when gunfire hit a pump.\nSHOOTING TERRORIZES NEIGHBORHOOD\nNeighbors described hearing many gunshots, and some drivers said their cars had been shot at.\nStephen Dittoe, 55, lives in the house right behind the shooting scene, separated by a fence and tall shrubbery at the end of cul-de-sac.\n\"I heard the first shot and I thought it was a transformer\" exploding, he said. His wife, Ha, 41, said it went on too long for that and described the series of staccato sounds.\nShe took their two children, ages 6 and 7, into the bathroom, told them to eat breakfast in there, and called 911.\nAt a church located just a few blocks down the street from the scene of the crime, parishioners sheltered-in-place and rushed to move children in the nursery to safety during morning services.\nCONDITION OF WOUNDED DEPUTY CONSTABLES\nPrecinct 5 Chief Ted Heap spoke exclusively with abc13, saying all deputy constables from his precinct are OK.\n\"Anytime that you have a situation like this where not only the public -- in this mass amount of shots fired -- the public is threatened, but when you have eight officers on the scene like that, it's just a miracle today we didn't have officers that were hurt,\" Chief Heap said.\nHeap said one deputy constable was taking cover behind a patrol car when a bullet came through both windows and hit him in the chest. His protective vest saved his life.\nAnother deputy constable was injured when debris from the shooting hit his hand.\nA third deputy constable was inside his patrol car when his windshield was hit with several bullets. That deputy constable was unharmed.\nAt this point, we don't know how the situation started."}