{"uri": "http://www.chron.com/houston/article/Active-shooter-reported-in-West-Houston-7952041.php", "title": "Two dead, six injured in West Houston shooting rampage", "dct": "Mon, 30 May 2016 00:00:00 GMT", "id": "2a5033adbf7bf6c74d32c59ec7d2d14c", "content": "At least one shooter opened fire on police officers and residents in west Houston on Sunday morning, leaving one person dead, two police officers wounded and three others injured.\nThe main active shooter was also killed by a SWAT officer at the scene, which unfolded at 13200 Memorial at 10:15 a.m. A second man armed at the scene, who was initially thought to be a second shooter, was also wounded but was expected to live. Houston police are interviewing him at an area hospital and trying to ascertain his role in the incident.\nThe shooting occurred at Memorial Drive Tire & Auto Center. A fire at a gas station across the street may have started when a stray bullet struck a gas pump, said interim Houston Police Chief Martha Montalvo at a press conference Sunday afternoon.\nArmed with an AR-15 and a pistol, the main suspect left five bullet holes in a police helicopter circling over the active shooting scene.\nThe shooters forced the quiet, leafy residential neighborhood off Memorial into lockdown mode as police and SWAT officers secured the area.\nOne Precinct 5 constable's deputy was released after being shot in the hand by a suspect. Another deputy was saved by his bullet proof vest after he was struck in the chest by one of the suspect's bullets.\nA man in his 50s died at the scene after being shot to death in his car, said Houston police spokesman John Cannon. Three other victims were transported to area hospitals for their injuries.\nA motive was not immediately clear, Montalvo said. The shooters have not yet been identified, nor have any of the victims.\nPolice went door to door in the neighborhood, interviewing witnesses and ensuring all victims were accounted for, Montalvo said.\nThe shootout left the residents of the normally quiet, family-friendly Wilchester neighborhood feeling shaken and shocked.\nSean Stone, 49, lives in a small cul-de-sac on Pebblebrook off Wilcrest, where the SWAT team stationed their vehicles and team members.\nWhen he started hearing gunfire, Stone was inside his home. At first he didn't recognize the what was happening, but the sound of the second round of shots was \"plain as day.\" He shepherded his family into the home's interior, away from the windows. He saw a swarm of police officers, but he was still worried about the assailant running in the area on foot.\n\"I was scared for my family,\" Stone said. \"It was pretty unnerving.\"\nBy late afternoon, yellow tape surrounded his neighbor's home. He said SWAT officers had entered earlier because the house had a clear view of the gunmen.\nStone, the director of a conservation organization, said the incident was uncharacteristic for a residential neighborhood that sees very little crime.\n\"It's phenomenal,\" he said of the area. \"We live in the bubble.\"\nAcross the street, Bill Schwartz witnessed some of the shootout first hand. He and his wife passed the tire center on their way home from church at 10:10 a.m. They chatted about how they might get their car detailed there soon.\nSchwartz, 62, said they saw a shirtless man with tattoos, who he later realized was one of the gunmen. Another man had his hands up.\nWhen the couple heard a loud pop, at first they thought it was a blown tire. Then more gunfire ensued, sounding almost like firecrackers, Schwartz's wife remarked to him.\nWhen they returned to their home of 25 years, officers told them to go inside. When Schwartz emerged later, he was told one of the suspects had been shot but the other was still actively firing at officers.\nSchwartz said his wife was afraid. He wished he could assist somehow.\n\"I was trying to see what I could do,\" he said. \"But we're not armed.\"\nA retired staffer from Houston's Parks and Recreation department, Schwartz said he later learned from a friend in the Houston Police Department that a helicopter had landed in a nearby parking lot after it was hit by multiple bullets."}