{"uri": "http://www.usatoday.com/story/news/nation-now/2016/05/31/police-212-rounds-fired-houston/85220390/", "title": "Police: 212 rounds fired in Houston mass shooting", "dct": "Tue, 31 May 2016 00:00:00 GMT", "id": "5d101af17445b7b6e8062acd5921f41a", "content": "USA TODAY\nHOUSTON — Houston Police released new details about Sunday's mass shooting in west Houston during a press conference Tuesday.\nAccording to investigators, the suspect, Army veteran Dionisio Garza III, fired 212 rounds during the rampage that left two dead and six wounded in a neighborhood off Memorial Drive.\nPolice say that Garza came to Texas from California and arrived on Saturday to see some friends. They believe that the shooting location was random.\nFriends said Garza served in the Army in Afghanistan and had suffered PTSD.\nPolice said they believe Garza broke in to Memorial Drive Tire & Auto and stayed there the day before the shooting. Police said he intentionally turned off his phone and \"went off the grid\" at 4 p.m. Saturday.\nPolice said Garza came out of the tire shop and confronted customer Eugene Linsomb and shot him. Linscomb died at the scene. The suspect then retrieved an AR-15 and shot at passing cars and police vehicles. He struck a line to a gas station, which then caught fire, police said.\n\"We believe his military training and his location, he felt safe there,\" said Lt. John McGalin. \"Had access to three corners. Didn't have to worry about anyone coming up behind him. There just seems to be no rhyme or reason to why he picked that location.\"\nJohn Wilson, who was initially believed to be a second shooter, was a resident in the area and came out to offer assistance. He was outgunned by the suspect and was shot in the leg. He is expected to survive.\nEight people were shot, including the gunman. An HPD sniper fired four rounds, including the shot that killed Garza.\n\"At the scene, we found some random writings on the walls (Garza) wrote on paper, nothing of consequence, doesn't appear to be terrorism, just appears to be someone who was in mental health crisis at this time,\" said McGalin.\nGarza's stepmother, Cathy Garza, spoke to KHOU-TV by phone. She said the family is devastated by what happened.\n\"They're taught to be tough and to not be weak,\" said Garza. \"From the outside, it seemed like he was doing OK, but I think on the inside, he was just slowly crumbling, and it got to the point where he just wasn't making sense. He was kind. He had friends. He got along well with others. He was a great kid. Our hearts just go out to the families. We feel for them. It's not, it just wasn't him that day. He was not that person.\"\nHPD Interim Chief Martha Montalvo thanked residents who opened their doors to strangers fleeing the shooting and said that the death toll could have been higher. Residents saw the shooter from their homes and alerted police.\nHPD urged the public to remain vigilant for former military members that may need help when they return home.\nFollow KHOU on Twitter: @KHOU"}