{"uri": "http://abc13.com/news/mystery-surrounds-west-houston-mass-shooting/1362286/", "title": "Gunman in west Houston deadly mass shooting identified", "dct": "Mon, 30 May 2016 00:00:00 GMT", "id": "e65b8c86201a7725a215951a5b22493a", "content": "HOUSTON (KTRK) --\nA source close to the investigation has identified the suspect in Sunday's west Houston mass shooting as a 25-year-old veteran from California. Dionisio Garza III is from San Bernardino County and served in Afghanistan. He was discharged from active duty in 2014, and doesn't appear to have a criminal history.\nPolice came back to the scene of the deadly mass shooting in west Houston on Monday to collect evidence after our abc13 Eyewitness News team discovered personal papers, documents, bullets and a military bag.\nOur team brought that evidence to a police officer's attention and it was taken away.\nThe documents included a copy of Garza's birth certificate, showing he was born in San Bernardino County, California. A copy of his military discharge record was also among the papers. That document shows he achieved the rank of sergeant after four years as an infantryman. He also received several awards, including the Afghanistan Campaign Medal with two campaign stars and the Army Achievement Medal, among others.\nPolice believe the items were left behind after other items were detonated at the scene. Since they returned to the scene to collect the items, Eyewitness News Reporter Marla Carter asked if leaving the items at the scene was a mistake. They said they didn't know.\nVIDEO: Eyewitness speaks about Sunday's mass shooting\nPolice would not provide an official comment on what was uncovered.\nLittle is known about the gunman who turned a peaceful community in west Houston into a personal shooting range on Sunday.\nThe victim who died in the shooting was identified today as 56-year-old Eugene Linscomb, according to the Harris County Medical Examiner's website.\nThe crime scene shut down traffic on Memorial at Wycliffe all day Sunday, but the road reopened this morning.\nThe gas station where the shooting began is charred this morning after the gunshots started a fire, according to authorities.\nInvestigators say around 10:15am, a gunman walked up to a man in the parking lot and shot and killed Linscomb.\nAfter the shooting, investigators say the gunman went into the neighborhood and fired a number of shots, wounding three people. They were sent to the hospital and are expected to be OK, but remain in the hospital.\nPolice have not released a motive in the shooting.\nSEE ALSO: Woman shot at during rampage speaks out\nOur cameras were there last night as a tow truck removed a car from the crime scene. We noticed the vehicle's license plate had been covered up. Detectives also used a METRO bus to obstruct our camera's view of the tow truck leaving with the car.\nSome who responded to the call for aid are being hailed as heroes, including Nicolas Latiolais.\nThe teen, a Boy Scout, saw one of the victims wounded lying in the street and used the man's vest as a tourniquet and sought help, asking someone to call 911.\nNicolas stayed with the man for 20 minutes until the ambulance arrived.\nThere's no word on the victim's current condition, but Nicolas is grateful he was there to help.\nPolice found the gunman and shot him. He died as a result of his injuries about 45 minutes after the first deadly shots were fired.\nAnother shooter is in the hospital, but according to HPD sources, this second armed person is not a suspect. They tell us he tried to shoot the suspect, but was shot himself.\nTwo deputy constables from Precinct 5 were shot. One man was shot in the hand, but was treated and released. Another was saved by his bullet-proof vest.\nOne victim, Denise Slaughter, was shot five times and is currently in the Intensive Care Unit. She's expected to be OK, but will have a long road to recovery. We talked to one of her family members who told us Denise was leaving the neighborhood, driving to brunch when the gunman opened fire.\nThe family member, who didn't want us to use her name, said, \"They kept shooting at us. ...Denise had good sense to step on the gas. ... We got to safety, and saw that her wound was gushing blood.\"\nWe're following this story on Eyewitness News. Watch for updates on air, online and on our mobile news app.\nKeep checking back on this page to get real-time updates as this story unfolds. To get alerts for breaking news, download the ABC-13 news app for iPhone or Android. You can also get breaking news alerts sent to you by email."}