{"uri": "http://khon2.com/2016/05/09/suspect-in-triple-murder-appears-in-court-police-say-wife-was-a-victim/", "title": "Suspect in triple-murder appears in court; police confirm wife was a victim", "dct": "Mon, 09 May 2016 16:36:00 GMT", "id": "91215efeb6b0d539cfa34f90504f057c", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nAs the suspect in a triple-murder appeared in a Hawaii Island courtroom Monday, we’re learning more about the case and how the victims died.\nJohn Ali Hoffman was charged with first-degree murder, three counts of second-degree murder, place to keep and use of a firearm in the commission of a separate felony. His bail was maintained at $2,750,000.\nIn court, Hoffman requested that he represent himself. “I’m a sovereign person. I would like to represent myself,” he told the judge. “Also any information that I provide would be a national security breach.”\nJudge Harry Freitas held off on a decision until further discussion can take place.\n“I’ve got to tell you, the more you speak about those things, the more I think I gotta keep (your public defender) Mr. (Brian) DeLima in, so you might want to talk to him,” he said. “The more you go down this path, the more I think I gotta keep Mr. DeLima in to make sure you’re protected.”\nHoffman is scheduled to return to court in June after a psych evaluation.\nMeanwhile, Hawaii Island police revealed the woman killed was his wife, Aracely Hoffman, 40, formerly known as Aracely Monroy Urruela. Police said documents located at the residence reveal the two were married in March 2008.\nCourt documents revealed that in the early morning hours of Friday, May 6, police received a call from Hoffman, who told police that three to four intruders entered his home and shot his wife.\nResponding officers encountered a vehicle leaving the residence without its lights on, and stopped it one street away, they said. Hoffman was identified as the driver.\nAccording to documents, police observed a handgun on the passenger seat, and “blood was observed on Hoffman and also dripping from the trunk of the vehicle,” where the body of Aracely Hoffman was found with a gunshot to the head.\nOfficers then checked the home, where they found the bodies of two children — a girl in the bedroom and a boy in the living room — both with gunshot wounds to the head.\nThey have been identified as 7-year-old Clara Hoffman and 5-year-old John Hoffman, the couple’s children.\nThe U.S. Postal Service wants to combine it with the…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}