{"uri": "http://www.mlive.com/news/muskegon/index.ssf/2013/10/prosecutor_car_not_bullet_kill.html", "title": "Prosecutor: Car killed wounded woman outside Muskegon Charity Lodge, driver didn't report it", "dct": "Fri, 18 Oct 2013 12:29:00 GMT", "id": "94e7f9afc685375eb801070e129f23ee", "content": "Update: Jalisa Love was never shot, autopsy indicates\nMUSKEGON, MI - Jalisa Brione Love died from being run over by a car outside Muskegon Charity Lodge #1397, not from a gunshot wound she suffered before that, the Muskegon County Prosecutor's Office confirmed Friday.\nThe alleged driver, Lamarcus Deshon Calvin, was arraigned Thursday, Oct. 17, on a charge of failure to stop at the scene of an accident causing serious injury or death, a five-year felony.\nProsecutors allege that Calvin, fleeing gunfire, knew he had run over someone but didn't stop and didn't report the incident to police afterward.\nCalvin has not been charged with causing Love's death. Prosecutors say more investigation is needed to determine whether he saw her before he allegedly drove over her.\n\"The evidence shows that Lamarcus Calvin was the driver of the car seen on the video at the Elks Club (Charity Lodge #1397) that resulted in the death of Jalisa Love,\" Muskegon County Chief Assistant Prosecutor Timothy M. Maat said Oct. 18. \"We'll prove that the defendant had reason to know he hit someone with his car and failed to report it when he reached a place of safety.\n\"Other possible charges will be evaluated once the investigation is completed,\" Maat said. \"The investigation remains active, and our office urges anyone who has information to contact the Muskegon Police Deparment or Muskegon County Silent Observer.\"\nCalvin's court-appointed attorney could not immediately be reached for comment Friday.\nLove, 20, died after being transported to a local hospital. Authorities have said she was first shot, then run over by a fleeing vehicle early Sept. 22.\nIt happened after a shootout outside the lodge at 149 Ottawa St. that left two men dead and at least four people wounded in addition to Love. Killed by gunfire were Dupree Johnson, 20, and Ja'Colby Brown, 20.\nPolice had been seeking the fleeing vehicle since shortly after the incident. An arrest warrant was issued for Calvin Tuesday, Oct. 15, and he was taken into custody Wednesday, Oct. 16.\nAt Calvin's arraignment, Muskegon County 60th District Judge Michael J. Nolan set a family surety bond of $10,000, which was posted by Calvin's mother, on condition Calvin observe a dusk-to-dawn curfew unless with her. A family surety bond doesn't require money to be posted, only that a family member sign a form committing to pay if the defendant doesn't show up for future court dates.\nThat bond was a reduction from an interim cash or surety bond of $50,000 that had been set by a magistrate who signed Calvin's arrest warrant. A cash or surety bond requires a defendant to post the full amount before being released, using either his own cash or money borrowed from a bail bondsman.\nCalvin is the second person to be charged with a felony in connection with the events outside the Charity Lodge. Antonio Keshawn Raglin, 20, of Muskegon Heights, faces trial on charges of being a felon in possession of a firearm, lying to police and possessing a firearm while committing a felony, charged as a third-time habitual offender.\nAs of Oct. 18, no one has been charged with murder or any other assaultive crime in connection with the Charity Lodge shootout.\nOfficials ask that those with information call the Muskegon Police Department at (231) 724-6750 or Silent Observer at (231) 722-7463.\nA new Silent Observer system also allows anonymous tips via text, by texting MKGTIP plus your tip to 274637 (CRIMES). Anonymous tips can also be submitted at www.silentobservermuskegon.com.\nJohn S. Hausman covers courts, prisons, the environment and local government for MLive/Muskegon Chronicle. Email him at jhausman@mlive.com and follow him on Twitter."}