{"uri": "http://www.wsbtv.com/news/local/atlanta/3-year-old-shot-in-the-back-in-southeast-atlanta/431262832", "title": "5-year-old boy hit by stray bullet in Atlanta apartment", "dct": "Mon, 29 Aug 2016 18:33:00 GMT", "id": "d2462ef69f773e4bfc867c70d8b56df0", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nATLANTA - A family living next door to where a 5-year-old boy was hit by stray gunfire, is now looking to move out of that apartment complex.\nRelatives of the wounded boy told Channel 2’s Richard Elliot he is expected to be OK.\n“It was real scary. She said the fire from the bullets hit the ground right by her window,” Benita Hicks told Elliot.\nHicks came by the Forest Cove Apartment to get her daughter and three kids out before there's another shooting like the one Sunday night.\n12pm: \"They didn't have to shoot my baby like that.\" Grandmother of boy, shot at an apt. complex, speaks out. @wsbtv pic.twitter.com/9VZKgMYpl8\n— Audrey Washington (@AudreyWSBTV) August 29, 2016\n“All we keep hearing about is the shooting and I have to come here every day and check on my daughter. Every day. And sometimes I have to take my grandkids home with me and I live in Stone Mountain so they can be safe,” Hicks said.\nChannel 2 Action News was at the scene Sunday night as police searched for clues in the shooting. They say they found as many as 16 rifle shell casings.\nOne of those bullets pierced the wall of an apartment and struck the 5-year-old boy\nTwo other men tied to the incident showed up at Atlanta Medical Center with minor gunshot wounds. Atlanta police think there may be a connection.\n“I'm tired of it all, and I'm really mad, and we got to do something about this,” the boy’s grandmother told Elliot, asking not to be identified.\nTRENDING STORIES:\nElliot was there Friday as other family members delivered balloons to the family's apartment.\nThe boy’s grandmother was on her way to see him at the hospital.\n“I'm fixing to go downtown and see my grandson, but he’s OK. He’s kind of weak right now,” the grandmother said.\nAtlanta police are not releasing the victim's name. They're still trying to figure out the motive for the shooting.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\n© 2017 Cox Media Group."}