{"uri": "http://www.cbs46.com/story/32859886/child-3-struck-by-stray-bullet", "title": "Child, 5, struck by stray bullet", "dct": "Mon, 26 Sep 2016 23:34:00 GMT", "id": "fe491fac0c71fd953670a539cba51227", "content": "ATLANTA (CBS46) -\nA five-year-old boy is recovering after being struck by a stray bullet at an apartment in Atlanta late Sunday.\nThe shooting happened around midnight in the 1000 block of New Town Circle.\nThe child was struck in the back of the shoulder and is in stable condition at Children's Hospital of Atlanta at Egleston.\nAtlanta Police found 16 rifle shell casings outside the apartment and holes in the walls, windows, and the front door of the apartment. Investigators say the mother of the boy said she had no idea why or who would want to shoot her apartment.\nWhile officers were on the scene, two men reported being shot in the same area. One of the males was shot in the leg and the other was shot in the back. The victims told police they were in the area when they heard gun shots, the next thing they knew it, they were shot. They were taken to the hospital to be treated for their injuries.\n\"It’s very concerning for us. We’ve been working in the last month trying to get these guns off the street,\" said Atlanta Police Sgt. Warren Pickard.\n\"Most of the weapons that we recover are stolen weapons and more significant than that, most of the weapons that are stolen are not stolen from our jurisdiction,\" he added. \"We’re getting guns from all across the country winding up in the hands of back guys in the city of Atlanta, used to commit crimes against our citizens. That’s something we can’t stand for.”\nThe shells casings will be analyzed at APD's crime lab to see if they match any others that are in in the system that have been found at other scenes.\nPolice urge gun owners to secure their firearms and know their serial numbers so they can work with police if their guns are ever stolen.\nNo arrests have been made and a description of suspects has not been released.\nThe identity of the child is also unknown.\nCopyright 2016 WGCL-TV (Meredith Corporation). All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}