{"uri": "http://www.cbs46.com/story/30911407/timeline-released-in-gwinnett-county-standoff", "title": "Timeline released in Gwinnett County standoff", "dct": "Thu, 07 Jan 2016 20:38:00 GMT", "id": "dc4322077cfaff6bb90edda82e119b77", "content": "GWINNETT COUNTY, GA (CBS46) -\nThe following information comes from Gwinnett County police and acts as a timeline of events in a 20-hour standoff that ended with a man killing his 2-year-old son and then taking his own life.\nJanuary 5\nCall comes in to Gwinnett County 911 on January 5 at 9:48 p.m. in reference to domestic dispute between a male and female in the 1800 block of Beyers Landing Drive in Buford.\nCaller was not at the scene and was the 20-year-old daughter of the female involved in the dispute\nThe daughter said that her mother’s boyfriend was holding her and her 15-year-old brother inside the home at gunpoint and threatening to shoot everyone and commit suicide\nThe daughter was receiving information from her brother who was inside the house\nCaller: \"Yes, I just need somebody to control the situation. He is threatening everyone...he's threatening to kill himself in our house. This is, this is not okay.\"\nDispatch: \"Okay\"\nThe woman also told the 911 dispatcher that she did not believe he had a license to carry or that he had been drinking or on drugs at the time.\n10:03 PM - the first two officers arrived at the location and began gathering information from the daughter who was outside with several friends\n10:06 PM officer’s learned firsthand from the daughter that a male was holding a handgun to a child’s head inside the house and refusing to put the child and gun down\nThe male was also stating that he was ready to die tonight\nNumerous officers began arriving at the location and surrounding the house\n10:17 PM the shift commander activated the Swat team\n10:27 PM officer at the scene spoke to mom who did not want to leave the house\n10:30 PM officer at the scene spoke to the suspect on the phone and learned his name was Thy Ho\nSuspect claimed that he and his wife were about to come outside and he will have his hands up\n10:32 PM officer lost contact with the suspect and attempted calling him back but received continuous voicemail\n10:34 PM the first negotiator arrived at the scene and assumed control over negotiations\n10:36 PM the first Swat officer arrived at the scene and began tactical assessment\n10:38 PM officers learned that there were multiple cameras on the house that covered various angles and could be monitored from any mobile device\n10:47 PM brother, sister, and her friends were secured at the command post\n10:48 PM mother came out of the house and was secured by Swat\nAt that point only the suspect, Thy Ho and his son, Phillip Nguyen were inside house\nThroughout the standoff negotiators spoke to the suspect numerous times over the phone and via text, the calls were very short with limited dialogue\nDuring those brief dialogues he requested to speak to his girlfriend\nThose requests were not granted due to the training and experience of negotiators\nGenerally direct third party negotiations are avoided especially in hostage situations for fear of the suspect making a last statements to a loved one\nJanuary 6\nAt 3 AM the suspects parents were called to the scene\nNegotiators told the suspect when the parents arrived in hopes that he would surrender\nAt 4:06 AM the suspect’s parents received a text picture of the suspect and child lying in the bed. In the photo the child was asleep\nThe suspect text his parents multiple times and attempted to call his girlfriend throughout the night\nOvernight Gwinnett Police Swat had a window of opportunity and entered the interior of the house from the garage\n6 AM due to the frigid temperatures and duration of the standoff, the decision was made to employ mutual aid and request the DeKalb Police Swat team\n10:42 AM DeKalb Police Swat began slowly relieving Gwinnett Swat and assuming tactical control and negotiations\n11:16 AM the suspect is observed with a handgun and holding the child\n11:17 AM the suspect is heard moving a dresser behind the master bedroom door to fortify his position\n3:13 PM negotiators established verbal contact with the suspect from inside the house\n3:15 PM suspect appeared agitated and began speaking in his native language\n3:39 PM the suspect apologized to the officers as they are requesting that he come to the door\n3:44 PM negotiators hear the child making noise and the suspect asks for food\n3:45 PM negotiators establish contact with the suspect over the phone and he asked for cigarettes\n3:48 PM negotiators lose contact with the suspect over the phone\n4:34 PM one shot is fired through the master bedroom door towards tactical officers.\nSeconds later, two additional shots are fired by the suspect that is when he and the child are shot\nTactical officers immediately enter the master bedroom where they find the suspect and child suffering from gunshot wounds\nBoth were immediately evacuated from the scene.\nThe child was flown by helicopter to Egleston hospital and the suspect was transported by ambulance to Gwinnett Medical Center\nThey both died of their injuries.\nCopyright 2016 WGCL-TV (Meredith Corporation). All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}