{"uri": "http://www.wsmv.com/story/31811328/2-shot-at-music-city-central-bus-station", "title": "4 injured in shooting at downtown Nashville bus station", "dct": "Mon, 25 Apr 2016 20:52:00 GMT", "id": "c8e453c60f3aa51b8da5922bd826475b", "content": "NASHVILLE, TN (WSMV) -\nFour people were injured in a shooting at the Music City Central bus station in downtown Nashville on Monday afternoon.\nTwo 17-year-olds were taken into custody following the shooting but denied involvement. They have since been released and have not been charged.\nIn a release, Metro police said shots were fired near the upper level escalator of the bus station around 3:30 p.m.\n\"I just heard 'boom boom boom' three of four times,\" one witness said.\nIn a news conference Monday evening, police said a window washer spotted two 17-year-olds run from the Music City Central and toss a gun into a row of hedges.\n\"The window washer yelled from his perch, 'Stop them, stop them!' So, the officers detained the two individuals,\" said Metro spokesman Don Aaron.\nA semi-automatic pistol that was tossed into the hedges was recovered, but it is unknown if that was the gun used in the shooting.\nPolice said four people were hurt, all teens, and an 18-year-old, identified as Javious Chatman, was shot in the stomach. He is in stable condition and is expected to survive.\nNathaniel Webb and Jonathan Stone, both 16, and Jalen Jeffries, 17, suffered non-critical injuries from stray rounds.\nJamie Daughtery was working at the Dunkin' Donuts store inside the bus station when the shooting happened.\n\"I saw all of the kids scatter through my store. They knocked chairs down just to get out and they were screaming,\" Daughtery said.\nAaron said after talking to sources, they believe Chatman was targeted and this was not a random shooting.\n\"We saw the same individuals riding the escalator up and down as if they were looking for someone,\" Aaron said.\nMetro police said they will increase their presence at the bus station following Monday’s shooting, especially at peak times in the morning and after school.\nThe Music City Central bus station is MTA's main transfer hub for all bus routes in Nashville. It is located on Charlotte Avenue between 4th and 5th avenues.\nAccording to MTA's web site, the center services 20,000 passengers every weekday. About 4,000 young people pass through the station daily.\nAnyone with information about this case is asked to call Crime Stoppers at 615-742-7463.\nStatement on the shooting at MTA’s Music City Central station that resulted in 4 shooting victims: pic.twitter.com/HnhIi6LPSc\n— Megan Barry (@MayorMeganBarry) April 26, 2016\nomg they started shooting at the bus station ?? I thought I was gonna die in the middle of an escalator\n— petty wap (@babykhail) April 25, 2016\nCopyright 2016 WSMV (Meredith Corporation). All rights reserved."}