{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-man-wounded-in-grand-crossing-shooting-20160805-story.html", "title": "4 dead, 17 wounded in Chicago shootings", "dct": "Sat, 06 Aug 2016 20:35:00 GMT", "id": "eef7875cddcca5c8cc3ae0c5342d33cf", "content": "(Erin Hooley / Chicago Tribune)\nFour people were killed, including a 16-year-old boy, and at least 17 other people were wounded in shootings across Chicago between Friday morning and early Saturday, police said.\nA 6-year-old boy was playing with a friend in his Park Manor neighborhood when the gunfire that fatally wounded the 16-year-old boy started around the corner.\nStanding with his father Friday afternoon, Zackariah Reed wore a Batman T-shirt and used his fingers to count out how many gunshots he heard.\n“That’s eight of them,” he said. “I don’t like gunshots.”\nThe fatal shooting Zackariah heard happened about 12:40 p.m. in the 6700 block of South Wabash Avenue, said Officer Bari Lemmon, a Chicago police spokeswoman.\nThe 16-year-old boy was shot multiple times and was pronounced dead at the scene, Lemmon said. Officials identified the boy as Delance Price, of the 6900 block of South Wabash Avenue.\nAfter the shooting, a handful of officers stood over the teen’s body in the back of an overgrown vacant lot between two homes.\nNeighbors watched police from their porches as a helicopter hummed over the otherwise quiet block. One woman read a book while sitting on her porch. A man near the end of the block mowed lawns. Next to the vacant lot, two men on a porch shared a cigarette.\nZackariah’s father, Victor Reed, 64, said he was inside his apartment making Kool-Aid when he heard the gunfire. He counted 12 to 14 gunshots that could have been fired from three different caliber guns, he said.\nA neighbor told Zackariah and his friend to get inside the gate of their apartment complex, Reed said. The children made it to Reed’s apartment just as he was going outside to look for them.\n“My concern is all the kids being shot,” Reed said. “That’s what brought me to the window. I came out to look for my baby to make sure he was safe.”\nThree other people have been killed in Chicago shootings since Friday morning.\nAbout 4:25 a.m. Saturday, a 29-year-old man was shot multiple times in the head and pronounced dead in the 11600 block of South Torrence Avenue in South Deering. The shooting may have been the result of a home invasion, and investigators are considering it domestic-related, police said. Police initially said he was 25. The medical examiner's office identified the man as Luis Marin, of the 3000 block of East 96th Street in Chicago.\nSometime after 3:10 a.m., a 32-year-old man was killed and another man was wounded in a shooting near the only still-occupied rowhouses of the former Cabrini-Green housing development. Police in the area heard gunfire and responded to the 800 block of North Cambridge Avenue to find a 32-year-old man with gunshot wounds to the head and chest.\nThe man was later identified as Maurice Selvy, of the 900 block of North Cambridge, according to the Cook County medical examiner's office. He was pronounced dead at 3:11 a.m. at Northwestern Memorial Hospital, according to the medical examiner's office.\nPolice said that the shooting took place at 3:25 a.m., but that information could not be correct if the medical examiner's pronouncement time was correct.\nAnother man, 33, got himself to the same hospital with a gunshot wound to the abdomen after the shooting. He was listed in good condition.\nDetails about the circumstances of the shooting were scarce, and bystanders at the scene were being uncooperative, according to multiple law enforcement sources.\nAt 12:30 a.m. Saturday, an 18-year-old man was killed in West Rogers Park.\nHe was walking in the 2100 block of West Devon Avenue when someone wearing a gray hoodie and light blue pants fired shots at him. He was shot in the chest and pronounced dead at the scene in the middle of the street, his body covered by a sheet. The Cook County medical examiner's office identified him as Miguel Bahena of the 5600 block of North Campbell Avenue.\nA man at the scene described driving east on Devon and noticing Bahena's friend standing, hysterical, in the middle of the road.\n\"He was standing, screaming, throwing his shirt on the ground,\" he said.\nThe young man stayed at the scene of his friend's slaying for hours, with Bahena's blood on his jeans and smeared on his ankle.\nAt least 16 other people were wounded in Chicago shootings from Friday morning to Saturday morning.\n• Just before 4:30 a.m. Saturday, a 22-year-old woman was shot in Wicker Park. She got herself to West Suburban Medical Center with a gunshot wound to the arm and told investigators she had been shot in the 1200 block of North Ashland Avenue.\n• About 2:55 a.m., a 29-year-old man was shot multiple times in South Austin. He was in the 100 block of North Leamington Avenue when someone fired shots from a nearby vehicle. He went to Stroger Hospital with gunshot wounds to both legs and the groin. His condition was stabilized.\n• At 1:30 a.m., a 25-year-old man was shot in Lawndale. He was sitting on a crate in the 1300 block of South Lawndale Avenue when someone shot him in both arms. He was taken to Mount Sinai Hospital and his condition was stabilized.\n• Just after midnight, a 24-year-old man was shot in South Chicago. He was driving south in the 8100 block of South Kingston Avenue when he was shot in the upper left leg. He was taken to Advocate Christ Medical Center in critical condition.\n• At 11:45 p.m. Friday, a 27-year-old man was shot in the 3400 block of West Ogden Avenue in Lawndale. He told police he had been drinking and smoking all day and woke up at Mount Sinai Hospital with a gunshot wound to the left leg. His condition was stabilized.\n• At 11:30 p.m., a 17-year-old boy was shot in West Woodlawn. He was in the 6300 block of South Cottage Grove Avenue when someone shot him in the leg; a bullet also grazed him in the back. He went to Northwestern Memorial Hospital and his condition was stabilized.\n• At 11:20 p.m., three men were shot in Logan Square. They were on the sidewalk in the 3800 block of West Diversey Avenue when two people approached from behind and fired shots. An 18-year-old man was shot in the right shoulder and went to Mount Sinai Hospital. A 19-year-old man was shot in the neck and a 21-year-old man was shot in the left arm. They both went to Advocate Illinois Masonic Medical Center. Their conditions were stabilized.\n• At 8:30 p.m., a 16-year-old boy was critically wounded in the Humboldt Park neighborhood. He was in the 1000 block of North Harding Avenue when someone fired shots from a passing gray sedan. He went to Stroger Hospital in critical condition with gunshot wounds to the side and hand.\n• At 7:10 p.m., a 28-year-old man was shot in the 1200 block of South Western Avenue. He was in a parked vehicle when he got into an argument with some males he did not know, who then shot him in the right arm. He went to Mount Sinai Hospital in good condition.\n• About 3:50 p.m., an 18-year-old man was wounded in the right leg in the 1500 block of South Harding Avenue, said Officer Kevin Quaid, a Chicago police spokesman. The boy told police he was standing on the sidewalk when he heard shots and felt pain. He suffered a graze wound and was taken to Mount Sinai in good condition. Officials believe the wound to be self-inflicted.\n• About 2:15 p.m. a 22-year-old man was shot in the left leg in the 7000 block of South Eberhart Avenue in the city's Park Manor neighborhood. He was walking in an alley when he heard four shots and felt pain in his leg, Quaid said. He was transported to Stroger, where his condition was stabilized.\n• In a separate shooting about 9:20 a.m., a man and woman were wounded in the same neighborhood. That shooting happened in the 6800 block of South Stony Island Avenue, said Officer Nicole Trainor, a Chicago police spokeswoman. The man, 23, was shot in the back of the leg and was taken to Northwestern Memorial Hospital in serious condition. A 32-year-old woman was shot in the back, and someone drove her to the University of Chicago Medical Center in fair condition. Quaid said two male offenders were on bicycles when they saw the male victim and fired shots in his direction. The female victim was leaving a nearby store when she was struck in the shoulder, Quaid said, correcting earlier information that she might have been shot in the back. Both attackers fled the scene and officials did not know what kind of bikes they were riding.\n• Shortly after the South Side shooting, a man in his 30s was shot on the West Side, police said. The victim was shot in the legs, arms and back about 9:35 a.m. in a drive-by in the Lawndale neighborhood, Trainor said. An older model vehicle fired shots in the 1500 block of South Kostner Avenue. The victim was taken in serious condition to Mount Sinai, Trainor said.\nNo one was in custody, and police were investigating.\nThe Chicago Tribune's Grace Wong contributed."}