{"uri": "http://www.nbcsandiego.com/news/local/Libby-Lake-Park-Celebration-of-Life-David-Garcia-Oceanside-296329091.html", "title": "'I Almost Didn’t Get a Tomorrow': Shooting Survivor", "dct": "Sat, 14 Mar 2015 21:36:00 GMT", "id": "32fe2b52d6751395beafbfe48961e087", "content": "A young Oceanside man who survived a deadly shooting at a park two years ago is proud of how far his community has come and is committed to making the most of his second chance at life.\n“Before I got shot I was talking about what I was going to do tomorrow, and I almost didn’t get a tomorrow,” said David Garcia, recounting that horrific day exactly two years ago.\nOn the night of March 13, 2013, David Garcia was one of four teenagers gunned down at Libby Lake Park in the 500 block of Calle Montecito.\nGarcia and one other teen survived the attack but the two other victims – Edgar Sanchez Rios, 16, and Melanie Virgen, 13 – died at the scene.\nA few weeks later, several suspects were arrested in connection with the deadly park shooting, charged with murder, attempted murder and participation in a criminal street gang.\nThe March 2013 shooting was near the site of another fatal shooting that happened in Libby Lake Park just two years before that. On May 3, 2011, the bodies of teens Fernando Felix Solano, 16, and Sandra Salgado, 14, were found shot to death near the park.\nToday, the Oceanside community continues rebuild after the tragic violence, promoting a better life for youth through mentoring programs such as the Vista Community Clinic’s Project REACH.\nOn Friday, two years to the date of the deadly shooting, the City of Oceanside and Project REACH hosted THE 2nd annual “Celebration of Life” event at the park, bringing residents together to remember those who died and encourage the bright futures of teens who still live in the area.\nNowadays Libby Lake Park is starkly different from the one people feared just two years ago. Instead of darkness hanging over the park, there is hope.\n“We’re the peacekeepers here – we really are,” Garcia said. “We can strive for more.”\nGarcia was shot six times that fateful night – twice in the head. He said the shooting not only changed his life, but his community.\nNow a student at Mira Costa College, Garcia said the shooting made him realize that making his community a safer and better place is possible.\nProject REACH helped him and now, in turn, he helps mentor youth through the program.\nJimmy Figueroa with Project REACH said the program and events like Friday’s celebration are living proof of the change that has transpired in the community.\n“You live in this community where, yes, tragedy has happened, but you’re saying, ‘That might have been the past but it’s not going to be my reality. It’s not my expectations that I have for my community and myself,’” he explained.\nOver the past couple of years, Figueroa said he’s seen local youth go from being sad and frustrated to channeling their emotions into creating positive change through the common goal of inspiring and influencing younger generations.\nNow, Libby Lake Park is packed with kids and teens playing instead of living in fear.\n“It’s their park now, and they’re enjoying it,” said Figueroa.\nMany teens like Garcia have rallied together through the Project REACH after-school program. They've done Public Service Announcements aimed at keeping teens away from drugs and violence.\nOceanside Police Department Lt. Leonard Cosby said the youth should be extremely proud of the work they’re doing and the difference they are making in the area.\n“Our crime rate this year is down over 9 percent and our gang-related crime rate is down over 30 percent,” said Lt. Cosby. “For the community, it’s a great thing.”\nSo, on a day that could’ve been full of grief, the community and Garcia chose to focus on just how far they've come and what lies ahead in the future – a future Garcia is so grateful to have.\n“I want for my future to be successful. Every day that you live you have to do something new, otherwise you’re not living,” he said.\nEventually, Garcia plans to transfer from Mira Costa College to UC Los Angeles, UC Berkeley or Pepperdine University. He said he wants to become a lawyer so he can help people in his community."}