{"uri": "http://www.nbcsandiego.com/news/local/oceanside-libby-lake-park-197917021.html", "title": "4 Teens Shot in Oceanside", "dct": "NODATE", "id": "ff8835446b1e12b6806f9d047f5362e9", "content": "Four teenagers were involved in a shooting at an Oceanside park Wednesday, according to police. Two of the teenagers were found with gunshot wounds and two were dead investigators said.\nThe incident happened around 9 p.m. at Libby Lake Park on the 500-block of Calle Montecito.\nOceanside Police received multiple calls of shots fired at 8:50 p.m. They scoured the park and found one person shot and injured.\nA couple of minutes later they found two other people shot and killed, then another person shot and injured in the same general area. At least of the two victims were shot more than once officials said.\nOfficers are looking for two or more suspects possibly in a gray or silver, 2005 or 2006, Toyota Tacoma or Toyota Tundra extended cab style pickup.\nEdgar Sanchez Rios, 16, and 13-year-old Melanie Virgen were found dead at the scene. The two wounded victims are also younger than 18 and were taken to Palomar Medical Center.\nMelanie was an 8th grade student at Caesar Chavez Middle School and Edgar was a student at El Camino High School. Friends and family created a makeshift memorial at the park for their slain friends.\n“The things that happen in this park startle me to death,” said Lt. Leonard Cosby, Oceanside Police Department. “It shouldn’t be happening.”\nThis shooting actually took place not far from a memorial in the park for a fatal shooting that took place here just almost two years ago.\nThe bodies of Fernando Felix Solano, 16, and Sandra Salgado, 14, were found May 3, 2011 in the northeast area of the park located north of the San Luis Rey River and east of Douglas Drive.\nThe residential area is near several schools, including Libby Lake Elementary.\n“I don’t want it to be a reflection on either the people in this park or the city of Oceanside because it’s not that way,” Lt. Cosby said.\nCosby said his heart goes out to the community because he has worked a majority of his 26 years in the area.\nThe victim's friends are pleading for any new information of a suspect.\n\"If you know anything, please say something,\" said the victim's friend Efrain Almanaz. \"We don't want more lives getting killed.\"\nThe Oceanside Police Department is handling the ongoing investigation and has established a tip line for anyone with information about this shooting. That number is (760) 435-4730.\nView Libby Lake City Park in a larger map"}