{"uri": "http://www.cnn.com/2014/10/25/us/washington-school-shooting/index.html", "title": "Gunman at Washington state school targeted his cousins, relative says", "dct": "Sat, 25 Oct 2014 00:00:00 GMT", "id": "190a984996c3e723140b94b403f1834d", "content": "When a teenage gunman opened fire at students in a high school cafeteria in Washington state, a relative said, he was not shooting at random targets.\nJaylen Fryberg, who witnesses said gunned down students at Marysville-Pilchuck High School, is the cousin of two of the wounded.\nThe boys were close friends, nearly inseparable, Hatch said. They even went to a school dance together last week, where Fryberg was named the freshman class homecoming prince.\n\"Only God knows what escalated this. Only God knows,\" Hatch said, according to KOMO. \"Nobody pushed a button with bullying. It's just something that happened, and we don't know why.\"\nThe wounded -- two girls and two boys -- are in intensive care in hospitals in Seattle and Everett.\nThe boys, identified as cousins 15-year-old Andrew Fryberg and Nate Hatch, are at Harborview Medical Center in Seattle, Susan Gregg, the hospital's spokeswoman, said. Fryberg is in critical condition and Hatch is listed in serious condition, she said.\nThe girls were identified as Shaylee Chuckulnaskit and Gia Soriano, both 14, according to Providence Regional Medical Center Everett's chief medical officer Dr. Joanne Roberts. They were in critical condition with head injuries.\nAt a news conference Saturday, Roberts read a brief statement from Soriano's family: \"Our family is in shock. We appreciate your thoughts and prayers during this tragedy. Our hearts go out to the other victims and their families.\"\nRoberts said dead tissue was being removed from the girls' head wounds and surgery was conducted to allow their brains to swell and contract.\nOf the victims' families, Roberts said: \"They are having all of the reactions that you or I would have if we were in their circumstances. Much of the day yesterday was spent trying to make identification. That was terribly stressful for them. We've seen tears. We've seen anger. They are just grieving.\"\nLunchroom in shock\nInvestigators in Marysville, about 34 miles north of Seattle, have not provided details on the shooting, but students offered up accounts that painted a terrifying, chaotic picture.\nSchool in scramble\nThe Snohomish County sheriff's office said Saturday that investigators interviewed more than 100 students and confirmed that \"a cafeteria worker attempted to stop the shooter.\"\nBy all accounts, Fryberg was a popular student. Just a week ago, he had been named the high school's freshman homecoming prince, according to a YouTube video of the ceremony and accounts provided by students to CNN.\n\"It's weird to think about, because you see him and he is such a happy person,\" Pietsch said. \"You never really see him be so angry and so upset. ... People were telling me who it was when I was getting in my mom's car and I was like, 'What? This is not happening. ... This is crazy.' It was just surprising to me that him out of all people would be the one.\"\nMultiple social media accounts in Fryberg's name depict him frequently hunting and using rifles. Those accounts say he was a Native American and a member of the Tulalip Tribe.\nBut a Twitter account in his name gave a very different picture, that of a teenager with a broken heart."}