{"uri": "http://www.southbendtribune.com/news/publicsafety/south-bend-police-looking-for-suspects-in-weekend-gunfight/article_6c8972d2-f29b-11e4-b27d-8ba8150ab76f.html", "title": "South Bend police looking for suspects in weekend gunfight", "dct": "Tue, 05 May 2015 00:00:00 GMT", "id": "6aceb14c778560d5f327ece6af671bb9", "content": "SOUTH BEND — One man faces criminal charges for his alleged role in a flurry of gunfire that left four people wounded early Sunday morning, but police were still trying to identify several more shooters a day after the melee.\nChristopher L. Accettura, 23, was charged with one felony count of criminal recklessness with a firearm and a misdemeanor count of carrying a handgun without a license in connection with a fight that broke out in the 1600 block of South William Street about 2:30 a.m. Sunday.\nFour men were injured in the shooting. The most seriously wounded, a 25-year-old man, was shot multiple times in the torso, but he was considered to be in stable condition soon after the shooting, said Capt. Phil Trent, a South Bend police spokesman.\nAnother 25-year-old man was shot in the leg and elbow, a 28-year-old man was shot in the leg and a 19-year-old man was shot in the hand, Trent said.\nThe violence started shortly after the end of the televised boxing match between Floyd Mayweather Jr. and Manny Pacquiao. Large crowds had gathered for the match at two separate houses — one on the east side of William Street and one on the west side. At one point, people from each house got in a dispute, and a crowd spilled into the street, Trent said.\nThat’s when the shooting erupted, with multiple people exchanging gunfire.\n“Someone starts firing shots, and we have reason to believe shots are being fired in both directions,” Trent said. “By the time we get there, dozens of people are out there, and dozens of shots have been fired.”\nWhen police arrived, Accettura was still firing shots, but it was unclear whether he was responsible for any of the injuries, Trent said. Police were still waiting to interview some some of the injured men and were trying to speak with witnesses who could help sort out exactly who took part in the shooting, he said."}