{"uri": "http://www.wsmv.com/story/31352867/teen-accused-of-shooting-grandmother-2-young-relatives", "title": "Teen accused of shooting grandmother, 2 young relatives", "dct": "Tue, 01 Mar 2016 14:03:00 GMT", "id": "57a29b8a729801d1d80b5b89af0f43a9", "content": "NASHVILLE, TN (WSMV) -\nA Nashville teenager is in custody after allegedly shooting his grandmother and two young relatives.\nThe shooting happened at the Berkshire Place Apartments on Porter Road in East Nashville.\nMetro police said it all started around 7 a.m. Tuesday when the 16-year-old started arguing with his mother and grandmother about getting out of bed.\nThe argument escalated, and the teen went to his closet, took out a handgun and started shooting, according to police.\nPolice said the teen’s grandmother, 67-year-old Earline Hill, was struck at least twice. His 12-year-old niece and 6-year-old nephew were also grazed.\nThe teen’s mother, 42-year-old Sheryl Williams, was not injured.\nThe three victims are being treated for non-life-threatening injuries.\nThe teen was caught by officers a short time later just a few blocks away on Straightway Avenue. Police have not yet released his name.\n\"A lot of these young people are growing up in broken families and broken homes and they're doing all that they know to do because no one's told them there's a better way. There's a right way to handling things and there's a better way to resolve a problem,\" said neighbor Delnieca Baxter.\nPolice said the teen, who attends Johnson Alternative Learning Center, has so far refused to talk to detectives. He is charged in juvenile court with four counts of attempted homicide and one count of reckless endangerment.\nThe boy's 2-year-old sister was also inside the apartment during the shooting.\nFamily members told police they had no idea there was a gun in his closet. Officers later recovered that gun at a nearby apartment.\nThe suspect’s uncle, Joseph Williams, said he has been in contact with Hill throughout the day. He said she was in pain earlier, but is improving.\n“This just really is something you watch, see on TV,” Joseph Williams said. “To know this is my family involved in this is just unbelievable to me.”\nJoseph Williams said his nephew could sometimes get angry, but in the same way as any other teenager.\n“It was mostly talking back,” he said. “You get a little older … your britches get too big for you. But you’ve got to realize you’re in someone else’s house.”\nJoseph Williams said he wants to know where his nephew got the gun.\n“I see him with a lot of kids, or whatever. There’s no telling where he got that from. I know he snuck it in here if he had it,” he said.\nJoseph Williams said Hill always taught her family strong values and to be self-sufficient. He said he hopes what has happened will change his nephew.\n“Hopefully he’ll get in there and get his mind together. Just get your life together, man. That’s all I can tell you,” Joseph Williams said.\nThe shooting caused six schools, one of which was serving as a polling place, to go on lockdown after the teen ran from the apartment complex.\nThe lockdowns have since been lifted at Cora Howe Elementary School, Stratford High School, Inglewood Elementary, Bailey Middle School, Goodlettsville Middle School and East End Prep.\nVoting at Cora Howe Elementary was disrupted for 30 minutes during the lockdown but has resumed.\nNancy DeKalb, spokeswoman for the Davidson County Election Commission, said Howard School was offered as an option to vote during that time, but only one person from Cora Howe went to vote there instead. Everyone else stayed in line to vote. DeKalb said none of the voters were turned away.\nCopyright 2016 WSMV (Meredith Corporation). All rights reserved."}