{"uri": "http://www.mlive.com/news/grand-rapids/index.ssf/2014/08/teen_charged_with_accidentally.html#incart_m-rpt-2", "title": "Teen charged with accidentally shooting 17-year-old through seat of car victim was driving", "dct": "Tue, 05 Aug 2014 11:49:00 GMT", "id": "f1c41da1ab7a1c5778cdce30c5235d1b", "content": "WYOMING, MI – Wiping away tears from his eyes, a Wyoming teen heard he is charged with involuntary manslaughter in the accidental shooting death of a fellow Godwin Heights student.\nWyoming Police say 17-year-old Marquis Deshawn Kilgore was playing with a loaded gun while sitting in the backseat of a car driven by Ta’Carhri Richardson, also 17, on Sunday, Aug 3.\nThe gun went off and traveled through the seat striking Richardson. Someone drove the vehicle to Metro Health Hospital and dropped the victim off around 2:30 a.m. By 5:07 a.m., Richardson was dead.\nRelated: Teen with gunshot wound dies after being dropped off at Wyoming hospital\nKilgore was quickly arrested along with 17-year-old Jamarius Bartee, who was originally charged with being an accessory after the fact, but that charge has been dropped, according to jail records.\nOn Tuesday, Aug. 5, Kilgore was charged with involuntary manslaughter, which carries a maximum sentence of 15 years in prison. He is also charged with felony use of a firearm, which would add two years to any potential sentence as mandated by state law.\nKilgore appeared before Wyoming District Court Judge Steven Timmers via video from the Kent County Jail where Kilgore is held on a $500,000 bond.\nKilgore answered, “yes sir,” when asked if he understood the charges. Kilgore’s eyes welled with tears as he looked at the camera, then he put his face in his hands.\nPolice say Kilgore has admitted to shooting the gun and he said the shooting was unintentional.\nKilgore is scheduled for a probable cause hearing on Aug. 13.\nE-mail Barton Deiters: bdeiters@mlive.com and follow him on Twitter at twitter.com/GRPBarton or Facebook at facebook.com/bartondeiters.5"}