{"uri": "http://wspa.com/2016/07/10/2-questioned-after-toddler-shot-in-nc-home/", "title": "2 questioned after toddler shot in NC home", "dct": "Sun, 10 Jul 2016 21:21:00 GMT", "id": "2b86d818c23df5b94fb6034001931fec", "content": "GREENVILLE, N.C. (WNCT) – Investigators are still trying to piece together exactly what happened that left a 3-year-old boy injured in a shooting in a home on Sunday morning.\nAt approximately 10 a.m., officers responded to 503-B Battle Street in Greenville.\nThe boy was in the house when he was shot in the groin area. Family and neighbors say they’re surprised and devastated.\n“It hurts; it hurts, because it could have been my child over there playing this morning,” explained neighbor Letricia Brown.\nBrown says she woke up this morning to chaos seeing her street covered with crime scene tape and cop cars everywhere.\nBrown said, “I saw the little boy in the ambulance but he was holding up his hands like he was in pain and he wanted someone to hold his hands.”\nThe boy was taken to Vidant Medical Center with non- life threatening injuries. Police searched a car near the home, snapped pictures of the scene, and took two people in for questioning.\n“All I kept thinking about is it could be kids over there. Not only do I have a son, I have a three year old daughter too,” Brown said.\nShe says her two kids and the injured little boy ride bikes and are always playing outside.\n“He’s just close, he comes over here and asks for juice and chips and I just do not understand,” Brown said of the little boy who was shot.\nOther neighbors are shocked as well.\n“It’s terrible, it’s terrible. That wasn’t supposed to happen,” Johnne Jones Harper said.\nBrown says she’ll be keeping her children close.\n“They’ll be staying in the yard for now. No, I do not feel comfortable with him going down there anymore,” Brown explained.\nPolice say the shooting was accidental but they haven’t found the gun.\nPolice also said the boy and his mother did not live at the home. He may have to undergo surgery and is expected to recover.\nThe person who shot the boy has not yet been identified.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done\nMore stories you may like on 7News"}