{"uri": "http://www.dothaneagle.com/news/crime_court/arrest-made-in-fatal-opp-nightclub-shooting/article_0c70a490-f02d-11e3-8026-001a4bcf6878.html", "title": "Arrest made in fatal Opp nightclub shooting", "dct": "Mon, 09 Jun 2014 00:00:00 GMT", "id": "4337872fcb8d4eb95d34154ea906ff0a", "content": "An Elba man faces murder and attempted murder charges in connection to a shooting at an Opp nightclub over the weekend that left four people wounded, and another dead.\nAccording to a statement from Opp Police Chief Mike McDonald, police arrested Kanavis Malik Cole, 23, of Elba, and charged him with murder and felony attempted murder.\nCole was taken to the Covington County Jail and held on bail totaling $1.5 million.\nThe police statement said the arrest was made as part of a joint investigation by the Opp Police Department, the Covington County District Attorney’s Office, along with assistance from agents with the Alabama Alcoholic Beverage Control Board and the Elba Police Department.\nThe nightclub shooting left four people wounded, including a Dothan woman, 27-year-old Tornesha Evette Fate, who suffered a gunshot wound to her forearm.\nThe police statement said police initially responded to a report of shots fired with people down at a local business on Hardin Street known as “The Little Harlem Club” around 1:30 a.m. Sunday.\nMcDonald also said in a statement that when police officers first responded to the business they discovered five people had been taken by private vehicles to the emergency room at Mizell Memorial Hospital in Opp.\nA 20-year-old Opp resident, Demetrice Lawon Hines, later died from his injuries at the hospital.\nPolice officials said Cole was also charged with attempted murder in connection to gunfire that left 26-year-old James Danshay Edwards, of Opp, wounded. A police statement said Edwards suffered a gunshot wound to the shoulder from the shooting.\nThe following two other people were also wounded in the shooting:\n-Quanisha Tearow Stoudemire, 19, of Opp, who was treated for a gunshot wound to her foot at Mizell Memorial Hospital.\n-Kenyen Devone Netles, 21, of Evergreen, who was treated for a superficial gunshot wound to his leg at Andalusia Hospital."}