{"uri": "http://kxan.com/2014/10/21/woman-killed-child-hurt-in-fayette-co-shooting/", "title": "Fayette Co. homicide tied to Austin SWAT standoff", "dct": "Tue, 21 Oct 2014 12:17:00 GMT", "id": "704c6bfe2390324a6cf351ec67f815be", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nLEDBETTER, Texas (KXAN) — The shooting of a 19-year-old mother and her 19-month-old in Fayette County is tied to a standoff where the suspect died of an apparent suicide Monday in Austin, deputies said. The Texas Rangers were called to investigate after a 19-year-old woman was found dead Monday in a home along U.S. Highway 290 near Ledbetter in Fayette County. A 19-month-old child was rushed to Dell Children’s Medical Center in Austin for treatment of a head wound.\nDeputies say they got a 911 call Monday saying a woman and child were lying in blood on the floor of a home. Deputies identified the woman as Justice Martinez. They believe she died as the result of a gunshot wound.\nFayette County Deputies say they then identified a person of interest who lived in Austin and notified police. Officers went to the man’s address, where he refused to come out. A SWAT team was called in to negotiate, but police say he killed himself instead. Police identified the dead man as Deandre Rashad L. Owens.\nInvestigators are still working to determine the cause of the shooting. An autopsy has been ordered for Martinez.\nKXAN News checked court records and it shows Martinez had an emergency protection order filed on Jan. 21 against a 25-year-old Owens, but it expired on March 21. Records indicate Martinez did not apply for a permanent protective order after the emergency order expired.\n“We don’t have stuff like that happen in this little town,” said Harley Goerlitz, who has lived in Ledbetter his entire life. “I’ve never seen anything like this in Ledbetter. It’s a calm little town; everyone’s friendly.”\nLedbetter is a community of about 40 people, so when something like this happens, news travels fast.\n“It definitely hits close to home, that’s for sure,” said Cristyn Pharis, who drove past the crime scene on her way home from work on U.S. Highway 290.\nFayette County authorities and Austin police are still investigating this case.\nPolice history\nCourt records show an emergency protective order against Deandre Rashad L. Owens on January 21, 2014.The order named Martinez as the protectee following Owens Jan. 21 arrest for assault and interference of an emergency call. The Travis County District Attorney’s Office tells KXAN Owens violated the order on Jan. 28.\nThe district attorney’s office tells us Martinez never filed for a permanent restraining/protective order.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}