{"uri": "http://www.nola.com/crime/index.ssf/2016/08/trooper_shot_in_exchange_of_gu.html", "title": "Trooper shot in exchange of gunfire, witnesses say; SWAT searching 7th Ward homes", "dct": "Sun, 21 Aug 2016 18:11:00 GMT", "id": "f80e8318eee935893a521fad93e04f60", "content": "A Louisiana State Police trooper who was shot in the 7th Ward on Sunday afternoon (Aug. 21) was injured during an exchange of gunfire in which law enforcement officers and at least one man exchanged more than 20 shots, witnesses said.\nNew Orleans Police said the trooper was shot in the arm at the corner of Law and New Orleans streets, in an incident a department spokeswoman called \"an officer involved shooting.\" She said NOPD officers \"may have discharged their weapons\" during the incident.\nThere is an active perimeter set in the 7th Ward, covering several blocks, as SWAT team members search homes.\nPolice later confirmed an exchange of gunfire took place. The trooper was taken to a hospital, where he was in statable condition.\nNOPD had not indicated as of 5 p.m. if the trooper or any other law enforcement officers shot anyone. One person was on the ground behind police screens at the site where police said the trooper was shot, and was put into an ambulance and taken away. The person's identity and condition were not clear. (See map of the area below.)\nPolice had blocked off the 2600 block of Allen Street and members of the SWAT team were searching homes in the block and neighboring area. Officers alerted onlookers to stay away from what the officers called a \"hot scene.\"\nTwo witnesses said the incident involved an exchange of gunfire between at least one person and more than a dozen law enforcement officers.\nOne witness, who asked to be identified only as James P., said about 15 officers were at Law and New Orleans streets apparently looking for someone when a man in a gray outfit motioned to the officers and then began firing at them.\nThe witness said an exchange of gunfire ensued, at which time the trooper was injured.\n\"It was surreal,\" the witness said.\nLouisiana State Police car speeds to UMC emergency ramp after trooper shot in 7th Ward. https://t.co/r544pfu3kc pic.twitter.com/DdgNcY3rk6\n-- Emily Lane (@emilymlane) August 21, 2016\nAnother witness, Albert Girard, said he saw police first exchange gunfire with two men near the corner of Duels and Allen streets, two blocks away from Law and New Orleans.\nGirard said the suspects then ran through the back yards of homes on the block and had another exchange of gunfire with officers at Law and New Orleans streets.\n\"I saw the policemen chase them,\" Girard said. \"It was a rolling gun battle.\"\nSWAT team members were seen searching homes near the corner of Duels and New Orleans streets.\nStaff writers Emily Lane and Michael DeMocker contributed to this report. Stay with NOLA.com | The Times-Picayune for more on this developing story."}