{"uri": "http://www.texomashomepage.com/story/d/story/girl-10-dies-after-being-shot/14291/Te1JZc0TiECtD36OInCUzg", "title": "10-Year-Old Girl Dies After Being Shot", "dct": "NODATE", "id": "16b88214514497fd7861903ca5031145", "content": "Duncan, Oklahoma - A little girl's struggle to survive looks to be coming to an end as an OU Medical Center supervisor said tonight her organs will be donated. The Duncan Banner reports the 10-year-old was accidentally shot in the neck by her 12-year-old brother.\nMuch of the small Oklahoma town is in shock Thursday and cannot believe something like this could ever happen. Many residents we spoke with wanted to let the little girl's family know their thoughts and prayers are with them during this difficult time.\nDuncan resident, James Henderson, could not believe when he found out a 10-year-old girl was accidentally shot by her 12-year-old brother.\n\"It's a tragic situation. Hope people can learn from it,\" said Henderson.\nHenderson is a gun owner himself and his granddaughters, 11-year-old Mijal and 10-year-old Mazie, live with him and his wife.\n\"So, I'm pretty protective of those girls. Like I said, I don't ... I'm pretty careful that they don't stay home alone,\" Henderson continued.\nAcross town, Oklahoma gun instructor, Stephen McCuen, said every gun owner should follow all safety guidelines ... when using and storing their firearm.\n\"First off, number one rule in shooting is make sure your weapon is not pointed anywhere it could cause harm, danger, or injury. … Two, you shouldn't have an accidental discharge if you're following your basic gun safety rules,\" McCuen stated.\nHenderson said he wishes he could turn back time for this family.\n\"I wish it could be undone. But, I think they are probably going through more than we could possibly realize right now over what's happened. I'm sure if they could take it back, they would take it back. The gun wouldn't be in the house. But, it's done,\" Henderson declared.\nHe just hopes others who have guns in their homes will learn from this tragedy.\nThe Stephens County Sheriff's Office is still investigating this incident.\nCopyright 2017 Nexstar Broadcasting, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}