{"uri": "http://www.illinoishomepage.net/story/d/story/missing-teen-sought-for-accidental-shooting/11081/7EHRJdw9fkmxD1rWLxFjSQ", "title": "Missing teen surrenders", "dct": "Tue, 31 Mar 2015 12:13:00 GMT", "id": "f06ff98d027cd5c0dd9f9ecb6495571d", "content": "Error loading player: No playable sources found\nUpdate: 3:51 pm\nCHAMPAIGN -- Police have taken a missing, endangered runaway into custody. 16-year old Jayvon Nichols-Pelmore was the subject of a \"warrant of apprehension\" by police. Authorities say he shot a 17-year old girl in the leg by accident Saturday and fled the scene.\nNichols-Pelmore was arrested about 3:25 pm, Tuesday, in the 1500-block of Westfield Drive. He voluntarily surrendered to authorities. Investigators are still searching for the gun involved in the shooting.\nAnyone with information is asked to call Crime Stoppers. You can remain anonymous and may earn a cash reward.\nChampaign County Crime Stoppers\n(217) 373 - TIPS\n373tips.com\nText: CCTip + info to CRIMES (274637)\nOriginal: 12:13 pm\nCHAMPAIGN -- Police are searching for a missing 16-year old. They say Jayvon Nichols-Pelmore is an endangered runaway. Police responded to a shooting about 6 pm, Saturday, March 28, in the 1700-block of Clover Lane. Authorities found a 17-year old girl had been shot in the right leg, allegedly by Nichols-Pelmore.\nOfficials say a group of five teens were at the Clover Lane home prior to attending a birthday party. Nichols-Pelmore reportedly pulled out a handgun to \"show off.\" That's when the shot was fired. Nichols-Pelmore was said to have apologized profusely to the victim before fleeing the scene.\nInvestigators say everything they learned indicates the shooting was an accident, but police haven't been able to find Nichols-Pelmore since he fled the area. The victim was taken to the hospital with non-life threatening injuries.\nJayvon is a black male, 5'3\", 105 lbs., with black hair and brown eyes. He is listed as a missing, endangered runaway. A \"warrant of apprehension\" has been issued for Nichols-Pelmore.\nCopyright 2017 Nexstar Broadcasting, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}