{"uri": "http://wishtv.com/2016/07/16/impd-officer-shot-on-se-side/", "title": "IMPD officer shot on SE side", "dct": "Sat, 16 Jul 2016 19:53:00 GMT", "id": "2abf9efd2ab9ba7af790aadb0fb547c5", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nINDIANAPOLIS (WISH) — An Indianapolis police officer is expected to survive after being shot by a suicidal man on the southeast side of the city Saturday evening.\nPolice were called to a home in the 8700 block of Carver Drive in the Village of New Bethel subdivision around 7:30 p.m. on report of a suicidal man, according to IMPD.\nOfficers arrived and found a man in a car holding a gun to his head, according to IMPD. The man got out of the car still holding the gun to his head and officers tased him. The man fired and a bullet hit an officer’s lower leg.\nAn IMPD official said investigators are trying to determine if the man intentionally or accidentally shot the officer.\nThe male officer, identified as Donald Neal, was rushed to IU Health Methodist Hospital in good condition. IMPD said he’s an 8-year veteran of the department.\n“Our officers saved a life today and one of officers sustained a gunshot injury as a result,” IMPD tweeted.\nPolice said Neal will have to undergo surgery, but is expected to make a full recovery.\nThe reportedly suicidal man was taken into custody without injury, according to IMPD.\nThe suspect has not been identified.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}