{"uri": "http://www.deseretnews.com/article/865657675/Police-arrest-suspected-gunman-in-shooting-deaths-of-teen-siblings.html", "title": "Police identify suspected gunman arrested in shooting deaths of teen siblings", "dct": "Fri, 08 Jul 2016 11:05:00 GMT", "id": "fccae22c032af87cbb2349e149bbb2c5", "content": "A 16-year-old boy and his 15-year-old sister were shot and killed late Wednesday by a third person in what Unified police described as \"senseless\" killings.\nA 16-year-old boy and his 15-year-old sister were shot and killed late Wednesday by a third person in what Unified police described as \"senseless\" killings.\nMIDVALE — Unified police have arrested the man who they believe gunned down two teenage siblings because of a dispute over a T-shirt and other property.\nMario Cervantes-Angel, 28, of West Valley City, was arrested for investigation of two counts of aggravated murder. A federal detainer was placed on him as U.S. immigration officials checked his citizenship status.\nHe is accused of shooting and killing Jose Izazaga, 16, and his sister, Abril Izazaga, 15, late Wednesday outside a condominium complex at 759 W. 7720 South.\nJose and an 18-year-old man were reportedly having a dispute over property, possibly a shirt and an iPad, according to Unified police. The 18-year-old and Jose were considered friends at one point and had stayed over at each other's homes on multiple occasions, said Unified Police Lt. Lex Bell.\nBut as the two argued over the shirt, Abril stepped between them, Bell said. That's when the man allegedly began getting rough with Abril, and Jose, holding a knife, attempted to defend her, he said.\nWhen the knife was produced, Cervantes-Angel \"pulled out a gun and fired several shots, striking two victims,\" according to a Salt Lake County Jail report.\n\"This evolved really quickly over a fairly mundane issue,\" said Salt Lake County Sheriff Jim Winder.\nSeveral witnesses later identified Cervantes-Angel as the gunman, the report states.\nDetectives were still investigating Friday whether Cervantes-Angel had family ties to the 18-year-old. Bell said detectives learned he may have been a former boyfriend of the 18-year-old's mother, or possibly her husband, making him the teen's former stepfather, Bell said.\nAfter learning of Cervantes-Angel's identity, the Metro Gang Unit and others developed information he was at a house in West Valley City. Deputies from several units surrounded the house Thursday and called to him through a bullhorn to surrender, Bell said.\nBrandView\nA short time later, he came out and was arrested without incident.\nFlowers, balloons and candles were placed Thursday in the area where the teens were shot. Friday would have been Jose's 17th birthday, according to family members. Abril would have turned 16 next week.\nNo other people involved had been arrested as of Friday. Bell said the investigation into whether the others knew Cervantes-Angel had a gun or if they knew he intended to shoot anyone continued on Friday.\nTwitter: DNewsCrimeTeam"}