{"uri": "http://fox6now.com/2016/07/05/latest-man-charged-in-connection-with-fatal-shooting-near-28th-capitol/", "title": "“I just killed my cousin on accident:” Man charged after fatal shooting near 28th & Capitol", "dct": "Tue, 05 Jul 2016 11:04:00 GMT", "id": "2ed045869a5aed395b6f230267f8d37d", "content": "MILWAUKEE — 37-year-old Oliver Kennedy of Milwaukee has been charged in connection to the June 28th fatal shooting of 49-year-old Alac Jackson.\nKennedy has been charged with homicide by negligent handling of a dangerous weapon, explosives or fire by the Milwaukee County District Attorney’s Office.\nThe shooting occurred near 28th and Capitol Drive around 2:15 a.m. on Tuesday, June 28th.\nWhen authorities arrived on scene, they found Jackson suffering from a fatal gunshot wound — slumped over in a chair inside an apartment.\nOfficers and MFD attempted life-saving measures but were unable to revive the victim. He died at the scene.\nAccording to a criminal complaint filed against Kennedy, when officers arrived on scene, Kennedy was crying an on his cell phone. He told officers someone had been shot in the head.\nA 9mm semi-automatic handgun was recovered from the floor of the apartment.\nAn autopsy determined Jackson died as a result of the gunshot wound to the right side of his head, and his death was ruled a homicide. The medical examiner noted that this was a contact wound — meaning that the muzzle of the gun was against Jackson’s skin when the gun was fired.\nThe complaint indicates police spoke with a friend of both the suspect and the victim in this case. This friend told investigators Kennedy and Jackson had a history of “playing with guns and drinking.” The friend said he received a telephone call from Kennedy around 2:30 a.m. on the night of the shooting — and Kennedy told him that he and Alac were drinking and playing with a gun when he accidentally shot Alec. The friend said Kennedy was crying and saying it was an accident and he didn’t mean for it to happen.\nInvestigators spoke with a witness to the shooting, who indicated after the shooting, Kennedy said “I just killed my cousin on accident,” and then dropped a gun.\nKennedy was interviewed by police, and Kennedy told investigators on the night of June 28th, he and Jackson were drinking when Jackson pulled a handgun from his waist and pointed at Kennedy. Kennedy said this made him mad, so he walked toward Jackson and told him if he was going to point that gun at him, he was going to take it from him and use it.\nJackson had the gun pointed at the ground after racking it, and once Kennedy got to where Jackson was sitting, Kennedy said he put both of his hands on the gun and began to wrestle it away from Jackson.\nAs they were wrestling — the gun went off, striking Jackson. The gun then fell to the ground.\nKennedy made his initial appearance in court in this case on July 3rd. Probable cause was found for further proceedings in this case. Cash bond was set at $5,000.\nKennedy will next be in court on July 13th for his preliminary hearing.\nIf convicted, Kennedy faces up to 10 years in prison and $25,000 in fines."}