{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-boy-shot-20160321-story.html", "title": "Police tracing gun Englewood boy may have used to accidentally shoot himself", "dct": "Mon, 21 Mar 2016 20:47:00 GMT", "id": "a5a9618e66765bf1979f790915a4b10e", "content": "Police believe the 7-year-old boy who was killed Sunday in his Englewood home accidentally shot himself in the head with a handgun as he played with a relative.\nDevon Lofton, a first-grader, died at Comer Children's Hospital about half an hour after he was rushed there from his home in the 6700 block of South Aberdeen Street.\nDevon's 10-year-old brother brought the .22-caliber handgun into the house, police spokesman Anthony Guglielmi said, and investigators are trying to determine who gave him the weapon or how he obtained it. Police have interviewed the brother and are tracing the gun's origin.\nThe brother hid the weapon in his mother's dresser drawer in her bedroom, a law enforcement source said. Devon, apparently knowing where the gun was hidden, went to the bedroom with another relative to get the gun, according to the source.\nFamily, neighbors and community members gather to remember Devon Lofton, 7, on March 21, 2016, in front of the house where he lived in the 6700 block of South Aberdeen Street in the Englewood neighborhood of Chicago. Lofton was accidentally shot the day before. (Brian Cassella / Chicago Tribune)\nWhile Devon was handling the weapon, it went off and the boy was shot, the source said.\nDevon's grandmother was watching television in the house when the gun went off, the source said, and his mother was running errands at the time.\nFamily members insisted the gun did not belong to any adult who lived there and they did not recognize the weapon, Guglielmi said. The shooting happened about 3:50 p.m. as the boys played in the home.\n\"This is an unspeakable tragedy and clearly illustrates the long-standing problem we have with guns on our streets,\" Guglielmi said.\nPolice do not expect criminal charges related to the shooting but are investigating whether the gun was involved in any previous crimes or shootings, using ballistics information to formulate a timeline for the weapon.\nThe results of an autopsy were pending, the medical examiner's office said, as the police investigation continues.\nNeighbors said the boy lived with his mother, grandmother and siblings in the three-story home on Aberdeen. Andrew Holmes, a community activist who is working with the family, said relatives were devastated by the shooting.\nHolmes said Devon \"may have mistaken the gun as a toy gun. ... But the real question is who the gun belongs to.\"\nFamily members gathered at the home Monday, with visitors stepping past a bouquet of red, heart-shaped balloons tied to the front porch. A miniature teddy bear sat on the porch railing.\nDevon was an outgoing kid who loved to play basketball, his family and helping the neighbors, his great-aunt Sheila Dordies, 52, who lives in Indiana, said at a vigil Monday night in Devon’s memory.\nDordies was wearing a bright orange T-shirt over a white long-sleeved shirt like many of the family and friends who attended the vigil.\n\"This was his favorite colors,\" she said with a small smile.\nThe vigil was attended by about 50 family members and friends, including small children. They ran around and chased each other before the vigil, and a few tossed around bouncy balls or dribbled basketballs.\nBunches of metallic red, orange, silver and blue balloons were brought by people who came to the house.\n\"I love balloons, but I want to see balloons at graduations, not at prayer vigils,\" said Darryl Smith, president of the Englewood Political Task Force, who spoke at the meeting. \"The only thing I ask of this community, my community, the people that are out here: When the cameras leave, when the police drive off and the crowd disperses, come back and support this family.\"\nDordies said Devon attended Wentworth Elementary School. After school, he would go to a local Salvation Army family services facility, where he would color and draw pictures of family members.\n\"That was his favorite spot,\" Dordies said. \"He went every day to the Salvation Army.\"\nAt the vigil, Corey Hughes from the Salvation Army held up a frame that had Devon's picture and a picture he colored with his \"signature\" scrawled in black crayon. Hughes said a prayer before giving it to the family.\n\"He would help any and everybody,\" Dordies said. \"He said he wanted the world to love each other. ... That's what he always used to say.\"\nNeighbors said the boy lived with his mother, grandmother and siblings in the three-story home on Aberdeen. Andrew Holmes, a community activist who is working with the family, said relatives were devastated by the shooting.\nChicago Tribune's Grace Wong and Tony Briscoe contributed.\nA version of this article appeared in print on March 22, 2016, in the News section of the Chicago Tribune with the headline \"Police: Brother brought gun home - Weapon traced as boy who accidentally shot himself is mourned\" — Today's paper | Subscribe"}