{"uri": "http://www.tennessean.com/story/news/2015/07/16/active-shooter--chattanooga-military-facility/30240535/", "title": "Chattanooga attacks a 'tragic day for all of Tennessee'", "dct": "Thu, 16 Jul 2015 00:00:00 GMT", "id": "4788e13bf7546e5590fec600ca84a79d", "content": "Editor's Note: This story was initially published July 16, 2015\nCHATTANOOGA — The gunfire came in rapid bursts, too many shots to count, a witness said.\nRounds pierced the window of a military recruitment center, cracking the glass into a web.\nAt least four Marines were dead Thursday in what federal authorities are investigating as a possible act of terrorism.\nThis city was left mourning the loss of four service members and praying for the three others who officials say were wounded after the shootings at two separate locations.\nWithin hours, a picture began to emerge of the shooting suspect, a 24-year-old Kuwaiti-born electrical engineering graduate. The gunman also was killed.\n\"Lives have been lost from some faithful people who have been serving our country, and I think I join all Tennesseans in being both sickened and saddened by this,\" Gov. Bill Haslam said.\nAfter traveling to Chattanooga, Haslam called Thursday \"a horrible day for Chattanooga and a tragic day for all of Tennessee.\" On Friday morning, Haslam ordered flags at the state Capitol and state office buildings across the state to be flown at half-staff in honor of the fallen Marines.\nHaslam was joined by Chattanooga Mayor Andy Berke, who said during an evening news conference with the governor that he stayed in close contact with the White House throughout the day Thursday.\n\"Our hearts are breaking for the families of these Marines tonight,\" Berke said.\nAuthorities identified the gunman as Muhammad Youssef Abdulazeez of Hixson, Tenn., though the spelling of his first name was in dispute, with federal officials and records giving at least four variations.\nIn addition to the Marines killed, three people — whom sources identified as a Navy sailor, a Marine, and a police officer — were reportedly wounded. The sailor was said to have been seriously hurt.\nThe names of the dead or wounded were not released Thursday.\nWithin hours of the bloodshed, law officers with guns drawn swarmed what was believed to be Abdulazeez's house, and two females were led away in handcuffs.\nA dozen law enforcement vehicles, including a bomb squad truck and an open-sided Army green truck carrying armed men, rolled into the Colonial Shores neighborhood of Hixson, and police closed off streets and turned away people trying to reach their homes.\nAn armed guard prevented residents of Colonial Shores from returning to their homes Thursday. The quiet neighborhood and its shaded streets, along which parked Audi and Mercedes-Benz cars, are about 7 miles from one of the shooting sites.\nThe shooting suspect's family lived there about 15 years and did not bring attention to themselves, according to neighbor Dean McDaniel. One family member baby-sat for McDaniel's family and was always friendly, McDaniel said.\nHe said Abdulazeez \"seemed like a good kid, quiet kid.\"\n\"I didn't find anything wrong with the kid,\" McDaniel said. \"He just intermingled with the kids in the neighborhood.\"\nIt was unclear whether Abdulazeez was a U.S. or Kuwaiti citizen.\nUniversity of Tennessee at Chattanooga officials confirmed that Abdulazeez graduated in 2012 with a degree in electrical engineering. He also interned at the Tennessee Valley Authority, the agency confirmed. The Chattanooga Times Free Press posted a YouTube video of a man labeled \"Mohammed Abdulazeez\" in a mixed-martial arts fight, as well as a high school yearbook picture with the quote: \"My name causes national security alerts. What does yours do?\"\nIt's next to a picture of a smiling Abdulazeez.\nRyan Smith told the Times Free Press that he wrestled with Abdulazeez at Red Bank High School.\nSmith said that Abdulazeez was very religious and that he would argue \"back and forth\" with the boys' high school wrestling coach during fasting rituals.\nMary Bridges, another high school classmate, remembers Abdulazeez as a tall, strong young man with short hair who was attractive but shy.\n\"I always thought of Muhammad as a very, a little shy, but I thought he was very sweet and friendly. It's shocking because I always viewed him as a very nice guy,\" Bridges said Thursday evening.\n\"He just, he was friendly, he carried himself well and you know, he was friends with a lot of people.\"\nAs they advanced in their high school careers, Bridges, now 24, said she and Abdulazeez shared more classes. She remembers him specifically from their time together in a dual enrollment English class their senior year. It was a tough course. She said students who did well could earn college credits through Chattanooga State Community College.\n\"He always had really great answers. I just always thought of him, it just came very naturally to him, school,\" Bridges said.\nThere were two shootings Thursday. They took place minutes apart, with the gunman stopping his car and spraying dozens of bullets first at a recruiting center for all branches of the military, then apparently driving to a Navy-Marine training center 7 miles away, authorities and witnesses said. The attacks were over within a half-hour.\nThe FBI took over the investigation.\nAuthorities would not say how the gunman died. FBI agent Ed Reinhold said the shooting suspect had \"numerous weapons\" but would not give details.\nReinhold said authorities were looking into whether it was domestic or international terrorism or \"a simple criminal act.\" Another U.S. official said there was no indication Abdulazeez was on the radar of federal law enforcement before the shootings. The official was not authorized to discuss the case and spoke on condition of anonymity.\nThe U.S. National Counterterrorism Center is reporting no apparent nexus to terrorism has been uncovered in the investigation, but intelligence officials are monitoring the investigation closely. The Islamic State group has been encouraging extremists to carry out attacks in the U.S., and several such homegrown acts or plots have unfolded in recent months.\nIn Washington, President Barack Obama pledged a prompt and thorough investigation and said the White House had been in touch with the Pentagon to make sure military installations are being vigilant.\n\"It is a heartbreaking circumstance for these individuals who served our country with great valor to be killed in this fashion,\" he said.\nThe shootings began at the recruiting center on Old Lee Highway, where a shot rang out around 10:30 or 10:45 a.m., followed a few seconds later by more gunfire, said Sgt. 1st Class Robert Dodge, leader of Army recruiting at the center.\nHe and his comrades dropped to the ground and barricaded themselves in a safe place. Dodge estimated there were 30 to 50 shots fired. Doors and glass were damaged at the neighboring Air Force, Navy and Marine offices, he said.\nLaw enforcement officials told recruiters that the gunman stopped his car in front of the recruiting station, shot at the building and drove off, said Brian Lepley, a spokesman with the U.S. Army Recruiting Command in Fort Knox, Ky.\nThe recruiting center sits in a short strip mall, between a cellphone business and an Italian restaurant, with no apparent special security.\nThe gunman opened fire next at the Navy Operational Support Center and Marine Corps Reserve Center Chattanooga. All the dead were killed there.\nThe center is in an industrial area that includes a Coca-Cola bottling plant. The two entrances to the fenced facility have unmanned gates and concrete barriers that require approaching cars to slow down to drive around them.\nMarilyn Hutcheson, who works at Binswanger Glass across the street, said she heard a barrage of gunfire around 11 a.m.\nShe ran inside, and she and other employees and a customer waited it out with the doors locked. The gunfire continued with occasional bursts for what she estimated was 20 minutes.\n\"I couldn't even begin to tell you how many,\" she said. \"It was rapid-fire, like pow-pow-pow-pow-pow, so quickly. The next thing I knew, there were police cars coming from every direction.\"\nTennessean reporters Dave Boucher and Stacey Barchenger contributed to this report."}