{"uri": "http://www.seattletimes.com/seattle-news/crime/active-shooter-in-seattles-sodo-district-near-i-5/", "title": "Five shot, two dead, at Seattle homeless encampment", "dct": "Mon, 01 Feb 2016 15:26:00 GMT", "id": "49517fe608890ac70ac714f04ae2078d", "content": "Seattle police are searching for two men in connection with the shooting at the homeless encampment in Sodo known as The Jungle.\nThree women and two men were shot — two fatally — at a Sodo homeless encampment Tuesday night in what a police source said appeared to be a dispute among people who knew each other.\nPolice searched for two men in connection with the shooting near Airport Way South and South Atlantic Street, but were unsuccessful using a helicopter, SWAT team and police dogs. Assistant Chief Robert Merner said the shooting at the longstanding encampment didn’t appear random: “We have reason to believe it was very targeted.”\nTwo men apparently carried out the 7:15 p.m. attack at an area known as The Jungle, another source said, adding that police were interviewing witnesses to confirm that as they searched for suspects.\nOne woman was dead at the scene, and a man died at Harborview Medical Center. A man and a woman were in critical condition and one woman was in serious condition, and all were in surgery Tuesday night, a hospital spokeswoman said.\n“We can’t speculate, but we’re hopeful” they will survive, said Harborview spokeswoman Susan Gregg.\nBy 7 a.m. Wednesday, the two critical victims had been upgraded to serious condition.\nThe victims, ages 25 to 45, had gunshot wounds to the chest, abdomen and back.\n“We have no reason to believe anyone else is in danger at this point,” said police Chief Kathleen O’Toole. “We have some very good leads,” and homicide detectives were interviewing several witnesses, she said.\nPlay VideoPlayMuteCurrent Time 0:00/Duration Time 0:00Loaded: 0%Progress: 0%Stream TypeLIVERemaining Time -0:00Playback Rate1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptionsAudio TrackFullscreen\nThis is a modal window.\nCaption Settings DialogBeginning of dialog window. Escape will cancel and close the window.TextColorWhiteBlackRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentBackgroundColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentTransparentWindowColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyTransparentSemi-TransparentOpaqueFont Size50%75%100%125%150%175%200%300%400%Text Edge StyleNoneRaisedDepressedUniformDropshadowFont FamilyProportional Sans-SerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall CapsDefaultsDone\nShe added that officers were sent to other encampments to check on and reassure people.\nThe shooting came as Mayor Ed Murray was about to give a televised speech in Seattle to defend what the city is doing to address pervasive homelessness, including his recent declaration of a state of emergency.\nAt the scene, he spoke again about the issue.\n“I can’t help but wonder ‘Did I act too late?’ ” he said. “It’s on me in the end.”\nHe added: “We are involved in a homelessness crisis the like that we have not seen since the Great Depression. There is no simple answer.”\nMurray said the Jungle has been “unmanageable and out of control for almost two decades” and that the city would launch an assessment of the encampment in the next two days.\nPlay VideoPlayMuteCurrent Time 0:00/Duration Time 0:00Loaded: 0%Progress: 0%Stream TypeLIVERemaining Time -0:00Playback Rate1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptionsAudio TrackFullscreen\nThis is a modal window.\nCaption Settings DialogBeginning of dialog window. Escape will cancel and close the window.TextColorWhiteBlackRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentBackgroundColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentTransparentWindowColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyTransparentSemi-TransparentOpaqueFont Size50%75%100%125%150%175%200%300%400%Text Edge StyleNoneRaisedDepressedUniformDropshadowFont FamilyProportional Sans-SerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall CapsDefaultsDone\nHe said city workers planned to be at the encampment Wednesday to clean up garbage and waste and offer residents social services, such as mental-health care and addiction treatment.\nHe also said the city, King County and state would conduct a health and safety assessment of people living along the Interstate 5 corridor, in part to see what could be done about encampments there.\nThe area was closed Tuesday night as authorities investigated, and the Department of Transportation said it likely would be closed all night and possibly into Wednesday morning.\nAntonio Martinez said he has lived at the homeless encampment for the past three months but was turned away Tuesday night by police.\n“People come in and out, drink beer,” he said. He said the men and women who live in the encampment are like “a community.”\nUnable to access his tent, Martinez, who has been homeless for two years, said he would try to find a shelter bed for the night.\nPolice have conducted sweeps of the Jungle in the past, often in response to complaints from neighbors.\nTuesday’s shooting marked the second fatal attack at a Seattle encampment in the past five months.\nLast August, a homeless woman was beaten to death under the Magnolia Bridge and her husband was attacked, as the two ate in their tent."}