{"uri": "http://www.kirotv.com/news/news/police-responding-reports-shooting-airport-way-sou/nqC3W/", "title": "2 killed, 3 wounded in The Jungle homeless camp shooting", "dct": "Wed, 27 Jan 2016 16:49:00 GMT", "id": "72b6d5afe40845407919f346cb0b7ddb", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nSEATTLE - Two people were killed and three were seriously wounded in a shooting at a notorious homeless camp known as \"The Jungle.\"\nAs police believe the shootings likely involved people who knew each other, there is no evidence the victims were targeted, because they were homeless.\nTwo people were killed and three others were injured Tuesday night.\nKEY DEVELOPMENTS:\nFive victims: 2 dead, 3 wounded\n3 in serious condition\nShooting occurred in South Seattle-area homeless camp\nTwo people sought in connection with shooting\nFive people were found shot at the camp near Airport Way South, Interstate 5 and Interstate 90 after police responded to a report of shots fired at 7:15 p.m.\nTwo men died from their injuries. As of Wednesday morning, two women and a man were in serious condition.\nOne of several people rushed to Harborview Medical Center after shooting on Airport Way. Injuries unknown. pic.twitter.com/MsN2q2k0Gd\n— Maria Guerrero (@MariaKIRO7) January 27, 2016\nSeattle police are looking for two persons of interest, but have not released their names.\nPolice say they have reason to believe the five victims were specifically targeted. The Seattle Times said a police source said the shooting was the result of a dispute between people who knew each other.\nPolice were called to the shooting just before Mayor Ed Murray began his live address regarding the state of emergency in Seattle for homelessness.\nLast fall, Murray declared the civil state of emergency because of the growing number of homeless people in Seattle and King County.\n\"We believe this is a targeted shooting. We have persons of interest we're looking for.\" Chief O'Toole. pic.twitter.com/BHSQEz7IQ3\nIn response to the timing, at a conference Tuesday night, Murray said, \"I can't help but wonder, did I act too late? ... Maybe I should have issued the state of emergency months earlier.\"\nThe reasons for #homelessness are complex and ending homelessness will not be solved easily or quickly. There are no simple solutions.\nThe shooting is the largest in Seattle since May 30, 2012 -- the Cafe Racer shooting.\nIn that incident, five people died and one person was injured.\nIn an SPU shooting on June 5, 2014, one student was killed and two other students were injured.\nSPD reminded me--anyone camping out in the jungle is trespassing.SDOT Property pic.twitter.com/9CWBhjdm8V\n— Gary Horcher (@GaryKIRO7) January 27, 2016\nAbout The Jungle\nThe property, which is owned by the Seattle Department of Transportation, has been a notorious camp where people have lived for three decades.\nThe city tried to remove people who were living in the camp in 2012, but many stayed.\nThe Jungle has a history of violence.\nIn June of 2009, 55-year-old Bernardino Maceo-Toirac was shot multiple times in the wooded area.\nOn July 22, 2009, Warren J. Bothwell’s death was the second 2009 homicide for The Jungle.\nBothwell, 45, was found dead at the scene. Police got a call around 12:30 a.m. and found him with a chest wound.\nNo charges were filed in either of the 2009 homicide cases.\n© 2017 Cox Media Group."}