{"uri": "http://www.seattletimes.com/seattle-news/crime/witness-shooting-at-the-jungle-over-drugs-and-money/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_seattle-news", "title": "Witness: Shooting at The Jungle in Seattle over drugs, money", "dct": "Sun, 31 Jan 2016 10:36:00 GMT", "id": "d3fd2b8e14bd4da803131dd37b6e7bbe", "content": "An eyewitness to the deadly shooting at the notorious homeless encampment known as The Jungle said the gunmen appeared to be after drugs and money.\nThe witness said he was sitting around a fire pit with several others, including a man he called “Fats,” whom he described as the primary target. Then, he said, several “Samoan men wearing masks and leather” approached the encampment from the east. He said there were at least two men and perhaps as many as five.\n“Fats told them to come around the front, and they just started shooting like crazy,” said the witness, who didn’t want his name used.\nHe said Fats and another man and three woman fell in a hail of gunfire. One woman may have been shot because she would not stop screaming once the gunfire erupted, he said.\nThe witness said one of the gunmen then pointed a handgun at him and said, “You got a (expletive) problem?” The witness replied, “No, I’m just an old man sitting by the fire and trying to get warm.”\nThe King County Medical Examiner’s Office identified the dead Wednesday as James Q. Tran, 33, and Jeannine L. Zapata, 45. Both died of multiple gunshot wounds, the medical examiner said.\nA male victim underwent surgery Wednesday at Harborview and was in intensive care in serious condition Thursday morning. Two female patients have been upgraded to satisfactory condition, Harborview spokeswoman Susan Gregg said Thursday.\nThe shooting has added a sharp edge to the city’s ongoing dialogue over how best to confront homelessness, recently highlighted by Mayor Ed Murray’s declaration of a state of emergency.\nMurray, who had been giving a speech on the topic when he got word of the shooting, reiterated to reporters at a news conference Wednesday the need for federal and state officials to help Seattle fight the growing problem.\nHe said The Jungle has been a problem for decades, and the shooting further emphasizes his efforts to expand emergency shelters, permit legal encampments and open “safe lots” for homeless people living in vehicles.\nSeattle Police Chief Kathleen O’Toole confirmed Wednesday the shooting was likely connected to “low-level drug dealing,” though she offered few details other than to say at least two guns were used in the attack.\n“We do not believe this was a random incident,” O’Toole told reporters before briefing the City Council’s public-safety committee.\n“We don’t believe people were targeted because they were homeless.”\nThe witness said one of the victims recognized the voice of one gunmen. Police have also said they have identified two men sought in connection with the shooting.\nA police source confirmed the suspects were described by witnesses as Samoan and that they are not believed to be homeless.\nO’Toole wouldn’t discuss details about the suspects.\n“I don’t want to jeopardize an ongoing investigation.” she said. “It’s important that we let homicide investigators do their work. But we do have leads and we do have witnesses, and investigators were working hard through the night following those leads and questioning those witnesses.”\nThe Jungle, stretching along I-5 from Sodo to Beacon Hill, has long been a magnet for crime and the target of several city-sponsored cleanups.\nIn the late 1990s, serial killer DeWayne Lee Harris trolled the darkened copse in search of victims, killing three women living on the fringes before he was captured and convicted. Over the years, Seattle police have responded after a litany of crimes, including homicide, drug-dealing and assaults.\nIn addition to crime, advocates say the homeless have a difficult time accessing services and safe places, shortening their life span while many look the other way.\nThe average age of the 91 homeless people who died in King County 2015 was 48, according to medical-examiner records. Most were male and white. Of those, 48 died as the result of accidents; 24 of natural causes; seven by suicide and six by homicide.\nDrugs, alcohol or both were primarily responsible for at least two dozen deaths, the medical examiner said.\nState, county and city workers will begin conducting a health and safety assessment of homeless people living along the I-5 corridor Thursday to learn “the way of the land,” in part to see what could be done about those living there, Seattle Fire Chief Harold Scoggins said at the news conference.\nThey will interview residents who agree to participate, without offering recommendations or moving them, according to the Fire Department. Workers aim to get a picture of the conditions but won’t remove belongings or garbage.\nThe workers are from the State Patrol, Washington State Department of Transportation and Governor’s Office, as well as others including Public Health — Seattle & King County, Scoggins said. The assessment, starting at 10 a.m., should last three to five hours.\nThe witness to the shooting lives in one of the numerous tents under the overpass, where makeshift quarters are set up on pallets and are maintained despite trash littering the ground. He said Fats, who is hospitalized, has lived there a long time, one of scores who endure the steady “thrum” of freeway traffic coursing overhead.\nThe witness said Fats is the most established and well-to-do of The Jungle residents, a man known to invite women into his tent to get high.\nFats’ tent is two to three times the size of others nearby. Around his tent are a couch, firepit, altar, propane grill, generator, a tent for storage and many bicycles.\nThe witness said the shooting is bad news for residents because the city will feel compelled to clear out The Jungle.\n“We wouldn’t have called the cops if they hadn’t shot everybody,” he said."}