{"uri": "http://www.kentucky.com/news/local/counties/fayette-county/article115880543.html", "title": "Juvenile charged with murder in shooting of 17-year-old near Tates Creek High School", "dct": "Sat, 19 Nov 2016 08:52:00 GMT", "id": "a3c285bdd82f0f193e5babc735d35910", "content": "Investigators arrested a juvenile suspect and charged him with murder Saturday, a day after a 17-year-old died in a shooting in Lexington.\nThe Fayette County Coroner’s Office identified the teen killed as David Fletcher Jones, who was pronounced dead of a gunshot wound at 5:58 p.m. in the emergency room at the University of Kentucky Chandler Hospital on Friday.\nPolice did not provide additional details about where or when on Saturday the suspect was arrested.\nThe shooting occurred about 5:30 p.m. in the basement of a house on Honey Jay Court, off Centre Parkway and near Tates Creek High School, police said. Tates Creek and its surrounding neighborhoods have been grappling already with the presence of guns in schools. Three students were charged after taking guns to school in two weeks; two of those students were spotted as truants by city police officers and taken to school.\nJones was not a Fayette County Public Schools student, said district spokeswoman Lisa Deffendall.\nLt. Jackie Newman said the woman who lives at the house was upstairs when she heard a gunshot. When she went downstairs, she saw the teen with a gunshot wound to the head, Newman said Friday.\nThe teen had been in the basement with the woman’s two sons, ages 23 and 13, and two other friends. The four ran before the woman came downstairs, and police were looking for them, Newman said.\nThe four people who fled left cellphones behind, but police didn’t find a gun.\nThe shooting scene is not far from Tates Creek middle and high schools.\nThere was a play at the middle school and a basketball event at the high school, so officials took precautions after police alerted them to the shooting, said Deffendall.\nBoth schools continued the activities but kept everyone inside and let no one in. The precaution lasted about a half-hour, Deffendall said.\nBill Estep: 606-678-4655, @billestep1"}