{"uri": "http://www.record-eagle.com/news/local_news/boy-killed-in-shooting-remembered/article_6f585ab4-9648-5cdf-af6a-aec4d5a443a1.html", "title": "Boy killed in shooting remembered", "dct": "Mon, 27 Jul 2015 00:00:00 GMT", "id": "148be0a95572ddc713028f690364d21b", "content": "TRAVERSE CITY — Tragedy in an Antrim County town began to take shape days before a boy accidentally shot himself with a .357 handgun.\nThomas Belanger, 11, and his brother, 14, found the weapon in a dresser drawer in their grandparents' house in Alba, a small town north of Mancelona on U.S. 131. Later, they found ammunition in a shed.\nThe combination proved deadly the morning of July 23 as the boys played outside the grandparents' house on Tobias Road. Thomas tripped on a board, the gun fired and a bullet killed him instantly.\n\"We know that, historically, when you have unsecured weapons, children touch those weapons, play with those weapons, and many times there is a tragic ending,\" Antrim County sheriff's Detective Sgt. James Janisse said.\nThe boys' grandparents and a younger step-sibling were home at the time but didn't see what happened, Janisse said. The children stayed with their grandparents for about two weeks before the incident.\n\"The two brothers were close. Very, very close,\" Janisse said. \"I know the family is just absolutely devastated.\"\nAlba resident Becky Beagle, a family friend, called Thomas an \"outgoing,\" active kid who most recently attended Mancelona schools.\n\"He was just one of those kids you just want to hug because they're always smiling and always happy,\" Beagle said. \"Everybody got along with him.\"\nShe said residents of the small community are saddened by the loss. Community members are pulling together to raise money for Thomas' family.\n\"When it's somebody's kid, it's all our kids,\" Beagle said. \"That's how I feel.\"\nBeagle said Thomas loved to go camping and play with remote control trucks.\nJanisse said authorities are still investigating the case. Eventually a report will be sent to the Antrim County prosecutor to determine whether there will be any charges.\nFuneral services for Thomas wall take place Tuesday at 11 a.m. at the Mancelona Chapel of Mortensen Funeral Homes, according to the Mortensen website."}