{"uri": "http://www.11alive.com/story/news/local/investigations/2014/11/11/fedex-shooting-facility-/18873933/", "title": "Flashback of Fear: FedEx facility shooting survivor speaks", "dct": "Thu, 13 Nov 2014 00:00:00 GMT", "id": "163a504fafbb2571de51b1fc6bedd11d", "content": "KENNESAW, Ga. – A 19-year-old survivor of the April shooting at a Kennesaw FedEx facility is speaking out about the terrifying ordeal.\nIt was a dark and drizzling morning April 29 at the FedEx plant in Kennesaw. Brandyn Stonebraker, 19, was checking boxes on a conveyer belt, passing the hours of his overnight shift when he heard a voice on the loud speaker.\n\"He was just yelling, 'Everybody out now. Get everybody out,'\" Stonebraker said.\nStonebraker guessed the bad weather may be to blame -- perhaps a short circuit somewhere in the plant. As he made his way toward an exit with a cluster of coworkers, it became clear that 911 calls weren't being made because it was a storm -- it was a shooter.\n\"I heard the pops, I don't know what a shotgun sounds like so it's kind of hard to describe, it was the first time I ever heard it,\" Stonebraker said. \"It was going off and everybody was like freaking out and that's when the panic set in.\"\nStonebraker says as panic entered the room so did a spray of shotgun fire, hitting those on either side of him.\n\"I looked over and he's like, 'I'm hit,' and I'm like, 'Oh me too,\" Stonebraker said.\nStonebraker had been hit nine times. Shotgun pellets entered his arm, his neck, his abdomen, his knee, but the pain wasn't instant he says.\nHe kept moving down the hall. Along the way, he saw a knife on the ground, shotgun shells scattered about – blood. He heard woman's high pitch screaming as she was struck in the leg.\nInside the FedEx facility was Geddy Kramer on a shooting rampage. His trail of terror evident by bloodstains on the concrete, empty shotgun shells littered everywhere, clothing left behind by shooting victims as they rushed to safety. Crime scene photos taken that day show belts of ammo, Molotov cocktails, and people trying to get out.\nAs the group made it out, Stonebraker headed to his car. Shaken and in shock he called the only other person he's openly shared this story with.\n\"I was like, 'Hey dad, I think I just got shot,'\" said Stonebraker.\nKramer started his rampage at the security booth, where guard Chris Sparkman had taken the first round of gunfire and called for help.\nWhile outside, ambulances took Sparkman and Stonebreaker away, inside, police were seeking Kramer. They followed a trail of blood to a trailer filled with boxes where they found a bloody scene -- and their suspect.\nAn officer wrote: \"He was dressed in black clothing and had a black bandolier of red shotgun shell around his shoulder. I could see the butt of the shotgun near his feet and a large amount of blood spatter on the FedEx boxes in the back of the trailer.\"\nAnother officer wrote that after Kramer had been unresponsive to verbal commands, \"A Taser was deployed striking the back of the subject with no response, which further led us to believe the male was deceased. A large amount of blood was seen running down the front of the boxes the subject was lying on\"\nPolice later took pictures of Kramer's car. More bullets and black clothes, a suicide manifesto was found on the front seat, a rage-filled note about the revenge he planned to take and did, shooting six FedEx employees before shooting himself.\nStonebraker knows his fate could have easily gone another way.\n\"Any one of us could have totally just died that day,\" he said.\nStonebraker still works at FedEx. He doesn't blame the company for what happened. But these days at work, even a slamming door can cause a brief moment of panic, a flashback of fear.\n\"You don't want to go to work and be like, 'I'm going to get shot again today,' but sometimes that's kind of the mindset I guess,\" he said.\nMore stories on the Kennesaw FedEx facility shooting:\nOther stories you may find interesting:"}