{"uri": "http://www.roanoke.com/news/crime/roanoke/monsters-bar-and-grill-remains-closed-investigation-into-shooting-continues/article_b5d10a96-5d34-5989-b6f8-f6abab728253.html", "title": "Monsters Bar and Grill remains closed; investigation into shooting continues", "dct": "Thu, 22 Sep 2016 15:45:00 GMT", "id": "b1360c3569c1646c155ba6baf5dff189", "content": "Detectives are still working to identify additional people who may have been involved in the Sept. 4 shooting at Monsters Bar and Grill in the 1000 block of Orange Avenue Northeast.\nThe incident also prompted the Virginia Department of Alcoholic Beverage Control to suspend the business’ liquor license and launch an investigation. ABC spokeswoman Jennifer Guild said Thursday that the department completed the investigation after the owner signed a consent settlement offer that permanently revoked its ABC licenses, effective Sept. 16.\nVirginia ABC suspends Monsters license following fatal weekend shooting\nThe Virginia Department of Alcoholic Beverage Control suspended Monsters Bar and Grill’s liquor license Wednesday after launching an investigation into a Sunday shooting that left one man dead…\nSeveral search warrants made public Thursday list numerous items police seized from the property after the shooting, including bullets, cartridge cases and pepper spray as well as cellphones, smoking paraphernalia, money and clothing. Police also seized from the building a laptop computer and DVR that were connected to surveillance cameras.\nPolice also got a search warrant to recover any possible evidence on a cellphone given to them by a person who said it contained photographs and video of the location about the time of the incident. Police also recovered another pair of cellphones from the building.\nJermaine Lynn Black, 26, of Roanoke died at the scene after being shot about 3 a.m. The other 10 victims are Tasha Lynette Walker, 39; Terrell Dwayne Bradburn, 33; Jordan Tyree Bondhill, 18; Brian Tyrone Taylor, 36; Dalantae Shaquan Brown, 24; Thomas James Simmons, 18; Maurice Antwon Burnette, 28; Vernon James Jones Jr., 32, all of Roanoke; Harvey Maynard Burnette, 34, of Roanoke County; and Rahmel Lawrence Williams, 37, of Clayton, North Carolina.\nEight of the other 10 victims were driven to the hospital in private vehicles, police have said. From one of those vehicles, officers recovered items including a firearm, a magazine with cartridges and a box of cartridges.\nRoanoke police have charged Jermaine Leonard Brown, 24, with second-degree murder and malicious wounding in connection with the shooting.\nPolice spokesman Scott Leamon said disclosing how many firearms were discharged during the shooting “might hamper detectives at this point because they’re still working on the investigation.”\nLeamon said he also could not say whether police have determined a possible motive for the shooting, saying it could also hamper the investigation. He said police have received limited cooperation in the investigation.\nThe future of the building is unclear, but Monsters Bar and Grill is not open for business.\nThe business license was inactive as of Sept. 7, according to the city Commissioner of the Revenue’s office. The file for the business was listed as closed, and it’s unclear where the owner is or what the owner’s plan is for the business, according to the office.\nThe business license listed the owner as 460 Hookah Lounge Bar and Grill Inc. Efforts to locate company officials in the weeks since the shooting have been unsuccessful.\nOn Thursday afternoon, the building was dark and the door was locked. Trash littered the room, and bottles of cleaning fluids were scattered around. The sign on the front of the building was removed just days after the shooting.\nA sign taped to the door directed questions to Dan Brugh, an agent with The Real Estate Group, which handled the leasing of the property.\nBrugh said the previous tenants are gone. He said he has not been able to communicate with them, as the phone number provided has been disconnected.\nHe said the property will either be leased or sold, and he’s already been considering future owners. He said in the past, the property has housed a convenience store and a Mexican restaurant.\nBefore that, the building has to pass inspection. The city’s code enforcement office notified the building’s owner on Sept. 8 about unsafe structure issues and the building was condemned. The building can’t be occupied until repairs are made, according to the city.\nThe owner of the building is listed in city property records as May Ram LLC. Efforts to reach a representative of May Ram were unsuccessful Thursday.\nMonsters acquired a wine and beer on-premises license in October 2015 and a mixed beverage license in February. The ABC issued an Order of Summary Suspension to the nightclub Sept. 7 “to protect the safety and welfare of the public.”"}