{"uri": "http://nbc4i.com/2015/08/11/juvenile-injured-in-franklinton-shooting/", "title": "Boy shoots sister in the back of the neck in Franklinton", "dct": "Tue, 11 Aug 2015 09:45:00 GMT", "id": "1b2f9dd2a67953d20d5472f772028908", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCOLUMBUS (WCMH ) — A 3-year-old girl is recovering tonight at Nationwide Children’s Hospital after being accidentally shot by her 4-year-old brother.\nInvestigators say the mother was home with the children. The boy got access to a loaded gun, and fired it, hitting the girl in the back of the neck.\nPolice responded to the 400 block of Glenwood Avenue shortly after 9:30 a.m. Monday and found the girl. She is expected to live.\n“I think we have a tragedy very narrowly averted,” detective Jay Fulton of Columbus Police said.\nNeighbors watched in disbelief as the little girl was taken away in a medic.\n“I wanted to go to the emergency room with her so badly but they wouldn’t let me,” neighbor Sandra Myers said. “It hurts so bad I couldn’t go. And I wanted also to go comfort the little boy.”\nOthers in the neighborhood say this hits too close to home. Amber Litton said it “breaks (her) heart.”\n“I have a 5-year-old,” she said. “(It’s) something I couldn’t imagine going through.”\nPolice say no charges have been filed, but investigators will do interviews before taking the information to the city attorney’s office.\nWhat investigators say at this point is if you have a gun, know where it is and make sure that is away from kids.\n“If you have guns in the home and small children, make it inaccessible,” Fulton said. “If they see you handle it, the minute you are gone they’ll handle it.”\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}