{"uri": "http://fox6now.com/2016/12/28/police-man-dies-after-being-shot-several-times-near-63rd-euclid-in-milwaukee/", "title": "Teen shot, killed by CCW permit holder, while attempting armed robbery: “Picked the wrong guy”", "dct": "Wed, 28 Dec 2016 05:21:00 GMT", "id": "f1f50552b46e924b193e6a712ca35b08", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nMILWAUKEE -- Milwaukee police are investigating a fatal shooting that occurred late Tuesday night, December 27th. The deceased has been identified as 17-year-old Deonte Thomas. It happened in the area near 63rd and Euclid around 10:30 p.m.\nPolice say their preliminary investigation reveals Thomas was attempting to commit a robbery at the time of the shooting and was shot by the 36-year-old Milwaukee man who was being robbed -- who was out walking his dog on Tuesday night. That man is being questioned by investigators. He has not been arrested, and police say this case will be reviewed by the Milwaukee County District Attorney's Office in the coming days.\nThe man has a concealed carry permit.\nOfficials also say Thomas' co-actor, an 18-year-old Milwaukee man, was also shot during the altercation. He apparently went to the neighborhood near 24th and Ruby after the incident -- and has since been taken into custody.\nPolice say he may have been involved in another shooting that occurred there Tuesday night.\nOfficials say one of the two suspects in this case had a firearm.\n\"Like I tell you, 13-14 years here and nothing like this has ever happened. It`s a shock to us. How do you explain things like this your kids? Things like this happen...\" Gerardo de la Torre, a neighbor said.\n\"I am stunned. And you know what? Timing is everything. 10:30 is an unusual time on a secluded block and then who would've thought the person had concealed carry? They were looking for trouble and they clearly picked the wrong guy -- because he defended himself,\" Alderman Mark Borkowski said.\nInvestigators say the initial investigation has revealed the suspects in this incident may be responsible for an armed robbery that happened near Park Place and Maryland on Milwaukee's upper east side on Tuesday evening.\nMilwaukee Alderman Mark Borkowski issued the following statement on this case:\n\"Last night at about 10 p.m. a man walking his dog near S. 65th St. and W. Euclid Ave. in the 11th District was approached by would-be armed robbers. The man – who has a concealed carry permit for a firearm – pulled out his weapon and shot two of the robbery suspects, killing one of them and wounding the other, who is now in police custody.\n\"First, this unfortunate incident is a reminder that normally quiet, secluded areas in the city can suddenly turn into targeted crime locations at any time. The block where this occurred is very quiet and residential, and within shouting distance of St. Gregory the Great Parish.\n\"Second, it is also a reminder that if you decide to go for a walk outside at night, please be sure to wear some sort of reflective clothing, bring a cell phone, and make sure a loved one or friend knows that you are headed out. Be aware of your surroundings, and if you are targeted for a robbery, police say it is usually always the right call to give the crooks what they want (because they will likely flee as soon as you hand it over).\"\nMonitor FOX6 News and FOX6Now.com for updates on this developing story."}