{"uri": "http://www.sltrib.com/news/2611373-155/war-was-not-good-for-john", "title": "‘War was not good for John,’ says mother of Utah woman murdered by Army vet", "dct": "Fri, 12 Jun 2015 06:00:00 GMT", "id": "540b7890bb0ae34b6cba1c22ba53d79a", "content": "\"The war was not good for John. He had lots of flashbacks\" said Adams. \"He couldn't have been thinking clearly. He couldn't have had his head on straight. If he had, he wouldn't have done this.\"\nThe fight between Salazar and Reeves had started sometime Saturday night when the couple was at Lagoon, Adams said. In text messages to family, Salazar said she wanted to end the relationship. Reeves had complained that Salazar was spending too much time on others and was preoccupied with her Salt Lake Community College studies — she wanted to be a crime scene investigator, Adams said — and with the hobbies she loved, photography and painting.\nAdams doesn't know if her daughter really intended to leave — it's something that had been said before — but she suspects Salazar had told Reeves she wanted out.\n\"I know she still loved John, but I think she had had enough,\" Adams said. \"I think he thought she was serious. He must have.\"\nAdams was on the phone with Reeves in the minutes before Sunday's shooting and said she could tell a fight was ongoing. Reeves, who rarely raised his voice, was agitated and reluctant to put Salazar on the phone with her mother, Adams said.\nThe couple was no stranger to tumult.\nCourt records show Reeves had threatened Salazar with a shotgun last summer and said he wanted to kill her, her kids and himself. Reeves was arrested and charged, but had the case diverted in January to veterans' court, a program for military service personnel that includes peer support and substance abuse counseling.\nThe program subjects participants to multiple layers of supervision, including periodic home inspections, and requires them to surrender any firearms and stay away from alcohol and drugs, unless prescribed by a physician.\nRecords show Reeves was a water treatment specialist for the U.S. Army beginning in 2006 and deployed to Iraq from October 2007 to January of 2009. After leaving active duty in 2010, Reeves served in the Texas Army National Guard until August 2012.\nOn Thursday, the weekly veterans' court hearing was heavy with emotion.\nSince the shooting, the veterans' court team, which includes counselors, police, attorneys, veteran mentors and court staff, had been working to connect with each of the program participants to ensure that the safety it is designed to provide had been working, Judge Royal Hansen said.\n\"As all of you realize, we've experienced some challenging and sad days,\" the judge noted. \"They've taken a toll on all of us.\"\n» Next page... Single page"}