{"uri": "http://www.ksl.com/index.php?sid=34974635&nid=148&title=2-adults-1-child-dead-in-murray-murder-suicide-police-say", "title": "2 adults, 1 child dead in Murray murder-suicide, police say", "dct": "Sun, 07 Jun 2015 00:00:00 GMT", "id": "6a88767c1e59d5ed1916dd5f467614d2", "content": "MURRAY — A man is suspected of shooting a woman and a child to death before turning the gun on himself Sunday, leaving police to discover the three dead after three other children ran from the home seeking help.\nJust before noon police responded to gunshots at an apartment complex at 224 E. Vantana Court where they found the deceased. Three other children in the home were unharmed.\n\"Police have determined from talking to (the other children) that the adult male shot and killed the female and the child, and then turned the gun on himself,\" said Murray police detective Kenny Bass.\nPolice did not release information about the relationship between the man, woman and child, though the shooting was potentially an act of domestic violence, Bass said. He was unaware of previous instances of domestic violence in the home.\nThe names and ages of the three deceased individuals, as well as the ages of the surviving children, were not released.\nMariah McDermott, who lives in an adjacent building in the apartment complex, said she didn't recognize the gunshots when she heard them.\n\"We thought someone was just throwing something in the garbage can,\" McDermott said. \"When we were taking out the garbage, a couple little kids came out screaming 'Help me, help me.'\"\nPolice arrived, running over to the children, McDermott said. Throughout the afternoon officers continued to stream into the gated-off apartment complex at the end of the dead-end street. Crime scene tape marked off the door and patio of the apartment where a pile of children's bicycles and toys were piled.\nChristian Nah, who also lives in the apartment complex, estimated the surviving children to be between 6 and 14 years old.\n\"They were wearing PJs, like button-up pajamas, and yelling 'Help' and waving their hands up in the air,\" said Nah, describing the fear that began to set in. \"I didn't think that would happen, I never thought I would experience that.\"\nPolice are ensuring that the children, traumatized by the violence they witnessed, receive proper care, Bass said.\n\"It's sad. Unfortunately (domestic violence) is a daily, common occurrence and some of them lead to something as tragic as this, which is just awful,\" Bass said.\nSupport and resources for those experiencing domestic violence are available through the Utah Domestic Violence Coalition online at www.udvc.org or by calling the statewide domestic violence hotline, 1-800-897-5465.\nContributing: Nicole Vowell\nPhotos"}