{"uri": "http://www.kpho.com/story/26432625/pcso-san-tan-valley-boy-11-shoots-self-in-head", "title": "San Tan Valley boy, 11, dies from gunshot wound to head", "dct": "Wed, 03 Sep 2014 03:51:00 GMT", "id": "783cead1ba913afd050652b322699c55", "content": "FLORENCE, AZ (CBS5) -\nAn 11-year-old boy has died after reportedly shooting himself in the head with a handgun, a Pinal County Sheriff's Office spokesman said.\nSamuel Epps was flown to a hospital in critical condition Tuesday evening, where he died about 9 p.m., sheriff's spokesman Tim Gaffney said.\nGaffney said Samuel had been asked to complete some chores and he became upset, went into the master bedroom of the house and a short time later a single gunshot was heard by other family members.\nHis father, Sgt. Bryan Epps with the Arizona State University Police Department, ran to the bedroom and forced his way through a locked door to find his son on the floor next to the bed with a single gunshot wound to his head, Gaffney said.\nGaffney said the weapon Samuel used was not his father's service weapon.\nThe mother was not at home, but three siblings were, Gaffney said.\nDeputies and paramedics arrived at the home in the 500 block of East Red Rock Trail shortly after 7 p.m. and the child was still breathing, Gaffney said.\nDeputies were still trying to determine the exact circumstances of the shooting.\n\"The child obviously knew the weapon was there and right now it's still too early to have all the details of why the child would do something like that,\" Sheriff Paul Babeu said.\nBabeu said while it's recommended parents lock up their guns, it's not required by law.\n\"It's early in the investigation and that's something that we'll look at,\" Babeu said.\nThe family has an account set up to help with funeral expenses at Chase Bank under Bryan Epps' name, as well as a fundraising website at https://fundrazr.com/campaigns/frLJb.\nASU released the following statement Wednesday:\n\"Arizona State University is deeply saddened and offers its sincere condolences to the family and friends of Sgt. Bryan Epps, whose 11-year-old son passed away as a result of a firearms incident. The university is making counseling services available to friends, family and fellow officers in the ASU Police Department who are dealing with this tragic loss. Our hearts and thoughts are with Sgt. Epps and his family at this difficult time.\"\nStay with cbs5az.com and CBS 5 News for updates on this developing story.\n[Click here to sign up for breaking news alerts]\nCopyright 2014 CBS 5 (KPHO Broadcasting Corporation). All rights reserved."}