{"uri": "http://www.wistv.com/story/33494825/woman-3-year-old-dead-in-shelby-triple-shooting", "title": "Woman, 3-year-old dead in Shelby triple-shooting", "dct": "Thu, 27 Oct 2016 11:54:00 GMT", "id": "bdc4e9a05fc740e4571a476663c530dc", "content": "SHELBY, NC (WBTV) -\nA woman and 3-year-old child are dead and another man was hospitalized after a triple shooting in Shelby Thursday morning, according to police.\nThe shooting happened in the 600 block of Whisenant Street. The third person shot, a man whose name has not been released, went to the hospital with unknown injuries.\nFamily and friends on scene identified the victims as Miranda Woods and 3-year-old Liam Stephens.\nChief Jeff Ledford said his investigators will not stop until they find the person responsible.\n\"We are going to find whoever did this,\" he said.\nIt was almost 7:30 in the morning when a call came in to police about a shooting. Five people were inside the home when it happened - a man and his girlfriend, the owner of the home and her two baby boys. Police believe someone came into the home and shots followed.\nPolice are not saying what they think the motive was, but Ledford said, \"We do not believe this was a random act.\"\nThe man and woman, later identified as Woods, inside were both hit. The man survived, but Woods did not. The mom and a 7-month-old were not hit.\nSomehow, though, her 3-year-old son, Liam, was struck. He died at the scene.\n\"It's terrible, so terrible,\" said one neighbor when she found out what happened.\nSome said they had heard some activity outside the home around 4 a.m., but they did not hear shots.\nTyler Beason was stunned when he heard the news. He said he was engaged to the mom in the home and the 7-month-old was his son.\nHe was hoping Liam would be his stepson soon.\n\"He loved superheroes and was smiling all the time,\" said Tyler.\nHe said he has no idea who would have shot the boy. He is hoping police will make an arrest soon and had a message for whoever was responsible.\n\"You better hope police find you before I do,\" he said.\nPolice are asking anyone with information to come forward.\n\"Now is the time for the community to come together,\" said Ledford.\nCopyright 216 WBTV. All rights reserved."}