{"uri": "http://www.indystar.com/story/news/crime/2016/12/09/indiana-father-charged-toddlers-accidental-shooting/95211434/", "title": "Indiana father charged in child's accidental shooting", "dct": "Fri, 09 Dec 2016 00:00:00 GMT", "id": "a8418ab406c6214c5e71a87a22c27880", "content": "An Indianapolis man faces charges for his role in the accidental shooting of his 4-year-old daughter and her mother.\nMarion County Prosecutor Terry Curry announced charges Friday against 27-year-old Kyle Spivey, according to a news release. Spivey has been charged with neglect of a dependent resulting in serious bodily injury, neglect of a dependent and criminal recklessness.\nProsecutors say Spivey kept a loaded firearm in an area accessible to children, which led to the shooting.\nOn Nov. 13, officers with the Indianapolis Metropolitan Police Department were called to a home in the 1600 block of East 44th Street on reports of a person shot, according to court documents. Officers found an injured 4-year-old girl and an injured 25-year-old woman, later identified as the girl's mother and Spivey's girlfriend.\nSpivey told police he keeps the gun with him or on the dresser in a locking holster. That day, he told police, he put the gun, still holstered, on the dresser while he was on the bed with his girlfriend and two children.\nHe was looking at his phone when he heard a loud \"boom\" and saw one of the children picking up the gun. He took the gun from the child and placed it back on the dresser before noticing that his girlfriend's eyes were closed and there was blood running from the back of her head.\nThe child also was bleeding from her face.\nProsecutors believe Spivey's 2-year-old son grabbed the gun from the dresser and fired it. They think the bullet struck the 4-year-old in the cheek and hit the woman in the back of the head.\nThe 4-year-old was taken to Riley Hospital for Children at IU Health, while her mother was taken into surgery at IU Health Methodist Hospital. Police said she was conscious and alert as she left the home.\nFour other children were home when the shooting occurred, according to the release.\nIn mid-November, investigators were sent a screenshot of a photo that Spivey had posted to his Facebook page the week before the shooting, showing his children holding a gun identified as a Glock 23 .40-caliber, the same kind of gun found in the bedroom the day of the shooting.\nSpivey's initial hearing has not been scheduled.\nCall IndyStar reporter Holly Hays at (317) 444-6156. Follow her on Twitter: @hollyvhays."}