{"uri": "http://myfox8.com/2015/06/18/sc-senator-killed-in-charleston-church-shooting/", "title": "SC Senator killed in Charleston church shooting", "dct": "Thu, 18 Jun 2015 06:02:00 GMT", "id": "61a61cad56daf9855fdd05b7035e4b20", "content": "CHARLESTON, S.C. — One of the victims of the shooting at the Emanuel African Methodist Episcopal Church is Pastor Rev. Clementa Pinckney, according to CNN affiliate WCSC.\nThe affiliate confirmed the information through Elder James Johnson, the president of the Tri-County chapter of the civil rights organization, the National Action Network.\nFamily members said Rev. Pinckney was preaching when he and eight others were gunned down.\nPinckney, who was 42, first answered the call to preach nearly 30 years ago, at the age of 13, according to a biography on the church website.\nAnd he was, it appears, a high achiever all his life. He was first appointed a pastor when he was 18. He graduated from Allen University — magna cum laude, of course. He had been president of the student body as well.\nEbony Magazine included him as one of its “Top College Students in America.”\nNot cynical about politics\nIn 1996, at the age of 23, he was elected to the state House of Representatives, the youngest black person ever elected to the Legislature in South Carolina. Four years later, at the age of 27, he was elected to the state Senate.\nThere, the national recognition of his achievements continued. Washington Post columnist David Broder called Pinckney a “political spirit lifter for surprisingly not becoming cynical about politics.”\nPinckney left a wife, Jennifer, and two children, Eliana and Malana.\nHistory of the church\nThe roots of Emanuel African Methodist Episcopal (AME) Church run deep in Charleston and its history is one of perseverance in the face of racial hostility.\nIt was borne of discrimination, burned to the ground in hate, and rose again.\nNow, a shooting in its basement — where nine of its African-American congregants were killed by a white gunman — is forcing it to once again confront the ugly virulence that blood-stained its past.\nAnd once again, say members of the oldest AME church in the South, they will forge ahead and emerge stronger.\nIn the beginning\nThe congregation first formed in 1791, a coalition of free blacks and slaves. At first they were members of Charleston’s Methodist Episcopal Church. But in 1816, they left their white counterparts in a dispute over burial grounds.\nAt the time, the church was 1,400 members strong. They rallied behind the leadership of a pastor named Morris Brown and organized under the banner of the African Methodist Episcopal Church.\nBurned to the ground\nThe early years of the congregation were fraught with trials as Brown and other ministers of the church were jailed for violating laws that prohibited slaves and free blacks from gathering without white supervision.\nIn 1822, the church was burned to the ground, after plans for a slave revolt were exposed.\nDenmark Vesey, a carpenter who brought himself out of slavery, was the architect. Since he was one of the founders of the congregation, authorities suspected the church was the meeting place for planning the rebellion.\nThe church was torched in retaliation. Authorities arrested 313 alleged participants, and executed 35, including Vesey.\nBorn again\nThe congregation rebuilt the church and met there until 1834 — when all-black churches were outlawed by the state legislature.\nUndeterred, they continued to meet in secret until the end of the Civil War in 1865, when they formally reorganized.\nThey adopted the name ‘Emanuel,’ meaning “God with us.”\nAt the time, the church was a wooden two-story structure, and it was destroyed in an earthquake in 1886.\nOnce again, it rebuilt.\nDuring the civil rights movement of the 1960s, it was a destination stop for many of the leaders, including Martin Luther King Jr.\nToday, the church — with its historic Gothic Revival-style structure and signature steeple — is a fixture in Charleston. With seats for 2,500, it has the largest capacity of any African-American church in Charleston.\nIt was added to the National Register of Historic Places in 1985."}