{"uri": "http://www.sheridanmedia.com/news/wyoming-news79928", "title": "Wyoming News", "dct": "Tue, 30 Jun 2015 03:48:00 GMT", "id": "bc3f26d23ff8086bdf384cfb9d66faa0", "content": "Latest Wyoming news, sports, business and entertainment\nMISSILE SITE POLLUTION\nPublic meeting to cover Cheyenne missile site cleanup plan\nCHEYENNE, Wyo. (AP) - The U.S. Army Corps of Engineers will host a public meeting in Cheyenne to outline proposals for cleaning up groundwater contamination at a former nuclear missile site.\nThe meeting is scheduled for 6-8 p.m. Tuesday at the Cheyenne public library.\nThe former Atlas D missile site 15 miles southeast of Cheyenne was in service for only a few years in the early 1960s.\nTesting has revealed a chemical called trichloroethylene in the groundwater near the missile site. The Centers for Disease Control links TCE exposure to certain kinds of cancer.\nThe U.S. Air Force used TCE to flush out the missiles' parts.\nThe corps' preferred cleanup plan would use bacteria to break down the toxic chemical in the groundwater.\nINFANT MURDER-SUICIDE\nWyoming man kills infant son, self\nCASPER, Wyo. (AP) - A southeastern Wyoming man who authorities say shot his 4-month-old son last week has died of suicide.\nGoshen County Sheriff's Lt. Jeremy Wardell said 53-year-old Duane Sylvester of Lingle died a day after his son died.\nSylvester's wife called 911 shortly before midnight on Thursday and said her husband shot her baby and then himself. Wardell says the baby died at the scene.\nGoshen County officials say Sylvester was taken to Regional West Medical Center in Scottsbluff, Nebraska, where he died on Friday.\nThe shooting is still under investigation.\nCASPER PLANE CRASH\n3 victims in crash at Casper airport identified\nCASPER, Wyo. (AP) - Authorities have identified all three people aboard the single-engine plane that crashed at the Casper airport.\nThe Casper Star-Tribune reports Casper residents, Peter Wold, Lon Whitman and Joe McGuire, suffered injuries but are expected to fully recover from Saturday's crash at the Casper/Natrona County International Airport.\nFamily members say Wold, a top player in Wyoming's oil and gas industry, suffered a broken vertebra. Whitman, an oil and gas consultant, had a sore knee and ankle and a couple of broken ribs. McGuire, an attorney, suffered a broken clavicle and a sore jaw.\nThe plane had reached an elevation of about 100 feet before hitting the ground west of the runway.\nThe crash is being investigated by the National Transportation Safety Board and the Federal Aviation Administration.\nCHEYENNE SHOOTING\nMan accused of killing ex-girlfriend gets mental evaluation\nCHEYENNE, Wyo. (AP) - A man accused of killing his ex-girlfriend and shooting her boyfriend has been ordered to undergo a mental evaluation.\nThe Wyoming Tribune Eagle reports the attorney for 26-year-old Daniel Guajardo filed a motion Thursday asking that his client receive a competency evaluation. A Laramie County Circuit Court judge signed an order later that day, sending Guajardo to the Wyoming State Hospital for no more than 30 days of treatment and evaluation.\nProsecutors say Guajardo fatally shot 26-year-old Janessa Spencer after breaking into her Cheyenne home in April. Her boyfriend, 24-year-old Samuel Cook, survived a gunshot wound to the back.\nGuajardo has been charged with first-degree murder, attempted first-degree murder and aggravated burglary. He could face the death penalty.\nThe hospital will decide whether Guajardo is fit to stand trial.\nHOSPITAL CRASH CASE\nSentencing set for Casper teen convicted in fatal crash\nCASPER, Wyo. (AP) - A sentencing date has been set for the 18-year-old Casper woman who pleaded guilty to killing her two passengers after she crashed into a local hospital.\nThe Casper Star-Tribune reports a judge will decide Jessica Carnline's sentence July 10 in Natrona County District Court. In April, Carnline pleaded guilty to two counts of aggravated vehicular homicide for killing Brandon Avery and Amanda Strickland Sept. 21.\nCarnline had been 17 at the time of the crash, but prosecutors have charged her as an adult.\nOfficials say Carnline had been driving 76 mph when she struck a concrete sign in front of Wyoming Medical Center. The defendant told police she had inhaled air duster before the crash which caused her to pass out.\nCarnline faces up to 16 years in prison.\nGRAND TETON VISITORS\nMore visitors coming to Grand Teton park\nJACKSON, Wyo. (AP) - Grand Teton National Park logged nearly 425,000 visitors through the first five months of 2015.\nThat is a 12 percent increase compared with numbers from a year ago and puts Grand Teton parks on pace for another record visitation year.\nDiscounting commercial truck traffic and the like, Grand Teton had 424,725 recreational visitors from the start of the year through May.\nThe busiest months are yet to come. In an ordinary year it's July, then August followed by June and September that see the most visitors.\nGrand Teton park spokeswoman Jackie Skaggs tells the Jackson Hole News & Guide that the greater number of visitors seem to be due to the strong economy, favorable gas prices, nice weather, early snowmelt and an influx of Asian tourists.\nRABBIT BREEDING BOOM\nCheyenne sees boom in rabbit population\nCHEYENNE, Wyo. (AP) - The number of rabbits in Cheyenne has skyrocketed, which has caused growing concern among homeowners who have trouble keeping the animals away from their yards.\nThe Wyoming Tribune Eagle reports Bob Fecht with the Cheyenne Animal Shelter says the recent spike in rabbits is partly due to a reduced number of foxes. Fecht says a disease that hit the fox population in recent years led to their decline in Laramie County.\nCheyenne resident, John Brourink, says rabbits have eaten his garden and disturbed his dogs in recent weeks.\nBut Fecht says pesky rabbits can be dealt with. He says the shelter lends out cages that can trap the animals and then they can help relocate them.\nHunting season for cottontail rabbits starts Sept. 1.\nCOLSTRIP-FUTURE\nCoal plant operator says Colstrip remains profitable for now\nBILLINGS, Mont. (AP) - The spinoff of the company that runs Montana's largest power plant is raising questions about how long the plant can keep going, as pollution control costs rise and coal's share of the electricity market crumbles.\nBut its new operator says there are no plans to shut down the 2,100-megawatt Colstrip Steam Electric Station. Talen Energy spokesman George Lewis said the coal-fueled plant remains a \"solid performer\" that still delivers profit.\nAnalysts at financial firm UBS say it would make sense to retire at least two of Colstrip's four units rather than spend many millions of dollars on pollution controls.\nColstrip serves customers across the Pacific Northwest. It's located in the Powder River Basin of Montana and Wyoming, home to some of the largest coal mines in the world."}