{"uri": "http://fox5sandiego.com/2016/11/13/1-dead-others-injured-in-city-heights-shooting/", "title": "2 dead, others injured in City Heights police shooting", "dct": "Sun, 13 Nov 2016 21:49:00 GMT", "id": "f8c037f4b1dc50b60a598e076d8b062f", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nSAN DIEGO -- A gunman who fatally shot one person and wounded three others, including a woman he took hostage following a fight outside a City Heights apartment building, was shot and killed by police, authorities said Monday.\nOfficers were initially sent to an address in the 3800 block of Marlborough Avenue near Wightman Street around 9:15 p.m. Sunday to investigate multiple reports of a disturbance in which someone was armed with a gun.\nSan Diego police Capt. Brian Ahearn told reporters that the suspect was involved in a fist fight and immediately afterward retrieved a gun from a parked car, chased a man around, then opened fire on several people in the courtyard of an apartment complex.\nFour people were shot. Some suffered graze and abdominal wounds, and one person was shot in the head, authorities said.\nArriving officers came upon the suspect holding a wounded woman in a headlock and dragging her toward the passenger side of his vehicle, Ahearn said. The suspect was told to drop his weapon, but he instead pointed it at the hostage and made statements indicating he would hurt her, officers or both, which prompted an officer to fatally shoot him.\n“This was very, very complicated,'' Ahearn said. “The officers were faced with a complex situation with an armed suspect who had already shot multiple victims and had taken a victim hostage.''\nThe suspect died at the scene, police said.\nFour people were taken to local hospitals to be treated for bullet wounds, and one later died, San Diego police Lt. Mike Holden said. Their names and that of the suspect were withheld pending family notification.\nOne neighbor who did not want to be identified, said the man came by the apartment where his ex-wife lived, and tried to take her with him, but her parents and grandfather intervened.\nMoments later they were shot along with the ex-wife whose mother is said to have died at the hospital according to unidentified neighbor.\nThe officer who shot the suspect has worked for the San Diego Police Department for 12 years, Holden said. He was not injured.\nNo other information was provided."}