{"uri": "http://theadvocate.com/news/12479079-123/caretaker-booked-after-8-year-old-shoots", "title": "17-year-old paralyzed from waist down after 8-year-old brother shoots him with rifle; Baton Rouge-area caretaker arrested", "dct": "Thu, 28 May 2015 04:38:00 GMT", "id": "2007ab365f9f908137ddd1abf0fd575c", "content": "An 8-year-old boy shot his 17-year-old brother as the teen was playing a video game in a Gardere area home last week, and sheriff’s deputies on Tuesday arrested the adult who was supervising the child at the time of the shooting.\nThe arrest of Robert Deishawn Payne, 23, occurred more than a week after the child shot his older brother, shattering the teen’s spine and paralyzing from the waist down, according to the East Baton Rouge Parish Sheriff’s Office.\nPayne picked up the brothers — it wasn’t clear if they were related to Payne — from their home outside of East Baton Rouge Parish on May 15, a Sheriff’s Office report says. Payne then took them to his Rose Garden Drive home, where they were scheduled to spend the weekend.\nOn Sunday, May 17, Payne was cleaning a .22-caliber rifle while the brothers played a video game, the Sheriff’s Office report says. At some point, the 8-year-old lost interest in the game and began watching Payne handle the gun. Payne showed the boy how the rifle worked, ejected the weapon’s magazine and placed the gun and ammunition on a bed, the report says.\n“Payne then picked up the video game controller vacated by the minor, abandoned his supervision of the minor in the presence of the firearm, and focused his attention on playing the video game,” the report says.\nWhile Payne and the teen played the game, the 8-year-old picked up the gun, inserted the magazine — as demonstrated by Payne — and “negligently fired the weapon” at the teen, the report says.\nNo one answered the door at Payne’s home Tuesday evening.\nPayne, of 2565 Rose Garden Drive, Baton Rouge, was booked into Parish Prison on Tuesday afternoon on counts of child desertion and negligent injuring."}