{"uri": "http://wwlp.com/2016/07/17/investigation-of-weekend-shooting-in-chicopee-now-a-homicide-investigation/", "title": "Weekend shooting in Chicopee now homicide investigation", "dct": "Sun, 17 Jul 2016 15:21:00 GMT", "id": "8b6b9d6f72753bf15aca75559d074652", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCHICOPEE, Mass. (WWLP) – Hampden District Attorney Anthony Gulluni confirmed Sunday the shooting incident on Boucher Street is now an active homicide investigation.\nOn Saturday, July 16, at approximately 12:53 p.m.. the Chicopee Police Department responded to 120 Boucher Street in Chicopee for the report of a disturbance.\nUpon arrival, officers discovered a male victim who was later determined to be fifteen years old, with an apparent gunshot wound to the chest. The victim was transported to Baystate Medical Center.\nChicopee Police requested the assistance of the Massachusetts State Police Detective Unit. Members of the SPDU and the Hampden District Attorney’s office responded to the scene.\nThrough the initial investigation, detectives were able to determine the victim and a friend were consuming alcohol at a near-by home. The investigation indicated that the two friends were apparently confused while walking in the neighborhood.\nShortly after their arrival, the homeowner was alerted to their presence and retrieved his firearm. He then went to his door and where he attempted to communicate with the victim. When a pane of glass broke, the suspect fired a single shot.\nLater on Saturday, the victim passed as a result of the gunshot wound.\nHampden District Attorney Anthony Gulluni stated, “This was a tragic and avoidable incident that resulted in a young man losing his life. My sympathy and thoughts are with the victim’s family and friends. I would like to thank the members of the Massachusetts State Police Detective Unit assigned to my office as well as the Chief of the Office’s Homicide unit , Assistant District Attorney Eduardo Velazquez for their immediate response and professional investigation into this unfortunate incident, which has resulted in the arrest of a suspect.”\nArrested was Jeffrey Lovell, 42, of Chicopee Mass. He will be arraigned in Chicopee District Court on Monday on charges of murder.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}