{"uri": "http://www.sltrib.com/news/4090657-155/midvale-shooting-brother-sister-dead-one?fullpage=1", "title": "Midvale shooting: Brother, sister dead; one suspect in custody, second on loose", "dct": "Thu, 07 Jul 2016 06:57:00 GMT", "id": "c0e818b92133d6c3fe1adc0324126dc4", "content": "Bell said UPD officers, responding to a 911 call reporting shots fired, learned that a man and two other suspects had confronted the girl just outside her ground floor apartment over an as-yet-still-unclear disagreement.\n\"It apparently involved a T-shirt, or shirt, money owed, or missing property,\" Bell said, noting that the genesis of the dispute was still under investigation.\nAt some point, what had been a verbal argument became physical, with one of the men pushing the girl. \"Her brother saw that and came out to her aid with a small knife; someone in the group opened fire,\" Bell said.\nAbril Izazaga was \"killed right in front of her apartment window, and her brother fell on top of her,\" Bell added.\nThe suspects fled, but several witnesses in the close-knit, predominantly Latino complex were able to provide detectives with good leads.\nOne person surrendered early Thursday — an 18-year-old man, who was subsequently released from police custody.\nA second man, who police believe is the shooter, was taken into custody about 5:30 p.m. Thursday.\nThat man, Mario Cervantes-Angel, 28, of Mexico, remained in custody on Friday at the Salt Lake County jail, where he was being held without bail on suspicion of aggravated murder.\n\"It was quite a sad scene last night,\" Bell said Thursday. \"There were a lot of people out crying and hugging each other.\"\nThat \"sad scene\" continued Thursday, as family members constructed a memorial for the two teenage siblings, with candles in the shape of a cross, a picture of Abril, a teddy bear, shoes and flowers.\nMariano Izazaga, one of the teens' older brothers, believed his siblings not only knew their killers but thought of them as friends. He said they opened fire on his little brother and sister \"over a shirt.\"\n\"I just can't comprehend that,\" he said. \"Something that's replaceable, you know? Something that gets thrown out after some time.\"\nThe two had \"big hearts,\" family members said. Their sister-in-law Tilaima Lomu said she'll remember them as \"happy, very loud, cheerful\" people, two of the three youngest of nine siblings.\nAbril Izazaga was \"so smart,\" Lomu said, frequently bringing home A's from Hillcrest High School.\n\"She just had her quince [quinceañera] last year,\" Lomu said. \"Jose was going to turn his life around.\"\nJose Izazaga had been shot before, Lomu said, and she believed that on Wednesday night, Abril tried to protect him from that happening again.\nTheir grandmother, Guillermina Serrano, said in Spanish that the two teens were good, respectful children, as she sobbed alongside family members.\nTheir mother's cousin, Marisol Salinas, said in Spanish while fighting back tears that when her own son died, Jose Izazaga made her feel loved, like she wasn't alone. On her son's birthday, she said these teens were always the first ones there.\nShe said God is the only one who knows what happened Wednesday night, but she hopes justice will be served for the person who shot her family members, so no one else will be hurt.\nThe children's mother, Salinas said, has been torn up about the whole thing, and did not want to speak to media outlets Thursday.\nUPD said that anyone wishing to donate to the family may do so at any Wells Fargo Bank, under an account called: Benefit Memorial Fund for Abril Izazaga and Jose Izazaga."}