{"uri": "http://www.wkyt.com/content/news/Sheriff-3-people-dead-in-Whitley-County-410710535.html", "title": "Sheriff: 3 people dead after shooting in Whitley County", "dct": "Sun, 15 Jan 2017 17:50:00 GMT", "id": "35e619caea555d1849311cf8ce483e9c", "content": "WILLIAMSBURG, Ky. (WKYT) - Kentucky State Police is investigating a situation that left three people dead and another person injured in an officer-involved shooting.\nIt happened just after 10 p.m. Friday night in the Savoy community just off U.S. 25W near Williamsburg.\nWhitley County Sheriff Colan Harrell confirms to WKYT that the victims are Larry Taylor and his two children, 18-year-old Jessie Taylor and at 13-year-old.\nInvestigators believe the victims were shot in their beds.\n\"There was no struggle. They were all shot in the head,\" Whitley County Sheriff Colan Harrell said.\nSheriff Harrell told WKYT that a relative came over to the home after not hearing from the family. Once learning what had happened, that relative then called 911.\nDeputies came to the house and found Taylor's wife, Courtney Taylor.\nShe had a pitstol in her hand,\" Sheriff Harrell said.\nThe sheriff says Taylor pointed the gun at a deputy.\n\"He repeated put down the weapon, she didn't, and he fired,\" Sheriff Harrell described.\nCourtney Taylor was injured after being shot by a Whitley County sheriff's deputy, according to Harrell. Kentucky State Police say she pointed a gun at the deputy, before she was shot. We're told after two surgeries, she's in stable condition at UK Hospital.\nPolice say charges will be filed against Courtney Taylor.\nSheriff Harrell says the shooting has been hard on the deputies and people in the community, as they try to wrap their minds around what officials say went down.\n\"You try to put a place for things in your life, in someone elses life, especailly if they're close to you and this is something that would be hard to do,\" he said.\nKentucky State Police is continuing the investigation.\nThe sheriff also tells WKYT that Larry Taylor is the son of former Whitley County judge-executive Jerry Taylor."}