{"uri": "http://www.thetowntalk.com/story/news/local/2015/01/05/man-dead-after-accidental-shooting-in-alexandria/21285125/", "title": "Victim ID'd in Alexandria accidental shooting", "dct": "Mon, 05 Jan 2015 00:00:00 GMT", "id": "d9a352b8bf8131af7c9885e1e8ff9ace", "content": "Alexandria's first homicide of 2015 was an accidental shooting that prompted Chief Loren Lampert to stress that \"firearms are neither toys nor entertainment.\"\nAlexandria police were called to a house in the 2500 block of Culpepper Drive on Sunday because of a reported shooting. When they arrived, they found a wounded 29-year-old man.\nThe victim, 29-year-old Raymond Weston of Alexandria, was taken to a local hospital, where he died.\nAnother man at the house, 29-year-old Kendall Smith, was arrested at the scene. \"The investigation found that this incident was accidental when a firearm Smith was playing with discharged,\" reads the release.\nSmith was booked into the Rapides Parish Detention Center and was charged with negligent homicide.\nLampert, in a statement, called it a \"horribly tragic, yet completely avoidable incident where a young member of our community lost his life due to friends or family members recklessly handling a firearm.\"\nAnd some people learning about the shooting from The Town Talk's Facebook page expressed shock at the news. \"Tell me this a lie,\" wrote one man.\nLampert recalled another such incident from September that resulted in the death of a 15-year-old boy.\nIn that shooting, police determined that the boy was shot accidentally when \"the firearm unintentionally discharged while being recklessly handled,\" read the release at that time.\nThe boy died at the Richmond Drive residence, and police charged 17-year-old L'Darius Hicks of Alexandria with negligent homicide.\nThen, two months later, an Alexandria man died in another accidental shooting after another hunter fired at him, mistaking him for a deer.\nThat case was handled by the Rapides Parish Sheriff's Office. In that shooting, which happened in the 400 block of Twin Bridges Road, 37-year-old John Michael Haynes was pronounced dead at the scene.\nNo charges were filed.\nLampert appealed to people to be careful and follow firearm safety tips when handling weapons.\n\"It is important that we all remember that firearms are neither toys nor entertainment. Unlike the popular video games where you get multiple lives when fatally wounded, real guns shoot real bullets that can make you real dead,\" he said. \"Please treat all firearms as if they are loaded, always keep the muzzle pointed in a safe direction, keep your finger off of the trigger until it's time to shoot, and practice safe handling at all times.\""}