{"uri": "http://www.myfoxaustin.com/story/28843066/toddler-dies-from-gunshot-wound-in-killeen-father-facing-manslaughter-charge", "title": "Killeen father faces manslaughter charge after toddler dies from gunshot wound", "dct": "Mon, 20 Apr 2015 04:13:00 GMT", "id": "4d04413a335d1163fc501d422811f88c", "content": "A three-year old child in Killeen has died from what police believe to be a gunshot wound. They are now investigating, trying to figure out exactly what happened.\nBrandon Henderson says after all the time he's lived on Del Mar Ct., nothing could've prepared him for what he saw Saturday afternoon.\n\"I pulled in my driveway and when I got out of the vehicle, I noticed that the ambulance was already here and that they had what looked like an empty stretcher. When I looked over I seen there was a small child on the stretcher.\"\nKilleen police say just after Noon Saturday they arrived at the home to find a child suffering from a gunshot wound.\n\"When the paramedics arrived they got her up and immediately transported her to the Metroplex Hospital where she succumbed to her injuries,\" said Carroll Smith, Killeen Police Dept.\nHenderson says he did not expect something like this to happen so close to home.\n\"Neighbors were pretty quiet for the most part they were out working on their vehicles or whatever else,\" said Brandon Henderson, neighbor.\nPolice have charged the father, 27-year-old Ashton Blake Salvato, with manslaughter. He's being held on $1 million bond. It is unclear right now how the girl was shot or if it was an accident or intentional.\n\"Anytime a child is involved in anything it's a very big shock. It's just a shame,\" said Smith.\nThe investigation is still in the early stages. Police are not releasing the name of the girl at this time, but neighbors like Henderson say they can only imagine what those who loved this three-year-old child are going through.\n\"If it were my child I'd be devastated,\" said Henderson.\nHenderson says as he saw Salvato being carried out in cuffs and he thought he heard Salvato say, \"I should have left it alone.\""}