{"uri": "http://www.seattletimes.com/seattle-news/3-who-died-in-shooting-at-auburn-tavern-were-friends/", "title": "3 who died in shooting at Auburn tavern were friends", "dct": "Mon, 01 Apr 2013 06:14:00 GMT", "id": "4e64a2b454c3736a24f04b505c499045", "content": "The three men who died in an eruption of gunfire outside a popular Auburn sports bar early Easter morning were friends who frequently hung out together, according to mourners gathered outside the crime-scene tape Sunday.\nThe men were killed, and a fourth man critically injured, when several people pulled handguns and began firing after an argument in the parking lot as the Sports Page tavern was closing around 1:30 a.m., said Auburn police Cmdr. Mike Hirman.\nAnother man was detained and questioned about his involvement, Hirman said. Later in the day, he was arrested on suspicion of an unrelated weapons violation but remained a person of interest in the shooting incident as investigators sorted through a large amount of information, Hirman said.\nThe police commander said as many as 50 people were milling around when an argument between several men, mostly in their 20s, escalated into a gunfight.\nPlay VideoPlayMuteCurrent Time 0:00/Duration Time 0:00Loaded: 0%Progress: 0%Stream TypeLIVERemaining Time -0:00Playback Rate1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptionsAudio TrackFullscreen\nThis is a modal window.\nCaptions Settings Dialog Beginning of dialog window. Escape will cancel and close the window. Text Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps Defaults Done\nBy midmorning Sunday, several grieving family members and friends had gathered near the parking lot of the strip mall where the tavern is located on Auburn Way North. The sheet-draped bodies were visible between the police cars as detectives moved through the crime scene.\nAccounts from those on the scene about what led to the shooting differ, although most seem to agree that it began when someone fired a shot into the air and several other people began shooting.\n“Some sort of dispute erupted — you know, over a girl or words or something, and somebody started shooting and then somebody else started shooting,” Hirman said. “Young men, alcohol and guns is a bad combination.”\nThat dispute started inside the bar when a woman became angry that another woman was dancing with her boyfriend, Hirman said. It then moved outside and escalated, he said.\nHirman said two groups were involved in the incident — one that went to the bar to celebrate a birthday and another that arrived together. But some people from both groups knew one another, he said.\nDetectives recovered several handguns from the crime scene, though there might have been additional weapons, Hirman said, adding that as many as a dozen people may have been involved in the fight.\nHirman said police talked to a number of eyewitnesses and were still trying to sort out what happened.\n“There were so many people there and so many involved,” Hirman said. “There were probably 50 people there, and everyone saw something different. One thing we know we have is guns and drinking.”\nBernice Buchanan, of Des Moines, said her son Lorenzo Duncan, 23, was one of the three who died. The distraught woman said her son was a “loving, caring, loving Christian guy.”\nDuncan was the peace maker when his friends started arguments, according to Buchanan and Larry Duncan, the victim’s father.\n“When I say he was respectful, that’s without question because that’s the way I raised him,” Buchanan said.\n“And for me to know that I’ll never hear his voice again” breaks her heart, she said.\nHis father said, “It’s hard to express how much we’ll miss him. This seems like a nightmare.”\nPolice had not identified any of the victims officially, pending reports from the King County Medical Examiner. The Seattle Times was withholding the identities of the other victims pending official word or confirmation by their families.\nOne man using the street name “Fast,” who otherwise wouldn’t identify himself, said he and Lorenzo Duncan patronized the Sports Page every weekend.\nHis wife said they had left the bar before the shooting began and from their home nearby heard the police sirens.\nShe said there have been fights at the bar in the past. “If someone had a beef with someone else, they know they’ll see them at the bar the next week,” she said.\nThe youngest of the three men who died had just turned 21 and was able to legally go to the tavern, his friends said.\nLaneisha Robinson, 20, who went to school with him, said through tears, “I couldn’t even stay in church this morning. It was hard to see everyone happy when I’m not.”\nLorenzo Duncan, she said, had a way of making people laugh.\nRobinson said the third victim was a personal-fitness trainer with two children. “I never would have seen this coming,” Robinson said.\n“My generation, everybody wants to just shoot rather than just work things out,” she said. “Now three men are dead.”\nHirman said the parking lot was mayhem when the shooting stopped. The fourth shooting victim, who is in his late 30s, was thrown into the back of a car and rushed by friends to Auburn Regional Medical Center. He was later transferred to Harborview Medical Center in Seattle, where he remained in “very serious” but stable condition with multiple gunshot wounds, Hirman said late Sunday.\nHirman said one bullet-riddled car was found in Kent and another in Federal Way. Those vehicles were impounded. Several other cars connected to the incident also were impounded at the scene.\nBy late Sunday, no formal charges had been filed against anyone. “We’ve been in touch with the prosecutor and trying to make the right decision when it comes to charges, Hirman said. “We need to ask a lot more questions first.”\nSeattle Times staff reporter Steve Miletich contributed to this story.\nLornet Turnbull: lturnbull@seattletimes.com or 206-464-2420."}