{"uri": "http://www.kcra.com/article/teen-id-d-as-suspect-killed-by-deputies-in-carmichael/6429231", "title": "Teen ID'd as suspect killed by deputies in Carmichael", "dct": "Tue, 21 Jun 2016 02:38:00 GMT", "id": "283f43db330113ab6e174e655eec7249", "content": "Officials: 17-year-old reversed toward officers before shooting\nCARMICHAEL, Calif. (KCRA) —\nA 17-year-old was identified Monday as the suspect who was shot and killed by deputies after a car chase over the weekend, officials said.\nThe teen was identified as Sergey Makarenko of Sacramento by the Sacramento County Coroner's Office on Monday.\nA Sacramento County sheriff's deputy tried to pull over an erratic driver, later identified as Makarenko, about 11 p.m. Saturday near El Camino and Walnut avenues, but the driver sped away, reaching speeds up to 60 mph during a four- or five-minute pursuit through a residential area, officers said.\nThe chase ended at a dead end on Horton Lane, south of Sutter Avenue.\nFour deputies got out of their car and told Makarenko to get out of his vehicle, but instead, he put his car in reverse and began to accelerate, according to the sheriff's department.\nOne deputy fired at the car when Makarenko began to accelerate in reverse toward officers, officials said.\n\"That's a two ton weapon. It can hurt officers and kill officers. Having that fear in mind the officer discharged his firearm,\" sheriff's department spokesperson Tony Turnbull said. \"Unfortunately, you have to make that decision at that point in time.\"\nMakarenko was pronounced dead at the scene.\nNeighbor Tammie Vitto saw and heard the commotion unfold in front of her house.\n\"Pop, pop, pop, pop. And, I was standing at the window and could see the officers with their guns drawn,\" Vitto said. \"There was no way he could get out of here at all.\"\nThe deputy involved in the shooting is a 12-year veteran of the department and was placed on paid administrative leave in accordance with the sheriff's department policies.\n\"I feel bad for the officer too having to carry that with him forever, knowing that his gun took the life of a child,\" Vitto said. \"It's sad all the way around.\"\nA toxicology report is pending for the cause of Makarenko's erratic driving prior to the pursuit."}