{"uri": "http://www.wral.com/fort-bragg-soldier-charged-with-murder-in-connection-to-saturday-shooting/15585727/", "title": "Soldiers, friends: One shot, one charged with murder", "dct": "Mon, 21 Mar 2016 00:00:00 GMT", "id": "2258bc32f595aade9a6bd20c52aaf181", "content": "Video Playback Not Supported\nPlay Video\nPlay\nMute\nCurrent Time 0:00\n/\nDuration Time 0:00\nLoaded: 0%\nProgress: 0%\nStream TypeLIVE\nRemaining Time -0:00\nPlayback Rate\n1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptions\nFullscreen\nAutoplay:\nOn / Off\nThis is a modal window.\nThis video is not supported on your platform. Please make sure flash is installed.\nCaptions Settings Dialog\nBeginning of dialog window. Escape will cancel and close the window.\nText Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps\nDefaults Done\nInvestigation continues in shooting death of Bragg soldier\nAre you still watching?\nYes, ContinueNo\nFayetteville, N.C. — The alleged shooting death of one paratrooper by another Saturday night stunned neighbors who said the two men were close.\nRyan Daniel Walker, 24, and Myles David Penix, 27, were members of the 82nd Combat Aviation Brigade at Fort Bragg and were friends in the unit and on social media.\nBoth were at a party at Penix's house and the one next door Saturday in the Lands End complex off Morganton Road.\nOn Monday, Walker faced a Cumberland County judge, charged with the murder of his friend.\nJust before midnight on Saturday, police were called to the scene of what was described as an accidental shooting.\n\"When officers arrived on scene, the victim was discovered on the floor of the living room with a single gunshot wound to the chest,\" police investigator Laura Downing told the court.\nThe investigation quickly identified Walker as the suspected shooter.\n\"There was some alcohol involved during these parties that may have played a factor into this,\" Downing said. \"We're still looking into that.\"\nNeighbor Tammi Scarborough said Penix had a wife and young child.\n\"We always speak,\" she said. \"I've seen him and his wife and the baby.\"\nPenix was originally from California and had served in the Navy before joining the Army, according to a statement released after his death."}