{"uri": "http://www.dnainfo.com/chicago/20150928/back-of-yards/11-month-old-four-others-shot-back-of-yards-police", "title": "Gunman Fires on Innocent Family, Killing Mom And Grandmother, Wounding Baby", "dct": "Mon, 28 Sep 2015 20:06:00 GMT", "id": "5a8c7a1f2235f5997ecca0bf42febc39", "content": "CHICAGO — An innocent family coming home from an outing was ambushed by at least one shooter Monday night, leaving a mother and a grandmother dead, and an 11-month-boy and two men wounded, police said.\n\"In a second, two generations of that child's family were wiped out. That's an important message to get out,\" Chicago Police Deputy Chief Eugene Roy said at a news conference at the scene of the Back of the Yards shooting.\nRELATED: After Chicago Family Gunned Down, How Do You Tell A Child His Mom Is Dead?\nThe 11-month-old was \"stable\" at Stroger Hospital after being taken there by an officer on the scene, according to Officer Nicole Trainor, a Chicago Police spokeswoman. He was shot in his torso.\nHis aunt cradled the screaming boy in her arms as the officer rushed him to Stroger in a squad car, Fox Chicago reported.\nThe family had just returned home from an outing, Roy said.\nFive family members got out of their car outside the home: the 11-month-old, his mother, his grandmother and two men.\nA shooter pulled up in a car and opened fire on the group, hitting all five and killing both women, Roy said.\n\"You have an innocent family coming home from a family outing, and somebody opens fire on two women, a child and two adults,\" Roy said. \"Coming home from a family outing, that's important. This family was attacked by unknown individuals.\"\nThe 7:10 p.m. shooting happened in the 5300 block of South Aberdeen Street, police said.\nNo one was in custody, and police said they don't have a motive yet.\n\"We're looking at all possible motives for this attack,\" police said.\nThe infant's mother, who was 24, was shot in her torso, and the grandmother, who was 46, was shot in her thigh, said Officer Ana Pacheco, Chicago Police spokeswoman. They were taken to Stroger Hospital, where they were pronounced dead.\nA 25-year-old man was shot in his torso and a 24-year-old man was shot in his thigh and calf, Pacheco said. They were taken to Mount Sinai Hospital, where their condition was \"stable,\" Pacheco said.\nNo one was in custody.\nFor more neighborhood news, listen to DNAinfo Radio here:"}