{"uri": "http://jacksonville.com/news/crime/2016-03-08/story/woman-tells-putnam-county-deputy-son-4-shot-her-back-while-she-was", "title": "Woman tells Putnam County deputy that son, 4, shot her in back while she was driving", "dct": "Thu, 10 Mar 2016 16:22:00 GMT", "id": "f326485d6bbbe73f1c320d075424f5e6", "content": "A gunshot fired from inside a pickup truck in Putnam County went through the driver’s back and out the front of her torso Tuesday afternoon. When a deputy asked the injured woman what happened, she said her 4-year-old son did it. Less than a day earlier, a Facebook post, which may belong to the victim, talked of letting a 4-year-old boy shoot targets.\nThe deputy noticed the woman behaving frantically inside the four-dour pickup truck at Florida 20 and Rowland Avenue just after 3 p.m. and he quickly realized she had been shot, Capt. Joseph Wells said.\nThe woman told the deputy her 4-year-old son accidentally shot her while he was sitting in the back seat.\nA handgun was found on the floor in the back of the vehicle and there didn’t appear to be any bullet entry points on the exterior of the truck so Wells said the shot was most likely fired from inside.\nThe mother, identified as 31-year-old Jamie Gilt of Jacksonville, and her son were the only ones inside the truck and the boy was unharmed, according to the Putnam County Sheriff’s Office.\n“She was shot through the seat and the round went through her back,” Wells said of the bullet that went through Gilt’s body.\nThe truck, which had a horse trailer attached to the back, was parked partially in the travel lane of Florida 20, Wells said.\nFamily members later told authorities the two were on their way to pick up a horse from the woman’s sister when the shooting happened.\nWells said Gilt and her son were less than a mile from her sister’s home where they were going to pick up the horse when she was shot.\n“There was a booster seat in the back of the vehicle, but however the boy was not strapped in when the deputy got to them,” Wells said.\nHe said investigators are trying to determine whether the child was fastened to the booster seat at the time of the shooting.\nA public Facebook account for a woman named Jamie Gilt who lives in Jacksonville and is from Palatka features various pictures of horses and pro-gun messages. Another Facebook page is called “Jamie Gilt for Gun Sense.”\nOne post, shared on the Jamie Gilt page Sunday, shows an image of two burglars breaking into a home with a message below saying guns are not the answer, but calling 911 is. In disagreement, Gilt shared the photo and commented that the criminals might change their plans if they knew they were going to get killed.\nThe post included other comments in a discussion that defended the right to carry guns.\n“Thanks. All of ours know how to shoot too. Even my 4-year-old gets jacked up to target shoot the .22,” Gilt responded Monday evening on Facebook after someone commented on the post.\nIt’s unclear if the Facebook account belongs to the woman who was shot Tuesday or if the 4-year-old referenced in the post is Gilt’s son, but Wells said the gun found in the pickup truck after Tuesday’s shooting was a .45-caliber handgun.\nGilt was taken to a hospital in stable condition and the boy is in the custody of family members, Wells said. He said the Department of Children and Families has been contacted but the shooting is being investigated as accidental.\n“We’re satisfied that this is not a criminal shooting,” Wells said.\nInvestigators are still trying to determine how the boy got the gun and who it’s registered to, Wells said.\nHe said no charges have been filed yet but authorities will work with the State Attorney’s Office to determine if Gilt will be charged depending on how the boy obtained the weapon.\n911 recordings\nCall 1:\nYour browser does not support audio, but you can download the mp3 file here: http://static.jacksonville.com/files/audio/03102016-PCSO911-JamieGiltShooting-A.mp3\nCall 2:\nYour browser does not support audio, but you can download the mp3 file here: http://static.jacksonville.com/files/audio/03102016-PCSO911-JamieGiltShooting-B.mp3\nCall 3:\nYour browser does not support audio, but you can download the mp3 file here: http://static.jacksonville.com/files/audio/03102016-PCSO911-JamieGiltShooting-C.mp3\nCall 4:\nYour browser does not support audio, but you can download the mp3 file here: http://static.jacksonville.com/files/audio/03102016-PCSO911-JamieGiltShooting-D.mp3\nJoe Daraskevich: (904) 359-4308"}