{"uri": "http://abc7chicago.com/news/2-killed-2-shot-in-back-of-the-yards;-witness-suffers-fatal-asthma-attack/1446695/", "title": "2 killed, 2 shot in Back of the Yards over parking spot, source says", "dct": "Thu, 28 Jul 2016 00:00:00 GMT", "id": "233e1e20ab0e722fbbbf2448391278c4", "content": "CHICAGO (WLS) --\nTwo people are dead and two others were wounded in a shooting at a South Side block party overnight. The mother of one of the victims said her son was killed over a parking space.\nDuring the melee, as people ran for their lives, a 16-year-old girl hyperventilated and had an asthma attack at the scene. She was rushed to St. Bernard but was pronounced dead at 2:05 a.m. The Cook County Medical Examiner's Office identified her as Jessica Williams, of the 12000-block of South State Street.\n\"I'm going to miss everything about her,\" said Destiny Williams, Jessica Williams' 14-year-old sister.\nA group of around 100 people gathered in the 800-block of West 50th Place in Chicago's Back of the Yards neighborhood around 12:20 a.m. Thursday to celebrate the life of a man who was killed in a gang shooting in 2012.\nNeighbors said the overnight shooting was petty and unnecessary.\nA source said 25-year-old Denzel Childs was the aggressor, who wouldn't let a few girls save the spot for a friend. The source said during an argument, he took out a gun and started shooting at them until an unknown person killed him.\n\"Some other guy just walked up to him, pulled his gun out and just fired five shots into him,\" said Curtis Singleton, a neighbor.\n\"I'm still numb. I can't believe it. I mean why? Why couldn't you just move your car? If somebody's got to park, why can't you just drive on by?\" said Paula Griffin Golden, Childs' mother.\nPolice said four people were shot. A 34-year-old woman was shot in the neck and rushed to St. Bernard Hospital, where she was pronounced dead, police said. She was identified Thursday afternoon as Kayana Q. Armond of the 10900-block of South Vernon in Chicago.\nChilds suffered several gunshot wounds to the neck, hand and chest, police said. He was transported to Stroger Hospital, where he was pronounced dead.\nA 25-year-old woman was shot twice in the back, police said. She was taken to Stroger, where her condition stabilized.\nA 21-year-old woman, identified by her mother as Jaccarra Reeves, was shot in the left hand, police said. She was taken to St. Bernard, where an x-ray showed the bones in her hand were shattered. Her mother, Deborah Reeves, was furious.\n\"These people were people. These were lives. You talking about a parking spot? A parking spot? My daughter. My daughter's hand has to be reconstructed and we talking about a parking spot?\" Reeves said. \"I'm actually blessed. I'm standing here blessed that my daughter is only having hand surgery when everybody else is shot in the back, neck. They dead. A parking spot?\"\nPolice said Childs and the 25-year-old woman were documented gang members, and a witness was not cooperating. Area Central detectives are trying to track down any private surveillance video in the neighborhood.\nNo one is in custody."}