{"uri": "http://www.fox32chicago.com/news/crime/182566164-story", "title": "2 shot dead in parking dispute; girl, 16, dies from asthma attack", "dct": "Thu, 28 Jul 2016 10:45:00 GMT", "id": "51866da05c3355e9e7c16765fd233bc8", "content": "SUN-TIMES MEDIA WIRE - Three people wound up dead early Thursday after gunfire erupted following a dispute over a curbside parking spot in the Back of the Yards neighborhood, the Chicago Sun-Times is reporting.\nTwo women were holding a parking spot for a friend, who was circling the block, when a man pulled up and opened fire after a brief confrontation over the spot, Wesley Williams said. His daughter, Jessica Williams, 16, suffered a fatal asthma attack as she ran for cover.\n“She had to have been so scared and frightened to go into an asthma attack like that. She had to been,” Williams said Thursday outside his home in the West Pullman neighborhood. “And now she’s gone. I don’t have my baby no more. At 2:05 this morning, they pronounced her dead. My baby is gone. My baby is gone.”\n2 shot dead in parking dispute; girl, 16, dies from asthma attack\nThe shooting occurred several minutes past midnight in the 800 block of West 50th Place in the midst of a block party attended by about 100 people. They were celebrating the life of Jessica Williams’ cousin, Shondell Williams. Relatives said he was mixed up in gangs when he was shot to death three years ago at 24 on the same block.\nDenzel M. Childs, 25, was shot in the neck, head and chest. Kayana Q. Armond, 34, was shot in the neck. Both were pronounced dead within an hour of the shooting.\nA 21-year-old woman suffered a gunshot wound in her left hand and was taken to St. Bernard Hospital. And a 25-year-old woman was taken to Stroger Hospital with gunshot wounds in her back.\nChicago Police Department spokesman Anthony Guglielmi confirmed the shooting originated over a disputed parking spot.\nFamily members said a second gunman emerged from the party and opened fire on the first gunman. Guglielmi confirmed the second gunman as well, but he said detectives were still sorting out exactly how the rest of the scene unfolded.\nJessica Williams, the second oldest of six siblings, was headed into her sophomore year at Chicago Vocational High School just off the Skyway in Avalon Park.\nAsthma ran in her family. Her father was once in a coma for 14 days after suffering an asthma attack, relatives said.\n“Jessica always carried her inhaler in her bag,” said her older brother, Anthony, who was not at the party and was at a loss to explain what happened.\n“It’s crazy,” said Jessica’s uncle, David Ford, as he shook his head. “A parking space. There’s just so much killing going on. For what? These people just don’t value life.”\nOn Thursday afternoon, flies buzzed around a mess of blood on a curb left at the crime scene until it began to rain hard.\nWhen the shooting broke out, Earnest Falkner, a retired forklift driver who lives on the block, was asleep in the back of his home.\nTwo bullets came through his front window. One shattered his 50-gallon fish tank, sending his crappie to the floor.\n“It’s messed up out here,” said Falkner, 67, who had been trading phone calls all morning with prospective landlords in an effort to move to a safer neighborhood.\n“I could have been sitting there on the couch,” said Falkner, pointing to the bullet hole in his window. “She usually sits on top of the couch too and looks out the window,” he said, pointing to his dog, Peaches."}