{"uri": "http://sacramento.cbslocal.com/2014/05/10/1-dead-multiple-shot-near-sacramento-park/", "title": "1 Dead, 6 Hurt After Shooting At Baby’s Birthday Party", "dct": "Sat, 10 May 2014 22:16:00 GMT", "id": "667915894f91d4cbd86ccbd4f6dd892b", "content": "SACRAMENTO (CBS13) – The bounce house sits deflated a Natomas park, the fun replaced with fear at a 1-year-old’s birthday party.\nA 7-year-old girl was one of the victims hit with a bullet; an adult is dead.\n“I just dove to the ground. There was about 25-30 shots that rang out, everyone was screaming and yelling and just running all hysterical,” said a witness who did not want to be identified.\nIn all, seven people were shot at Peregrine Park – on day that was supposed to celebrate a child’s life.\n“There was one kid shot in the leg, the other guy was shot who died … and there was a couple people around the corner [with] wounds to the leg and to the back,” the witness said.\nFamily and friends at the party, reeling after the violence, held each other in prayer.\n“Somebody called and said, ‘Don’t come to this party, they just shot this party up.’ I was like I don’t believe this. What is going on?” said Brenda Jones.\nJones’ 2-year-old grandson was at the birthday party.\n“Some lady over there pulled a bunch of kids that were at the party, she grabbed them and pulled them into her house,” Jones said.\nPolice aren’t saying how many suspects there are, or why the gunmen chose to put little kids in the line of fire. But, investigators think it may be gang related.\n“Some folks approached the party, shots were fired,” said Doug Morse with the Sacramento Police Department. “Our gang detectives were called out so we are going to try to get to the bottom of that.”\nThe six others shot during the incident are expected to survive.\n“It’s devastating that it happened in my backyard and the park that we go to everyday,” a neighbor in the area said.\nSunday, investigators told CBS13 that they believe someone at the party fired back at some point during the shooting.\nAuthorities ask anyone with information about the shooting to call the Sacramento Police Department."}