{"uri": "http://www.theoaklandpress.com/article/OP/20130821/NEWS/308219897", "title": "Testimony: Altercation outside of Pontiac liquor store sparked Independence Day shooting at fireworks show WITH VIDEO", "dct": "Wed, 21 Aug 2013 04:01:00 GMT", "id": "004aec036f4ff23373d9f67c9cfdf501", "content": "One apology may have sparked an altercation that eventually led to a Pontiac man allegedly opening fire on hundreds of Pontiac residents during a fireworks show at a local liquor store, killing one and injuring six.\n\"I'm sorry for bumpin' into all that ass\" was the apology given by Antonio Leak, according to testimony given Wednesday by Pontiac resident Claressa Leak during a preliminary exam in the case.\nLeak said the whole incident started when her son bumped into a woman who was with Robert Marion Naylor, 35 -- the man charged in the July 4 shooting at Perry Place liquor store, located at North Perry and Chamberlain streets in Pontiac. Five witnesses testified Wednesday during the exam in the city's 50th District Court.\nNaylor is accused of firing at least six shots into the crowd, fatally striking Wilfred Lee Donalson, 33, in the head and injuring his two children and four other bystanders. He's now charged with one count of second-degree murder, five counts of attempted murder, seven counts of felony firearms third offense charges and one count of possession of a firearm.\nAmong those who suffered gunshot wounds was Donalson's 6-year-old son, who was also shot in the head, but survived the ordeal. Others who were injured have since been released from area hospitals.\nLeak said she was feet away from the altercation on the night of the shooting outside the liquor store. After her son grazed the woman, Leak said he gave the observant apology above.\nThat's when it gets complicated.\nAccording to Leak's testimony, a man who was attending the unofficial fireworks show with Naylor and a woman Leak called \"Six-Nine,\" pulled a foot-long knife on her son, shouting, \"Why you got to disrespect my woman like that?\"\nThen someone else, who Leak said was a light-skinned Latino man, walked up and \"knocked (the man with the knife) out cold.\"\nWhen Naylor saw his friend -- who later testified and was identified as Gerald Holland -- on the ground, he pulled up his shirt in an attempt to pull a gun, Leak said. He had trouble bringing the gun out of his pants, she said, and someone sprayed him with pepper spray.\n\"(Naylor) had his hands up, he was rubbing his eyes ... (then) he pulled the gun out and got to shooting,\" said Leak. \"It was just, 'Pop. Pop. Pop. Pop.'\"\nLater, Holland -- who said he and Naylor had been friends for about a year -- testified with a different story. He said he had no account of what happened, because he was trying to diffuse a mob situation when he got punched in the face.\n\"I start going to Rob to see if I could help in any way. ... Next thing I know, I wake up in the back of a police car,\" said Holland. He told Assistant Oakland County Prosecutor Jeff Hall he had three knives on him that night, but said nothing about pulling it on anyone.\nThere was an apparent struggle when Claressa Leak's sister, Tabitha, testified, as well. She told the court she didn't give a statement prosecutor Jeff Hall read back to her. Naylor's attorney, Cyril Hall, seemed to be astonished when Tabitha went back on prior statements and had difficulty answering certain questions.\nTwo sisters, Alisha Scruggs and Arlinda Simmons -- who has a child with Naylor -- testified in the afternoon. Their accounts of the shooting differed from Leak's, and painted a picture of apparent self defense.\nBoth brought up that there was a period of time when Naylor, Holland and Scruggs went into the liquor store to get snacks and juices for the group -- including Naylor and Simmon's young son, Cartier, who Naylor was carrying.\nAfter they got out, a crowd of people cornered Holland and Naylor against the Perry Palace structure, said Simmons.\n\"I just see a crowd of dudes, they start throwing bottles and going that way ... then before I could get my son, there were two shots fired,\" Simmons said. \"I never seen nobody shooting -- that's what I'm saying ... I was running around looking for my baby, because I knew (Naylor) had him.\n\"The whole crowd just started rushing him. ... I never saw anybody with the gun.\"\nScruggs said she did see Naylor shooting the gun after a crowd of people formed, but that it was pointed in a downward direction at the ground.\n\"He did no shoot at no person,\" she said.\nAs testimony wrapped up in court, Judge Thomas set a continued preliminary exam hearing for 9:30 a.m. Sept. 25 in her courtroom. Outside the court, many of the late Donalson's nine children wore printed shirts that read \"R.I.P. Daddy\" and \"I love you, love your little girl,\" with a picture of the shooting victim in the center.\nThe Oakland County Medical Examiner and several additional witnesses are expected to take the stand for the September exam hearing.\nStaff writer John Turk covers the Oakland County Board of Commissioners, police and general assignment. He can be reached at 248-745-4613."}