{"uri": "http://www.wsoctv.com/news/news/local/police-investigate-multiple-calls-shots-fired-outs/nZn7z/", "title": "4 shot, including child, during anti-violence event in Charlotte", "dct": "Thu, 05 Sep 2013 22:51:00 GMT", "id": "7a985f648ec93858f149275e20e05c4f", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCHARLOTTE, N.C. - Four people, including an 11-year-old, were shot at the end of an anti-violence event late Thursday in north Charlotte.\nShortly after 10:30 p.m., the Mothers of Murdered Offspring was wrapping up a candlelight vigil honoring a man killed in a shooting last week when someone began firing shots into the crowd of about 50 people on Pinckney Avenue off Matheson Avenue.\nThe organizer of the vigil said MOMO members were cleaning up at the time, but children were still in the crowd when the shots rang out. She said people picked up those children and scattered in all directions.\n“Out of the blue,” said witness Nathaniel Hilliard. “I had never been anywhere where I’d heard all those guns.”\nHilliard’s wife, Cora, was holding a friend’s baby.\n“The only thing I could do is cuddle the child and get down low,” she said.\nBy the time police arrived, four people, an 18-year-old man, a 19-year-old man, a 22-year-old man and an 11-year-old boy, were all hit. None have life-threatening injuries. They were taken to area hospitals.\nA police report states several car windows and tires were also shot out.\nPolice have not made any arrests and said they don’t have a motive in the crime.\n“What you’re going to see is a lot more officers,” said Deputy Chief Kerr Putney with CMPD. “We’re going to be engaging the public respectfully, but intentionally, trying to make sure we’re proactive in what we do to prevent future gun violence.”\nThe vigil organizer said nothing like this has ever happened at one of the MOMO events. The vigil honored Javon Booker, who died after he was shot during a convenience store robbery.\n“Please, no more shooting,” said Judy Williams with MOMO. “No more guns. Please. We’re begging you.”\nNeighbors said they are upset and confused. They said they can’t believe someone would fire shots at a vigil that was dedicated to ending violence.\n\"It's sad. you know. It's scary. I was at work when it happened. It's nerve-racking, you know,\" said neighbor Kristina Fleming.\nCrime Stoppers is offering up to a $5,000 reward for information that leads to the arrest of the suspect in this case.\nAnyone with further information concerning this shooting or the suspect’s identity is asked to call the Crime Stopper’s tip-line at 704-334-1600, or visit http://charlottecrimestoppers.com."}