{"uri": "http://www.buffalonews.com/city-region/orleans-county/shelby-teens-death-appears-to-be-tragic-accident-with-loaded-hunting-gun-20141018", "title": "Shelby teen’s death appears to be ‘tragic accident’ with loaded hunting gun", "dct": "Sat, 18 Oct 2014 00:00:00 GMT", "id": "69043d59d91aa93cccfeac7c113dfeb4", "content": "SHELBY – A 15-year-old Town of Shelby boy who died in his home Friday was the apparent victim of an accidental discharge of a shotgun used for hunting, authorities in Orleans County said on Saturday.\nJacob A. Stahl, a sophomore at Medina High School, died in his home on Salt Works Road at about 5:30 p.m. Friday, Sheriff Scott D. Hess said.\nAn avid hunter, Jacob was looking at the shotgun in an upstairs bedroom with a 16-year-old friend when the gun accidentally went off, firing a shot that killed Jacob, authorities told The Buffalo News.\nThere is no indication of foul play, and the other teen – whose name has not been released – has “fully cooperated” in the ongoing investigation, the Sheriff’s Office said.\nSo far, police have not disclosed any specifics about what caused the gun to go off, or who was handling the weapon when it fired.\n“It’s so sad,” District Attorney Joseph V. Cardone said. “From everything I have been told so far, it sounds like an accident – 100 percent.”\nCardone said he will have detailed discussions with police and Jacob’s family before deciding whether to present the case to a grand jury. The Sheriff’s Office said investigators are “reasonably certain” that the death was a “tragic accident that resulted from the careless handling of a loaded firearm.”\nAccording to Hess, a 911 call came from the boy’s home in the 5000 block of Salt Works Road Friday, and when deputies and first responders arrived, the teen was dead.\nMedina School officials will have grief counselors available to talk with students all this week, Superintendent Jeffrey Evoy told a reporter Saturday. The high school has 645 students.\n“We opened the high school today and we’ve already had some students come in,” Evoy said. “This is a small, close-knit school community, and this is an absolute tragedy. People are in a state of shock.”\nJacob’s friends knew him as “someone who loved the outdoors and loved hunting,” Evoy said. “He had a close group of friends, and they talked about hunting a lot.”\nCardone, who has been the county’s chief prosecutor since 1992, said he has seen “too many” cases in which young people were killed through the unsafe handling of hunting weapons.\nCardone said he was reminded of a November 2003 incident in which a 17-year-old Albion boy accidentally shot and killed his 16-year-old best friend with an arrow fired by a hunting bow while the two were target shooting.\n“In this county, we have a lot of hunters with a lot of guns in a lot of households,” Cardone said.\n“Young people have to be taught that you need to be very careful. Something like this has a tremendous impact, not only on the young person who is killed, but on the other person who was involved. And their families.”\nemail: dherbeck@buffnews.com"}