{"uri": "http://myjournalcourier.com/news/92582/police-beat-219", "title": "Police Beat", "dct": "Thu, 03 Mar 2016 00:00:00 GMT", "id": "c1280fc76ef8441a0208bcd4abe03fd4", "content": "Teen shooting likely accidental, police say\nA 17-year-old boy was being treated Wednesday at a Springfield hospital after being shot in Winchester, authorities said.\nThe boy, who was not identified by authorities, was flown to a Springfield hospital after being taken to Passavant Area Hospital in Jacksonville shortly after midnight Wednesday. His condition was unavailable.\nWinchester Police Patrolman Bob Smith said police were called to an East Lewis Street residence and found the injured boy and two others at the house. He said it appears the shooting was accidental, but the investigation is continuing.\nMorgan County\nSheriff\nACCIDENTS\n• One man was injured about 12:13 p.m. Wednesday after a one-vehicle accident on Woodson-Franklin Road near Franklin.\nNathanial R. Newingham, 21, of Woodson was taken to Passavant Area Hospital where he was stabalized and transferred to Memorial Medical Center.\nNewingham was ejected from his vehicle after he went off the road, thorugh a fence and down an embackment.\nHis status was not available Wednesday evening.\nJacksonville Police\nARRESTS, CITATIONS\n• William P. Griffin, 38, of 741 N. Diamond St. was arrested about 8 p.m. Tuesday on a Missouri Department of Corrections warrant accusing him of violating probation on a domestic battery charge.\n• Kahley W. Watkins, 25, of 827 Goltra Ave. was cited about 8:45 p.m. Tuesday on a charge of operating an uninsured motor vehicle.\n• George M. Stice, 26, of 817 S. Clay Ave. was arrested about 9:35 p.m. Tuesday on charges of domestic battery and resisting a peace officer and cited on a charge of drunkenness.\n• Nicole J. Maro, 25, of 218 W. College Ave. was cited about 9:20 p.m. Tuesday on a charge of operating an uninsured motor vehicle.\n• Cara E. Blanton, 39, of 419 Kentucky St. was booked into the Morgan County Jail about 7:06 p.m. Wednesday on a retail theft charge.\nSouth Jacksonville\nARRESTS, CITATIONS\n• A 14-year-old girl was arrested about 7:18 a.m. Wednesday on criminal trespass to land charge.\n— Compiled by Greg Olson and David C.L. Bauer\ncomments powered by Disqus"}