{"uri": "http://www.wpxi.com/news/6-year-old-shot-in-knoxville-died-suspect-to-be-charged-with-homicide/405934034", "title": "6-year-old shot in Knoxville died, suspect to be charged with homicide", "dct": "Wed, 20 Jul 2016 23:39:00 GMT", "id": "68996b8271bfd2bcf5e87993db042acf", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nPITTSBURGH - A 6-year-old girl shot Sunday night at a home in Pittsburgh’s Knoxville neighborhood has died, according to police.\nCharges against Kamau Thomas, Jr, 19, will be amended, police said. Thomas is already charged with attempted homicide, reckless endangerment and aggravated assault following his arrest Monday night.\nIsis Allen’s parents and extended family gathered by her bedside Wednesday to say their goodbyes.\n\"Her heart is slowly but surely leaving,\" the child's mother, Taqua Sykes, told Channel 11 News.\n“I have to thank the community, because the community is what actually brought this man to justice as fast as it did. [Police] got him within 24 hours of this happening,” Sykes said.\nIsis died at Children’s Hospital at 1:45 p.m. Wednesday\n\"Savage. There's no forgiving him. I'm not into forgiveness. He took my baby,” said Sykes\nShe said she wants Thomas prosecuted to the fullest extent of the law.\n“I'm just holding on to what I have left of her,” Sykes said.\nAccording to court documents obtained by Channel 11 News, Thomas did not realize he had shot the girl in the head until he saw it on Facebook. He told police he was aiming at the roof to scare another man who had threatened him earlier.\nThomas told police that the gun’s “trigger was sensitive, (and) it started going crazy. The gun kept going off until it was empty,” the complaint said.\n“This generation. These kids. This youth. These shooters. They're not caring if there's a baby on the porch playing or innocent people in cars,” John Parker Sr., the child’s uncle, said. “We as men, we have to get out here and start grabbing up these troubled youth.”\nPolice were called to Zara Street about 11 p.m. Sunday, where they found the girl, named Isis Allen, on the front porch of the home. There were also adults on the porch at the time of the shooting, but they were not hit.\nInvestigators said Isis was hit by one bullet. She was taken off life support on Wednesday.\nNeighbors said Isis didn’t live in the home. She was visiting for the weekend.\n“She gets along with a lot of kids,” Parker said. “Neighbors love her. It’s a tragedy.”\nChannel 11 News returned to the home Monday and found teddy bears near the porch.\nThere were also large caliber bullet holes in the front door and porch columns. Police said the shots were fired at the porch by someone outside the house.\nA vigil was held Monday night, where neighbors frustrated by the senseless violence prayed for Isis and for answers. Isis’ father left the hospital for a brief time to attend the vigil.\n“I just want everybody to pray for her, please, and her family,” Charlotta Smith, whose house was the scene of the shooting, said.\nA second vigil, which about two dozen people attended, was held Wednesday night following Isis’ death.\n© 2017 Cox Media Group."}