{"uri": "http://www.post-gazette.com/local/city/2016/07/20/Girl-6-who-had-been-in/stories/201607200185", "title": "Police: Girl, 6, who had been shot in head Sunday has died", "dct": "Wed, 20 Jul 2016 23:35:00 GMT", "id": "cf6556941a1f5c939f4dc0a5b4356bfe", "content": "Kamau Thomas Jr. told police he was trying to scare a guy who had threatened him when he fired a gun Sunday night at a porch filled with people in Knoxville.\nBut it was a 6-year-old girl named Isis Allen — not his intended target — who was struck by the bullet.\nAfter being kept alive at the hospital for several days in critical condition, Isis was pronounced dead just before 2 p.m. Wednesday.\nPolice, who had already charged Mr. Thomas, 19, of Carrick with attempted homicide, a firearms offense and 12 counts of recklessly endangering another person, said the case had been reclassified as a homicide and indicated that charges would be upgraded.\nMaurice Trent, pastor of The Lighthouse, a church in Pittsburgh’s St. Clair neighborhood, said that Isis was taken off life support and that her family was too distraught to comment.\nHe said funeral arrangements were incomplete but expects there to be a memorial service in the near future.\nMr. Thomas told police that he went to provide “security” Sunday during a fight between two women on Zara Street. Mr. Thomas said that during the fight, he ran into a man with whom he had a dispute. The two exchanged words.\nAccording to a police affidavit, Mr. Thomas said he got a small, black handgun from someone he played basketball with and then returned to scare the man who had threatened him “because he believed he was going to be shot ...”\nMr. Thomas told police that he pointed a gun near the spot where the other man was standing in an effort to scare him. He said he fired once, according to the affidavit. However, he told detectives, “the trigger was ‘sensitive’ and when he brought the gun down ‘it started going crazy and kept going off until [the magazine] was empty.’ ”\nWitnesses told police they heard three to five shots. Everyone on the porch scattered, and bullets struck Isis and the house.\nMr. Thomas later told people that he realized he shot the girl, police said.\nJonathan D. Silver: jsilver@post-gazette.com, 412-263-1962 or on Twitter @jsilverpg."}