{"uri": "http://www.tennessean.com/story/news/local/davidson%20/2016/12/20/nashville-police-investigating-dead-body-found-bordeaux/95660716/", "title": "Nashville police investigate teen found shot in Bordeaux", "dct": "Tue, 20 Dec 2016 00:00:00 GMT", "id": "640ea839f9c66e297def28dbb6db8354", "content": "Nashville police are investigating a homicide after a 16-year-old was found shot to death Tuesday morning in the Bordeaux neighborhood.\nPolice identified the victim as Ricky Lamont Hambrick of Meadowside Lane.\nAccording to police, a caller reported finding the teen's body in a grassy area by a residential driveway and a Piedmont Natural Gas facility just before 10 a.m. on the 2500 block of East Lane.\nMetro Police spokesperson Don Aaron said the passerby tried to wake Hambrick, but called police when he could not be roused.\nPolice said neighbors reported hearing shots in the area around 8 p.m. Monday but did not call police. One neighbor reported seeing a person in a tan or beige jacket running away from the area.\nSgt. Terrance Demarest said that it's not uncommon for people in Bordeaux to hear shots and not inform local authorities.\n\"Some people have been here a long time hearing shots and they just don't call,\" he said.\nBut neighbors in the area said it’s unusual to hear gunshots, although they reported some thefts from vehicles.\n“It’s always quiet over here,\" neighbor Ralph Munk said. “It’s really dark here at night. We’ve been trying to get [the city] to do something about it.”\nMunk, 63, has lived in the neighborhood for the last five years. He said he wishes police would patrol the area more than they currently do.\nThe investigation is ongoing, and police are looking at the surveillance footage from a nearby apartment complex and the natural gas facility.\nDetectives are working to learn more about Hambrick, including why he was at the Mattie Street/East Lane intersection last night. Anyone with information about this case is asked to contact Crime Stoppers at 615-742-7463. Callers to Crime Stoppers can remain anonymous and qualify for a cash reward. Persons can also send an electronic tip by texting the word “CASH” along with the message to 274637 (CRIMES), or online at www.nashvillecrimestoppers.com.\nThis is a developing story.\nMOST POPULAR STORIES\nMayor Barry to propose pro soccer stadium at Nashville fairgrounds\nWatch live: March for Life live feed of events, speeches in D.C.\nGov. Haslam broadband plan offers $45M in grants, incentives\nTierPoint investing $20M in Franklin data center expansion\nReba McEntire finds healing through faith, music"}