{"uri": "http://www.wsmv.com/story/34137771/police-teen-shot-in-neck-while-friends-played-with-gun", "title": "Police: Teen shot in neck while friends played with gun", "dct": "Tue, 10 Jan 2017 23:04:00 GMT", "id": "b5aa869258fd04b6ae67a0c79f105875", "content": "MOUNT JULIET, TN (WSMV) -\nA teenager is home from the hospital after being shot in the neck in Mt. Juliet on Tuesday.\nPolice said it happened on Davis Corner Road in Wilson County just after 1 p.m. When officers arrived, the group of three teens told them someone drove up and shot their friend in the driveway.\n\"Once we started the investigation, trying to figure out exactly what happened, we found we was getting conflicting statements from all the juveniles that was here,\" said Wilson County Sheriff Robert Bryan, explaining the teens were not cooperating early on.\nOfficers later learned the 16-year-old boy, whom neighbors identify as Wyatt Tillman, had actually been shot in the neck inside his home.\nPolice believe the three teens were playing with a gun and accidentally shot the boy while his parents were at work. He was transported to Vanderbilt University Medical Center.\nThe landlord, Jesse Chapman, said he saw the LifeFlight helicopter land in his yard before the boy was taken away in an ambulance.\nChapman said he was upset to learn the shooting happened on his property.\n\"When I find them two children, they will never step foot on this ground again,\" he said. \"Sitting there playing with a pistol? A loaded weapon? That will kill somebody in a heartbeat. Worst thing about it, what if Wyatt was killed? It would be on that child that pulled the trigger. He'd be stuck with that for the rest of his life, and that's not good. Lucky he is alive. Maybe he will learn something.\"\nAfter searching for hours, police found the gun tossed behind the mobile home.\n\"We're trying to determine how the gun got there,\" Bryan said. \"We believe the juveniles brought it there, and once we determine that, some other people could face some charges.\"\nThe teens could face charges for giving false reports and other possible charges.\nCopyright 2016 WSMV (Meredith Corporation). All rights reserved."}