{"uri": "http://wate.com/2016/12/27/sheriffs-office-middle-tennessee-teen-shot-while-2-friends-played-with-gun/", "title": "Middle Tennessee teen recalls moment he was shot as friends played with gun", "dct": "Tue, 27 Dec 2016 17:58:00 GMT", "id": "d153f1bea6f6977660b88e632f42185b", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nMT. JULIET, Tenn. (WKRN) – A 16-year-old boy was shot Tuesday afternoon while two other teens were playing with a gun.\nDeputies were called to Davis Corner Road near Burton Road shortly after 1 p.m. where the teen was found with a bullet wound to his neck.\nHe was transported to Vanderbilt University Medical Center and released a few hours later.\nWKRN caught up with the teen, Edward Tillman, who can’t believe his luck.\n“I woke up and was like, ‘I just got shot,’” said Edward. “I was not a fan. I was like, ‘I just got shot.’ I’m 16. I shouldn’t be getting shot. My dad’s 40 and he hasn’t been shot yet. I’m 16 and have a scar for the rest of my life.”\nEdward explained the gun was brought over by his friends, and this incident has made him realize the importance of gun safety.\n“It was almost catastrophic. I could’ve died easily, and I wouldn’t be here today,” he said. “I can’t stress enough that kids need to be safe with guns. It’s just, they’re dangerous. They really are.”\nThe investigation is being handled by the Wilson County Sheriff’s Office. Officials say charges in the case are possible.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}