{"uri": "http://www.greenvilleonline.com/story/news/local/2014/12/16/mother-thought-gun-killed-son-loaded-authorities-say/20490309/", "title": "Mother thought gun that killed son wasn't loaded, authorities say", "dct": "Tue, 16 Dec 2014 00:00:00 GMT", "id": "1ebbb75697fbdcb62a98445c8c166123", "content": "The gun that killed 3-year-old Michael Kyron Boyles had been his father's, authorities said Tuesday.\nThe Simpsonville boy had come across the 9 mm pistol in his parents' bedroom and was playing with it when authorities said the gun accidentally went off, striking him.\nAn autopsy Tuesday determined that the boy died of a single gunshot wound to the head, said Greenville County Coroner Parks Evans. His death was ruled accidental, Evans said.\nIt was the second time this year tragedy struck the house on Garfield Lane.\nMichael's father, Richard Boyles Jr., died at the home of cancer in May, Evans said. An obituary said Richard Boyles was born and raised in Greenville and was a veteran.\nThe gun belonged to him, according to the Coroner's Office.\nAfter her husband died, Michael's mother told authorities she removed the magazine from the gun, thinking she had unloaded it, according to Evans.\nThe magazine was stowed under some clothes, and the pistol was put up in a dresser drawer. She thought it was safe there, Evans said.\nAt about 1:45 p.m. Monday, authorities said Michael went into his mother's room while she was in another part of the house with Michael's younger brother.\nThe coroner said the boy somehow climbed on top of some boxes to get to the drawer where the gun was kept.\n\"It was loaded. One bullet was in the chamber, and it was ready to fire,\" Evans said.\nHe described the gun as one of the few types that will still fire without a magazine. There wasn't a gun lock or a traditional safety mechanism, Evans said.\nSimpsonville police said officers responded to a call about a gunshot victim just before 2 p.m.\nMichael's mother told officers that her son had been alone in the bedroom for just a few minutes when she heard a gunshot.\nShe thought at first the noise was from construction going on behind the subdivision less than a mile from Bryson Elementary School, according to the coroner.\n\"She didn't even think that he knew a gun was in that drawer,\" Evans said."}