{"uri": "http://www.wdrb.com/story/33789335/police-responding-to-reports-of-multiple-shootings-at-shawnee-park", "title": "UPDATE: Louisville Mayor Greg Fischer expected to address Shawnee Park shootings Friday afternoon", "dct": "Thu, 24 Nov 2016 19:02:00 GMT", "id": "969e515787a720f28c6dcaa2517f770f", "content": "LOUISVILLE, Ky. (WDRB) -- Louisville Mayor Greg Fischer is expected to comment on the mass shooting that took place in Shawnee Park Thanksgiving Day.\nThe mayor's comments are expected to take place Friday afternoon.\nTwo people are dead and four people are wounded after the shootings in a crowded and busy Shawnee Park Thursday afternoon.\nOfficers responded to reports of a shooting at the park around 1:51 p.m. Louisville Metro Police spokesman Dwight Mitchell said when officers arrived, they found two black males with gunshot wounds.\nBoth victims were pronounced dead at separate scenes in the park. The coroner's office had not released their names Thursday evening.\nMitchell said four other victims were taken to University of Louisville Hospital with injuries not considered to be life threatening. Two victims were taken by ambulance, and two were taken in private vehicles.\nThe annual \"Juice Bowl\" football games at the park had to be canceled, and coaches scrambled to get players to a safe place as police evacuated the park. Hundreds of spectators ran for safety. Some described hearing several gunshots at once during a women's flag football game. Facebook video from Stephen Washburn provided to WDRB News captured sounds of at least 19 shots.\n\"We were standing on the sidelines watching the women's team play, and all of the sudden, you heard gunshots and people started scattering,\" said Antjuan Allen, coach of the River City Hurricanes football team.\nFriends and family members of the victims dropped to their knees to weep.\n\"I saw one guy laid out. He was still alive. And I saw another guy over there dead. He was shot in the head,\" one spectator told WDRB News.\n\"A guy fell, and I went over to see if I could assist him. And once I got there, I saw his brains were blown out,\" said witness Neal Robertson.\nThe shooting scenes were not related to the football games, police said.\n\"There were a lot of people that were here, and for the number of shots that were probably fired, there could have been more victims here,\" Mitchell said.\nOne coach said, \"There are people who won't make it home to the Thanksgiving table.\"\nLouisville Mayor Greg Fischer was one of those watching the football game. He was able to leave safely.\n\"To have people with guns so disrespect life, Shawnee Park, and neighborhood tradition is sad and has no place in our city,\" Fischer said on his Twitter account, @louisvillemayor. \"Like hundreds of others, I was attending the Juice Bowl to share in this great community event when the shootings occurred.\"\n\"My thoughts and prayers are with the families of all those impacted by today's violence,\" Fischer continued.\nOfficers walked shoulder to shoulder at one scene, scouring the grass for evidence, past sunset. A police helicopter flew overhead. Officers wore jackets from Louisville Metro Police, ATF and the FBI.\nPolice are looking for witnesses, but ask anyone with information is asked to call the LMPD crime tipline at 574-LMPD. All calls are anonymous.\nThe two deaths Thursday raise Louisville's criminal homicide total to 104 for 2016, according to LMPD. The number is 110 for all of Jefferson County, Ky., including six homicides outside of LMPD's jurisdiction. The city's record is 110 from 1971.\nJuice Bowl football games date back to the 1950s. They are a Thanksgiving Day staple in Shawnee Park. Youth and adult teams play in a series of games throughout the day.\n\"Last year, the only thing that happened was just an injury on the sideline,\" Robertson said. \"It's just ridiculous, you know what I mean?\"\nCopyright 2016 WDRB Media. All rights reserved."}