{"uri": "http://www.wave3.com/story/33789351/update-fbi-atf-join-investigation-into-deadly-mass-shooting-at-shawnee-park", "title": "RAW VIDEO: Facebook Live records 19 gunshots as mass shooting unfolds at Shawnee Park", "dct": "Thu, 24 Nov 2016 19:04:00 GMT", "id": "c8ff328519e0fdcc7ab05e8320fd8d63", "content": "LOUISVILLE, KY (WAVE) - Live video being shown on a social media platform when a mass shooting began to unfold at Shawnee Park Thanksgiving afternoon captured at least 19 gunshots, some of which left two men dead and another four people injured.\nStephen Washburn Sr. was recording a Facebook Live video during a gathering of motorcycle enthusiasts when the gunfire began shortly before 2 p.m. Thursday. The gunshots can be heard on the video beginning at the :44 mark. People can be seen dropping to the ground in an attempt to take cover.\n>> RAW VIDEO: Facebook Live records mass shooting\nAgents with the FBI and the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) have joined the investigation into the shooting, which happened as hundreds of people crowded Shawnee Park to celebrate the holiday.\nThe four survivors suffered non-life-threatening injuries, Louisville Metro Police Department spokesman Dwight Mitchell said. Two of them were rushed to a hospital by EMS. Two others were taken by private vehicles.\n>> IMAGES: Mass shooting at Shawnee Park\n\"It is a day to be thankful, and we're thankful more people weren't hurt in this situation,\" Mitchell said.\nHe could not confirm whether an incident in front of 601 W. Broadway was related. Shortly after the shots were fired at Shawnee Park, officers descended on the 600 block of W. Broadway and put up crime tape around a vehicle that did not appear to have been involved in a crash. WAVE 3 News reporter Sharon Yoo said a man sitting on the curb told officers, \"He's been shot,\" but it was unclear whether someone inside the vehicle had been shot or whether the Broadway incident was somehow related to the Shawnee Park shootings.\nNo one has been arrested in connection to the attack. The LMPD Homicide Unit is investigating.\nSeveral people reported a mass shooting in the vicinity of 4501 W. Broadway beginning at 1:51 p.m., a MetroSafe dispatcher said.\nShawnee Park was filled with people at the time of the shooting, many of them children and parents attending the Juice Bowl, a series of youth football games held annually on Thanksgiving Day. Police blocked off a large portion of the park after the shooting, but a football game continued.\nALSO ON WAVE3.COM\n+ KY man killed in suicide bombing in Afghanistan\n+ Third victim of IN mobile home fire dies\n+ Sixth child dies after Chattanooga school bus crash\nLouisville Mayor Greg Fischer was a spectator at the Juice Bowl. He said the shootings happened about 150 yards from him. In a series of tweets, Fischer said, \"To have people with guns so disrespect life, Shawnee Park, and neighborhood tradition is sad and has no place in our city.\"\nTo have people with guns so disrespect life, Shawnee Park, and neighborhood tradition is sad and has no place in our city.\n— Mayor Greg Fischer (@louisvillemayor) November 24, 2016\nHe also implored anyone with information about the crime to call LMPD. The agency's anonymous tip line is 502-574-LMPD (5673).\nWAVE 3 News anchor Dawne Gee's sister witnessed some of the shootings. Pam Smith called Dawne immediately after the shootings and told her the gunfire was rapid.\n>> MUGSHOTS: November 2016 Roundup\nNathan Hilliard, a young man who was playing football when the incident happened, said he barely heard the gunshots before people starting running toward him. Hilliard said the scene was much calmer than one might expect.\nPolice have no motive for the attack.\n>> RESOURCES: Taking Back Your Streets\nThursday's shooting deaths bring Louisville's homicide total to 106 for the year. The city's single-year record, set in 1971, stands at 110 homicides.\nWatch WAVE 3 News for continuing team coverage of this story and bookmark this page for updates.\nCopyright 2016 WAVE 3 News. All rights reserved."}