{"uri": "http://www.trentonian.com/general-news/20161121/shooting-robbery-and-drugs-november-21-2016-trentonian-police-blotter", "title": "Shooting, robbery and drugs: November 21, 2016 Trentonian Police Blotter", "dct": "Mon, 21 Nov 2016 16:35:00 GMT", "id": "4fcf7a53043ba76d3dc6c810022cc49a", "content": "The information below was provided by police unless otherwise noted.\nTrenton\nShooting: A 17-year-old female was shot in the leg Sunday evening in the 100 block of Oakland Street. The victim told police she suddenly heard gunshots, ran and realized she was hit. She suffered a non-life-threatening graze wound and has been released from the hospital.\nStreet Robbery: Harry McKinney, 50, was arrested Saturday after he allegedly robbed two people at knifepoint. Officials say a 54-year-old woman and a 34-year-old male flagged down cops who were patrolling near the intersection of Prospect and Spring streets. McKinney was still in the area when police stopped, officials say, and he ducked between two buildings when he saw law enforcement. The victims then identified McKinney as the suspect who robbed them, and police found a large kitchen knife in the area where McKinney was apprehended. The victims told police they were waiting at a bus stop when McKinney demanded their belongings and pulled out a knife when they refused to hand them over. When police searched McKinney, they found $16 believed to be the cash the victims gave him when he drew the knife. McKinney’s bail was set at $125,000.\nCan’t Get Enough: Luis Cardona, 22, was arrested over the weekend for allegedly climbing through a woman’s basement window. Police say Cardona and the 20-year-old victim used to date, and that he climbed through the window to see her around 3 a.m. Sunday. Cardona is charged with burglary and harassment; his bail was set at $10,000.\nAdvertisement\nHeroin Bust: Jaquan and Jamere Taylor were arrested Friday night after police allegedly found 185 decks of heroin inside a vehicle they occupied. Police say the twin brothers were initially stopped for a motor vehicle violation in the 200 block of Academy Street. Police also seized $27 in cash and the Chevy Malibu Jamere was driving. Bail for each of the Taylors was set at $35,000.\nDomestic Assault: Jose Daniel Ortiz, 45, was arrested Saturday in connection with an incident that happened in July. Police say Ortiz and a 69-year-old woman were arguing inside a home in the 500 block of Tyler Street when he grabbed her by the neck, picked her up and then pushed her. The woman suffered pain to her neck and eye. Ortiz is charged with simple assault and endangering the welfare of children because the assault happened in the presence of kids. His bail was set at $20,000.\nKnife Attack: Rafael Pinedas, 23, was arrested over the weekend after he allegedly threatened a 41-year-old woman with a knife inside a bar on Chestnut Avenue. Police are still investigating the cause of the dispute, but officials say Pinedas pulled a knife out of his pocket and held it to woman’s neck, causing minor abrasions. Pinedas was then kicked out of the bar by security personnel, and police later arrested him at his house as he was trying to climb out of a window to escape apprehension. Pinedas is charged with aggravated assault and weapons offenses; bail was set at $25,000.\nHeroin, Crack and Pills: Ikeem Hairston, 27, was arrested over the weekend after police allegedly found him in possession of 52 decks of heroin, 14 Endocet pills, 11 grams of crack cocaine and $169 in cash, which was seized. Officials say detectives saw Hairston engaged in drug activity while conducting an operation near the intersection of Hudson Street and Hamilton Avenue. Hairston’s bail was set at $35,000.\nBristol, Pa.\nVandalism: Someone tossed a rock at the tailgate of a 1994 Ford that was parked in the 1800 block of Edgely Road. The rocked caused a dent estimated at $100 worth of damage.\nSpray Paint Vandalism: Someone spray painted a car parked in the 1500 block of Haines Road. The damage is estimated at $200."}