{"uri": "http://www.palmbeachpost.com/news/news/crime-law/family-of-murdered-teen-lead-peace-walk-in-west-pa/nnXQS/", "title": "Family of murdered teen lead peace walk in West Palm Beach", "dct": "Wed, 02 Sep 2015 00:00:00 GMT", "id": "47d12c9d2203cc03712f5e4d335a1fcb", "content": "WEST PALM BEACH\nAs Destiny Kittrell held a megaphone near the spot where her uncle was killed last week, she delivered a message to the person responsible for Johnny Davis’ death and to those responsible for a recent spate of violence within the city.\n“You’re not taking someone who doesn’t matter from every family; you’re breaking our families,” she said. “We need our families to continue to move on. We need each other. We need our uncle, we need a brother, we need a sister. You can’t go around taking people from people’s families, because it does hurt.”\nOne week after Davis, 19, and three other teens were shot while walking near 19th Street and Tamarind Avenue, dozens gathered to call for an end to the violence. Davis was killed Aug. 26 when a man in a car pulled up and opened fire on the group. Davis died immediately as the shooter sped away. A second teen later died at St. Mary’s Medical Center. Two other teens were hurt but survived.\nDavis graduated a year ago from Forest Hill High School and was remembered for his intellect, his love of baseball and pulling occasional pranks.\nOn Wednesday afternoon, members of the community, city leaders and city police joined Davis’ family for a peace walk and candlelight vigil. Dozens marched along Tamarind from Third Street to the spot on 19th Street where Davis was killed.\nDiane McNeil, Davis’ mother, said she she was grateful to see so many people come out to honor her son.\n“I love him and the one thing I can say is he was a good boy,” she said. One man struggled to control his emotions as he remembered Davis.\n“It’s really hard getting through this,” Davis’ sister, Diane S. McNeil, said.\nEmmanuel Meant, 17, just became friends with Davis.\n“We became friends a couple of months ago and it’s just tragic to see him die so soon,” Meant said as he joined others in the walk. “He was a real good dude. He had had good intentions. He was trying to change the community.”\nRicky Aiken, the founder of Inner City Innovators, a group advocating against violence among youth in the area, vowed that Davis’ death will not be in vain.\n“We can’t continue to go on with business as usual as our young brothers are being slaughtered,” Aiken said. “We have to come together. My hope for my community is that we can be a model, an example for every other inner city in our country.”"}