{"uri": "http://www.adn.com/article/20160201/fairbanks-police-investigate-soldier-s-death-accidental-shooting", "title": "Wainwright soldier accidentally shot himself in head, Fairbanks police say", "dct": "Wed, 28 Sep 2016 00:00:00 GMT", "id": "f76fa02ca0c49aa3b75a1a4c683357a0", "content": "Fairbanks police say a Fort Wainwright soldier who died in an accidental shooting Sunday shot himself with the single round remaining in the weapon's chamber, after removing its magazine.\nIn a Tuesday update on the death of Sgt. Nathan Michael Higginbotham, Fairbanks police spokesman Officer Doug Welborn said officers responded to a home on the 3700 block of Geraghty Street just before 3 a.m. Sunday to investigate the shooting. Paramedics found him slumped over a couch, and declared him dead at the scene.\n\"Investigation revealed Higginbotham was in the process of confirming his personally owned .40 caliber Springfield XD was unloaded while at his acquaintance's residence,\" Welborn wrote. \"He had run the slide on the firearm and ejected the loaded magazine. Higginbotham never cleared the chamber of the live round which had been loaded when he ran the slide. Higginbotham reportedly discharged the weapon at his head during this process to confirm with his friend it was unloaded. Preliminary investigation indicates Higginbotham had been consuming alcohol.\"\nA Fort Wainwright soldier died Sunday in what U.S. Army officials call an apparent accidental shooting involving a non-service weapon.\nU.S. Army Alaska spokesman John Pennell said cavalryman Sgt. Nathan Michael Higginbotham, 25, died early Sunday after he was shot in Fairbanks. According to a statement from the Fairbanks Police Department, a 9 mm pistol was recovered from Higginbotham at the scene. He had a single gunshot wound to the head, police said.\n\"(Higginbotham) died after a privately owned firearm he was handling accidentally discharged,\" Pennell wrote. \"No others were harmed in the accident. No foul play is suspected.\"\nPolice said at least two other people witnessed Higginbotham's death, but law enforcement isn't releasing their names or \"what actions Sgt. Higginbotham was taking with the firearm at the time of its discharge.\"\nHigginbotham -- originally from ?Schenectady, New York -- was a member of the 5th Squadron in the 1st Cavalry Regiment, 1st Stryker Brigade Combat Team, 25th Infantry Division. Formerly assigned to Fort Hood, Texas, he served in Iraq in 2011 before being assigned to Fort Wainwright in 2013."}