{"uri": "http://www.al.com/news/huntsville/index.ssf/2016/11/alabama_city_began_investigati.html", "title": "Alabama city began investigating student-teacher sex claim day before coach found dead", "dct": "Tue, 01 Nov 2016 08:20:00 GMT", "id": "f38cb98cb1eaff9a8359c663986b9fc7", "content": "Police in a north Alabama city where a coach was found dead after being placed on administrative leave are investigating a report about sex between a school employee and student.\nSheffield police on Monday released a portion of a report filed by a 16-year-old stating an employee at Sheffield High School was having sex with a student, AL.com's news partner WHNT-19 reported. Police have declined to say who the suspect is.\nThe report was filed Friday with Sheffield police, and city schools Superintendent Keith Lankford announced an employee had been placed on administrative leave with pay \"pending the results of a personnel investigation.\"\nThe next day, 27-year-old Jared Mothershed, Sheffield's baseball coach and an assistant football coach, was found dead in his home in nearby Muscle Shoals.\nSheffield High School coach and teacher Jared Mothershed was found dead Saturday morning, city schools superintendent said in an emailed statement.\nColbert County Coroner Carlton Utley declined to release the cause of death but said the circumstances don't suggest foul play.\nUtley referred further questions about Mothershed's death to Muscle Shoals police Chief Clint Reck, who didn't respond immediately to a request for comment.\nThe report about the sexual relationship lists the offense as a Class C felony: school employee engaging in a sex act with a student, WHNT reported. The offense reportedly occurred at Sheffield High School.\nIn an email statement regarding Mothershed's death, Lankford identified him as the teacher who was on administrative leave.\n\"Our focus now shifts to our students and we ask for your prayers for our students, our faculty and Mr. Mothershed's family,\" Lankford said in the email.\nMothershed is the son of legendary Deshler football coach John Mothershed, who won more than 200 games and two state titles at Deshler in neighboring Tuscumbia.\nThe younger Mothershed was appointed head baseball coach in July 2015. He played baseball for Northwest-Shoals Community College and the University of North Alabama."}