{"uri": "http://www.wfaa.com/news/crime/weatherford-police-officer-shot-during-traffic-stop/380501540", "title": "Weatherford PD: Officer shot by backup during traffic stop", "dct": "Tue, 03 Jan 2017 00:00:00 GMT", "id": "5c734cb2b408996f420f64152ec21553", "content": "FORT WORTH -- A Weatherford police officer is expected to be okay after being accidentally shot by his backup partner during a traffic stop on Thursday night.\nAccording to Weatherford police, Officer Chris Bumpas was making the stop at 9:14 p.m. outside the Tequila Bar Y Grill on Tin Top Road when he found one of the three people in the car had an outstanding warrant. That led to an altercation, and police said the suspect began hitting Bumpas in the head with a flashlight.\nA backup officer tried to use a Taser on the suspect but it had no effect, according to police, so he drew his gun and fired shots. The suspect was hit and Bumpas was also struck in the abdomen.\nWPD said Bumpas underwent surgery at John Peter Smith Hospital and is recovering well. He has already been released so he can heal at home.\nThe suspect is still recovering in the hospital. Once released, he will be taken to the Parker County Jail and charged with his original warrant, as well as aggravated assault of a peace officer.\nThe officer who fired the shots has been placed on administrative leave, a standard procedure for officers involved in shootings.\nOfficer Bumpas has been with WPD for one year and was awarded Rookie of the Year, according to the department's Facebook page.\nChief Mike Manning released the following statement:\n“We are ecstatic that Officer Bumpas has been released from the hospital and allowed to go home to recover along-side his family. We would like to thank all of the citizens, fellow law enforcement agencies and personnel for their continued support of Officer Bumpas and the Weatherford Police Department. We would also specifically like to thank the staff at John Peter Smith Hospital, the Fort Worth Police Department and the Fort Worth Police Officers Association for the attention they provided to Officer Bumpas and his family during his hospital stay and release. We have truly been blessed by the outpouring of community support for the officers involved in this incident and are extremely grateful for all of the prayers and well wishes we continue to receive.\"\nCopyright 2016 WFAA"}