{"uri": "http://dfw.cbslocal.com/2016/12/30/weatherford-officer-suspect-both-shot-during-struggle/", "title": "Weatherford Officer & Suspect Both Shot During Struggle", "dct": "Fri, 30 Dec 2016 05:51:00 GMT", "id": "f61a55011db5972f38d63d73929011d1", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nUPDATE 4:15 p.m. Friday: Weatherford Police Sgt. Randall Hates told CBS11 the wounded officer is in good condition and in good spirits and could be released by Monday, but remains under doctor’s care in the hospital at this time.\nThe suspect is in guarded condition in the hospital.\nWEATHERFORD (CBSDFW.COM) – A police officer in Weatherford was shot in the line of duty during a Thursday night traffic stop. The suspect was also struck by gunfire. Both individuals are now recovering in the hospital. This incident began at about 9:15 p.m. with a struggle in the parking lot of Tequila Bar & Grill, located along Tin Top Road.\nAuthorities explained that Officer Chris Bumpas stopped a vehicle with three people inside. Bumpas called in for backup when he realized that one of the individuals had active warrants. When backup arrived, the two officers attempted to arrest the man, but police said that the suspect became combative.\nThe suspect struck Bumpas with a metal flashlight. At that point, the second officer at the scene used his Taser on the suspect. However, it was unable to subdue the man. When the Taser did not work, the second officer fired gunshots. His gunfire struck both Bumpas and the suspect.\nThe Texas Rangers are now taking over the investigation.\n“We have a smaller agency here. We’re not numbers,” said Sgt. Jason Hayes of the Weatherford Police Department. “We know all the officers. We know the families. We’re with him, and we’re going to be with him, and monitor him, and make sure he’s fully recovered. That’s the most important thing on our agenda right now. We’ll let the Rangers do their job.”\nBumpas was hit in the stomach and is now at JPS Hospital in Fort Worth in good condition. Meanwhile, the suspect is said to be in “guarded condition,” but his medical status is unknown. Once the suspect recovers, he will head to Parker County Jail on felony charges. His name has not been released by police at this time.\nThe officer who pulled the trigger and shot both men has been placed on a routine administrative leave. His name has also not been released. Hayes added that there should be video footage for the Texas Rangers to review. Nobody inside of the Tequila Bar & Grill was injured.\nBumpas is relatively new to the Weatherford Police Department. He was recently given the Rookie of the Year award."}