{"uri": "http://www.nj.com/hudson/index.ssf/2015/05/4_women_shot_on_jersey_city_street_5_charged_with.html#incart_river", "title": "4 women shot on Jersey City street; 5 charged with weapons", "dct": "Mon, 11 May 2015 14:25:00 GMT", "id": "8d6baf37766ae56ab74fffadec1340ad", "content": "JERSEY CITY -- Four women were shot on Bostwick Avenue in Jersey City late last night and five people, including one minor, have been charged in connection with the incident, police said.\nThe women, three from Jersey City and one from Bayonne, all told police that they heard gunshots, but none saw who shot them at 11 p.m. on Bostwick near Martin Luther King Drive, police said.\nA 42-year-old woman was grazed by a bullet in the hamstring area; a 19-year-old from Bayonne was shot in the left shoulder; a 19-year-old from Jersey City was shot in the right thigh; and a 25-year-old from Jersey City was shot twice in the left foot and twice in the left pelvis area.\n\"Police responded immediately to the scene and witnessed a handgun being tossed from a fleeing vehicle, as well the discarding of another handgun from a separate vehicle in the area,\" Jersey City spokeswoman Jennifer Morrill said. \"Both handguns were recovered.\"\nDecota Chisolm and Robert Warren, both 22, and Steven Howard and Hassan McNair, both 18, and a 17-year-old, all of Jersey City, have been charged with weapons offenses related to the shooting, police said.\nAll four men appeared in Central Judicial Processing court this afternoon in street clothes with their hands cuffed behind their backs.\nChislom's bail was set at $65,000 cash or bond. There was also a warrant from his arrest on a simple assault charge related to a Dec. 10 incident. His bail on that matter was set at $5,000 with a 10 percent cash option and that charged will be heard in Jersey City Municipal Court\nWarren has an open robbery charge before Hudson County Superior Court John Young and Young will set his bail on the new charges.\nBails for Howard and Hassan and were set at $50,000 cash or bond.\nMeanwhile, a resident of the neighborhood said this morning that she stayed inside after hearing the gunfire last night.\n\"I heard five, six, seven shots and I was in my house and I didn't run out to see who was shooting,\" said the resident, who chose not to be identified. \"Everyone in my family was accounted for and we stayed inside.\n\"At 11 p.m. there are usually people out here, but it's not crowded and rowdy.\"\nThe investigation, by the Jersey City police Cease-Fire Unit, is continuing, \"and additional charges are pending,\" Morrill said.\nJersey Journal Staff Writer Michaelangelo Conte contributed to this report."}