{"uri": "http://www.timesunion.com/local/article/No-new-details-in-Schenectady-fatal-shooting-9229553.php", "title": "Schenectady police make arrest in fatal shooting", "dct": "Sat, 17 Sep 2016 00:00:00 GMT", "id": "90042326cf3ec323cafbc8a38274f752", "content": "SCHENECTADY — City police said Saturday a man who dated 17-year-old Medina Knowles is charged in her murder Thursday night at her home.\nDetectives arrested ReaQwan U. Stover, 19, of 1522 State St., Schenectady, Saturday on felony counts of second-degree murder, criminal possession of a weapon and tampering with evidence.\nStover, who was dating Knowles, turned himself in Saturday evening, police said.\nStover is being held in the city lockup and will be arraigned Sunday morning in city court, according to police.\nKnowles died in her family's second-floor apartment at 524 Schenectady St. after being shot in the head at about 11:30 p.m. Thursday. The Schenectady High School student lived there with her mother, three younger siblings and her 2-year-old son, Jahsiy.\nStover had only recently started dating Knowles, so police do not believe he was the father of Knowles' son.\nOn Friday, next door neighbor Keya Bibbs remembered hearing two gunshots at the time of the shooting followed by Knowles' mother shouting \"he killed my daughter.\"\nKnowles was pronounced dead at the scene, and police have said that it appeared that she was shot just once in the head, although autopsy results were still pending.\nPolice have not released any other details of the shooting or what happened leading up to the killing. Neighbors said they didn't know of anything unusual going on in the apartment Friday and that Knowles had taken her son for a walk in a stroller in the afternoon.\nFamily and others present at the time of the shooting were interviewed by police after the shooting, but it is unclear when Stover became a suspect.\nNeighbors say that part of Schenectady Street has a reputation for violence, and the sound of gunshots is not uncommon.\nA little more than a year ago, in July of 2015, another teen, 18-year-old Kusaan Tolliver, was shot and died in the street on the same block.\nA memorial to Tolliver made up of bottles of cognac and prayer candles still remains on the sidewalk just three doors down from the apartment where Knowles lived.\nTolliver's death came just four days after another man was shot, but survived, on that same block as well.\nIn the wake of Knowles' homicide, neighbors said they couldn't take the violence anymore.\n\"I'm going to move,\" Anais Gonzalez, 20, who lives downstairs from Knowles, told the Times Union Friday. \"It's not a good environment for kids to grow up in.\"\nAnother neighbor, David Clark, 52, told a reporter Friday he knew Knowles and her son and has three kids of his own in his apartment.\n\"It's scary,\" Clark said. \"It happens all the time around here.\"\nOn Knowles' Facebook page, her friends shared their disbelief and sadness over her death and later their relief that a suspect had been taken into custody.\n\"Justice will be served,\" said one. \"... Great heart. We all miss you.\""}