{"uri": "http://www.nbcmiami.com/news/local/Fifteen-People-Including-Children-Shot-at-Miami-Club-277362861.html", "title": "Fifteen People, Including Children, Shot at Miami Nightclub", "dct": "Sun, 28 Sep 2014 14:57:00 GMT", "id": "7d70b15af9a38bda36f1cb87a705daa6", "content": "Fifteen people, including children, were shot in a Miami nightclub early Sunday morning. Now police are on the hunt for those responsible.\nPolice responded to a call about shots fired at The Spot club, located at NW 7th Ave and NW 64th Street, around 1 a.m. Rescuers found people wounded by gunshots both inside and outside the club.\n\"People were screaming, people were saying they were shot,\" Miami Fire Rescue Captain Ignatius Carroll told the Associated Press.\nOne clubgoer who did not want to be identified said the scene was chaotic as gunfire erupted.\n\"I just fell to the ground and balled up,\" the witness said. \"There were so many bullets, and shots from different guns.\"\nMiami Police spokeswoman Frederica Burden said fifteen people, between the ages of 11 and 25, were shot. A 15-year-old is listed in critical but stable condition after being shot multiple times. Seven people were rushed to Jackson Memorial Hospital. Some have since been released. At least three of those injured were transferred to a pediatric unit at JMH.\n\"What was very surprising to the responders was that these were kids that were out at 1 o'clock in the morning in a club, and this type of violence took place where a bunch of kids were gathering,\" Carroll said. \"It's very disturbing to see that.\"\nInvestigators said a large party was inside the club when shots rang out. Police are trying to determine how many shooters there were and the motive behind the shooting. They said it is not clear why children and teenagers were in the club.\n\"It may have been a private party but the club owner is cooperating so they could shed more light on that,\" Burden said.\nPolice hope surveillance video both inside and outside the club will shed some light on the shooting. Anyone with information is urged to call Miami-Dade Crime Stoppers at (305) 471-TIPS (8477).\nCopyright Associated Press / NBC 6 South Florida"}