{"uri": "http://koin.com/2016/11/15/accidental-death-or-domestic-violence-family-unsure/", "title": "Accidental death or domestic violence? Family unsure", "dct": "Tue, 15 Nov 2016 16:17:00 GMT", "id": "f3a6bd5de4e45a894bc0242318dc821e", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nSALEM, Ore. (KOIN) — Cassie Wilson died of a gunshot wound in South Salem last Thursday. Her death is officially being called an accident, but her family thinks her history as a domestic abuse victim had something to do with it.\n“I’m sad that we lost my sister,” Batisse Wilson told KOIN 6 News. “I’m pissed that this is a domestic violence situation that she never reported to the police.”\nBatisse said Cassie confided in her family about being abused by the man she lived with for about 8 years, a man who — Batisse said — has previouos domestic violence convictions.\nCassie and her partner were together in their apartment when the gun went off. The 29-year-old was shot in the abdomen, and before she died she told police she was handling the gun went it went off accidentally.\nBatisse said Cassie was not a gun person, but she purchased the weapon at her boyfriend’s repeated request. As a convicted felon, he’s not allowed to buy a gun himself.\nAccidental death or otherwise, the Wilson family believes her abusive situation is what led to her death.\n“It doesn’t matter. The gun was there. She was not trained. She was a novice,” Batisse said. “It was a repressive situation and if you’re not comfortable with something in your home you need to get out.”\nShe added it’s a situation that has been seen time and time again: “The outcome from domestic violence is somebody dies.”\nCassie had a twin sister who died at childbirth. The family is making arrangement to have them buried together.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}