{"uri": "http://www.azcentral.com/story/news/local/peoria/2016/06/29/peoria-police-murder-suspect-hid-desert-four-days-wesley-considine/86527308/", "title": "Peoria police: Murder suspect hid in desert 4 days", "dct": "Wed, 29 Jun 2016 00:00:00 GMT", "id": "20c1a5eb7a673183b0038c8288a38930", "content": "Peoria police said an 18-year-old murder suspect cut off his hair and hid in the desert four days before his arrest in the fatal shooting of a 17-year-old friend and armed robbery of another.\nWesley Considine was arrested Tuesday evening by Peoria police and U.S. marshals after trying to evade police in the desert near Cave Creek, police wrote in court paperwork.\nConsidine is one of two teens facing charges of premeditated murder and armed robbery. The other suspect, 17-year-old Joseph Contreras, was arrested shortly after the incident Friday. Authorities intend to charge Contreras as an adult.\nPolice say Contreras fired the fatal shot. A police spokeswoman on Wednesday wouldn't identify the gunshot victim because he was a juvenile.\nThe shooting occurred near State Route 74 and North Castle Hot Springs Road around 3 p.m. Friday.\nAn 18-year-old man, the shooting victim, Considine and Contreras were target shooting with two shotguns Friday near Lake Pleasant when Contreras trained the shotgun on the victim, according to police.\nContreras accused the victim of stealing from him and bullying Contreras online when the victim \"made fun of him\" on social media, court records show. The plan was to target the victim with the gun and confront him about the theft.\nDuring the confrontation, Contreras pointed a pump shotgun at the 17-year-old victim, and demanded he turn out his pockets, court documents said.\nThe victim denied the theft, police said. Contreras then ordered him to turn out his pockets by the count of three, court documents said.The victim counted down from three and told Contreras to do what he had to do, court documents said.\nThe shotgun blast struck the victim in the lower right abdomen, right arm and chest area, police said. He died at a hospital.\nPolice said Contreras and Considine fled in a Ford Taurus they took from the 18-year-old at gunpoint. Contreras was arrested that night at a hotel that Considine's mother had rented days earlier, court records show. The Ford was parked in the lot outside.\nIt wasn't clear how police found Considine hiding in the desert on Tuesday.\nConsidine's next court date is a July 6 status conference, and he has a July 8 preliminary hearing in Maricopa Country Superior Court. He was being held in a Maricopa County jail Wednesday in lieu of a $1 million bond."}