{"uri": "http://www.kare11.com/story/news/local/2015/01/18/child-among-3-found-dead-in-apple-valley/21971467/", "title": "Apple Valley couple, child found dead in home", "dct": "Tue, 20 Jan 2015 00:00:00 GMT", "id": "5cc072ce6d606644651b4205201674ba", "content": "APPLE VALLEY, Minn. – A child is among the three bodies found inside an Apple Valley house in an apparent murder-suicide, according to police. Authorities located a firearm at the scene and have determined the cause of death to be gunshot wounds.\nNeighbor Collin Prochnow first discovered the bodies Saturday afternoon while checking on the home.\n\"Never heard any yelling, never heard any screaming, a husband and wife fight or anything like that,\" said Prochnow.\nHe said it appeared his neighbors hadn't been home for weeks, and the packages were piling up on their doorstep.\nProchnow rang the doorbell Saturday, but no one answered, except he heard a dog barking inside the home.\nWhen he peeked through the window, Prochnow said he saw three bodies on the ground with a black handgun next to them.\n\"Shock. You have something that happens like that next door and you don't really know when it happened. And the little girl, why did they have to take the little girl with them when they do things like that?\" said Prochnow.\nThe Hennepin County Medical Examiner's Office has not yet identified the bodies, but the neighbors identify the family as David Crowley, his wife, Komel Crowley, and their five-year-old daughter.\nProchnow said David Crowley was a filmmaker, who wrote and directed a recent film about the militarization of the U.S. called \"Gray State.\" Crowley appeared in an online program two years ago to promote the film, which has not been released. The film's website states a crowd funding campaign raised more than $60,000 to make the film.\nKomel Crowley was a self-employed dietitian who operated a business called Mind Body Dietitian. She studied at the University of Minnesota and her LinkedIn page shows she previously worked at Park Nicollet's Melrose Center, specializing in treating eating disorders.\nProchnow said he can recall a night in December when he awoke to something that sounded like gunshots but never thought anything of it, not until Saturday when he discovered the bodies. David Crowley's Instagram account shows him posing with numerous guns. Neighbors had also seen guns in his garage, but didn't know if they were real or if they were props from his movie."}