{"uri": "http://wdtn.com/2015/06/12/3-year-shot-shot-himself-after-finding-gun/", "title": "Gun expert speaks after 3-year-old dies from self-inflicted gunshot", "dct": "Fri, 12 Jun 2015 12:50:00 GMT", "id": "d6ea1248d8c4af2d23e7d05414697a9e", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nHAMILTON, Ohio (WDTN) – Hamilton police say a 3-year-old boy shot himself while playing with a handgun he found inside his mother’s purse.\nThe boy is identified as Marques Green. He was found Thursday afternoon with a gunshot wound to the chest at an apartment at 709 Gordon Smith Boulevard.\n“She ran outside screaming and yelling that she needed a phone,” said Amanda Reid, a neighbor.\nReid recounted to media that she saw the boy’s mother run out of the apartment carrying the boy and screaming that he shot himself in the chest. An image she hopes no parent has to see.\n“Put your guns up, lock em’ up, if you feel like you have to have them, lock up and don’t have them loaded,” said Reid.\nPolice say the mother called 911 and told dispatchers that she carried the weapon in her purse. She set it down after getting home.\nThe boy died at the hospital.\nGun expert, Ray Nickel says gun-owners need to arm themselves with safety information so tragedies like these don’t happen.\n“You have to be constantly aware and not just initially you cant get lax on storage, keeping a conscious effort to know where your firearm is and where your child is at all times,” said Nickel.\nNickel says you also want to know how to store it, firearms can be kept in a locked safe or something inexpensive like a trigger lock.\n“It’s a mechanism that goes onto firearms in such a manner that it prevents anyone from actually contacting the trigger and firing the firearm,” explained Nickel.\nButler County Prosecutor Michael Gmoser says the case will be heard before a grand jury to decide upon charges.\nThis is the second incident in just over a week in Hamilton in which children playing with a gun ended tragically. A 16-year-old boy is charged with reckless homicide after shooting a 14-year-old boy on June 3 while the two were playing with a gun.\nThe .5 million project is at the I-70 and Ohio 41…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}