{"uri": "http://www.nbcphiladelphia.com/news/local/Dead-Murder-Suicide-Berks-County-389398512.html", "title": "Police Find Handwritten Note in Home of Family of 5 Killed in Murder-Suicide", "dct": "Wed, 10 Aug 2016 14:33:00 GMT", "id": "b7034123ef0de91bdb1fa522353bc576", "content": "UPDATE: Relatives of Mark Short spoke with NBC10, giving some insight into the couple's relationship. Read that story here.\nA family of five, including three small children, was found dead in their Berks County, Pennsylvania, home on Saturday along with what authorities described as a handwritten \"murder-suicide note.\"\nPolice in Sinking Spring, just outside Reading, responded to the family's home on Winding Brook Drive at about 2 p.m. Saturday after a concerned relative asked them to make a welfare check on the family, according to the Berks County District Attorney's Office.\nInside the home, police found 40-year-old Mark Jason Short Sr., his wife, Megan L. Short, 33, and the couple's three children, 8-year-old Liana, 5-year-old Mark Jr. and 2-year-old Willow, all dead of gunshot wounds. A dog was also found dead. Authorities said Megan Short was supposed to meet a relative for lunch Saturday, but never showed up and never answered her phone.\nThe district attorney's office also said Sunday morning that responding officers discovered what appears to be a handwritten \"murder-suicide\" note in the home, as well as a handgun \"near one of the deceased adults.\"\nAuthorities have not said what the note contained or who they think was the shooter, but noted that an investigation revealed the couple had been having \"domestic issues.\" The family had also been grappling with a child's illness and post-traumatic stress.\nArticles in The Reading Eagle in 2014 and The New York Times in 2015 profiled the family after Willow, the youngest of their three children, underwent a heart transplant as an infant. The news stories detailed the family's difficulties obtaining anti-rejection medication for Willow.\nA blog post Megan Short wrote in April about her family's ordeal treating Willow's heart condition sheds some light on the struggles they faced.\nIn a post titled \"Learning to Heal: My Experience with PTSD\" on the Philly at Heart blog, Megan Short wrote of watching her daughter undergo heart surgery as a baby, and of the lasting impact the traumatic experience left on her.\n\"There are very few moments when you can clearly see your life as separated into the before and after,\" Megan Short wrote. \"Having a child born with a severe congenital heart defect has been the most significant shift of my life.\"\nIn the post, Megan Short recounts not being able to hold Willow until three days after she was born, before sending the baby to surgery.\n\"I can still feel the emotions and fear as the doctors told me that she would not survive the massive bleeding she was experiencing post-surgery,\" the mother wrote. \"I still see her tiny heart beating through the dressing used to cover her open chest and all the tubes and wires and machines as I wondered if they would be able to keep her alive until a donor heart became available.\"\nThe mother chronicled the heartbreaking struggles she and her family faced as Willow underwent treatment for her heart condition and eventually came home, and she wrote about the affect it had on her as a mother and as a person.\n\"I have anxiety and nightmares. Certain smells and hallways trigger memories every single time ... None of this ever got easier,\" she wrote, adding that she began taking medication and going to therapy for PTSD.\n\"As I work on my own mental healing, I wanted to share my experience so that other parents know they are not alone,\" Megan Short wrote. \"Sometimes you will feel even worse during the process, but keep going. It is worth it.\"\nDespite the family's struggles, Mark Short's Facebook profile shows the couple and their three blond-haired children smiling in dozens of photos.\nIn another picture of him with his wife that he posted in December, the two grin in black and white.\n\"She's still the most beautiful girl that I've ever met,\" Mark Short Sr. wrote in a comment on the photo. \"I'm the luckiest guy in the world to have her as my life and the mother of my three amazing children.\"\nThe Associated Press contributed to this story.\nIf you or someone you know is considering suicide, contact the National Suicide Prevention Lifeline at 1-800-273-8255 or visit the American Foundation for Suicide Prevention."}