{"uri": "http://www.syracuse.com/crime/index.ssf/2015/04/man_charged_with_opening_fire_in_pub_near_rochester_1_dead_6_injured.html#incart_river", "title": "Man charged after opening fire in pub near Rochester; 1 dead, 6 injured", "dct": "Sun, 26 Apr 2015 09:05:00 GMT", "id": "643c1f3adab5b97368f63d43e3231c10", "content": "GATES, N.Y. -- Police charged a man Saturday after he opened fire at a pub just outside of Rochester, killing one person and injuring six others, reports say.\nDavid Alligood, 31, of Greece, admitted to police that he began shooting around 1:30 a.m. Saturday at the Gates Pub at 26 Hinchey Road, less than 10 minutes outside of Rochester, the Democrat and Chronicle reports. Surveillance footage also allegedly shows Alligood as the shooter.\nGreece man charged in Gates Pub fatal shooting http://t.co/NJN6w6Dv87 #13WHAM pic.twitter.com/HDhJxo52NL\n— 13WHAM (@13WHAM) April 26, 2015\nThe report says Alligood was taken into custody after police became suspicious of him when they saw him about a half-a-mile away from the shooting talking on a cell phone on the side of the road.\nWHEC in Rochester reports that Ricky C. Jones, 37, of Rochester, was shot in the torso multiple times and died. Six other people were taken to the hospital. One was in guarded condition in intensive care and four others were in satisfactory condition. One was treated and released, the report says.\nFamily remembers Gates Pub shooting victim http://t.co/08xsVf7Mid #13WHAM pic.twitter.com/D8mbGP1iiJ\n— 13WHAM (@13WHAM) April 26, 2015\nPolice said Jones was the intended target and the six other victims were caught in the crosshairs of the men's dispute.\nAlligood is charged with second-degree murder. He was arraigned in Gates Town Court where he pleaded not guilty, 13 WHAM ABC reports.\nRecords show that Alligood was released on parole Sept. 16, 2014 after being convicted of felonies for two counts of third-degree criminal sale of a controlled substance and criminal sale of a controlled substance and criminal sale of a controlled substance at a school.\nBREAKING: at least 6 injured, 1 dead in Gates Pub shooting. #ROC pic.twitter.com/QCJe6Uz7Fa\n— TWC News Rochester (@TWCNewsROC) April 25, 2015\nContact Jolene Almendarez anytime: 315-418-8746 | Email | Twitter | Facebook"}