{"uri": "http://www.deseretnews.com/article/865657551/Teenage-shooting-victim-identified.html?pg=all", "title": "'This is a cold world': Family mourns as search continues for 16-year-old boy's killer", "dct": "Wed, 06 Jul 2016 14:50:00 GMT", "id": "26637bcdec101cf7f8cda04ac0ba1769", "content": "Jeynnie Valldovinos, center left, is comforted by Harley VanSant during a vigil for shooting victim Paris Gustin at Liberty Park in Salt Lake City on Wednesday, July 6, 2016. Jeynnie is Paris' girlfriend.\nSALT LAKE CITY — Michael Begay held up a photo of a teenage boy with a wide grin on his face.\n\"This is the last time that I had seen my son,\" Begay said, looking around at more than 100 mourners who gathered Wednesday to remember 16-year-old Paris Gustin.\nGustin, of Salt Lake City, was inside a Honda with two other juveniles when shots were fired from someone in another vehicle in the Fairpark neighborhood near 600 North and 1100 West.\nThe search continued Wednesday for the gunman who shot and killed Gustin. Meanwhile, Begay and others consoled each other, lit candles and prayed together at a vigil held in his honor at Liberty Park.\nBegay, Gustin's stepfather, said the teen made friends with everyone.\n\"That's something I liked about him,\" he said.\nIn his prayer, Begay asked that the young people gathered at the vigil \"be protected from these streets.\"\n\"This is a cold world,\" he told his fellow mourners. \"You never know what's going to happen day to day.\"\nTeenagers embraced at a table filled with pictures of Gustin, flowers and burning candles. Candles were raised in unison as Gustin's family gave short remarks on his life.\n\"He was kind; he was loving,\" said Gustin's grandmother, Victoria, who asked to be identified only by her first name. \"He had the biggest heart and he helped everybody.\"\nBrandView\nThe woman didn't mince words about whoever killed her grandson.\n\"What crazy coward would kill a young boy?\" she asked the crowd.\nVictoria said her grandson was not involved with any gangs. She said she believes someone retaliated against Gustin for throwing an egg at their car. She said she wants the person responsible for his death to be brought to justice so others aren't also hurt.\nPolice believe there was some sort of confrontation between passengers in the two vehicles that led to the shooting. Gustin was in the front passenger seat of the Honda when shots were fired from behind the vehicle about 4 a.m. Tuesday.\nThey stopped on American Avenue, near 960 South and 1100 West, where Salt Lake police found Gustin dead.\nNo arrests had been made as of Wednesday, and no suspects had been named publicly. Police also have not released a description of the other vehicle.\nA GoFundMe page was set up by Gustin's aunt, who is the sister of the boy's mother, Ashley.\n\"Ashley and Paris had a relationship that was envied by all who knew them. They weren't just mother and son, they were best friends. Everything she did, she did for him. And Paris watched over and protected his mother always. Paris was an amazing young man with an infectious, beautiful smile. He loved his family, his girlfriend and those who were close to him with all his heart. He will be dearly missed,\" she wrote.\n\"No mother should have to lay her child to rest, let alone to senseless, horrible tragedy.\"\nAnyone with information on the shooting can call police at 801-799-3000.\nTwitter: DNewsCrimeTeam"}