{"uri": "http://www.ksl.com/?sid=41121031&nid=148&title=mother-of-teen-shot-for-egging-vehicle-makes-plea-to-find-killer", "title": "Mother of teen shot for 'egging' vehicle makes plea to find killer", "dct": "Thu, 18 Aug 2016 00:00:00 GMT", "id": "3006d15cb2947ba277e8642ee042716f", "content": "SALT LAKE CITY — The mother of a 16-year-old gunned down in July made a tearful plea Thursday for anyone with information about her son's killer to step forward.\n\"I dread going to sleep as I now know what awaits me every morning: the horrible reality that my child is dead and that I will never see his beautiful face again,\" Ashley Gustin said of her only child, Paris Gustin.\n\"I will never hug him. I will never see him get married or be a father. And most importantly, I will never tuck him in at night and give him a goodnight kiss even at 16-years old,\" she said.\nAbout 4 a.m. on July 5, Paris was inside a Honda with two other juveniles when someone in another vehicle in the Fairpark neighborhood near 600 North and 1100 West fired several shots at them. Paris, who was in the front passenger seat, was hit and killed.\nDuring a news conference Thursday at the Salt Lake City Police Department, investigators revealed for the first time that Paris and his friends had been out \"egging\" other vehicles. The driver in the vehicle that chased after them and fired multiple shots had been hit by their eggs.\nPolice say such vandalism happens frequently, and it doesn't justify going after someone or retaliating with a gun. In those cases, police say it's best to just call an officer.\n\"You have not only robbed my child of his life but my family and I of ours,\" Gustin said, addressing the shooter directly. \"You hunted my child and his friends down as they fled in terror. And for what? For doing what we have all done as kids — throwing an egg.\n\"The only comfort I take is that the hell I live now and continue to live is nothing compared to the one you are yet to face. I will make sure I will live as long as possible just to make sure you too never see the light of day. This I promise you,\" she said.\nGustin said what she has been through is a \"parent's worst nightmare\" and \"a pain no parent should endure.\" She also encouraged anyone with information to step forward, and not be someone who abides by the unwritten code of not snitching.\n\"Think for just a (moment) what it's like to have life as you know it completely ripped away from you in a matter of seconds,\" she said. \"And I know in Glendale and in this area there's a certain code people live by. And this code hurts families. I will have to live the rest of my life without my child because he threw an egg.\"\nGustin said this isn't a \"black, white or brown\" issue.\n\"This is not about race because we are all about part of one race and that's the human race,\" she said.\nPolice believe the shooter was in a white Nissan Sentra with fog lights, a small rear spoiler and tinted back passenger and rear windows.\nAnyone with information can call police at 801-799-3000, or submit a text anonymously by typing the keyword “TIPSLCPD” and sending it to “CRIMES” (274637).\nPhotos"}