{"uri": "http://www.deseretnews.com/article/865663316/Person-of-interest-in-teens-murder-arrested-after-ramming-WV-patrol-car.html", "title": "Person of interest in teen's killing arrested after ramming W.V. patrol car", "dct": "Mon, 26 Sep 2016 10:55:00 GMT", "id": "f8e5f4cae7edf7c507c6d458047ada72", "content": "Jonathan Ivan Padilla-Lopez, 23, was arrested early Monday after allegedly ramming a West Valley police car and attempting to hit a second. He is also a person of interest in the July shooting death of 16-year-old Paris Gustin.\nJonathan Ivan Padilla-Lopez, 23, was arrested early Monday after allegedly ramming a West Valley police car and attempting to hit a second. He is also a person of interest in the July shooting death of 16-year-old Paris Gustin.\nSALT LAKE CITY — One of the men Salt Lake police called a person of interest in the shooting death of a 16-year-old boy who had been egging vehicles was arrested early Monday after allegedly ramming a West Valley police car and leading officers on a short chase.\nJonathan Ivan Padilla-Lopez, 23, was booked into the Salt Lake County Jail for investigation of two counts of assault on a police officer.\nHe was not arrested Monday for investigation of any charges related to the shooting death of Paris Gustin, though Salt Lake homicide detectives interviewed him. It was not immediately clear Monday whether Padilla was still considered a person of interest in Paris' death.\nPolice had been looking for Padilla for more than a month. Ironically, he was arrested after allegedly stealing a vehicle that belonged to a man also being sought by police. That man was wanted on a federal warrant for child sex crimes and a federal probation violation.\nPadilla was arrested about 3:40 a.m. by West Valley police. Officers were looking for a man wanted \"on numerous child sex offenses\" and spotted a vehicle owned by the man, said West Valley police spokeswoman Roxeanne Vainuku.\nAfter a man got into the vehicle, police followed it into Salt Lake City. When the car pulled into a driveway near 10th Avenue and L Street, police attempted to make a traffic stop.\n\"The driver put the vehicle in reverse and rammed an officer's vehicle, which disabled it in the roadway,\" Vainuku said.\nThe driver then backed around the vehicle and attempted to hit another police car before fleeing, she said. Police initially began chasing the man but quickly called off the pursuit because of the man's reckless driving in a residential area.\nThe car was found abandoned at 1000 E. Kensington Ave. A Salt Lake police K-9 was called and the bloodhound found Padilla hiding in a yard a couple of blocks away, Vainuku said. When he was found, he had a loaded handgun lying at his feet, she said.\nInvestigators learned that Padilla had just stolen the vehicle he used to allegedly ram the police car.\nBrandView\nAfter his arrest, Padilla was taken to the Salt Lake City Police Department for questioning.\nIn August, police asked for the public's help in locating Padilla and Fortunato Nato Villagrana in connection with the July 5th shooting death of Paris Gustin.\nParis was inside a Honda with two other juveniles driving around and \"egging\" other vehicles in the Fairpark neighborhood near 600 North and 1100 West when someone in a white Nissan Sentra with fog lights, a small rear spoiler, and tinted back passenger and rear windows fired several shots at them.\nParis, who was in the front passenger seat, was hit and killed.\nAccording to Utah court records, a warrant was issued for Villagrana's arrest nearly a year ago for failing to show up in court on a felony theft by receiving stolen property case.\nTwitter: DNewsCrimeTeam"}