{"uri": "http://www.stltoday.com/news/local/crime-and-courts/eureka-police-retrace-final-hours-before-murder-suicide-of-woman/article_629c8738-120c-5e06-b4c2-f930f7cae500.html", "title": "Eureka police retrace final hours before murder-suicide of woman, 6-year-old granddaughter", "dct": "Fri, 02 Oct 2015 00:00:00 GMT", "id": "8520c5a9bb61dda9ac5aa8a2cdbc51f6", "content": "UPDATED at 10:30 a.m. Friday\nEUREKA • Colleen Church picked up her 6-year-old granddaughter an hour early from school Monday. They drove to a hotel as they had done several times before, calling it a girls night out.\nBut Church, 50, had other plans this time, a murder-suicide, and Eureka investigators hope to unravel the reasons behind it.\nPolice trying to trace Church’s final hours and days say it appears she was under mounting pressures in her life. They also say she had untreated depression.\nSometime that night or the next morning, Church shot her granddaughter, Alexis, once in the head then shot and killed herself in a first-floor room at the Holiday Inn at 4901 Six Flags Road.\nTheir bodies were found, clothed and in the bed, by hotel staff at 11:30 a.m. Tuesday. An autopsy determined they both died of a single shot to the head. Routine toxicology tests are pending.\nLt. David Wilson of the Eureka police said Thursday that investigators haven’t found a suicide note, but they are learning from relatives what kind of pressures Church was facing.\nFriends of Church’s told the Post-Dispatch that one of her two sons died of a drug overdose five years ago, and her husband also died, compounding her stress and depression.\nChurch had custody of Alexis, who had some emotional issues and needed special attention, Wilson said. Church’s 81-year-old mother, who had Alzheimer's, had been in a nursing home but was to move back in with them soon, with Church as caretaker.\n“So obviously those situations bring on stress,” Wilson said. “The mental health issues are obviously the cause for this, but did she just feel she’s the only caretaker for the child and if she’s going to take her own life, who’s going to take care of the child?”\nChurch had custody of Alexis since 2011, according to court documents. Alexis was the daughter of Michael S. Church and Tabitha Hamm-Picard, who agreed to let Colleen Church take custody.\nColleen Church lived at her mother’s town house in the 1500 block of Forest Springs Drive in an unincorporated area of west St. Louis County. She lived there with Michael Church and Alexis. They helped raise the girl together, Wilson said. Church's elderly mother had Alzheimer's, relatives say, and was known to slip out of the town house and wander the neighborhood when Church left to pick up Alexis from school.\nColleen Church had sought help for depression and was treated with medication at times over the years, police said. But she wasn’t consistently treated.\n“It didn’t sound like she had a doctor she saw regularly,” Wilson said.\nAlexis’ other grandmother, Kim Hamm-Picard, said she knew Church had faced depression and sorrow.\n“I feel bad for Colleen,” Hamm-Picard said. “She’s been handed more than a person can handle.”\nBut she can’t understand killing Alexis. Hamm-Picard said her own daughter, Alexis' birth mother, is a heroin addict and unable to care for the child. But Hamm-Picard, who lives in Wildwood, a few miles from the hotel, said she or the girl's aunt would have taken the girl if Church had called. Relatives would have stepped up “in a heartbeat,” she said.\n“It’s very selfish,” said Hamm-Picard, 57. “The nerve of her to take Lexi from us. I don’t get it.”\nOne family friend said Church had behaved oddly in recent days, and those close to her are questioning things they didn’t act on. But Hamm-Picard said she had spoken to Church a few weeks ago and nothing seemed amiss.\nMichael Church was shell-shocked and teary-eyed Thursday when he stopped by the house to retrieve some belongings. He said he was not ready to talk.\n“I do want to explain everything,” Michael Church said. “I do want to give out details because I think people need to know, but I want to make sure I have my message right.”\nUNHEARD SHOTS\nIt wasn’t unusual for Colleen Church to take her granddaughter for a night’s stay at a hotel. “They would call it a girls night out,” Wilson said. But it was unusual that she picked her granddaughter up early from school. Michael Church was concerned when he tried calling and texting his mother and was unable to reach her, Wilson said.\nHe went to work Monday evening, and grew more concerned when he returned home and they still weren’t there.\nThe time of death isn’t clear. No one at the hotel reported hearing gunshots; the rooms on either side were vacant. The hotel staff remembered seeing the woman and little girl on Monday evening but nothing seemed unusual. Employees found the bodies after the Churches failed to leave by the 11 a.m. checkout deadline Tuesday.\nPolice found a handgun in the hotel room. Michael Church is working with police to learn more about medications his mother may have been prescribed in the past or missed taking.\nA day before she checked into the hotel, Colleen Church reposted on her Facebook page a photo that said, in part: “You never truly know the daily struggle of others.” But she also shared a funny picture of a dog and another post saying she had done well on a test of commonly misspelled words. “Not to brag. Lol,” she wrote."}