{"uri": "http://www.rawstory.com/2016/04/alaska-man-fatally-shot-while-taking-photos-of-people-firing-off-rounds-at-gravel-pit-gun-range/", "title": "Alaska man fatally shot while taking photos of people firing off rounds at gravel pit gun range", "dct": "Tue, 19 Apr 2016 10:43:00 GMT", "id": "9ca6e16c1fd4833295c3a9677f7065b6", "content": "An Alaska man was shot and killed Saturday while photographing acquaintances shooting guns at a gravel pit.\nAdam Malaby apparently stepped into the line of fire about 8:30 p.m. while attempting to photograph or record video of someone else firing a .40-caliber pistol at a makeshift shooting range in Sutton, reported the Alaska Dispatch News.\nState troopers are investigating the shooting as an accident.\nThe gravel pit area is not set up as a formal shooting range, but investigators said it’s commonly used for that purpose.\n“The ricochet bullets and the explosions you don’t really get used to — makes me nervous every time,” said James Meyers, who lives nearby. “I figured it was only a matter of time. With all that goes on up there, so many people shooting and so many indiscriminate directions without really any rules or guidelines.”\nThe 30-year-old Malaby was flown by helicopter to a hospital in Anchorage, where he was pronounced dead.\nThe name of the shooter was not released, and state troopers have not said how many gun owners were firing at the time.\nMalaby, a U.S. Army veteran, was trained to handle weapons, but some people who have been to the makeshift shooting range said he likely didn’t realize he was in harm’s way.\n“I have had cases where people have fired guns in my direction from behind me,” Dillon Barron, who has been to the gravel pits but now avoids the area. “There’s usually never a firing line established and other shooters fail to communicate with one another if they have to go downrange. This is where it gets dangerous. Add alcohol and ATV riders to the mix, and you can easily see how it’s an accident waiting to happen.”\nInvestigators have not said whether alcohol was involved in the fatal shooting, but neighbors have asked city officials to improve safety conditions at the gravel pits — which they said attracts drugs and crime.\n“Alcohol, drugs, there’s people talking about hypodermic needles sitting out there,” Meyers said. “Some people are comparing it to like the Wild West. You can just go out there and do what you want to do.”\nNo charges have been filed in Malaby’s shooting death.\nWatch this video report posted online by KTVA-TV:"}