{"uri": "http://www.lowellsun.com/breakingnews/ci_26036234/four-people-shot-lowell-highlands", "title": "Four people shot in Lowell Highlands", "dct": "Thu, 26 Jun 2014 05:17:58 GMT", "id": "1c260a304def1bdb4c9efb4b4da0c037", "content": "By Robert Mills rmills@lowellsun.com\nLOWELL - At least four people were shot, including a woman who was shot in the chest, when gunfire erupted outside a birthday party on Midland Street in Lowell on Wednesday night shortly before midnight.\nPolice said a female who was shot in the chest suffered what appeared to be the most serious wounds. It was not immediately clear if her injuries were life threatening.\nAt least three other people were shot, including a male who was shot in the leg. The gender and injuries suffered by two other gunshots victims were not immediately clear since they were taken to city hospitals in personal vehicles.\nThe female who was shot in the chest and the male who was shot in the leg were taken to the hospital by ambulance. The shootings occurred at 58 Midland St., a well-kept white house about two blocks up from Chelmsford Street in the city's Highlands neighborhood.\nNeighbors said there had been a party there much of the night, but that aside from loud noise there had not been previous problems. Neighbors said there have been frequent parties at the home since a new family moved in about a year ago.\nSeveral neighbors said they heard noises that they believed were fireworks since there have been numerous instances of fireworks going off in the area recently. It was not until emergency vehicles flooded the street that many neighbors began to realize what happened.\nOne man said he heard at least seven gunshots fired in rapid succession.\nTo view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nPolice said they recovered more than seven shell casings in the street in front of the home, but could not immediately provide an exact number.\nLast July 13, just before midnight, police responded a few blocks away to a shooting at Forest and Blodgett streets. In that incident, a man was shot several times and hospitalized.\nPolice said the incident does not appear to be random.\nAnyone with information is asked to call Lowell police at 978-937-3200 or Crimestoppers at 978-459-TIPS (8477). Tipsters can remain anonymous, but can receive up to $1,000 for information leading to an arrest.\nFollow Robert Mills on Twitter and Tout @Robert_Mills."}