{"uri": "http://www.kansascity.com/news/local/crime/article97017952.html", "title": "Couple accused of child abuse in fatal KC gunfight, say they couldn’t find a sitter", "dct": "Sun, 21 Aug 2016 12:28:00 GMT", "id": "42bd25d168da12141461d875963a6b30", "content": "A Belton man and his girlfriend have been charged with child abuse and child endangerment for allegedly firing guns near their children during a drug deal that turned into a quadruple shooting Thursday night in Kansas City.\nOne man was shot to death, and one of the children was critically wounded. The man and his girlfriend had injuries that were not considered life-threatening.\nDarrell Roberson, 28, and Roselynn S. Kuntz, 25, each face felony charges, Jackson County Prosecutor Jean Peters Baker announced Sunday.\nAccording to court records:\nPolice responded to the scene of a shooting behind a Church’s Chicken near Prospect Avenue and Gregory Boulevard. They found a man shot to death in the parking lot and Roberson and Kuntz with two children, 2 and 3 years old. The younger child had a gunshot wound to the head. Roberson and Kuntz also had been wounded.\nfacebook twitter email Share\nQuadruple shooting called 'a devastating scene' by police spokeswoman\nKansas City police investigated a shooting Thursday evening that left one dead and three injured, including a child. Police Sgt. Kari Thompson gives a statement.\nIan Cummings The Kansas City Star\nRoberson reportedly told police he had set up a drug deal with a man he only knew as “D.” Roberson allegedly said he went Church’s Chicken to sell a pound of marijuana. The couple reportedly had two loaded handguns with them inside the Chevrolet Uplander.\nRoberson originally was in the front passenger seat of the van but had “D” sit there when he arrived. Roberson moved to the rear seat of the vehicle.\n“D” allegedly pulled a handgun and demanded money. Roberson told police he lunged forward and pushed “D’s” handgun down. During struggle, Roberson was shot in the shoulder.\nRoberson told police that he fired his gun at “D” but didn’t think he was hit.\nKuntz told police that as Roberson and “D” struggled over a handgun, she noticed her 2-year-old daughter was struck in the head.\nDuring the struggle, Roberson dropped his handgun. Kuntz told police she picked it up and shot “D.” She didn’t know how many times she fired or where she had struck him. The 19-year-old man died from his wounds.\nRoberson told police they brought the children because they didn’t have a baby sitter.\nWhen police searched the vehicle, they found three firearms and a large amount of what appeared to be marijuana inside. They also found a large bag of suspected marijuana next to the van.\nThe intersection at Prospect and Gregory is a high crime area with frequent drug sales and other illegal activity, police said.\nfacebook twitter email Share\nCommunity reacts to Thursday night shooting\nA child remains in critical condition following a shooting that one man dead and two adults wounded.\nGlenn E. Rice The Kansas City Star\nA restaurant manager said police were given surveillance video that may have captured the shooting.\nRoberson and Kuntz are being held on $100,000 cash bond each.\nRobert A. Cronkleton: 816-234-4261, @cronkb"}