{"uri": "http://www.abc12.com/home/headlines/317964881.html", "title": "Saginaw kids looking for snake find gun instead, one child shot", "dct": "Tue, 21 Jul 2015 18:47:00 GMT", "id": "f250d0005f2d7dd662d819442823b2a6", "content": "SAGINAW (WJRT) - (07/21/15) - Children looking for snakes stumbled upon a loaded shotgun.\nThe shotgun went off, hurting a 9-year-old boy.\nIt happened Friday night at an apartment complex on Saginaw's southeast side.\nThe shotgun may have been disposed of by men who lead police on a chase three weeks ago. That was until a group of six or seven children found it.\n\"They all shook up about it, it's sad,\" said Kiesha Thomas, of Saginaw.\nThe group of young children were playing in the area of the Bridgton Place Townhomes on the southeast side of Saginaw, Friday evening. Eight-year-old Davontae Carter was part of that group, along with friends and his 9-year-old brother.\nDavontae's mother gave us permission to speak with the child. He says the kids were in hot pursuit of a snake in some weeds.\n\"We were about to find a snake, but then we found a gun,\" Davontae said. \"It was a shotgun.\"\nDavontae says one of his friends was holding the gun when it accidentally went off. Davontae's 9-year-old brother was wounded in the arm.\nThe injury was serious enough to keep the little boy in the hospital for four days. He is expected to be released on Tuesday.\n\"Kid going through something like that, with such a big gun, that's sad,\" Thomas said.\nThomas, Davontae's aunt, says there was a police chase in the complex back on June 24. Police say the chase stemmed from a shooting incident on the west side of the city and ended in the complex. Two men were arrested, but no gun was found. Police say it's possible the gun was thrown out of the car as the chase was coming to an end.\nThomas thinks management of the complex should have alerted residents to the potential threat.\n\"They could have put a note on the door, 'Well it's suspicious, we had a chase out here, there might be a gun laying around out here, watch your kids, keep a close eye on your kids,'\" Thomas said.\nWe could not reach Bridgton Place Townhomes management for comment.\nPolice are still investigating."}