{"uri": "http://www.kcbd.com/story/33048409/sheriff-shooter-died-of-self-inflicted-gunshot-wound-at-alpine-high", "title": "Officials: Alpine High School shooter was 14-year-old freshman student", "dct": "Fri, 09 Sep 2016 00:20:00 GMT", "id": "98b5450389670c22d0d7ff6fcc88d349", "content": "BREWSTER COUNTY, TX (KWES) -\nA shooting at Alpine High School Wednesday left one student shot, the suspect dead and a community in shock.\nThe Brewster County Sheriff's Office said they received a call just before 9 a.m. of a situation at Alpine High School.\nDuring a press conference on Thursday afternoon, authorities said a 14-year-old female freshman student, whose name hasn't been released, turned the gun on herself after shooting another student, possibly a 16-year-old student, in the lower extremities. That student was taken to the hospital and was released.\nAs a result of the shooting, 280 students were evacuated from the school to a church across the street while authorities worked to secure the scene. As authorities were clearing the school, a U.S. Marshal and Homeland Security officer were involved in an accidental shooting. The agent was taken to the hospital and airlifted to Odessa for treatment and Brewster County Sheriff Ronny Dodson said, \"he'll be all right.\"\nInitially, authorities went into the school and at first they didn't know the female student who was found dead was the actual shooter.\nAuthorities haven't released what type of gun was used but Dodson said in an interview earlier in the day they recovered a semi-automatic pistol next to the female student shooter's body. He said they found plenty of ammunition but didn't say how much.\nDodson stated that he was in shock and added, \"we never had an active shooter situation before in Alpine.\"\nDuring the shooting investigation, several bomb threats were called in for other locations in Brewster County. Dodson stated that a male prank caller made threats and was \"occupying a lot\" of resources. In one of the threat calls, the man stated to authorities on the phone, \"You think that what happened at the school was bad, wait until you see what happens at Sul Ross.\"\nSul Ross University currently remains an active scene with bomb dogs from Austin being called in to search the buildings on campus. We're told that Sul Ross will open on Friday on a regular schedule and classes will meet as scheduled.\nAnother call, from potentially the same caller, made a threat toward the Big Bend Regional Medical Center, by stating, \"we're going to shoot that place up.\" Authorities said the hospital has been cleared and extra deputies are keeping the location secure.\nThe last place that authorities are investigating is at the Marathon Motel. Authorities said they found \"a note\" in a hotel room and are further investigating.\nIn total, authorities said there were four active scenes, one at Sul Ross State University, one at the Big Bend Regional Medical Center, another at Alpine High School and the last at the Marathon Motel.\nCurrently, law enforcement said the male prank caller is currently their \"focus\" at this time.\nNo clear motive has been released as of yet as authorities are in the early stages of their investigation.\n\"It could have been a lot worse,\" said Dodson. \"I'm not saying we're lucky, cause we're not.\"\nSchool officials said that all schools in Alpine will be closed on Friday but will reopen on Monday. All staff will meet at the administration building at 9:30 a.m. on Friday. Administrators said all Alpine ISD athletic events on Thursday, Sept. 8 and Friday, Sept. 9, 2016 has been canceled. However, the Varsity volleyball team will play at Alpine Middle Gym against Van Horn at 10 a.m., 11 a.m. and 12 p.m. The Varsity football team will play away against Pecos at 7 p.m. Middle school volleyball will be under normal schedule in Monahans and High School and Middle School cross-country will be under normal schedule in Wink.\nNumerous agencies from all across the area are in Alpine assisting Brewster County including officers from Midland and Odessa, as well as the FBI.\nDodson added that the high school trains for these types of situations at least once a year.\nCopyright 2016 KWES. All rights reserved."}