{"uri": "http://www.pe.com/articles/killing-818782-carter-valley.html", "title": "New details revealed as Riverside man charged with killing Long Beach man in Temescal Valley", "dct": "Thu, 17 Nov 2016 00:00:00 GMT", "id": "163ac32dd55410146cb9cb4bf14d89dc", "content": "Updates with friend's comments\nA Riverside man is accused of lying in wait to shoot and kill a Long Beach man last week in Temescal Valley, according to court documents.\nDante Danil Carter, 35, was charged Wednesday, Nov. 16, in the death of 21-year-old Eric Thomas Burniston, whose body was found about 2:30 a.m. Friday by sheriff’s deputies responding to a “man down” call.\nCarter was charged with one count of first-degree murder and two counts of being a felon and a drug addict in possession of a firearm, court records show. The murder charge has two allegations of using a firearm and lying in wait, which could lengthen his sentence if he’s convicted.\nHe has not yet entered a plea. He is scheduled to appear in court Dec. 1 for an arraignment hearing. In the meantime, he is in jail in Riverside, and has been denied bail.\nOne of Burniston’s friends, Donovan Ponce, said Thursday that hearing that Carter was accused of lying in wait cements in his mind a theory that Burniston had agreed to meet someone far from home – about 60 miles – to complete a sale, probably of car parts.\nBurniston was always trying to make money, Ponce, a former classmate at Millikan High in Long Beach, said Thursday.\n“Knowing Eric, he wouldn’t go out there for no reason,” said Ponce, 21.\nRiverside County sheriff's officials have said little about the incident, and nothing about the relationship between Carter and Burniston. The criminal complaint offers a few new details, including that Burniston was shot.\nThe court documents also say Carter was in possession of a 9mm pistol on or about Nov. 11, and an AR-15 assault rifle on or about Nov. 13.\nBurniston’s body was found near Mojeska Summit and Squaw Mountains roads, off I-15 near Temescal Canyon Road south of Corona. The area is just south of Tom’s Farms and near a residential housing tract.\nCarter was arrested at 11:45 p.m. Saturday at the Moreno Valley sheriff’s station and officially booked into jail early Sunday, records show. Sheriff's officials have not said what led investigators to suspect Carter.\nCarter was convicted in 2010 of identity theft in Los Angeles County, court documents say, and served prison time.\nBurniston was not the type of person likely to get into a violent disagreement, Ponce said.\n“If you did get into an argument, he was a rational thinker,” Ponce said. “He would come up with an argument that was rational and not emotional.”\nBurniston could fit in with any crowd at Millikan High – the cool kids, the “thugs” and the “nerds,” said Ponce, who added that Burniston was anything but a thug.\n“The way this happened was really bad, and Eric wasn’t that type of dude. He was always talking about doing the right thing behind others’ backs. (He would say) ‘Let’s just do things the right way.’ He was a man of integrity and a man of his word,” Ponce said.\nBurniston had a taste for nice cars and beamed with pride over his shiny blue Mustang, Ponce said. He always had his pit bull in the car and enjoyed showing off his wheels at car meets.\nBurniston’s death, Ponce said, “still baffles me to this day. I just feel like whoever did that to him just had to be a person who didn’t care about life and whatever consequence he was going to get for doing this to Eric – he didn’t care.”"}