{"uri": "http://wishtv.com/2016/02/22/police-child-accidentally-shoots-kills-father-in-hartsville/", "title": "Police: 6-year-old fatally shoots father", "dct": "Mon, 22 Feb 2016 12:29:00 GMT", "id": "c64f18548e02df91acb59862cc8f7ffe", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nHARTSVILLE, Ind. (WISH) — A 62-year-old Hartsville man died Sunday night after police say his six-year-old son accidentally shot him.\nBartholomew County Sheriff’s deputies responded to the 200 block of Clinton Street around 9:15 p.m. When they arrived, deputies found James Lonaker with a gunshot wound to his upper body.\nPolice said it appears Lonaker’s six-year-old son accidentally shot him when he picked up an unsecured .38 caliber revolver and fired a shot. According to police, Lonaker was apparently sitting at his desk and didn’t see the child pick up the gun, which belonged to Lonaker.\nPolice say Lonaker was being flown to IU Health Methodist Hospital when he died.\n“We were best friends, I talked to my dad everyday,” said Juli Lonaker, the victim’s daughter. According to family members, Lonaker recently remarried and he has two younger children with his current wife, including the six-year-old.\nThe night of the shooting, his wife and one-year-old child were also in the house but were not hurt. For some time, Lonaker carried a concealed carry permit according to his adult children.\nJuli Lonaker explained why the family agreed to do an interview about this tragic accident.\n“We have a six-year-old brother. The biggest thing we need to get across is his well-being, that he should not have been in a situation where he could’ve got his hands on it,” said James Lonaker Jr., the victim’s son.\nThe family is asking for the public to be sensitive to this tragedy involving their little brother.\n“Some of the headlines used the word killed, my little brother is not a killer. My little brother is a little boy who likes to play and have fun and he is a good, good little boy,” said Juli Lonaker.\nSheriff Matt Myers said this was a tragic accident and wants all residents to make certain that firearms in their homes are not accessible to anyone, especially children.\nThe incident remains under investigation.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}