{"uri": "http://wavy.com/2017/01/06/virginia-beach-man-killed-in-fort-lauderdale-airport-shooting/", "title": "Virginia Beach man killed in Fort Lauderdale airport shooting", "dct": "Fri, 06 Jan 2017 17:44:00 GMT", "id": "91c411ceb2baca16df65d2d3ac8c76a0", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nFORT LAUDERDALE, Fla. (WAVY) — One of the five people shot and killed Friday at the international airport in Fort Lauderdale, Florida was a man from Virginia Beach.\n10 On Your Side spoke with the daughter of the victim, who said her father, 62-year-old Terry Andres, died at the airport.\nAndres had a birthday coming up later this month, his daughter says. He was at the airport to go on a vacation with his wife, who was unharmed in the shooting.\nThe Andres family is distraught over the loss and has asked for privacy at this time.\nAndres joined the Oceana Volunteer Fire Department/VBFD as a volunteer support technician in 2004, the department said Saturday.\nThe department issued a statement Saturday:\nHe was well liked and respected for both his dedication to being a volunteer as well as his professional approach to his job as a support tech. We mourn his passing as we do all the victims of the senseless attack in Ft. Lauderdale.”\nAndres also worked at the Norfolk Naval Shipyard for 20 years, the shipyard said in a statement Monday.\nNorfolk Naval Shipyard lost a member of our family in the tragic shooting in Fort Lauderdale. Our thoughts and deepest sympathies go out to Terry Andres’ family and friends during this difficult time.\nAndres, who served the shipyard and the U.S. Navy for 20 years, most recently worked as a civilian Radiological Control Technician. He will be deeply missed by all who knew him.”\n10 On Your Side spoke with Governor Terry McAuliffe Friday, who had this to say about Andres’ death: “This is just heart wrenching. We’ve got to get to the bottom of this. We’ve got to get to the bottom of the gun violence going on in the country. But obviously, all of our thoughts and prayers are with the family right now.”\nImmediately after the shooting, a suspect was taken into custody. Sen. Bill Nelson of Florida said that the gunman was carrying a military ID that identified him as Esteban Santiago.\nAuthorities haven’t provided any details on a possible motive for the shooting.\nNewport News police have been asking the community to start turning in…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}