{"uri": "http://triblive.com/news/adminpage/9677910-74/zappala-apartment-devaughn?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29#axzz3v4Pj1MRi", "title": "Pittsburgh-area man 'unintentionally' shot 2 in pursuit of would-be robber", "dct": "Tue, 22 Dec 2015 04:51:00 GMT", "id": "34e5a7f1a671aba8a7d3b7e124ab3600", "content": "In a bizarre twist, authorities revealed Tuesday that Meiko Devaughn Jr. fatally shot his teenage brother and his girlfriend before killing a home invader at an apartment in Pittsburgh's Bloomfield neighborhood.\nAllegheny County District Attorney Stephen A. Zappala Jr. said he does not believe Devaughn, 22, intended to kill anyone but the would-be robber in an apparent shootout early Monday. Police issued an arrest warrant for Devaughn Tuesday on other charges related to the home invasion, which turned into a triple homicide and the deadliest shooting in the city this year.\nZappala said Devaughn is charged with illegal possession of a firearm, possession of stolen property and drug possession. Investigators have not decided whether he will be charged with homicide, since he was defending himself during an apparent robbery attempt.\n“We have to know all the evidence first,” Zappala said. “You're entitled to protect yourself.”\nDevaughn used a stolen .40-caliber handgun to exchange gunfire with Kadeem Williams, 25, who police said broke into the first-floor apartment around midnight, Zappala said.\nThe apartment was leased by Akielah Solomon, 20, who family members said was Devaughn's girlfriend. Devaughn's brother, Jaimill Kenney, 16, was staying with the couple, Zappala said.\nThe shots that killed Solomon, Kenney and Williams were fired from a .40-caliber weapon, Zappala said. Solomon was shot once in the head, and Kenney and Williams were each shot once in the chest, according to the Allegheny County Medical Examiner's Office.\nPolice suspect Williams was attempting to rob the apartment, which contained about $1,000 worth of marijuana and $14,000 in cash. Devaughn is apparently in the “drug business,” Zappala said.\nSolomon and Kenney were shot inside the apartment, police said. Investigators found Williams' body outside — but not a second weapon — leading them to believe there could be at least one more person involved, Zappala said. They are still searching for the second gun.\nThe district attorney and a team of Pittsburgh homicide detectives were back at the crime scene Tuesday afternoon. They examined a rear window, where police said Williams entered the apartment, before spending about an hour inside. Zappala said they were studying the layout of the apartment and reviewing the ballistic evidence left behind after the gunbattle.\n“This was not a random act of violence,” Zappala said.\nDevaughn pleaded guilty in 2013 to illegal possession of a firearm and possession of a controlled substance, court records show.\nHe was sentenced to nine to 18 months in jail and 3 1⁄2 years of probation. In 2012, he pleaded guilty to a charge of disorderly conduct.\nWilliams pleaded guilty to a gun charge in 2012 and was sentenced to 11½ to 23 months in prison followed by a year of probation. He was charged in 2014 with simple assault and harassment. He pleaded guilty to the assault charge in June in exchange for another year of probation, a no-contact order and a court-ordered batterer's intervention program.\nElizabeth Behrman is a staff writer for Trib Total Media."}