{"uri": "https://www.flashalert.net/news.html?id=1292", "title": "Polk County Sheriff's Office Participates in DUII Enforcement Grant", "dct": "Tue, 24 Jan 2017 00:00:00 GMT", "id": "70414c41ec01d95db109cfdcc91ddb81", "content": "On January 24th, 2017 just before 11 am Polk County Deputies responded to a motor vehicle crash on Hwy 223E (East Ellendale Rd) at Rickreall Rd. It was reported that there were two vehicles involved, including a travel trailer and that it was blocking all lanes of traffic.\nMultiple 911 callers indicated there were injuries and extensive damage to both involved vehicles. Once deputies arrived on scene, they reported that the involved vehicles had caught fire, but fortunately, everyone was out of the vehicles before they were engulfed in flames.\nThe truck that was pulling the travel trailer was 59 year old Frank Lund, of Alberta Canada. He was driving a Chevrolet 2500 pickup east on Ellendale Rd headed out of Dallas. Mr. Lund had a GPS unit inside the cab of his pickup that had an integrated forward facing dash camera that caught the crash on video. Mr. Lund provided the video to the Sheriff's Office.\nThe other driver, 27 year old Justin Yarbrough of Eugene was driving a white GMV Envoy. Mr. Yarbrough was heading west bound on Rickreall when he failed to stop at the stop sign prior to entering east Ellendale Rd, which is clearly visible on the video. Just prior to Mr. Yarbrough's vehicle catching fire, he was pulled to safety through the passenger side of his vehicle by citizens who had stopped to help after the crash occurred. The highway was closed for about 2 hours. ODOT responded to the scene to help divert traffic away from the scene. Mr. Yarbrough was transported by ambulance to the Salem Hospital with non-life threatening injuries. He has also been cited to appear for failing to obey a traffic control device and careless driving.\nMr. Lund provided the Sheriff's Office with the video footage in hopes that people would slow down and be more aware while they are driving.\nAttached Media Files: DSCF1366.JPG , DSCF1358.JPG , DSCF1355.JPG , DSCF1351.JPG , DSCF1359.JPG\n- 01/09/17\nIn October of 2016 the Polk County Sheriff's Office was awarded a grant from the Oregon Department of Transportation (ODOT) and Oregon State Sheriff's Association (OSSA) directed toward DUII enforcement.\nThe Sheriff's Office participated in DUII patrols in addition to normal patrol duties from December 15th, 2016 to January 1st, 2017. During that time the Sheriff's Office worked 17 hours of focused DUII patrols. As a result of those patrols Deputies arrested two individuals for DUII. Deputies also gave thirty-four unrelated traffic warnings.\nThe Sheriff's Office will continue to participate in the DUII grant throughout the year.\nOperation Deicer nets Methamphetamine and other drug traffickers in Polk County - 01/09/17\nPOINT\nPolk Inter-Agency Narcotics Team\nMEDIA RELEASE\nThe Polk Inter-Agency Narcotics Team (POINT) recently concluded a four month long investigation into the illegal distribution of methamphetamine in and affecting the Polk County area. The investigation, dubbed Operation Deicer, developed as replaced resources in the county allowed for investigations into drug traffickers to be renewed.\nPOINT is a cooperative effort by the member agencies that includes the Polk County District Attorney's Office, Polk County Sheriff's Office, Dallas Police Department, Monmouth Police Department and Independence Police Department. Investigators were able to identify the following subject who were actively involved in the distribution of methamphetamine:\nJohn Molina Unlawful Delivery of Methamphetamine (x2)\nUnlawful Possession of Methamphetamine\nMichael Gravelle Unlawful Delivery of Methamphetamine (x3)\nUnlawful Possession of Methamphetamine (x2)\nChaeron Mortimer Unlawful Delivery of Methamphetamine (x2)\nUnlawful Possession of Methamphetamine\nTravis Weddle Unlawful Delivery of Methamphetamine (x4)\nUnlawful Possession of Methamphetamine (x2)\nNaomi Ahlgren Unlawful Delivery of Methamphetamine (x8)\nUnlawful Possession of Methamphetamine (x5)\nRachel Keys Unlawful Delivery of Methamphetamine (x2)\nUnlawful Possession of Methamphetamine\nDamon Mathers Unlawful Delivery of Methamphetamine (x2)\nUnlawful Possession of Methamphetamine\nTricia Haslett Unlawful Delivery of Methamphetamine (x3)\nUnlawful Possession of Methamphetamine (x2)\nJesse Creekmore Unlawful Delivery of Meth 1000 ft of a school\nUnlawful Manufacture of Meth 1000 ft of school\nUnlawful Manufacture of Meth (x2)\nUnlawful Delivery of Methamphetamine (x3)\nUnlawful Possession of Methamphetamine (x2)\nColin Lynch Unlawful Delivery of Methamphetamine (x8)\nUnlawful Possession of Methamphetamine (x5)\nCharla Vaughn Unlawful Del of Meth 1000 ft of a school (x2)\nUnlawful Delivery of Methamphetamine (x4)\nUnlawful Possession of Methamphetamine (x2)\nJeffrey Jackson Unlawful Delivery of Oxycodone\nUnlawful Possession of Oxycodone\nTito Aguirre Unlawful Delivery of Methamphetamine (x4)\nUnlawful Possession of Methamphetamine (x2)\nUnlawful Manufacture of Methamphetamine\nStill outstanding are the following suspects:\nAaron Welin\nMelanie Allen\nJames VanDyke\nCrystal Aguirre\nDanielle Ralston\nJoel Weiss\nAnyone with information as to the whereabouts of the above listed outstanding subjects are encouraged to contact the Polk County Sheriff's Office at 503-623-9251 or the local jurisdiction where they are located.\nAttached Media Files: Deicer PR with photos"}