{"uri": "http://www.nydailynews.com/news/national/chicago-toddler-smiling-shot-face-article-1.1472401", "title": "Chicago toddler shot in face during mass park shooting is smiling and singing again", "dct": "Tue, 01 Oct 2013 07:50:39 GMT", "id": "90207bc37f4d6857d34c5b3781340e95", "content": "A 3-year-old boy who survived being shot in the face during a mass shooting at a Chicago basketball court is already smiling and singing again less than two weeks later.\nLittle Deonta Howard didn't let a bandage covering his upper lip hide his smile as he grasped a microphone in his mother's arms to speak out during a rally against gun violence in his hometown Monday.\n\"Thank you,\" the youngster squeaked out to the roar of applause around him before taking advantage of the crowd's enthusiasm to further showcase his knowledge of the ABCs.\nJust 11 days earlier, Deonta and 12 other people were wounded when gun fire erupted at the popular Cornell Square Park.\nFive young men have since been charged in the shooting, which remarkably took no lives.\nPolice say Bryon Champ, 21; Tabari Young, 22; Brad Jett, 22; David Logan, 22, and Kewane Gatewood, 20, were aiming at rival gang members when they opened fire Sept 19.\nInstead, the tiny toddler became caught in their violent crossfire, with a bullet piercing behind his ear and through part of his jaw.\nKeshawnda Green, 18, who was shot twice in the foot herself, recalled to ABC7 last week that she saw the boy standing in the open not knowing what was going on as everyone else around him ran for cover.\n\"He's just standing there, so I just grabbed him and tried to dive on the ground,\" she said. \"I couldn't do much, but I did the best I could.\"\nDeonta's mother, 24-year-old Shamarah Leggett, described her son as \"strong.\" It's a character she's now trying to emulate herself.\n\"He's doing better than I expected. He's moving around, playing,\" she told DNA Info, Chicago. \"He's back to Deonta.\"\nThe 3-year-old is expected to undergo surgeries until he's 13 to repair his face. His mother told DNA Info that the bullet failed to cause any internal injuries to his brain.\nYoung and Jett have been charged with three counts of attempted murder and aggravated battery with a firearm. Champ, Gatewood, and Logan also face charges.\nngolgowski@nydailynews.com\nOn a mobile device? Watch the video here"}