{"uri": "http://www.dnainfo.com/chicago/20131113/back-of-yards/seventh-suspect-charged-back-of-yards-shooting-of-13", "title": "Out on Bond on Murder Rap, Man Charged in Back of the Yards Shooting of 13", "dct": "Thu, 14 Nov 2013 12:38:00 GMT", "id": "c2a799a32dd828b6741909aed22d6d24", "content": "COOK COUNTY CRIMINAL COURTHOUSE — A seventh man has been charged in connection with a September shooting in Cornell Square Park that wounded 13, including a 3-year-old boy.\nQuinton Humphries, an alleged getaway driver, was out on bond in a pending murder case when he drove a group of fellow gangbangers bent on revenge to the crowded Cornell Square Park on Sept. 19, authorities said.\nThere, police said, they unleashed a hail of bullets on the people gathered, wounding 13 — including 3-year-old Devonte Howard — and drew a national spotlight on the issue of Chicago gun violence.\nDays after the shooting, four of the suspects were arrested, including Bryon Champ, a 21-year-old member of the Black P Stone Nation gang accused of rounding up friends to take revenge for a bullet that grazed him earlier that day.\nCharged with three counts of attempted first-degree murder and three counts of aggravated battery with a firearm, Humphries, 20, was ordered held without bail on Wednesday. Humphries was on the street after being accused of another murder in July, and posting 10 percent of his $500,000 bail.\nLittle more than three months earlier he was brought before another Cook County judge on murder charges after prosecutors said he and a second man flashed gang signs before fatally shooting Shavonte Howard.\nHoward, of the 5300 block of South Hoyne Avenue, was shot in the head about noon on July 4 in the 5600 block of South Western Avenue, police said.\nChamp, the \"main player\" in the Cornell Square Park shooting, had been convicted of gun possession as a felon last year, Chicago Police Supt. Garry McCarthy said at a news conference.\nA judge sent Champ to boot camp, and he was released when he completed the program.\n“If Bryon Champ is not on the street — as he shouldn’t have been — this incident likely does not occur,\" said McCarthy, who has advocated stricter sentencing for gun crimes. “He received boot camp for that gun crime and was back out on the streets to be a part of this senseless shooting.\"\nA few days after the initial arrests, a fifth man, David Logan, 22, was arrested in connection with the incident.\nEarlier this month, Darren Curtis, 28, was charged in the incident as well."}