{"uri": "http://www.stltoday.com/news/local/crime-and-courts/six-people-shot-during-suspected-robbery-attempt-at-carondolet-neighborhood/article_33503b67-ec0b-570e-af58-a699771c4ed6.html", "title": "Shootout at St. Louis tavern popular with police leaves 1 dead, injures five", "dct": "Wed, 03 Dec 2014 00:00:00 GMT", "id": "e9e0f18ebe73a66fac83af714a48fceb", "content": "ST. LOUIS • A former city police officer who shot a robber at a south St. Louis bar in 2008 did it again late Tuesday night in a gunfight that wounded him and four others, and killed a woman.\nTwo of the wounded were trying to rob Pooh’s Corner, police said. The other victims — including the former officer, 65 — were customers.\nOn Wednesday, Diana Lawrence, 63, of the 3400 block of Dunnica Avenue, who was shot in the back of her head, died after being removed from life support, authorities said.\nProsecutors charged Derreaun Davis, 20, of the 5700 block of Goodfellow Boulevard, and Corey R. Wade, 29, of the 4500 block of Davison Avenue, each with 32 counts of first-degree assault, first-degree robbery, attempted robbery and armed criminal action. Charges were expected to be upgraded to murder. A judge ordered them held without bail.\nDavis was in jail. Wade was in critical condition at a hospital.\nThe bar at 6023 Virginia Avenue in the city’s Carondelet neighborhood has been a popular hangout for off-duty and retired police for more than two decades and has twice before been targeted by robbers who were met with gunfire.\nPolice said three gunmen entered the bar about 10:55 p.m. Tuesday — one of them shooting into the ceiling as they came in — and ordered everyone to the floor. Wade ran toward the former police officer and shot him in the thigh.\nThe ex-officer, who worked for the department for several years in the 1970s and has a concealed-carry permit, fired back, shooting Wade in the eye and Davis in the shoulder, police said.\nAnother male customer, 73, was shot in the ankle and was in critical condition; a fourth male victim, 66, was released from the hospital after receiving treatment for two shots to his buttocks.\nDavis and a third gunman, whose identity was unknown, fled in a stolen Mazda, investigators said. Police found the wounded Davis at a hospital; he claimed he had been shot at a different place. A manhunt continued for the third man.\nIn late November 1995, an off-duty St. Louis narcotics detective wrestled with a robber at Pooh’s and was struck in the forehead with the barrel of a sawed-off shotgun. The detective then pulled a pistol from his jacket and fatally shot the robber, Anthony Bickell, 18.\nOn Sept. 15, 2008, the former officer in Tuesday night’s shootout was working as a bartender at Pooh’s when he stopped two would-be robbers. Those men, in their 20s, walked in about midnight and announced a holdup. The bartender, then 59, pulled a gun and fired, hitting one of the robbers twice in the buttocks. The wounded man was arrested; the other escaped.\nPooh’s was open for business Wednesday, with a couple dozen regulars, many smoking cigarettes, drinking light beer, playing bartop video games or buying scratch-off lottery tickets. The front door has a “NO FIREARMS ALLOWED” sign, although customers know not everyone complies.\nOld friends shared hugs and tears. A buddy of one of the owners delivered several pizzas. Some expressed surprise that a known cop bar would become a target of robbers a third time.\n“It’s amazing that it happened the first time,” said Phil “Ward Cleaver” Scharf, 65, of St. Louis, a retired accountant who has been the 6 a.m. to 11 a.m. bartender since the 1990s.\nThe bar opened in 1990 and is named after a former owner who went by “Pooh,” as in the Disney character. Years ago, a customer turned the name into an acronym for “Police Officers Official Hiding Spot.” The bar sells T-shirts with that slogan.\nRams and Mizzou memorabilia and flat-screen TVs adorn nearly every wall, but this is no sports bar. Cigarette smoke clouds the air. A sign reminds customers “THIS ISN’T BURGER KING” and that food is prepared any way the cook wants. Charity collection jugs include one for the BackStoppers, which supports families of fallen public servants.\nOne of Pooh’s owners, who declined to be identified, said she doesn’t think the robbers realized it’s a cop hangout. More likely, she said, they see a corner bar near Interstate 55 as an opportunity.\nClosing the bar Wednesday was not an option, she said.\n“We’re not going to let them win,” she said. “We’re like Cheers here. Everybody knows each other.”\nKim Bell and Christine Byers of the Post-Dispatch contributed to this report."}