{"uri": "http://www.wftv.com/news/local/woman-injured-in-parramore-drive-by-shooting-dies/237817156", "title": "Woman injured in Parramore drive-by shooting dies", "dct": "Sun, 24 Apr 2016 19:25:00 GMT", "id": "e6af4650cd6c23312f9703e12d61d941", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nORLANDO, Fla. - A 46-year-old woman died Saturday, a week after she was critically wounded in a drive-by shooting in Parramore, the Orlando Police Department said.\nTanya Skeen, a mother of three children, was putting away dishes when she was struck by gunfire April 16 at The Landings at Carver Park on Conley Street, officers said.\nA crowd was gathered outside the apartment complex shortly before 9:30 p.m. when a vehicle pulled up, Orlando police Sgt. Wanda Miglio said.\nSeveral people in the vehicle fired handguns at the crowd, striking six, Miglio said.\nGino Nicolas, 24, was also killed in the shooting.\nRelatives said Nicolas made it his life’s work to save youth from the same violence that took his life.\nAfter he graduated college, he returned to Parramore to mentor at-risk youth through the My Brother’s Keeper initiative.\nFour others were shot, but their injuries weren’t life-threatening.\nThe victims include Cordarius Williams, 24; Daquan Lundy, 23; Ricky Harrison Jr., 23; and Wendell Edwards Jr., 22.\n\"Along with the victims who sustained injuries, there were several others present that fled the scene and have been less than forthcoming,” Miglio said. “At this time, the intended target of the shooting it is unknown.\"\nResident Sergio Rivera said he was in his bedroom when a bullet pierced his apartment’s front door, narrowly missing his mother.\n\"I didn't hear anything until bullets started popping everywhere,” Rivera said. “To be this close, it was pretty shocking, because it could have been my life.\"\nThe gunmen remain at large.\nAnyone who saw the vehicle or who has information on the shooting is asked to call OPD at 321-235-5300 or Crimeline at 407-423-8477.\nPrevious story: Man killed in Parramore shooting fought against violence in community\n© 2017 Cox Media Group."}