{"uri": "http://www.al.com/news/huntsville/index.ssf/2017/01/5-year-old_fatally_shot_at_new.html", "title": "5-year-old fatally shot at Alabama New Year's party was from Huntsville", "dct": "Fri, 06 Jan 2017 07:01:00 GMT", "id": "698867d39121680b8969e49ceed2b16f", "content": "The young girl who was killed in what investigators believe to be an accidental shooting at a New Year's party in Limestone County has been identified as a Huntsville resident.\nRegina Hernandez, 5, died after sustaining a gunshot wound to the chest Jan. 1 in Athens, according to court records released this week. Hernandez was north Alabama's first homicide victim of 2017.\nFidel Rodriguez Canchola, 34, of Athens, remains jailed on a charge of criminally negligent homicide, which is a misdemeanor that carries a maximum sentence of one year in jail. Bail is set at $5,000.\nWitnesses first said there was no shooting at the scene, but later admitted that a man fired several rounds in the yard where the victim was shot.\nCanchola was in the yard of his home on Buckskin Drive when he decided to fire multiple shots from his pistol to celebrate the new year around midnight, authorities said.\nHernandez, who was inside Canchola's mobile home, went outside and ended up in the line of fire, Limestone County sheriff's spokesman Stephen Young said.\n\"According to what we can gather, she came out while he was firing and walked or ran into the line of fire,\" Young said.\nWhen deputies arrived on the scene, Hernandez was in the living room of the home, according to an incident report released in court records today.\nUntil emergency medical workers arrived to take the victim to Athens-Limestone Hospital, a deputy performed CPR to try saving the girl's life, reports show.\nAbout 25-30 people reportedly were at the party. At first, they denied hearing or seeing what happened, authorities said.\nBut, after investigators recovered shell casings from the yard, witnesses said a man fired several rounds in the yard.\nEventually people at the home identified Canchola as the shooter and said he ran from the scene before deputies arrived, investigators said.\nSheriff Mike Blakely and Investigator Lance Royals located Canchola about seven hours later.\nThe shooting remains under investigation.\nCanchola is scheduled to be arraigned in Limestone County District Court Jan. 30 at 9 a.m. At that time, he will be asked to plead guilty or not guilty."}