{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-shootings-violence-20161014-story.html", "title": "6 dead, at least 17 wounded in Chicago shootings", "dct": "Mon, 17 Oct 2016 02:11:00 GMT", "id": "01a33d3e403fcb02f35e0a1ad0a8a796", "content": "Six men were killed and at least 17 people were wounded in shootings in Chicago between late Friday morning and early Saturday, police said.\nOne shooting, just before 8:20 p.m. Friday in the East Garfield Park neighborhood, left one man dead and wounded six other people. It was the largest number of people shot in one attack in Chicago since 13-year-old Samuel Walker was killed and six others were wounded in an attack in Lawndale on July 25, 2014, according to data compiled by the Tribune. Samuel's father was shot to death less than a week after his son.\nThe man killed Friday was among four people who were self-transported to Mount Sinai Hospital after gunfire erupted in the 3300 block of West Maypole Avenue, police said. The man and the other wounded people had been standing together outside when someone in a black vehicle began shooting at the group.\nThe man fatally shot was identified as Jeffrey Brinson, 32, of the 5100 block of West North Avenue, according to the Cook County medical examiner's office. Public records indicate he may have spelled his name Jeffery. He was pronounced dead at 8:33 p.m. at Mount Sinai Hospital.\nA 34-year-old man was shot in the leg and was in critical condition at Mount Sinai Hospital. A 26-year-old man was shot in the right arm, and a 27-year-old man was shot in the left arm. Both men were listed in good condition at Mount Sinai.\nA 31-year-old man who was shot in the left arm and a 22-year-old woman who was shot in the right foot were taken by paramedics to Stroger Hospital. They were listed in good condition.\nA 21-year-old woman was grazed in the face by a bullet, police said. She was treated at the scene.\nJust before midnight, groups of people huddled outside the emergency room entrance at Mount Sinai Hospital. One woman sobbed as she held a young boy. \"Please don't do this to us,\" she said.\nShe later collapsed, and a couple people helped her get up. She tore down a piece of crime scene tape surrounding four vehicles and sat on the ground.\nOfficers guarding the scene watched the woman but didn't say anything. After she got up, an officer picked up the tape and put it back up.\nThe most recent fatal shooting happened at 4:25 a.m. Saturday in the 6100 block of South Rhodes Avenue in the West Woodlawn neighborhood.\nDavon Smith, 26, was shot in the neck in a drive-by shooting, police said. Smith, of the 3500 block of South Indiana Avenue, was taken to the University of Chicago Medicine, where he was pronounced dead at 4:45 a.m.\nYellow and red crime scene tape zigzagged across the block where the man was shot. A 30-year-old woman, who did not want to be identified, watched as officers searched for evidence.\nShe awoke early Saturday to a woman screaming and looked out her window. She said a woman was yelling the wounded man's name, asking him to wake up. \"But he wasn't moving,\" she said.\nIn West Rogers Park, a man suffered multiple gunshot wounds to the chest about 8:55 p.m. Friday, and was taken to Presence St. Francis Hospital in Evanston, where he was in serious condition, Quaid said.\nHe was pronounced dead at 9:35 p.m., according to the Cook County medical examiner's office.\nThe man was on the sidewalk in the 6000 block of North Talman when a man or boy he didn't know came up and fired shots at him, Quaid said. The attacker then fled north on foot, Quaid said.\nThe man was identified as Trasean Stokes, 25, of the 6000 block of North Fairfield Avenue, the medical examiner's office said Wednesday, Oct. 19. He was pronounced dead at 9:35 p.m. after suffering multiple gunshot wounds. The medical examiner's office originally gave Stokes' age as 26, later corrected that information.\nIn the Austin neighborhood, two men were fatally shot in the 5500 block of West Congress Parkway just after 7:55 p.m., said Officer Kevin Quaid, a Chicago police spokesman.\nAn 18-year-old man was shot in the head and a 20-year-old man suffered multiple gunshot wounds in the attack. Both were taken to Stroger Hospital, where they were pronounced dead, Quaid said.\nThe 20-year-old was identified as Jermale Richardson, of 1100 block of South Albany Avenue, according to the medical examiner's office. He was pronounced dead at 8:42 p.m.\nThe younger man was identified as Jamal Thomas of the same block where he was shot, according to the office. He was pronounced dead at 8:21 p.m. An autopsy Monday determined Thomas died of a gunshot wound to the head and his death was ruled a homicide, according to the medical examiner's office.\nThe two were standing near a parked vehicle when someone in a gray sedan drove up and someone inside fired shots, hitting them, Quaid said.\nAn 18-year-old man was fatally shot in the West Garfield Park neighborhood just before 6:50 p.m., Quaid said. He was in the 4500 block of West Maypole Avenue in a gangway when someone in a dark sedan drove up in the alley and began firing at him, hitting the man in the chest, Quaid said.\nThe man was taken to Mount Sinai Hospital, where he was pronounced dead. He was later identified as Faizon Smith, of the 4400 block of West Washington Boulevard, according to the medical examiner's office.\nIn other shootings:\nA 37-year-old man was shot in the back about 5:35 a.m. Saturday in the 7800 block of South Sawyer Avenue in the Ashburn neighborhood. He was taken in critical condition to Advocate Christ Medical Center in Oak Lawn, where his condition was stabilized.\nA 25-year-old man was dropped off at Mount Sinai Hospital early Saturday after being shot in Little Village, police said. He had been shot in the head in the 3600 block of West 31st Street at about 5 a.m. He was listed in serious condition. Further details were unavailable, and he was being uncooperative, police said.\nA 17-year-old boy was shot in the leg in the Montclare neighborhood on the Northwest Side. The shooting happened just before 2:20 a.m. Saturday in the 2300 block of North Normandy Avenue when a dark-colored SUV pulled up alongside the boy and someone inside began shooting, police said. The teen was in good condition at Loyola University Medical Center.\nA 28-year-old man was shot in the leg about 1:10 a.m. in the 4700 block of West Van Buren Street in the West Garfield Park neighborhood, police said. He was standing outside when someone inside a silver car began shooting at him. He took himself to Loyola University Medical Center, where he was listed in fair condition.\nAbout 12:25 a.m., a 26-year-old man was shot multiple times, including once in the stomach, while he was at a party in the 8800 block of South Marshfield Avenue in the Gresham neighborhood, police said. Multiple people shot through a window and a door, wounding the man. He was in serious condition at Advocate Christ Medical Center. No one was in custody.\nIn the Marquette Park neighborhood, a 34-year-old man was shot in the hip while he was driving in the 6500 block of South Talman Avenue on Friday, police said. The shooting happened just before midnight. His condition was stabilized at Advocate Christ Medical Center.\nA man was shot just before 6 p.m. in the 4200 block of South Michigan Avenue in the Bronzeville neighborhood, Quaid said. The 26-year-old man was walking when he heard shots and soon after felt pain; he was shot in the chest. He was taken to Stroger Hospital, where his condition was stabilized, Quaid said.\nAbout 5:40 p.m., a 19-year-old man was shot in the back in the 2800 block of South Harding Avenue in the South Lawndale neighborhood. He was inside a vehicle when a silver minivan pulled alongside, and someone fired shots. He was taken to Mount Sinai Hospital, where his condition was stabilized, Quaid said.\nAbout 2:30 p.m., a 34-year-old man was shot in the 5400 block of West Walton Street in the South Austin neighborhood. According to preliminary reports, the man was standing outside when a green sedan pulled up and someone fired shots. The man was struck in the mouth and was taken to Mount Sinai Hospital, where his condition was stabilized, Quaid said.\nShortly after 12:30 p.m., a 19-year-old man was shot in the Englewood neighborhood, Quaid said. In that attack, a gray vehicle pulled up to a courtyard building where the victim was standing in the 7000 block of South Sangamon Street. Someone fired shots from the vehicle striking the man in the torso and leg, Quaid said. He was taken in critical condition to Advocate Christ Medical Center in Oak Lawn.\nLate Friday morning in the same South Side neighborhood, a 29-year-old man also was shot. About 11:15 a.m., a man was shot in the toe on the 6500 block of Laflin Street. He was taken to Holy Cross Hospital, police said. No one was in custody, and police said the victim was being uncooperative.\nJust after 8 p.m. Friday near the 4800 block of West Ferdinand Street in Austin, a 26-year-old man was involved in a fight when gunshots were heard. It was originally reported that the man was shot in the head. However, police Saturday said the man was not shot, but he was injured in the physical altercation."}