{"uri": "http://www.daytondailynews.com/news/news/crime-law/multi-victim-shooting-reported-near-hamilton/nr4SN/?source=ddn_home", "title": "Police hoping for cooperation in deadly Hamilton bar shooting", "dct": "Sun, 24 Jul 2016 00:00:00 GMT", "id": "22cc995433a7174fa0d19dda40aa4495", "content": "HAMILTON\nHamilton police said one man is dead and several others were shot inside Doubles bar Sunday morning.\nOne man shot and killed\nMultiple others shot, taken to area hospitals\nWitness heard at least 15 shots fired\nUPDATE @ 7:30 p.m.\nPolice this evening are continuing to search for a suspect or suspects involved in the shooting and determine the exact number of victims, as some drove themselves to area hospitals.\nScott Scrimizzi, city of Hamilton’s director of Public Safety, said law enforcement will look at what could be done to make the establishment and area safer. But first, police want to solve this crime, he said.\n“This is a problem location that has very sporadic hours and days of operation,” he said. “Right now, what is even more concerning to me is that lack of cooperation from the patrons who were inside but unwilling to cooperate with the police.”\nUPDATE @ 2:20 p.m.\nThe Butler County Sheriff’s Office released 911 calls made to the dispatch center for the shooting at Doubles Bar, 1555 Main St, that were received at approximately 2 a.m. early Sunday morning.\nOne person reportedly was killed and multiple victims received gunshot wounds shortly after 1:50 a.m.\nThe 911 calls reveal frantic patrons in the bar who were calling for help. One man said he heard multiple gunshots and people were running from the establishment. He was standing in the parking lot when he made the call. In the background you can hear other dispatchers asking about the location of people who may have been shot.\nOne female caller is calling from underneath a table in the bar and is reporting that “20 gunshots” have been fired and is asking for police to come immediately.\nA caller screaming into the phone while the attack is going on, frantically relayed to the dispatcher that “somebody started shooting and we got separated…they were shooting a gun like crazy.” The caller makes references to her sister but tells the dispatcher that she is no longer in the building and doesn’t have a description of the shooter.\nA male caller inside the bar called 911 and said police are needed immediately, “all kinds of gunfire going on now hurry up.”\nPolice continue to process evidence at the scene of the fatal shooting at Doubles, 1555 Main St., in Hamilton.\nSeveral cars were still parked in the lot and their owners have had to wait hours because police have the parking lot cordoned off from the public.\nPolice said more information about the investigation may be released this afternoon.\nHamilton police are still gathering information and evidence from a shooting at Doubles bar that left one man dead and several others shot.\nPolice Chief Craig Bucheit said investigators are still attempting to determine the exact number of victims. Several victims were transported by the Hamilton Fire Department to Fort Hamilton Hospital and Bethesda Hospital Butler County, but some drove themselves to the hospitals.\nBucheit said officers are still unsure on a possible motive and the number of shooters. Shell casings were also found both inside and outside the bar.\nBucheit acknowledged that police have had numerous incidents of violence, but would not say if the city would attempt to shut it down.\n“What happened tonight is unacceptable and we’re going to work with management and ownership to make sure it doesn’t happen again,” he said.\nIt was also unknown how many people were inside the bar at the time of the shooting, but was described as a large crowd by Bucheit.\nInvestigators are working with the bar and several other businesses in the area to obtain surveillance footage.\nPolice encourage anyone with information to contact investigators at 513-868-5811 extension 2002.\nNo additional information was given by police and another update wasn’t expected until later on Sunday.\nOfficers were dispatched around 2 a.m. to the bar at 1555 Main Street on reports of shots fired inside the bar.\nAccording to a release, one man was pronounced dead at the scene. Several others gunshot victims were located and transported to multiple area hospitals.\nPolice did not specify an exact number of victims or their conditions.\nThe identity of the victim is being withheld until notification of family.\nPolice did not indicate if they have made any arrests or have any suspects.\nA witness of the reported multi-victim shooting said he heard at least 15 shots during the shooting that ‘felt like hours’.\nTolu Adeseha, from Fairfield said he was inside the bar when he heard the shots ring out.\n“It reminded me of things in the news, about people shooting and active shooters,” he said. “This [was] a reality for me, what do you do in an active situation.”\nWhen he heard the shots, Adeseha said he ducked down and was concerned about the people around him.\n“You [had] people trying to play dead and things like that,” he said. “This is an active shooter and I was trying to tell a girl [next to me}, you can’t cry, I know it’s traumatic for you, but you got to stay silent or play dead.”\nAdeseha said he saw multiple people inside the bar with guns when the shots rang out, but did not see anyone fire weapons.\nAdeshea said he also saw at least two victims, but was unsure on how many people sustained gunshot wounds.\n“It could have been me,” he said.\nPolice have not released any information on the scene yet.\nMultiple officers and deputies continue to search and process the scene of a reported multi-victim shooting at Doubles bar in Hamilton.\nOfficers on scene have not given an update on the status of their investigation.\nIt is also unknown exactly how many victims were shot, and what their conditions are.\nOur crew remains at the scene and we’ll update this page as new details become available.\nFIRST REPORT\nSeveral police and medic units are on the scene of a reported multi-victim shooting at Doubles bar in Hamilton.\nUnits were dispatched around 2 a.m. on reports of multiple gunshot victims at the bar at 1555 Main Street on the city’s west side.\nInitial reports indicate at least two people have been shot with potentially more victims involved.\nOur crew on the scene reports several jurisdictions in Butler County have responded to the scene, with crime scene tape blocking the entire area. At least one K9 unit was also seen in searching grassy areas near the bar.\nRelated\nWe’ll update this story as new information becomes available."}