{"uri": "http://www.journal-news.com/news/news/crime-law/second-person-dies-in-hamilton-drive-by-shooting-3/nr9Zk/", "title": "Prosecutor: Death penalty may be sought in Hamilton shooting", "dct": "Fri, 05 Aug 2016 00:00:00 GMT", "id": "52af43821dbf4992ef45c3e771e1fda1", "content": "Three Central Ohio residents were in Hamilton with “execution” and “assassination” on their minds, Butler County Prosecutor Michael Gmoser said.\nThat’s why, he said, Melinda Gibby, 35, of Lancaster; Zachary Harris, 24, of Columbus; and Tony Patete, 23, of Newark, were charged with two counts of aggravated murder following a drive-by shooting Wednesday afternoon that left two 25-year-old Hamilton residents dead, a police department piecing together the evidence, pastors praying for non-violence and a community concerned for its safety.\nAfter the Butler County Grand Jury hears the case and if it convicts, it will be given specifications to consider the death penalty because there was “prior calculation” to cause death, Gmoser said.\nOn Thursday morning, Gabby, Patete and Harris were ordered held on $10 million bond each, but the Hamilton Municipal Court judge decided to hold them without bond, according to court records. They remain in the Butler County Jail, according to jail records.\nGmoser called the double fatal shooting “a horrific crime.”\nThen he stressed that Hamilton and the entire Butler County region won’t succumb to this “caliber of violence, caliber of lawlessness.”\nHamilton Police Capt. Marc McManus, filling in for Police Chief Craig Bucheit, said the two victims were “targeted” and he stressed Wednesday’s drive-by shooting was not random.\nAt 2:30 p.m. Wednesday, he said the alleged shooters pulled up next to a black Ford Mustang on Central Avenue and opened fire, striking the driver and passenger.\nOne victim, Orlando Gilbert, 25, of Hamilton, was pronounced dead at the scene and Todd Berus, 25, of Hamilton, died Wednesday night at Fort Hamilton Hospital, police said.\nBoth died from gunshot wounds and their deaths were ruled homicides, according to the Butler County Coroner’s Office.\nOn Wednesday, there was much speculation that the drive-by shooting was in retaliation to Sunday’s shooting at Doubles Bar that claimed the life of Kalif Goens. His brother, Mondale Goens, 21, is charged with murder and he’s accused of shooting Katrinia Price, 18, and Tavaris Gilbert, 20, both of Hamilton.\nMcManus said he couldn’t discuss the case, but he said the department was “exploring” a “probable” link between the two shootings.\nDuring the funeral service for Goens on Wednesday, residents were urged to not retaliate, according to a local pastor who attended.\n“We walked out of that service feeling good about the word that we heard and thought it resonated with the young men and people in the community, but evidently it did not,” said Pastor Greg Andrews from House of Deliverance Ministry in Hamilton. “They’re young and I do understand … they’re angry, mad, they’re upset and that’s family,” he said. “They’re all family. We are all family and we’ve got to understand we’re family and black lives do matter. Black lives matter when black lives take care of black lives.”\nGmoser praised the efforts of the Hamilton police department, Butler County Sheriff’s Office, other agencies and canine officers that assisted in the quick apprehension of the three suspects who drove into Ross Twp. following the shooting.\nHe also appreciated the number of witnesses who assisted police and called 911. That wasn’t the case at Doubles Bar, where Gmoser said only a few of the 100 to 200 patrons inside came forward with information.\nHe knows there are people who don’t want to be called “snitches,” though he prefers the term “cooperative witnesses.”\nMcManus said the cooperation from bar patrons was “limited at best.”\nAll three charged with aggravated murder have prior criminal records, according to records obtained by the Journal-News.\nTwo years ago, Patete, 21, was sentenced to six months in jail and five years of community control after being found guilty of unlawful sexual conduct with a minor, a fourth-degree felony, according to Licking County Court records. Between May 16-17, 2014, Patete engaged in sexual conduct with a 13-year-old, according to court records.\nRelated\nHe was ordered to pay all court costs and fees and have no contact with anyone under the age of 18. Patete was also classified as a Tier II sexual offender.\nGibby was indicted by the Fairfield County Grand Jury on one count of possession of crack cocaine in 2005, and two counts of possession of crack cocaine and three counts of trafficking cocaine later that year, according to court records. She was sentenced to a four-year jail sentence.\nIn 2009, Harris was charged with kidnapping, two counts of aggravated robbery and four counts of robbery in Franklin County, records show. He was released from prison earlier this year after serving six years and is currently on probation."}