{"uri": "http://www.al.com/news/birmingham/index.ssf/2015/08/authorities_id_father_fatally.html", "title": "Authorities ID father fatally shot, possibly by toddler son", "dct": "Wed, 19 Aug 2015 11:37:00 GMT", "id": "2fa5f06f6cb79c19b427173191ace714", "content": "Authorities today released the identity of a man found shot to death Tuesday afternoon in Hoover, possibly the victim of an accidental shooting at the hands of his toddler son.\nThe Jefferson County Coroner's Office identified the victim as Divine Vaniah Chambliss. He was 31.\nHoover police were called to The Cliffs at Rocky Ridge apartments just after 3 p.m. The mother of Chambliss' two children called 911 and told police she had just returned home from work to find Chambliss dead.\nPolice and medics arrived on the scene at 3:11 p.m. and found Chambliss on a bed. He was pronounced dead on the scene at 3:20 p.m.\n\"It was reported to us that he was accidentally shot by a toddler, but we haven't verified that,'' Hoover police Capt. Gregg Rector said Tuesday. \"It's too early to tell if that indeed is going to be the case.\"\nRector said detectives and crime scene technicians have examined the scene, collected evidence and interviewed several individuals. Preliminary information provided to officers indicated that the victim's 2-year-old son may have accidentally shot his father.\nThe toddler and his father were believed to be the only two people home when the incident occurred. The mother of Chambliss' children was at work, and their daughter was at school. There was no sign of forced entry. Chambliss listed a southwest Birmingham address, but authorities said it was common for him to go to the Hoover apartment to keep the children during the day while their mother was at work.\n\"Other possible scenarios are being investigated but at this time there does not appear to be an intruder or any third person involved,\" Rector said. \"However, this investigation is still in its very early stages and detectives are not completely ruling out other possibilities.\"\nAn autopsy was scheduled for this morning at the coroner's office. Police expect to release more information on the investigation as it becomes available.\nUpdated at 11:35 a.m. to clarify that the childrens' mother was not Chambliss' wife, according to police."}