{"uri": "http://www.kxii.com/content/news/Police-searching-for-suspects-involved-in-armed-burlgary-408557195.html", "title": "Police searching for suspects involved in armed burlgary", "dct": "Wed, 28 Dec 2016 18:43:00 GMT", "id": "04dd27100d4e8a1f05cf69c8ee8d5d01", "content": "ARDMORE, Okla. (KXII) -- Just hours before Christmas, this neighbors surveillance cameras shows four suspects approaching this home right behind me. The burglars thought the house was empty, but were soon face-to-face with the homeowner's 15 year-old son.\n\"And he came around the corner and saw me coming down this hallway and we met eyes and he looked surprised. At first I thought I was like what the heck is going on but then it really scared me when I noticed the gun,\" says 15 year-old Ethan Barber.\nThe surveillance video shows the four suspects gathered in front of Ethan and his dad John's home and then walk towards their front door.\n\"Well he comes out of the bedroom and meets one guy out here in the hallway and that's when one guy attacked him and busted him in the face with a pistol. He held him at gunpoint and rummaged through the house,\" says Ethan's father, John Barber.\nJohn says he'd just left their house at B street southwest and sixth street when the suspects opened the unlocked front door. He says his house was an easy target because he's paraplegic.\n\"When I got up the road, I guess they probably said oh there goes that truck, lets go nail his house,\" says John.\n\"They started hitting me, hitting me in my face, asking me where all my valuables were,\" says Ethan.\n\"Stole his brand new PlayStation I just got him for Christmas, my phone, his phone, a laptop, his boots,\" says John.\nThe suspects took off through Ethan's bedroom window, leaving the Barbers shaken.\n\"Hard to fall asleep just thinking about it,\" says Ethan.\n\"My heart and my stomach are still out there in that yard somewhere, and this has been going on since Christmas Eve night,\" says John.\nThe investigation is ongoing and police are still looking for the four suspects involved. If you have any information, contact the Ardmore Police Department."}