{"uri": "http://wsav.com/2015/08/20/scmpd-responding-to-shooting-in-clearview-homes/", "title": "Toddler Grazed by Bullet During Shooting", "dct": "Thu, 20 Aug 2015 22:50:00 GMT", "id": "cb3c2bca016b8dcb866359b1e2192646", "content": "UPDATE:\nSavannah-Chatham Metropolitan Police are investigating a shooting which took place in Clearview Homes in the 400 block of Carolan Street just after 7 p.m. on Thursday.\nA shot was fired inside the home and the bullet grazed a 2-year-old boy who lives in the home, his injures are not life-threatening.\nAt this time the shooting appears to be accidental.\nSeveral family members were inside the home when the shooting occurred; those individuals are being interviewed by detectives.\nThe circumstances surrounding the shooting are still under investigation.\n==========================================================================================\nSavannah-Chatham Metro Police are on the scene of a shooting inside a home on the 400 block of Carolan Street.\nThey say a 2-year-old’s head was grazed by a bullet during the incident but his injuries are not life-threatening.\nPolice are remaining on scene to interview people who were in the home at the time of the shooting but there is still no word on what caused it.\nWe will keep you updated as more information becomes available to us.\nTune in tonight at 10 & 11 for the latest.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}