{"uri": "http://turnto10.com/archive/shooting-in-providence-leaves-3-injured-and-a-12-year-old-girl-dead", "title": "City mourns 12-year-old girl; Police search for shooter", "dct": "NODATE", "id": "3b29df3d50b63435f2c39d1d83f26d36", "content": "PROVIDENCE —\nProvidence Mayor Angel Taveras said Monday the fatal shooting of a 12-year-old girl \"shakes your core\" and that it shouldn't happen anywhere.\nAynis Vargas was shot and killed Saturday night while attending a graduation party at a house on 256 Hartford Ave.\nPolice said three other women, 44-year-old Vilma Tineo, 23-year-old Elaine Devargas, and 33-year-old Eugelyn Cabera-Martinez were also shot. Police said Tineo was treated and released from the hospital, Devargas remains in good condition and Cabera-Martinez is in fair condition.\nJuliana Conteh had just entered her apartment nearby when the shooting happened.\n\"I was very scared, terrified. I couldn't even sleep because the moment I opened the door, it happened and I think it could have been me, because the person next to me got shot too,\" she said.\nThe shooting has sent shock waves throughout the city.\n\"There's simply no way you can explain it and it's not something that should happen anywhere in our city, in our state, country or in the world. Twelve-year-old girls should not lose their life to violence,\" Taveras said.\nProvidence police were seen Monday afternoon canvassing the area.\n\"This shooter, he is a coward,\" said Chief of the Providence Police Department Col. Hugh Clements.\n\"This investigation is certainly moving forward and we're happy with where it is today. Some of these investigations take longer than others. In the end, we will flush out this shooter.\"\nClements wouldn't comment about suspects or a motive, but witnesses told NBC 10 the shooter opened fire on the gathering without notice and then fled the area.\nVargas's uncle told The Providence Journal on Monday the shooter was wearing a black mask and camouflage, and the 12-year-old was shot in the back.\n\"This is a tragedy. We have to realize that we all have a role to play to make our community safer, to educate our children and to hold people that commit acts like this accountable and to put them away so they will never be in a position to hurt someone again,\" Clements said.\nA makeshift memorial of candles, flowers and stuffed animals mark the area where Vargas was killed.\nThe girl's father told NBC 10 that he's looking for justice and wants whoever was responsible caught.\nHe said his daughter was an energetic child who like acting and singing and would have started middle school in the fall.\nVargas' death was the eighth homicide in Providence this year.\nThe Associated Press contributed to this report."}