{"uri": "http://wpri.com/2014/12/19/luis-fat-boy-gonzalez-to-learn-punishment/", "title": "Luis ‘Fat Boy’ Gonzalez sentenced to 30 years in girl’s killing", "dct": "Fri, 19 Dec 2014 07:00:00 GMT", "id": "d54d558304bb126f509325e58c520d06", "content": "PROVIDENCE, R.I. (WPRI) – The last of the five suspects charged in the murder case of a Providence child was sentenced to 50 years in prison with 30 to serve on Friday.\nLuis “Fat Boy” Gonzalez broke down in tears after learning his punishment. Gonzalez, along with four other admitted gang members, was charged in connection with the June 2013 shooting in which 12-year-old Aynis Vargas was killed and three women were injured. His was the only case that made it to trial; the rest pleaded guilty to their respective roles.\nBack in June, the jury handed down a verdict that cleared Gonzalez of both murder and conspiracy to commit murder charges. He was convicted on several lesser charges, including: conspiracy to commit assault with a deadly weapon; three counts of assault with a deadly weapon; discharging a firearm during a crime of violence resulting in death; and three charges of discharging a firearm during a crime of violence resulting in injury.\nGonzalez and his attorneys maintained his innocence throughout the trial. During his testimony, he admitted to being with the four admitted conspirators on the night of the shooting, but he said he was not involved in the execution of the crime. He also admitted to lying to police upon his first arrest, claiming he was afraid the police would “trick him.” He has been in custody since his arrest.\nVargas was shot June 15 during a Hartford Avenue block party. Police said the shooting was the result of a longtime dispute between two neighborhood gangs. She was the youngest of 15 homicides victims in Providence in 2013.\nAlso charged in the crime are:\nBranden Castro: Castro admitted to being the gunman. He was sentenced to two life sentences plus an additional 50 years.\nRicardo Vasquez: Vasquez admitted to driving to and from the shooting scene. He was sentenced to life in prison.\nAngel Valerio: Valerio accepted a plea deal that dropped the murder charge against him. He pleaded guilty to multiple assault counts and conspiracy. He is awaiting sentencing.\nLuis “Didi” Gonzalez: Fat Boy’s younger brother, Didi accepted a similar plea deal to that of Valerio, pleading guilty to assault and conspiracy counts. He is awaiting sentencing."}