{"uri": "http://www.ktvu.com/news/226032351-story", "title": "Family says deadly homeless shelter shooting was accidental", "dct": "Thu, 29 Dec 2016 06:20:00 GMT", "id": "024d57824c27ec20d4242684586c35fe", "content": "BAY POINT, Calif. (BCN) - An East Bay family is mourning the loss of their 18-year-old son from a gunshot wound at Love A Child Missions, a nonprofit that offers emergency housing and recovery services for homeless families at Bay Point.\nThe Contra Costa County Sheriff's Department says at this point, the shooting appears to be accidental.\nDecorative lights adorn the individual homes that house families in need. But the holiday cheer is now gone from one home where Jamie Biggs and her children live.\nFamily says deadly homeless shelter shooting was accidental\nShe says she was attending a prayer meeting at a nearby building when the shooting happened. Biggs says she heard screaming and her son's voice and knew something was wrong.\n\"I ran to the house. His brothers were on top of him...try to bring him back,\" says Biggs.\nMom says Joshua lives with his father. He was here visiting his mother and his siblings for the holidays. She says she suspects that the gun was in Joshua's backpack.\nMom says she believes it was an accident that Joshua and his 15 and 16-year-old brothers who were with him had a great relationship and that there wasn't any trouble between them.\nShe says she doesn't know how Joshua got the gun.\n\"The police officer said they were trying to put it together and then it went off,\" says Biggs. .\n\"He cares about papa ...about mama,\" says Jesus Lopez, Joshua's father.\nLopez says his son didn't like school but was following his dad's footsteps, working as a concrete finisher.\nThis grieving father says he hopes what happened to his family will be a lesson to other parents.\n\"We can give them a lot of stuff, but we got to give more attention to what they doing,\" says Lopez.\nThe Contra Costa County Sheriff's Department has not yet said who pulled the trigger.\nThe parents tell KTVU investigators have interviewed their other sons who were with Joshua at the time of the shooting.\nAn autopsy is scheduled for Thursday.\nAnyone with additional information is asked to call investigators at (925) 646-2441."}