{"uri": "http://www.miamiherald.com/news/local/community/miami-dade/article1956541.html", "title": "2 dead, 2 injured in shooting at cockfight in rural Miami-Dade", "dct": "Mon, 21 Oct 2013 11:24:00 GMT", "id": "0e44422dfc6331a53d37897220d79616", "content": "Behind a banana-colored home in rural southwest Miami-Dade, men had gathered around a cockpit to watch and bet on roosters as they jabbed and bloodied each other. But the violence spilled from the ring into the crowd of spectators when gunshots rang out, leaving two men dead and another two injured.\nThe shooting took place shortly after 7:30 p.m. Sunday in the 19600 block of Southwest 168th Street. On Monday investigators worked to piece together what happened.\nAmong those who lost their lives: Agustin Figueredo, 67, of northwest Miami-Dade.\nRafael Garcia, 40, and Angel Rivera, 49, were both injured and were being treated at area hospitals. Neither man’s condition was reported.\nA fourth man, struck by bullets, died as well. Police have not identified him but said he was in his 80s.\nOrganizing, betting on or attending cockfights, which flourished in Florida in the 1940s, is outlawed in Miami-Dade. Cockfighting is illegal in all 50 states and considered a felony in 39.\nYet such cockfighting rings have been a popular form of entertainment in this rural area of the county for years. Just ask Greg Barnes, 39, who used to live less than a mile west of the shooting site and now works at a nearby zoo. He said police busted a cockfighting ring near his former home.\n“There was a house with a lot of chickens, and every Saturday and Sunday you could just tell that something was going on,” Barnes said. “They got busted and people came through my yard,” trying to evade police.\nOn Monday, wild chickens roamed a property adjacent to where the shooting happened. On another parcel of land a short drive east of the scene, a farmer was tending to some 500 hens and cocks earmarked for sale in Puerto Rico.\nWorkers at Blowing Rock Farms, immediately next to the property where the shooting took place, said their neighbors are “pretty quiet.”\n“Nothing, nothing, nothing at all,” worker Manny Lopez said when a reporter asked about any signs of cockfighting.\nThe property where the shooting took place, 19651 SW 168th St., includes a one-story, 2,500-square-foot home built in 1984 with three bedrooms and three bathrooms on about 8.5 acres of land.\nLazaro Perea sold the property to Luis Barroso in February for $70,000, records show; the real estate website zillow.com estimates its current value as $350,000. Barroso is owner of Barroso Auto Sales in Miami, and Perea is his sales manager. Perea, who answered the phone at the used-car lot Monday, had no comment about the shooting and said Barroso is in Puerto Rico.\nAs of Monday night, police had made no arrests in the shooting."}