{"uri": "http://www.times-standard.com/general-news/20150408/sheriff-missouri-shooter-was-drunk-had-marijuana-in-system", "title": "Sheriff: Missouri shooter was drunk, had marijuana in system", "dct": "Wed, 08 Apr 2015 19:00:00 GMT", "id": "5e52e359d574cfe4fddf756fa58e2410", "content": "ST. LOUIS (AP) — A southern Missouri man who fatally shot seven people before killing himself had a blood alcohol level three times the legal limit and marijuana in his system, according to lab results released Wednesday.\nTexas County Sheriff James Sigman said testing at the Missouri State Highway Patrol Crime Laboratory also helped investigators conclude the victims were shot with the .45-caliber semi-automatic pistol found beside Joseph Jesse Aldridge after he took his own life in his pickup truck.\nThe shootings happened the night of Feb. 26 and the early hours of Feb. 27 in Tyrone, a small unincorporated community of fewer than 50 residents. Sigman said the 36-year-old Aldridge acted alone.\n\"Joseph Aldridge was the only suspect in this Homicide investigation and no clear or known motive was ever established,\" Sigman said in a news release.\nAdvertisement\nSigman said Aldridge's blood alcohol level was 0.256 percent. The legal limit in Missouri is 0.08 percent. His blood also had traces of marijuana, the pain relievers acetaminophen and ibuprofen, an antihistamine and naproxen, an inflammation reducer for arthritis.\nPolice believe Aldridge started the shootings soon after finding his mother, 74-year-old Alice Aldridge, dead in her home. She had been suffering from lung cancer and Texas County Coroner Tom Whittaker ruled she died of natural causes.\nAuthorities said Aldridge killed two of his cousins and their wives, along with three other people. The victims were Garold Dee Aldridge, 52, and his wife, Julie Ann Aldridge, 47; Harold Wayne Aldridge, 50, and his wife, Janell Arlisa Aldridge, 48; Carey Shriver, 46, and his wife, Valirea, 44; and Darrell Shriver, 68. Shriver's wife was shot but survived.\nAldridge then drove about 15 miles to Shannon County, where his body was found inside his truck."}