{"uri": "http://wiat.com/2016/02/06/police-3-year-old-accidently-shoots-9-year-old-sister-in-irondale/", "title": "3-year-old accidentally shoots 9-year-old sister in Irondale", "dct": "Sat, 06 Feb 2016 17:25:00 GMT", "id": "784643c97e195dc4c483b082291b268a", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nIRONDALE, Ala. (WIAT) — UPDATE: The child has been identified as Kimi Reylander.\nHer visitation will take place Tuesday from 5 p.m. to 7 p.m. at Ridout Funeral Home in Trussville.\nThe funeral will take place on Wednesday at 1 p.m. at the same location.\nAccording to Detective Michael Mangina, the Irondale Police Department is wrapping up their investigation of the death of Reylander. At this time, they do not anticipate any charges.\nORIGINAL: A 9-year-old child has died after an accidental shooting Saturday in Irondale.\nThe shooting happened about 2 p.m. on Monroe Drive. Irondale Police Chief Ken Atkinson told CBS42 the 3-year-old brother of the girl discovered a gun on a nightstand in the room the two were playing in. He accidently pulled the trigger, shooting his sister in the head. The two were at the home of their great-grandparents.\n“I came in and when I came in the door, my son came out and said she had been shot,” said the victim’s great grandfather, Joel Watson.\nAtkinson said the family members who were home at the time did not know the gun was in the room the kids were playing in. The gun had been placed there by another family member who was not home at the time, and did not know the kids would be there, according to Atkinson.\n“Her grandma was laying the towel on her head and laid down there and started praying, she was praying, I was praying, my wife was screaming and praying. Nobody knows how that feel until you experience it,” said Watson.\nThe girl was flown to Children’s Hospital where she later died. Police call the shooting a “tragic accident.”\n“My understanding is the great grandfather had the pistol laying on the dresser. The uncle and grandmother didn’t know it was laying there as well,” said Irondale Police Chief Ken Atkinson.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}