{"uri": "http://www.cleveland.com/metro/index.ssf/2015/10/baby_shot_on_clevelands_east_s.html", "title": "Baby shot, killed on Cleveland's East Side, police still searching for suspect", "dct": "Fri, 02 Oct 2015 09:24:43 GMT", "id": "a75960944d2cd4ca610175501e325cc7", "content": "CLEVELAND, Ohio -- A 6-month-old baby girl died after being shot on Cleveland's East Side, where police continued to search for the shooter late Thursday night.\nAs of 11 p.m., there had been no word of an arrest.\nSWAT members and other police officers entered an apartment building near East 145th Street and Spear Avenue at about 8:15 p.m. The suspect was believed to be inside the building over which a police helicopter hovered.\nThe baby girl was shot while riding as a passenger in a car on East 143rd Street near Kinsman Road Thursday evening, according to multiple news reports.\nThe baby is the third young child killed on the city's East Side within the past month. Police Chief Calvin Williams broke into tears during a briefing with the media as he talked about the latest shooting. \"It's tough,\" he said. \"Enough is enough.\"\nHe said his officers had been instructed to stay as long as it takes to find the people responsible for the baby's death.\n\"We want bodies in jail tonight for this crime,\" Williams said Thursday, adding that more people have come forward recently to give police information about violent crimes.\nMayor Frank Jackson, who was at the scene, said such violence causes everyone pain and that it will take work from the government and the community to end the violence.\nRamon Burnett, 5, died last month after he was shot during a drive-by shooting outside his grandmother's home. Less than two weeks later, Major Howard, 3, also died in a drive-by shooting.\nGun violence in September made it the deadliest month of 2015 in Cleveland.\nThe baby was reportedly the only person in the car hit in the shooting. A white car, with its doors open, was towed from the middle of East 143rd Street after the incident.\nThe news of the shooting got a quick reaction from LeBron James after Thursday's Cavaliers practice in Independence.\nLike seriously man!!!! A baby shot in the chest in Cleveland. It's been out of control but it's really OOC. Ya'll need to chill the F out.\n-- LeBron James (@KingJames) October 1, 2015\nC'mon man let's do and be better! Don't fall into the trap. This can't be only way. Accept more from yourselves. #TheLand #TheNation\n-- LeBron James (@KingJames) October 1, 2015\nCheck cleveland.com for more updates."}