{"uri": "http://www.wsoctv.com/news/local/authorities-respond-to-shooting-in-granite-falls/207428838", "title": "16-year-old dies in accidental shooting, Caldwell Co. deputies say", "dct": "Tue, 12 Apr 2016 09:35:00 GMT", "id": "e9f3f9d746a70e6e72a5583e44edde2c", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nGRANITE FALLS, N.C. - A death investigation is underway Monday in Caldwell County after a 16-year old was shot and killed.\nFamily members said Dekota Smith, a student at South Caldwell High School, accidentally shot himself while Skyping with a friend.\nCounselors and clergy were at the school Monday to help students grieve.\nFamily members say the South Caldwell High student was skyping at the time showing a friend the gun when it went off pic.twitter.com/NqY1lYxQv6\n— Dave Faherty (@FahertyWSOC9) April 11, 2016\nGregory Johnston told Channel 9 that he still can't believe his nephew is gone.\nJohnston said Smith was at his grandparents’ home when he accidentally shot himself. Johnston said his nephew was showing a gun to a friend, using his cellphone to do a live video chat, when the weapon went off.\n\"The person he was talking to said he was looking at him face to face on his little phone and all of a sudden he could see the ceiling. And apparently he heard the bang and (knew that) something (was) wrong,” Johnston said.\nThere was a moment of silence at South Caldwell High School for Smith as students returned to school Monday morning. The winter athletic awards scheduled for Monday night have been postponed.\nSmith was a member of both the wrestling and track teams. His teammates are making a memorial banner for his family.\n\"It is extremely tough on the children. When you have someone who is one of your peers who is involved in a situation that is this horrific, it's heartbreaking, and we knew we'd have upset children here today,” Libby Brown of Caldwell County Schools said.\nDeputies said they are still trying to determine how the teenager got the weapon.\nThey said the case is a reminder to everyone about the importance of gun safety.\n\"Make sure that parents understand to secure those weapons, because if the kids are very small or in their teens, they could still get those weapons and hurt somebody as well as themselves,” Caldwell County Sheriff Alan Jones said.\nDeputies said they still have more interviews to do in the case. Once their investigation is complete, they will forward it to the district attorney’s office.\nRead more top trending stories on wsoctv.com:\n© 2017 Cox Media Group."}