{"uri": "http://www.ledger-enquirer.com/news/local/article112926578.html", "title": "17-year-old identified as suspect shot, killed by Columbus police officer", "dct": "Sun, 06 Nov 2016 15:11:00 GMT", "id": "dd717029c007fb509e89f34ad7ebd2b7", "content": "The car theft suspect who was shot and killed early Sunday by a Columbus police officer was identified as 17-year-old Christian Andrew Redwine of Columbus, said Russell County Coroner Arthur Sumbry Jr.\nSumbry said he pronounced Redwine dead at the scene.\nAn officer shot and killed the suspect after a vehicle chase that started in Columbus and ended in Phenix City, Columbus Police Chief Ricky Boren said.\nAccording a news release from the police department, shortly before 4:25 a.m, members of the Columbus Police Department’s Bureau of Patrol Services observed a suspicious vehicle around businesses near the intersection of Milgen Road and Reese Road. The vehicle was driving in and around several closed businesses.\nOfficers maintained surveillance and notified the Columbus 911 Center. The center informed officers that the vehicle had just been stolen.\nAttempts made by the officers to stop the vehicle using blue lights and sirens were ignored by the driver who then attempted to flee, the news release said.\nPolice said the vehicle pursuit went into Phenix City where the driver turned onto Riverchase Drive off Highway 80 at which time the driver lost control of the vehicle.\nA Columbus police officer exited his vehicle and encountered three suspects.\nThe officer fired several shots from his weapon, the report said.\nRedwine was pronounced dead at the scene. Two suspects were taken to Midtown Medical Center in Columbus with what appeared to be non life-threatening injures.\nThe Alabama Law Enforcement Agency is investigating, Boren said.\nAccording to an ALEA spokesman, the agency is involved at the request of Boren and Russell County District Attorney Kenneth Davis.\nDavis said he had an investigator on the scene around 5 a.m. He said he was told the suspects were two men and a woman and it was the driver who was killed.\nDavis said the officer had reason to believe the stolen vehicle was being used as a weapon, Davis said.\nPhenix City police responded to the call but the shooting involved Columbus police, Davis said he was told."}