{"uri": "http://triblive.com/news/adminpage/10515983-74/burnsworth-gustafson-pleasant?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29", "title": "3 adults charged in connection with fatal shooting of Mt. Pleasant teen", "dct": "Mon, 23 May 2016 02:51:00 GMT", "id": "3ac14941a612116d58f96b0167f89c61", "content": "Two people were charged Monday with child endangerment in the March 20 shooting death of a 13-year-old Mt. Pleasant teenager, allegedly by his 14-year-old friend.\nWestmoreland County police Detectives Will Brown and Frank Galilei charged Joshua Hudec, 31, and Brooke Nelson, 18, both of Mt. Pleasant, with five counts of child endangerment and reckless endangerment, and a single count of possession of a firearm by a minor.\nHudec owned the gun and lives at 151 S. Church St., where police say John Henry Burnsworth fatally shot James Robert “J.R.” Gustafson. The boys were seventh-grade classmates at Mt. Pleasant Area Middle School.\nHudec was not home at the time of the shooting, but the handgun, which was unregistered, was kept in his bedroom, according to the criminal complaint.\nNelson was in the house baby-sitting Hudec's children at the time of the shooting, authorities say.\nA third person, Kristopher Lewis, 44, of Mt. Pleasant, is accused of transferring ownership of the handgun to Hudec without filing required paperwork. He is charged with a firearms violation.\nThe criminal complaints filed Monday shed new light on the circumstances of the shooting.\nPolice said Nelson invited Burnsworth and Gustafson into the home when the two stopped by to visit.\nNelson told detectives that she wanted Gustafson to leave, “but she did not want to be the one to tell him to leave,” according to the affidavit of probable cause.\nBurnsworth and Nelson devised a plan for Burnsworth to retrieve the 9-mm handgun from Hudec's bedroom to scare Gustafson into leaving.\n“Nelson further stated that John Burnsworth removed the clip from the firearm and told Ms. Nelson, ‘I'll scare him with this,' ” according to the affidavit. “Moments later, Burnsworth pointed the handgun at the victim and pulled the trigger, causing it to discharge.”\nAlthough Burnsworth allegedly removed the clip, there was a live round in the chamber, detectives said.\nPolice said Gustafson was found on the floor with a gunshot to the face. He was pronounced dead at the scene.\nHe was the son of volunteer firefighter Mark Gustafson and his wife, Leah Smith-Gustafson.\nBurnsworth has been charged as an adult with homicide and illegal possession of a firearm by a minor. He is being held without bail in the Westmoreland County Juvenile Detention Center.\nGreensburg attorney William Wiker, who accompanied Hudec to his arraignment before Norvelt District Judge Roger Eckels, said his client is “devastated” by the shooting.\n“This is a very real and unfortunate tragedy. My client remains really devastated about the loss of life here,” Wiker said.\nLewis and Nelson, who were not represented by attorneys, declined to comment as they left Eckels' office.\nBrown and Galilei allege Lewis won the weapon at a gun bash and sold it to Hudec. The transfer was never completed by a licensed gun dealer or the county sheriff's department, the detectives said.\nHudec, Nelson and Lewis were released on signature bond at the recommendation of investigators because they have cooperated with police.\nThe detectives said the investigation is ongoing but they believe Burnsworth, Hudec, Nelson and Lewis will be the only people charged in the case.\n“Unless something else comes up,” Galilei said.\nBurnsworth's attorney, Richard J. McCague of Pittsburgh, has said he will try to have his client tried as an juvenile.\nMcCague has said the shooting was an accident.\nHe has been unsuccessful in attempting to have Burnsworth placed on house arrest at his parents' home while he awaits trial.\nUnder state law, if Burnsworth is adjudicated as a juvenile, he could be detained under court supervision only until his 21st birthday.\nA conviction of first-degree murder in adult court carries a mandatory sentence of life imprisonment.\nPaul Peirce is a staff writer for the Tribune-Review. He can be reached at 724-850-2860 or ppeirce@tribweb.com."}