{"uri": "http://triblive.com/news/adminpage/10181630-74/borough-killed-pleasant", "title": "Mt. Pleasant teen charged with shooting friend while playing with handgun", "dct": "Mon, 21 Mar 2016 02:01:00 GMT", "id": "5b30c4650e3dd5cd0aa97691375132dc", "content": "Everyone in town knew 13-year-old J.R. Gustafson, said Jerry Lucia, Mt. Pleasant's mayor and fire chief.\n“He just had so much energy. He was always riding that bicycle ... up and down and all around the town, playing basketball or fishing,” Lucia said.\nLucia said that's why so many in the community of about 4,500 were shocked and saddened by news of the tragic death of James Robert Gustafson, the son of volunteer firefighter Mark Gustafson and his wife, Leah Smith-Gustafson.\nMt. Pleasant police said J.R., a seventh-grader at Mt. Pleasant Area Middle School, was at a South Church Street apartment about 6:48 p.m. Sunday where a friend was playing with the handgun when it discharged, killing the teen.\nJohn Burnsworth, 14, of Mt. Pleasant was charged as an adult with homicide and illegal possession of firearm by a minor by Assistant Chief Dan Zilli, online records show.\nBurnsworth was being held without bail in the Westmoreland County Detention Center.\nOn being called, police found J.R. lying on the floor of the home with a gunshot to the face, according to the affidavit of probable cause filed before Norvelt District Judge Roger Eckels. He was pronounced dead at the scene by Deputy Coroner Tim O'Donnell.\nZilli said officers found the handgun on the front porch.\nNeither teen lived at the home, Lucia said. Police have not released the resident's name.\nPolice and detectives are trying to determine who owns the gun, said police Chief Douglas Sam.\n“The investigation remains active and ongoing,” he said.\nSam said an 18-year-old female baby sitter was in the home watching the resident's three young children when J.R., Burnsworth and a third teen stopped by. Sam said witnesses told police that “the teens were handling the handgun” in the kitchen when it discharged.\n“We're investigating the circumstances on how exactly it got there,” he said.\nSam said Burnsworth told police that he picked up the gun and removed the magazine, “but obviously there was still a live round in the chamber and he fired it” toward J.R., killing him.\nThe police chief said the baby sitter and several others witnessed the shooting.\nSam declined to say whether more charges will be filed, pending further investigation.\n“We're still in the process of sorting a lot of the specific details out, which will determine whether more charges are warranted. We will also speak with District Attorney John Peck before deciding whether we'll file more charges,” the chief said.\nLucia spoke Monday morning during a news conference on behalf of J.R.'s parents and his three brothers, ages 15, 10 and 6.\n“It wasn't unusual to see J.R. riding his bicycle through town with a fishing pole on the back,” Lucia said. “He was looking to become a junior fireman like his older brother, Mark, when he turned 14 in June. And we were looking forward to him bringing some of that energy he had to us. This is just so tragic.”\nHe called the Gustafsons “a great family who would do anything for you.”\n“As parents, you give it all you have. But get guns in a house, and it's a bad situation,” Lucia said.\nNo one answered the door at the apartment Monday.\nNeighbor Kathleen Ceroni, a teacher at Southmoreland High School, said she did not hear about the shooting until Monday morning.\n“It's disconcerting to have an event like this happen in our town. It's a tragedy for all the families involved,” she said.\nLucia said the school district had grief counselors available to students Monday.\nBrooks Funeral Home in Mt. Pleasant is in charge of arrangements.\nPaul Peirce is a Tribune-Review staff writer."}