{"uri": "http://triblive.com/news/westmoreland/10188804-74/homicide-pleasant-charged?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29", "title": "Mt. Pleasant teen among youngest charged with homicide in county", "dct": "Tue, 22 Mar 2016 11:00:00 GMT", "id": "5e04a4c27e43f2da9dbb097252c62c11", "content": "It's rare for a child as young as 14 to be charged with homicide in Westmoreland County, District Attorney John Peck said.\n• Ian Bishop was 14 when he was charged with killing his older brother, Adam, on April 18, 2002, in their Hempfield home. He became the youngest person ever convicted of murder — third-degree — in the county in July 2003. He is serving 20 to 40 years. His co-defendant, Robert M. Laskowski, was sentenced to eight to 20 years for third-degree homicide. Laskowski was 15 at the time of the crime.\n• A 12-year-old boy was adjudicated delinquent of involuntary manslaughter in juvenile court after he and Philip Cusmano, 14, played with a gun unsupervised at the boy's family's home in Rostraver. Cusmano was shot in the neck and died on Feb. 25, 2001. The boy's father served six to 23 months on a reckless endangerment charge for leaving them alone with a loaded gun.\n• A 12-year-old boy was charged with involuntary manslaughter in juvenile court after pulling the trigger of a rifle and killing Christopher Harr, 11, at a Ligonier Township home on Sept. 3, 2010. They were home alone. The boy's stepfather was sentenced to two years of probation on endangerment charges.\n• Members of the Mt. Pleasant fire department will meet at the funeral home at 7 p.m. Wednesday.\n• Service at 1:30 p.m. Thursday, with the Rev. Richard Kosisko officiating, followed by interment in St. Pius Cemetery\nA 14-year-old boy accused in his friend's shooting death is one of the youngest in Westmoreland County to be charged with homicide, District Attorney John Peck said.\nAuthorities have not said who owns the handgun that discharged and killed 13-year-old James “J.R.” Gustafson in a Mt. Pleasant home.\n“The case is still being investigated,” Peck said.\nPolice allege that Burnsworth was playing with the gun when it fired at 6:48 p.m. in the kitchen of a South Church Street apartment. J.R. was shot in the face and died at the scene.\nBurnsworth is charged as an adult with homicide and unlawful possession of a weapon.\nCounty detectives declined to comment on their investigation Tuesday.\nMt. Pleasant Area School District Superintendent Timothy Gabauer said counseling has been available to students all week. Both boys were seventh-graders, principal Robert Gumbita said.\nThe past few days “haven't been easy” for students, teachers and administrators, Gumbita said. “There's two families involved, and their lives will be forever changed by the events.”\nTeachers and students are planning fundraising and remembrance activities Wednesday, he said. Faculty members are donating to offset funeral costs for the Gustafson family.\n“The great thing is we rally around one another,” Gumbita said.\nStudents will wear orange and blue clothing in memory of their friend, who was a Denver Broncos fan, Gumbita said. J.R. always got some good-natured ribbing when he wore a team jersey to school, the principal recalled.\nSome of his classmates plan to release balloons in his memory, Gumbita said.\nThe Mt. Pleasant Volunteer Fire Department is planning a ceremony to make J.R. an honorary junior firefighter June 21, his 14th birthday, said Jerry Lucia, borough mayor and fire chief. The boy had wanted to follow in the footsteps of his older brother and father and join the fire department when he turned 14.\n“J.R.'s family's just devastated,” Lucia said.\nHe is survived by his parents, Mark A. and Leah Smith Gustafson; a sister, Rachel Gustafson; and three brothers, Mark Jr., Michael and Zackary.\nBurnsworth is being held without bail at the Regional Youth Services Center in Hempfield. No one answered the door at his home Tuesday morning. He did not have an attorney listed in online court records. A March 31 preliminary hearing is set.\nPolice said several people in the apartment witnessed the shooting. An 18-year-old baby sitter was in the home caring for the residents' three young children whenJ.R., Burnsworth and a third teen stopped by. Burnsworth told police that he picked up the gun in the kitchen and removed the magazine, according to court papers. Police said there was a live round in the chamber when he allegedly pointed the weapon at his friend.\nNo one answered the door at the apartment Tuesday.\nAshley Hudec of Mt. Pleasant said her 7-year-old daughter lives there with her father and witnessed the shooting. The girl was not injured.\n“I am mad,” Hudec said. “There's still a lot of unanswered questions that need to be answered,\n“It's terrifying that a loaded gun was being carried throughout the house. It could've been one of my kids,” she said. “I just want to know how the kids knew where the gun was.”\nA person who is “reckless” with a firearm in any situation could be held legally responsible, Peck said.\n“You have to endanger somebody in some fashion” to be charged, he said.\nRenatta Signorini is a Tribune-Review staff writer. Reach her at 724-837-5374 or rsignorini@tribweb.com."}