{"uri": "http://triblive.com/news/adminpage/10328090-74/burnsworth-gustafson-shooting?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+tribunereview%2Fwestmoreland+%28Westmoreland+News%29", "title": "Judge denies house arrest for Mt. Pleasant teen charged in fatal shooting", "dct": "Mon, 18 Apr 2016 01:12:00 GMT", "id": "a1d5640805559d0b324531c9e44f0261", "content": "A Mt. Pleasant teenager charged as an adult in the shooting death of a friend will remain in custody for the near future.\nWestmoreland Judge Rita Hathaway on Monday denied defense attorney Richard J. McCague's request to release John Henry Burnsworth, 14, on house arrest with electronic monitoring.\nBurnsworth is accused of shooting James Robert “J.R.” Gustafson, 13, as Burnsworth played with a handgun in a South Church Street apartment.\nThe teen is charged as an adult in the March 20 shooting, which McCague has said was accidental.\nAs sheriff's deputies escorted Burnsworth from the courthouse following the hearing, he nodded in the affirmative when reporters asked if the shooting was an accident and if he missed Gustafson.\nBurnsworth and McCague appeared before Hathaway on Monday on the motion seeking to hire, at taxpayers' expense, a psychologist to assist with efforts to transfer the case to juvenile court.\nHathaway said she will reserve ruling on the request to appoint the psychologist until both sides have examined discovery documents.\nShe denied McCague's request to release Burns-worth to his parents' custody on home electronic monitoring, but she granted a request ordering two mental health agencies to release Burnsworth's treatment records to the defense.\nThe agencies are Latrobe Mental Health and Chestnut Ridge Counseling Services. The nature of the services the agencies provided to Burnsworth were not discussed in open court.\nIn addition, Hathaway ordered prosecutors to provide the defense with details of a prior criminal incident in which Burns-worth was the victim. Details of the incident were not disclosed.\nThe boys were seventh-grade classmates at Mt. Pleasant Area Middle School.\nGustafson was found lying on the floor with a gunshot to the face and was pronounced dead at the scene, according to a police affidavit.\nThe victim is the son of volunteer firefighter Mark Gustafson and his wife, Leah Smith-Gustafson.\nBurnsworth is charged with homicide and illegal possession of a firearm by a minor. He is being held without bail in the Westmoreland County Juvenile Detention Center.\nBy state law, if Burns-worth were adjudicated as a juvenile, he could be detained under court supervision until he turns 21. A conviction of first-degree murder in adult court carries a mandatory sentence of life imprisonment.\nLiz Zemba is a Tribune-Review staff writer."}