{"uri": "http://triblive.com/news/westmoreland/10992889-74/pleasant-burnsworth-charged?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29", "title": "Mt. Pleasant teen charged in classmate's shooting death to be evaluated", "dct": "Thu, 18 Aug 2016 11:05:00 GMT", "id": "d3a937cd179ad80e92e5e9cdd2a68e32", "content": "A forensic psychologist was appointed Thursday to evaluate a Mt. Pleasant teenager accused of fatally shooting a friend in March.\nDr. Alice Applegate was hired to meet with John Henry Burnsworth III, 14, to detail for attorneys whether it would serve the public interest to move the prosecution of his homicide case from adult to juvenile court.\nApplegate will be paid $200 per hour for a maximum of 20 hours, according to an order issued by Westmoreland County Judge Rita Hathaway.\nPolice said Burnsworth had access to a handgun and shot James Robert “J.R.” Gustafson, 13, in a Mt. Pleasant home on March 20. The seventh-grade classmates were visiting an apartment where three young children were in the care of an 18-year-old baby sitter.\nThe defense contends Burnsworth — who was charged as an adult with one count of homicide and possession of a firearm by a minor — did not intend to shoot Gustafson.\nAttorney Richard McCague has indicated that he plans to file a motion to seek the transfer of Burnsworth's case to juvenile court.\nDuring a June pretrial hearing, Hathaway ordered attorneys to review Burnsworth's records at the county Children's Bureau. They are sealed from the public and unavailable for review without a judge's order. Hathaway said then that she would approve a limited amount of funds if further evaluation was needed after the review.\nBurnsworth has been held in the county's juvenile detention center since his arrest.\nThree adults were charged in connection with the shooting.\nJoshua Hudec, 31, of Mt. Pleasant was charged with five counts of child endangerment and reckless endangerment and a count of possession of a firearm. Police said Hudec lived in the South Church Street home where the shooting occurred and owned the gun. Baby sitter Brooke Nelson, 18, of Mt. Pleasant was charged with the same offenses.\nKristopher Lewis, 44, of Mt. Pleasant, was sentenced Aug. 10 to two years of probation on a firearms violation for transferring ownership of the handgun to Hudec without filing required paperwork.\nRenatta Signorini is a Tribune-Review staff writer."}