{"uri": "http://triblive.com/news/westmoreland/10941878-74/lewis-charged-gun?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29", "title": "Sale of gun in boy's slaying in Mt. Pleasant nets plea", "dct": "Wed, 10 Aug 2016 11:00:00 GMT", "id": "e69a5fc3eaba4c50ba59e8c036d78db6", "content": "A Mt. Pleasant man pleaded guilty Wednesday to a firearms offense for improperly selling a handgun that police said was used by a seventh-grade boy to kill a classmate this year.\nKristopher Lewis, 44, was sentenced by Westmoreland County Judge Christopher Feliciani to serve two years of probation as part of a plea bargain that could require him to testify against a teenager facing murder charges, his baby sitter and a man charged with allowing children to gain access to a gun.\n“It's in my best interest,” Lewis told the judge as he explained why he chose to plead guilty to the misdemeanor charge.\nAssistant District Attorney Jackie Knupp said in court that as a condition of Lewis' plea, he must offer truthful testimony in any upcoming trials if he is asked to do so.\nPolice contend Lewis was the original owner of a 9 mm handgun used by 14-year-old John Burnsworth in the March 20 fatal shooting of James Robert “J.R.” Gustafson, 13, in a Mt. Pleasant home.\nBurnsworth was charged as an adult with criminal homicide.\nPolice said Burnsworth had access to a handgun and shot Gustafson in the head as they visited a Church Street apartment where three young children were in the care of an 18-year-old baby sitter.\nBurnsworth is seeking to have his case transferred to juvenile court. He is scheduled to appear in court Aug. 18 for a pretrial conference before Judge Rita Hathaway.\nJoshua Hudec, 31, of Mt. Pleasant was charged with five counts of child endangerment and reckless endangerment and a count of possession of a firearm by a minor. Police said Hudec lived in the South Church Street home and purchased the handgun from Lewis.\nLewis was charged with a weapons offense because he was not a registered gun dealer and did not fill out the required paperwork to sell the gun to Hudec, according to court records.\nThe baby sitter, Brooke Nelson, 18, of Mt. Pleasant, also was charged with child endangerment and a firearms offense.\nThe cases against Hudec and Nelson are pending.\nRich Cholodofsky is a Tribune-Review staff writer. Reach him at 724-830-6293 or rcholodofsky@tribweb.com."}