{"uri": "http://www.uticaod.com/article/20160321/NEWS/160329948/SHARED/160329948", "title": "Bartle sentenced, granted youthful offender status", "dct": "Sun, 29 Jan 2017 03:37:12 GMT", "id": "4a54637e7d9802d4f69654541fb22ca5", "content": "When 18-year-old Henry Bartle stood up from the couch of his Rome apartment with a shotgun in his lap, the sudden discharge of that weapon - which fatally struck an infant - was not intentional, a prosecutor and judge agreed at his sentencing Monday.\nThey did, however, differ on whether his conviction should be a permanent mark on Bartle's criminal record.\nBartle, who previously pleaded guilty to felony second-degree manslaughter and misdemeanor endangering the welfare of a child in February, was sentenced Monday to 1 1/3 to 4 years in state prison on the manslaughter charge. He was also sentenced to one year for endangering the welfare of a child, to be served concurrently.\nBartle was ultimately granted youthful offender status despite the objections of the Oneida County District Attorney's Office and the child's family, meaning that Bartle's criminal record will be sealed.\nAssistant District Attorney Joshua Bauer said in court that it was obvious that Bartle is \"deeply… and genuinely remorseful,\" but that does not negate the recklessness of his conduct, which included smoking marijuana 30 minutes prior to the incident, changing the shotgun's grip in the child's presence and not realizing the weapon was loaded.\n\"It's also clear to us that Mr. Bartle acted with wanton recklessness on the date of Nathaniel Hitt's death,\" Bauer said. \"It was an abject recklessness that was just plain off the charts. He fool-heartedly handled a loaded shotgun in the presence of an infant, all while high on marijuana.\"\nBauer said Nathaniel had to \"pay a brutally permanent consequence\" for Bartle's conduct. On that basis, he and his office opposed youthful offender status for Bartle.\nBartle's attorney Mark Curley did not immediately return a request for comment.\nJudge Barry Donalty, meanwhile, said that under the statute Bartle is eligible for youthful offender status. He said the court would have had to find \"aggravating factors\" to show that youthful offender status would be inappropriate.\n\"(The shooting) reflected a lack of insight and judgment by Mr. Bartle, which is generally an affliction of youth,\" Donalty said. \"It was not a serious deed of a hardened criminal. This court is required to examine the appropriate punishment and consider at the same time the defendant's lack of experience and lack of judgment. This defendant admitted to a series of conscious and intentional decisions which ultimately led to the death of Nathaniel.\"\nGary Muntz, the grandfather of Nathaniel, said he \"pretty much figured out,\" Bartle would be granted youthful offender status despite his objections.\n\"There should be a law passed, at least in New York State, so if there's something like killing a baby or killing a person they shouldn't be eligible for youthful offender,\" he said.\"\nFollow @OD_Parker on Twitter or call her at 315-792-5063."}