{"uri": "http://www.uticaod.com/article/20151201/NEWS/151209988/1998/NEWS", "title": "Area college hockey roundup", "dct": "Sun, 29 Jan 2017 03:36:55 GMT", "id": "5f4a6a4dd27ac8b0bfa5bca8a1851c74", "content": "Another one-goal victory helped Utica College men create some separation in league play. Justin Derlago scored the game-winning goal with 21 seconds left to help UC drop Manhattanville 3-2 in overtime Saturday in Rye. With the help of a 5-4 win over Neumann on Friday, Utica (12-7) swept the weekend, improving its Eastern College Athletic Conference West record to 8-1 with 16 points. After a scoreless first, Riley Egan's first of two goals came 3:39 into the second. Bryan Platt tied it at 1 for Manhattanville (10-9-1, 6-3) eight minutes later...\nRead more\nFederal judge stays enforcement of travel ban\nA federal judge in New York has issued an emergency order temporarily barring the U.S. from deporting people from nations subject to President Donald Trump's travel ban.\nRead more\nComets earn point in shootout loss to Crunch\nUTICA - The Utica Comets closed out their best January in the team's short history on a slightly sour note. However, Saturday's result was another tight one between the Comets and the Syracuse Crunch, their North Division rival. The teams needed extra time to decide a winner for the third time in four meetings this season. It was the Comets that earned only one point. Cory Conacher scored the lone goal in a shootout to help Syracuse edge the Comets 4-3 on Saturday at Utica Memorial Auditorium. The Comets finished the month with an 8-2-1-1 record after falling in their last three games...\nRead more\nTrump, Putin discuss 'mutually beneficial' trade, security\nWASHINGTON - President Donald Trump had an hourlong discussion Saturday with Russian President Vladimir Putin - the first since Trump assumed office last week - raising questions over the fate of U.S. sanctions against Moscow and whether the two will look to enhance military cooperation against the Islamic State group. The White House provided a thin readout on the call between the two leaders, saying it was \"a significant start to improving the relationship between the United States and Russia that is in need of repair...\nRead more\nHere's a gallery from Saturday's game between the Utica Comets and Syracuse Crunch.\nRead more\nGALLERY: Thin ice can't dampen Ice Bowl party\nDespite unsafe ice conditions which canceled tournament play at the Adirondack Ice Bowl pond hockey festival, the party was in full force, inside and outside of The Woods Inn in Inlet. Cold beer, warm hearts, food and entertainment were abundant during this all-day event.\nRead more\nJustin Bieber gets hit, bounces back in celeb hockey game\nLOS ANGELES - Justin Bieber got a taste of NHL hockey and the Staples Center glass Saturday, courtesy of NHL great Chris Pronger. The pop star responded by showing off skills that would not have looked out of place in his native Canada during a celebrity exhibition game. Bieber was driven into the boards in the first half by a laughing Pronger, who spent 18 years in the league as a hard-nosed defenseman. The singer responded with an empty-net goal and an assist as Team Gretzky beat Team Lemieux 5-3 in the 2017 NHL All-Star Celebrity Shootout...\nRead more"}