{"uri": "http://www.ksl.com/?sid=35291240&nid=960&s_cid=rec3", "title": "Police: Double murder-suicide preceded by argument, break-up threats", "dct": "Mon, 29 Jun 2015 00:00:00 GMT", "id": "c93a317302ff3b2786968b7a6f27adea", "content": "MURRAY — Murray police were already on their way to Johnathon Reeves' home when he opened fire on his fiancée and young son.\nA newly released search warrant affidavit gives a little more insight into what happened on June 7 when Reeves, 30, an Army veteran, shot and killed Jamie Salazar, 34, and 2-year-old Jordan Reeves inside their apartment at 224 E. Vantana Court, then shot and killed himself.\nThe warrant does not offer any additional clues as to what may have sparked the tragedy. However, family members have said he was struggling with emotional issues and Salazar had threatened to break up with him\n\"Jamie had mentioned to both family and friends that she was planning to end things with John,\" Salazar's friend, Melissa Gilham, told KSL.\nMurray police detective Jeff Maglish confirmed Monday that aspect is part of their investigation. \"There were some family problems going on within the household,\" he said.\nThe investigation is wrapping up and a few people still need to be interviewed before a final report was released, Maglish said. Detectives are waiting on the final autopsy reports, including toxicology results. Investigators did not find any type of suicide note, he said, and believe there was something that \"set him off\" that day.\nAbout 11:50 a.m., Murray police were dispatched to Reeves' apartment.\n\"Officers were called to that location for a domestic violence incident in progress. Officers received information that the male on scene was arguing with his mother on the phone as well as his wife who was in the apartment with him,\" according to the affidavit filed in 3rd District Court. \"While officers were en route, there were reports of shots fired from that location.\"\nFamily members, however, said Reeves was actually on the phone with Salazar's mother.\nWhen officers arrived, they found the bodies of Johnathon Reeves and his son Jordan inside a hallway in the apartment, the affidavit states. A black handgun was found under Reeves' leg. The body of Jamie Salazar was found in a bedroom.\n\"It appeared that she had been shot several times, and it appeared that she had a defensive wound on her hand,\" according to the warrant.\nAlso in the apartment at the time of the shooting were Salazar's two girls and a boy from a previous marriage — ages 8 through 11. Those children were physically unharmed and are now with their biological father.\nThe warrant listed nine items seized from the apartment, including a Winchester S&W 40 shell casing in the \"living area,\" a \"bullet slug from bathroom tub,\" a Glock firearm, another shell casing from the Winchester in the hallway and another in the bedroom, and two cellphones.\n\"Officers have been to this location several times in the past for domestic violence related incidents, weapons violations, and suicidal persons involving the same parties,\" police wrote.\nIn August, Reeves was charged with multiple counts of aggravated assault and domestic violence in the presence of a child. In that case, as Salazar was sleeping in her bed with one of her children, age 7, she awoke to find Reeves \"pointing a shotgun at her\" and the child. Reeves said he \"wanted to kill her, her children and himself,\" charging documents state.\nWhen officers arrived, they found Reeves asleep on the couch with a loaded shotgun across his chest. He was also carrying a loaded handgun with one round in the chamber and six in the magazine. Also located in the house in a safe were \"several rifles, a handgun, several hunting knives and a large amount of ammunition,\" the charges state.\nReeves was put in veterans treatment court, a program similar to drug court, which required weekly court appearances. He took a plea in abeyance in January, meaning the charges would be dropped after 36 months of probation and successful completion of VA court.\nAt his last court appearance — just three days before the shootings — the court noted that Reeves was in compliance with his probation. Those familiar with Reeves' case say he was as close to a model participant in the veteran's treatment program as could be found. His drug tests were clean. He was attending all his court hearings and treatment sessions. And he was helping other veterans, according to court officials.\nReeves was a U.S. Army combat veteran who reportedly had worked as a mission gunner.\nIn a short email to KSL, his mother, Doris Reeves, said, \"He was hurting deep inside. … His pain was too great and it broke him.\"\nPhotos"}