{"uri": "http://www.palmbeachpost.com/news/crime--law/central-blotter-man-attempts-smoke-bees-out-attic-sets-insulation-fire/4m8GZfCVZvvVDYzbo9m5HK/", "title": "Central blotter: Man attempts to smoke bees out of attic, sets insulation on fire", "dct": "Wed, 16 Nov 2016 00:00:00 GMT", "id": "796401676b7075040c3b183a3069ea78", "content": "SHERIFF’S OFFICE, LOXAHATCHEE/ACREAGE\nWhen a woman in the 12500 block of 77th Place North complained that she had bees in her attic, a friend tried to smoke them out by setting paper on fire. The burning paper caused a fire in the attic insulation. The fire department was able to put out the fire, but the bees remained.\nSUSPICIOUS INCIDENT\nA man who claimed he had been stung by a bee while sleeping in the back of a pickup in the 11800 block of Seminole Pratt Whitney Road eventually admitted to a deputy that he had shot himself accidentally. He refused to provide more information, for fear of being charged as a felon in possession of a firearm. He was seeking medical treatment for the wound, which he believed was infected.\nCRIMINAL MISCHIEF\nA man in the 16700 block of Hamlin Boulevard reported damage to a concrete culvert on his property.\nSHERIFF’S OFFICE, GREENACRES\nOPEN CONTAINER\nA deputy on patrol arrested a North Carolina man who was drinking beer outside a gas station in the 6700 block of Lake Worth Road. The man was given a notice to appear in court, then released.\nA woman reported losing an envelope containing $520 at a business in the 2900 block of South Jog Road. The woman told a deputy she had contacted the business and was told by an employee that she gave the envelope to another client who claimed it was hers. The deputy spoke to the client who allegedly took the envelope, and she told him she was never handed an envelope by the employee.\nA woman left her iPhone on the checkout counter at a store in the 6200 block of Forest Hill Boulevard. When she returned to retrieve it, the phone was gone. A review of surveillance video showed another woman picking up the phone and placing it into her purse before heading out the door.\nWEST PALM BEACH\nA man stole a $90 bottle of Gucci cologne from a store in the 500 block of South Rosemary Avenue. A loss prevention officer followed the man, who hopped on a trolley and got away.\nA shoplifter was arrested after he stole a pair of $32 earrings from a store in the 500 block of South Rosemary Avenue. The man, who was on probation, was taken to the county jail.\nPROSTITUTION\nAn undercover officer was offered sex by a known prostitute in the area of 15th Street and North Dixie Highway. He told her he had only $40 and she agreed that it was payment enough. She was arrested. A subsequent search turned up a crack pipe in her possession.\nA prostitute offered her services for sale to an undercover officer in the 300 block of 20th Street. Following her arrest, she was found in possession of a crack pipe.\nCRIMINAL MISCHIEF\nWhile a man was visiting his child at his ex-girlfriend’s residence in the 1700 block of North Congress Avenue, the vehicle he was driving was damaged. The vehicle belongs to his current girlfriend. The man told police his ex-girlfriend went outside for a period of time, and he believes she is the culprit. Damage to the vehicle’s rear window and tires was estimated at $460. Police were unable to reach the ex-girlfriend by phone or at her residence.\nHOME BURGLARY\nA lawnmower valued at $299 was stolen from the fenced backyard of a residence in the 600 block of 37th Street.\nOPEN CONTAINER\nPolice received a call about a prostitute flagging down cars in the 5600 block of Broadway. An officer found the woman, who was drinking an alcoholic beverage. A background check showed she had an outstanding warrant for failure to appear in court on a drug paraphernalia charge. She was arrested. A search turned up two crack pipes in her pocket.\nSHERIFF’S OFFICE, LAKE WORTH\nTRESPASSING\nA man was given a trespass warning from a cafe in the 500 block of Lake Avenue at the request of store personnel. The man had been an ongoing problem, according to an employee who told a deputy he often asked for free food and coffee. When denied free food and drink, he would become agitated and curse at employees and customers. The man also made rude remarks to female customers outside the business, the employee said. The man was told to stay off the premises for one year.\nAn unlocked bike was stolen from outside an apartment in the 500 block of North M Street.\nA cellphone left unattended on a counter during a party in the first block of Indigo Terrace was stolen.\nCRIMINAL MISCHIEF\nSomeone threw a rock through the rear window of a vehicle in the 800 block of South F Street. The victim said she had yelled at two unknown males earlier, who possibly had been smoking weed outside her residence.\nA window was shattered on a vehicle parked in the 1200 block of 19th Avenue North.\nDISTURBANCE\nA man in the 1300 block of North Federal Highway complained that his house guest, who moved in during the recent hurricane, refused to leave. He told deputies the two are having issues and he wanted her removed. The man said he has known his house guest for three years. Deputies explained to the man that since his guest had established residency at the home, he would have to go to court to have her removed. The woman told deputies that she is trying to find a place to live, as she is afraid of the man and his outbursts. Both agreed that their relationship is platonic, and they have never dated. They were advised to come to an amicable solution.\nLANTANA POLICE\nVEHICLE THEFT\nA woman left her mother’s vehicle running when she went into a gas station in the 1400 block of Hypoluxo Road to make a purchase. Five minutes later she came out to find the 2011 Chevy Camaro gone. An officer reviewed surveillance video, which showed a man entering the vehicle and driving off.\nVEHICLE BURGLARY\nCash, a driver’s license, Social Security card and bank check were taken from an unlocked vehicle in the 1300 block of West Mango Street.\nWhile a woman loaded groceries into her vehicle in the 1400 block of South Dixie Highway, her purse was stolen from the front passenger seat. She told police she saw two men parked next to her. The pair got out of their vehicle, walked around her car, then left quickly. Contents of the purse included $2,000, a debit card, a cellphone and a driver’s license.\nHOME BURGLARY\nGold jewelry was stolen from a home in the 800 block of Minnesota Street. The burglar entered the residence by breaking a window on the back door. Another home on the block was the target of a burglar, who broke a bedroom window and a window on the back door. Nothing appeared disturbed in that home.\nWhile a husband and wife were out of town, someone entered their home in the 1000 block of West Pine Street and stole an iPad and laptop computer. The couple’s personal papers were disturbed, leading the woman to suspect her daughter was the culprit.\nSHERIFF’S OFFICE, ROYAL PALM BEACH\nA woman set down her keys while loading an item into her vehicle at a garage sale in the 100 block of Meander Circle. Someone stole the keys.\nA man involved in a traffic accident in the 700 block of Royal Palm Beach Boulevard went to the tow yard later to pick up his belongings and found his wallet missing. Contents included several credit cards and a driver’s license.\nTwo women went into a costume store in the 10400 block of Southern Boulevard. One of the women picked up a “Chucky” doll and a Seed of Chucky costume, then walked out the door without paying for the items. The total value of the merchandise was $119.98.\nSUSPICIOUS PERSON\nA young male was seen with what appeared to be a gun while sitting in a vehicle outside a store in the 10200 block of Okeechobee Boulevard. Surveillance video helped identify the male’s companions to deputies, who arrived at the scene after they had left.\nCRIMINAL MISCHIEF\nSomeone dented and scratched a vehicle parked at a business in the 1100 block of Royal Palm Beach Boulevard. The victim told a deputy she has had problems with the daughter of her ex-boss. She said following the incident, she received a text message from the daughter, who wrote, “LOL.” A deputy contacted the suspect, who began cussing at him and hung up the phone. The deputy then spoke to the victim’s ex-boss and advised him to have his daughter cease and desist. Five minutes later, the mother of the suspect called the deputy and began yelling that she was going to talk to her friends at PBSO.\nSHERIFF’S OFFICE, WELLINGTON\nSHOPLIFTING/TRUANCY\nA high school student was caught shoplifting at a store in the 10300 block of Forest Hill Boulevard. The loss prevention officer told a deputy the store would not prosecute, but asked that the student be given a trespass warning from the premises. Because she was truant, she was transported to her high school.\nThe manager of an establishment in the 2300 block of South State Road 7 asked that one of his regular customers be trespassed from the premises, as the man was drunk and causing a disturbance. The manager kept the man’s car keys and told him to return the following day to get them. He told the man he was banned permanently from the restaurant.\nA man who tried to steal headphones from a store in the 10300 block of Forest Hill Boulevard was given a trespass warning from the premises.\nCRIMINAL MISCHIEF\nA metal fence was damaged on a property in the 2600 block of Sawyer Terrace.\nA woman and her boyfriend were arguing in the 1200 block of Canyon Way. At one point, he took her cellphone and threw it against the door of her car, causing a dent. She decided not to pursue charges against him.\nAn unlocked bike was stolen from a home in the 500 block of East Rambling Drive.\nA man paid for $5 worth of candy with a $100 bill at a store in the 10300 block of Forest Hill Boulevard. After he received his $95 in change, he grabbed the $100 and ran out of the store.\nVEHICLE THEFT\nA woman’s dirt bike, left in the back of a pickup parked in the 1900 block of Oak Berry Circle, was stolen.\nSHERIFF’S OFFICE, LOXAHATCHEE/ACREAGE\nSUSPICIOUS INCIDENT\nA man who claimed he had been stung by a bee while sleeping in the back of a pickup in the 11800 block of Seminole Pratt Whitney Road eventually admitted to a deputy that he had shot himself accidentally. He refused to provide more information, for fear of being charged as a felon in possession of a firearm. He was seeking medical treatment for the wound, which he believed was infected.\nCRIMINAL MISCHIEF\nA man in the 16700 block of Hamlin Boulevard reported damage to a concrete culvert on his property.\nWhen a woman in the 12500 block of 77th Place North complained that she had bees in her attic, a friend tried to smoke them out by setting paper on fire. The burning paper caused a fire in the attic insulation. The fire department was able to put out the fire, but the bees remained.\nSHERIFF’S OFFICE, GREENACRES\nOPEN CONTAINER\nA deputy on patrol arrested a North Carolina man who was drinking beer outside a gas station in the 6700 block of Lake Worth Road. The man was given a notice to appear in court, then released.\nA woman reported losing an envelope containing $520 at a business in the 2900 block of South Jog Road. The woman told a deputy she had contacted the business and was told by an employee that she gave the envelope to another client who claimed it was hers. The deputy spoke to the client who allegedly took the envelope, and she told him she was never handed an envelope by the employee.\nA woman left her iPhone on the checkout counter at a store in the 6200 block of Forest Hill Boulevard. When she returned to retrieve it, the phone was gone. A review of surveillance video showed another woman picking up the phone and placing it into her purse before heading out the door."}