{"uri": "http://www.whio.com/news/crime--law/man-killed-during-dozens-shots-fired-has-been/RRi79vlYnOSmwQsUpkrIwN/", "title": "Fatal shooting suspect arraigned in court", "dct": "Tue, 25 Oct 2016 00:00:00 GMT", "id": "cc2ceb98dcb724fca3d76215bf554145", "content": "UPDATE @ 11:24 a.m. (Nov. 8)\nOne of two suspects in the deadly Oct. 25 shooting on Riverside Drive appeared for an arraignment today in Montgomery County Common Pleas Court.\nThe court entered a plea of not guilty on behalf of 29-year-old Curtis McShann, who is being held in the Montgomery County Jail. Bond was set for him at $1 million.\nUPDATE @ 4 p.m. (Nov. 4):\nOne of two suspects in a shooting last month that wounded three and killed one was indicted today.\nCurtis M. McShann, 29, is charged with four counts of murder; five counts of aggravated robbery; four counts of felonious assault; three counts of having weapons under disability for prior offense of violence; and once count each of aggravated burglary; discharge of firearm on or near prohibited premises; improper discharge of a firearm at or into a habitation; and one count of having weapons under disability, according to a Montgomery County grand jury report released today. All counts include three-year firearm specifications, except for the weapons charges.\nMcShann is being held on $1 million bond and will be arraigned Tuesday\nAccording to prosecutors and police, McShann around 10:45 p.m. Oct. 25 was involved in a shooting in the 3300 block of Riverside Drive. Brandon Lanier, 27, was killed, and three others were shot and taken to a local hospital. McShann and 22-year-old Jamarko E. Walker Jr. were later arrested.\nUPDATE @ 4:43 p.m. (Oct. 28): The Montgomery County Prosecutor’s Office has approved some charges against Jarmarko Walker Jr. and Curtis McShann – none of which arise from the continuing homicide investigation of this week’s Ryburn Avenue shooting.\nPolice investigators and a prosecutor’s panel will meet sometime next week, said Greg Flannagan, spokesman for Prosecutor Mat Heck Jr.’s office.\nThe charges for Walker are single counts of aggravated robbery with a deadly weapon and weapons possession as a felon. He has a 2014 drug conviction.\nThe charges for McShann are one count of aggravated robbery with a deadly weapon and two counts of weapon possession as a felon. His prior convictions involved a drug offense in 2008 and an offense involving violence, also in 2008.\nUPDATE @ 9 p.m. (Oct. 26):\nA 27-year-old Dayton man died Tuesday night in a shooting involving dozens of rounds that resulted in three other people being taken to a hospital. It was the city’s 31st homicide of the year.\n“Earlier this afternoon, Dayton police homicide detectives arrested two individuals. Right now they are being charged with aggravated robbery; they are persons of interest in the homicide which occurred on Ryburn Avenue last evening,” Dayton police Lt. Mark Ponichtera said. “Charges will be presented to the Montgomery County prosecutor for full review in connection to this homicide.”\nThe robbery charges stem from an incident that happened before the shooting, the lieutenant said, but it’s not clear whether it is connected to the shooting that killed Brandon Lanier and sent three others to local hospitals for treatment. Ponichtera said three of the people shot were visitors to a home, and that when they emerged the shooting began.\nAbout 50 rounds were fired, but the lieutenant would not release details on how many different calibers or guns were believed to be involved.\nUPDATE @ 5:30 p.m. (Oct. 26):\nTwo men were arrested on aggravated robbery charges today, whom police confirmed were also persons of interest in the fatal shooting Tuesday night on Ryburn Avenue.\nDayton police identified the suspects as Curtis McShann, 29, and Jemarko Walker Jr., 22, who were both booked into the Montgomery County Jail this afternoon.\nUPDATE @ 12:22 p.m. (Oct. 26):\nThe Montgomery County Coroner’s office has identified the deceased shooting victim as Brandon Lanier, 27, of Dayton. An autopsy showed Lanier died from a gunshot wound to the chest.\nThree other shooting victims were treated at Good Samaritan hospital. One remains in critical condition.\nLanier was jailed September 18, 2016 on a drug possession charge. Police have not said the shooting was drug-related.\nFIRST REPORT (Oct. 25)\nDayton police said one man is dead and three other people were shot on Ryburn Avenue late Tuesday night.\nOfficers were dispatched to the 400 block of Ryburn Avenue around 11:45 p.m. on reports of a shooting.\nDayton Police Lt. Mark Ponichtera said when officers arrived on scene, one person, only identified as a black man in his middle to late 20s, was found shot and was pronounced dead at the scene.\nPonichtera said while police were investigating the scene, three additional shooting victims were dropped off by a private vehicle at Good Samaritan Hospital.\nOne of the additional victim has life-threatening injuries, while the other two have non-life threatening injuries.\nInvestigators said upwards of 50 rounds were shot, but police did not release how many different type of calibers were found. Ponichtera added the incident is not being called a gunfight yet and police are unsure on what led up to the incident.\nTwo people were being interviewed at the scene by investigators, but police were also unsure of their roles, if any, in the shooting. Police were also in the process of asking neighbors if they witnessed the incident.\nPonichtera said a four-door Chevrolet Impala is believed to have fled during the shooting and is still unaccounted for. The car is described as having bullet holes and is either black with silver doors, or a silver with black doors, as investigators have received conflicting reports on the car’s colors.\nAnyone with information on the incident is urged to contact Dayton police."}