{"uri": "http://www.thestate.com/2014/07/29/3590737/feds-accuse-convicted-felon-of.html", "title": "EXCLUSIVE: Feds accuse convicted felon of possessing gun that killed 7-year-old Gaston girl", "dct": "Tue, 29 Jul 2014 23:13:00 GMT", "id": "50f9e94dcf6e30c3100ed5ee2ef7b48d", "content": "A Midlands man has been indicted by a federal grand jury in connection with possessing a firearm involved in the April shooting death of a 7-year-old Gaston girl at a birthday party.\nWarren McDaniel, 27, is charged with two counts of being a convicted felon in possession of a firearm, according to a federal indictment. His trial is scheduled in federal court in Columbia in early September.\nMcDaniel was not charged in the death of Juliet Noell Lynch, an honor roll student at Congaree-Wood Early Childhood Center. But federal investigators are charging that he owned or possessed the loaded rifle with which another child accidentally shot and killed Juliet. Another child at the party was struck and wounded by a bullet fragment. That child’s wounds were not life-threatening.\nThe gun possessed by McDaniel that is now linked to Juliet’s death is a high-powered Hungarian FEG assault rifle with a folding stock, according to the federal indictment.\nA SLED records check showed McDaniel was a convicted felon at the time of the shooting, having been found guilty of various state drug and gun charges. McDaniel served time in state prison from February 2007 to July 2009 for illegal possession of a weapon in Richland County, according to the S.C. Department of Corrections.\nUnder federal law, it is illegal for a convicted felon to possess a firearm. A person convicted of being a felon in possession of a weapon can be sentenced for up to 10 years.\nJuliet’s shooting death attracted state and national publicity as yet another example of an innocent child needlessly killed by a gun.\nOn April 12, at a birthday party in Gaston for a friend, a 5-year-old boy was trying to get a gun that he thought was a toy out of a car trunk.\nBut according to then-Lexington County Sheriff James Metts, the boy mistakenly picked up a real gun in the car trunk. The gun went off and the bullet ripped through the car, with fragments striking Juliet in the chest. She died soon after.\nMetts said at the time the gun belonged to the boyfriend of the boy's mother, and she did not know it was in the trunk. Metts did not identify the boy, his mother or the boyfriend.\nOnce federal authorities became involved in the case, they asked the Lexington County Sheriff’s Department not to make any more public statements.\nThe Sheriff’s Department, which brought no charges in the case, has refused to make public its incident report on the shooting. It issued this statement to The State: “Our agency turned over the investigation to the federal Bureau of Alcohol, Tobacco, Firearms and Explosives, and the U.S. Attorney’s Office in Columbia requested that our agency not release any information concerning the shooting death, since it was the subject of a federal investigation.”\nMetts has since been indicted on various federal bribery charges and has been suspended from office.\nIronically, on July 1, Metts was in the same federal courtroom for his arraignment on bribery charges before U.S. Magistrate Judge Shiva Hodges at the same time McDaniel was arraigned on federal gun possession charges.\nHodges set a $100,000 unsecured bond for Metts and a $25,000 unsecured bond for McDaniel.\nDuring the hearing, federal prosecutors did not link Juliet’s shooting death to the charges against McDaniel. Later that day, the U.S. Attorney’s Office issued a news release saying McDaniel’s indictment stemmed from an April shooting in Gaston but giving no further details.\n“We have a firm commitment to prosecute felons who have otherwise legal guns,” said U.S. Attorney Bill Nettles, who declined further comment on McDaniel’s case.\nEfforts to reach Allen Burnside, a public defender representing McDaniel, were unsuccessful."}