{"uri": "http://koin.com/2016/08/10/documents-giddings-used-woman-as-shield-or-hostage/", "title": "Documents: Giddings used woman ‘as shield or hostage’", "dct": "Wed, 10 Aug 2016 16:27:00 GMT", "id": "47029e94a05714d0d2d05fac84fadfff", "content": "OREGON CITY, Ore. (KOIN) – Jeffrey Giddings, the man accused of trying to kill 2 law enforcement officers and taking a woman hostage at a Gladstone Subway, was officially charged with 6 major crimes on Wednesday.\nProsecutors in Clackamas County charged the 45-year-old Giddings with 2 counts of attempted aggravated murder and one count each of first-degree kidnapping, unlawful use of a weapon, first-degree criminal mischief and being a felon in possession of a firearm.\nOn Monday, the Gladstone Police Department confirmed Giddings shot Sgt. Lee Jundt after an attempted traffic stop. One of the attempted aggravated murder charges is for that specific shooting.\nNew court documents filed Wednesday revealed Giddings also attempted to kill Clackamas County Sheriff’s Deputy Benjamin Frazier.\nIt remains unknown if Giddings fired multiple times while fleeing into a Subway restaurant where he took a woman hostage and kept law enforcement at bay for more than an hour.\nCourt documents also say Giddings used the woman “as a shield or hostage” and that he caused damage to a patrol vehicle, telephones, and other property of Subway, the Gladstone Police Department and the hostage’s.\nThe federal Bureau of Prisons’ confirmed Giddings had absconded from a regional facility that helps transition inmates back into society following the incarceration. Giddings had been held in federal prison after he plead guilty to being a felon in possession of a firearm.\nProsecutors fought in U.S. District Court to have Giddings classified as an “armed career criminal.”\nA preliminary hearing in the shooting case is scheduled for Aug. 17. Giddings remains in custody at the Clackamas County Jail.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}