{"uri": "http://www.heraldonline.com/news/local/crime/article74429742.html", "title": "Prosecutors: Friend firing in self-defense killed buddy in Rock Hill shoot-out", "dct": "Thu, 28 Apr 2016 13:12:00 GMT", "id": "783103d6ef23de02784fe1371da9dec1", "content": "The fatal shot in a March 4 shootout in Rock Hill was fired in self-defense by the friend of the dead man after the car both men were in was riddled by gunfire, prosecutors say.\nJarrius Harding, 18, was killed in the midday shootout near the intersection of Black Street and Keels Avenue east of downtown Rock Hill. The shoot-out culminated a wild, 24-hour spree of gunfire in four incidents in the city.\nQuintonio Porter, 23, who was in the car with Harding, also was shot and later was charged with attempted murder in the shootout with men in another car. But after an investigation, police and prosecutors determined that Porter was firing in self-defense when he shot Harding, said Willy Thompson, 16th Circuit deputy solicitor. They dropped the attempted murder charge against Porter.\nThere was “dispute with bad blood” between two factions, Thompson said in court late Wednesday. Harding, Porter and another man were in the car when gunmen in another vehicle began firing at them, Thompson said. Porter, pulled a gun but got entangled in his seat belt, and in attempting to fire back at the other car, accidentally shot Harding in the head as Harding ducked in the back seat, Thompson said.\n“It was actually his bullet that killed his friend, but he was shooting at someone else,” Thompson said in court of Porter’s gunshots.\nPorter’s lawyer, Robert Bruce, said in court that Porter is thankful police and prosecutors agree Porter was acting in self-defense but did not concede that Porter fired the fatal shot, saying he is waiting for more ballistics tests to come back.\nPorter, who has previous convictions for guns and drug violations, still faces cocaine possession and weapons charges. After the shooting, police found cocaine and the weapon. Prosecutors are still concerned with Porter’s “dangerous nature,” as he was barred by law because of previous convictions from possessing a gun.\nPorter, who had been in jail since two days after the March 4 shooting, was released on bond late Wednesday after prosecutors dropped the attempted murder charge.\nKeenan Jamal Miller, 20, of Rock Hill, who was on probation at the time for other crimes, was charged in late March with three counts of attempted murder and weapons charges from the shootout and is being held at the York County jail.\nAndrew Dys: 803-329-4065, @AndrewDysHerald"}