{"uri": "http://abc13.com/news/victims-in-kansas-workplace-shooting-identified/1219757/", "title": "Victims in Kansas Workplace Shooting Identified", "dct": "Fri, 26 Feb 2016 00:00:00 GMT", "id": "19fb38a63243a9ef15a17497f871a9a0", "content": "The three people killed in a Kansas workplace shooting Thursday were identified Friday afternoon as officials revealed that the suspect had been served a restraining order in the hours before the shooting.\nThe attack at Excel Industries in Hesston -- the suspect's workplace -- was the last in a series of three shootings by the alleged gunman, Cedric Larry Ford.\nFord, 38, a Newton resident, who allegedly killed three people -- Renee Benjamin, 30; Joshua Higbee, 31; and Brian Sadowsky, 44 -- and injured 14 others Thursday before police killed him, had been served shortly before with a restraining order meant to keep him away from a former girlfriend, Harvey County Sheriff T. Walton said.\nThe temporary order of protection was served at Excel Industries about 90 minutes before the first shooting, about 3:30 p.m.\nIn the order, the woman, whose name is not being published by ABC News, wrote that she and Ford were living together but broke up. He was moving out.\nShe wrote that on Feb. 5, she and Ford \"were verbally fighting\" when \"it became physical by him pushing me and then grabbing me.\"\n\"He placed me in a chokehold from behind,\" she wrote, saying that she couldn't breathe. \"He then got me to ground while choking me-finally releasing me.\"\nThe woman describes Ford as an \"alcoholic,\" \"violent\" and \"depressed,\" according to the order of protection from abuse.\n\"It's normal when someone gets served a protection of abuse order\" to be upset, Walton said this morning, explaining that Ford's behavior wasn't abnormal when he was served.\nThe Harvey County Sheriff's Office said today that Ford had a history of domestic violence and that he was arrested in Newton in Nov. 2008 for felony battery and disorderly conduct.\nFord was also arrested in July 2010 for DUI and obstruction, the sheriff's office said. The results of those cases were not immediately clear.\nWalton told ABC News that investigators still have many interviews to conduct but, at this point, the motive was \"most likely domestic violence.\"\nFord died in a gun battle when a police officer shot him despite taking fire. Walton said today Ford would have kept shooting if a police officer had not stopped him.\nBefore the deadly shooting at Excel Industries, a plant which manufactures heavy-duty lawn care equipment, Ford also allegedly fired shot in two other areas, authorities said. The three shootings covered a range of about 6 miles and lasted a span of about 24 minutes, Walton said today.\nWalton said the carnage began about 5 p.m. when the gunman opened fire from his vehicle in a location nearby Excel.\nHe hit two vehicles, injuring one person. After that, he went to another location near Highway 81, where he shot a person in the leg, authorities said.\nFrom there, he took the victim's car and drove to the plant, where he opened fire before being killed by police. Authorities said Ford had an assault rifle and a pistol.\nFourteen people were hospitalized.\nInvestigators are unclear on the shooter's motive, but Walton said it was \"not terrorism.\" But he did say there were \"some things that triggered this particular individual.\"\n\"I'm really saddened by this horrific event,\" Excel CEO Paul Mullet said. \"My heart goes out to all of the employees, all of their families.\"\nMullet said today the company is fully cooperating with the investigation.\nABC News' Clayton Sandell contributed to this report.\nGet real-time updates as this story unfolds. To start, just \"star\" this story in ABC News' phone app. Download ABC News for iPhone here or ABC News for Android here."}