{"uri": "http://www.kmbc.com/news/mass-shooting-reported-at-central-kansas-workplace/38198462", "title": "Sheriff: 4 dead, 14 injured in Kansas shootings", "dct": "Fri, 26 Feb 2016 13:07:00 GMT", "id": "9722ee3716ed3d2794ebe1ac1ca12c36", "content": "HESSTON, Kan. —\nOfficials said four people are dead, including the gunman, and 14 people are injured, 10 critically, after a series of attacks in south-central Kansas.\nSheriff T. Walton said at a news conference Thursday evening there are \"a number of crime scenes involved,\" including the Excel Industries plant in Hesston, north of Wichita, where 15 people were shot.\nThe suspect was fatally shot by authorities during an exchange of gunfire.\nThe sheriff said a shooting also took place in the plant parking lot and two other locations nearby.\nKMBC has confirmed with law enforcement authorities that the suspect is Cedric Ford, a 38-year-old employee of the Excel plant. Images on his Facebook page showed him posing with and shooting guns.\nPolice said officers have surrounded Ford's home in Newton, Kansas. They believe Ford's roommate may be inside. Loud music was heard blaring from the home but no one answered the door.\nA hospital in Newton was on lockdown Thursday evening, something a spokeswoman said was done as a precaution because of all the police activity in the area.\nMartin Espinoza, who works at Excel, was in the plant during the shooting. He heard people yelling to others to get out of the building, then heard popping, then saw the shooter, a co-worker he described as typically pretty calm.\nEspinoza told The Associated Press the shooter pointed a gun at him and pulled the trigger, but the gun was empty. At that point, the shooter got a different gun and Martin took off running.\n\"I looked right at him and he looked right at me,\" Espinoza said.\nHesston is a community of about 3,700 residents about 35 miles north of Wichita. Excel Industries was awarded the Governor's Exporter of the Year award in 2013 from the Kansas Department of Commerce. The company manufactures Hustler and Big Dog mowing equipment and was founded in Hesston in 1960.\n“We’re really saddened by this horrific event and our heart goes out to all of our employees, all the families whose loved ones got injured or killed, and we’re going to do what we can to take care of them and bring them through this tragedy,” said Excel president and CEO Paul Mullet.\nGov. Sam Brownback ordered flags across Kansas lowered to half staff Friday in memory of the victims.\n\"I ask all Kansans to offer their prayers for the victims and families of today's shooting in Hesston,\" he said. \"This is a tragedy that affects every member of the community and I ask that Kansans remember them in their thoughts. State law enforcement agencies are supporting the local authorities and I will provide any support to help them and the entire community in the days and weeks to come.\"\n11833402"}