{"uri": "http://ksn.com/2016/02/25/officials-four-dead-14-wounded-in-shooting-at-excel-industries-in-hesston/", "title": "Officials: Four dead, 14 wounded in shooting at Excel Industries in Hesston", "dct": "Thu, 25 Feb 2016 17:15:00 GMT", "id": "cff902b1cceb3e844e2e2707222f336f", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nHESSTON, Kansas – Law enforcement officers responded to the scene of a workplace shooting at Excel Industries in Hesston Thursday afternoon with reports of multiple fatalities and people wounded. The incident began about 4:40 p.m.\nHarvey County Sheriff T. Walton confirmed at a 9 p.m. news conference that four people were dead, including the shooter identified Friday as Cedric Ford, and 14 others were wounded. Ford was an Excel employee.\nVIDEO | Harvey County Sheriff 9 p.m. press conference\nOfficials say area hospitals received 12 victims. Six victims were transported to Via Christi Hospital. Two victims are in critical condition and four victims are stable. Four victims were transported to Wesley Hospital. Officials say three are critical and one is in surgery. Newton Medical Center received four patients. All are in stable condition.\nPHOTOS | Shooting at Excel Industries in Hesston\nSheriff T. Walton said the shooting started in Newton at 12th and Meridian. Two people were shot while driving their vehicles. One person was hurt. The other person wasn’t. Walton says the shooter continued north on Highway 81 where he shot another person in the leg after stealing a vehicle.\n“There was a report of a stolen vehicle. That vehicle was the person that got shot. The shooter went on into Excel Industries. Once he got to Excel Industries, he shot a person in the parking lot, and he entered into the building itself,” said Sheriff T. Walton. “Inside the building he shot a total of 15 people. Four were killed including himself, the shooter.”\nWalton said about 150 people were likely in the plant at the time of the shooting, and that the law enforcement officer who killed the suspect “saved multiple, multiple lives.” He said the gunman had an assault weapon and a pistol.\nThe officer who killed the man is “a hero as far as I’m concerned,” Walton said.\nThe incident lasted approximately 26 minutes from start to finish. Walton said the FBI and the Kansas Bureau of Investigation had been called in to assist.\n“We have a team of KBI coming in. I have the FBI coming in. We’ve got all the local law enforcement here, and this will take some time to work through this,” said Walton.\nAfter the incident, Walton said officers had identified a house where the suspect lived. He said when officers attempted to enter the residence to conduct a search they were turned away.\nAfter a delay in securing a warrant to search the residence, officers discovered after 10 p.m. the residence the person who had turned them away apparently had left. Officers then entered the residence to conduct their search.\nOfficials are now working to identify all victims and notify their families.\n“We want to get the people who are so concerned that their loved ones have been shot or hurt. We want to get everybody identified, and we’re working on that. We’ll get that information out as soon as we can. I understand how hard it is for everybody else,” added Walton. “This is just a horrible incident. … There’s going to be a lot of sad people before this is all over.”\nHesston is a community of about 3,700 residents about 35 miles north of Wichita. Excel Industries was founded in Hesston in 1960. The company manufactures Hustler and Big Dog mowing equipment and was awarded the Governor’s Exporter of the Year award in 2013 from the Kansas Department of Commerce.\nWe was, we were out back unloading pallets we heard a pop, pop and we thought it was metal falling on the ground. Then the doors opened, people started screaming, coming out. Saying go to the front, go to the front, and then everyone turned around saying no he’s out front and everyone started going to the back right over here. Then me my boss and the other employee we work with was just standing back there. We really just didn’t know what was going on, and then everyone said there were gun shots and a shooter. We just kept hearing pop, pop, pop, and then this gentleman, I guess his name is Adam got shot.. I walked over and tried to help him as much as I could. He got shot twice in the chest, once in the arm, once in the leg. And I was just trying to help out the best I can. I mean I don’t even work for Excel/ I work for a different gentleman. We come up to Excel to pick up pallets and what not. I just wanted to help out the best I could and do what I could for him.”\n-Dylan, Eyewitness\nWhen I made it to the back parking lot, got to my truck and I was just panicking, crying, shaking, trying to get out of there because I didn’t know if he was going to come after me, or if there was more than one or what. I didn’t know. I didn’t know anything.”\n-Donna, Eyewitness\nI’ve seen a bunch of people running. They were yelling fire and we just took off running. Everybody was coming outside. There were gunshots, and this one guy got shot in the leg and he was walking. One of the Apexes got shot four times. Four other people I know got shot. It’s horrible. I had no idea what to do. We were hopping fences. Everybody was running, screaming. People were crying. We just didn’t know what to do. They started off by saying fire. We heard the gunshots and it wasn’t a fire.”\n-Jordan, Eyewitness\nPHOTO GALLERY\nMAP OF MULTIPLE CRIME SCENES\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}