{"uri": "http://abc13.com/news/suspect-charged-after-8-people-found-dead-in-nw-harris-co-home/914922/", "title": "Victims in mass killing in northwest Harris County identified", "dct": "Mon, 10 Aug 2015 00:00:00 GMT", "id": "3ec89e7ebbdae32d451b424fdb5e72ed", "content": "HOUSTON (KTRK) --\nNew information was provided by the Harris County Sheriff's Office following the deaths of 8 people found inside a northwest Harris County home early Sunday morning.\nDavid Conley, 48, is in custody, charged with capital murder following the deaths of 2 adults and 6 children. The deceased are Dwayne Jackson, 50, and Valerie Jackson, 40, and six children -- Nathaniel, 13; Honesty, 11; Dwayne, Jr., 10; Caleb, 9; Trinity, 7; and Jonah, 6. The victims were found in each of the three bedrooms inside the house.\nDetectives say the motive appears to be a dispute with Valerie Jackson, with whom Conley had a previous relationship. They say say one or two of the children may be Conley's.\nPHOTOS: Scene where 6 children and 2 adults were found dead\nAccording to the Associated Press, in the arrest affidavit, Conley said he had discovered on Saturday morning that the locks had been changed at the house on Falling Oaks at Veterans Memorial after he'd moved out. He then entered the home through an unlocked window and restrained with handcuffs, shot and killed the eight people.\nIn 2000, he was arrested for retaliation, accused of putting a knife to his then-girlfriend, threatening to kill her, her baby and himself. That came after she filed an assault charge against him for cutting her with a knife and punching her in the face. He was sentenced to five years in prison for retaliation.\nA welfare check had come in from a relative of one of the victims at around 9:30pm. Deputies arrived and tried unsuccessfully to get someone to answer the door.\n\"After several repeated times to get someone to come in the door, more information was obtained that a male was inside the home who had a warrant for aggravated assault of a family member,\" said Deputy Thomas Gilliland with the Harris County Sheriff's Office.\nBecause of the the suspect's warrant, the sergeant on scene called for a high-risk operations unit. With the home surrounded, deputies looked through a window and noticed what appeared to be a juvenile dead on the floor. That's when they forced their way inside.\n\"It seemed like a movie,\" said one neighbor. \"I couldn't even believe it myself. I've never been in a situation like this. Like I said, I was just hanging out with my girlfriend, having a good time with her family.\"\nOnce inside, deputies say Conley fired at them. They retreated and a standoff followed that lasted until around 12:30am, when a negotiator was able to talk Conley out of the house.\nDetectives said that there was not an active restraining order against Conley.\nConley, who has prior convictions for aggravated robbery, evading arrest and drug charges, is being held without bond.\nCourt records show Conley's criminal history dates back to at least 1988, with the most recent incident last month, when he was charged with assault of a family member. In court documents, authorities say Conley had been arrested for allegedly assaulting the woman he was living with at the home where the bodies were found. Documents say he was in a dating relationship with the woman. It was not immediately clear if the woman in the previous incidents was Valerie Jackson.\nThe victim's brother has set up a Go Fundme page to help pay for the funeral services.\nThe Associated Press contributed to this report."}