{"uri": "http://www.chron.com/news/houston-texas/houston/article/Reports-Five-children-three-adults-shot-dead-in-6433574.php", "title": "Suspect charged with capital murder in death of 6 children, 2 adults", "dct": "Mon, 10 Aug 2015 00:00:00 GMT", "id": "aba65e69e47f02bb75c3deaaffb90868", "content": "Earl Yanske heard early Saturday morning that his sister's ex-boyfriend was at her house, armed and angry.\nRelatives called the Harris County's Sheriff's Office, asking them to go by the house in northwest Harris County to see if she was OK.\nHours passed.\nSick with worry and stuck in Montana, Yanske dialed David Ray Conley's cell phone number. He didn't pick up. His sister, Valerie Jackson, had two children with Conley, but feared him. She'd taken him back over the years, even after telling police he'd cut her and wrapping an electrical cord around her baby's neck. She'd changed the locks in July, after telling deputies he went after her 10-year-old with a belt.\nAround 11 p.m., Yanske's cell phone rang. It was Conley.\n\"I need to ask you a question,\" Yanske said. \"Did you kill my sister?\"\nConley's voice was flat.\n\"He said, 'Yes I did.' It was like me asking if he went to the grocery store and he said, 'Yeah.' There was totally no emotion in his voice.\"\nConley, 48, surrendered to sheriff's deputies late Saturday night after a standoff outside the three-bedroom house on Falling Oaks. Authorities said he had broken in through a window, armed and with handcuffs, and methodically shot Valerie Jackson, her husband and six children, including his own son, one by one in the head. All eight died in the house.\nGiven the couple's history, Yanske said \"they should have kicked down that door instantly. \"\nChief Deputy Tim Cannon said deputies went to the house three times Saturday, starting in the morning. Nothing was amiss. They came back in the afternoon. \"They did not have enough information at that time to make a forced entry,\" he said.\nOn the last check around9 p.m., they spotted a body through a window. Three officers and a sergeant tried to go inside, but Conley allegedly shot at them.\nConley was charged Sunday with multiple counts of capital murder and held without bail. Authorities identified the dead as Jonah Jackson, 6; Trinity Jackson, 7; Caleb Jackson, 9; Dwayne Jackson Jr., 10; Honesty Jackson, 11; Nathaniel Conley, 13; and Dwayne Jackson, 50.\nFamily had CPS involvement\nTexas Department of Family and Protective Services spokesman Patrick Crimmins said a preliminary review found the family had \"previous CPS involvement.\" He said officials had started to \"evaluate any prior contacts with the family to ensure they were handled appropriately.\"\nDalila Mercado, who has lived in the neighborhood for six years, said the children often ran around outside unsupervised, the toddlers without diapers.\nOn Sunday, detectives were still trying to determine if Valerie Jackson, 40, had ever officially married Dwayne Jackson or Conley, and piece together their long and at times violent history.\nConley, short and stocky, met Valerie online at least 15 years ago, relatives and friends said. By then, he already had a rap sheet that included auto theft, cocaine possession and evading arrest, court records show.\nA few weeks before Christmas in 2000, Valerie told police Conley shoved her onto a bed at her Houston apartment and straddled her with a knife to her throat. Conley said he was not going back to prison because of her, a Houston police officer wrote in his report. Conley cut her neck and punched her in the face, she told police, and then wrapped a cord about the baby's neck. He was sentenced to five years in prison, records show.\nValerie went back and forth between Conley and Jackson, a longtime family friend, Yanske said. Her first two children were with Conley, then she had five with Jackson.\nConley was very jealous of Dwayne Jackson, who was always trying to get back together with the mother of his children. At some point, Conley struggled with bipolar disorder, Yanske said.\n\"He'd be in a very happy mood one moment, then the next moment go off,\" Yanske said. \"He was always very controlling and wouldn't let Valerie go out.\"\nAnd he was a strict disciplinarian, Yanske said, sometimes too much so, \"taking it too far with belts.\" Still, his sister would return to Conley time and again. \"She stayed with him because she was scared,\" he said.\nConley was charged with disorderly conduct in Wisconsin in October 2008 and pleaded guilty. Weeks later, a judge there granted a temporary restraining order against Conley. It was dismissed in 2012, after the court received a letter from Valerie asking to drop the injunction, the records show.\n2013 violent incident\nA Harris County judge issued an emergency protective order to keep Conley away from Valerie in April 2013 after he was accused of threatening her with a knife.\nDays after he was sentenced, she posted on Facebook that Conley was \"the best father in the whole world, my baby, my best friend, my forever. You have always put me and our kids ahead of yourself and always take care of home.\"\nThen in May 2014, she posted a card to Facebook, saying, \"Someday you'll meet a man and he'll sweep you off your feet and he'll promise you the world. You just punch that lying bastard as hard as you can and run, baby!\"\nThe breaking point came last month, after her 10-year-old son came home from the park after dark on July 6 and Conley went for the belt. She told deputies that Conley said if she didn't discipline the boy, he would. She said she reached for the belt and he smashed her head against the refrigerator. They issued a warrant for Conley. She changed the locks.\nWhen exactly Conley slipped into the house is unclear. The bodies were found in three bedrooms, authorities said.\nNate, the eldest of the six children killed, was an outgoing sports nut who loved horror movies, Yanske said. Honesty was a mother hen, quiet but compassionate. Dwayne was a skateboarder and a stand-up comic who loved making people laugh. Caleb was a computer geek, smart and intuitive who liked to figure out how things work. Trinity was the princess. Jonah, the baby, was \"the best cuddle bug ever,\" Yanske said. \"He just wanted to curl up and be held.\"\nLauren Caruba contributed to this report"}