{"uri": "http://www.wave3.com/story/33522524/lincoln-co-sheriff-fires-deputy-who-accidentally-shot-daughter", "title": "Lincoln Co. sheriff fires deputy who accidentally shot daughter", "dct": "Mon, 31 Oct 2016 16:22:00 GMT", "id": "b28463c6c803c242ea95444b3479f02e", "content": "LINCOLN COUNTY, NC (WBTV) -\nA Lincoln County deputy who accidentally shot her 11-year-old daughter over the weekend has been terminated, the Lincoln County Sheriff's Office announced Monday.\nMisty Michelle Flowers, 38, was showing her service weapon to friends at her home on Loop Road in Lincolnton Saturday night when the gun accidentally fired through the wall, striking her daughter in the other room, deputies say.\n“I find gross negligence and the disregard for the safety of others was displayed in the incident Saturday night and therefore Officer Flowers was terminated today,\" Sheriff David Carpenter said in a news release. “This is totally separate from the SBI investigation into the incident that occurred at her residence.”\nLincoln deputies said they were called to the home at 11:23 p.m. and started tending to the girl's injury. The child was taken to CHS-Lincoln and then airlifted to Carolinas Medical Center in Charlotte for surgery. According to deputies, she was in stable condition after treatment.\n\"The child is recovering well, and that has been our main concern all along,\" Carpenter said.\nNeighbors say there was a Halloween party going on at the house where this happened.\nCarpenter says this played a part in his decision to fire Flowers as soon as he did.\n\"There's really no need to wait on down the road a week or so. This is something I know, and it's a decision that needed to be made, and by all means it isn't easy,\" Carpenter said.\nFlowers has been with the Lincoln County Sheriff's Office since 2015 and worked for the Catawba County Sheriff's Office before that.\nCarpenter says Flowers was a good deputy, which makes the decision to fire her that much harder.\n\"She performed her duties well. This is just a tragic incident that happened, and has to be dealt with,\" Carpenter said.\nPREVIOUS: Deputies: Lincoln County deputy accidentally shoots 11-year-old daughter\nRELATED: BLOG: Firearm safety in the home\nThe SBI is continuing to investigate and interview witnesses. Anyone with additional information is asked to call the SBI at 704-454-5264.\nCopyright 2016 WBTV. All rights reserved."}