{"uri": "http://www.wsoctv.com/news/local/off-duty-lincoln-co-deputy-accidentally-shoots-11-year-old-daughter/462050735", "title": "Lincoln Co. sheriff fires deputy who accidentally shot daughter", "dct": "Mon, 31 Oct 2016 17:46:00 GMT", "id": "de9d163c0f2483304f88c61e3b89ae2d", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nLINCOLN COUNTY, N.C. - An off-duty Lincoln County deputy was showing her service weapon to people at her house when she accidentally fired the gun, causing a bullet to go through a wall and hit her 11-year-old daughter, officials said.\nMisty Flowers, 38, who works at the Lincoln County courthouse, was at her home Saturday night on Loop Road when the accident happened.\nA 911 call was made immediately after the little girl was shot.\n\"Somebody was playing with a firearm and shot her,\" a caller told 911 dispatch.\nHe told the dispatcher that he didn't see who fired the shot.\n\"Somebody was playing with a firearm & shot her.\" 911 call after former Lincoln Co. deputy Misty Flowers accidentally shoots her daughter. pic.twitter.com/YQwW5ykzWa\n— Ken (@kenlemonWSOC9) October 31, 2016\nClick below to listen to 911 call\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nA deputy arrived to the scene just before 11:30 p.m. and started first aid on Flowers’ daughter.\nA second officer arrived soon after, and the girl was taken to Carolinas Medical Center-Lincoln before being flown to CMC in Charlotte.\nAuthorities told Channel 9 that the girl underwent surgery and was in stable condition.\nThe Lincoln County sheriff fired Flowers on Monday and said she showed gross negligence and disregard for safety.\nFlowers has worked for the Lincoln County Sheriff’s Office since August 2015 and previously worked for the Catawba County Sheriff’s Office.\nThe North Carolina Bureau of Investigation is handling the case.\nSheriff David Carpenter said, “I find gross negligence and the disregard for the safety of others was displayed in the incident Saturday night and therefore Officer Flowers was terminated today. This is totally separate from the SBI investigation into the incident that occurred at her residence.”\nCarpenter went on to say, “During this entire situation my focus has been on the well-being and condition of the child involved and am of the understanding the child is going to be ok after the surgery. This is a very tragic situation for all involved, the officer, her family, her career and everyone that has been touched by this. We continue to pray for healing of the child and the entire family as the investigation continues over the next several days.”\nOfficers are responsible for securing their weapons at home as part of department policy.\nFailing to do so could result in criminal charges.\nThe district attorney will make that call after the SBI investigation is complete.\nRead more top trending stories on wsoctv.com:\n© 2017 Cox Media Group."}