{"uri": "http://www.mysanantonio.com/neighborhood/fortbend/news/article/Fort-Bend-County-shooting-that-left-three-dead-8327730.php", "title": "Fort Bend County shooting that left three dead started with 'family meeting'", "dct": "Mon, 27 Jun 2016 00:00:00 GMT", "id": "5737274d7e823c69e59a7397d584ff27", "content": "The Fort Bend County Sheriff's Office responded to more than a dozen calls for help, including three attempted suicides, in four years at the troubled Katy home where a family meeting Friday erupted into violence that ended with a mother and two daughters fatally wounded in the street.\nBut Fort Bend County Sheriff Troy Nehls said he didn't know if the mental health calls came from Christy Byrd Sheats, 42, a vocal Second Amendment proponent who shot her two daughters before being gunned down by police.\n\"She may be dealing with a mental crisis, but we cannot confirm that Christy suffered from mental issues; the only one who knows that is her husband,\" Nehls said.\n\"It just seems like an argument — a domestic disturbance in a family, that turns into a shooting where a mother went out and shot her two daughters — somebody would say she's got mental health issues because who in her right mind would do that,\" he said.\nThe girls' father, Jason Sheats, 45, was also targeted in the shooting but escaped unharmed down the cul-de-sac. He is cooperating fully with investigators, Nehls said.\n\"That will be our job here, that will be the investigators' focus now for the next coming days, to try and pinpoint the motive,\" he said. \"And if she was suffering from some type of mental illness, what type of outreach, what type of help she was getting.\n\"I think you want to know, did the system fail her? Did we fail her? Did her family fail her? I would want to know. I would want to get to the bottom of it,\" he said.\nREAD MORE: Family argument caused mother to shoot, kill daughters\nInvestigators said Christy Sheats had called a family meeting on Friday, which also happened to be her husband's birthday. An argument ensued, and she lifted a five-shot, .38-caliber handgun and opened fire on Taylor Sheats, 22, and Madison Sheats, 17.\nThe father and both daughters managed to get out of the front door of their Katy-area home. Madison fell and died after leaving the house.\nTaylor ran into the street, where her mother shot her again. A witness said Christy Sheats returned to the home to reload the gun, then came back outside and shot Taylor once more.\nFort Bend County Sheriff's Office officials arrived at the scene in time to see the final shot. They shot the mother after she refused to drop the gun, officials said.\nTaylor Sheats was transported by helicopter to the Texas Medical Center, where she later died.\nREAD MORE: Police identify woman and two daughters she shot dead\nChristy Sheats had posted several times on her Facebook page in support of the Second Amendment and in opposition to gun control efforts.\n\"It would be horribly tragic if my ability to protect myself or my family were to be taken away, but that's exactly what Democrats are determined to do by banning semi-automatic handguns,\" she said in a March Facebook post.\nThe shooting came just days before Taylor Sheats had planned to be married, according to another Facebook post.\nThe young woman was set to marry her boyfriend of four years, Juan Lugo, at a small wedding on Monday, followed later by a larger celebration, the girls' grandmother, Ann Sheats Wooten, posted on Facebook.\n\"They were to be married Monday and later again after graduation from college with a big wedding,\" Wooten posted Sunday evening.\nThe couple may have obtained a marriage license as late as Friday, the day of the shooting. Texas law requires a 72-hour waiting period after the issuance of a marriage license.\nTaylor attended Lone Star College-CyFair and Seven Lakes High School in the Katy Independent School District. Her sister reportedly also attended the school.\nTaylor had kind words to say about her mother in a May 2013 Facebook post on Mother's Day.\n\"You're one of the strongest people I know, if not the strongest, and you have had to overcome so much in your life but you still manage to love us and put your everything into being a mom,\" Taylor said in the post.\nTaylor had also stated in an April Facebook post that she supported the Second Amendment, but posted a meme that questioned the refusal of gun activists to accept any limitations.\n\"Don't punish me because SOME gun owners are nutjobs,\" the meme stated, with a photo of the Sandy Hook Elementary children escaping a gunman with their teachers.\nTaylor had also tried to raise awareness of anxiety and depression among college students on her Facebook page.\n\"As someone who has dealt with anxiety for the overwhelming majority of my life, I want to create a space for students dealing with generalized anxiety, depression, panic attacks, test anxiety, etc.,\" she posted on Facebook in March.\nThe Harris County Medical Examiner's office has not yet completed autopsies of the three, but indicated that Taylor Sheats died at a hospital of gunshot wounds to the head and torso.\nMadison Sheats died of a gunshot on the neck that went into her chest, according to the medical examiner.\nChristy Sheats died from a gunshot wound to the chest."}