{"uri": "http://www.chron.com/neighborhood/fortbend/article/Sheriff-s-Office-media-reports-active-shooter-in-8324118.php", "title": "Police: Family argument caused mother to shoot, kill daughters", "dct": "Mon, 27 Jun 2016 00:00:00 GMT", "id": "8c762fa0ffa3efafff25adf8438ecc3e", "content": "A Fort Bend County woman shot her two adult daughters Friday - killing one of them at the scene - before she was fatally shot by a responding police officer.\nOn Saturday, the Fort Bend County Sheriff's Office identified the mother as Christy Sheats, 42, and her daughters as Taylor Sheats, 22, and Madison Sheats, 17.\nLater, Fulshear police Facebook page reported one daughter was taken by Lifeflight to the Texas Medical Center and also died. It was unclear Saturday afternoon, which of the victims died at the scene and which was airlifted to the hospital.\nThe incident happened about 5 p.m. along the 6000 block of Remson Hollow in an unincorporated section near Fulshear.\nWhen officers arrived to investigate a 911 call of \"shots fired,\" they found two women lying on the street in front of a home in a comfortable, middle class subdivision.\nA Fulshear police officer shot and killed a third woman at the scene who was holding a pistol. Authorities said it was the mother of the two women on the ground.\nOne of the daughters of the suspected assailant was taken by LifeFlight to the Texas Medical Center where she was in critical condition, said Fort Bend County Sheriff Troy Nehls. The Fulshear Police confirmed that the second daughter later died, according to their Facebook page.\nThe motive for the shooting remains under investigation.\n\"It was a family argument that turned into a shooting,\" Nehls said. \"But we're still trying to put the pieces together.\"\nAs crowds of concerned neighbors began approaching, police quickly blocked off the street where the bodies were found.\nAustin Enke said he knew the women slightly and had a couple of classes with at least one of them when they attended Seven Lakes High School.\n\"They were always cheerful and never depressed. You never heard anything bad about them,\" Enke said.\nNehls said he did not know if the shooting actually happened inside the family's home or on the street where the bodies were found.\nSheriff's records show that deputies had been sent to the family home in the past on more than one occasion. \"But as to why we were called here, I don't know,\" Nehls said.\nNehls added he did know if the mother pointed her weapon at the officer or whether she was still pointing it at her daughters when the officer arrived.\nThe sheriff said the father was at home when the shooting occurred. He was not injured but was distraught and taken to be checked out at a local hospital.\n\"He's going through a very difficult time,\" Nehls said.\nAlthough the Fort Bend County Sheriff's Office is leading the investigation, other agencies such as the Fulshear police and the Texas Rangers are involved, Nehls said.\nA Fort Bend County justice of the peace will likely call for an autopsy. If so, the bodies will be taken to Harris County Institute of Forensic Sciences or the Galveston County Medical Examiners Office, Nehls said."}