{"uri": "http://www.dallasnews.com/news/crime/headlines/20130808-dallas-area-man-arrested-in-killings-of-four-women-had-his-record-wiped-clean.ece", "title": "Dallas-area man arrested in killings of four women had his record wiped clean", "dct": "Wed, 28 Aug 2013 00:00:00 GMT", "id": "6d6bb14ad1441586eb9aba7e41d088a6", "content": "A grenade-wielding man who police say shot two mothers and their daughters to death Wednesday had a history of family violence.\nBut his criminal record was wiped clean after he’d graduated from a special program for veterans trying to get their lives back on track, and he may have lied to get into the program.\nErbie Lee Bowser, 44, faces multiple capital murder charges after authorities say he killed his former girlfriend and her teenage daughter in southwest Dallas around 10:30 p.m. and then drove about 7 miles to DeSoto to kill his estranged wife and her daughter,\nToya Smith, 43, and daughter Tasmia Allen, 17, were shot in Smith’s home in the 7100 block of Long Canyon Trail, near West Wheatland Road and Mountain Creek Parkway. Smith’s 14-year-old son, Storm Malone, and a 17-year-old family friend, Dasmine Mitchell, were shot. Both remain hospitalized. Dasmine underwent surgery and remains in critical condition.\nBowser then went to the home of his 47-year-old estranged wife in the 100 block of Galleria Drive in DeSoto, busted down the back door, and tossed in a hand grenade, authorities said. The explosion “blew out the walls and a couple of windows,” said Cpl. Melissa Franks, a DeSoto police spokeswoman, but no one was hurt by the blast.\nPolice said Bowser then entered the home and shot to death Zina Bowser and her daughter, Neima Williams, 28.\nZina Bowser’s two young boys were also wounded by gunfire before the gunman apparently ran out of bullets. Her 13-year-old son was able to call police.\nConstance McKinney, who is the cousin and neighbor of Zina Bowser’s mother, said that the children, 10-year-old Myles and 13-year-old Chris, underwent surgery.\n“They’re doing as well as could be expected in their condition,” McKinney said.\nWilliams’ 3-year-old was also at the home but was unharmed.\nWhen police arrived at the home on Galleria, Erbie Bowser pretended to be a victim. He seemed catatonic, only giving his name, military rank and serial number, police said.\nBut police identified Bowser as their suspect and took him into custody. Officers confiscated a pocketknife from him.\nVeterans program\nBowser had a history of domestic violence, but it isn’t in his criminal record because he completed the Dallas County court program for veterans in the summer of 2012.\nBowser entered the Veterans Court after attacking Zina Bowser at the home on Galleria in January 2011. She had filed for divorce and wanted him to move out, according to a protective order application she signed.\nThey married in February 2010. Zina Bowser sought the divorce the following January, citing “cruel treatment,” discord or conflict of personalities and adultery.\nBowser served in the Army from 1991 to 2000. Those who enter Veterans Court must demonstrate that their time in combat caused them to commit whatever crime they are accused of.\nJoe Lynch, a Vietnam War Army veteran who volunteered as Bowser’s mentor for Veterans Court, said Bowser told him he served in the 1990s in Operation Desert Shield in the Persian Gulf, as well as during operations in Haiti and in war-torn Somalia.\n“Of all the veterans I’ve met over the years … he would have been the last one I expected this of,” said Lynch. Lynch said Bowser was always “friendly and forthcoming” when discussing his life.\nBut on Thursday, the Army had no record of him being in combat, which should have made him ineligible for the program.\nState District Judge Mike Snipes, who started Dallas County’s Veterans Court in 2010, said he approved Bowser’s graduation from the program last summer.\n“The decision to allow him into the court and the decision to allow him to graduate were mine and mine alone,” Snipes said. “I don’t want anybody else to be blamed for anything.”\nSnipes declined to discuss Bowser or his case further.\nLynch said he had believed Bowser was doing well and had benefited from the program.\nSmith, the former girlfriend Bowser is accused of killing before Zina Bowser on Wednesday, always came to court with him, Lynch said.\n“You’d rarely see” that kind of support, Lynch said. She would always say that “everything was going OK. He was doing what he was supposed to be doing.”\nLynch said Snipes always asked Smith if Bowser had any problems that needed to be addressed.\n“‘Fine, judge,’” Lynch recalled Smith always saying. “No issues.”\nThe family violence case no longer shows up in the criminal court system because Bowser graduated after undergoing intense drug testing, psychiatric care and anger management classes. The charge, believed to have been aggravated assault, was expunged.\n2011 incident\nBut an affidavit alleging domestic violence survived the wiping of his record because it was attached to a January 2011 application for a protective order in a divorce case. The affidavit shows that Wednesday’s rampage was not the first time Bowser was accused of domestic violence.\nThe estranged wife, Zina Bowser, signed an affidavit that said the 6-foot-7, 400-pound Bowser shoved her with his stomach and threatened to kill her and her children in January 2011.\n“He put his finger in my face and said, ‘I will bury you,’” Zina Bowser said in the sworn affidavit.\nShe said she started to call 911, but he grabbed a pocketknife from the nightstand and said, “Call the police and I will execute your kids.”\nZina Bowser’s divorce case languished and is no longer an active case.\nErbie Bowser was being evaluated Thursday at Parkland Memorial Hospital.\nBrad Lollar, one of the attorneys appointed to represent him, said he did not yet know much about the case. “I haven’t talked to him yet,” said Lollar.\nFranks, the DeSoto officer, said earlier that Bowser has “said very little” since he was arrested.\n“I don’t know that he is in a state right now where he can be cooperative or uncooperative,” she said.\n“I just know that he does lapse into periods where he just sits there quietly, or wants to lay down, or doesn’t want to speak.”\nThe father of Zina Bowser’s 3-year-old grandson said he knew when he heard what had happened that Erbie Bowser was behind it.\n“Once they started to get their divorce, he started acting crazy and talking about how he was going to kill everybody,” said Jamaree Johnson. “He just didn’t want to get divorced. He married a woman with some money and he quit his job right after they got married. She was taking care of him, and she finally got tired of taking care of him.”\nThe mother of his child, Neima, feared the whole family was in danger.\n“That was her worst fear, and it came to reality,” he said.\nStaff writers Tasha Tsiaperas, Tristan Hallman, Ed Timms and Liz Farmer contributed to this report."}