{"uri": "http://www.mlive.com/news/bay-city/index.ssf/2016/06/bay_city_teen_who_accidentally.html", "title": "Bay City teen who accidentally shot self with stolen gun charged with felonies", "dct": "Thu, 16 Jun 2016 16:32:00 GMT", "id": "6accb60462fa57caec045a16ae2e122a", "content": "BAY CITY, MI -- A Bay City teen is facing a pair of felonies after shooting himself with a stolen gun, then allegedly telling police he was shot by another person.\nJust before 12:30 p.m. Thursday, May 19, police responded to a reported shooting victim in the 600 block of North Lincoln Street. The neighbor who called 911 said he'd left his home to find the victim outside, court records show.\nPolice arrived to find 17-year-old Andrew K. Heard, also known as Drew Breezy, sitting in the driveway of 606 N. Lincoln St., where Heard lived with his girlfriend and her family. Heard had a visible gunshot wound to his chest, court records show. Police asked Heard who shot him.\n\"I don't know,\" Heard told the officers, according to court records. \"I've been beefing with a guy from a party last night.\" He went on to say the man who shot him was wearing all black, but provided no additional description.\nA Bay City teen is recuperating from a self-inflicted gunshot wound, but soon could face charges for claiming he was shot by someone else.\nHeard was taken via ambulance to McLaren Bay Region hospital. Along the way, Heard told police he was in the attic when a man shot him.\nPolice entered Heard's home and found a blood trail that began in a fourth-floor bedroom and led outside. The trail also led to an attic access panel that was ajar. Inside the attic, police found a Browning .22-caliber pistol with an empty casing stuck in the gun's ejection port, court records show.\nHeard's girlfriend, who was hysterical and crying, told police she was walking to a nearby store to buy cigarettes when the shooting occurred, court records show.\nAt the hospital, Heard's girlfriend's mother told police her husband had a handgun go missing around Easter. She said the gun disappeared shortly after her husband had shown it to Heard, court records show.\nInterviewed by police at the hospital, Heard said he attended a party the previous night and nearly got in a fight with a few other guys. Heard had a .380-caliber pistol with him at the party and fired two rounds into the ground, then tossed the gun into the Saginaw River near Veterans Memorial Bridge, he told police.\nWhile he was alone at his residence, a man entered and shot him, he told police. He later changed his story, saying he was alone and was trying to rack a round into the gun when he accidentally shot himself under the right collarbone, court records show.\n\"I don't know why I made up the story about someone coming into the house,\" he told police.\nPolice later learned the .22 they recovered had been reported stolen from a vehicle in Bangor Township on Dec. 23, 2014, court records show. Heard told police he was holding the gun for a friend.\nHeard on Tuesday, June 14, appeared in Bay County District Court for arraignment on single counts of false report of a felony and receiving and concealing a stolen firearm. The charges are four- and 10-year felonies, respectively.\nHeard is free on a personal recognizance bond. He is to appear for a preliminary examination before District Judge Timothy J. Kelly at 2:30 p.m. on Wednesday, June 29.\nBefore accidentally shooting himself in the head, a Bay City man assured his friends the gun in his hand was fake.\nThis is the second time this year that a Bay City teen has shot himself in Bay City, then claimed someone else pulled the trigger. The previous incident happened in the early morning hours of April 10, when Shawn M. Palmer shot himself in the head inside his residence at 716 S. Farragut St. in the South End.\nAccording to witness statements contained in court records, Palmer was attempting to demonstrate the gun was fake when he shot himself. Palmer's friend, 17-year-old Edward E. Williams Jr., allegedly called 911 and told dispatchers Palmer was the victim of a drive-by shooting. He later told the same story to police, as did a hospitalized Palmer, court records show.\nWilliams is charged with one count of false report of a felony. Williams' case is pending trial in Bay County Circuit Court."}