{"uri": "http://1350kman.com/plea-in-university-garden-murder/", "title": "Plea In University Garden Murder", "dct": "Tue, 29 Oct 2013 00:00:00 GMT", "id": "13c6fea1ae755d944027cc834f07264b", "content": "A plea has been entered in connection with the April shooting at the University Garden apartment complex.\nAccording to Riley County Attorney Barry Wilkerson, Matthew Wilson, 43, entered a plea to the 1st degree murder of Michael Lowery, the Attempted First Degree Murder of Dustin Ferguson, the Attempted First Degree Murder of Joel Solano and the Aggravated Battery of Christine Kim and the Aggravated Battery of Alexya Mailea.\nThe facts, according to Wilkerson’s office, are that at approximately 4:00 a.m. on April 7th, Alexya Mailea , Christine Kim and Michael Lowery were leaving Apartment 9 Gardenway. The three had gone to Apartment number 9 Gardenway earlier in the evening to watch movies and hang out with with Dustin Ferguson. Dustin Ferguson shared the apartment with Joel Solano. Joel Solano was in his room asleep along with his significant other and the couple’s small child.\nAs Christine Kim, Aexya Mailea, Dustin Ferguson and Michael Lowery were exiting the apartment, Matthew Wilson who lived in Apartment 10 exited and began shooting. Christine Kim ran down the stairs out into the parking lot, the other three ran back into apartment number 9.\nChristine Kim who had been struck by a bullet, collapsed outside and was approached by Matthew Wilson. Wilson told Christine Kim he was not there to harm her but was after the guys. He told Kim he just wanted a friend. Matthew Wilson then left Christine Kim and went back upstairs eventually shooting his way back into the apartment. During the chaos Michael Lowery sustained two shots which proved to be fatal. Dustin Ferguson jumped out a window after having been previously shot. The defendant spoke to Alexya Mailea telling her as well that he was not going to kill her that he was just there for the guys. Alexya Mailea was bleeding at that point from being shot in the hallway. According to witness accounts Matthew Wilson tried unsuccessfully to enter Joel Solano’s room but was unable to enter. Matthew Wilson had made comments to a witness at the scene that he was tired of the guys partying.\nMatthew Wilson entered his plea of No Contest on Friday in front of Judge Bosch. Sentencing has been scheduled for December 12th, 2013 at 4:00 p.m. On the First Degree Murder Charge, the sentence is life in prison without parole eligibility for 25 years."}