{"uri": "http://www.pennlive.com/news/2016/08/da_involved_in_probe_of_teens.html", "title": "DA involved in probe of teen's shooting at Harrisburg youth center", "dct": "Wed, 10 Aug 2016 20:54:49 GMT", "id": "2da6fcb8f2ec5a8e6740303e97fed051", "content": "UPDATE: Dauphin County removes juveniles from center where teen was shot.\nDauphin County District Attorney Ed Marsico said Wednesday that his office is participating in the probe of a shooting that injured a 15-year-old boy at a youth center in Harrisburg.\nHis investigators are coordinating with city police, Marsico said, but will go beyond making a determination on whether criminal charges should be filed over the boy's shooting by a counselor at the Alternative Rehabilitation Communities facility in the 2800 block of Penn Street.\nHis office also will \"see if there are any recommendations we can make to assure the safety of the children,\" Marsico said. He said President Judge Richard A. Lewis has voiced concern over the incident.\nLewis said Wednesday that, \"Our primary concern is for the well-being of the youngster who was injured in this most unfortunate incident. Whether it rises to a criminal matter is the DA's decision, but we will evaluate the results very closely as we review all policies and procedures of agencies entrusted with the care and supervision of juveniles on behalf of our court system.\"\nARC is a private facility the county uses for treatment of juvenile criminal offenders.\nInitial indications are that the counselor accidentally shot the boy in the leg Tuesday afternoon while showing the weapon to a group of teens, police said. The injured boy is expected to recover.\nDaniel Elby, the CEO of ARC, told PennLive on Tuesday that the shooting was accidental and the part-time counselor, a local minister, is on unpaid leave while the matter is investigated. The counselor is licensed to carry a gun, Elby said, but he noted that ARC bars firearms from its properties.\nAn attempt to reach Elby for additional comment on Wednesday wasn't immediately successful.\nOn its website, the 41-year-old Harrisburg-based ARC states, \"Our service philosophy supports a home-like, community-based focus for our students.\" The nonprofit agency accepts at-risk clients ages 11 to 19 who have been adjudicated by the court. Four years ago, county commissioners leased the former Schaffer Youth Center to ARC as a cost-saving measure.\nThis story has been updated with comment from Dauphin County President Judge Richard A. Lewis.\nA former top aide detailed a series of heated exchanges with Kathleen Kane as an investigation was launched into alleged grand jury leaks."}