{"uri": "http://www.wfmz.com/news/berks/gun-goes-off-at-grocery-store-employee-grazed-by-bullet/197068797", "title": "Gun goes off at grocery store; employee grazed by bullet", "dct": "Mon, 05 Dec 2016 16:19:00 GMT", "id": "c57e6bdb687401549717c31b3f079953", "content": "READING, Pa. - A supermarket employee was wounded when a customer's gun accidentally went off inside the store, officials said.\nPolice and paramedics were dispatched shortly before 11 a.m. Monday to the Weis Markets at North 13th and Rockland streets.\nA customer who was inside the store told 69 News that he was standing next to a man when the man's gun fell to the floor and discharged.\n\"One of our associates was grazed by the bullet,\" said Dennis Curtin, the company's director of public relations. \"No other customers or associates in the store were hurt.\"\nThe wounded woman, reported to be 40 years old, was taken to a hospital for treatment. She was reported to be conscious and alert.\nThe call, initially for an accidental shooting on the store's parking lot, drew a significant response from police during a busy time of day for the store. WFMZ's Amanda VanAllen reported counting more than a dozen RPD cars, as well as an ambulance on the scene outside the store.\n\"All reports at this time indicate that this was an unfortunate accident,\" Curtin said. \"Our number one concern and priority at this moment is the health of our associate who has been taken to the hospital for medical treatment of non-life threatening injuries and will be discharged this afternoon. We are grateful for the timely and professional response of the Reading Police Department and local emergency services.\"\nReading police said the incident is still under investigation, however, the man did have a valid permit to carry.\nThe store is adjacent to the campus of Albright College, which emailed the following statement to parents of students:\n\"Earlier today an incident occurred at the Weis Markets off Rockland Street next to campus. There is no threat to Albright, our students or employees, but we wanted to make you aware of what happened. A patron at the store reportedly dropped a firearm he/she was carrying and it accidentally discharged, grazing an employee. The employee was taken to the hospital with non-life threatening injuries. Reading Police have responded to the scene, are speaking with the patron involved and are investigating the incident. Again, there is no threat to campus.\""}