{"uri": "http://www.wave3.com/story/30930046/man-who-shot-killed-boy-says-it-was-an-accident", "title": "Man says he accidentally shot & killed boy", "dct": "Mon, 11 Jan 2016 00:12:00 GMT", "id": "8ff33a9970159e51538c5970e048ab51", "content": "LOUISVILLE, KY (WAVE) – Andre Lamont O'Neal Jr. was just 8 years old when he was shot and killed late Saturday night.\nThe man responsible says it was a complete accident.\nCommunity activist Christopher 2X says he's known the family for a decade. He says O'Neal was with a babysitter on N. 34th St. when the shooting happened around 11 p.m. Saturday.\nO’Neal’s father, Andre Lamont O’Neal Sr. spoke about his son briefly over the phone.\n“He was good little boy,” O’Neal said. “Good, smart. I kept him like every weekend.\"\nElgin Anders Jr., O'Neal's neighbor, said he is responsible for the shooting.\n\"Big accident,” Anders said. “Huge accident.\"\nHe says he is friends with the O’Neal family and that he was grilling nearby and had slippery fingers when the gun accidentally went off.\n\"I should've just kept it in my pocket, but it was hanging in my pocket and I was like man I need to get it out my pocket,” Anders said. “I was about to put it where I put it at, and it slipped, and pow!\"\nAnders said he took O'Neal Jr. to the hospital instead of calling 911 for an ambulance because he was panicked.\n\"It was a shocking moment. It was a real shocking moment,” Anders said. “We didn't really know what to do so we took him ourselves. I'm holding him in my chest, squeezing the wound. So far, I’d seen the wound in his arm. Early this morning, they told me it came out his chest, but we didn't know nothing about it.”\nAnders said as a father to a young child himself, he’s haunted by Saturday’s shooting.\n\"He's a young child,” Anders said. “Nobody wants to see anyone that young die.”\nChristopher 2X said O’Neal’s father was in tears when he spoke to him Sunday morning.\n\"Nobody holds up well after any death but when it involves a child or a teenager, especially a child, the magnitude of that loss is indescribable to families,” 2X said.\nRight now police say they are conducting a death investigation, with homicide detectives involved.\nCopyright 2016 WAVE 3 News. All rights reserved."}