{"uri": "http://thesouthern.com/news/local/communities/carbondale/suspect-in-sunday-carbondale-shooting-surrenders-to-authorities/article_873fe4b8-9546-598f-bcfb-43e591df5c88.html", "title": "Suspect in Sunday Carbondale shooting surrenders to authorities", "dct": "Fri, 01 Apr 2016 00:00:00 GMT", "id": "81b66fc78aaa8c7ff8c0e2d01bc7d9ea", "content": "CARBONDALE — One of the suspects allegedly involved in the Sunday shooting on West Walnut Street turned himself into the authorities at the Jackson County Jail Thursday evening, according to Jackson County State’s Attorney Michael Carr.\nJohn F. Ingram, 21, of Cape Girardeau surrendered himself at about 7 p.m. and he was accompanied by his attorney, Brian Drew, of Benton, Carr said in a news release.\n+3\nIngram has been charged with one count of aggravated battery with a firearm and another count of aggravated discharge of a firearm.\nAggravated battery with a firearm is a Class X felony and it carries a mandatory minimum six-year sentence and a maximum 30 year sentence, and it is not eligible for probation. The count alleges that Ingram acted together and in concert with Travis Tyler, 21, of Cape Girardeau, in committing a battery by knowingly discharging a firearm on Sunday.\nThe second count, aggravated discharge of a firearm, alleges that he knowingly discharged a firearm in the direction of another person. That person has been identified as Nehemiah Greenlee, a male. The second count is a Class 1 felony, which carries a potential four to 15 year sentence.\nGet news headlines sent daily to your inbox\nCarr said Friday the bail on the warrant was set at $1 million and Ingram’s first appearance in Jackson County Circuit Court will be at 2 p.m. on Monday.\nTyler, who is charged with the same offenses, has not been apprehended and remains a fugitive, Carr said.\nHe is asking anybody with information regarding the incident or the whereabouts of Tyler to call the Carbondale Police Department at 618-457-3200."}