{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-boy-11-accidentally-shot-to-death-had-lost-father-to-gun-violence-20150903-story.html", "title": "Police: Boy, 11, accidentally shot and killed by relative playing with gun", "dct": "Thu, 03 Sep 2015 17:28:00 GMT", "id": "ad81a9e6e034cec7d3b55c357171b9c6", "content": "(John J. Kim, Chicago Tribune)\nOn Sunday, Carlos Watson went fishing with his 11-year-old grandson Antwone Price in Washington Park on the South Side.\nThe fish weren't really biting and they caught mostly weeds as the boy learned to cast a fishing rod, Watson said.\nThree days later, Watson sat on a yellow curb outside Comer Children’s Hospital, his hands clasped on the back of his head. Inside, his grandson lay dead after being accidentally shot in the abdomen around 9 p.m. Wednesday in his Park Manor home on the South Side, according to police.\n“This was a kid beyond his years,\" Watson said.\nPolice say Antwone was shot as an 18-year-old relative played with a semi-automatic handgun the boy's friend claimed to have found. Antwone's friend was visiting at the home in the 7400 block of South St. Lawrence Avenue and showed the .38-caliber gun to the 18-year-old, police said.\nNo charges had been filed against the 18-year-old Thursday afternoon.\nRelatives who gathered at the hospital said Antwone lost his father to gun violence two years ago.\nAntwone Earl Price Sr., 30, and another man were found dead in Price's parked white Camaro in the 7100 block of South Oakley Avenue in Englewood on May 22, 2013. Relatives said the killing has not been solved. In Tribune reports at the time, Price's grandmother, Myrtis Price, said her son, Anthony Price, who was the older Antwone Price's father, was shot and killed in 2000.\n“It’s so unreal,” Antwone’s grandmother Barbara Sanders said outside the hospital. “We’re just in shock. It’s like ... why are we here again?”\nSanders, Watson and his wife Michele Watson were joined by more than two dozen family members and friends outside the hospital. Some wept loudly, some paced and smoked cigarettes. A few hugged brown teddy bears.\nMichele Watson's eyes were wide and her face was red from tears, but she smiled as she talked about Antwone. “He was just a good kid,” she said. “He loved life.”\nThe boy was a deacon at his church, according to the Watsons, who said Antwone's dream and passion was to become a funeral director. He had helped make arrangements for his aunt's funeral last year, relatives said.\n“He wasn’t your average 11-year-old,” Sanders said. “He was like a 30-year-old in an 11-year-old body.”\nHis grandparents said Antwone himself organized his recent transfer to Comer College Prep Middle School, where he started sixth grade about a week ago.\n“He said the previous school wasn’t challenging enough for him,” said Michele Watson, chuckling at the memory.\nShe said one of her fondest moments was this year’s Mother’s Day. Watson said Antwone brought fresh flowers and chocolate-covered strawberries for Watson, his mother and his aunt."}