{"uri": "http://www.seattletimes.com/seattle-news/crime/juvenile-arrested-in-shooting-death-of-17-year-old-in-auburn/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_crime", "title": "Juvenile arrested in shooting death of 17-year-old in Auburn", "dct": "Mon, 10 Oct 2016 16:48:00 GMT", "id": "403d9068bf457642e37b951f533b19ce", "content": "Police have arrested a 16-year-old boy in connection to the fatal shooting of a 17-year-old boy in Auburn on Friday.\nThe victim has been identified as Erick Valdez-Herrera, the King County Medical Examiner’s office said.\nAccording to a probable-cause statement, which outlines the police case, the 16-year-old was arrested on suspicion of second-degree murder. He has been booked into King County Juvenile Detention Center and is awaiting his first court hearing, a police news release says.\nThe Seattle Times generally does not name juvenile suspects unless they’re charged as an adults.\nPlay VideoPlayMuteCurrent Time 0:00/Duration Time 0:00Loaded: 0%Progress: 0%Stream TypeLIVERemaining Time -0:00Playback Rate1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptionsAudio TrackFullscreen\nThis is a modal window.\nCaptions Settings Dialog Beginning of dialog window. Escape will cancel and close the window. Text Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps Defaults Done\nPolice said the suspect approached Valdez-Herrera in a vehicle with a handgun on 25th Street Southeast and fired multiple rounds. Valdez-Herrera was pronounced dead at the scene.\nAccording to the probable-cause statement, the 16-year-old told investigators he initially intended to “sock” Valdez-Herrera just to scare him, but he ended up firing the gun.\nIt is unclear what circumstances led police to make the arrest, though the release says detectives have recovered the handgun they believe was used.\nFurther details, such as if or to what extent Valdez-Herrera and the suspect knew each other, are also unknown.\nA representative of the Auburn Police Department could not immediately be reached on Monday afternoon.\nOn Friday, witnesses told investigators several people ran from the area after the shooting, and police said the shooting appeared to be gang-related.\nAs a precautionary measure, police on Friday put three nearby schools into a temporary lockdown during the search for the gunman"}