{"uri": "http://www.sbsun.com/general-news/20151202/14-dead-21-injured-in-san-bernardino-mass-shooting-2-suspects-killed?source=most_viewed", "title": "14 dead, 21 injured in San Bernardino mass shooting; 2 suspects killed", "dct": "Wed, 02 Dec 2015 19:31:00 GMT", "id": "051dc4da6194d5fc00e6af56ec804a16", "content": "This story has been updated with new information. For the most recent developments, go here: San Bernardino shooters “sprayed the room with bullets”\nSAN BERNARDINO >> At least 14 people were killed and 21 others injured by assailants who opened fire Wednesday morning on a training session of county employees at a facility that serves developmentally disabled people.\nThe shooting at the Inland Regional Center, on Waterman Avenue, just south of Orange Show Road, marks one of the largest mass shootings in the country in recent years and triggered lockdowns at schools, hospitals and entire neighborhoods across the city as federal and local law enforcement officials searched for the suspects.\nFinally, four hours after the 11 a.m. shooting, two suspects — a man and a woman — were killed in a gunbattle with police about two miles from the regional center, San Bernardino Police Chief Jarrod Burguan said.\nA third suspect seen fleeing that shootout was later detained. While it is not clear whether he or she was involved, Burguan said late Wednesday that police now believe that the two slain suspects were the only two shooters.\n• Related: Michel Nolan: The darkest of days for a resilient but battered city\nLaw enforcement identified them as Syed Farook, 28, and Tashfeen Malik, 27. Farook has worked as an environmental health specialist for San Bernardino County for five years, according to police officials.\nAuthorities are still investigating a possible motive and have not ruled out terrorism or the possibility that it involved a workplace dispute. Police continued to search a house in Redlands on Wednesday night that may be connected to the suspects.\n“The information we have is that (the shooters) came prepared … as if they were on a mission,” Burguan said.\nThey were dressed in assault-style clothing and armed with long rifles, Burguan said. They were later found with assault-style rifles and handguns, he said.\n• Related: What is the Inland Regional Center, the building at the center of the San Bernardino shooting?\nThough the shooting took place at the regional center, which serves thousands of people with developmental disabilities, the suspects targeted a gathering of county employees who were using a conference center at the facility often rented out to outside agencies. The San Bernardino County Department of Public Health was conducting a daylong training event at the facility, according to top county officials who requested anonymity. Environmental health specialists work under the Department of Public Health.\nAdvertisement\nA dispute took place at the event, which police described as a holiday party, and Farook left angry, Burguan said.\n“There had to be some degree of planning that went into this,” he added.\nFBI assistant director David Bowdich said earlier in the day terrorism also remained a possibility.\n“Is this terrorism? I’m still not willing to say we know for sure … that is a possibility,” he said, adding that FBI agents are involved in the investigation. “We will go where the evidence takes us. It’s possible it will go down that road.”\n“At minimum we have a domestic terrorism situation occurring,” Burguan said.\nA city in terror\nThe shooting occurred shortly before 11 a.m. Officers from several agencies responded and began evacuating people, including children and IRC clients.\nAt the same time, families of employees began receiving phone calls and texts from terrified loved ones inside the regional center.\n“Dad, I’m scared,” read one text Tom Carrillo received from his daughter, who works at the facility. He later received word she was evacuated.\n“This is heartbreaking,” Carrillo said.\nInside, hundreds of employees barricaded themselves in offices. Melinda Rivas, a social worker, said she and about 40 others locked themselves inside a conference room and stacked furniture up against the door.\n“I had no idea if I was going to get out alive,” she said.\nLaw enforcement officers who entered the facility said there were so many wounded victims and they wanted to act fast, so they loaded them into a truck to quickly drive them to safety.\nIRC employee Brandon Hunt, who was out running an errand at the time of the shooting, said he received calls from inside. Co-workers told him they had to step over what appeared to be bodies as they tried to get out.\n“This is a great agency. I don’t know why anyone would target it,” Hunt said.\nOnce evacuated, victims and other building occupants were taken to the San Bernardino Public Golf Course, across the street from the regional center, where triage was set up.\nDesperate family members waited at the perimeter of the crime scene for news of their loved ones.\nEvacuees were interviewed by police and eventually loaded onto buses and taken to two local churches where they were to be reunited with family. But as the search for suspects continued, little information was released.\nSchools, county buildings and hospital buildings were put on lockdown. At Arrowhead Regional Medical Center in Colton, where some victims were taken, throngs of police and SWAT officers clad in full gear stood guard, many clutching their department-issued assault rifles, outside the emergency room and other hospital entrances.\nStaff at Loma Linda University Medical Center received a bomb threat about 2:40 p.m. Classes were canceled and students were encouraged to leave public areas of campus. Officials later declared that no credible threat was discovered, but the hospital remained on a heightened state of alert.\nRedlands home focus\nAuthorities spent hours searching the three IRC buildings for the suspects, though they also had word they fled in a dark-colored SUV. While they didn’t find any suspects at the facility, they did find an explosive device that was later detonated.\nThe search eventually took law enforcement to a house in Redlands. While watching the house, they saw a dark-colored SUV leave. A chase ensued that eventually ended at San Bernardino Avenue near Richardson Street, in San Bernardino, only miles from the regional center. The suspects and police exchanged a barrage of gunfire.\nJesus Gonzales, 36, said his house was hit. His wife was inside.\nMy wife “called me frantically saying she’s hearing gunshots going off. Everywhere. And that’s she’s scared. And that she heard noises in the house, like it’s hitting the house,” he said. “She ducked down and said she heard more than 100 rounds.”\nTwo suspects were killed in the exchange, a man and woman. A third suspect who fled the scene was later detained, but police are not certain if he was involved, Burguan said.\nA police officer was also injured in the gunfire and suffered a non-life-threatening injury, Burguan said.\nThoughts and prayers\nPeople from across the nation and close to home were praying for San Bernardino on Wednesday night.\n“My prayers are with the victims, families and survivors of this horrific attack. ... My heart aches that the out-of-control gun violence epidemic has come to our community,” said Rep. Pete Aguilar, D-San Bernardino, echoing sentiments from many public officials.\nA prayer vigil was held at the Kingdom Culture Worship Centre, at 480 W. Court St., where attendees sang and prayed for the city and the people and families impacted by the shooting.\nLead Pastor Sherman Dumas said he was in a staff meeting when he heard about the shooting. He said he dropped everything so that he could head to the scene.\n“The main reason why I was driven to be there is because I love San Bernardino,” Dumas said.\nThe Los Angeles Council on American-Islamic Relations also held a news conference Wednesday night to express their condolences for the victims. CAIR’s executive director for Los Angeles, Hussam Ayloush, said his organization condemns “this horrific and revolting attack and offer our heartfelt condolences.”\nThe brother-in-law of San Bernardino shooting suspect Syed Farook said he has “no idea” what Farook’s motive could have been.\n“Why would he do something like this? I have no idea. I’m in shock myself,” said Farhan Khan, who said he was at CAIR to express his family’s sadness for the victims. “I cannot express how sad I am for what happened today.”\nStaff Writers Doug Saunders, Beatriz Valenzuela, Brian Day, Joe Nelson, Michel Nolan, Nereida Moreno, Kristina Hernandez, Neil Nisperos, Ryan Hagen, Liset Marquez, Susan Abram, Sandra Emerson, Josh Dulaney, David Montero and Rebecca Kimitch contributed to this report."}