{"uri": "http://www.post-gazette.com/local/city/2017/01/22/Larimer-man-dies-during-alleged-burglary-attempt/stories/201701220223", "title": "Ex-wife: Homeowner trying to ward off intruder fatally shot by police", "dct": "Sun, 22 Jan 2017 17:13:00 GMT", "id": "5825ee7d1c6095182958226ca9ae4a37", "content": "A Larimer man’s ex-wife said he was trying to chase away a burglar by shooting a gun down the steps inside his home when Pittsburgh police opened fire and killed him early Sunday morning.\nPittsburgh police said the homeowner was “firing in their direction.”\nBy the end of the day, Christopher Mark Thompkins, 57, was dead. Juan Brian Jeter-Clark, 23, who has addresses in Mount Washington and Mount Oliver, had been arrested and charged with trespassing.\nTwo Pittsburgh police officers, whom the bureau did not identify, had been placed on administrative leave, per normal protocol after an officer-involved shooting.\nBrenda Richmond, 51, of Penn Hills — the former wife of Thompkins, an ex-felon who reunited with her several years ago — was in bed with him as events began to unfold shortly before 4 a.m.\n“It was terrible. Terrible. I’m still shaking,” she said.\n“I can’t believe Mark’s gone,” she said, referring to Thompkins by his middle name.\nShe said she and Thompkins were sleeping when, suddenly, she was awakened by him calling her name in urgent tones.\n“I opened my eyes and a man was standing there above us,” Ms. Richmond said.\nThe man, later identified by police as Mr. Clark, left the room and Thompkins asked Ms. Richmond for her handgun, which she said she has a permit to carry.\n“Mark’s 78-year-old mother was downstairs. We were upstairs. She can’t walk. She’s sick. She can’t do anything. Mark was saying, ‘My mother. My mother,’ ” Ms. Richmond recounted.\nAfter grabbing Ms. Richmond’s handgun, Thompkins approached the stairs. Ms. Richmond said he fired the gun, trying to “scare the guy away. We didn’t know if there was more people in the house or what.”\nShe said Thompkins went down the steps to a landing and shot down the stairs.\n“I heard ‘boom, boom, boom,’ I didn’t know it was the cops,” Ms. Richmond said. “I turned around and ran away, and I jumped out the window on the roof. When the police came in, I was gonna jump [from the roof], but the police told me, ‘Don’t jump.’ I was screaming, ‘I’m a victim. Don’t shoot me. I’m on the phone with 911.’ ”\nMs. Richmond said she didn’t know that police had been notified about a potential break-in. She said she learned later that an alarm on their security system had been tripped, and the security company had notified emergency officials.\nPolice wrote in a criminal complaint for Mr. Clark that they arrived at the home, called out on a radio that they had a “Code 3 — shots fired” and saw Thompkins “firing in their direction. Responding officers who were standing on the front porch returned fire striking the homeowner.” The staircase Thompkins was standing on is “straight ahead and slightly to the left of the entrance” to the home, police wrote.\nMs. Richmond said she thought Thompkins was focused on Mr. Clark, not on police.\n“I could see Mark shoot down the stairs at the guy. The cops came, and they shot through the door. Mark was shooting at the robber, not the cops,” she said.\nMs. Richmond said she didn’t hear police announce their arrival before the shots were fired and she wonders whether “the protocol can be made better.” But she said she is not bitter toward the officers.\n“They were trying to do their job. They didn’t know they were shooting Mark. … They saw somebody shooting, they shoot,” Ms. Richmond said.\nSonya Toler, a spokeswoman for Pittsburgh police, declined to comment on whether the officers announced their presence, saying, “As you know, with officer-involved shootings there must be an internal review. As a result, more details will be released at the appropriate time.”\nShe said bureau policy generally requires officers to announce their presence “as soon as possible.”\nOfficer Robert Swartzwelder, president of the Pittsburgh police union, did not respond to a request for comment.\nThe investigation continues, with oversight from the Allegheny County district attorney’s office, as is typical for officer-involved shootings.\nThompkins had spent 10 years in a state prison in connection with the shooting death of a man who was trying to protect Ms. Richmond from Thompkins, who, at the time, was her husband, although the couple had been separated for a month.\n“He was not the same man today that he was back then,” Ms. Richmond said. “He changed everything. He turned his life around.”\nIn 1997, Thompkins, who had resided in Penn Hills at the time, was convicted of third-degree murder for shooting to death a handyman who had gotten in the middle of a domestic dispute between Thompkins and Ms. Richmond.\nHe was 35 when he killed Ronald Cunningham, 39, of the North Side on Nov. 11, 1994.\nMr. Cunningham was shot as he repaired a window in Ms. Richmond’s Manchester apartment.\nThompkins and Ms. Richmond had separated a month earlier.\nThe defense had argued that the gun went off accidentally during a struggle. Mr. Cunningham was shot once in the chest and once in the abdomen.\nThompkins had been acquitted of first-degree murder during his first trial in 1996, but the jury couldn’t reach a decision on other degrees of murder, so a retrial was held. He was found guilty of third-degree murder and he was sentenced to seven to 15 years in prison. But, according to online court records, it appears the sentence was vacated on appeal. Ms. Richmond said she is not aware of what happened in his case, which she said had been complicated, but she said he had served 10 years, most recently in Mercer, and had been released from prison in 2004.\n“When he got out, he got a job with a cleaning company, then he became a dialysis technician. He was a good guy and my best friend in the world. That’s why we got back together,” Ms. Richmond said.\nThey have a 24-year-old daughter together and he had two children from another relationship.\nMs. Richmond said Thompkins worked after getting out of jail until he had serious health issues involving his lungs.\n“He had to retire,” she said.\nBut, Thompkins spent his time taking care of his mother, who had suffered a stroke, as well as his grandchildren.\nMs. Richmond said she believes the Finley Street home was targeted for burglary because Thompkins recently had bought “a nice new car.”\n“They probably thought he had a nice car, so there’s money. Well, there’s no money. Just millions of bills. All this for nothing,” Ms. Richmond said.\nA neighbor who lives about a block away on the sparsely populated street, George Stash Phillips, a retired city police officer, was standing outside Thompkins’ two-story house, shaking his head later Sunday. He described the street as a “very nice place” with little trouble. He said he had heard shots being fired Sunday morning. He put the number at seven or eight.\nHe said he knew the victim, “only vaguely,” saying they were cordial.\nElizabeth Pittinger, executive director of the Citizen Police Review Board, an independent panel that investigates complaints about police conduct, said it’s too early to comment on the shooting.\n“We have to stand back while the investigation is conducted,” Ms. Pittinger said. “We will be just observing as to what transpires. We would need to see if there’s a criminal complaint filed.”\nAs the investigation gets underway, Ms. Pittinger said, “they’re now trying to determine if the shooting’s justified. If it’s not, you’d expect criminal charges to be filed.”\nMr. Clark was arraigned overnight on a criminal trespass charge and was being held at the Allegheny County Jail on $50,000 bond. A preliminary hearing is scheduled for Feb. 2.\nStaff writer Liz Navratil contributed. Karen Kane: kkane@post-gazette.com."}