{"uri": "http://www.wmcactionnews5.com/story/29635758/family-of-teen-girl-killed-in-rifle-accident-its-unreal", "title": "Family of teen girl killed in rifle accident: It's unreal", "dct": "Thu, 14 Jul 2016 02:11:00 GMT", "id": "245833405d31b8992888578ae7c247a9", "content": "CATAWBA COUNTY, NC (WBTV) -\nBrent Lewis fought back tears Monday afternoon as he talked about his younger sister who died in a firearms accident on Sunday afternoon.\n\"She was just an awesome kid,\" he said. \"She loved everyone.\"\nSixteen-year-old Selena Celeste Lewis, a rising junior at Maiden High School, was shot once in the chest as a 21-year-old man she was with was looking at a rifle for sale.\nLewis and Clayton Webb, Jr, had been driving around with another 21-year-old on Sunday afternoon when they stopped at a duplex on Rocky Ford Road.\nInvestigators say Lewis had just met Webb and the other man in recent days and were considered \"acquaintances.\" Webb had contacted a man about buying a .22 caliber rifle and had been told to look in a pickup that was at the duplex to find it.\nWhen Webb retrieved the weapon out of the truck, Captain Joel Fish of the Catawba County Sheriff's Office said, Selena Seleste started taking photographs of the rifle. The magazine holding bullets was not in the weapon at the time and authorities believe Webb thought it was therefore unloaded. It was not.\n\"There was one in the chamber,\" said Fish.\nWhile Webb was looking at the weapon he must have pulled the trigger, deputies say, and the gun fired and Lewis was hit.\n\"I heard a pop and then a scream,\" said Tina Yang, who lives just 50 feet from where it all happened. \"I saw the girl trying to get up and a lot of blood.\" Yang says several people went to the girl's aid and tried to comfort her as help was called.\nWhen the first responders pulled in, Yang says one of the people helping Lewis yelled out, \"She's dying, please hurry!\"\nDespite efforts from paramedics, Lewis died shortly after arrival at a local hospital. Investigators have talked to several witnesses and so far, they are calling what happened an accident. A report will be sent to the District Attorney's office and officials there will have the final say whether charges will be filed.\nIn any case, Captain Fish says what happened should be a lesson in gun safety. \"Consider all guns loaded,\" he said. \"Even if someone tells you it is not.\"\nHe added that, \"No one should put a finger on a trigger unless you intend to actually fire the weapon.\"\nFish says many accidents can be prevented by just following those basic firearm safety rules.\nCopyright 2015 WBTV. All rights reserved."}