{"uri": "http://heavy.com/news/2016/09/townville-elementary-school-shooting-south-carolina-suspect-live-stream/", "title": "WATCH: Townville Elementary School Shooting Coverage", "dct": "Thu, 29 Sep 2016 06:28:00 GMT", "id": "0d98a420d1e7744b63744378f02bb539", "content": "Live stream coverage from the scene of a school shooting at Townville Elementary School in South Carolina has concluded. The video above contains a replay of coverage from WYFF TV. The latest details of the shooting incident are below. This story will be updated as new information becomes available.\nAuthorities have now named the lone victim who was killed, Jeffrey Osborne, 47, who was murdered by his son, a 14-year-old boy, according to The Greenville News.\nTwo students, both boys, were injured in the shooting, along with a female teacher. One of the boys, six-year-old Jacob Hall, remained in critical condition as of 8 p.m., according to a WHNS TV report.\nThe Greenville News also reported that the alleged shooter was a home school student, and used a handgun in the shootings.\nAnderson County Sheriff’s Captain Garland Major said that Osborne’s son in now in custody and suspected of being the Townville Elementary School gunman. Investigators believe that he acted alone. Unconfirmed reports on social media give his name as Jesse Osborne.\nHere's what I'm seeing now. Authorities just released name of man killed – Jeffrey Osborne. He was shot to death by his son. pic.twitter.com/3tHPvGCLP4\n— Anna Lee (@annazlee) September 28, 2016\nA boy identified by a Facebook user who posted the photos as the Townville shooter can be seen in the the following images.\nAccording to South Carolina-based journalist Mike Ellis, the shooter called his grandparents in tears just one minute before he opened fire.\nThe suspect, despite being just 14 years old, drove a pickup truck to the school, and photos from the scene appear to indicate that he crashed it into a fence there, according to Mandy Gaither, senior reporter for WYFF TV.\nAt 7 p.m. Eastern Time, sheriff’s deputies released a fact sheet about the Townville shooting, containing the following information:\n“The suspect is a lone teen-aged white male who entered the school grounds armed with a handgun.\n“A teacher called in the incident to Anderson County 911.\n“Two white male students were shot by the suspect, one in the leg and one in the foot.\n“One white female teacher was shot in the shoulder.\n“At this time, there is no known relationship between the suspect and the school victims.\n“The suspect is home-schooled and is not a student at any school in the Anderson County School District.\n“One student and the teacher were transported by EMS to AnMed Hospital in Anderson. The other student was transported by Life-Flight to Greenville Hospital System’s Pediatric Trauma Center in Greenville.\n“We do not know the extent of their injuries at this time but all are receiving medical care.\n“Officers were on-scene within seven (7) minutes and the perpetrator was apprehended on the school grounds before 2:00pm. The initial apprehension was made by Firefighter Jamie Brock, a 30-year veteran of the Townville Volunteer Fire Department. The suspect was then detained by law enforcement.”\nOfficials also say that the shootings of two children and a teacher occurred on the school’s playground, not inside the school as previously believed. A local volunteer firefighter is being credited with stopping the shooter.\nAccording to a report by Greenville Online, two children were injured in the incident, two children were injured a man was dead in an area near the school. His death was possibly related to the shooting incident, which happened sometime between 1 p.m. and 1:30 p.m. Eastern Daylight Time, the report said.\nThe dead man has now been named as Jeffrey Osborne, whose body was found on a dirt road somewhere near the school, CBS News reported.\nStudents were taken to Oakdale Baptist Church at 6724 Highway 24 in Townville, where parents were asked to recover them.\nA press release from the Oconee County Sheriff said that the shooting happened at about 1:44 p.m.\n“Deputies from the Oconee County Sheriff’s Office responded to provide assistance at the request of the Anderson County Sheriff’s Office in regards to an active shooter situation that occurred at Townville Elementary School in Anderson County,” the press release read.\n“The Sheriff’s Office received word of a reported active shooter at the school around 1:44pm this afternoon and immediately dispatched the first deputies to the scene as well as sending deputies to the area schools in Oconee County to ensure the safety of our students. A request was made until more information became known for the area schools in Oconee County to go into a code yellow which means instruction inside the school continues as usual but no one is allowed into the building. School dismissal will take place in Oconee County on the normal schedule,” the release said.\nSouth Carolina Governor Nikki Haley was reported to be on her way to Townville Wednesday afternoon. She issued a statement before arriving.\nTownville Elementary is located in Anderson County, South Carolina, and had 286 students in grades kindergarten through sixth. School officials announced that Townville Elementary will be closed for the remainder of the week."}