{"uri": "http://www.wthr.com/story/31778017/2-year-old-boy-killed-in-shooting-at-northwest-indianapolis-home", "title": "2-year-old boy shoots, kills himself inside NW Indianapolis home", "dct": "Thu, 21 Apr 2016 01:19:00 GMT", "id": "b9dcbe7bfc07d6930a5e0275b41675a5", "content": "A two-year-old boy died Wednesday night following a shooting at a northwest Indianapolis home.\nThe shooting happened around 9 p.m. in the 5200 block of Alameda Road, near W. 52nd Street and W. Kessler Boulevard North Drive.\nPolice said around 6 a.m. Thursday that the boy shot himself after retrieving a gun from his mother's purse that was sitting on the kitchen counter. His mother had stepped away.\nThe mother is cooperating with the death investigation, police said.\n\"Officers received a radio run of a child shot. Upon arrival, they located a two-year-old young boy that was shot in the center of the chest,\" said IMPD Capt. Don Weilhamer.\nDespite repeated CPR attempts, the boy was pronounced dead at Riley Hospital for Children at IU Health.\n\"We believe it was accidental, but we're talking a very preliminary investigation,\" Weilhamer said.\nPolice are trying to determine if the child accidentally shot himself.\nNeighbors say the mother and child had returned home a short time before the shooting.\n\"They're real nice. I knew the grandmother real well,\" said neighbor Louise Jones.\n\"If this is actually self-inflicted, it's important for people to realize you need to keep your guns up,\" Weilhamer said. \"But, like I said, it's too early at this point in time to say exactly what happened.\"\n\"I believe in that. People shouldn't have guns in their house, especially when they have kids, small kids,\" Jones said.\nIMPD offered safety tips for gun owners \"to ensure the safest environment with guns and kids\":\nTake the ammunition out of the gun.\nLock the gun and keep it out of reach of kids. Hiding the gun is not enough.\nLock the ammunition and store it apart from the gun.\nStore the keys for the gun and the ammunition in a different area from where you store household keys. Keep the keys out of reach of children."}