{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-shootings-violence-20160511-story.html", "title": "4 dead, at least 14 wounded in Chicago shootings", "dct": "Sat, 14 May 2016 05:22:00 GMT", "id": "b3307476ae2487bb94a5542474cd96ef", "content": "Four people were killed and at least 14 people have been wounded in Chicago since early Wednesday afternoon, including a triple fatal shooting in Englewood and five people shot in the evening in the Park Manor neighborhood, officials said.\nA man and two women were shot to death about 11:20 p.m. during a domestic-related incident in the Englewood neighborhood on the South Side, said Officer Ron Gaines, a police spokesman.\nA 50-year-old man, his 26-year-old daughter and her 26-year-old sister-in-law were in the 1500 block of West 71st Street when a man known to them fired shots at them during a domestic-related incident, police said.\nThe shooting happened inside and outside of a home on the block.\nPolice officers investigate the crime scene in the 1500 block of West 71st Street in the Englewood neighborhood where a man and two women were shot to death during a domestic-related incident late Wednesday evening on May 11, 2016.\n(Alexandra Chachkevitch / Chicago Tribune)\nThe 50-year-old was shot in the head and pronounced dead on the scene, near a sidewalk on 71st.\nA 26-year-old woman, the man's daughter, was shot in the head inside the home and pronounced dead at the scene.\nAnother 26-year-old woman was shot in the back. She was taken in critical condition to Stroger Hospital, where she was later pronounced dead, Gaines said.\nA suspect in the shooting barricaded himself and SWAT teams were called about 4:15 a.m. to a home near 103rd Street and Union Avenue in the Fernwood neighborhood on the Far South Side, according to police.\nMost recently, a 22-year-old man was shot to death about 12:40 a.m. Thursday in the West Pullman neighborhood on the Far South Side, Gaines said.\nThe man was discovered shot in the head in the 500 block of West 126th Street. He was pronounced dead at the scene, Gaines said.\nNo one was immediately in custody in the fatal shootings.\nIn other shootings:\nAbout 10:35 p.m. Wednesday, a 25-year-old man walked into MetroSouth Medical Center was wounded in a shooting in the West Pullman neighborhood, Gaines said.\nThe man was in a vehicle in the 12900 block of South Lowe Avenue when he an unknown male attacker came out of an alley and fired shots, Gaines said.\nThe man was struck in the thigh, and he managed to get to the hospital, where his condition stabilized, Gaines said.\nA woman and four men were wounded in a shooting about 8 p.m. in the 7100 block of South State Street, according to police.\nThe Chicago Fire Department took four adults to local hospitals, all in serious-to-critical condition, said fire Cmdr. Curtis Hudson, a spokesman.\nFive people were shot in the attack, although fire ambulances took only four to hospitals, according to police.\nA 32-year-old woman suffered a gunshot wound to the temple, and a 20-year-old man suffered a gunshot wound to the chest. Both were in critical condition at Stroger Hospital, said Officer Thomas Sweeney, a police spokesman.\nFive people were shot in the evening May 11, 2016, in the Park Manor neighborhood.\n(Nuccio DiNuzzo / Chicago Tribune)\nA 20-year-old man was in critical condition with gunshot wounds to the arm and back, and 27-year-old man with a gunshot wound to the leg was stabilized, both at Mount Sinai Hospital.\nA 26-year-old man was shot in the leg, and he was taken to St. Bernard Hospital, Gaines said.\nThe victims were outside on State Street when someone on foot approached them and fired shots, then fled in a vehicle, Sweeney said.\nA man who works on the block said he heard eight shots and that the incident began near the bus stop on the corner.\nA \"lady ran into the store\" and had a wound on her head. The man tried to help her by giving her some towels and saw other people running into the liquor store and another person shot in the chest.\n\"It's terrifying,\" he said. \"I'm scared to be here to be honest. I've been in this neighborhood six years and no problems happened. And now I'm scared to walk outside.\"\nMichael Elmore, who walks on State to go home from work every day, said he was shocked to see the police cars and called the incident \"maddening\" and blamed it on the grandchildren of longtime residents and people who sell loose cigarettes.\n\"This community has been grounded in being a middle-class neighborhood of working professionals for the last 50 years if you will,\" he said. \"So to have this sort of congregation of people who meet at this space dealing drugs and selling loose cigarettes, is like a phenomenon, if you will, in the last five years. It is despicable, and it does make it difficult for the people who are here.\"\nAbout 8:25 p.m. in the Austin neighborhood, a 15-year-old boy was shot in the 1300 block of North Parkside Avenue, Sweeney said. The boy was outside when someone in a vehicle drove up and began firing. The boy was in good condition, with a gunshot wound to the leg.\nJust before 6:40 p.m. in the Chicago Lawn neighborhood, a 17-year-old boy was shot in the 2500 block of West 63rd Street, said Officer Nicole Trainor, a police spokeswoman. The boy was taken to Advocate Christ Medical Center in Oak Lawn for treatment of a gunshot wound to the thigh.\nThe boy was being uncooperative, so police did not immediately have information on the circumstances of the shooting.\nOn the Near West Side, a shooting wounded two people about 2:20 p.m., Sweeney said. A 27-year-old woman was shot in the arm and hip and a 40-year-old man was shot in the hip in the 2200 block of West Jackson Boulevard, Sweeney said. Police initially said the man's age was 44. Both were taken to Stroger Hospital, where their condition stabilized.\nIn a separate attack at 2:15 p.m. in the 700 block of North Trumbull Avenue in the East Garfield Park neighborhood, a man was shot in the leg, according to Sweeney.\nThe man was taken to Mount Sinai Hospital, but a condition was not known, said Hudson, the Fire Department spokesman.\nEarlier, three people were wounded in an attack about 12:45 p.m. in the 6900 block of South Artesian Avenue in the Lithuanian Plaza neighborhood, according to Hudson.\nA 22-year-old pregnant woman was shot in the foot and taken to Advocate Christ Medical Center, Hudson said.\nA 22-year-old man was shot in the right arm and was taken to the same hospital, Hudson said.\nThe third victim, a 27-year-old man, was shot in the leg and was taken to Holy Cross Hospital, said Hudson, who added that all of their conditions were stabilized.\nOfficer Laura Amezaga, a police spokeswoman, said the three were standing outside when someone in a passing vehicle opened fire. No one is in custody, Amezaga said."}