{"uri": "http://www.wbir.com/news/crime/18yo-football-player-accused-of-murdering-central-hs-student/355203178", "title": "Maryville College football player faces Dec. 2 hearing in high school student's slaying", "dct": "Wed, 23 Nov 2016 00:00:00 GMT", "id": "7294ccae194844a9355d736e25e91715", "content": "MARYVILLE, TENN. - The Maryville College football player accused of shooting his former high school girlfriend to death through a window as she slept faces a Dec. 2 preliminary hearing, court records show.\nWilliam Riley Gaul, who professed his love on Twitter for Emma Walker, 16, hours before he was arrested, was arraigned Wednesday in a video appearance. Emma was a student and cheerleader at the school.\nHe's being held in the Knox County Jail in lieu of $750,000 bond.\nGaul, 18, is accused of the first-degree murder of Walker about 6:30 a.m. Monday in her North Knox County home. Authorities arrested the Knoxvillian late Tuesday in the parking lot of the Woodlands Apartments and booked him into the jail early Wednesday, according to the Knox County Sheriff's Office.\nAccording to the warrant, Gaul fired \"a gun into the residence with exact proximity to where the victim, Emma Walker, was sleeping.\"\nKCSO said detectives had Gaul under surveillance because they believed he was preparing to destroy evidence related to the homicide.\nAuthorities did not say late Tuesday what, if any, relationship existed between the two, but Gaul tweeted about her Monday and Tuesday. Acquaintances said they'd been boyfriend and girlfriend.\nFriends, classmates and acquaintances of Emma flooded Twitter on Wednesday with expressions of shock over her death and the arrest.\nAshley Beets said she'd been close to Emma. She left balloons as a tribute to her friend on Wednesday at Central High.\nEmma was \"sweet,\" she said.\n\"I heard that she was gone and I felt bad for her parents so I wanted to bring something.. out here,” she said.\nEmma was too young to die, she said.\nOn Tuesday night Gaul tweeted: \"I love you Emma, I can't be around any of that yet, it's too soon. I know you know I'm dying to be there but understand I can't. I love you.\"\nI love you Emma, I can't be around any of that yet, it's too soon. I know you know I'm dying to be there but understand I can't. I love you.\n— Riley (@rileygaul) November 22, 2016\nGaul graduated this year from Central High School, where he played football for the Bobcats. Walker was found dead from a gunshot wound in her North Knox County home on Monday morning.\nFamily and friends of Walker gathered for a memorial Tuesday night at Central High School in Fountain City. They asked that journalists not attend.\nGaul will face a court appearance in the coming days in Knox County General Sessions Court. He could submit to a preliminary hearing or waive the charge to the grand jury for further review.\nAuthorities are holding Gaul on $750,000 bond in the Knox County Jail.\nThe Maryville Scots football team lists Gaul as a freshman wide receiver. According to the Scots, he most recently played Nov. 12 for the Scots against Greensboro in North Carolina.\n\"Maryville College is cooperating fully with the Knox County Sheriff’s Department in this investigation. Our thoughts and prayers are with the victim’s family and friends and other individuals affected by this tragedy,” according to a statement from the school\nFriends of Walker posted condolences on Facebook on Monday and Tuesday.\nKnoxville Mayor Madeline Rogero tweeted Wednesday afternoon, \"Prayers for the family and friends of Emma Jean Walker and all @KnoxCentralHS. A terrible loss.\"\nA crowdfunding page was established to assist with Walker's funeral expenses.\nPrayers for the family and friends of Emma Jean Walker and all @KnoxCentralHS. A terrible loss.\n— Mayor Rogero (@MayorRogero) November 23, 2016"}