{"uri": "http://www.chicagotribune.com/news/ct-met-dupage-county-boy-shot1207-20141206-story.html?track=rss", "title": "DuPage County boy, 6, dies after apparent accidental shooting", "dct": "Sat, 06 Dec 2014 16:51:00 GMT", "id": "53cd082126c4a4b90bd96493d9839be4", "content": "Six-year-old Michael Cattron lost his mother last summer and uncle last year to gun violence in Chicago. But Friday night while watching cartoons, his young life was cut short by what police are calling an \"apparently accidental,\" gunshot wound.\n\"It feels like I'm floating,\" said Pierre Curry, Michael's grandfather. \"I have to take deep, deep breaths. I just can't believe it.\"\nMichael Cattron, 6, was pronounced dead at 12:30 p.m. Saturday at Loyola University Medical Center in Maywood, according to the Cook County medical examiner's office. Officials said the incident happened Friday night at his home in an unincorporated area near Villa Park.\nCircumstances of how Michael was shot were not immediately clear. Some family members said the boy accidentally shot himself, while others said a relative of his — a child who had been in the home playing with Michael — accidentally shot him.\nWhat DuPage County sheriff's officials have confirmed is that deputies responded to a call of an child injured as a result of an apparently accidental gunshot wound, according to a statement. The child was transported to the hospital, where he succumbed to the injury, the statement said.\nAccording to 46-year-old Curry, of the South Side, Michael was at home about 8:30 p.m. watching cartoons. Michael's father was watching him and several other young relatives when he stepped outside for a cigarette.\n\"He heard a popping sound, a boom. One boom,\" Curry said. \"He came inside and saw him lying in front of the TV.''\nCurry said the \"details were fuzzy,\" about what happened while the father was outside.\nCurry said he went to visit Michael shortly before he died at the hospital but could hardly look at him.\n\"It just tore me up,'' Curry said. \"I kissed him and told him I loved him, but the way he looked, I couldn't take it.\"\nCurry's daughter, Michael's mother, Jasmine Curry, was pregnant when she was fatally shot as she drove on the Dan Ryan Expressway last summer. Another son, 17-year-old Pierce Leroy Curry, was fatally shot in August 2013 in the city's Englewood neighborhood. A third child, his 20-year-old son, died naturally after suffering from an illness in October, Curry said.\nCurry spoke to the Tribune after Jasmine was killed. He said he woke to a call telling him his 24-year-old daughter had been shot to death nearly a year after he lost his teenage son to gun violence just eight blocks away.\"I got to bury another child?\" he asked at the time at the scene as police combed through the blue Dodge van in which his daughter was shot about 4 a.m. near 55th Street, also known as Garfield Boulevard.\nCurry said he did not know there was a gun at the home where his grandson lived.\n\"He loved everybody, he was happy. He liked to joke like his momma. It's a tragedy,\" said Michael's grandmother, 43-year-old Latonia Mardis.\nPiles of colorfully wrapped packages are under her Christmas tree.\n\"I have Christmas toys ready for Michael.''\nTribune reporters Jeremy Gorner and Michelle Manchir contributed."}