{"uri": "http://www.wflx.com/story/32400652/georgia-officer-shot-multiple-times-identified", "title": "Police: Valdosta shooter wanted suicide by cop", "dct": "Fri, 08 Jul 2016 13:16:00 GMT", "id": "7c34c8bb6df71c60e8a6038406db5e86", "content": "VALDOSTA, GA (WALB) -\nGBI agents said Stephen Beck admitted he called 911 and shot officer Hancock because he wanted the police to shoot him and he wanted to die.\nAgents said Beck told them he suffers from depression and has no hatred for police.\nBeck is in stable condition and remains under medical supervision.\nCriminal charges against Beck for aggravated assault on a police officer are pending. Officer Hancock remains hospitalized and is in stable condition.\nMultiple gunshots were fired at Three Oaks Apartment complex at about 8 a.m. Officer Hancock responded to a property damage call.\n\"The officer called out on the radio screaming for assistance, because he was saying he was shot,\" said Chief Childress.\nMORE: Raw cell phone video of Valdosta shooting aftermath\nHancock returned fire, wounding Beck.\nIt was only until after the incident that investigators learned that Beck was the 911 caller.\nOfficer Hancock and the shooter were taken to different hospitals.\nHancock was said to be recovering after surgery, and Beck was listed in serious condition.\nWATCH: Valdosta Police Chief speaks on shooting [Part 1]\nPolice said officer Hancock was wearing a bullet proof vest and a body camera at the time. Footage from that camera was turned over to GBI.\nWATCH: Valdosta Police Chief speaks on shooting [Part 2]\nOfficer Randall Hancock is a ten year veteran of the department. As Childress briefed the media, he made it clear that the shooting had been an emotional experience for the entire department.\nFriends and neighbors of the shooter said they were stunned Beck would be accused of such violence.\nBeck had moved to Valdosta years prior to the incident from metro Atlanta to check into a live-in treatment center for people with chemical dependencies. Several people who knew Beck said he had turned his life around.\nAt the time of the shooting, Beck lived at the Three Oaks Apartments where the gunfire erupted Friday.\nResidents recalled seeing Beck smoke on his balcony, or occasionally engaging in casual talks with him.\nBefore Beck moved into his current apartment, he had been roommates with other Valdosta residents. One said he last saw Beck at a meeting about three months prior to the shooting and he seemed happier and healthier than ever.\nOne Valdosta business owner said he hired Beck for several months while he was in treatment.\nIt was not immediately known if Beck had an attorney. There was no answer Friday evening at the door of an address listed for Beck's parents in Kennesaw, north of Atlanta.\n(Source: Associated Press)\nCopyright 2016 WALB. All rights reserved."}