{"uri": "http://www.thegazette.com/subject/news/public-safety/linn-county/15-year-old-killed-in-cedar-rapids-shooting-20160319", "title": "15-year-old killed in Cedar Rapids shooting", "dct": "Mon, 21 Mar 2016 13:12:00 GMT", "id": "e97e1246b4090a6d4c08e15f0560f4d8", "content": "CEDAR RAPIDS — For the second time in just over six months, a 15-year-old has been shot and killed in Cedar Rapids.\nThe circumstances of the shooting that led to Senquez Jackson’s death remain under investigation, but Cedar Rapids Police Chief Wayne Jerman said Saturday night the incident does not appear to be an “intentional assault.”\nJerman said investigators have interviewed the person believed to have pulled the trigger. At this time, the shooting is being treated as a death investigation.\n“It’s another tragic loss of life,” Jerman said. “It didn’t need to happen, shouldn’t have happened, but it happened. It’s tragic from all aspects.”\nSenquez Jackson was pronounced dead at 5:24 p.m. Saturday, less than 24 hours after police, fire and emergency responders were called to 1424 Bever Ave. SE for a shooting. That call came in at 5:45 p.m. Friday.\nJackson was found inside the residence suffering from a gunshot wound. Jerman said the shooting took place inside the residence. Officials are working to confirm whether or not Jackson lived at the Bever Avenue residence.\nJackson’s shooting does not appear to be intentional at this time, Jerman said. Authorities are working to determine the facts and circumstances of the incident.\n“There are still more interviews that need to be completed by investigators, and then we need to look at what the facts and evidence are once more of those interviews are completed,” Jerman said. “It does not indicate it was a drive-by or assault.”\nJerman said police have spoken with the shooter and other people inside the residence at the time of the shooting. He declined to say whether the shooter is in custody at this time.\n“He’s been spoken to,” he said, adding that everyone inside the house appears to have been acquainted with each other.\nJackson’s death also marks the second time in just more than six months that a 15-year-old was killed in southeast Cedar Rapids. Aaron Richardson was shot near 16th Street and Park Avenue SE on Sept. 6, 2015. He died of those injuries.\nA then-14-year-old, Robert Humbles was arrested in connection with Richardson’s killing. Humbles originally was charged with first-degree murder in Richardson’s death, but pleaded last December to voluntary manslaughter, reckless use of a firearm resulting in serious injury and going armed with intent.\nHumbles admitted during the plea hearing to shooting and killing after two rival groups had exchanged threats through text messages and on Facebook.\nHumbles faces 25 years in prison but, according to the plea agreement, he is being prosecuted as a youthful offender, which means he will be placed in a youth residential treatment center or more restrictive facility, such as the Eldora State Training School for Boys, until he turns 18.\nJoseph P. Perkins, 24, was found dead at Cedar Valley Townhomes on Feb. 23 after police responded there for reports of multiple gunshots. Another man was also shot, but his wounds were non-life threatening. No arrests have been made in that case."}