{"uri": "http://mobile.nytimes.com/2015/08/03/nyregion/9-injured-in-shooting-in-east-brooklyn.html?_r=0", "title": "9 Injured in Shooting in Brooklyn", "dct": "Sun, 02 Aug 2015 00:00:00 GMT", "id": "57c874247daef4e68166e51c827beeba", "content": "Under the drooping backyard willow tree, relatives and friends gathered. Soon scores of neighbors and others in search of a place to party filled the backyard of the two-story, brick-front Brooklyn home.\nBy the time the gunfire began, around 2:15 a.m. on Sunday, the East New York address — known to local residents for its loud late-night gatherings — was crowded with more than a hundred people, one witness said.\nAt least two gunmen opened fire. Men and women dived to the ground or ran for safety. Nine people were struck, all apparent bystanders to the violence, according to a police official, who requested anonymity to discuss the early stages of the investigation.\nThat no one died in the gunfire — set off by a dispute whose origin remained unclear to investigators as of late Sunday — could be counted as an accident of fate. Two of the victims, a woman, 21, and a 24-year-old man, were struck in the neck. All of the others were hit in the legs.\n“It was a nice family gathering and someone came in and started shooting,” said a woman who emerged from the home at Stanley Avenue and Crescent Street on Sunday but declined to give her name because of the nature of the crime.\nThe burst of weekend violence came after several days of relative calm across the city, with shootings abating when compared with the same period last year. Since June, the Police Department has sent additional officers to the most violent areas of the city in an effort to stem a rise in shootings this year. One of those precincts is the 75th in East New York, where the nine people were shot and where, despite the additional officers, shootings and homicides have been up compared with last year.\nAt the same time, the department’s leaders have focused increased attention on the small number of people believed to be behind the shootings, mostly young men with histories of arrests on gun charges and, in some cases, have been shot themselves.\nA man who had recently been released from prison, for a 2009 shooting, was killed on Saturday in a barrage of at least 31 bullets in the Glenwood Houses on East 56th Street in the Flatlands section of Brooklyn, the police said. The man, Donnell Smith, ran inside one of the buildings around 1:40 a.m. but was shot in the elevator, the police said.\nThe shooting in East New York on Sunday was one of two overnight in which multiple people were struck. In the other, in the Bronx, a 20-year-old man, Christian Garcia, was shot and killed and two other people — a 17-year-old girl and a 25-year-old man — were wounded at a playground at Bolton and Lafayette Avenues around 1:30 a.m., the police said. It was not clear if Mr. Garcia was the intended target.\nNo motive had emerged in that killing, or in another overnight, at the Walt Whitman Houses, near Fort Greene Park in Brooklyn, where a 46-year-old man was shot.\nVideo Surveillance video released by the New York Police Department shows gunmen opening fire at a party in East New York in the early hours of Sunday, injuring nine people.\nThe wounded at the party in Brooklyn included one man and five women who ranged in age from 19 to 37 and were each struck in the leg. A 38-year-old man was shot in the arm and leg. Four other people were hospitalized with cuts and bruises, the police said.\nInvestigators found at least eight shell casings from two guns in front of the home and next door on Stanley Avenue, the police said.\nOne woman appeared to have been struck near the silver sport utility vehicle that she drove to the party; blood pooled beside it. “She’s in the I.C.U.,” said a man who identified himself as her godfather but declined to give his name. “She has a bullet in her neck.”\nDetectives were combing through video from nearby cameras, including at a corner bodega, 899 Deli & Grill. An overnight worker there, Mahdi Alabdi, 52, said he heard roughly 10 shots and saw “maybe 200 people” scattering away from the scene.\nVideo released on Sunday by the police showed the harrowing moment when two men approached the home and began firing in the street.\nSean McClinton said he stepped outside his home at Stanley and Wortman Avenues around 2 a.m. on Sunday to smoke a cigarette and heard more than 10 loud pops. A short time later, he said, officers had two young men in handcuffs on the ground near his doorstep.\n“Sir, sir, please film us,” Mr. McClinton said one of the men told him. “They’ve got the wrong people.”\nThe gathering had been held in memory of a young child who neighbors said died of health problems. The police said there did not appear to be a connection to gang activity. “All it takes is for the wrong person to show up,” the official said.\nNeighbors described gunfire as a regular occurrence in the area, which includes the Pink Houses, a public housing development. “All the time you hear shots, nothing strange,” said Miguel Mendez, 65, who has lived on Stanley Avenue for 10 years.\nThe house where shooting took place on Sunday was known for parties. “Noise till 2, 3 in the morning,” said a woman who lives in the Pink Houses and gave only her first name, Maritza. She said officers “never come” in response to noise complaints.\nShe and a friend, Alyssa Martinez, 45, were heading to church “to pray for the community because God is the only one who could save us,” Ms. Martinez said. But they could not get to their car because of the police presence. “The police? They don’t care,” Ms. Martinez said."}