{"uri": "http://www.wsoctv.com/news/local/child-shot-outside-of-uptown-charlotte-cmpd-says/466119675", "title": "Police search for man accused of shooting 5-year-old girl near uptown", "dct": "Fri, 11 Nov 2016 22:23:00 GMT", "id": "9fc54d7f8d5cf51fc9f42c328198662e", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCHARLOTTE, N.C. - Charlotte-Mecklenburg police identified the man accused of shooting a 5-year-old girl inside a car near uptown Charlotte.\nAuthorities said Patrick Glenn fired the shot Thursday night on College Street that hit the little girl. He is considered armed and dangerous, police said.\nDetectives have signed warrants for Glenn's arrest and have requested assistance from the Violent Criminal Apprehension Team in finding him.\nOfficers told Channel 9 that around 9:30 p.m. the girl was in a car with three adults and another child on 12th Street and College Street.\nPolice said a silver Nissan Sentra pulled up alongside the car and opened fire.\nThe 5-year-old girl, Nadia, was asleep in the backseat of the car when the bullet hit her under the shoulder.\n\"Someone pulled up beside us and just started shooting in the car,\" said the Nadia's mother, Carrie Gayle.\n\"Did you know right away that your daughter had been hit?\" Channel 9 reporter Mark Becker asked.\n\"No I did not. I thought everyone was OK, a friend of mine checked her and found that she'd been shot,\" Gayle said.\nThe driver of the car that the child was in, pulled into a 7-Eleven less than a mile away and called 911.\nClick play on video below to hear 911 call:\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nThe child was alert and talking when she was taken to the hospital from the scene at the 7-Eleven on the corner of Dalton Avenue and North Tryon Street, Charlotte-Mecklenburg Police said.\nNadia underwent emergency surgery and was in stable condition Friday morning.\nPolice think a man in the child's car and Glenn know each other and that an issue between the two flared up earlier in the day. When they ran into each other later on the road, the suspect started shooting.\nPolice talking with any witnesses and collecting evidence. Condition of child- life threatening injuries. @wsoctv pic.twitter.com/Ga3yQYXK52\n— Alexa Ashwell (@AlexaWSOC9) November 11, 2016\n\"We're going to work it until we exhaust all of our leads and find some justice for the little 5-year-old girl.\" said Capt. Dave Johnson.\n\"You never would think that nothing like this would happen to you and your children. I'm just thankful that she's alive, and she's stable and she's going to make it through,\" Gayle said.\nAnyone with information on Glenn's whereabouts is asked to call 74-432-TIPS. The public can also call Crime Stoppers at 704-334-1600.\nRead more top trending stories on wsoctv.com:\n© 2017 Cox Media Group."}