{"uri": "http://ksn.com/2013/09/22/53088-autosave/", "title": "One dead, six hurt in Wichita’s Old Town shooting", "dct": "Sun, 22 Sep 2013 02:47:00 GMT", "id": "0a6a8d7422cdaa07b97cd01740079a49", "content": "[lin_video src=http://eplayer.clipsyndicate.com/embed/player.js?aspect_ratio=3×2&auto_next=1&auto_start=0&div_id=videoplayer-1379953438&height=400&page_count=5&pf_id=9623&show_title=1&va_id=4369553&width=640&windows=2 service=syndicaster width=640 height=400 div_id=videoplayer-1379953438 type=script]\nWICHITA, Kansas — Hundreds of people were getting ready to call it a night in Wichita’s Old Town when someone fired multiple shots in the 100 block of N. Mead.\nSeven people were shot, leaving one person dead, and the suspect still on the run.\nHome to a cluster of bars and restaurants, Wichita’s Old Town became part of a crime scene Sunday morning.\n“We have a total of seven people that were shot,” said Sgt. Scott Brunow, Wichita Police Department.\nPolice taped off the 100 block of N. Mead to investigate the overnight shooting that left a 25-year-old man dead and six others with gunshot wounds.\n“Around 2 o’clock I was walking home from the bars and I heard commotion,” said Bryan Butler, Old Town resident. “I just thought it was typical drinking activities, but never thought anything of it.”\nInvestigators say the shooting happened right when Old Town bars were getting ready to close.\nOfficers directed a crowd of people when they heard at least 10 rounds of gunshots.\n“Three victims were shot and they ran to Rock Island where they contacted officers,” said Sgt. Bob Gulliver, Wichita Police Department. “They were transported to the hospital.”\nOfficers rushed over to N. Mead to find three more victims at the scene.\n“Several were transported by private vehicles to hospitals, three on scene,” said Sgt. Brunow. “A seventh victim did show up at an area hospital this morning that had been shot as well.”\nPolice identified the seven victims as all males between the ages of 25 to 35 years old.\n25-year-old male, pronounced dead at the hospital\n26-year-old male, listed in serious condition\n28-year-old male, listed in fair condition\n25-year-old male, listed in fair condition\n27-year-old male, treated and released from hospital\n(age and condition unknown)\n(age and condition unknown)\nIt’s still unclear whether the men and suspects knew one another or what led up to the incident.\n“I’ve been told to stay away from certain areas, but this is really the first time that I’ve experienced that kind of situation,” said Butler.\nThe entertainment district has seen it’s fair share of violent crimes in the past couple of years, prompting police to beef up their presence and patrol in Old Town.\n“I’ve been down here eight years now essentially doing the same thing and it’s been fairly effective,” said Sgt. Gulliver. “I don’t think there’s anything different that we could have done.”\nPolice did talk to several witnesses at the scene, but they have not released any details on the suspect or a motive.\nAt this time they’re looking into the possibility that this may have been gang related.\nAnyone with information is asked to call 911.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}