{"uri": "http://www.kansas.com/news/article1123866.html", "title": "One killed, six injured in Old Town shooting", "dct": "Sun, 22 Sep 2013 08:12:00 GMT", "id": "3fabcb2957cc79e0e145b0e097736799", "content": "Fighting in Old Town early Sunday morning escalated into gunfire that left one person dead and at least six injured, according to Sgt. Scott Brunow of the Wichita Police Department.\nSeveral gunshots were heard by Wichita police officers in the 100 block of North Mead in Old Town shortly before 2 a.m. on Sunday, Brunow said.\n“They responded and found six victims that had been shot,” Brunow said. “Several were transported by private vehicles to hospitals. A seventh victim did show up at an area hospital that had been shot, as well.”\nA 25-year-old man died from injuries from the shooting, Brunow said. Two other victims had been listed in serious condition but were later upgraded.\nVictims ranged in age from 25 to 35 years old.\nParking lots in the 100 blocks of Mead and Rock Island off Douglas just west of Washington were roped off Sunday morning with crime tape. Police vehicles were also in the area most of the morning as officers combed the parking lots for evidence. Pieces of clothing and bloodstains were visible in the lots.\nThe incident is one in a string of violent occurrences at Old Town over the past couple of years.\nThe acts of violence have typically occurred shortly after 2 a.m., when the bars close for the night.\nIn March last year, five people were injured and a sixth man killed in an officer-involved shooting at a parking garage adjacent to the Hotel at Old Town. That shooting happened after a concert at Doc Howard’s Lounge as people were leaving.\nThe Eagle reported at the time: “The 22,000-square-foot building at 252 N. Mosley has been the center of several violent incidents over the past decade. Most of them occurred around closing time for the clubs operating in the building. They include a shooting in the parking lot in 2003 that killed a 25-year-old man; a shooting in the parking lot in 2006 that wounded six people; and a stabbing outside the building in 2008 that critically injured two men and a woman in their 20s.”\nIn response to the shootings, the Old Town Association hired more security and installed more security cameras. The Wichita City Council changed an ordinance to prohibit loitering between midnight and 6 a.m. and police have beefed up their patrols in Old Town on the weekends.\nCharlie Claycomb, president of the Old Town Association, could not be reached Sunday for comment.\nThe shootings Sunday morning occurred directly north of The Wichita Eagle in the 800 block of East Douglas.\nAt that time of the morning, the only employees on site are working toward the back of the building where the presses are located.\nMike Hall, vice president for operations at The Eagle, said no staff reported hearing or seeing anything. But a few months ago, Hall noted, there was a shootout in The Wichita Eagle parking lot.\n“That’s when we decided we needed security,” Hall said.\nMore details are expected to be released at a police and media briefing Monday."}