{"uri": "http://www.democratandchronicle.com/story/news/2015/12/03/rochester-tops-upstate-mass-shootings/76715490/", "title": "Rochester tops upstate NY in mass shootings", "dct": "Thu, 03 Dec 2015 00:00:00 GMT", "id": "a10c6ec2c08ef5feb6582c2b66b016d5", "content": "The Rochester area's four mass shootings in 2015 put Monroe County at the top of the list of upstate regions, according to data from shootingtracker.com.\nBrooklyn, with its five mass shootings in which five people died and 25 were wounded, is the only one of New York City's boroughs or any other region of the state to challenge Rochester's four.\nRochester's mass shootings resulted in six dead and 18 people injured — the highest number of dead for any community in the state. At the same time, Rochester's overall homicide rate in 2015 is not abnormally high. And \"mass shooting\" is in the eyes of the beholder.\nThe website defines a mass shooting as \"four or more people shot in one event.\"\n\"The only requirement is that four or more people are shot in a spree or setting, likely without a cooling off period,\" the site reads. \"This may include the gunman himself (because they often suicide by cop or use a gun to kill themselves to escape punishment), or police shootings of civilians around the gunman. The reasoning behind the latter being that if the shooter is arrested, he will often be charged with injuring people the police actually shot, as that is a foreseeable result of a shooting spree.\"\nThe Rev. Lewis Stewart, president of the United Christian Leadership Ministry, said he was surprised Rochester was at the top of the list in the state, but placed the blame at the feet of the proliferation of guns in the United States and \"a disconnect, a devaluation of human life.\"\n\"A lot of these guns are stolen ... we have to head off this illegal gun trafficking that is going on in this country,\" Stewart said.\n\"This shows you that both the community and the police have to put their heads together and do a lot more teamwork in trying to head off this influx of guns and the killers using them against each other and taking each other's lives.\"\nJohn Klofas, a criminal justice professor at Rochester Institute of Technology, said the city has suffered through a difficult year (35 homicides and 208 shootings as of Thursday) but said the term \"mass shooting\" can conjure images of the Sandy Hook massacre and Columbine, which is not what has happened here.\n“There is a shared notion of mass shootings where the victims and the suspects don’t necessarily know one another on a personal basis so the motives are more general and less defined,\" Klofas said. \"Usually when people think of these things, they think of Columbine or the movie theater or something like that. But it’s hard to define things by those relationships, so a count or a threshold is the appeal to measuring this stuff in some way. But I don’t think the Rochester shootings have born any resemblance to what we usually think of in the Colorado movie theater shooting or any of these, including San Bernadino.\"\nRochester is on pace to reach shooting numbers of 2013 (228) and 2012 (218), after seeing a drop in 2014 (187).\nHomicides are about average at 35. There were 31 in 2014, 42 in 2013, 36 in 2012, and 31 in 2011.\n\"I think Rochester has not had a big history with these things (mass shootings),\" Klofas said. \"But this has been a year where we’ve seen a number of these and some bad ones.”\nRochester Police Chief Michael Ciminelli said his department treats each case individually, believing that this year isn't abnormal or unusual.\n\"I don’t think there’s anything about the city of Rochester or the Rochester community that makes these things happen,\" Ciminelli said. \"There are a lot of conditions and circumstances that lead to this.\n\"It’s just as hard as to say why was the incident in San Bernardino yesterday as opposed to somewhere else; or why was there a school shooting in Newtown; why did it happen in Columbine and not somewhere else. We try to understand the factors that are leading to violence. We’re very much focused on early identification of the disputes that result in violence and work on intervention and prevention. That’s how we’re focused.\"\nRochester police said the availability of guns, which can quickly escalate disputes, and gang activity have played a role in the increase in mass shootings.\n\"We have noticed that the gang activity is causing a lot of disputes and violence,\" Rochester Police Captain Korey Brown said. \"It’s between one gang and another gang. We’ve been aggressively going after different groups that are hanging out and that are causing a lot of our violence. A lot of the same people are causing our violence. A lot of them have been picked up and arrested since then. We’re actively going after other groups that are causing violence in the city.\"\nRochester Police Commander Joe Morabito said each of the city incidents share similarities.\n\"The common denominator in these mass shootings that we’ve had in Rochester, all three of them were large groups, a person with a dispute, and indiscriminate gunfire,\" he said. \"Two of them are directly related to unsanctioned house parties. Since two of the incidents that occurred were house parties, we’ve been aggressive in shutting down and not allowing these unsanctioned, spur-of-the-moment house parties. We’ve tried to attack the root of the problem.\"\nHere are the four mass shootings in Monroe County in 2015:\nApril 25: A shooting spree in a crowded Gates bar claimed seven victims, one of whom died. David Alligood, 31, of Rochester, has been charged with opening fire in the Gates Pub shortly before last call on a Saturday morning. He killed his apparent intended target, Ricky C. Jones of Rochester. Bullets from Alligood's handgun also struck six other bar patrons, police said at the time. He is awaiting trial.\nMay 16: Four men were shot near 188 Lewis St. and all four went in private vehicles to the hospital. Rickey Harvey, 29, Patrick Carter, 34, Joel Allen and Darelle Scott, 26, were were shot at least once in the upper body.\nAug. 19: Six people have been indicted in connection with the Aug. 19 mass shooting outside the Boys & Girls Club on Genesee Street that killed three and injured four others. Raekwon Manigault, Johnny \"JJ\" Johnson and Jonah Barley were killed by gunfire.\nSept. 9: Two people were killed and four others wounded in a shooting at a house party on Woodward Street William James, 30, of Rochester has been charged with second-degree murder. Thirty to 50 people were in the house during the shooting and police had been at the house two hours prior to the shooting.\nBuffalo had two mass shootings in 2015 with two fatalities and seven wounded. Syracuse had one with four injured. Albany and Binghamton had none. Newburgh had one that left five wounded."}