{"uri": "http://www.wmcactionnews5.com/story/30883152/13-year-old-dies-after-accidental-shooting-suspected-shooter-killed", "title": "13-year-old dies after accidental shooting, suspected shooter killed", "dct": "Tue, 05 Jan 2016 02:00:00 GMT", "id": "d403154a5cd73b3b40284d5b284dbeb1", "content": "MEMPHIS, TN (WMC) -\nThree people have been shot and two are dead after a pair of shootings. One of those shootings was accidental.\nAccording to police, a man accidentally shot a gun through the floor. On the floor below, the bullet hit a 13-year-old girl. The girl was also holding a 12-week-old; the bullet grazed the baby.\nThe 13-year-old was taken to Le Bonheur Children's Hospital in critical condition; the baby was taken there in non-critical condition.\nThe 13-year-old later died from her injuries. She was later identified by Memphis police as Letara Jones.\nJones was a student at Humes Prepatory Academy, a public charter middle school in North Memphis. According to a GoFundMe page set up for Jones by her school's staff, she was a sixth grader and a scholar.\n\"LeTara Jones was a scholar who truly was committed to bettering herself and had strong relationships with many of our staff and scholars.\"\nWitnesses said a 20-year-old man, who police later identified as Daniel Lusk, was upstairs playing with a gun before accidentally pulling the trigger.\nAfter the accidental shooting, another person went upstairs to locate the person that fired the shot. That person shot and killed Lusk while he tried to run away.\nBoth shootings occurred in the 1400 block of Briercrest Lane at the Corning Village Apartments.\n“Bullets don't have any name on them,” Ronald Kent said.\nKent lives nearby and understands how tragic this can be for the family.\n“I just brought the blanket out,” he said. “I just covered him up and he was gone. There was nothing else I could do.”\nPolice said everyone involved knew each other, but it is not clear if they are from the same family.\n“Back in the day, we used to fight,” Kent said. “Now a lot of people got guns and they're not supposed to have them.”\nPolice have not found the second shooter. They are working to get a description of the suspect.\nCopyright 2016 WMC Action News 5. All rights reserved."}