{"uri": "http://www.montgomeryadvertiser.com/story/news/crime/2014/12/04/doe-lawsuit-city-heading-trial/19908277/", "title": "Doe B lawsuit against city heading to trial in 2015", "dct": "Thu, 04 Dec 2014 00:00:00 GMT", "id": "4735b99b6098dee17aab08760e36adf5", "content": "A trial to determine whether the city of Montgomery and the management at Centennial Hill Bar and Grill were complicit in the shooting death of rapper Doe B last year is set to begin next spring.\nA trial date has been set for April 20, 2015, regarding a consolidated lawsuit from four plaintiffs, including the estate of Glenn \"Doe B\" Thomas, a rapper who was killed during a shooting at Centennial Hill on Highland Avenue in Montgomery on Dec. 28, 2013. The trial was originally set to begin next week, but was recently continued to the April term. Circuit Judge Truman Hobbs will preside over the hearing.\nMichael Strickland, attorney representing Thomas' estate, said he and attorney Dwayne Brown are also representing Keldric Landon, 23; Clarence Young Jr., 20; and Ferro Bennett, 20; all of whom were injured during the shooting. In addition to Thomas, Kimberle Johnson and Timnorious Hamilton were also fatally wounded in the shooting.\nJason McWilliams and Darius Thomas, both 26, were later arrested and charged with three counts of capital murder in the case. The case was turned over to a grand jury in January 2014, but no decision has come down on whether to indict them or not.\n\"The only thing that I can say at this point is that through discovery, there is still a lot of investigation that is taking place and new defendants are being discovered, which will be added to the complaint,\" Strickland said.\nOther people who were injured in the shooting have also filed complaints against the city, including the estates of Johnson and Hamilton, as well as Richard Davis, who was injured in the shooting.\nHowever, Frank Wilson, attorney for Johnson's family, said that with the ongoing capital murder case, his lawsuit would have to wait.\n\"Here, we have a capital murder case, so in my mind, the case is pretty much on hold, pending some determination in that criminal case,\" Wilson said.\nIn response to the shooting, the city shut down Centennial Hill last January.\nZachary Collins, attorney for Davis and Hamilton's family, was not immediately available for comment Thursday, as well as Montgomery City Attorney Kim Fehl."}