{"uri": "http://www.rnrfonline.com/developing-deputy-shot-during-incident-involving-dog-attack/", "title": "DEVELOPING: Deputy Accidentally Shoots Self During Vicious Pit Bull Attack", "dct": "Sat, 26 Nov 2016 12:46:00 GMT", "id": "dfe806010a781ff639f99cacd9beb9a8", "content": "UPDATE: 6:04 P.M. – A spokesperson for the Pasco County Sheriff’s Office has now confirmed that a female Deputy was attacked by a Pit Bull and subsequently sustained a gunshot wound to the finger.\nSpokesperson Amy Marimac says the Deputy’s injuries are not severe and that she will make a full recovery.\nMaricmac says the Pit Bull caused serious injuries to the victim prior to her arrival. When she tried to capture the Pit Bull, she was attacked, leaving her no choice but to shoot the animal. The dog did succumb to its injuries and died at the scene.\nThere is no further information on the male victim at this time.\nUPDATE: 2:28 P.M. – RNRF has received additional information regarding what led up to the Deputy being shot.\nAccording to sources, the Deputy was attacked by what is reported as being a large mixed-breed Pit Bull, estimated at weighing nearly 100 lbs.\nThe dog jumped on top of the Deputy which led to him/her firing at least one shot, striking the dog and the Deputy’s other hand.\nThe Deputy has been transported to a local trauma center for treatment.\nHUDSON (PASCO) – Information is still developing, but there are unconfirmed reports that a Pasco County Sheriff’s Deputy has been shot, while attempting to detain a dog after it mauled a victim.\nAccording to our sources, Deputies responded to 7031 Oakley Ave, after reports that a man had suffered severe bites from a dog. Sources say the responding deputy may have shot his/her own hand while attempting to control the animal.\nThe condition of both the Deputy and the bite victim are unknown at this time.\nWe will bring more on this story as it develops.\nThis material may not be published, broadcast, rewritten, or redistributed. ™2013 – 2016 Real News Real Fast, Inc.\nRNRF reserves the right to edit or delete any comments without notice due to;\n1. Comments deemed to be spam or questionable spam\n2. Comments including profanity\n3. Comments containing language or concepts that could be deemed threatening"}