{"uri": "http://guncrisis.org/2013/04/10/quadruple-shooting-sets-off-violent-night-in-philadelphia/", "title": "Quadruple shooting sets off violent night in Philadelphia, leaving two dead and six wounded", "dct": "Wed, 10 Apr 2013 00:00:00 GMT", "id": "23201286e9b21206ce8d53e714d6eed8", "content": "The sun sets over West Somerset Avenue Tuesday night, as neighbors gather around the scene of a shooting in which one woman was killed and three men were wounded just before 6 p.m. in the Kensington section of Philadelphia. Photographs for the Gun Crisis Reporting Project by Joseph Kaczmarek.\nOne man and one women were killed, and six more men were wounded in five separate shooting incidents across Philadelphia in the span of about six hours Tuesday.\nA gunman opened fire at Somerset and Lee Streets, where neighbors said a large crowd had been enjoying the warmest day of 2013 before the gun violence broke out.\nA 21 year-old woman was shot twice in the chest and taken in a private auto to Episcopal Hospital, where she was pronounced dead shortly after 6 p.m., according to Philadelphia Police Chief Inspector Scott Small.\nwalked with Philadelphia CeaseFire last summer.\nThe wounded men, ages 18, 21 and 35, were reported in stable condition at Temple University Hospital. According to philly.com, each had suffered multiple gunshot wounds to their legs and abdomen.\nInvestigators told NBC10 there were hundreds of people outside when the Kensington shooting occurred. Police said several fights had broken out earlier, according to an Associated Press report.\nPolice are looking through surveillance video, according to NBC10, and searching for one shooter and possible accomplices. They described the shooter as a man with a light complexion, about 5 feet 4 inches tall, and wearing a dark tee shirt and jeans, according to philly.com. He was last seen running west on Somerset, and police were unsure which, if any, of the victims was the target.\nOfficials told NBC10 that at least seven shots were fired, based on ballistic evidence at the scene. Officials have not released the names of the victims, according to philly.com, and told 6ABC that there is no word on motives.\nPhilly.com is now identifying the murdered woman as Amanda Martinez, 20, of Luray Street near Front Street in the Feltonville section of the city.\n(View Philadelphia gun violence outbreak, 04.09.13 in a larger map.)\nAbout an hour after the multiple shooting, a 30-year-old man was shot in the head on the 100 block of West Raymond Street in Feltonville. He was also reported stable at Temple.\nShortly before 8 p.m., a 47-year-old man was shot in the leg in the area of Girard Avenue and North Taney Street, in the Fairmount section of the city. According to a CBS3 report, he was reported in stable condition with a thigh wound at Hahnemann University Hospital.\nAnother man was pronounced dead at the Hospital of the University of Pennsylvania after he was shot three times in the chest at 54th and Chestnut Streets in West Philadelphia at about 11 p.m. According to philly.com, the 18-year-old victim was riding his bicycle when he was shot.\nJust before midnight, another 18-year-old man was shot twice in the face on the 600 block of North 34th Street in the Mantua section of the city. According to CBS3, police say the victim remains in very critical condition and was paralyzed from the neck down.\nNo one has been arrested in connection with the five shooting incidents that impacted five different sections of the city last night, according to NBC10.\nThree people were killed and eight more were wounded — three critically — in 11 shooting incidents reported across Philadelphia last weekend.\nPlease share your ideas to stop the shooting with our community by using the #phillypeaceplan hash tag when communicating on social media: http://guncrisis.org/phillypeaceplan/\nIf you want to get involved in gun violence reduction in Philadelphia, please consider volunteering with or donating to one of the organizations under our Network tab. If you would like us to add your group to our list, please email us at info@guncrisis.org.\nSlideshow: More photos from the scene\n[slideshow_deploy id=’10361′]\nThe Gun Crisis Reporting Project is an award-winning, independent, nonprofit journalism community striving to illuminate the epidemic of homicide by gunfire in Philadelphia — and find solutions.\nBut we need your help. Click to see how your tax-deductible contribution can help our volunteer staff."}