{"uri": "http://www.ktvb.com/story/news/local/2015/10/19/family-member-calls-saturday-night-shooting-an-accident/74240790/", "title": "Family member calls teen's shooting an accident", "dct": "Tue, 20 Oct 2015 00:00:00 GMT", "id": "aaf22e96556314546ebe5513ea4dd87d", "content": "MERIDIAN -- A Meridian family is mourning the loss of their 15-year-old son. A family member says he was accidentally shot and killed by his best friend. The family member has identified the victim in Saturday night's shooting as 15-year-old Tristan. Tristan was a sophomore in high school at Meridian Academy.\n\"He was amazing. He was strong willed. He was a family person and everybody loved him. This really affected all of us because he didn't get to live a life,\" Tristan's cousin Sidney Fenton said.\nTristan's life was cut short after what Fenton is calling an accidental shooting by someone he called his \"brother.\"\n\"He was a part of our family,\" Fenton said. \"He was like another son to my aunt. We're never going to blame him for what happened. We can't, he's a part of the family. So I think it's hard, not only did we lose one, but we're also losing another.\"\nMeridian police say they responded to an apartment complex on the 2300 block of E. Franklin Road on Saturday night, after a call of a possible suicide. Upon further investigation they learned the shooter, 18-year-old David Provencio, pointed what he thought was an empty gun at Tristan and pulled the trigger.\n\"I think he's hurt. I think he's slowly killing himself inside,\" Fenton said. \"Right now he killed his best friend. He feels that his best friend's family hates him. How could you live with that?\"\nIt's something Tristan's cousin believes is punishment enough.\n\"He had an accident, everybody has accidents. Everybody makes mistakes,\" Fenton said. \"So why can't this mistake be forgiven?\"\nProvencio appeared via telecast in an Ada County courtroom Monday afternoon where prosecutors say that night Provencio, along with other witnesses, lied to police.\n\"Indicating that the victim had shot himself, but additional investigation led detectives to further information and ultimately the defendant did admit to shooting the victim,\" said Kai Wittwer with the Ada County Prosecutor's Office.\nProsecutors say Provencio does have pending previous charges out of Canyon County that include aggravated assault and use of a deadly weapon.\nThe judge set Provencio's bond at $500,000. He is charged with involuntary manslaughter.\nHe's due back in court on Nov. 2.\nFamily members have set up a GoFundMe account to raise money for Tristan's funeral. They told KTVB the service is planned for Saturday."}