{"uri": "http://www.al.com/news/birmingham/index.ssf/2016/08/4_guns_60_pieces_of_evidence_r.html#incart_river_home", "title": "4 guns, 60 pieces of evidence recovered at Brighton park where shooting killed 1, injured 6", "dct": "Mon, 29 Aug 2016 17:01:59 GMT", "id": "9d08ffab391d84c0cea981c08a7ead5a", "content": "(ATF/Erin Edgemon)\nOne person is being questioned and multiple others sought after the Saturday-night shooting at a Brighton community event that killed one man, and injured six more victims, including a young girl.\nBrighton police Chief Ray Hubbart said Sunday evening that the person of interest was taken into custody at the scene of the shooting at \"Love Thy Neighbor Day,'' an annual event in the western Jefferson County town. The number of reported victims has fluctuated, but the chief tonight said they have located more surviving victims to bring the total number of wounded to six.\nThe man killed was identified by family members as Antonio Hinkle, 32, a father of three, who spent the day cooking food for his fellow Brighton residents. \"He was an innocent bystander,'' Hubbart said.\nOf the surviving victims, one is a mother and her young daughter - the only child wounded in the shooting - who was grazed. The majority of the victims have already been released from the hospital. At least one underwent surgery, however, and remains in the hospital. Investigators have not yet been able to interview him.\nWitnesses estimated more than 700 people were celebrating \"Love Thy Neighbor Day\" near the community center on Seventh Avenue when gunfire erupted at around dusk. \"It was chaos,\" said event organizer Isaac Bruister, associate minister of Friendship Baptist Church. \"People were running everywhere.\"\nOne person was killed and four others were injured in a Saturday evening shooting at a Brighton park, according to Birmingham police.\nThe Jefferson County Sheriff's Office, Hueytown police, Birmingham police and Bessemer police all responded to the scene to help Brighton officers. Hubbart said the day-long event had gone smoothly, and it was only as it began to come to a close that problems started. \"We know there was a fight, and then the shooting began,'' he said.\nThe chief said police believe there were multiple shooters, and investigators recovered four handguns that had been dropped at the scene. The federal Bureau of Alcohol, Tobacco, Firearms and Explosives is working to trace those weapons. ATF officials were also back out at the scene Sunday, and are using K9s to help recover shell casings. ATF spokesman Michael Knight said the shell casings, in part, will determine how many guns were used in the scene.\nCrime scene investigators with the sheriff's office already recovered more than 60 pieces of evidence from the scene, he said. It wasn't clear how many of those evidence pieces were shell casings, but authorities and witnesses estimate more than 40 rounds were fired.\nA vigil was held at the park Sunday evening, and at least one of the victims was in attendance. Police said no disturbances were reported during that vigil.\nHubbart said the one person detained will be questioned by Brighton police and sheriff's investigators. \"He will be interviewed and we will determine if charges will be filed,'' after conferring with Bessemer Cutoff District Attorney Bill Veitch.\n\"I really appreciate the response of the sheriff's office and Brighton police,'' Veitch said Sunday night. \" A lot of resources are committed to this.\"\nHubbart said he police are asking that anyone with information come forward. He said there were a lot of people in the park with cell phones, and detectives need to see photos and video of the shooting if that footage exists. \"It's just sad when you try to bring the community together and this happens,'' the chief said. \"Everything was going so well.\"\nAnyone with information, photos or video is asked to call Brighton police at 205-425-8934 or the sheriff's office at 205-325-1450."}