{"uri": "http://wkrg.com/2015/12/25/shooting-at-wynnsong-16-in-mobile/", "title": "At Least 4 Injured in Shooting at Wynnsong 16 in Mobile", "dct": "Fri, 25 Dec 2015 22:42:00 GMT", "id": "98e0488f543c33a9ce6aecf58c2af198", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nUPDATE SATURDAY 5:45 AM\nMobile Police send out a news release with a little more information on the victims in this case. It reads in part:\n“A male juvenile and a female juvenile, both 14 years of age, were shot in the leg. The other two victims were adult males (18 years of age); one was shot in the abdomen, hip and thigh and the other was shot in the abdomen. All were transported to a local hospital with injuries that are not life-threatening.”\nUPDATE 12:11 a.m.— According to MPD Spokesperson Charlette Solis, police are searching two shooters who fled on foot from the Wynnsong 16 movie theater after shooting and injuring at least four people.\nMPD originally reported that there were three victims; two 14-year-olds and an 18-year-old. However, they confirmed that a fourth victim was driven to the hospital in a private vehicle.\nThree of the victims are male. One is female.\nPolice believe one or both of the shooters may be juveniles, but they are not sure at this time.\nMultiple witnesses said they saw an argument break out in the parking lot, and that’s when they heard the gunshots.\nUPDATE 11:56 p.m.– Police tell us two 14-year olds and an 18-year-old were wounded. One person was shot in the foot, another in the leg and the third in the stomach.\nAuthorities say the wounds did not appear to be life-threatening\nThe shooter, believed to be a juvenile, is not in custody.\nAnyone with information should call the Mobile Police Department.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}