{"uri": "http://www.azcentral.com/story/news/local/phoenix-breaking/2016/07/05/child-shot-two-killed-laveen-shooting/86701514/", "title": "Shooter who killed 2, wounded 6 at Laveen mobile-home park sought", "dct": "Tue, 05 Jul 2016 00:00:00 GMT", "id": "3d693d12760896e074e21c78c380592a", "content": "A man and a woman were fatally shot and six others, including a 2-year-old child and three others younger than 18, were wounded in a common area of a trailer park in the Laveen area as they gathered for a Fourth of July celebration, authorities said.\nThe shots were fired from a semiautomatic weapon by someone walking by at about 10:30 p.m. Monday, Maricopa County Sheriff Joe Arpaio said at a news conference Tuesday morning.\nThe shooter remains at large, Arpaio said.\nMaricopa County Sheriff's Office deputies identified the shooting victims as Armando Cardona, 45, and Naome Innis, 35. The 2-year-old was shot in the arm and transported to a hospital in stable condition, according to Sheriff's Office and fire officials. The other three juveniles suffered non-life-threatening injuries, Arpaio said.\nMCSO deputies and Phoenix firefighters were called to the 4000 block of West Southern Avenue at about 10:30 p.m., according to the Phoenix Fire Department.\nThe Southern Meadows mobile-home park common area is just off Southern Avenue. Sheriff's investigators were interviewing potential witnesses, some of whom were unclear whether they had heard gunshots or fireworks, Arpaio said.\nNo information was available about a possible motive, Arpaio said.\n\"We need some help to solve this vicious incident,\" Arpaio said.\nHe asked that anyone with information to call the Sheriff's Office at 602-876-1011.\nThe shooting occurred outside Phoenix city limits, but Arpaio said his investigators were in contact with Phoenix police to see if there were any connections between this shooting and others in the area.\nRudy Navarrette, 60, said one of the boys shot would come over to his residence and mow his lawn.\n\"It brings tears to my eyes,\" Navarrette said. \"(The boy) upkeeps my yard, he comes here three times a week.\"\nHe said it was heartbreaking to see his neighbors shot and killed. Cardona and Innis had been socializing at his place a couple of nights before the shooting.\n\"They were just there at the wrong time,\" he said.\nVanessa Vargas, 29, said the shooting made her cautious about her community.\n\"I hate having my kids come outside now,\" Vargas said. \"I don't like them playing out here ... It's horrible.\""}