{"uri": "http://www.courierpostonline.com/story/news/crime/2016/08/26/camden-girl-shot-sidewalk/89438782/", "title": "Family member: Girl shot in Camden dies", "dct": "Fri, 26 Aug 2016 00:00:00 GMT", "id": "f71801de674e9f63e1b6af394f9c66b9", "content": "CAMDEN - An 8-year-old girl shot in the head while she played on the sidewalk Wednesday night has died, according to family members.\n\"My baby Gabrielle Hill Carter is no longer with us,\" the girl's father, Will Phillips of Camden, said on his Facebook page Friday evening.\nA law enforcement office has confirmed the child's death.\nThe girl, known as Gabby, was shot around 8:30 p.m. Wednesday on the 900 block of South 8th Street in the Bergen Square neighborhood. The child was with a group of people across from her home when gunmen opened fire on someone in her vicinity.\nOne bullet struck Gabby, according to Camden County Police Chief Scott Thomson. The shooters remained at large Friday.\nNext-door neighbor Evinea Hall on Thursday said gunmen fired from an alley next to the child's home as part of ongoing \"drug wars.\"\nGabby clung to life after being taken to Cooper University Hospital, Camden, according to a Facebook post from Tasha Mack Thornton, a Paulsboro woman who identified herself as the girl's aunt.\n\"She fought the good fight,\" Thornton said of the girl, who was about to begin third grade at Camden Community Charter School.\n\"Our Gabby baby is an angel now,\" she said, indicating the girl died around 6 p.m.\nA candlelight vigil was held outside Gabby's house at 7 p.m. Saturday, according to the girl's father.\nOn Friday night, the flashing lights of a police command vehicle washed over a small memorial of stuffed animals, candles, flowers and balloons outside the child's darkened home.\nA fluffy bear appeared to look through a porch railing toward the sidewalk where Gabby was shot. Balloons fluttered from a nearby \"Safe Corridor\" sign, intended to signal a secure route for students going to and from the city's schools.\n\"This is devastating,\" said Robin \"Auntie\" Merlin, a community volunteer who cut short a Wildwood vacation Friday to help Gabby's family.\n\"We've got to watch our kids and keep them near you all the time,\" said Merlin, looking sadly at the memorial.\nOn nearby Spruce Street, a mother who declined to give her name watched two boys, ages 2 and 5, ride a small teeter-totter outside their home around 9 p.m.\n\"It makes you feel worried,\" she said of Gabby's shooting. \"But at the same time, you've got to have faith in God.\"\nAuthorities on Saturday increased to $24,000 a reward for information leading to the arrest and conviction of Gabby's shooter.\nAnyone with information is asked to call Prosecutor's Det. Sherman Hopkins at (856) 225-8623 or Camden County Police Department Det. Michael Ross at (856) 757-7420.\nPeople living near the girl's South 8th Street home have expressed sorrow over the child's death, but also noted gunshots are often heard in the troubled neighborhood.\nA majority of Camden's confirmed homicides this year –18 out of 31 slayings – have occurred within a mile of the girl's home. Two took place just a few blocks away – the Aug. 8 slaying of Braniya James, a 21-year-old woman, on the 800 block of South 6th Street and the June 8 slaying of Jahquae Walker, 26, on the 800 block of Walnut Street.\nThe city, which covers about 10 square miles, had 21 homicides at this time last year.\nJim Walsh; (856) 486-2646; jwalsh@gannettnj.com"}