{"uri": "http://www.visaliatimesdelta.com/story/news/local/2015/10/05/exeter-teen-dead-hunting-accident/73391048/", "title": "Exeter teen dead in hunting accident", "dct": "Mon, 05 Oct 2015 00:00:00 GMT", "id": "1a34cbec590c8e239e943c3b899d8fd0", "content": "The small community of Exeter is grieving after the death of a teenager who was shot during a hunting expedition Sunday morning.\nLuke Burns, 16, an Exeter Union High School student, was hunting with family and friends just before 8 a.m. near Horse Meadow when he wandered in front of hunters. He was hidden behind some brush when another hunter fired and struck the boy in the torso.\nFamily and friends tried to give CPR and first aid, later rushing the boy to the California Hot Springs Ranger station, where he died.\nLuke is a twin. He is survived by his brother Levi.\nDetectives from the Sheriff’s Departments Violent Crimes Unit were called to investigate the shooting, which they called an accident.\nThe Sheriff’s Department is using the incident to bring words of caution to hunters.\n“The Sheriff’s Department would like to take this time to remind hunters during this hunting season to practice good firearm safety measures,” according to a statement. “Know the direction you are shooting, what you are shooting at and what your shooting backstop is.”\nExeter Union Principal Robert Mayo said he called a special assembly this morning to notify students and offer counseling. At the end of the assembly, Mayo gave students an extra 40 minutes to talk amongst each other and mourn the loss of their classmate, whose twin also attends Exeter Union.\nMany of the students are using on-campus grief counselors.\n“We are a family. They deserved to know. There was shock and sadness,” Mayo said. “I told them to lean on each other and find strength in one another.”\nLuke is the third Exeter Union student to have died in the past two years. He was described as an avid member of the school’s ag department.\n“He was a nice, young man,” Mayo said.\nThe Department of Fish and Game have yet to return calls for comment. They’re assisting in the investigation."}