{"uri": "http://www.wwltv.com/news/harrison-mid-city-shooting-may-have-involved-rival-groups/329325732", "title": "Harrison: Mid-City shooting may have involved rival groups", "dct": "Thu, 06 Oct 2016 00:00:00 GMT", "id": "13d8c382dda112ab6b57dc328aaa4664", "content": "NEW ORLEANS -- Police are investigating a mass shooting in the Mid-City neighborhood that killed three people and injured at least two others.\nGunfire erupted Tuesday night around 9:30, in the 3700 block of Ulloa Street.\nNOPD Superintendent Michael Harrison said the shooting may have involved rival groups, firing at each other.\n\"It just so happened that there were people out,\" Harrison said. \"There was another group of people who took it upon themselves to fire. That turned deadly. There was a return of fire and now we have three people who are dead.\"\nThere were close to a dozen bullet holes in homes near Ulloa and S. Cortez Streets.\nOne woman, who did not want to be identified, counted five holes in her house. She said one bullet almost hit her mother who was resting on a chair in her living room.\n\"The windows, the walls, it went through the side of the house,\" she said. \"The front and the side.\"\nPaul Shaw was visiting his mother a block away and heard the gunshots.\n\"It sounded like close to 10 (shots) or so,\" Shaw said. \"Before you know it, everybody was scattering around. I didn't know they had a fight too, in the middle of it.\"\nMid-City Security District President Jim Olsen said this area is well known for criminal activity. So much so, the district gave the neighborhood organization the money to hang a crime camera on that corner. However, Olsen said they are still trying to get permission to mount the camera.\n\"Ulloa, between Tulane and Carrollton has been kind of a hot spot,\" Olsen said. \"There have been a number of shootings and apparently quite a bit of drug dealing going on in that neighborhood.\"\nThe unnamed neighbor said the shooting victims were family friends.\n\"It's just so tragic,\" she said. \"Just wondering when it's all going to stop. I don't know why they're so angry.\"\nThe Orleans Parish Coroner released the names Wednesday of three victims: Darome Hilton, 34, Glenquel Emerson, 20 and Bobbie Basquine, 22.\nAnyone with information about this shooting is asked to call Crimestoppers at 504-822-1111.\n(© 2017 WWL)"}