{"uri": "http://www.wafb.com/story/31167556/school-mourns-holy-family-teacher-who-was-shot-and-killed", "title": "School mourns Holy Family teacher who was shot and killed", "dct": "Mon, 08 Feb 2016 17:33:00 GMT", "id": "0a786f5be96cc1b3b8c6a088b32604e6", "content": "PORT ALLEN, LA (WAFB) -\nTwo communities in south Louisiana are mourning the loss of a teacher who died after getting shot Friday.\nLouisiana State Police reported Emily Thibodeaux, 23, of Addis, was shot when her husband, Ivy Thibodeaux, 29, an Addis police officer, was cleaning his gun and accidentally fired. Thibodeaux had just started her career as a third grade teacher at the Holy Family School in Port Allen.\nFuneral services will be held at St. John the Baptist Church in Brusly on Saturday.\nA growing memorial in Thibodeaux's honor has been set up outside of Holy Family School on Jefferson Avenue.\nFather David Allen said his school is truly saddened by the loss of a truly great teacher and spirit.\n\"Although our time might be brief, as it was for Emily there's no wasted life,\" he said, \"It's all precious. She touched countless numbers in a short period of time and it was a sign in the proof that the Spirit of God is in someone.\"\nThe school will have grief counselors on hand to talk with students and faculty who may need help dealing with the sudden loss. Thibodeaux also coached the school’s cheerleaders.\nAllen said explaining a tragedy like this to elementary-aged children is particularly tough.\n\"This is a human tragedy that makes no sense and so we don't ask 'why' we say 'what.' What do we do? We turn to one another and let God with skin: family, friends, the church to embrace us, love us and heel the pain, emptiness and confusion,\" he said.\nTroopers said the shooting happened in the 3600 block of East Nic Drive in Addis just before 3:45 p.m. Friday.\nThey added Emiley Thibodeaux was rushed to the hospital where she later died.\nNo charges have been filed and an investigation is ongoing.\nCopyright 2016 WAFB. All rights reserved."}