{"uri": "http://chicago.cbslocal.com/2016/08/09/boy-10-critically-wounded-in-shooting-in-west-garfield-park/", "title": "Boy, 10, Critically Wounded In Shooting In West Garfield Park", "dct": "Tue, 09 Aug 2016 07:36:00 GMT", "id": "e4df76c0a627fdc57efb4753444c0c18", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCHICAGO (CBS) — A 10-year-old boy was shot in front of his family Monday night, while on his porch in the West Garfield Park neighborhood.\nEven though Tavon Tanner made it out of surgery overnight, he was still listed in critical condition Tuesday morning at Mount Sinai Hospital.\n“He got hit in the kidney; they patched it up. He got hit in the pancreas; they took a piece off. He got hit in the intestines; they took a piece off. He got hit in the spleen; they removed it. And bullet is lodged in his chest,” said his mother, Mellanie Washington.\nTavon was on his porch in the 3900 block of West Polk Street with his mother, aunt, and 7-year-old brother when shots were fired around 10:15 p.m. Monday. A bullet struck Tavon in the back.\n“He fell down, he fell backwards on the floor, and he started beating the floor, saying, I’m burning, I’m burning,” his mother said.\nHis twin sister, Taniyah, who was inside the home at the time, ran out on the porch to be with her brother.\n“She was down there with him, holding him, saying ‘Twin, don’t leave me. Please don’t leave me.’ My heart is real heavy right now,” Washington said.\nTaniyah said she felt her brother’s pain, even though she wasn’t physically hurt. The two are best friends, and have been looking forward to starting the 5th grade in the fall. Tears rolled down her eyes as she talked about doing what she could to help him after he was shot.\n“I told him to keep his eyes open, and he kept it open. He kept his eyes open, because I told him to keep it open, and if he closed it, I opened it back up,” she said.\nTavon’s family is praying for a full recovery. Washington said doctors have told them the road to recovery will be a long one.\nShe also pleaded with the shooter to turn himself or herself in.\n“I nor my child did anything to anyone. My baby is innocent. He’s only a baby. I’m just sitting on my own porch, and my child gets shot like that,” she said.\nArea Central detectives were investigating."}