{"uri": "http://www.wafb.com/story/33831390/good-samaritan-tells-his-story-of-being-shot-run-over-while-helping-woman", "title": "Good Samaritan tells his story of being shot, run over while helping woman", "dct": "Thu, 01 Dec 2016 00:00:00 GMT", "id": "3ed0802f07b271c265a5914346ecc200", "content": "BATON ROUGE, LA (WAFB) -\nA high school senior, who jumped into action and became a target himself, continued to recover in the hospital Wednesday.\nDaniel Wesley, 17, of Central, was shot twice and run over by a murder suspect in a chaotic scene on Essen Lane over the weekend.\n\"I wish I could have done more because that lady ended up dying,\" Wesley said.\nWesley was driving home Sunday from the Mall of Louisiana when he saw a person on Essen Lane. April Peck, 30, of Baton Rouge, had been shot and tossed out of a car and died. Wesley ran to help her but the gunman, Terrell Walker, put Wesley in the hospital. It all started when Wesley said he and other Good Samaritans were tending to Peck.\n\"He gets out and he yells, 'If you're helping her, you are going to die, too,' and he shot me in the butt and then he ran after everybody else,\" Wesley explained.\nWesley said the gunman kept shooting, including at an EMS unit, but luckily, no one else was hit. But then, he returned for Wesley.\n\"On his way back to the car, he shot me again in the arm and then my feet were hanging off of the curb and whenever he pulled away, he hit my legs and broke my femur in half,\" Wesley added.\nHe said he told himself, 'Just stay still' and maybe Walker would think he was dead and not come for him.\n\"I was thinking, ‘I am not going to die like he said, that I am not going to die.’ It was a challenge,\" Wesley stated.\nIt is a challenge that he has accepted. He underwent surgery on his legs Sunday. He then had surgery on his arm, where the bone shattered, Tuesday. Doctors put plates and screws in and on Wednesday, he took his first four steps.\n\"It hurt. It was painful,\" Wesley admitted.\nWalker died during a shootout with deputies, but on Wednesday, his cousin stopped by the hospital to visit Wesley. She brought a bouquet of flowers to apologize. Wesley responded with a hug.\n\"I told her, ‘Don't be sorry. You couldn't change it. I couldn't change it. It happened. It's already in the past. I'm going to be fine. It's already in the past,’\" Wesley said.\nAnd then, there was another visitor, Louisiana Gov. John Bel Edwards and First Lady Donna Edwards, who told Wesley he was bringing together people locally and nationally by doing what he did at only 17.\n\"He (Governor) asked, 'Is there anything you need?' I was like, 'Can you get me a vending machine with a root beer because none of the vending machines here have root beer' and they are like, ‘We will make it happen and then, like two minutes later, I have a crate of root beer,\" Wesley explained.\nMany people call Wesley a hero, but he does not think that at all.\n\"My dad was a paramedic and a supervisor. I was trained to do it. So, even though I was just trying to be a Good Samaritan and do it, I felt like I kind of needed to do it,\" Wesley said.\nIt's why he wanted to follow in his dad's footsteps.\n\"I wanted to go into the Army and be a medic in the Army, but now, I have screws in both hands, my elbow and a metal rod in my knee, so that is probably out of the picture,\" Wesley added.\nHe said now, he will play it by ear and he is in very good spirits, promising to get back up on his feet as soon as possible.\nAnyone who wants to help with his treatment expenses can donate to:\nGoFundMe account for Daniel Wesley\nRELATED STORIES:\nGood Samaritan shot and run over while trying to help injured woman undergoes surgery on arm\nGood Samaritan shot, run over while trying to help woman who was shot\nUPDATE: Victim, alleged shooter identified; suspect in deadly shooting killed after shootout with deputies\nCopyright 2016 WAFB. All rights reserved."}