{"uri": "http://www.wafb.com/story/33801913/suspect-in-deadly-shooting-killed-after-shootout-with-deputies", "title": "Victim, alleged shooter identified; suspect in deadly shooting killed after shootout with deputies", "dct": "Tue, 29 Nov 2016 12:07:00 GMT", "id": "f6618586b8300234f2b03122150169cd", "content": "BATON ROUGE, LA (WAFB) -\nEast Baton Rouge detectives are investigating a deadly shooting on United Plaza Blvd. at Essen Lane on Sunday, November 27, in which one woman was killed and the shooter was later killed after a shootout with deputies.\nOn a mobile device? Click the link to view the slideshow\nThe East Baton Rouge Parish Sheriff's Office reported the incident stemmed from an earlier incident in which two people were shot, leaving one dead.\nDeputy Bryan White, chief of detectives with EBRSO, said upon arrival to the scene deputies located 30-year-old April Peck, of Baton Rouge, in the roadway on Essen Lane suffering from multiple gunshots wounds. Peck was transferred to the nearby hospital where she was pronounced dead due to her injuries.\nEBRSO said the first shooting happened on United Plaza Boulevard at Essen Lane around 5:35 p.m.\nSheriff's deputies say 48-year-old Terrell Walker, of Baton Rouge, identified as the alleged shooter, pushed Peck out of a vehicle onto Essen Lane after shooting her. Walker was Peck's live-in boyfriend, according to authorities.\nAccording to reports, Emergency Medial Services were flagged down to help Peck while in the roadway before deputies arrived to the scene.\nAccording to White, two \"Good Samaritans\" also stopped and tried to help Peck, a doctor and a 17-year-old EMT in training. Walker then turned around in dark-colored Chevrolet Malibu, drove directly at the crowd of people trying to help the woman, and allegedly struck the 17-year-old and the EMS truck with his vehicle.\nWalker then got out of his vehicle and started shooting at the 17-year-old, who sustained injuries, but is expected to recover. The third person injured by the vehicle is also expected to recover from injuries.\nWhite said a search began and deputies saw a man believed to be Walker walking on Bluebonnet Boulevard near I-10. He added the deputies got out of their vehicles and ordered Walker to put his hands up. According to White, Walker pulled out a handgun, turned toward deputies and opened fire. He said the deputies then returned fire.\nA witness who did not want to be identified explained what he saw.\n\"I saw what looked like a black sedan run into the side of the ambulance and I said, 'Oh my gosh. That car just hit the ambulance.' The lights and everything were rocking and shaking,\" he said.\n\"My wife yelled out. She said, 'They’re shooting, they’re shooting.' We started yelling for the kids to get down and she jumped in the back seat. But at that point, I just did what I could to get out,\" he added.\n\"We saw all a bunch of people running and, you know, running down away from the ambulances. At that point, back towards us, so. So, we think it was in our best interest to get out of harm’s way,\" he stated.\n\"We heard, it was three gunshots that we heard. You know, it kind of became a reaction time at that point just to get out of there, but we could see the people jumping and running around,\" he said.\nNorthbound Essen Lane was closed at I-10 as the investigation continued. It was reopened around 11:15 p.m.\nCol. Mike Edmonson, superintendent of Louisiana State Police, said Walker was dead when he arrived at the hospital. Officials added no deputies were hurt in the shootout. Troopers are investigating the deputy-involved shooting.\nAccording to the East Baton Rouge coroner, Dr. William \"Beau\" Clark, autopsies will take place tomorrow that will further explain any other details concerning this incident.\nAs per EBRSO policy Louisiana State Police will investigate the deputy-involved shooting and release any further information pertaining to the incident.\nCopyright 2016 WAFB. All rights reserved."}