{"uri": "http://www.westernslopenow.com/news/local-news/police-respond-to-alleged-armed-man-with-gunshot-wound", "title": "Man Arrested After Police Respond to Armed Man with Gunshot Wound", "dct": "Wed, 12 Oct 2016 17:35:00 GMT", "id": "d2a549b01550b89f527bbd4abf9f65fd", "content": "Error loading player: No playable sources found\nGRAND JUNCTION, Colo.-\nUPDATE: A man is arrested in connection with the shooting incident on the 1600 block of North Avenue Wednesday.\nMichael Camacho, 20-years-old was arrested following an investigation by the Critical Incident Response Team (CIRT).\nAfter medical treatment for non-life threatening injuries, Camacho was transported to the Mesa County Jail on charges of first degree assault on a peace officer, a class three felony, and menacing, a class five felony. Camacho is being held on a $10,000 bond.\nA booking photo for Camacho is not currently available.\nThe officer involved in this incident is Corporal Cody Kennedy, who has served with the Grand Junction Police Department since 2005. He remains on administrative leave, pending the outcome of an internal investigation.\nNumerous Grand junction Police Officers swarm to the 1600 block of North Avenue after getting reports of an armed man with a gunshot wound.\nThe incident caused a shelter in place to be called that has since been lifted.\nPolice officials said the initial call for this incident was from an individual who said his neighbor had accidentally shot himself in the chest.\nAuthorities said the reporting party stated that the injured man had walked back to his own apartment, after asking for an ambulance to be called, and that he still had a gun in his hand.\nWhen officers arrived on scene,they were able to make verbal contact with the male, but he wasn't compliant with officer’s instructions, and police said at one point an officer with the GJPD did discharge at least one round from a firearm, and it's unknown if this shot struck the man.\nUltimately the suspect did comply and was quickly sent to the hospital for treatment.\n\"I heard a big bang and I thought well maybe somebody threw something heavy in the trash dumpster around the building so I came out, and all of a sudden the swat team was running all around me and told me to get back\" said Carol Hammer, a resident of the apartment complex where\nLocal authorities said there are no outstanding suspects in this incident, and that the investigation is still on-going.\nThe officer who shot his firearm, an 11-year veteran of the GJPD, has been placed on administrative leave pending the outcome of the internal affairs review as is standard protocol in such an incident.\nCopyright 2017 Nexstar Broadcasting, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}