{"uri": "http://www.heraldnet.com/article/20151204/NEWS01/151209636", "title": "Teen pleads not guilty to charges in sibling-shooting incident", "dct": "Thu, 03 Dec 2015 20:10:00 GMT", "id": "cbc1355b794a85bb19c854f1c1c7c7d2", "content": "By Diana Hefley Herald Writer\nEVERETT — Moments before an 11-year-old Everett boy was shot in the face he told his older brother to stop messing around with the .38-caliber revolver the teen kept hidden under his mattress.\nAfter the shooting, the 15-year-old allegedly told Snohomish County sheriff’s detectives he bought the gun and 15 bullets for $250 two months after he was shot in the chest in a gang-related drive-by shooting. The boy assumed the gun was stolen, Snohomish County deputy prosecutor Leanne Foster wrote in court documents.\nProsecutors on Wednesday charged the teen with third-degree assault and illegal gun possession, both felonies. He pleaded not guilty to the charges Thursday. He was being held at Denney Juvenile Justice Center on $5,000 cash-only bail.\nThe Herald is not naming the boy because the case remains in juvenile court.\nHis brother is expected to survive his injuries.\nThe shooting happened around 12:30 p.m. Nov. 29 at an apartment building on Admiralty Way. The teenager initially told a sheriff’s deputy that a stranger had shot his brother.\nHis story changed after his father arrived home and confronted him. The teen allegedly admitted that he accidentally fired the gun.\nHe told detectives that he kept the weapon under his mattress but that day he tucked the gun and five bullets into a pocket in his pants.\nHe allegedly admitted that he was playing with the gun and placed a live round in the pistol’s cylinder. He spun the cylinder and pulled the trigger. The gun didn’t fire.\nThat’s when his younger brother told him to stop playing around. “You don’t know what you’re doing,” the boy said.\nThe teen pulled the trigger two more times. On the third attempt, the gun went off.\nHe allegedly told police that he wasn’t looking where the barrel was pointed.\n“He stated he was surprised when the gun actually fired and did not realize the round had struck his brother in the face until (the boy) grabbed his face in pain,” Foster wrote.\nHe allegedly told detectives that his younger brother was the only one in the home who knew about the weapon.\nThe teen “admitted that he knows guns can kill or injure someone,” Foster wrote.\nHe was shot in the chest in August during a drive-by shooting. The bullet perforated the boy’s heart, according to court documents.\nHe and three other young people were driving around Aug. 16, looking for Juan Beteran-Monrroy. They planned to beat him up in retaliation for a gang-related beef, according to court papers.\nThe group ended up stopped at a light next to him. Beteran-Monrroy allegedly placed a military-style rifle on top of his car and pointed it at the victims. The group threw a knife and metal baseball bat at Beteran-Monrroy. They sped away and Beteran-Monrroy gave chase. He is accused of shooting at the pickup truck.\nThe 15-year-old was struck near the armpit and began coughing up blood.\nBeteran-Monrroy, 18, is charged with first-degree assault and drive-by shooting. He remains jailed on $500,000 bail.\nCourt papers don’t say if the teen was motivated by fear to purchase the revolver.\nDiana Hefley: 425-339-3463, hefley@heraldnet.com. Twitter: @dianahefley."}