{"uri": "http://www.click2houston.com/news/2-people-hurt-in-double-shooting-in-southwest-houston", "title": "Couple shot, baby injured in attempted murder-suicide", "dct": "Wed, 18 May 2016 08:39:00 GMT", "id": "106c72ed936e5e6db0e8565ea4167fb1", "content": "HOUSTON - A man and woman were shot, and a baby was injured Wednesday in what police said was an attempted murder-suicide at an apartment complex in southwest Houston.\nAccording to police, Jetaime Ellis, 26, and her husband, Eric Jolivette, 30, returned to their apartment in the 9600 block of Deering Drive at about 8 a.m. and got into an argument outside the front door. During the argument, Jolivette hit Ellis and pushed her inside the apartment where she ran to the bedroom, police said. Jolivette came in with a shotgun and shot Ellis in the head and chest before shooting himself in the head, officials said. Their 14-month-old baby girl, Jada Jolivette was injured when pellet fragments hit her in the arms and legs, investigators said.\nWoman charged in deadly shooting of ex-boyfriend outside gym\n\"I just heard some noise downstairs. Wasn't really familiar with what was going on or anything. I just thought that they might have been moving something,\" neighbor Isaac Robinson said.\nPolice said a neighbor heard the commotion and called 911.\n\"(The) Husband, the suspect, told her (the neighbor), 'Everything's OK. Go back inside.' As she went back inside, she heard two loud booms as if he was hitting her or pushing her up against the wall. And then the door slammed, and she heard a single gunshot,\" Houston Police detective Christopher Elder said. \"At that time, she ran back into the apartment and saw the husband standing there with a gun and the wife on floor. And he said, 'I just shot my wife. Call 911.'\"\nEllis and her husband Jolivette were taken to Ben Taub General Hospital in critical condition.\nJada was taken to Texas Children's Hospital. She is expected to be OK. Police said her grandmother would care for the little girl and an older sibling who was away at school at the time of the shooting.\nAll three are expected to survive their injuries.\nA shotgun and a pistol were found inside the apartment. Investigators believe the shotgun was used in the shooting.\nAny potential charges will depend on the outcome of the case, police said.\nAnyone with information about the shooting is asked to call the Houston Police Department Homicide Division at 713-308-3600.\n2016 Click2Houston/KPRC2"}