{"uri": "http://thetandd.com/news/sheriff-dad-s-drug-dealing-responsible-for-deaths/article_d54693a5-3dfb-56fb-90d9-50e7c8533f28.html", "title": "Sheriff: Dad’s drug dealing responsible for 4 deaths", "dct": "Fri, 07 Aug 2015 00:00:00 GMT", "id": "345ae06e1b180f9a3f03c7efa1ea5f1c", "content": "Wright was taken into custody on Thursday in Manning, according to First Circuit Solicitor David Pascoe. He is newly charged with three counts of unlawful neglect of a child, obstruction of justice and trafficking crack cocaine.\n“Because of this man, because of his lifestyle, because of the way he wanted to live, we have four people dead and one in the hospital,” Ravenell said.\nFour people were found shot to death in Wright’s home at 7050 Old State Road, Holly Hill on July 15. They were two of Wright’s daughters – Tamara Alexia Perry, 14 and Shamekia Sanders, 17 -- his fiancée, Krystal Hutto, and a male acquaintance, Jerome Butler.\nHis 8-year-old son, Dreamzz Nelson, was also shot in the head. Nelson is receiving medical care at a Charleston-area hospital.\nRavenell said Wright has not shared what he knows about the July 15 killings with the authorities.\n“I believe Mr. Wright knows more than what he’s telling us, which is nothing,” Ravenell said.\n“The incident that occurred on July 15 at 7050 Old State Road is because of Christopher Dean Wright,” Ravenell said.\n“He’s the father and because of his lifestyle, his kids are no longer here. And not only that, why would you not cooperate with investigators?” Ravenell said.\nWright’s attorney, David Williams, said at the bond hearing that Wright has talked with at least three Orangeburg County Sheriff’s Office investigators and taken a lie-detector test.\nWright wasn’t at 7050 Old State Road when the murders took place, Williams said. He returned to the home to discover the bodies and called 911.\n\"He was the first to come on the scene. He was the first to call 911. He had to see this unfortunate event,\" Williams said.\nWright allegedly sold 13.2 grams and 14 grams of crack cocaine to a confidential informant on June 21, 2013. The State Law Enforcement Division conducted those “controlled purchases,” according to arrest warrants, at 7050 Old State Road."}