{"uri": "http://www.cleveland.com/metro/index.ssf/2015/09/second_man_charged_in_clevelan.html#incart_2box_news_index.ssf", "title": "Second man in custody charged in Cleveland drive-by that killed 5 year old", "dct": "Tue, 08 Sep 2015 00:20:12 GMT", "id": "50ec9ddbc277f50482b2011b1d249ffa", "content": "CLEVELAND, Ohio -- The man whom police said was the intended target of drive-by gunfire that left a 5-year-old boy dead and a community in mourning has been charged with aggravated murder.\nDetectives now say that Dontavious Williams, 18, exchanged gunfire with Marlon Hackett Jr., 19, on Louise Harris Drive about 5 p.m. Friday, according to court records.\nCaught in the crossfire was Ramon \"Dink\" Burnett, a charming child who loved Spiderman and his neighbor's homemade slushies. He was shot once in the chest, and pronounced dead shortly after arriving at MetroHealth Medical Center. Williams and Hackett were not injured.\nInvestigators said Saturday that Hackett drove a borrowed blue sedan to the Villages of Carver Park to shoot Williams, who was playing craps on steps inside the complex. Ramon and several other children were playing football feet from Williams when the car pulled up and opened fire, neighbors said.\nPolice arrested Williams at the scene, and obtained an arrest warrant Saturday morning accusing Hackett of firing shots from the car at Williams that instead struck Ramon in the chest.\nSunday, detectives said in court records that Williams fired back \"when the fired projectile struck and caused the death of Ramon Burnett.\"\nPolice have not released whose bullet struck Ramon, or what prompted the shooting.\nResidents in the housing complex and from across the city expressed grief and outrage at the boy's killing. Mayor Frank Jackson, who lives blocks from the complex, arrived at the scene of the shooting Friday and spoke to residents and the media.\nMembers of Ramon's family held a candlelight vigil for the boy Saturday night, and community activists plan to gather for two more vigils Sunday evening.\nBoth Williams and Hackett remain in a Cleveland jail cell. They could appear in court Tuesday morning."}