{"uri": "http://www.newsnet5.com/news/local-news/oh-cuyahoga/warrensville-heights-police-have-identified-suspect-in-barbershop-shooting-that-killed-3", "title": "Warrensville Heights Police identify suspect in barbershop shooting", "dct": "Wed, 11 Feb 2015 18:15:00 GMT", "id": "df770f71b23c6419027a6ee9808b76b5", "content": "Autoplay:\nWARRENSVILLE HEIGHTS, Ohio - Warrensville Heights Police say they have identified a suspect in a barbershop shooting that killed three people.\nOfficials confirm to newsnet5.com a warrant has been issued for 20-year-old Douglas Shine aka \"Duke.\"\nShine, of Cleveland, is described by police as:\nBlack male\n6' 3\" tall\n220 pounds\n\"We believe Shine is still in the Northeast Ohio area and we consider him extremely dangerous,\" said Warrensville Heights Police Chief Wesley Haynes. \"If you come across this male do not approach him. We ask you to give the FBI Violent Task Force a call their number is (216) 522-1400.\"\nA search of public records shows Shine has pled guilty to the following over the last few years:\nAttempted burglary\nAggravated burglary\nCarrying a concealed weapon\nHaving weapons while under disability\nThe shooting at the Chalk Linez barber shop on Harvard Road took place on Feb. 5 at about 8:30 p.m.\n[You can see previous videos about the shooting in the video player above.]\nWalter Lee Barfield, 23, of Cleveland, Brandon White, 31, of Warrensville Heights and William Gonzalez, 32, of Garfield Heights died in the shooting.\nGonzalez was the owner of the barbershop. He had two sons - ages 5 and 6 - with his wife Darlese.\nThree others were wounded — two males and a female, they have all been released from the hospital.\n\"Let us be clear that a lot of people lost their lives that night,\" said Warrensville Heights Mayor Brad Sellers. \"We believe there was only one person who was intended to lose their life.\"\nPolice would not say who that person was or what the possible motive was but they are looking into the possibility the shooting was gang related.\nSellers also said that based on calls and tips there were more people in Chalk Linez. \"In that barbershop that night were families, little children I think that's what sparked a nerve around this community because they know, people throughout this community know for anything that could have been them.\"\nThe chief said they received a number of tips and leads all of which led them to Shine Jr. \"We looked down every avenue and every avenue is pointing to this male right here.\"\nnewsnet5.com will bring you more information as it becomes available.\n---\nRECENT HEADLINES:\nFollow newsnet5.com on Facebook and Twitter."}