{"uri": "http://www.clickorlando.com/news/police-4-year-old-shot-killed-in-polk-county", "title": "Police: 4-year-old shot, killed while playing with mother's boyfriend's gun", "dct": "Sun, 22 Jan 2017 08:35:00 GMT", "id": "725f4a984af137a7951428ef1af846f9", "content": "Mat Hayward/Getty Images\nAUBURNDALE, Fla. - A 4-year-old died from a gunshot wound Friday evening, the Auburndale Police Department said.\nPolice said they responded to the 100 block of Lakeside Hills Loop in Auburndale around 10 p.m.\nOfficers said they were originally told that a 4-year-old boy had hit his head on a table and was badly injured. Upon their arrival, officers and arriving emergency medical responders found the boy, Avion Weaver, with a gunshot wound to his cheek.\nWeaver was transported to Arnold Palmer Children's Hospital, where he was later pronounced dead.\nOfficials said the investigation revealed that Weaver was in his family's apartment apparently watching television alone while his mother's boyfriend, Demeko Robinson, 26, was outside in the parking lot with friends.\nShortly after 10 p.m., Robinson went into the apartment and found Weaver heavily bleeding, police said. Neighbors reported hearing what they thought sounded like a gunshot around the same time.\n\"It is apparent that Avion found Robinson’s loaded pistol and while handling it, he accidentally shot himself in the face,\" Auburndale police said.\nThe Polk County Emergency Communications Center received a call from Robinson at 10:09 p.m., during which he requested an ambulance, officials said.\nDuring the investigation, police said a 9mm semi-automatic pistol belonging to Robinson was recovered from outside the apartment.\nPolice said Weaver's mother, Deja Perry, was not home at the time of the shooting, but returned minutes after Robinson called police and immediately before the arrival of the first police officer.\nAuburndale detectives have been in close contact with the state attorney’s office regarding this case and charges are potentially pending a review of the case once it is completed.\nStay with News 6 and ClickOrlando.com for updates on this developing story.\nCopyright 2017 by WKMG ClickOrlando - All rights reserved."}