{"uri": "http://www.khou.com/news/family-pleads-for-justice-in-murder-of-19-year-old/385366389", "title": "Family pleads for justice in murder of 19-year-old", "dct": "Wed, 11 Jan 2017 00:00:00 GMT", "id": "35ff3d97556906b3df9025a5e4340538", "content": "CHANNELVIEW, Texas - A murder victim's family wants justice for 19-year-old Kelcii Flintroy, who was found shot to death along with three others in December.\nTheir bodies were found in a burned out car in Channelview.\nThe family spoke to KHOU 11 News on Wednesday about the type of young woman Kelcii was. They said she was a homebody, a straight-A student and had been working hard and saving her money, with plans to buy her first car the day she was found murdered.\nA spokesperson for the Harris County Sheriff’s Office homicide unit said investigators are pursuing all credible leads, but could not release any other details due to the sensitive nature of the homicide.\n“If God gave me one wish, I would just ask Him to give us one day with her, just so we know that she knows we love her and how much we miss her,” said Natasha Johnwell, the victim’s mother.\nIt’s the way Johnwell chooses to remember her daughter, Kelcii: the what if’s and the photos of happier times.\nBut the regret, that she couldn’t prevent her daughter’s murder is a real-life nightmare she can’t shake.\n“All I see is her on her knees and begging for me and Emmanuel. For 19 years I protected her and just this one time I didn’t,” said Johnwell.\nJohnwell’s son Emmanuel Amons is by her side.\nHe told KHOU 11 he helped raise his baby sister in Louisiana, but when he got in trouble with the law, Kelcii moved to Houston to be with her mom and finish up school.\nJohnwell said Kelcii met Willie Norman, also found murdered, and they soon fell in love.\n“He showed me so much passion and love he had for my sister that I felt so comfortable with her leaving with him,” said Amons as he described his first time meeting Norman, just days before the murders.\nJohnwell said Willie had a troubled past but had recently turned his life around.\n“You may meet a person that makes you want to change your life and I honestly, truly believe that Kelcii did that for him,” said Johnwell.\nAnd even though she's gone, Kelcii seems to still have that effect on those she leaves behind.\n“Focus on her school, be successful in life. Be somebody in life, so I’m gonna take her energy and put it towards my life,” said Amons.\n(© 2017 KHOU)"}