{"uri": "http://www.courier-tribune.com/news/20161020/domestic-dispute-leads-to-gunfire-at-randleman-walmart", "title": "Domestic dispute leads to gunfire at Randleman Walmart", "dct": "NODATE", "id": "4e0756d74773d8781bb6b240eb77f1da", "content": "RANDLEMAN — A child custody dispute escalated to gunfire Thursday in the Walmart parking lot in Randleman.\nRandleman Police Chief Steve Leonard said his office is investigating a report of shots fired at about 3:05 p.m. in the shopping center parking area.\nLeonard said his office has been told that Frank Palacios of Poplar Street in Asheboro had gone to court to get custody of his child. In the court agreement, Leonard said, Palacios said he was awarded custody. In the agreement, the mother was supposed to turn the child over to the father at the shopping center parking lot as a neutral area. The name of the biological mother was not available at press time.\nThe child’s maternal grandmother, Sheila Marie Nougier of Gilmore Drive in Greensboro, had been responsible for the child’s care. Leonard said she was the one who showed up to meet Palacios. The mother and the child were not present. Leonard said witnesses reported Nougier began shooting at Palacios and at Arizona Victoria-Shea Dyer of Asheboro, a woman described as Palacios’ girlfriend.\nThere was no report of personal injury in the shopping center parking lot. However, Leonard said at least one vehicle received damage from the gun play.\nNougier reportedly left the area and drove north to Pickard’s Gas Station on North Main Street in Randleman where she allegedly went inside and asked someone to call 911, saying she had been shot. Before EMS could arrive, Nougier left the business and drove further north to around the 8000 block of Randleman Road, Leonard said.\nLeonard said Nougier stopped at a second business. This time, she called 911 to report a personal injury to her foot. Leonard said his officers met Nougier at the business and determined that she was involved in the incident at Walmart.\nLeonard said Nougier was transported to Cone Medical Center in Greensboro, where she is being treated for a gunshot wound to her foot. A Randleman police officer went with her. Leonard said charges are pending in the case."}