{"uri": "http://www.13newsnow.com/story/news/2016/01/17/3-hospital-1-dead-after-shooting-gloucester-co/78929394/", "title": "Arrest in deadly quadruple shooting in Gloucester Co.", "dct": "Tue, 19 Jan 2016 00:00:00 GMT", "id": "c535153c4c466fb0259ba89b9e69bacf", "content": "GLOUCESTER COUNTY, Va. (WVEC) -- Deputies arrested a man they believe is responsible for a quadruple shooting in Ware Neck that left one person dead Sunday morning.\nDijon Whitter, 18, of Hampton faces charges of 1st Degree Murder, Use of a Firearm in the Commission of a Felony (2 counts), and Malicious Shooting.\nInvestigators said deputies went to the area of Ditchley Drive and Gill Lane shortly before 12:30 a.m after someone called them about a suspicious vehicle and people in the roadway. The caller described the scene as chaotic and said that the group was around the car which had one person sitting in it. He was holding his chest, and he appeared to need medical assistance.\nDeputies located 18-year-old Joshua Steven Morrison, of Yorktown, who had been shot. He died at the scene.\nWhile deputies responded to that scene, emergency dispatchers received another call about multiple gunshot wound victims in the area of Nuttall's Country Store which was nearby. Investigators said the victims got there by flagging someone down and getting a ride.\nA third caller at another location called dispatchers to say a girl came to the caller's home and told the caller her friends had been shot.\nMedics took one of the victims who was near Nuttall's to Riverside Walter Reed Hospital. Medics flew the other two at that location to other hospitals. Deputies expected all of them to recover.\nThe three victims who are expected to recover are a 15-year-old girl and two 20-year-old males.\nTravor Wilson, who said he was friends with Morrison, told 13News Now that everyone involved knew each other and had been at a party. He added that Whitter and Morrison were \"best friends.\"\nWhitter is being held without bond in the Gloucester County Jail."}