{"uri": "http://www.walb.com/story/32001315/three-autopsies-scheduled-after-ravenel-mobile-home-park-shooting", "title": "Women, child identified in fatal Ravenel shooting", "dct": "Wed, 18 May 2016 08:37:00 GMT", "id": "023d36505e877fba3775b1a88d650579", "content": "CHARLESTON COUNTY, SC (WCSC) -\nThe Charleston County Coroner has identified the three victims in Tuesday's Ravenel shooting.\nBetty Mungin, 55, Alexis Mungin, 29 and pregnant, and Armani Mungin, eight years old, were fatally shot in a mobile home on Savannah Highway. One other woman, who officials say was the suspect’s girlfriend, is expected to survive.\nDeputies have charged 23-year-old Kenneth Ancrum with three counts of murder, one count of attempted murder and possession of a firearm during a violent crime.\n“[Alexis] was pregnant with a set of twins,” said Latoya Murray, of Ravenel.\nMurray worked with Alexis at a hotel in West Ashley, and lived around the corner from the family.\nShe said Alexis was carrying twin girls, but the coroner's office has not yet confirmed that.\n\"She was in her last term,” she added. “She was really far along.\"\nSeveral people who live in the Ravenel Mobile Home park said what happened Tuesday has shaken the entire community.\n\"Nobody knows [what happened], and we just want answers,” Murray said. “That's it. He didn't have to do this. He really didn't.\"\n\"This guy is out here and he's got this girl, and he's shooting his gun, and she's down on the ground,” said a man who called 911. “Now he's dragging her by her hair down the street.\"\n911 calls describe the scene that unfolded Tuesday afternoon. Sheriff's deputies identified the man dragging the woman as Kenneth Ancrum. The woman is his girlfriend who suffered a gunshot wound to the leg, but survived.\n\"She says she begged him not to shoot them,\" said another 911 caller.\nIn another 911 call, the caller tells dispatchers a witness was able to escape the home unharmed, and appears to tell the neighbor her entire family was murdered.\n\"They were just so nice,” said Catherine Hunter, of Ravenel who lived behind the home. “You never think something like that would happen to nice people.\"\n\"It's just heartless… it’s cruel,\" Murray added.\nThe Sheriff's Office said Armani attended E.B. Ellington Elementary School.\nMurray said Armani was the daughter of Alexis, and Alexis was the daughter of Betty.\n\"It's just a real heartbreaking situation,” she said.\nWoman who worked with Alexis tells me Betty (victim) was Alexis' mother and Armani's grandmother.\n— Karina Bolster (@KRBolster) May 18, 2016\nShortly before 1:30 p.m. Tuesday, deputies with the Charleston County Sheriff's Office responded to the 5000 block of Savannah Highway in reference to a report of shots fired and possibly a domestic related disturbance.\nA deputy spotted and stopped Ancrum as he was trying to drive out of the main entrance of the mobile home park with the surviving victim.\n“He shot me,” the woman said, motioning toward Ancrum, before saying there were more victims inside one of the mobile homes.\nAncrum was put in handcuffs and told to lay on the ground at gunpoint. Deputies found a black pistol and a knife on his person.\nDeputies went inside the mobile home to find a four-month-old baby crying with his head covered by a blue blanket, and two women and a child on the floor, suffering gunshot wounds.\nWhile some officers processed the scene, another comforted and fed the infant in the backseat of a patrol car before handing him off to victims’ advocates.\n\"South Carolina is ranked worst in the nation for deadly violence against women,\" said Charleston County Council chairman Elliot Summey Tuesday in a call to end the epidemic. \"We rank first among states for women murdered by men.\"\nA spokesperson with Charleston County School District says a team of guidance counselors and psychologists are on scene at E.B. Ellington Elementary Wednesday, where Armani Mungin attended school.\nSheila Williams, Deputy Coroner with the Charleston County Coroner's Office, says more information will be released about the victims on Thursday.\n\"This will give us time to further our investigation, including the completion of all autopsies and provide the families with those details,\" she said in a statement.\nAncrum is slated to have a bond hearing Wednesday at 2 p.m.\nCopyright 2016 WCSC. All Rights Reserved."}