{"uri": "http://www.postandcourier.com/20160517/160519475/three-killed-one-wounded-in-shooting-at-ravenel-mobile-home-park", "title": "2 women, girl shot to death in Ravenel", "dct": "Mon, 16 May 2016 00:00:00 GMT", "id": "ac2b721dffbe419e1b4c7f099e1721e6", "content": "Ravenel — Charleston County sheriff’s deputies rescued one woman from a gun-wielding man Tuesday afternoon only to discover the bodies of two more women and a girl shot to death in a mobile home during an apparent domestic violence episode.\nSheriff Al Cannon described the grisly scene that unfolded once deputies arrived after receiving a call shortly before 1:30 p.m. A man had been shooting into the air and dragging a woman into a car at the Ravenel Mobile Home Park at 5360 Savannah Highway, Cannon said.\nThe first deputy there quickly spotted the vehicle described in the call and confronted Kenneth Lamar Ancrum, who was inside. He was taken into custody at gunpoint and then the deputy found a woman in the vehicle who had been shot in the leg.\nHis intervention “likely saved her life,” the sheriff added on Twitter.\nThe woman’s injury did not appear to be life-threatening and she was taken to Medical University Hospital for treatment, Cannon said.\nNot long after that, deputies went to the mobile home where the shooting unfolded, lot 48, in an attempt to render aid to any other victims and found the three bodies and a 4-month-old baby who did not appear to be hurt. A deputy took the infant to his car and fed him, Cannon said.\nCrime-scene tape blocked most of the back of the mobile home park but it didn’t stop throngs of people from coming out of their residences in the tight-knit community. They stood in the rain clutching umbrellas to watch as deputies, emergency personnel and chaplains worked in the area. Drivers passing the commotion pulled over in a nearby parking lot.\nOnce word of the triple homicide spread, the cries of family and friends of the deceased could be heard as they embraced each other. Coastal Crisis chaplains could be seen comforting them outside a nearby mobile home.\n“When I got the call, I just thought, ‘It ain’t true; it can’t be true,’ ” said the nephew of one of the victims who was shot to death.\nHe declined to give his name but said the family was shocked.\n“She was a good auntie to come and talk to about anything,” he said, tearing up. “A very sweet lady.”\nA friend of the victims’ family who also declined to be named said she knew them to all be very loving, so it was difficult to understand the shooting.\nThe victims’ names have not been released. Autopsies are scheduled for Wednesday.\nThe suspect, 23-year-old Ancrum, who authorities said was in a relationship with the wounded woman, is being held at Charleston County jail.\nHe is charged with three counts of murder, one count of attempted murder and possession of a firearm during a violent crime. He is expected to appear at 2 p.m. Wednesday for a bond hearing.\nAncrum had been accused of hitting his pregnant girlfriend last year before the domestic violence charge against him was dropped because a witness’s story changed. The attack allegedly occurred at Ancrum’s mother’s home in the same mobile home park, lot 49.\nNinth Circuit Solicitor Scarlett Wilson confirmed that her office handled a case last year involving Ancrum, stemming from another domestic incident in August. Wilson said that episode played out this way:\nAncrum’s girlfriend, Quiwanna Mungin, who was then in her fourth month of pregnancy, reportedly learned he was with another woman and went into a home where they were staying to confront her. Mungin allegedly began punching the other woman, who she found lying naked in bed.\nMungin’s mother, Betty, and her sister, Alexis, also joined the fray. Ancrum jumped in and tried to break up the fight. During the melee, Mungin was punched in the eye and the belly.\nShe later told deputies that she didn’t know who hit her, but her mother identified Ancrum as the culprit. He was charged with second-degree criminal domestic violence.\nMungin was charged with third-degree assault and battery for the attack on the woman, while her mother and sister were charged with destruction of property in connection with a window damaged during the incident.\nMungin unsuccessfully tried to get the charges against Ancrum dropped immediately after the incident.\nAfter her mother later recanted and denied seeing Ancrum strike her pregnant daughter, the charges against him were dropped in October for lack of evidence. The Charleston County Sheriff’s Office, which made the arrest, did not object to the dismissal, given the state of the case.\nThe assault charge against Mungin also was dropped after the woman she allegedly attacked failed to show up in court to pursue the case.\nThe attack allegedly occurred at Ancrum’s mother’s home in the community where the slayings occurred Tuesday. Ancrum lived with Mungin in the same mobile home park.\nShe later gave birth to his child.\nThe deaths came on a day when the FBI renewed its call for a nationwide inspection of disturbing crime trends.\nWith Tuesday’s slayings, the Sheriff’s Office has seen five homicides so far this year in its jurisdiction, according to a Post and Courier database. In the tri-county area, 26 slayings have been reported.\nBy this time in 2015 — which proved to be one of the deadliest years in recent memory — 21 people had been slain in Berkeley, Charleston and Dorchester counties.\nThe rate of killings here mirrors trends emerging in major cities nationwide, FBI Director James Comey said recently. Most of the 40 top cities in the country have seen upticks, he said.\nAn FBI official added Tuesday on the agency’s website that it’s likely a result of various factors, including the state of relationships between police agencies and community members.\n“I am in many ways more worried” in 2016, Comey told reporters recently, “because the numbers are not only going up, they’re continuing to go up in most of those cities faster than they were going up last year.”\nAfter hearing of the triple homicide on Tuesday, lawmakers in the state House of Representatives observed a moment of silence for the victims.\nThe Legislature last year created a new domestic violence law in hopes of reversing South Carolina’s distinction as one of the deadliest states for women at the hands of men.\nDave Munday contributed to this report."}