{"uri": "http://www.nbclosangeles.com/news/local/Tustin-Orange-County-Freeway-Shootings-191813631.html", "title": "4 Dead After Orange County Shootings, Carjackings", "dct": "Tue, 19 Feb 2013 14:27:00 GMT", "id": "617caac658fafaa6fdc2d4abe87dd40b", "content": "Four people are dead after a series of shootings and carjackings near freeways in Orange County that began after the slaying of a woman at a home in Ladera Ranch.\nMap: Shooting Investigation Locations | Video: Shooting Victims Were Just Trying to Get to Work\nGunman in OC Shooting Deaths is 20-Year-Old Man\nThe gunman was identified as Ali Syed, a 20-year-old who lived at the home with his parents. Syed died from a self-inflicted gunshot at an intersection in Orange after a series of carjackings and freeway shootings, according to Orange County authorities.\n\"There are no other shooters and there is no threat to the community,\" said Orange County Sheriff's Department spokesman Jim Amormino.\nInvestigators responded to at least five locations in connection with the carjackings and shootings, including a home on Red Leaf Lane in Ladera Ranch where police said Syed shot and killed a woman in her 20s.\n\"I heard the pops, and didn’t know what it was, and then the cops showed up a couple of hours later,\" said neighbor Jason Glass.\nThe victim was \"shot multiple times,\" Amormino said. The victim's identity and relationship to the gunman -- a student at Saddleback College -- were not available Tuesday night, but Amormino said she is not Syed's mother.\n\"It's not known at this time what she was doing in the residence,\" Amormino said.\nResponding deputies were notified the gunman left the residence in his parents' black sport utility vehicle.\nThe police response in the Tustin area -- about 20 miles north of Ladera Ranch -- began with a carjacking and shots fired report at about 5:10 a.m. near Red Hill and Nisson Road, just off the 5 Freeway. A man was waiting in a vehicle in a Denny's parking lot when he noticed Syed loading a shotgun.\n\"(The victim) quickly got back into his car and accelerated rapidly,\" said Tustin Police Chief Scott Jordan. \"At the same time, Mr. Syed got out of his car and started shooting into the back of his window, almost as if he was chasing him on foot.\"\nThe driver was shot in the back of the head, but drove from the scene, police said.\nSyed -- police said he has no prior criminal record -- left the location in the black SUV, which sustained damage, including a flat tire. It was not clear how the SUV was damaged.\nSyed abandoned the vehicle and approached a man at a nearby fuel station.\n\"Mr. Syed said, 'I don't want to hurt you. I just killed somebody. Today's my last day. Give me your keys,'\" said Jordan.\nThe man handed Syed the key to his pickup, which he drove north on the 5 Freeway to the southbound 55 Freeway. Three motorists reported injuries after Syed opened fire at vehicles on the freeway, police said.\nSyed returned to the pickup and drove to the Village Way exit in Santa Ana, where a second carjacking and occurred. The carjacking victim was killed in what police described as an execution.\n\"He confronted our victim, who was in his BMW, and ordered him out of the vehicle,\" said Santa Ana Police Corporal Anthony Bertagna. \"He walks him to the side of the curb and executes our victim.\"\nAerial video showed a pickup and several patrol vehicles on the exit ramp from the 55 Freeway. The victim was shot three times, Jordan said.\nThe shooting victim was identified as Melvin Edwards, 69, of Laguna Hills. Edwards was on his way to work in Santa Ana, said Santa Ana Police Chief Carlos Rojas.\nThe gunman drove to a nearby Micro Center electronics store parking lot near Edinger Avenue and Newport Avenue in the victim's BMW, then carjacked another driver, police said. Officers discovered two gunshot victims at the Micro Center, one of whom was pronounced dead at the scene just east of the 55 Freeway.\nThe deceased victim was identified as Jeremy Lewis, 27, of Fullerton.\nColleagues told NBC4 the victims at the Micro Center lot worked for a plumbing contractor in Rancho Cucamonga. Lewis was shot and killed just as he was arriving for work at a hotel near the Micro Center. Lewis' co-worker suffered a graze wound to the arm when he responded to the gunfire.\n\"It was his vehicle that Mr. Syed then entered,\" Jordan said. \"Many calls were coming in and the California Highway Patrol got in behind the stolen vehicle.\"\nThe quickly developing situation came to an end in Orange, when Syed exited onto eastbound Katella Avenue. Syed \"almost instantly\" shot himself in the head when he got out of the moving vehicle, Jordan said.\nA shotgun was recovered at the location, Amormino said."}