{"uri": "http://www.detroitnews.com/story/news/local/detroit-city/2016/05/28/toddler-shot/85089452/", "title": "2-year-old taken off life support; 3 charged", "dct": "Sat, 28 May 2016 00:00:00 GMT", "id": "222aa617551f156b48528e8ec5b394d4", "content": "The two-year-old girl who was shot in the head over a fight over stolen money and spilled Kool-Aid has been taken off life support.\nMakanzee Oldham was declared brain dead Friday and was taken off life support at the hospital Sunday around noon, a family member said. Her organs were donated.\nMakanzee’s birthday would have been June 13. A GoFundMe page has been set up to help with medical and funeral expenses.\nAnger over a stolen thousand dollars and Kool-Aid spilled on a teen's prom dress escalated to the fatal shooting of the girl Wednesday, according to family members of two brothers charged Saturday in 34th District Court in Romulus.\nYvette Johnson wept as her sons Antoine Smelley, 33, and Cleveland Smelley, 31, were arraigned along with 21-year-old Deonta Bennett, on a total of 14 charges, including 7 charges of assault to commit murder.\nIt was unclear Sunday whether the charges would be amended in light of Oldham’s death.\nShe is the latest child to fall victim to Detroit’s violence. In the past two months, eight youths have been injured or killed by gunfire.\n“It is alleged that Antoine Smelley was at a home in the 16400 block of Fairmount,” Prosecutor Kym Worthy said in the release. “He poured juice over the head of a woman who was getting ready to leave the house to go to a prom.\n“Antoine Smelley pulled out a handgun and threatened the young woman and her friends.”\nWorthy’s office said that a short time later, Cleveland Smelley and Bennett drove over to the house and met with Antoine Smelley and a fight broke out with several other people.\n“During the fight, it is alleged that Bennett gave a handgun to Cleveland Smelley, who shot at seven people in a car,” including Makanzee.\nRelatives of the Smelley brothers gave a different account Saturday. They said the girl whose prom dress was ruined stole $1,000 from Antoine Smelley. The girl’s relatives allegedly “ambushed” and assaulted Antoine Smelley at his home after the Kool-Aid incident, the Smelley family members said. Cleveland Smelley and Deonta Bennett then went to Antoine Smelley’s house, where the incidents occurred, to protect Antoine.\n“Everybody should be looked at,” said Brittney Johnson, 23, who said she was the Smelley brothers’ sister. “Antoine was at his own home when this happened.\n“They brought their babies to the fight.”\nA cousin, Kamika Smelley, said the accused men \"are not as bad as the media is making them out to be.\"\n“(The girl in the prom dress’s) family members came to Antoine’s house. It was to defend themselves,” Kamika Smelley said. “It was 11 people on two guys, guys and girls.\n\"It all got out of hand,\" she said.\nKBouffard@detroitnews.com"}