{"uri": "http://www.local10.com/news/teen-finds-gun-in-dresser-drawer-accidentally-shoots-15yearold-boy/34691940", "title": "Teen finds gun in dresser drawer, accidentally shoots 15-year-old boy", "dct": "Fri, 14 Aug 2015 13:59:00 GMT", "id": "1f0737f3c2734db302b040d441e1cfb6", "content": "MIAMI-DADE COUNTY, Fla. - A 14-year-old boy who is accused of shooting his friend at a home Wednesday was released to his parent's custody Thursday, despite the victim's family's objections.\n\"Three best friends were together and something extremely tragic happened,\" the suspect's attorney. Kristi Kassebaum, said. \"My client's extremely remorseful (and) so is his family. They're devastated. Right now everyone's more concerned about the deceased than they are about their family members.\"\nAccording to an arrest report, the teen found a handgun that was hidden inside a dresser drawer under clothing before he accidentally shot another teen.\nThe boy was arrested Wednesday on a charge of manslaughter for the death of Jakyri Fleurimar, 15, of Hollywood, whose body was found inside a northwest Miami-Dade County home about 11:35 a.m.\n\"They meet here for the coach to pick them up and take them to school, so this is like a routine,\" Cora Stevens, Fleurimar's grandmother, told Local 10 News. \"It isn't anything different. What happened here today (that's) different is the gun.\"\nFleurimar was described by relatives as a student with strong academic and athletic skills. The 15-year-old played football for McArthur High School in Hollywood, but he had recently been accepted to Doral Academy Preparatory School, where he had already started practicing on the football field ahead of the upcoming school year.\nFleurimar's teammates took to social media to express their condolences. \"Very sad news today. We lost one. RIP Kari. You will be missed forever.\"\nAccording to the report, the suspect was playing with the gun when he shot Fleurimar in the chest.\nPolice said the boy had taken the magazine out of the firearm and attempted to clear the gun, when it went off, striking the victim.\nFleurimar would have celebrated his 16th birthday in just a few weeks.\n\"Just one of the best we just lost -- that's how I want him to be remembered,\" Stevens said.\nPolice said three boys and one girl between the ages of 12 and 18 were at the home when the shooting occurred. They were taken to the Miami-Dade Police Department, where they were interviewed separately.\nDetectives said the suspect and a witness admitted that the teen was the only person who had handled the handgun at the home.\nThe suspect was arrested and taken to a juvenile detention center.\nLocal 10 News is withholding the name of the suspect because of his age.\nA GoFundMe page has been created to help Fleurimar's family with his funeral costs.\nFollow Local 10 News on Twitter @WPLGLocal10\nCopyright 2015 by Local10.com. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}