{"uri": "http://www.miamiherald.com/news/local/crime/article30874233.html", "title": "Accidental shooting claims life of 15-year-old; friend is charged", "dct": "Wed, 12 Aug 2015 12:59:00 GMT", "id": "255a01f4e0622fdaa5383d0bc7c97c61", "content": "Malcolm Antonio Lumpkin was attempting to take the bullets out of a gun Wednesday when it accidentally discharged, striking a friend in the torso and killing him, police said.\nThe accident inside a Northwest Miami-Dade home ended the life of 15-year-old Jakyri Fleurimar, and significantly altered Lumpkin’s, who is now facing a manslaughter charge.\n“While handling a firearm, the defendant took the magazine out of the firearm and attempted to clear the firearm at which time the firearm went off,” an officer wrote in Lumpkin’s arrest affidavit.\nPolice believe it was an accident, and said the weapon had been holstered and secured inside a dresser drawer with clothing, before Lumpkin retrieved it. He was in a home at 5321 NW 27th Pl. with three friends when the shooting happened.\nSomeone in the group of two surviving males and a female between the ages of 12 and 18 called police, who found Fleurimar shot in the upper torso, then took the trio to police headquarters to be interrogated. No one else was charged with a crime.\nFleurimar’s body remained inside the home for several hours as police scanned the property for forensic evidence and spoke to witnesses and the group that was inside the Brownsville home, with its manicured lawn and an American flag waving in the breeze outside.\nNeighbor Marchill Maxwell didn’t hear the gunshot, but was alerted when someone started pounding on her door.\n“I thought someone was trying to break in,” she said. “They were probably coming [to ask] for help.”\nfacebook twitter email Share\n15-year-old Shot And Killed In Brownsville Home\nA 15-year-old was killed Wednesday inside a home in Brownsville and police questioned three youths ranging in age from 12-18.\nCarli Teproff Miami Herald\nIt’s still not clear who lives in the home in the Phoenix Homes subdivision. Miami-Dade property records show it is owned by Rozina H. Lewis.\nPeople gathered on the sidewalks outside the Brownsville Town Village Apartments where the shooting took place, as the property was blocked by police vehicles and yellow crime scene tape.\nEdward Pecke called the incident, “just sad.”\n“This use to be shocking 20 years ago, and now it’s routine,” said Pecke, who moved into the government-subsidized building four years ago. “We need to find a way to change the mindset of the community.”"}