{"uri": "http://www.miamiherald.com/news/local/community/miami-dade/article128394004.html", "title": "MLK park shooting suspect shot 3 others in 2015, police say, but the case was dropped", "dct": "Tue, 24 Jan 2017 11:02:00 GMT", "id": "fcd94caeba11f80b76fb0ca36ffe8e4a", "content": "A little over a year ago as three people were on their way home in Liberty City, they spotted a silver Chevy Impala in an alleyway.\nThey walked. The Impala followed, slowly, its lights off. Shots rang out. The three were shot and left in critical condition. Two weeks later, a 17-year-old named Gerrell Brownlee was charged with three counts of attempted premeditated murder. When a witness changed her story, prosecutors dropped the case.\nOn Tuesday morning, Brownlee — now an adult — was arrested again. This time, police say, he and another shot eight people in a Brownsville park last week while families celebrated Martin Luther King Jr. Day.\nIt was a crime that not only caused chaos as hundreds of people stampeded from the park or dove under benches, but one that shocked a community and its leaders in its brazenness. Remarkably, all eight victims survived. Five of them were teens or children.\nGerome Battle, 20, was the most seriously wounded. The nursing student suffered a gunshot wound near his bladder.\n“He’s sitting there not knowing if he’s going to have a colostomy bag,” parade organizer Brian Dennis said outside the North Side police precinct, where the arrests were announced Tuesday. “They blatantly shot into a crowd of people. You have eight people who could have been killed.”\nOn Tuesday morning, without incident, Miami-Dade police ended an intense weeklong manhunt for the two men they believe escalated a gang feud into the shooting of eight innocents.\nBrownlee, now 18, was charged with attempted second-degree murder, possession of a firearm by a convicted felon and carrying a concealed firearm. He was booked into Turner Guilford Knight Correctional Center early Tuesday evening and denied bond.\nRobert Britt, 17, was arrested and charged with attempted second-degree murder and possession of a firearm by a minor. Britt will be booked into Miami-Dade’s Juvenile Assessment Center.\nThe shootings drew the ire of residents, elected officials and community leaders. It put such intense pressure on police to make an arrest that Miami-Dade Police Director Juan Perez announced it at the county commission meeting early Tuesday — even as the suspects were being escorted to the station for questioning.\nPerez, instead of speaking to commissioners, took the rare step of turning toward the audience and the television cameras in the chamber.\n“We should have been celebrating the life of Martin Luther King,” Perez told the crowd. “It was appalling that this took place in the park named after him. It was a shameful act.”\nPolice and witnesses say it was shortly before 4 p.m. on Jan. 16, Martin Luther King Day, when gunfire erupted inside Martin Luther King Memorial Park at 6000 NW 32nd Ct. Hundreds who had been at the annual MLK parade were eating, laughing and listening to music. The panic caused a stampede with people being trampled and even delaying an ambulance exiting with a victim inside.\nShot were Battle, 20, Michael Clark, 30, Shawnteri Wilson, 18, Aflanesha Times, 17, Nekaya-Senat Butler, 15, and Lajad Benson, 14. Also shot were an 11-year-old and a 13-year-old who were treated at the scene and released to their parents. Miami-Dade Crime Stoppers offered a reward of $21,000 for information leading to an arrest and conviction.\nIt wasn’t exactly clear Tuesday if anyone was in line for the reward. Perez, who thanked the public for its help in the arrests, offered little information and said “it’s not over yet.”\nBrownlee has had several run-ins with the law over the past four years, though each case was dropped. In 2013 he was charged with armed robbery with a deadly weapon. A year later he was charged with grand theft and dealing in stolen property. In 2015 he was arrested for trying to elude police in a high-speed chase.\nPolice also say that while Brownlee was shooting up the park last week, he was awaiting trial in two other cases in which he is going to be tried as an adult.\nFirst, in 2015 he was charged with stealing a motor scooter. Then in August 2016, a Miami-Dade police officer said he saw Brownlee get into a car along Northwest 12th Avenue near 62nd Street and remove a firearm he had hidden. He tried running from police, but was captured and charged with illegally carrying a concealed weapon.\nBut the most troubling of his run-ins was an incident in September 2015 that almost cost three people their lives.\nPolice say it was just after 11 p.m. when two women and a man left a small Liberty City convenience store and noticed an Impala stopped in an alleyway with its lights off. They believe Brownlee was seated behind the driver when he pulled out his weapon.\nAs the trio walked, the Impala followed. Then police say, Brownlee fired, striking two people in the stomach and another in the back. Ten days later, police interviewed one of the victims in the hospital, according to Brownlee’s arrest affidavit.\nHe was identified and arrested on Sept. 23, 2015, and charged with three counts of attempted premeditated murder. The charge was severe enough that Brownlee would have been charged as an adult had the case not fallen apart.\nBut prosecutors had no choice but to decline pressing charges when the main eyewitness changed her story. She told them she could no longer be sure Brownlee was the shooter, and he was freed."}