{"uri": "http://www.tulsaworld.com/news/courts/victims-in-hmong-festival-shooting-suing-event-center-alleging-negligent/article_63f3c896-f0e2-59ff-ba59-5f37432cacbf.html", "title": "Victims in 2013 Hmong festival shooting suing event center, alleging negligent security", "dct": "Fri, 09 Oct 2015 00:00:00 GMT", "id": "852ee36b38052cf7c1acc38c9517a5f2", "content": "Boonmlee Lee (left) and Meng Lee: The two were arrested about three hours after the Oct. 12, 2013, shooting at the Green Country Event Center, which is now closed.\nRelated story: Two jailed in Tulsa Hmong shooting\nRelated story: Tulsa County judge dismisses shooting charges against defendant in Hmong new year’s attack\nSix victims of a shooting at a Hmong New Year’s celebration in 2013 are suing the event center where the celebration was held.\nThe lawsuit was filed Wednesday in Tulsa County District Court against Green Country Event Center, which was located at 12000 E. 31st St. The center’s website shows that the business closed in February, and the listed telephone number could not be reached.\nThe lawsuit states that each of the plaintiffs — Nhia Seng Vang, Toua Xiong, Naocha Xiong, Boua Xiong, Pao Vue and Tong Lee — was assaulted by two armed intruders who entered the center and began shooting firearms during the event on Oct. 12, 2013.\nThe plaintiffs sustained gunshot wounds and serious personal injuries, some of which are permanent, the lawsuit states.\nThe lawsuit alleges that the event center failed to take sufficient security precautions for the event, which were required by the rental agreement.\nThe plaintiffs are asking for more than $75,000 in compensatory damages for their injuries and more than $75,000 in punitive damages.\nAn attorney for the plaintiffs, Benjamin Gallagher, declined to comment on the case.\nTwo men, Boonmlee Lee, 23, and Meng Lee, 21, were arrested about three hours after the shooting and jailed on five counts each of shooting with intent to kill and possession of a firearm during the commission of a felony.\nBoonmlee Lee is now charged in Tulsa County District Court with one count of shooting with intent to kill and five counts of assault and battery with a deadly weapon in connection with the shooting, court records show. Meng Lee is charged with one count of accessory after the fact.\nBoonmlee Lee is scheduled for jury trial April 4, and Meng Lee’s disposition is scheduled for Nov. 9, court records show."}