{"uri": "http://www.local10.com/news/crime/11-year-old-boy-injured-in-drive-by-shooting-in-southwest-miami-dade", "title": "11-year-old boy injured in drive-by shooting in southwest Miami-Dade", "dct": "Tue, 02 Aug 2016 15:55:00 GMT", "id": "36e7fd56b83084ed3d2b31f699e602e6", "content": "MIAMI-DADE COUNTY, Fla. - An 11-year-old boy was injured Monday night in a drive-by shooting in southwest Miami-Dade County, police said.\nThe shooting was reported shortly after 10 p.m. in the area of Southwest 173rd Street and 103rd Avenue.\nPolice said Jamarie London walked out of his home to speak to his brother when a dark-colored SUV drove by and someone opened fire, striking London in his upper torso.\n\"The only thing I heard was gunshots,\" London's mother, Kristi Stewart, said. \"I thought he was joking because he didn't cry, he didn't scream, he didn't do anything. He just said, 'I'm hit mama, I'm hit.\"\nThe third grader was taken by Miami-Dade Fire Rescue to Nicklaus Children's Hospital in stable condition. He was released from the hospital on Wednesday.\n\"He is a miracle child right now,\" Stewart said.\nMiami-Dade County Public Schools superintendent Alberto Carvalho expressed his outrage about the shooting Wednesday, tweeting, \"An 11-year-old child should be able to enjoy his final weeks of summer break without having to worry about being shot. #LetKidsBeKids.\"\nMiami-Dade police said officers passed out flyers in the community Wednesday afternoon, in hopes of finding out more information.\n\"Enough is enough,\" Major Samuel Bronson said. \"No more Jamaries. He's just 11 years old. His life hasn't even begun yet.\"\nA motive for the shooting is unknown.\n\"Whoever it was, it was cowards,\" Stewart said.\nJamarie, who was shot in the abdomen, will make a full recovery.\nAnyone with information about the shooting is asked to call Miami-Dade police or Miami-Dade Crime Stoppers at 305-471-TIPS. A reward of up to $6,000 is being offered for information that leads to an arrest and conviction.\nCopyright 2016 by WPLG Local10.com - All rights reserved."}