{"uri": "http://www.lancastereaglegazette.com/story/news/local/cleveland/2015/04/12/breaking--1-year-old-shot-on-east-63rd-street/25675839/", "title": "Police: Mother in room when 1-year-old shot", "dct": "Sun, 12 Apr 2015 00:00:00 GMT", "id": "69b2041b34c9347292bdeee62ee53d33", "content": "WKYC-TV\nCLEVELAND --There are toys on the front steps of a home on East 63rd Street in Cleveland's Slavic Village, where a 1-year old boy was shot and killed Sunday afternoon.\nPolice say a 3-year old accidentally pulled the trigger, striking the victim once in the face.\nPolice identified the victim as Braylon Robinson.\n\"Don't seem real,\" said his cousin, Trashawn Robinson.\nRelatives say the boy's mother, Shanee Robinson, had agreed to watch a friend's 3-year old boy and 1-year old girl for the day after the friend watched Braylon the night before.\nThey also say someone somehow stashed two guns beneath a couch in their home without anyone knowing. The family suspects who did it, however no one has been charged.\nNeighbors say someone should serve time for Braylon's death.\n\"That was a 1-year old baby,\" neighbor Creta Muhammad said. \"What if it was your child, my child? It hurts.\"\n\"You have a loaded gun that should be locked away, especially if you have children,\" neighbor Pearl Morris said. \"So I'm like justice should be done for the child. I mean, unfortunately he's gone, but the adults should be punished.\"\nPolice say Shanee Robinson was in the same room as her son at the time of his death and that her back was turned at the time.\nNeighbors and police agree a lesson must come out of this tragedy.\n\"That done it for me, I can't stress the importance of being more consciously aware of gun safety especially around children. It's an unfortunate situation,\" said neighbor Jalil Muhammad.\n\"A 3-year-old cannot be held accountable for a tragedy like this,\" said Cleveland Police Chief Calvin Williams. \"There has to be adults that either supplied the weapons' charge, had charge of the weapons or knew the weapons were there and didn't do anything to safeguard it, so people will be held accountable for this tragedy.\""}