{"uri": "http://www.newschannel5.com/news/child-shot-in-hendersonville-suspect-at-large", "title": "11-Year-Old Shot, Killed In Hendersonville", "dct": "Tue, 09 Aug 2016 06:04:00 GMT", "id": "506a8d6c03b02d9a3f9f51db7fef026f", "content": "Autoplay:11-Year-Old Shot In Hendersonville; Suspect At LargeCONNECTING...XScene Of Shooting That Injured Child In Hendersonville\nHENDERSONVILLE, Tenn. - An 11-year-old girl has died from her injuries after being shot in Sumner County.\nAccording to officials with the Hendersonville Police Department, the shooting happened around 3:20 p.m. Monday at her home on the 100 block of Shady View Drive.\nAccording to officials, police were told that the girl was shot after getting off a school bus. After which, she walked into her home to tell her father, 29-year-old Timothy Batts, she had been shot.\nHowever, police said the evidence showed the crime itself happened inside the home.\nPolice said a total of five people lived in the home including 11-year-old Timea Batts. Neighbors said she attended her first day of school at Knox Doss Middle School earlier that day.\nOfficers obtained a search warrant for the child's home.\nExact details of how or why the child was shot were unclear, but the she was taken to TriStar Hendersonville Medical Center then LifeFlighted to Vanderbilt University Medical Center.\nPolice confirmed around 5:30 p.m. the child had died from her injuries.\nDetectives said they spoke to the bus driver, who said the shooting did not happen while on the bus.\nEarly Tuesday morning, Batts was charged with reckless homicide, tampering with evidence, false reporting and felon in possession of a firearm. He was held on a $1 million bond.\nAn official with Hendersonville Christian Academy, which is located near TriStar Hendersonville Medical Center, could not confirm with told NewsChannel 5 that the school was on lockdown but since the shooting, students have been placed in secure locations.\nOfficials with Sumner County Schools released the following statement late Monday night:\nOur entire school district is grieved to learn of the tragic loss of one of our sixth grade students, Timea Lashay Batts. Timea was a bright and kind girl who was well loved by her classmates and teachers. She will be greatly missed at Knox Doss Middle School at Drakes Creek.\nIt is our understanding from communicating with authorities that today’s tragic event in Hendersonville was not school related. The incident did not occur on the bus or at the bus stop. We have no reason to believe that there is any threat to student safety on any of our school campuses due to this tragic event.\nGrief counselors will be available for students and staff at the school tomorrow.\nThe Knox Doss Middle School at Drakes Creek campus will be closed to media for the remainder of the week out of respect for our students, faculty and staff as they go through the grieving process.\nCopyright 2016 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}