{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-shootings-violence-20161217-story.html", "title": "4 dead in Fernwood attack; 1 dead, 14 hurt in other shootings", "dct": "Sun, 18 Dec 2016 19:15:00 GMT", "id": "ce26764444f8b05399b8cfec23fd090c", "content": "Four people were found dead and another person was taken to the hospital in critical condition following what Chicago police say was a home invasion Dec. 17, 2016. (Abel Uribe / Chicago Tribune)\nFour people were shot dead during an attack in the Fernwood neighborhood and 15 other people, including a 9-year-old boy, were wounded in shootings from Saturday to Sunday.\nThe quadruple fatal shooting marked the third time in less than 24 hours that a single shooting incident left at least four people wounded.\nIt happened about 12:40 p.m. in the 100 block of West 105th Street at a home in the Fernwood neighborhood, said Officer Jose Estrada, a Chicago police spokesman.\nAt least five ambulances were sent to the home after officers were alerted by an anonymous call that several people were shot there, police said.\nTwo men and two women were pronounced dead at the scene, and a woman in her 20s was taken in critical condition to Advocate Christ Medical Center in Oak Lawn, officials said.\nThe victims, two men and two women, were shot multiple times. They were women ages 19 and 41 and men ages 36 and 45.\nA woman in her 20s was found wounded on the home's front porch and taken in critical condition to Advocate Christ Medical Center in Oak Lawn, said Jeff Lyle, a Police Department spokesman. Police Sunday morning said an 18-year-old woman remained in critical condition at Christ Medical Center.\nFour people were found dead and another person was taken to the hospital in critical condition following what Chicago police say was a home invasion on Dec. 17, 2016.\nEarlier information stated a 2-year-old child was wounded, but that information was incorrect. Officials later said the child was taken to Roseland Community Hospital for observation, said Jeff Lyle, a Chicago Fire Department spokesman.\nLyle said all of the shooting victims were in their 20s.\nAt a news conference about a half block from the site of the shootings and with more than a dozen relatives looking on, Police First Deputy Superintendent Kevin Navarro said authorities received an anonymous 911 call of five people shot at the home. Once they arrived they found two women on the front porch — one dead, the other critically injured. Inside, police found two men and a woman, all of them dead, Navarro said.\nOn Saturday, police did not provide ages or relationships for any of the victims and the motive for the attack remains unclear.\n\"At this point the case is still unfolding,\" Navarro said. \"We have more questions than answers.\"\nFamily said at least four people lived in the house and were tight-lipped about who the shooter is but confirmed he left in a red truck.\nNavarro said a weapon was not recovered. Police were expected to be at the scene for much of the night as forensic specialists comb through the home for details.\nPolice were also expected to check for any past incidences of trouble at the home, Navarro said.\nAfter the news conference, relatives of the suspected dead struggled with the tragedy, saying they still didn't know which of their family members were killed, as authorities hadn't yet released the identities of the dead.\nThey suspected that one of their cousins was among the dead because he had not answered the phone all day.\n\"(Why would) somebody do something like this? Just another senseless act of violence,\" said Melvin Jackson. \"This is a massacre, man. Who would do something like this?\"\nPolice offered no information about the gunman.\nAs word of the deaths spread, family members began to arrive at the home, some in thin jackets, waiting behind the crime scene tape for news about their loved ones.\nRelatives said neighbors told them that they didn't hear gunshots but did see a red truck speed backward up the one-way street just before the child fled the home.\nOn Sunday morning, sunshine glistened off the freshly fallen snow.\nStrings of crime tape used to cordon off the scene a day earlier clung to a barren tree like garland. Two Chicago police SUVs posted outside the home where the bloodshed occurred.\nLarry Lawrence, 21, who lives two blocks away, trudged past the home in his pajamas and a hooded sweatshirt. He said he heard gunshots ring out around the time of the shooting followed by the news that four people, two men and two women, had been killed.\n\"My reaction was what could someone do to push you over the edge to do something like that?\" Lawrence said. \"Families over here are hurt. And right now we don't know the motive — that's the scary part.\"\nLawrence moved to the Fernwood neighborhood five years ago in hopes of escaping the violence from Chicago's West Side. But shootings, he said, have been a common occurrence even if the death toll from the latest violence is abnormally high.\n\"No matter where you go,\" Lawrence said, \"it finds you.\"\nStreaks of smeared blood stained the white door of the two-story house and police tape block off its backyard.\nMeanwhile, neighbors shoveled their driveways and sidewalks, seemingly numb to the gun violence that's plagued their community.\n\"People die over here all the time,\" said one man as he drove his metal shovel across the walkway near the scene. \"I never worry. I keep to myself. The only thing to worry about is retaliation.\"\nThe man, who declined to give his name, said the young people who lived at the home appeared to be withdrawn from the other neighbors as well.\n\"It's crazy. You can't live over here without getting stopped by police or shot.\"\nA 34-year-old man was fatally injured in a fight outside of a bar in the Albany Park neighborhood, authorities said. Just after 12:50 a.m., he was fighting with a man in the 3100 block of West Irving Park Road when the man pulled out a gun and shot him in the abdomen. The 34-year-old man was taken in critical condition to Illinois Masonic Medical Center.\nThe man was pronounced dead at 5:59 a.m. Sunday, according to the Cook County medical examiner's office. He was identified as Joel Planas, of the 2100 block of North Stave Street in the Palmer Square neighborhood, according to the medical examiner's office.\nEarly Sunday, three people were wounded inside a party bus under a viaduct near Lake Shore Drive and Irving Park Road in Lake View on the North Side.\nJust before 1:55 a.m., an argument inside the bus escalated when one of the men pulled out a gun and shot two men. A 22-year-old man was shot in the head, and he was in critical condition at Illinois Masonic Medical Center. A 33-year-old man was shot in the chest, and his condition was stabilized at Northwestern Memorial Hospital.\nA 31-year-old man, who is a person of interest in the shooting, had a gunshot wound to his left hand, police said. He was also taken to Illinois Masonic Medical Center to be treated for the injury.\nAn accidental shooting on the West Side about 4:20 p.m. Saturday wounded a 9-year-old boy in the right leg.\nParamedics were called to the 5900 block of West Rice Street in the Austin neighborhood for the boy who had been shot in the right leg. Police said the shooting was accidental and self-inflicted.\nThe boy was taken to Loyola University Medical Center in Maywood, where he was listed in serious condition.\nOther shootings:\nIn the Rogers Park neighborhood just before 1:45 a.m. Sunday, a 32-year-old man was shot while he was involved in a fight in the 1700 block of West Lunt Avenue, police said. He was shot in the back, and his condition was stabilized at Presence Saint Francis Hospital.\nTwo people were shot about 12:50 a.m. while they were inside a parked car in the 8500 block of South Kingston Avenue in the South Chicago neighborhood, police said. A 22-year-old man was shot in the abdomen, and he was taken in critical condition to Trinity Hospital. He was expected to be transferred to Advocate Christ Medical Center. A 26-year-old woman was shot in the shoulder, and her condition was stabilized at Trinity Hospital.\nA 17-year-old boy was shot in the right leg at 7 p.m. in a drive-by shooting in the Chatham neighborhood, police said. The boy was walking in the 8200 block of South Ingleside Avenue when someone inside a black vehicle began shooting at him. The boy took himself to Comer Children's Hospital, where he was listed in good condition.\nIn the West Pullman neighborhood at 7 p.m., a 28-year-old was shot in the abdomen while he was talking to two men in the 11500 block of South Princeton Avenue, police said. He had been walking down the street when the two men approached him and began talking to him. At some point, one of the men pulled out a gun and shot him in the abdomen. He was taken to Roseland Community Hospital, where his condition was stabilized.\nAbout 6:40 p.m. in the South Chicago neighborhood, someone shot a 26-year-old man in the abdomen while he was standing outside in the 8800 block of South Burley Avenue, police said. He was taken to Advocate Christ Medical Center where he was in critical condition.\nAbout 6:25 p.m. in the Austin neighborhood, a 32-year-old man was standing in the first block of South Leamington Avenue when a gunman confronted him on foot and began firing, hitting him in the groin, buttocks and right leg, police said. He got himself to Loretto Hospital where his condition has stabilized. The gunman ran away north on Leamington, police said.\nAbout 5:05 p.m., a 15-year-old boy was also shot in the right leg. It happened in the 4500 block of South Princeton Avenue in the Englewood neighborhood. He told police he heard shots and felt pain while walking but is not cooperating further with police. He was taken to Comer Children's Hospital where his condition had stabilized, police said.\nA 21-year-old man was seriously wounded outside of a funeral home on the West Side. He was coming out of a building about 12:20 p.m. in the 3100 block of West Roosevelt Road when someone inside a blue sedan shot him in the right arm. He was taken to Mount Sinai Hospital in critical but stable condition. Two people were in police custody in that case, officials said."}