{"uri": "http://chicago.suntimes.com/news/police-at-least-4-shot-on-far-south-side/", "title": "Police think fatal shooting of 4 result of home invasion, robbery", "dct": "Sat, 17 Dec 2016 13:19:00 GMT", "id": "e7e75cae4ffe9497c45cc23c7f74589e", "content": "Police believe a shooting that left four people dead and one other critically wounded Saturday at a Far South Side home may have been the result of a home invasion or robbery at a “dope house.”\n“The investigation has revealed people in the home were selling potential narcotics out that home earlier in the day,” police spokesman Anthony Guglielmi said Sunday evening. “And we believe individuals returned to rob occupants in that home.”\n“Detectives said they have very optimistic leads,” Guglielmi said, adding that police recovered substances that appeared to be illegal narcotics from the home.\nOfficers were called at 12:39 p.m. to the shooting scene at a 1 1/2-story home in the 100 block of West 105th Street in Fernwood, according to Officer Jose Estrada, a Chicago Police Department spokesman. But it wasn’t clear just when the shooting happened.\nFour people were found dead with gunshot wounds: a 41-year-old woman, a 19-year-old woman, a 45-year-old man, and a 36-year-old man, according to police. Three were found inside the home, and one of the women was found outside.\nA 2-year-old boy also was in the house. He was unharmed and taken to Roseland Community Hospital for observation.\n“It’s known that people in the home knew their attackers,” Guglielmi said, adding that no weapon had been found.\nThree of the victims suffered a gunshot wound to the head, and the fourth suffered multiple gunshot wounds, according to the Cook County medical examiner’s office. All four were ruled homicides.\nA fifth victim, an 18-year-old woman who was also found outside, was taken to Christ Medical Center in Oak Lawn, where she remained in critical condition Sunday morning. Detectives had not interviewed her as of Sunday evening, Guglielmi said.\nNeighbors said all of those who were shot are related to each other and lived at that address.\nPolice initially thought the shooting may have stemmed from a domestic situation, but they walked the theory back as more evidence came to light.\nNeighbors said they didn’t hear any gunshots and realized something was wrong only when the police got there.\nA source told the Chicago Sun-Times that a “man ran up to a citizen and said, ‘Call 911 for multiple people shot.’ ”\nMelvin Powell said two of his cousins live in the home where the shooting occurred. He thought at least one was killed because he wasn’t answering his phone all day. He said another cousin who lives there was pregnant.\n“This is a massacre, man,” Powell said. “Who’d do something like this?”\nSaturday’s shooting was the third time in 24 hours in the city in which at least four people were shot in a single incident.\nMore than 750 people have been killed so far this year, Chicago’s deadliest since the late 1990s.\nContributing: Mitch Dudek"}