{"uri": "http://www.ksla.com/story/30017707/4-people-including-3-juveniles-shot-ages-of-2-are-11-and-15", "title": "4 people, including 3 juveniles, shot in Shreveport", "dct": "Sun, 27 Sep 2015 16:06:00 GMT", "id": "c50bca1d00a065d3827d80ac55772baf", "content": "SHREVEPORT, LA (KSLA) -\nShreveport police are looking for the person or persons responsible after four people, including three juveniles, were shot Saturday night.\nTadaruis Kennedy, 25 and 3 juveniles, ages 17, 16 and 11 years-old, were victims in the shooting that happened in the 1500 block of Clanton Street, according to Shreveport police.\nPolice say Kennedy suffered a gunshot wound to the hand, a 17-year-old male was hit in the upper torso, a 16-year-old girl was grazed in the head and the 11-year-old boy was grazed in the jaw.\nAll four were taken to University Health for treatment. The 17-year-old suffered the more serious injury and remains in critical condition.\n\"I had just told him to go home. You know? And when I left, I get a call he's down in the street where the gun fire was. And they were like 'he's been shot in the face, he's dead.' I mean my mind was in a million places,\" said Brithney Williams.\nBrithney Williams had just gone to the store before shots rang out Saturday night.\nHer son, 11-year-old DMarkeo Johnson, was caught in the crossfire.\n\"He was just going up in there being normal, going up to talk to my cousin because my cousin lives, got a son down there, they play video games. So he was going down there to play video games and next thing you know they heard gunshots,\" said Williams.\nHer son was hit in the jaw by a bullet and released from the hospital Sunday morning. By afternoon, he was back on his bike, riding around his neighborhood.\n\"I'm glad he's still here too. This my boy, this is my first born, my soldier,\" said Williams.\nPolice say around 8:30 p.m. a dark colored sedan drove near the intersection of Clanton and Dowdell Streets and shot at the victims multiple times.\n\"When I came in, everything was taped off,\" said Williams.\nShreveport police Cpl. Marcus Hines says they have no suspects in the case, but the investigation just started.\n\"There are many people standing outside here. Someone knows something,\" said Cpl. Hines. \"We would ask that you would contact Crime Stoppers, contact the police department, give us that information, help us with this case.\"\nWilliams hopes the man who shot her child is found, but she is glad everyone is recovering.\n\"Whoever did this, you are a sorry piece of trash, to shoot where kids are at,\" said Williams.\nKSLA News 12 archives show the 1500 block of Clanton Street is the same block where mail service was suspended for a week or so after a carrier got caught in the crossfire of a gunfight Sept. 27, 2004.\nAnyone with information about this crime is urged to call Crime Stoppers at 318-673-7373 or on their website www.lockemup.org. Crime Stoppers is offering a reward for information leading to the arrest of those responsible for the crime.\nCopyright 2015 KSLA. All rights reserved."}