{"uri": "http://news3lv.com/news/local/smoke-shop-clerk-facing-murder-charge-in-shooting-death-of-13-year-old", "title": "Smoke shop clerk facing murder charge in shooting death of 13-year-old", "dct": "Tue, 06 Dec 2016 00:00:00 GMT", "id": "2bb35084041f547c3f321865def0cd26", "content": "Lt. Dan McGrath of the LVMPD Homicide Section said Raad Sunna fired 8 or 9 shots as Fabriccio Patti, 13, and two of his middle school friends entered the business wearing masks and began to steal merchandise from the shop. 12/6/16 (Kelsey Thomas | KSNV)\nLAS VEGAS (KSNV News3LV) — Days after a 13-year-old boy was shot and killed during what police believed was an attempted robbery of a local smoke shop, police are now saying that boy was murdered by the smoke shop clerk.\nRaad Sunna, 24, was arrested Monday and is now facing a murder charge, three days after the shots were fired inside of the business at Flamingo and Durango.\nRELATED |Heartbroken father says 13-year-old son made a decision that cost him his life\nLt. Dan McGrath of the LVMPD Homicide Section said Sunna fired 8 or 9 shots at Fabriccio Patti, 13, and two of his middle school friends entered the business wearing masks and began to steal merchandise from the shop. Officers say the boys were unarmed and did not approach the clerk as Sunna originally described to officers.\n\"You have to be able to explain your actions,\" McGrath explained, mentioning to the media that carrying a gun and firing a weapon come with consequences.\nAccording to LVMPD officers, store surveillance video revealed that the boys rushed into the store, stopped to grab the merchandise and did not approach the clerk. That's when Sunna fired his weapon.\nOfficers say Sunna was not arrested on the night of the shooting because evidence at the time led police to believe that Sunna feared for his life during what he described as a robbery. Police did arrest the two boys involved and charged them with attempted robbery. Now, following the viewing of the store video, officers may work with the District Attorney to decrease those charges.\nOfficers add that the boys who were arrested were 14 and 15-years-old and went to Clifford Lawrence Middle School with Fabriccio Patti. They believe the boys planned the theft before carrying it out Friday evening.\nPolice and community leaders spoke during Tuesday's press conference, pleading with local parents to know who their children are associating with, where they are at all times, and if necessary, to be an active chaperone for younger children.\nCaptain Roxanne McDaris of the LVMPD Enterprise Area Command became emotional as she relived the details of the shooting. She responded the night of the shooting, and as a mother she was personally affected by the details of the case.\n\"That one decision, that one mistake can change a life,\" she said. \"We need to protect our children, we need to help them make the right decisions,\" she continued.\nCaptain Ken Young of the Clark County School District Police Department also spoke, offering resources to young people who may have been affected by the shooting.\n\"As a district, this is a tragic loss for us,\" he said. \"Parents, sit down and talk with your kids, be nosey,\" he continued.\nNews 3 spoke with Fabriccio Patti's father Monday afternoon.\nMartin Patti is now asking himself why his quiet and sometimes stubborn boy would become involved in a robbery. He may never have an answer.\n\"Believe me, I talked to him so many times. I talked to him, like Fabriccio, make the right decision. Think about your sister. Think your mom. Your grandfather. Me. But I think he tried to prove something. He tried to prove something,\" said Patti."}