{"uri": "http://www.komonews.com/news/local/Apologetic-felon-linked-to-deadly-Pioneer-Square-shootout-316077531.html", "title": "Apologetic felon linked to deadly Pioneer Square shootout", "dct": "NODATE", "id": "417a616ce61473cf5182381da6000875", "content": "SEATTLE -- A Seattle gangster alleged to have participated in a Pioneer Square gunfight that saw a young woman killed now faces a federal gun charge.\nJamell Webb was on federal probation on Jan. 27, 2014, when federal prosecutors now say he opened fire with a pistol he wasn't allowed to own. Webb, 29, has not been accused of shooting anyone during the apparent gunfight.\nShortly after 1 a.m. that Monday morning, an argument near the intersection of Second Avenue South and South Main Street turned into a shootout. Five people were shot, including 26-year-old Cassandra Hampton, who clung to life for four days before succumbing to her wounds at Seattle's Harborview Medical Center.\nAt the time, a Seattle Police Department spokesman described the incident as an argument between two men \"that rapidly spun out of control.\" At least two people who were involved fired guns during the closing-time shootout.\nOfficers responding to the scene found Hampton shot in the face. Four others thought to have been shot during the gunfight - three men aged 24, 20 and 19, and a 22-year-old woman - arrived at area hospitals in the hours afterward.\nA woman driving away from the shooting scene crashed into a King County Sheriff's Office patrol car rushing toward the area. She lost control of the sedan and struck a second car.\nPolice at the site of the wreck noticed a revolver inside the car. Detectives seized the revolver after obtaining a search warrant, according to charging papers, and found three of the gun's six chambers were loaded.\nIn charging papers, a Seattle detective said Webb's thumbprint was found on the revolver, while his fingerprints were found inside the car as well. The detective noted that Webb's identical twin does not have matching fingerprints; the brother was incarcerated at the time of the shooting.\nAnalysis of the pistol showed it had fired a bullet recovered from another car that had fled the shooting scene, the detective continued. The occupants of that car are rivals to the East Union Street Hustlers, a central Seattle street gang to which police say Webb belongs.\nCourt records don't indicate that any witnesses saw Webb fire the pistol during the shootout. Investigators contend mobile phone data and witness statements show Webb was in the car during the gunfight, and fled immediately.\nWebb had been scheduled to meet with his probation officer hours after the shooting. He never showed up, and remained a fugitive until his arrest on Sept. 17.\nHampton's slaying remains unsolved. It does not appear any suspects beyond Webb have been charged in the shooting.\nIndicted on a gun possession charge on July 1, Webb's troubles with the law stretch back nearly a decade.\nTwice convicted on felony drug charges in state court, Webb was among a group of men charged federally during a 2010 push to clean up the corner at 23rd Avenue East and East Union Street. Webb was sentenced to three years in prison for dealing cocaine at the corner, and then was returned to federal detention after running away from a halfway house.\nFacing U.S. District Judge Robert Lasnik in March 2013, Webb described himself as a patriotic man with interests \"uncommon for an ex 'gangbanging drug dealer.'\"\n\"I want to find a way out of my life of hustling for money,\" Webb told the judge.\nJailed since his arrest, Webb pleaded not guilty to the charge he currently faces - felon in possession of a firearm as an armed career criminal."}