{"uri": "http://www.chicagotribune.com/suburbs/aurora-beacon-news/crime/ct-abn-aurora-shooting-st-1230-20161229-story.html", "title": "Teen critically injured in Aurora shooting", "dct": "Thu, 29 Dec 2016 19:15:00 GMT", "id": "52ae38a2dd624b43d3b650f17f941a33", "content": "A Yorkville teen was critically injured in a shooting on Aurora's West Side, according to police.\nThe shooting occurred around 10:55 p.m. Wednesday on the 2000 block of Coral Avenue, Aurora police said in a Facebook post Thursday. The injured teen is 17 years old.\nPolice initially responded to a report of a suspicious person banging on a front door and asking for help at a home on the 1900 block of Coral Avenue. When they arrived, they found the teen with multiple gunshot wounds and a deep cut to one arm, they said.\nAccording to police, the shooting occurred in or near the teen's Chevy Tahoe, which was found parked on the 2000 block of the street. They believe he was shot by a male. After the shooting, both the teen and the person believed to be the shooter fled, according to police.\nBefore he went to the home where police located him, the teen ran to a neighboring home and banged on the window in the front door, likely seeking help, according to police. He broke the window, which likely caused the cut to his arm, they said.\nThe teen was taken to an Aurora hospital, where he had surgery for wounds believed at the time to be life-threatening. Police said on Facebook Thursday it is believed the teen will survive, but he remained in critical condition.\nPolice said they could not rule out drug or gang motivation for the shooting.\nThe teen was largely uncooperative with responding officers who treated him before an ambulance arrived, according to police.\nThey did not have a description of a suspect. They asked anyone with information to call the investigations division at 630-256-5500 or Aurora Area Crime Stoppers at 630-892-1000, or submit a tip through the police department app.\nTwitter @srfreish"}