{"uri": "http://www.wsbtv.com/news/news/local/9-month-old-killed-during-violent-home-invasion-st/nfs7m/", "title": "Detectives: Deadly home invasion could be part of violent crime spree", "dct": "Sun, 11 May 2014 08:31:00 GMT", "id": "3930c4faff8cae47d76041ceaa4cfe71", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nSTONE MOUNTAIN, Ga. - Investigators said there is a good chance nearly a dozen shootings in DeKalb County this weekend are connected.\nDuring a home invasion Saturday night, a 9-month-old baby was killed.\nInvestigators told Channel 2's Ryan Young the shootings may have all started with a murder earlier this month.\n“It’s complicated,” said DeKalb Police Chief Cedric Alexander. “It’s insane. It’s insane.”\nOfficers are going door-to-door on Lani Farm Road looking for clues.\n“This is a neighborhood. This is a community. So if someone could come into a home, shoot four people then they are just gone, they just get away with it,” neighbor Candice Carter.\nThree women were shot during the home invasion and a baby boy was killed. Police said the gunmen hunted them down before opening fire.\n“Masked gunman came into the home. The three women took the baby, ran upstairs, tried to lock themselves in the upstairs bathroom. The gunmen kicked the door open and commenced firing,” Alexander said.\nThe victims’ names were not released. The women are 36, 23, and 21, police said. The 21-year-old is thought to have been the baby’s mother.\nDetectives said at least five weekend shootings were connected. But the fight that started the crimes happened with a murder\non May 3 when 29-year-old Michael Phillips was shot and killed during a party.\nPolice arrested 18-year-old Kemontay Cullins in the shooting.\nDetectives now said they are looking for 16-year-old Cutrez Johnson and 19-year-old Oslushla Smith. Both are wanted for murder and are considered armed and dangerous.\nAlexander said the home invasion came about five hours after authorities got an anonymous call saying that a woman’s body could be found on Agape Way in DeKalb. That body turned out to be Alexis Malone, 17, who police said witnessed the May 3 killing. They are also looking for another possible witness to the fatal shooting.\n“We still have a lot of work to do in particularly identifying the shooter or shooters,” Alexander said.\nDetectives also want to talk with Kayla Dixon. They said she may have information they need.\nPolice said they do not know if a drive-by shooting Saturday evening that left two men dead and three other people wounded is connected. That case happened around 7 p.m. on Shamrock Drive, south of Decatur, where a car followed another car and then occupants of the trail vehicle opened fire.\nOne man and two women were also wounded in that attack. No names have been released in that case.\nPolice need your help in closing this case. You can call Crime Stoppers at 404-577-TIPS (8477). You don't have to give your name, you could be eligible for a reward."}