{"uri": "http://www.denverpost.com/news/ci_27049778/yuma-high-school-student-16-killed-apparent-accidental", "title": "Yuma reeling after accidental shooting death of high school student", "dct": "Tue, 02 Dec 2014 00:03:00 GMT", "id": "ded9179883de0260e7db667f5a6b6b36", "content": "Jaden Rahm, 16, was driving a pickup carrying three of his friends Monday, headed from Yuma High School to lunch, when one of the teens in the back seat tried to move a hunting shotgun out of the way.\nThe firearm accidentally discharged, authorities say, sending a blast through the driver’s seat and into Jaden’s chest. The boy was rushed to a hospital, where he was pronounced dead about noon.\nThe death, which police say appears to be a tragic accident, has set off a wave of grief and mourning in the tiny farming town of 3,500 that sits on the high plains about 150 miles northeast of Denver. Jaden and his family are known well in the community, according to law enforcement officials.\n“People are pretty confused about how they are supposed to act, how they are supposed to feel,” Chad Day, the Yuma County sheriff, told The Denver Post on Tuesday from the high school, where he was helping community members mourn.\n“It’s very common for students to leave on their lunch hour to eat somewhere else,” said Day, who knew the boy and his family. “It sounds like these students were on their way to a home to grab some lunch together.”\nStudents at the high school of roughly 275 were told of Jaden’s death at an assembly Monday afternoon as word quickly spread throughout the school and town of the teen’s death.\n“It’s a rough day,” Day said. “They’re leaning on each other.”\nAn autopsy was conducted Tuesday morning. The results have not been released.\n“This town lost one of the best kids ever,” wrote Dawson Grietsch, a friend, on Facebook. “Losing my buddy is the toughest thing I’ve ever (gone) through. I have memories I will never forget.”\nWhile some forensic evidence is still being processed, officials are confident the shooting was accidental. The Yuma Police Department is leading the investigation into Jaden’s death.\nAuthorities said the firearm that killed Jaden, who played baseball at the high school, was a bird hunting shotgun. Those in the vehicle at the time of the shooting are not considered suspects.\nCounseling services are being offered to the school’s students and staff members, the sheriff’s office said.\nCommunity members gathered Monday night for a candlelight vigil to remember the teen. Jaden’s death also sparked an outpouring on social media of condolences and support for his family.\n“Jaden Rahm was a genuinely sweet kid, who will be greatly missed,” Eric Metcalfe posted on Twitter. “Please send prayers for the Rahm family.”\nJaden’s Facebook page was filled Tuesday with photos and memories from family, friends and friends of friends. Many changed their profile pictures on Face book and Twitter to a black box with Jaden’s initials, “JR.”\nJaden’s family declined through law enforcement to comment on the shooting and asked for privacy.\n“I’ll always remember you,” one girl wrote.\nJesse Paul: 303-954-1733, jpaul@denverpost.com or twitter.com/JesseAPaul"}