{"uri": "http://katv.com/news/local/police-investigating-little-rock-shooting-injuring-4", "title": "5 injured in overnight 'mass shooting' in Little Rock", "dct": "NODATE", "id": "4dbd25064207c18c4d225019eb02bd85", "content": "LITTLE ROCK (KATV) —\nUPDATE:\nShortly after 10:30 p.m. Wednesday, officers were called to the 2100 block of Bragg Street in reference to a shooting.\nThe victims at the scene told police they were standing in front of the residence when someone began firing shots at them from an unknown location.\nPolice say four victims were suffering from gunshot wounds and taken to local hospitals for treatment. Their injuries were all determined to be non-life threatening.\nPolice say a fifth victim had a graze wound to the leg but refused medical treatment.\nThe victims have been identified as:\nVashon Dukes, 19, of Little Rock\nFreddy Duhart, 38, of Little Rock\nWhitney Lewis, 29, of Little Rock\nShawn Adams, 47, of Little Rock\nNatasha Stewart, 34, of Little Rock\nTwo juveniles were also at the scene but were not injured.\nOne of the victims, Shawn Adams, returned home on Thursday. She told KATV she was sitting in a car with the door open when the shooting started. She saw a man wearing a black hoodie but was unable to give any further description. She believes three men were standing in the alley across from her home when they opened fire on her family. She said no confrontation leading up to the shooting.\nTwo of Adams grandchildren a 14-year-old and 11-year-old were also standing outside the house at the time of the shooting. Neither of them were injured.\n\"Based on the FBI's standard of a mass shooting, any shooting that has three or more victims is considered a mass shooting. We did have the five victims so it does qualify over that. With the 11-year-old there it ups the ante for us. Obviously this is something we want to get solved. We want to get this individual put behind bars,\" said Officer Richard Hilgeman of the Little Rock Police Department.\nThe investigation is still ongoing. Police are asking anyone in the community with information to call 501-371-INFO.\n------------------------------------------------------------\nORIGINAL REPORT:\nLittle Rock police are investigating a shooting that occurred at 22nd and Bragg late Wednesday night.\nPolice say four people were sent to the hospital, one in serious condition and three with non-life threatening injuries.\nNo arrests have been made at this time."}