{"uri": "http://wtkr.com/2016/01/17/on-dead-three-wounded-in-gloucester-county-shooting/", "title": "18-year-old Yorktown man gunned down in vehicle; three others injured", "dct": "Sun, 17 Jan 2016 09:34:00 GMT", "id": "663f12f307cb3afd135176b8ed2a808a", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nGloucester County, Va. - Officials have now identified the victim who was gunned down in a car. Officials say 18-year-old Joshua Steven Morrison was killed. A 15-year-old girl and two 20-year-old men were also shot.\n\"He's always trying to stay positive and keep everyone happy. It was a very outgoing kid,\" said Dean Roberts. Roberts said he can’t believe what’s happened to his longtime friend who he has known since elementary school.\n“I didn't want to believe it's true,” said Roberts.\nThe 18-year-old is from Yorktown, according to the Sheriff's Office.\n18-year-old Dijon Whitter is locked up in the Gloucester County Jail accused of murder.\nWe’ve reached out to Whitter at the jail, but jail officials said he was not interested in speaking with us.\nDeputies were called to the Gill Lane and Ditchley Drive early Sunday morning for reports of gunshots. There was a party down the street, and four people were shot – three survived and friends say Joshua was killed.\nThey said he was friends with Dijon and the two spent a lot of time together.\nFriends we spoke with were stunned by the news.\nThey have set up a memorial on Gill Lane, the spot where the shooting happened.\n\"It's devastating. I woke up to that phone call,\" said Roberts, \"It tore me up.\"\nA father said he is glad his 15-year-old daughter is alive after being shot in the back of the head in Gloucester County.\nJohn Ward said a bullet struck the back of her head and it is unclear if she will suffer from any permanent damage.\n“I hope they prosecute him to the fullest extent,\" said John Ward. \"She has double vision. The doctor said if it had been a little bit closer, she would not be here.”\nA Captain at the Sheriff’s Office stated they got calls into the 911 dispatch center about a chaotic scene and reports of gunshot victims near Ditchley Drive and Gill Lane just after midnight on Sunday.\nOfficials say one person was found dead in a car and three other victims got a ride down the road to Nuttall’s Country Store, which is located a little over a mile down the street. Law enforcement met with the victims at the store.\nThere was a big party happening down the road.\nOne woman, who did not want to be identified, said she did not know the people involved in the shooting.\n\"We were having a party for my birthday, but they were not affiliated with us in any way,” she said.\nPolice also received a 911 call from a nearby neighbor who says a teenage girl came pounding their door, saying the alleged gunman was chasing her. She apparently ran through a wooded area and was not injured.\nIt is unclear what led to the gunfire.\nWhitter is charged with a first-degree murder, malicious shooting and use of a firearm in the commission of a felony. He is currently being held without bond at the Gloucester County Jail.\n\"I don't know how she knows the guy or if she knew him,\" said Ward.\nSheriff’s officials say there are likely more charges to come. They have not released the names of the victims.\nJohn says his daughter was released from the hospital Sunday.\nTwo victims were airlifted to other hospitals--one was taken to Riverside-Walter Reed Hospital in Gloucester. The fourth victim was found dead at the scene of the initial call in an abandoned vehicle.\nYou need to have the Adobe Flash Player to view this content. Please click here to continue.\nThe remaining victims are listed in stable condition.\nGloucester Investigators, Virginia State Police and BCI Agents are collectively working the crime scene."}