{"uri": "http://www.startribune.com/father-charged-in-connection-with-son-s-drive-by-shooting-death/386982431/#1", "title": "On day of son's funeral, dad jailed in connection with tot's shooting death in Mpls.", "dct": "Fri, 15 Jul 2016 00:00:00 GMT", "id": "a41e37be65354de3ef62ab19a41cdf47", "content": "Just hours before hundreds of mourners gathered Friday to pay their respects to 2-year-old Le’Vonte King Jason Jones, his father was arrested on charges of returning fire in the drive-by shooting last week in north Minneapolis that left the toddler dead.\nMelvonte L. Peterson, 25, of Brooklyn Center, was jailed around sunrise Friday on a pair of felonies stemming from the killing, which stunned the city and sparked a renewed effort to end the street violence that has plagued much of the North Side the past few months.\nThe charges say Peterson exchanged gunfire with the driver of a black Chevrolet Impala who fired the two initial shots on July 8, striking Le’Vonte in the chest and grazing his 15-month-old sister in the leg. Police are still searching for the Impala’s driver.\nOn Friday, a steady stream of grieving relatives and prominent community members filed into Bethel Christian Fellowship Church in St. Paul, removing their hats as they paused in front of a white casket hardly bigger than a mailbox. Some carefully laid teddy bears next to the boy’s body.\nSeveral speakers remembered him as bright and bubbly, protective of his younger sisters.\n“He enjoyed going to the park, swimming and playing with his cars,” read a program handed out at the entrance to the church. “He also loved Paw Patrol and Monsters Inc., but most of all he loved his pacifier.”\nPastor Danny Givens said that Le’Vonte’s death should serve as a wake-up call. Givens, who has played a prominent role in the local Black Lives Matter movement, said he had heard the news as he was preparing for an interview with a local TV station to discuss the fatal police shooting of 32-year-old Philando Castile two days before.\nAs he spoke, several family members in the front row dabbed their eyes with tissues, while a slideshow of photos of trips to the grocery store and an indoor swimming park was projected onto a screen.\nGivens, whose cousin is the boy’s mother, LeShae Jones, said he hoped that sight of the small casket would persuade potential witnesses to come forward and provide police with information about the slaying. He also called for more community support of young parents who are juggling child care and jobs, “instead of vilifying them.”\n“We can’t have somebody going out the back door with bricks, when we’re coming through the front door with the mortar,” he told the crowd.\nA collection plate was passed around that Givens said would help cover the cost of the funeral and new clothes for Le’Vonte’s surviving siblings.\nOne of the shots from the Impala struck Le’Vonte in the chest, mortally wounding him, authorities said. Authorities charged Peterson with returning fire at the driver of the Impala, who pulled up beside his van at the intersection of Penn and Lowry avenues and started shooting, according to a criminal complaint filed Friday in Hennepin County District Court. Several of the rounds fired by Peterson struck a nearby hardware store. After the brief exchange of gunfire, the van turned onto Penn, while the Impala fled down Lowry. Prosecutors said that Peterson, who had previously been convicted of drug possession, is prohibited from carrying a firearm.\nNo motive has emerged, though investigators are looking closely at whether the shooting was in retaliation for an earlier incident.\nRelatives insisted that Peterson was just trying to defend himself and his children when he returned fire.\nPeterson rushed the children to North Memorial Medical Center in Robbinsdale at 11:30 a.m., where Le’Vonte died.\n“The last thing that [Le’Vonte] saw was his father carrying him to safety,” Givens said.\nPolice at the hospital found two bullet holes in the van. On the driver’s side floor was a discharged cartridge casing from a .45-caliber gun. Records from Peterson’s social media account show he was involved in trading a gun for a .45-caliber the day before the shooting, charges said.\nAuthorities have said the investigation remains a top priority. They have assigned nearly a dozen detectives to the case.\nPeterson is charged with possessing a firearm after a conviction for a violent crime and drive-by shooting, both felonies. He remains jailed in lieu of $500,000 bail. A court date has not been set.\nAs Le’Vonte’s funeral procession entered the cemetery via horse-drawn carriage — just as Philando Castile had been carried from his funeral the day before — Givens posted a live video of himself on Facebook riding next to the casket.\n“See this? That’s what violence does,” he said. “Violence puts us like this, y’all.”"}