{"uri": "http://www.semissourian.com/story/2376298.html", "title": "Police: Man arrested after shooting himself with stolen gun", "dct": "Thu, 12 Jan 2017 00:00:00 GMT", "id": "8f795ddde724d64a7f53d18362b0196c", "content": "Perry County sheriff’s deputies arrested an Old Appleton man and his girlfriend Wednesday after he accidentally shot himself in the shoulder in a Delta church parking lot Tuesday, deputies said.\nThe Perry County Prosecuting Attorney’s Office charged Eric S. Lindsay, 25, with first-degree burglary, stealing a weapon, second-degree burglary, misdemeanor first-degree trespassing and misdemeanor theft of less than $150.\nHis bond was set at $5,000 cash or surety.\nThe prosecuting attorney also charged Heather A. Bacon, 32, of Perryville, Missouri, with second-degree burglary, misdemeanor trespassing and theft of less than $150.\nHer bond was set at $5,000 cash or surety.\nCape Girardeau County sheriff’s deputies were alerted to a woman who ran screaming from a parked vehicle about 10 p.m. at Amen Center in Delta, according to a probable-cause statement filed in the case by Perry County sheriff’s deputy Michael J. Schamburg.\nCape Girardeau County sheriff’s deputy Zach Snyder found Lindsay with a bullet wound in his shoulder while sitting in the front passenger seat of a 1997 Mercury Grand Marquis, Schamburg wrote.\nSnyder retrieved a Springfield Armory 9 mm handgun below Lindsay’s seat and determined Lindsay shot himself, according to the statement.\nSnyder ran the gun through a database and discovered it was stolen, Schamburg wrote.\nThe gun was reported stolen Jan. 5 by a woman living in the 200 block of Apple Creek Lane in Perryville, Schamburg wrote. She said the gun was missing from her top dresser drawer after she noticed a draft in her house from an open window in her living room, according to the statement.\nSchamburg wrote he observed pry marks on the bottom part of the window.\nThe victim later discovered several rolls of quarters, dimes, nickels and dollar coins missing from her residence, according to the statement.\nNeighbors in the 400 block of Apple Creek Lane said Lindsay and Bacon stayed with them Jan. 2 but left Jan. 3, and a footprint in the snow matched one of Lindsay’s as described by a neighbor, Schamburg wrote.\nLindsay admitted when he was interviewed by deputies Wednesday he broke into the residence in the 200 block of Apple Creek Lane, according to the statement.\nHe said he stole the handgun and a cash box from the bedroom and a Coca-Cola and water from the refrigerator, Schamburg wrote.\nPertinent address:\n200 block of Apple Creek Lane, Perryville, Mo."}