{"uri": "http://www.wect.com/story/32388077/infant-shot-2-dead-in-apparent-fayetteville-murder-suicide", "title": "IDs of 2 killed in Fayetteville murder-suicide released; infant shot expected to survive", "dct": "Thu, 07 Jul 2016 15:08:00 GMT", "id": "e7e42d2a3dce624ec396164f049c4570", "content": "FAYETTEVILLE, NC (WNCN) -\nCumberland County authorities have released the identities of the man and woman shot to death in a murder-suicide Wednesday evening that also critically injured an infant.\nThe infant boy shot in the chest during the incident has undergone lung surgery and is expected to survive.\nCumberland County deputies responded to a home in the 3400 block of Cumberland Road in Fayetteville around 6:15 p.m. Wednesday.\nOfficials said a 7-year-old called 911 and said his mom had been shot.\nUpon arrival, deputies found a baby suffering from a gunshot wound.\nThey also found the body of a woman who had been shot to death and the body of a man who died from a self-inflicted gunshot wound, officials said.\nAuthorities have identified the mother as Jessica Ann Parker, 32. The man has been identified as her boyfriend, 35-year-old Sherrell McNeill.\n“It is horrible for children to see their mother murdered in their presence and then for a baby to suffer a gunshot wound to the chest is just horrific,” said Ronnie M. Mitchell, the attorney for the Cumberland County Sheriff’s Office.\nOfficials originally said the infant was critically injured in the shooting. The baby is being treated at Cape Fear Valley Medical Center and is being held in the intensive care unit.\nThe two other children, ages 7 and 8, are being cared for by deputies pending the location of next-of-kin, officials said.\nThe investigation has revealed that McNeill and Parker had been arguing prior to McNeill shooting Parker and her infant son, authorities said.\nThe McNeill was the father of the older children, but not the infant. Parker was the mother of all three.\nNeighbors told CBS North Carolina that the family lived in home for just a few months. The family was planning to move out of the home in the next couple of days and electricity had already been shut off in the house, Mitchell said.\nThe family stayed to themselves, but typically greeted other residents, neighbors said.\n“I don’t think these people were stable because anybody with any common sense would not hurt anybody — especially a child,” said neighbor Daisy Torres."}