{"uri": "http://www.zanesvilletimesrecorder.com/story/news/local/2015/03/30/wilson-gets-years-life-shootings/70687002/", "title": "Wilson gets 32 years to life for shootings", "dct": "Mon, 30 Mar 2015 00:00:00 GMT", "id": "a27f5624966b4af531b3123c985737dd", "content": "ZANESVILLE – A Columbus man who pleaded guilty to two separate shootings that injured four and killed one will serve 32 years to life in prison.\nAnthony D. Wilson, 27, appeared in Muskingum County Common Pleas Court on Monday to be sentenced on two cases. Judge Kelly Cottrill accepted the state's recommended sentence for four counts in case one, and one count in case two.\nWilson pleaded guilty in November to a September 2013 shooting at Hoppy's Bar on Putnam Avenue that injured four people. After an altercation, Wilson had grabbed a semi-automatic handgun from his car and opened fire on the crowd of about 50 people, officials have said.\nHe was charged with four counts of assault, a second-degree felony. The state dismissed three other charges, including having weapons under disability, a third degree felony, tampering with evidence, a third-degree felony, and receiving stolen property, a fourth-degree felony, in exchange for the guilty plea.\nCottrill sentenced Wilson to two years in prison on each count in that case, plus an additional three years on the first two counts, which carried a firearm specification, for a total of 14 years.\nLess than four months after that shooting, Wilson shot Isaac Thomas, 35, at a home on Spangler Drive after an argument over a stolen gun. Thomas was left outside bleeding and later died at the hospital. Authorities indicted Wilson on May 14 for the incident, eight days before his arrest.\nHe pleaded guilty in November to one count of murder, an unclassified felony, for Thomas' death. The state dismissed another weapons charge in exchange for the plea.\nCottrill sentenced him to 15 years to life on that charge, plus an additional three years for the firearm specification, for a total of 18 years.\nThe sentences on all charges will be served consecutively, Cottrill ruled. Cottrill said his ruling was based on a pre-sentence investigation and the danger Wilson posed to the public.\n\"I apologize for what I've done,\" Wilson said in court. \"If I could take it back, I would.\"\nThe state had reduced Wilson's charges in exchange for his testimony at Chad M. Morrison's trial last week. but he was found not guilty of complicity to commit murder for giving the order to Wilson to shoot Thomas.\nWilson had testified that he shot and killed Thomas on Morrison's orders after Thomas stole Morrison's .357 caliber handgun. Morrison, however, testified that Wilson had acted on his own when he shot Thomas, perhaps out of fear of retribution for the September shooting at Hoppy's.\nMorrison was convicted by the jury of two counts of obstructing justice for driving Wilson from the scene and lying to police the next day. Cottrill also found him guilty of a weapons charge for illegally possession a handgun based on previous drug convictions. He was sentenced to a total of five years in prison.\nelagatta@gannett.com\n740-450-6753\nTwitter: @EricLagatta"}