{"uri": "http://www.pantagraph.com/news/local/crime-and-courts/injury-reported-at-gun-incident-police-gathering-evidence/article_e162a44a-b139-5836-924c-5c7b7e05125f.html", "title": "15-year-old boy shot in leg", "dct": "Fri, 23 Dec 2016 00:00:00 GMT", "id": "be97de374003f73f08a09658c6e51d9e", "content": "BLOOMINGTON — A 15-year-old boy was shot in the leg near the intersection of Mulberry and Allin streets Friday afternoon, but no one was in custody as police continued to investigate later that night.\nThe victim was taken from the scene by ambulance after the incident, which police said was reported about 1:15 p.m.\nPolice did not release much information about the victim, incident or suspects.\n\"Minimal information was: one person hit in the leg — non-life-threatening,\" Bloomington police Lt. Tim McCoy said.\nPolice blocked the streets for at least one block in each direction from the intersection of Allin and Mulberry streets Friday evening as they tried to serve a search warrant at 805 W. Mulberry St. Believing there may have been an armed person in the house, they trained a spotlight on it and used an amplified speaker to call on anyone inside to come out with their hands up.\nPolice said about 7:30 p.m. they were able to get in and search the house, but they did not disclose if they found anything related to the case.\nAnyone with information is asked to contact the Bloomington Police Department at 309-820-8888. If you wish to remain anonymous, call McLean County Crime Stoppers at 309-828-1111.\nFriday's incident is the latest in a number of gunfire incidents reported in Bloomington, but none resulted in injuries.\nOn Monday, police were called to the 900 block of West Olive Street after callers reported hearing gunshots. On Thanksgiving night, bullets hit a business in the 1900 block of South Main Street and two vehicles in the parking lot.\nOn Nov. 28, a house in the 900 block of West Olive was struck by bullets around midnight. Earlier in November, multiple gunshots were reported in the area of Locust and Mason streets and a vehicle was struck by bullets in the 600 block of West Locust Street."}