{"uri": "http://www.nola.com/crime/index.ssf/2016/01/accused_bourbon_street_shooter_4.html", "title": "Accused Bourbon Street shooter Trung Le's gun linked to unsolved 2012 Algiers murder", "dct": "Sat, 09 Jan 2016 04:54:40 GMT", "id": "619f419c3153945b54ff9b03f1ac18be", "content": "The same missing gun believed fired by Trung Le in the June 2014 Bourbon Street shooting for which he faces trial next week also was used in a still-unsolved 2012 murder on the West Bank, prosecutors said Friday (Jan. 8).\nBut Le's attorney, Martin Regan, said in court his client was not involved in the 2012 crime in Algiers, because Le was in jail at the time for an unrelated offense.\nThe weapon's history was disclosed as Regan brought a final set of motions before Orleans Parish criminal court Judge Byron C. Williams in advance of Monday's scheduled trial.\nLe, 22, has pleaded not guilty to charges of manslaughter and attempted murder in the mass shooting that left one dead and nine wounded after an early morning gunfight near the corner of Bourbon and St. Peter streets on June 29, 2014. Le has said he fired in self-defense as a second gunman threatened him and a group of friends.\nRegan was rebuffed Friday in efforts to keep alleged drug activity involving Le's friends out of the trial, and to obtain more ballistics reports and witness information than has already been turned over by the state. Judge Williams also denied as untimely an 11th-hour bid to have Le declared indigent, so that Regan could revive a plea for $50,000 in state funds for Le's defense. An appeals court denied Regan's motion for funding earlier.\nAs Regan pressed Assistant District Attorney Laura Rodrigue for additional ballistics information, she revealed that a bullet fired by the unrecovered weapon used by the second shooter didn't have a match to another crime. But there was a match to a previous crime from Le's weapon, with ballistics markings showing the gun he fired on Bourbon Street was the gun used in an unsolved December 2012 killing in Algiers that authorities believe was drug-related.\nThe name of the slain man in 2012 was not disclosed. But records kept by NOLA.com | The Times-Picayune show one unsolved murder that month in Algiers, that of 24-year-old Eric Hatley, who was found shot to death inside a white Chevrolet Camaro outside an apartment complex in the 2000 block of Cypress Acres Drive on Dec. 31, 2012. A law enforcement source confirmed this was the case linked to the gun Le fired on Bourbon Street less than two years later.\nHow the gun's history will factor into next week's trial is unclear, but it could impact Le's self-defense claim. Regan has described Le as a hero, who only pulled a gun and fired at the second gunman on Bourbon Street to protect himself and his friends, after the unknown man allegedly pointed a gun at the group and said, \"I've got a .40(-caliber) for you.\"\nEight of the nine survivors, including an Australian woman who was shot through her mouth, a woman from Arkansas critically wounded, are expected to testify in a trial likely to last through the week.\nIn previous hearings, some of Le's friends have admitted to smoking marijuana and drinking heavily in the hours before the gunfight. They also reluctantly admitted to being robbed at gunpoint of marijuana intended for sale in a different part of the French Quarter about two hours before the Bourbon Street shooting. Le's friend Robert Benvenuti, who survived four gunshots that night, testified that the earlier incident was unrelated to the later gunfight.\nRegan filed a motion Friday seeking to ban as prejudicial any testimony about the earlier drug deal gone bad. He said Le had not been present during that incident. But Williams agreed with Rodrigue, who said the earlier dispute was \"an integral part of this case.\" The prosecutor said at least one witness provided a recorded statement to authorities saying he was told the unknown second shooter was the same gunman who robbed Le's friends of marijuana earlier that night.\nRegan also was denied a hearing to have Le declared indigent. Regan described his client as \"a pauper,\" whose family no longer can pay the defense team's expenses or fund a search for helpful witnesses.\n\"You should have inquired about that,\" the judge told Regan, noting that state law requires a defendant's indigent status to be declared before arraignment. \"You agreed to take the case.\"\nWilliams told the attorneys he hopes to see jury selection completed Monday, with opening statements presented Tuesday morning. The trial is expected to last through next week."}