{"uri": "http://www.nola.com/crime/index.ssf/2015/10/trung_le_accused_bourbon_stree.html#incart_river", "title": "Trung Le, accused Bourbon Street shooter, to face trial in January", "dct": "Tue, 06 Oct 2015 17:21:19 GMT", "id": "df74cb0c5828846646e164a96619a308", "content": "Accused Bourbon Street shooter Trung Le will stand trial Jan. 11 for his role in the shocking June 2014 gunfight on New Orleans' iconic tourist promenade that fatally wounded a nursing student and left nine others injured, an Orleans Parish judge ruled Tuesday (Oct. 6).\nLe, 22, is charged with manslaughter in the death of Brittany Thomas and with attempted second-degree murder for the allegation that the Belle Chasse man attempted to gun down a second shooter who has yet to been found.\nCriminal District Court Judge Byron C. Williams set the date and impressed upon prosecutor Tiffany Tucker and defense co-counsel Adam Beckman that he expects the trial to commence that day without further delay. Le has been locked up inside Orleans Parish Prison for 15 months since being arrested in Mississippi five days after the shooting. Le has been unable to post the $250,000 bond required for his pretrial release.\n\"The court is concerned that this matter is taking far too long,\" Williams told the attorneys .\"It is time for us to move this case to the proper position, so that matters of justice can be upheld. Mr. Le will receive his day in court. And the victims and witnesses will, as well.\"\nLe's case has been hung up since January, when Le's lawyers, Martin Regan and Beckman, began asking the 4th Circuit Court of Appeal and later the Louisiana Supreme Court to order the release of unredacted police reports that would identify witnesses to the shooting, which erupted in the 700 block of Bourbon Street at 2:45 a.m. on June 29, 2014. Prosecutors argued the defense was not entitled to the reports, because witnesses could potentially be endangered if their identities were prematurely revealed. State law allows witnesses' names to be shielded until they are called at trial.\nThe 4th Circuit sided with prosecutors in May, and last week the state Supreme Court denied the writ from Le's attorneys, lifting the stay and putting the case back on the rails. The January date was the earliest available for trial in Williams' court, because of previously scheduled trials before Dec. 10, the last day for jury trials in Orleans Parish before the holidays.\nBeckman said Tuesday outside the courtroom that he does not anticipate any more motions or disputes that would further delay Le's trial.\n\"There are none that I know of right now,\" he said. \"But this is a step-by-step process and we would address anything else if the need comes up. But now, we need to start preparing for trial and bringing this to completion.\"\nLe's attorneys have said their client acted in self-defense, pulling a gun and defending a group of friends after they were approached by a stranger who threatened them with a .40-caliber pistol and said, \"I got a .40 for you.\" Regan has repeatedly referred to the second shooter as the \"Bourbon Street Terrorist.\"\n\"Trung is absolutely not guilty of this,\" Beckman said Tuesday. \"He fired in self-defense.\"\nSo far, only Le's friends have testified to Le's version of the story. But Regan told the 4th Circuit panel of judges in May that there likely were others on the crowded street who would confirm his account of what led to the shootout, if only he could have access to the names of everyone interviewed by police.\n\"I am looking for witnesses that corroborate (Le's story),\" Regan said. \"Or else, what you're going to hear in closing argument is, 'You can't trust these people, they're all Trung Le's friends.'\"\nOrleans Parish Assistant District Attorney Kyle Daly told the 4th Circuit judges in May that the prosecution is familiar with Le's version of the events, but does not find it credible\n\"They agree that Mr. Le shot first,\" Daly said, noting Le's claim of self-defense. \"We do not believe ... that is what happened. We believe Mr. Le started this.\"\nBeckman said Tuesday that Le's defense should not be hampered by the fact that New Orleans police never have identified or located the second gunman.\n\"It doesn't really change our position at all,\" Beckman said. \"The fact they haven't been able to catch the person who shot all these people on Bourbon Street is unfortunate. But it really doesn't affect our client's defense.\""}