{"uri": "http://www.wrdw.com/home/headlines/Investigation-underway-into-nightclub-shooting-death-279662762.html", "title": "UPDATE | Graniteville owner talks after private party shooting death", "dct": "Sat, 18 Oct 2014 00:00:00 GMT", "id": "1ce8cbb6acb44e86cc241ac96e0b06c7", "content": "GRANITEVILLE, S.C. (WRDW) -- A birthday party turned deadly and now the Aiken County Sheriff's Office is investigating the shooting.\n\"We started hearing gun fire. It was several different types gun fire that we heard. It was more than one type of a gun,\" said Willie Butler, owner of Round Two Bar and Grill.\nShots fired around 1:30 this morning as a birthday party was winding down. Deputies say a fight started inside then moved outside and quickly escalated leaving three people shot and one dead.\nThe owner said when he came outside he saw a car sitting right here with 20-year-old Stacy Johnson shot and killed inside.\n\"It's hard now a days. It's very hard. You can pray up all you want to but still the devil is busy,\" he said.\nOfficials said Stacy Johnson went to a football game in Saluda with friends before going here to the birthday party.\n\"I just can't tolerate these guys with these guns. I just can't,\" Butler said.\nButler said he's closed his doors before because of other shootings he reopened about 5 months ago and never thought things would turn deadly.\n\"Maybe I can do it and get a handle on it, but it showed me different last night,\" Butler said.\nButler, who rents our the building for private events like Friday night's, said he just wants the violence to stop.\n\"Anything I can do to help them I will help them because I don't like it,\" Butler said.\nDeputies said they don't have any suspects and no one has been charged as of Saturday night. If you have any information about the shooting, call the Aiken County Sheriff's Office.\nOriginal story:\nSaturday, Oct. 18, 2014\nGRANITEVILLE, S.C. (WRDW) -- The Aiken County Sheriff's Office is looking into a shooting death that happening at a Graniteville nightclub.\nCalls came in about a large fight and shots fired at Round Two Bar and Grill at 1:20 a.m., the Sheriff's Office said. Deputies found four victims with gunshot wounds including one man who was pronounced dead on the scene.\nStacy M. Johnson, 20, is the victim of the deadly shooting, the coroner said. Johnson allegedly went with friends to a football game in Saluda prior to the shooting.\nThe three other victims were taken to the hospital for treatment of their non life-threatening injuries, the Sheriff's Office said.\nDetails about a possible suspect were not released.\nInformation about the shooting can be sent to 1-888-CRIME-SC or 803-648-6811."}