{"uri": "http://miami.cbslocal.com/2015/08/04/miami-boy-in-critical-condition-after-accidental-shooting/", "title": "Investigation Underway After Child Shot In The Head", "dct": "Tue, 04 Aug 2015 18:36:00 GMT", "id": "04361a225f0a44954a2fc7208d2a27c5", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nMIAMI (CBSMiami) – An Investigation is underway after a young child was taken to the hospital with a gunshot wound to his head.\nThe boy’s mother, Dorphise Jean, said her son, 3-year old Darnel Mundy, was looking for an iPad when he found his father’s gun in a drawer and pulled the trigger.\nMundy, who was awake and crying, was taken to the hospital where he was listed in critical condition.\n“I love you Darnel, please stay with me, you’re all I got,” said Jean. “My son, he’s my everything.”\nJean said she and the boy’s father were sleeping when they heard a gunshot just before 6 a.m.\n“All I remember, I heard a bang. When I heard that sound, I woke up, I jumped out of bed, I didn’t even care about anything, I just grabbed my son,” said Jean.\nShe said her son used a chair to reach the drawer that held the loaded weapon.\n“We both have firearms. We always secure it. We had it locked up but obviously our son is a very curious boy, he want to start climbing stuff,” said Jean. “Please don’t bash us because it was in a secure area, don’t bash us as parents because we are good parents.”\nJean said she and the boy’s father drove him to Jackson Memorial Hospital where he underwent surgery.\nPolice have launched an investigation into the shooting.\n“Our investigators are talking with the family, neighbors, trying to find out more details. At this point, it just seems that it was an accident and a tragedy,” said Sgt. Freddie Cruz. “This is a perfect example as to why these weapons should be secured at all times.”\nSo far, no charges have been filed.\nPolice spokeswoman, Officer Frederica Burden told CBS4’s Peter D’Oench, “Right now this investigation is very fresh. We are trying to determine how the juvenile shot himself or if someone shot him.”\nNeighbor Blanca Perez said, “I’m so surprised. They are good people.”\nA CBS4 crew was at the scene when a police crime scene investigator took a black handgun from the apartment."}