{"uri": "http://www.mlive.com/news/kalamazoo/index.ssf/2016/09/teens_were_friends_hanging_out.html#incart_river_home_pop", "title": "Teens were friends hanging out when two were fatally shot on Labor Day", "dct": "Wed, 07 Sep 2016 20:19:25 GMT", "id": "ed828b5b3724bce0d28bdbd745926597", "content": "KALAMAZOO, MI - \"But not for the gun, it would have been a regular, typical, holiday weekend with three friends hanging out,\" said Capt. Victor Ledbetter, of the Kalamazoo Department of Public Safety.\nOne of the three 17-year-olds produced a handgun, however, and it went off, striking one of the others and causing his death.\nThe young man with the gun was so distraught at watching his friend die, he used the weapon to fatally shoot himself, said Ledbetter, recounting an incident that occurred at about 9 p.m. Monday in a alleyway behind homes in the 1500 block of Clinton Avenue in Kalamazoo's Edison Neighborhood.\n\"They were friends,\" said Ledbetter, who is head of detectives for KDPS.\nDead are Daquarion \"DQ\" Hunter and Marsavious \"Savi\" Frazier.\nHunter graduated from Loy Norrix High School in June. Frazier was to be a senior student this school year at Phoenix High School, an alternative high school in Kalamazoo.\nLedbetter would not say which teen wielded the gun. He also would not name the third teen, but said that young man was the best friend of the teen who was accidentally shot, and he was holding his friend as he died. He then watched the other teen turn the gun on himself.\nIn a press release, police said the teen with the gun \"played with\" it but did not say how. Ledbetter said the three were not trespassing or involved in any other unruly activity.\n\"There was no altercation or dispute,\" he said. \"This is just a very tragic incident.\"\nPolice said a U.S. Bureau of Alcohol Tobacco and Firearms agent is working with KDPS to try to determine where the gun came from and who is its owner.\n\"That was like my brother,\" Aaron Holmes said of Daquarian Hunter.\nThe two first met on the football field, where they were opponents during childhood Rocket Football games. By middle school, they were on the same team, however, and by high school, when Hunter was the quarterback of Loy Norrix's junior varsity team, the two were fast friends.\nHunter continued on to become the quarterback of the schools' varsity team, and to play on its basketball team.\nHolmes said he was aware of the circumstances of the shooting but did not want to discuss them.\n\"I don't even want talk about it,\" he said. \"It wasn't expected at all.\"\nHolmes, now a freshman running back at Olivet College, said he was shocked to get a call from a mutual friend with news from Kalamazoo.\nAt graduation, because both of their last names began with H, the two friends walked together around Wings Stadium during commencement exercises, he said.\n\"Next thing you know, I get a call -- he was gone,\" Holmes said.\nHe said the eventual plan was for Hunter to attend Olivet to play basketball or football. He was not currently enrolled in college.\nGrief counselors were to be at Loy Norrix and Kalamazoo Central high schools through the week as needed, KPS officials said.\nDescribing some online chatter about the shootings as \"urban legend,\" Ledbetter and KDPS Asst. Chief Donald Webster said they were trying to dispel the idea that police were involved in the shootings.\nThere was traffic online on social media following the shootings in which teens who indicated that they knew one or more of the victims indicated that police were involved in the shootings.\n\"This was an accidental incident,\" Ledbetter said. \"Public Safety was not involved in any way despite urban legends.\""}