{"uri": "http://wpde.com/news/nation-world/deputy-shot-in-randolph-county-hostage-situation", "title": "Randolph County deputy shot in Wedowee, standoff over", "dct": "Sat, 09 Jul 2016 00:00:00 GMT", "id": "1508d2151fe80e97b012900f9ae08272", "content": "Randolph County Chief Deputy Lane has confirmed that a deputy has been shot off of County Road 7 in Wedowee. (WBMA/James T. McConatha)\nRANDOLPH COUNTY, Ala. (WBMA) -\nThe deputy shot and injured in Randolph County was released from UAB hospital late Saturday evening, according to the Alabama Law Enforcement Agency.\n--\nAlabama Law Enforcement Agency says the State Bureau of Investigation is conducting an investigation following the shooting of a deputy in Randolph County.\nThe incident began as a domestic situation with an armed subject, according to State Trooper Chuck Daniel. The situation escalated when a Randolph County Deputy was shot, resulting in a standoff beginning around noon.\nThe standoff ended when the suspect died from an apparent self-inflicted gunshot wound.\nThe deputy who was shot is in stable condition and is expected to make a full recovery.\nALEA says the incident is not related to the events that have occurred across the nation this week.\n--\nAccording to officials at the scene, the suspect is now dead. The hostage at the incident, the suspect's wife, is OK.\nRandolph County Sheriff's Office confirms that a deputy who was shot has been transported to UAB (University of Alabama at Birmingham) Hospital.\nThe deputy shot in the Wedowee standoff is going to be OK, according to Alabama State Troopers.\n--\nRandolph County Chief Deputy Lane has confirmed that a deputy has been shot off of County Road 7 in Wedowee.\nA standoff situation has developed at the scene in Randolph County.\nThe injured deputy has been transported to UAB (University of Alabama at Birmingham) Hospital.\nSWAT from Oxford has been called to the scene.\nThe Alabama Law Enforcement Agency and Heflin law enforcement are also assisting at the scene."}