{"uri": "http://www.kirotv.com/news/news/teacher-infant-identified-whatcom-county-shooting/nm3mh/", "title": "Former teacher says she killed husband, toddler, then shot self", "dct": "Mon, 20 Jul 2015 12:00:00 GMT", "id": "de45320adbe6fb3da7758d47961e8d41", "content": "Former teacher says she killed husband, toddler, then shot self\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nWHATCOM CO., Wash. - The deaths cast a pall on the close-knit Lummi Nation School, where 59-year-old Michael Jordan was a special education teacher for nearly a decade. His 43-year-old wife, Erin Agren, worked there, too, until their 17-month-old son, Miles was born.\nQuick Facts:\nFamily says victims were husband and child of woman\nPolice say woman admitted to killing them\nReal estate agent found woman and two slain victims in upstairs bedroom\nAgent was about to hold open house in home near Bellingham\nThe deaths cast a pall on the close-knit Lummi Nation School, where 59-year-old Michael Jordan was a special education teacher for nearly a decade. His 43-year-old wife, Erin Agren, worked there, too, until their 17-month-old son, Miles was born.\n\"Even though they were both non-tribal members,\" said Lummi Nation Education Director Bernie Thomas, \"we are very close with people who come here and work with us and in a sense they're our invited guests.\"\nAccording to investigators, the family was discovered when a Realtor stopped by because he hadn't heard from them for some time. Steve Mullinex, once a Lummi Nation school teacher himself, heard Agren's cries for help and found the terrible scene.\n\"They were in the bed,\" said Whatcom County Undersheriff Jeff Parks. \"She shot both of them. Sometime later, we're not really clear on the time frame, right after that or if there was an extended period. But after that at some point, she shot herself.\"\nA source said the Whatcom County Sheriff's office was called to the home last spring; Agren was suffering from paranoid delusions. According to the Postpartum Support International of Washington, that can be a symptom of serious postpartum depression.\nAccording to court records, Agren was Jordan's second wife. His first marriage ended in 2010 after 20 years.\nNow an entire community is grieving his death and that of his young son.\n\"Grief is such a complicated thing,\" said Thomas. \"And I would say shock is in there.\"\nAutopsies will be performed Tuesday.\nAs for Agren, she is at St. Joseph Hospital in Bellingham. But they have been not to release any information on her condition.\nShe is facing two counts of first degree murder.\nLIKE KIRO 7 Eyewitness News on Facebook"}