{"uri": "http://www.wickedlocal.com/news/20161229/abington-man-who-shot-himself-now-faces-gun-storage-charges", "title": "Which Wicked Local site is All About You?", "dct": "Sun, 29 Jan 2017 06:57:23 GMT", "id": "04a33195dee7a7ebf16add9e46dea0f7", "content": "Although you'll find some news, photo galleries and videos here, what you really want to do is find the news that's All About You on your community's Wicked Local site. Find your town here or by choosing it in the pulldown menu above.\nRead more\nRead more\nDrowned Hogs make a splash at annual fundraisers\nThe Drowned Hog Swim and ChowderFest had participants shivering, then chowing down in Hull.\nRead more\nAbout 20 individual chefs and restaurants served up their best chili on Saturday.\nRead more\nPLYMOUTH SOUTH: Athlete of the Week\nThe G&G/Plymouth South Athlete of the Week is senior captain Jacob Stasiowski of the wrestling team. Stasiowski has a record of 16-2 and was a finalist at the Marshfield Holiday Tournament. He is a returning Div. 1 South section champion.\nRead more\nPLYMOUTH NORTH: Athletes of the Week\nThe Plymouth North Athletes of the Week are senior Julia Burke from the girls basketball team and Sean Campbell from the wrestling team. Burke led all scorers with 12 points in a recent win over Quincy, adding six rebounds and three blocked shots. Campbell won the 195 pound class at the Cape Con Invitational Tournament. He has a record of 19-3 this season.\nRead more\nHospital beds, and now doctors, often unavailable for people needing urgent psychiatric care in Mass.\nIt was Monday in the emergency department at South Shore Hospital and 14 patients, all in the throes of various mental health crises, were waiting idly as staff called around to find them psychiatric beds. About 13 miles away, at the privately owned Pembroke Hospital, 44 beds sat empty - and unavailable. Jason Tracy, the head of South Shore Hospital's emergency department, says Pembroke Hospital's decision to keep some of its 120 licensed psychiatric beds empty has put added pressure on his already overburdened department, which, like all other emergency departments in the state, serves as a de facto waiting room for people in need of urgent psychiatric care...\nRead more\nABINGTON - It's been 16 years since Christie Coombs' husband was killed in the Sept. 11, 2001, terrorist attacks, and 15 years since she began turning her grief into good deeds. The Abington resident and president of the Jeffrey Coombs Memorial Foundation was honored by the Boston Celtics' Heroes Among Us program on Friday for the support her foundation provides to military families. \"Someone in our communications group reached out to me and told me about her and the amazing work she does with the foundation honoring her late husband,\" Boston Celtics community engagement manager Sam Taub said...\nRead more"}