{"uri": "http://www.macon.com/2014/08/05/3233574/teen-shot-dead-in-southwest-macon.html", "title": "Teen fatally shot in head in southwest Macon", "dct": "Tue, 05 Aug 2014 05:59:00 GMT", "id": "d0b216e140be423267d3827af8fc03a4", "content": "A 16-year-old former Southwest High School student died from a gunshot wound to the head early Tuesday morning off Nisbet Drive.\nThe Bibb County Sheriff’s Office got the call of a shooting shortly before 4:30 a.m. after receiving an earlier call about shots fired.\nBibb County Deputy Coroner Lonnie Miley said Antrez Felder died inside a home at 308 Bobby Jones Lane, which is close to the cul de sac not far from the corner of Bobby Jones Street.\nFelder was wounded in the head, but it did not initially appear to be a suicide, Miley said. He said it might have been an accidental shooting.\nIt was not immediately clear, either, whether he was shot multiple times, but an autopsy is expected Wednesday morning.\n“It is just a tragic situation that we have a young person who has been killed this morning,” Miley said Tuesday.\nWitnesses at the house reported hearing gunfire.\n“Not multiple shots, from what I understand, there was just one shot heard,” said Lt. Randy Gonzalez, a public information officer for the Bibb County Sheriff’s Office. “We’re not ruling anything out right now. Investigators are still talking with witnesses. When you have a situation like this, you look at all avenues.”\nA Bibb County crime scene technician gathered evidence inside the house, which was roped off with yellow tape.\nCoroner Leon Jones said Felder was pronounced dead about 4:45 a.m.\nThe Southwest High School principal was notified about the death, according to officers at the scene. Bibb County schools spokeswoman Stephanie Hartley said Felder had attended Southwest High but was not enrolled there this year.\nAbout 6:20 a.m., students in Felder’s neighborhood emerged from homes to head to the bus stop on Nisbet Drive.\nOne girl with tears welling in her eyes clutched a binder as the students silently walked up the street.\nWhen asked if the teens knew Antrez, one of the young men nodded, but they were too upset to talk about what happened.\nCounselors are available at the high school for any students who want to discuss their feelings about Felder’s death, Hartley said.\n“He was a mannerable boy,” said Felder’s aunt, Stephine Colson.\nShe said he hoped to go into the military.\n“He was trying to finish school,” Colson said. “He was good in school. He didn’t act up.”\nFelder, known to friends as “GQ,” enjoyed “making people laugh all the time,” Colson said. “He had plenty of friends. ... What happened really was an accident.”\nTo contact writer Liz Fabian, call 744-4303."}