{"uri": "http://www.news4jax.com/news/jso-he-shot-himself-with-his-own-gun", "title": "JSO: 'He shot himself with his own gun'", "dct": "Fri, 15 Jan 2016 22:53:00 GMT", "id": "abb81a28c1c919fcaefc9dcc940dbe5f", "content": "JACKSONVILLE, Fla. - A Jacksonville Sheriff’s Office DUI officer stopped a vehicle Friday night for having no headlights when he heard a single gunshot go off while questioning the driver.\nThe DUI officer stopped a vehicle at the intersection of Philips Highway and Baymeadows Road. The vehicle pulled into the Kangaroo station. When the DUI officer got out to approach the car, he made contact with the female driver.\nThere were six people in the car including an infant. The female driver was asked to step out and back to his cruiser, so the officer could talk to her further and get her ID and information. The officer thought he smelled the odor of marijuana.\nWhile interacting with the driver, the officer heard a gunshot from the vehicle. His first instinct was to draw his firearm.\n\"All these people start getting out of the car. They come to the back of the vehicle, it's a SUV, they open the back hatch and there's a male hiding in the luggage compartment and now he's got a gunshot wound to his abdomen,” said Lt. Jimmy Judge, JSO. “So through investigation we learned what he was trying to do was he was trying to hide the gun, because they also had some drugs in the car. He was trying to hide the gun, and he shot himself with the gun. With his own gun.”\nThe infant belonged to the female driver who said they were actually taking the baby to the hospital for a high fever.\nBoth the baby and the injured man were taken to the hospital by rescue services.\nThere were some pills and other narcotics found in the vehicle.\n“We do have some pills in the car, we haven't tested them yet,” Judge said. “So we do have some narcotics, we just don't know what kind it's still pretty early in the investigation.”\nOne of the passengers had a warrant for burglary and so he will be arrested.\nPolice said the only thing that makes this newsworthy is that when this guy shot himself accidentally he was detained by police.\n“He was in a car that was stopped by police, that's what makes this a bit more interesting,” Judge said.\nCopyright 2016 by WJXT News4Jax - All rights reserved."}