{"uri": "http://www.mlive.com/news/muskegon/index.ssf/2013/12/armed_and_dangerous_deontay_de.html", "title": "'Armed and dangerous': Muskegon's Deontay Demarco Black-Wickliffe sought by police in Fruitland Township fatal shooting", "dct": "Mon, 23 Dec 2013 21:29:00 GMT", "id": "00cef2fddc719d15dd370244a538193b", "content": "MUSKEGON COUNTY, MI -- Deontay Demarco Black-Wickliffe, known as “Tay” to his friends, is being sought by police for his involvement in the shooting death of a 21-year-old Muskegon Community College student and the injury to three others.\nBlack-Wickliffe, 22, of Muskegon, is considered \"armed and dangerous,\" authorities said, and was actively being sought by law enforcement officials late Monday night, Dec. 23, in connection with Saturday's shootings that occurred at a Fruitland Township house party.\nGary Lee Ogreen was fatally shot during the 3:30 a.m. incident, police said.\nThe Muskegon County Sheriff’s Office released this statement late Monday night:\n“Black-Wickliffe was involved in a shooting in Muskegon County where one subject was fatally shot and three others were wounded. Black-Wickliffe has valid warrants for open murder, three counts of assault with intent to murder, and felony firearm.”\nA reward up to $5,000 is being offered for information that leads to the arrest and conviction to those involved.\nA warrant for Black-Wickliffe's arrest was signed by a judge Monday, authorities said.\nBlack-Wickliffe is described as a black male, 6 feet tall, weighing about 170 pounds.\nIn addition to Ogreen's fatal shooting, three others were injured. The shooting was reported 3:30 a.m. Saturday, Dec. 21 after a group of uninvited guests showed up to a house party in the 2300 block of West McMillan Road in Fruitland Township.\nPolice say Black-Wickliffe was one of those uninvited guests who refused to leave without a fight.\nOgreen played baseball and football at Reeths-Puffer High School where he graduated. He also played baseball at Muskegon Community College.\nOne person at the party, who is not suspected of being the shooter, is being held on other charges, Muskegon County Sheriff Dean Roesler said.\nOgreen died at the scene of the shooting.\nThree other men were injured in the shooting:\n• Cody James Sharlow, who was shot in the stomach and hip area, has been upgraded from critical to fair condition, Mercy Health Muskegon spokeswoman Joan Kessler said Monday morning.\n• Nicholas Aaron Gifford, shot in the right thigh, has been upgraded from serious to fair condition, Kessler said.\n• Medical staff as of Sunday had treated and released Julius Scott Pamer, who was shot in the buttocks.\nRoesler said that every indication so far in the investigation is that the shooting arose out of a confrontation between the uninvited guests and those already at the house party. The argument escalated to a physical confrontation. The indication so far is that one member of the uninvited group became upset and pulled out a handgun, Roesler said.\nAnyone with information about Black-Wickliffe's whereabouts is asked to call 911, Silent Observer at 72-CRIME or the sheriff's office at 231-724-6308 or 231-206-9476.\nHeather Lynn Peters covers police and fire, and writes a statewide food column, The Spunky Kitchen, for MLive/Muskegon Chronicle. Email her at hpeters@mlive.com and follow her on Twitter @HLPNEWS."}