{"uri": "http://www.waff.com/story/24426895/shooting-sends-multiple-victims-to-hospital", "title": "Shooting sends multiple victims to hospital", "dct": "NODATE", "id": "3f017a86ba78df566c13f89ae3c3b770", "content": "HUNTSVILLE, AL (WAFF) -\nHuntsville police responded to a shooting at Benchwarmer early Sunday morning.\nOfficers responded to the shooting at the University Drive business around 12:40 a.m. Upon arrival, officers said they saw multiple juvenile shooting victims, who were transported to Huntsville Hospital with non-life threatening injuries.\nPolice said an offender, a juvenile, was taken into custody at the scene. Madison County Sheriff Deputies said he is being held at the juvenile detention center.\nThe offender's name has not been released. The investigation is ongoing.\nHuntsville City Councilman Will Culver expressed concerns about the bar, which is located in his district.\n\"How did juveniles get into the facility?\" Culver asked. \"How did they get access to weapons? When you have places where alcohol is being served and you have guns, that is a recipe for disaster.\"\nHe believes the shooting was preventable and warrants a review of the business by taking a look at a history of events there.\n\"We certainly don't want to prejudge anyone, but to me, this was just the straw that broke the camel's back,\" Culver said. \"We've had incidents here before. I am certainly going to be talking to our liquor license review committee to see what it is that we can do to keep our citizens safe.\"\nCulver said he is open to discussing the bar's future with its owner, but he hasn't spoken with him yet. He plans to schedule a review with the liquor license review committee on Monday.\nRemember, when breaking news happens, we break it first online, by email, and by text. If you want to receive our breaking news alerts by text, pull out your phone right now and text NEWS to 44848. Message and data rates may apply. You can text STOP at any time to cancel your subscription, text HELP for more information, or call 877-571-0774 for support.\nCopyright 2014 WAFF. All rights reserved."}