{"uri": "http://q13fox.com/2014/02/11/victims-family-wants-owner-of-shotgun-prosecuted-after-son-killed-in-accidental-shooting/", "title": "Victim’s family wants owner of shotgun prosecuted for accidental shooting", "dct": "Tue, 11 Feb 2014 15:15:00 GMT", "id": "fd8f13119cad12c9b9e24c13c8f30fdc", "content": "PUYALLUP — The accidental shooting that killed 13-year-old Eddie Holmes now has the boy’s family pleading with lawmakers to make a change.\nHis parents also want the owners of the gun to be prosecuted.\nThe Holmes family spoke to the media at the Puyallup Police Department Tuesday morning. And while they don’t blame the boy who accidentally shot their child – they believe his parents, the owners of the shotgun, should be prosecuted.\n“Those were Eddie’s friends,” said a sobbing Sandra Aponte Holmes, Eddie’s mother. “My heart does go out to them, but Eddie’s not here.”\nAn emotional Holmes family still struggles to cope with the loss Eddie.\n“My brother, he was a good kid,” said Eddie’s older brother, Jose Holmes. “Great personality that everybody could love.”\nThe shooting happened last week inside a home on 11th Street in Puyallup. Five boys were inside when one of them pulled out his stepfather’s shotgun from behind a bedroom headboard.\nOne of the boys pumped the shotgun – and it fired directly into Eddie’s chest, killing him.\nPolice call the shooting an accident but the shooter was arrested and faced a judge last Friday. The 13-year-old suspect was released from juvenile detention on Tuesday while prosecutors continued looking at all the evidence in the case.\nEddie’s family says the shotgun owner should have made sure the gun couldn’t fall into a child’s hands.\n“Because our state has yet to agree on locking and securing guns, I’m left with the unbearable task of planning the funeral of my 13-year-old son,” said Sandra.\nProsecutors say the shooter’s parents could face charges but so far none have been filed.\n“It is my hope that speaking out today motivates just one person to secure their gun, my son Eddie Zee Holmes’ life would not have been taken in vain,” said Sandra.\nShe hopes gun owners across Washington state will take better care to store and secure their firearms.\n“As only a mother whose child has been killed by gun violence can know, this pain that I am feeling is so unbearable,” said Sandra.\nEddie’s funeral is Saturday at New Tacoma Cemetery at 1 p.m. The family says the public is invited to attend."}