{"uri": "http://www.stltoday.com/news/local/crime-and-courts/suspect-may-have-gone-on-missouri-killing-spree-after-finding/article_ce9f62ae-77fb-5bc8-8acf-7528549a174b.html", "title": "Family members of shooter among 7 slain by Missouri gunman who then killed himself", "dct": "Sat, 28 Feb 2015 00:00:00 GMT", "id": "4bb5fc0d9cd95f10e39b1dc2069c7aa1", "content": "TYRONE, Mo. • An urgent 911 call from a teenage girl summoned deputies to a murder scene. They found another bloody scene, then another.\nAll told, seven people from two families were fatally shot late Thursday night in four different homes in south-central Missouri’s Texas County, presumably by a man who then killed himself in his pickup about 15 miles away. He was related to four of his victims, and lived near the others.\nBefore investigators found his body in the truck before dawn Friday morning, they also found that of his mother at the home they shared. She had been ill, and authorities say she had been dead for about a day of natural causes when she was found. They speculated that discovering her body may have set him off.\nOne person he shot survived and identified him to deputies.\nTwo children of victims also survived.\nThe killings took place shortly after 10 p.m. Thursday in and near Tyrone, a small unincorporated community about 165 miles southwest of St. Louis. Tyrone is barely more than a cluster of homes along County Route H surrounded by rolling Ozark cattle pastures.\nAuthorities identified the gunman as Joseph Jesse Aldridge, 36, whose body was found in his pickup on a road just across the county line in neighboring Shannon County.\nInvestigators identified four of the shooting victims as:\n• Garold Dee Aldridge, 52, and Julie Ann Aldridge, 47, a married couple, found in their home in Tyrone.\n• Harold Wayne Aldridge, 50, and Janell Arlisa Aldridge, 48, a married couple found in their home in Tyrone.\nThe gunman was a cousin of the male victims, who were brothers.\nAuthorities named the other victims as:\n• Darrell Dean Shriver, 68, found dead in his home just east of Tyrone. His wife, Martha Shriver, 67, was wounded in the same shooting but survived.\n• Carey Dean, 46, and Valirea Love Shriver, 44, found in their home. He was the son of Darrell and Martha Shriver, and the two couples lived near each other.\nAlso living nearby was the gunman and his mother, Alice Aldridge, 74, who was found dead in the frantic searches as authorities tried to find her son.\nRelatives said Darrell Shriver was a prominent resident in Texas County whose family owned a large cattle farm, a cabinet-making company near Tyrone and an auto dealership in Springfield, Mo., which is about 70 miles to the west. At the entrance to the driveway for Darrell and Martha Shriver is an antique farm implement decorated with the word “love.”\nIn a news conference, Texas County Sheriff James Sigman said he hadn’t determined a motive for the killings. But earlier Friday, county Coroner Tom Whittaker said the death of the gunman’s mother may have been the spark.\n“We’re speculating that he came home and found her deceased and then for whatever reason went on a rampage and started killing people,” Whittaker said. “This is just so strange. Right now, with the shooter dead, we don’t know.”\nA CALL FOR HELP\nThe complicated case began at 10:15 p.m. with a 911 call from a teenage girl who said there had been a shooting in her home, authorities said. She had fled to a neighbor’s home, where she made the call.\nAs word spread, other people discovered more shootings.\nJohn Shriver, 72, a cousin of Darrell Shriver, said Martha Shriver called him frantically asking him to find her son. John Shriver went to Carey and Valirea Shriver’s mobile home to check on them, but got no response.\n“I pounded on the door. I opened the door and hollered,” Shriver said. Entering a bedroom, he saw Carey Shriver face-down on the floor. He said Valirea Shriver was nearby.\n“I thought they were dead, but I didn’t know why, how or what,” Shriver said.\nHe said the couple’s son, 13, was unharmed in his own bedroom. He told Shriver he hadn’t heard anything. Shriver said he had taken the boy to his home until relatives came to get him.\nMeanwhile, Shriver saw an ambulance leaving Martha Shriver’s home, apparently taking the injured woman to a hospital.\nDeputies searching for the gunman checked his home, finding his mother dead. Whittaker said that she had been under a doctor’s care and that she apparently had died of natural causes about a day before.\n“The only reason she was found is that they had gone to her house to see if the shooter was there,” Whittaker said.\nWhittaker, who has been coroner since 1997, said the county averaged maybe one homicide a year. “We may go a year or two without any,” he said.\nWhittaker said authorities were astounded Thursday and Friday as they kept finding bodies over a 3½ hour period.\n“At first I thought, ‘I have three victims,’ then we keep finding more victims,” he said. “It’s kind of like, ‘Oh gosh, what have we got here?’ It’s spread over miles.”\nThe suspect’s body was found about 5 a.m. Friday in his GMC pickup truck with the engine still running on Route WW, southeast of Tyrone. Shannon County Coroner Tim Denton said Joseph Aldridge had shot himself in the head with a handgun.\nThe coroners, Whittaker and Denton, said autopsies would be performed by a pathologist in Springfield, Mo. The autopsies will start over the weekend and perhaps extend into next week.\nCLOSE-KNIT COMMUNITY\nTyrone, a community of a few dozen people, is southeast of Houston, Mo., the seat of Texas County. Houston Mayor Don Tottingham said, “This is a terrible tragedy in a community that’s real close-knit,” he said. “This is a great town, and this is why it’s such a tragedy because it shows you’re vulnerable to things.”\nSome residents bristled as so many reporters from St. Louis, Springfield and Kansas City descended upon their community, but others patiently answered questions. June Evans, a neighbor of the Shrivers, said Carey and Valirea Shriver were building a large new home nearby while they lived in the mobile home. Evans said Carey Shriver was a talented woodworker and a good neighbor who pulled her car from a snowy ditch earlier this week.\nJoyce Ice, a Postal Service carrier for the Tyrone area, said she ran into the suspect a few days ago and asked him about his mother’s health. Ice said he had told her she wasn’t doing well.\nDick Choate, 69, another area resident, reflected upon the mystery of Aldridge’s motive. “Even rational people get emotional and have a hard time controlling themselves,” Choate said. “If they are a little bit less than that, maybe it’s more difficult. … He had to be out of his mind.”\nInvestigators said Joseph Aldridge had had a minor police record.\nThe mayor said he hoped the community would pull together and try to figure out how this happened. He said he couldn’t begin to understand what had motivated this man to do what he did. He didn’t know the gunman. However, the mayor used to be a letter carrier for many years, and the shooter’s family was on his route.\n“It’s really a terrible shock,” he said. “I think it brings you a little closer together. I think sometimes tragedies like this pull everyone together to try to figure out how to prevent this from ever happening again.”\nSaid Sigman, “Start locking your doors. The world is changing. You got to be safe.”\nTim O’Neil of the Post-Dispatch contributed to this report."}