{"uri": "http://www.kansascity.com/news/state/missouri/article11329577.html", "title": "In tiny Tyrone, Mo., ‘half of the town got killed last night’", "dct": "Fri, 27 Feb 2015 07:31:00 GMT", "id": "9d26a95255ac081ebf7040e13df2e855", "content": "In this tiny community, just a smattering of homes along two blacktop roads, residents can’t understand what made a man rip through homes of relatives and other neighbors on a killing rampage.\nIn all, authorities said, Joseph Jesse Aldridge, 36, gunned down seven people — four of them relatives — Thursday night in south-central Missouri before killing himself. Amid the mayhem, authorities also found Aldridge’s mother, Alice L. Aldridge, 74, dead in her home from what appeared to be natural causes.\n“The town is devastated,” resident Nora Shriver said Friday afternoon as mounds of dirty snow from past storms covered the Texas County landscape, 95 miles east of Springfield. “Half of the town got killed last night.”\nShe and her husband, John, counted three of the victims as family.\nMany in Tyrone, where Aldridge family members make up much of the population, think that finding his mother dead on the couch may have sent the son over the edge.\n“He just lost it,” said one resident, who wanted to remain anonymous because few details about the family had been released by officials. “They think when she died, he went berserk and took it out on everybody else.”\nAuthorities say Joseph Aldridge traveled to four homes in the dark of night, shooting each victim multiple times with a .45-caliber handgun. The first 911 call, at 10:15 p.m., came from a girl who had run to a neighbor’s house barefoot through the snow and single-digit temperatures after she heard the gunshots that killed her parents.\nMost victims were found on the floors of their bedrooms, said Texas County Coroner Tom Whittaker.\n“One lady was still in the bed,” Whittaker said. “You could tell she was trying to cover her face. She had pulled a pillow up.”\nAnother man and woman appeared to have opened the door for Aldridge before they were shot.\nThe Missouri Highway Patrol identified four of the victims as Garold Dee Aldridge, 52, and his wife, Julie Ann Aldridge, 47; and Harold Wayne Aldridge, 50, and his wife, Janell Arlisa Aldridge, 48. The two men were cousins of Joseph Aldridge.\nAuthorities did not release the names of the three remaining victims Friday. But Nora and John Shriver identified them as John’s cousin Darrell Shriver; Darrell’s son, Carey Shriver; and Carey’s wife, Valerie Shriver. Darrell’s wife, Martha, was shot but survived. Family members said she had undergone surgery in a Springfield hospital.\nThe killings, according to authorities, occurred within about 3 miles of one another. None of the homes had signs of forced entry.\nInvestigators were confident they had found all the victims.\n“We checked a wide area, door to door,” said Texas County Sheriff James Sigman. “We checked other family members in other areas.”\nWhen Whittaker first got the call, he was told he had two crime scenes, three fatalities and one survivor.\n“I got to the first house, and I had two bodies there,” Whittaker said. “They said, ‘You got another one off down (Highway) 137. I see a sheriff’s deputy and he says, ‘Well, I have this older lady down here and it appears to be a natural death.’”\nThen, within Whittaker’s sight, emergency lights flashed at another crime scene. And before long, he heard of yet another, with two more bodies.\n“I’m thinking, ‘What is this guy doing? What have people done to cause him to go around and start killing everybody?’”\nAuthorities fanned out along county roads and highways, searching for Aldridge. Officers found him before dawn Friday, slumped over in a GMC pickup in the middle of a highway in Shannon County, just to the east.\nHe had spent time in federal prison after pleading guilty in 2008 to possessing a firearm, a .22-caliber handgun, while being a user of marijuana, according to federal court records. He was sentenced to 21 months in federal prison and was released in February 2010.\nResidents in the Tyrone community say he was quiet and kept to himself. He had lived with his mother for several years.\n“I think the whole area is in shock right now,” said Jack Watson, who lives in Solo, Mo., about 5 miles west of Tyrone. “It’s going to affect it (the area) big-time.”\nTexas County hadn’t had a homicide in about 11/2 years, Sigman said. And the deadliest crime Whittaker has worked in nearly 18 years as coroner was a double homicide.\n“Crime like this in any community is pretty major,” Sigman said. “It’s not something you’re used to seeing.”\n‘She was screaming’\nJohn Shriver had already gone to bed when the phone rang at 10:30 Thursday night. It was Martha Shriver.\n“She was screaming,” Shriver said. “She was panicked. She wanted Carey. ... And she couldn’t get a hold of him.”\nJohn Shriver got dressed and went down to Carey Shriver’s home. No answer at the door. He went in and found Carey and Valerie Shriver dead on their bedroom floor.\nWhere was the couple’s son? He hollered, but no answer.\nOutside, John Shriver said he saw a state trooper and county deputy and flashed his lights at them. After telling them what he had found at his relatives’ home, John Shriver led them back to the house.\n“They have a boy,” Shriver told the officers. “But I couldn’t find him.”\nIn a bedroom, at the opposite side of the home as his parents’ room, they found a 13-year-old boy in his bed.\nOne of the officers shined a flashlight, waking him.\nHe hadn’t heard a thing.\nJohn Shriver took the boy back to his home. The boy, who had been told by officers about his parents’ deaths, was quiet along the way.\nThe boy’s sister, a college student in Springfield, picked him up Friday morning.\nUnanswered questions\nJust after dawn Friday morning, on buses headed to schools inside the Houston R-1 School District, children spoke of little else.\nSome of the district’s 1,000 kids come from Tyrone. Others have family and friends who live in that area.\n“We have a lot of scared and confused students here today trying to make sense of this,” said Scott Dill, superintendent of the Houston district, who received a call Thursday night about the killings. “My kids are shaken up, every single one of them.”\nIn nearby Summersville R-II School District, administrators and teachers had been alerted to the shooting rampage. Some children in the district were related to those who died.\nThose children, said Superintendent Merlyn Johnson, weren’t at school Friday.\n“We’re ready for when these students come back,” Johnson said.\nYears ago, Tyrone was more of a town, with a store, even a small school and post office. Now it’s mainly homes and fields, where cows graze off the main roads.\nAfter Thursday evening, it will be known for a mass killing committed by a man who had grown up in the area and was related to many in his tiny community.\n“It’s kind of hard to figure out if him finding her deceased caused some problems with him, as far as getting a little bit crazy,” said Whittaker, the county coroner. “We just won’t know for sure. That’s the horrible thing about this. With him deceased, there are going to be a lot of questions that go unanswered.”\nThe impact, residents said, will be felt not only by people outside Tyrone and throughout Texas County, but across the region.\n“If you’re not related by blood, you are related by bonds of friendship,” Dill said. “This is small-town America. When we cry, we all cry together down here.”\nThe Star’s Tony Rizzo contributed to this story.\nTo reach Laura Bauer, call 816-234-4944 or send email to lbauer@kcstar.com.\nTo reach Donald Bradley, call 816-234-4182 or send email to dbradley@kcstar.com.\nTo reach Glenn E. Rice, call 816-234-4341 or send email to grice@kcstar.com."}