{"uri": "http://theavtimes.com/2016/11/08/security-guard-found-shot-to-death-in-lancaster/", "title": "Security guard found shot to death in Lancaster [update: victim ID’d]", "dct": "Tue, 08 Nov 2016 00:00:00 GMT", "id": "3c79eb193862a72b66aaf0aacb44c3c6", "content": "LANCASTER – Authorities are investigating the circumstances surrounding the death of a security guard Monday night outside a strip mall in Lancaster.\nThe security guard, described as a 21-year-old Hispanic male, was found suffering from a gunshot wound to the head in a vehicle parked in the parking lot of the strip mall in the 1700 block of East Avenue J in Lancaster, according to a news release from the Sheriff’s Information Bureau.\nThe incident was reported around 7:04 p.m. Monday, Nov. 7, and the victim was pronounced dead at the scene by paramedics. His name is being withheld pending next of kin notification.\nHomicide detectives said the victim was sitting in the car with another security guard when the shooting occurred.\n“Something happened inside the car where one of security guards’ gun went off. One security guard gets shot and he ends up being pronounced dead here at the scene,” Sheriff’s Homicide Lieutenant John Corina said late Monday night. “We’re in the process of trying to determine exactly what happened between these two guys.”\n“Was it an accident, suicide, intentional? We don’t know yet,” Corina added.\nThe victim’s gun was recovered inside the car at the scene, sheriff’s officials said.\nThe victim was a security guard who worked for Lancaster-based Opsec Specialized Protection, an employee of the company said at the scene.\nThe investigation is ongoing and there is no additional information available at this time, sheriff’s officials said in the news release.\nAnyone with information about this incident is encouraged to contact the Los Angeles County Sheriff’s Department’s Homicide Bureau at 323-890-5500.\nUPDATE: The victim has been identified as 21-year-old Ulysses Darious Escobar of Littlerock, according to coroner’s Assistant Chief Ed Winter. “[The shooting] was reported as a possible accident, but it is still under investigation by law enforcement,” Winter said Tuesday afternoon.\n–"}