{"uri": "http://www.mlive.com/news/flint/index.ssf/2016/01/neighbors_of_3-year-old_killed.html#incart_river_index", "title": "Adults unaware gun was in home where 3-year-old shot himself, police say", "dct": "Mon, 25 Jan 2016 10:15:00 GMT", "id": "b3713c8e516bb9b527c1c24b61e644ed", "content": "FLINT, MI --Police are still unsure how a toddler got hold of a gun that he used to shoot and kill himself.\nPolice say the 3-year-old boy found a 9mm pistol and accidentally shot himself in the head just before 11:30 p.m. Wednesday, Jan. 20.\nHe was pronounced dead at the home.\nFlint police Chief James Tolbert said four adults and three children were at the home, which belonged to the child's great-grandparents, of the time of the incident. The adults included the child's mother, the two homeowners and a relative, Tolbert said.\nTolbert said investigations suggest the adults were not aware there was a gun in the home. Now, he says, police are trying to find out whose gun it was, where it came from and how it got into the hands of a toddler.\nLocal authorities are pulling in help from the Bureau of Alcohol, Tobacco, Firearms and Explosives to trace the gun and find out where it came from, and how it got in the home.\nA woman answered the door at the home in the well-kept University Park Estates subdivision Thursday morning, tearfully identifying herself as the boy's \"auntie.\" She declined to comment on behalf of the family, but did say they are still struggling to understand and come to grips with the loss.\nPolice said in a news release that the child found got the weapon from an \"unknown location.\"\nFlint police Chief James Tolbert said Thursday afternoon that investigators do not know exactly how the incident unfolded, or where the gun came from.\nRegardless, neighbors of the family in the homey subdivision were taken back by the news.\nTimika Hartwell answered the door with two young children not far behind.\n\"It's a big shock. It's really scary,\" Hartwell said, adding that her family does not keep guns in the house. \"That is a big fear of mine, because we have children.\"\nA man named James Outlaw said it's common to see neighborhood children playing together outside, although he didn't know exactly which child was involved in the incident. He described them as \"a nice family.\"\n\"It's really tragic. It's a tragedy. This hurts,\" he said. \"Hopefully we can learn something from this.\"\nHe continued: \"Gun control. Safety locks -- anything to save a child's life,\" he said. \"I just wanted to extend my prayers to the family.\"\nThe two surviving children that were in the home were taken by Child Protective Services for evaluation, Tolbert said. He did not know Thursday afternoon if they were released back to the mother.\nNo arrests were made in the case, and Tolbert said they are still gathering more information about the incident.\n\"We've still got a lot of work to do to try to determine the ownership of the weapon,\" he said.\nFacts gathered during the investigation will be forwarded to Genesee County prosecutors for review, Tolbert said."}