{"uri": "http://wkrn.com/2015/10/22/police-3-shot-1-injured-on-tsu-campus/", "title": "19-year-old from Memphis killed in TSU shooting", "dct": "Thu, 22 Oct 2015 23:43:00 GMT", "id": "7330c4136ebfa60a08b0a351bed9b534", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nNASHVILLE, Tenn. (WKRN) – A Memphis teen was killed and three students were injured in a shooting on Tennessee State University’s campus late Thursday night.\nMetro police spokesman Don Aaron said the shooting, which took place in a courtyard behind the Floyd-Payne Campus Center around 11 p.m., happened after a dispute over a dice game.\nAaron said as the argument progressed, it led to a fist fight and “suddenly shots were fired.”\nCameron Selmon, 19, was killed. He was not a student at the university.\nThree 18-year-old students who were walking in the area at the time of the shooting were injured by stray bullets.\nPolice reported two of them were transported to Vanderbilt University Medical Center but have since been released. The third injured victim did not need treatment.\nInformation regarding a suspect, who fled the scene after the shooting, wasn’t immediately released.\nFurther details weren’t immediately known. The investigation is ongoing.\nAuthorities said several students recorded the incident on their cell phones, some of whom left before police arrived. They’re now urging any students with video of the fight or shooting to contact them at 615-862-8600 or Crime Stoppers at 615-74-CRIME.\nThe Bureau of Alcohol, Tobacco, Firearms and Explosives is offering a $5,000 reward for information that leads to an arrest. People can also qualify for a $1,000 reward from CrimeStoppers.\n——————————-\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nTSU President Dr. Glenda Glover and Assistant VP of Public Relations told News 2 they’ve spent around a million dollars making improvements on campus.\nThey’ve hired more officers and security guards, added a fence to the campus’ south side, and installed better lighting as well as more security cameras.\nThey also told News 2 there were about four to five security guards on campus at the time of the shooting. But sources with the Metro Nashville Police Department told News 2 there were only two security guards on the campus at the time.\nLate Friday afternoon, Mayor Megan Barry addressed the public alongside President Glove and announced Metro-Nashville police officers will now conduct nighttime patrols on campus to supplement the TSU police department.\n“Despite the shooting incident last night, we believe the TSU campus is a safe place,” Mayor Barry also said. “Our police department will work with Dr. Glover and the TSU Police Department to help ensure it stays that way.”\nPresident Glover also released a public statement Friday afternoon, saying their campus “was the setting for this heinous crime.”\n“It is important that you share what you know with authorities. I am so very proud of the manner in which our students conducted themselves throughout this tragic ordeal,” she added. “I’m also very appreciative of those that have already shared information and ask others to step forward as well.”\nIn light of the shooting, Glover said all students must wear their TSU-issued student ID while on campus.\n“It must be visible at all time,” she said. “This is a requirement.”\nMORE: TSU President Glenda Glover’s full statement\n“This incident presents us with a challenge that I am confident we will overcome as a family,” Glover concluded. “I ask you to continue to pray for our three students and their families and for the entire TSU student body during this time.”\nBishop Joseph Walker III, the bishop of Mt. Zion Baptist Church,told News 2 it breaks his heart to see something like this happen at TSU.\n“Such an incredible institution. To have these kids come to school to get an education and something like that to happen, so senseless like that, and elements that come on campus and create these acts of violence, it’s just horrible,” Bishop Walker said.\n“Just because of one act of violence or another act of violence, it will not tarnish the legacy of this school,” he added.\nThe university resumed its normal schedule of operations Friday, including all activities. A school official told News 2 classes are scheduled Monday through Thursday, and there are never any on Fridays.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}