{"uri": "http://www.wsmv.com/story/30332703/1-killed-3-others-injured-in-shooting-on-tsu-campus", "title": "Man killed, 3 students injured in shooting at TSU campus", "dct": "Fri, 06 Nov 2015 10:20:00 GMT", "id": "dfc42a4a5ab7ecdd5e4e8a4390af6714", "content": "NASHVILLE, TN (WSMV) -\nThe search continues for the gunman after four people were shot during an apparent dice game on the Tennessee State University campus.\nA 19-year-old man was killed and three others were injured when shots were fired just before 11 p.m. Thursday in a courtyard behind the Floyd-Payne Campus Center on John A. Merritt Boulevard.\nPolice said an argument started during the dice game, which escalated into a physical fight, and then gunshots rang out.\nThe 19-year-old who was killed has been identified by police as Cameron Selmon of Memphis. Selmon was not a student at the university.\nThree 18-year-old female TSU students who were walking by the area were also shot. One woman was grazed by a bullet, and another was treated at Vanderbilt University Medical Center and later released. The third woman remains hospitalized in stable condition and is expected to recover. Their names have not been released.\nMetro Nashville Police Department spokesman Don Aaron stressed this was an \"isolated incident\" and that no other students on campus were or are in danger. A campus-wide lockdown that lasted several hours has been lifted.\nPolice said they have recovered a pistol from the courtyard where the shooting took place.\n\"I can tell you that multiple shots were fired. We don't know at this point, until we analyze the evidence that we have recovered, how many weapons might have been involved. It could be one weapon. ... I can't confirm that at the moment; we just don't know yet,\" Aaron said.\nAccording to Aaron, several students were there when the fight took place, and some of them were recording video and pictures.\n\"There were a number of students who took out their cellphones and began recording as the fight was taking place. We have seen some of that video from cooperating students,\" Aaron said. \"Obviously people scattered when the shots were fired, so we know that there are other students who have video who may have good knowledge of the parties involved in this.\"\nPolice said they don't have enough information to release a description of the gunman.\n\"If we had a good description of the shooter to give you, we would be putting that out. I would also remind you the report of the shots fire was at 10:52 and it was very dark,\" Aaron said.\nPolice are urging any TSU students who have videos or information about the shooting to call them at 615-74-CRIME.\n\"The person who fired those shots put innocent persons in extreme danger in this isolated incident,\" Aaron said. \"We're hoping that the TSU students who have this video, may have knowledge, understand that this person put them in danger tonight and will report what they know.\"\nAll on-campus activities are scheduled to go on as normal on Friday. The university does not hold scheduled classes on Fridays.\nAt a news conference Friday afternoon, Mayor Megan Barry said Metro police will add walking patrols on TSU’s campus beginning Friday night.\n“In response to the gunfire on TSU’s campus Thursday night, Nashville police early today offered to assign the North Precinct flex officers to provide walking patrols on campus in the nighttime hours to supplement the work of the TSU Police Department,” Barry said.\nTSU President Dr. Glenda Glover was also at the new conference. She said all students and their parents have been informed of what happened.\nA $5,000 reward is being offered for information leading to an arrest in the shooting. Anyone with information is asked to call 615-74-CRIME.\nTerrifying and frustrating are the two words people who live nearby used to describe this situation. This is the second shooting within two weeks that has involved TSU students.\n\"I heard them, it was like four or five shots, and then I put on the news where college students got shot, two women got shot and the bullet wasn't even meant for them. That's scary,\" said Tonia Kelly, who lives near the school.\nCampus officials said the men involved do not attend TSU, but now that students who were bystanders are hurt, some believe the school needs more security.\n\"They say it's not the people on the campus. That can't be possible. Eleven o'clock at night, it's the students on this campus. You know they need to put more protection, pay attention to these students and stop this violence,\" Kelly said.\nOfficials have been struggling to make the area surrounding TSU safer in recent years. Just last week, three people were shot outside a house party near campus. So far, no one has been arrested in connection to that shooting.\nSome students were upset and concerned for their safety, saying the university did not send out any alerts after that shooting. TSU officials told Channel 4 an alert was not sent out for that incident because the shooting took place off campus.\nThursday night's shooting was different. TSU officials said an emergency alert was sent out to students around 11:20 p.m.\nAccording to TSU's latest crime awareness report, there have been dozens of robberies, assaults and burglaries on campus over the past three years. A special community board has been meeting over the past year looking at ways to keep students safe from violent crimes. Members agree that something has to change, but right now, it's not clear what.\nThis comes as state lawmakers consider allowing legal guns on college campuses across the state. A new proposal would allow faculty and staff to carry firearms if they have a valid permit. The issue came up earlier this month as state senators evaluated security on college campuses.\nTSU: All campus activities canceled today. This follows deadly shooting at school courtyard. Police leaving scene pic.twitter.com/u5Ho4RDta4\n— Briona Arradondo (@BrionaWSMV) October 23, 2015\nCopyright 2015 WSMV (Meredith Corporation). All rights reserved."}