{"uri": "http://www.wdbj7.com/content/news/Large-police-presence-crime-scene-tape-around-Northwest-Roanoke-home-380989271.html?utm_medium=social&utm_source=twitter_WDBJ7", "title": "UPDATE: 11-year-old child dead after being shot by 10-year-old in Roanoke home", "dct": "Thu, 26 May 2016 12:55:00 GMT", "id": "35fc9155d0cb2cfa0e302f53a4778929", "content": "ROANOKE, Va. (WDBJ7) Roanoke Police say a 10-year-old shot and killed an 11-year-old inside a Roanoke home Thursday.\nThe shooting happened around 12:20 p.m. in the 2000 block of Carroll Avenue NW.\nInvestigators believe the boys found a handgun in the home and started playing with it. The 11-year-old boy was pronounced dead at the scene. The 10-year-old boy called 911 after the shooting.\nAt this time, detectives believe no one else was inside the home when the shooting happened.\nNo charges have been filed. Detectives have been in consultation with the Roanoke City Commonwealth’s Attorney about the investigation.\nHere is the complete announcement:\nOn May 26, 2016 at 12:18 p.m. Roanoke Police were dispatched to the 2000 block of Carroll Avenue NW to investigate a shooting.\nThe preliminary investigation indicates that two juvenile boys found access to a handgun inside the residence. Both boys were playing with the handgun when one of the juveniles, a 10-year-old boy, shot the other boy, an 11-year-old, with the handgun. The 11-year-old boy was pronounced dead at the scene. The 10-year-old boy called 911 after the shooting.\nAt this time it appears that no one else was present inside the residence when this incident took place. Detectives are continuing to conduct interviews and evidence technicians continue to collect and analyze evidence. The investigation is on-going. Detectives have been in consultation with the Roanoke City Commonwealth's Attorney's.\nNo charges have been placed at this time. Further evaluation of potential charges, if any, will be discussed with the Commonwealth Attorney after all interviews are conducted and all physical evidence is analyzed.\n--------------------\nThe Roanoke Police Department is conducting a death investigation.\nThe investigation is happening at a home in the 2000 block of Carroll Avenue. The call came in around 12:20 p.m.\nThe home is at the corner of Carroll Avenue and 21st Street, which is near the Roanoke Academy for Math and Science.\nCrime scene tape is around the home.\nCheck back soon for more updates."}