{"uri": "http://www.10news.com/news/9-year-old-vista-boy-killed-in-gun-accident", "title": "9-year-old Vista boy killed in gun accident", "dct": "Thu, 21 May 2015 05:34:00 GMT", "id": "73f5750a448636443cfd6d02f883988f", "content": "Autoplay:\nVISTA - A 9-year-old Vista boy died over the weekend after being accidentally shot with a gun by his own brother.\nOn Saturday night, Ezekiel Melendez was shot by his 14-year-old brother Jacob while playing with a gun they thought was a toy.\nEzekiel and Jacob were staying with their mom and her boyfriend at their house in Perris, when Jacob picked up the boyfriend's gun that was sitting in a box, covered by a blanket. Not knowing it was real or loaded, Jacob put the gun to his brother's head and pulled the trigger.\n“What we were told is that he shot him straight here,” said Marisa Melendez, Ezequiel’s aunt. “Jacob is taking it very hard he feels sad and he feels bad for what he did but everybody's telling him, ‘it's not your fault Jacob.’”\n“It shocked me because I was like, there's no way, this little angel could be gone. He was just here last week with me,” Melendez said.\nAt Grapevine Elementary, classmates of Ezekiel are still having a tough time coping with their loss. Since Monday, grief counselors have been on campus providing students with support.\n“They told us that he had a really bad accident,” said Yolanda Sarmiento, one of Ezequiel’s classmates.\nThe Riverside County Sheriff's Department says no one has been arrested and it will be up to the district attorney to decide whether to press charges.\n“If you have a gun, lock it up,” Melendez said. “Don't leave it out in the open for a child to grab, make sure it's locked up securely and that the child does not know where it's locked up.”\nA GoFundMe account has been set up to help pay for funeral expenses and counseling for Ezekiel's family. So far nearly $8,000 has been raised.\nEzequiel's parents will hold a memorial for him on Saturday in Temecula. On Wednesday he will be laid to rest, 15 feet from his grandfather.\nCopyright 2015 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}