{"uri": "http://www.whio.com/news/crime--law/police-year-old-shot-dayton/6WRgbOPgcloIksEjGvHM5J/", "title": "Father faces weapons charge after 4-year-old daughter shot", "dct": "Mon, 12 Sep 2016 00:00:00 GMT", "id": "e6607786c7857dfef757c2167178d52e", "content": "The man arrested following the shooting of a 4-year-old during the weekend pleaded not guilty to a weapons charge Monday afternoon in Dayton Municipal Court.\nLamont J. Robinson, 24, who appeared by video for an arraignment for a third-degree felony charge of having weapons under disability, has previous convictions for gun charges.\nA preliminary hearing was scheduled for Sept. 20, and Robinson’s bail was set at $25,000.\nRobinson was arrested with a Ruger handgun after an incident at 7:40 p.m. Saturday on West Riverview Avenue. He was booked into Montgomery County Jail at 11:20 p.m. Saturday.\nRobinson was traveling with his 4-year-old daughter, his girlfriend and his girlfriend’s 6-year-old son, officers said.\n“They were pulling into a drive-through when they heard a loud bang. Lamont got out to check his daughter and found out she’d been shot in the arm,” Dayton police Maj. Chris Williams said. “As it stands right now, we don’t have any suspects, and we’re hoping that the citizens of Dayton could help us out with that.”\nWilliams also said the girl is “OK” now. That came after Dayton Children’s Hospital reported that a 4-year-old girl was in good condition Monday morning, but no specifics were released about her injuries.\nThe child was riding in a car that was struck by gunfire in the area of West Riverview Avenue and Catalpa Drive, according to initial reports.\nRobinson’s charge for weapons under disability was because he was found with a weapon, police said.\nThe child was taken by a private car to Good Samaritan Hospital in Dayton around 8 p.m., police said.\nPolice blocked off the car the child was riding in — which reportedly showed evidence of gunfire — at the hospital parking lot.\nRobinson was sentenced in 2014 to two years in prison for three different cases.\nRobinson was given intervention in lieu of conviction (ILC) for a 2010 case in which he was convicted for carrying a concealed weapon. His ILC was revoked when he violated his conditions, according to court records.\nIn 2013, Robinson again was indicted on a weapons charge and given community control. Court records show a 2014 conviction for possession of heroin resulted in the combined sentence for the three cases."}