{"uri": "http://www.northjersey.com/story/news/crime/2016/12/22/several-shootings-reported-englewood/95741664/", "title": "Several shootings reported in Englewood", "dct": "Thu, 22 Dec 2016 00:00:00 GMT", "id": "d7cbd30d0202c0ebcc3721d03aa0b336", "content": "ENGLEWOOD – A 17-year-old boy was shot in the back while riding as a passenger in a car early Wednesday morning, police said, adding to a number of recent gun-related incidents in the city.\nPolice first received a call about possible gunshots near Warren Street and Fourth Street at approximately 1 a.m. Monday, Capt. Timothy Torell said. While no victims were found on the first call, another report of gunshots came in at 2:15 a.m., Torell said. As detectives were collecting ballistics near a home on Washington Place, Teaneck police reported a shooting victim who had been driven to Holy Name Medical Center.\nThe 17-year-old told police at the hospital that he had been riding in car traveling along Washington Place when he was shot in the back, Torell said. The car is being examined for evidence, Torell said.\n“The victim is an extremely lucky young man and is expected to recover from his injuries,” Torell said.\nWednesday’s shooting was one of several in Englewood since November, Torell said. It comes just months after authorities announced they had arrested 21 people in a sweep aimed at reducing gun violence in Englewood.\nLast week police also responded to the Martin Luther King housing complex on William Street after reports of gunshots but could not find ballistic evidence, Torell said. Several hours later, officers responded to another report of shooting on Cross Street, where they found that a single bullet had gone through a glass window and nearly struck a 16-year-old, Torell said.\nEnglewood Police are investigating the shooting at Cross Street – specifically if the home was targeted or something happened outside of the home that caused the bullet to accidentally go through the window, Torell said.\nTorell said police are reviewing witness statements, ballistic evidence, video footage and other evidence to determine if the string of gun violence is connected.\nPatrols are being heightened and anyone with information should call 844-466-6789, Torell said. Cash rewards are being offered for information that “significantly assists the police in criminal investigations,” he said.\nEmail: wyrich@northjersey.com Twitter: @AndrewWyrich"}