{"uri": "http://koin.com/2016/04/13/suspect-in-rosewood-community-center-shooting-arrested/", "title": "Rosewood Community Center shooting suspect arrested", "dct": "Wed, 13 Apr 2016 10:30:00 GMT", "id": "1652bb3cf2ea2491e67db14184f2b368", "content": "PORTLAND, Ore. (KOIN) – Police have arrested a 19-year-old man in connection to a shooting that happened at the Rosewood Initiative Community Center.\nBennie G. London was arrested on Tuesday around 5:30 p.m. in the area of Southeast 111th and East Burnside. His bail has been set at $1,010,000, according to jail records.\nHe was booked into the Multnomah County Detention Center and charged with one count each of attempted aggravated murder, attempted murder, first-degree assault, second-degree assault, unlawful use of a weapon, and being a felon in possession of a firearm.\nMore than two dozen shots were fired on March 12, and a total of four people received non-life-threatening wounds, according to police. The victims were between the ages of 15 and 20 years old.\nPolice say there was a birthday party at the community center when a fight broke out between rival gang associates.\nThe charges against London were filed on Monday, but the search warrant and a probable cause affidavit were both sealed by Multnomah County Circuit Court Judge Kelly Skye. In his request, Portland Police Detective Jeffery Pontius writes that the disclosure of the information would jeopardize the ongoing police investigation and/or jeopardize life or safety of people associated with the investigation.\nThe documents will remain sealed for at least a minimum of 60 days, records show.\nPolice on Wednesday would only say that their investigation remains ongoing.\nRecords show that in June 2012, London pled guilty to three counts of unlawful use of a weapon stemming from a shooting that happened on Jan. 8, 2012. At the time of his arrest, he was 15-years-old. He had been charged with counts of attempted aggravated murder. The 2012 shooting happened in the 600 block of Southeast 162nd Avenue. The attempted aggravated murder charges were dismissed as part of the plea agreement. Details from the 2012 case were not immediately available.\nLondon is scheduled to appear in court Wednesday morning.\nAnyone with information about the case is asked to contact Detective Pontius at 503-823-2081, or Detective Todd Teats at 503-823-2137.\nPeople wishing to remain anonymous can send their tips to Crime Stoppers of Oregon. Rewards can be up to $1,000.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}