{"uri": "http://www.portlandoregon.gov/police/news/read.cfm?id=7064&ec=2", "title": "UPDATE: Shooting Investigation Underway in Southeast Portland - Four People Injured", "dct": "Mon, 14 Mar 2016 13:35:00 GMT", "id": "5a24bf311e847b27ad039bb6ab02c78a", "content": "Follow @PortlandPolice Portland Police Bureau Gang Enforcement Team detectives are continuing to investigate the circumstances of the Saturday night shooting at the Rosewood Community Center. Investigators have learned that there was a birthday party event at the community center when a fight started between rival criminal gang associates.\nMore than two dozen shots were fired and a total of four victims received non-life-threatening gunshot wounds:\n- A 15-year-old female was transported by ambulance from the scene to a Portland hospital for treatment.\n- A 20-year-old male and a 17-year-old male arrived by private car at a Portland hospital for treatment.\n- A 19-year-old male arrived by private car at a Southwest Washington hospital for treatment.\nTheir names are not being released due to the ongoing investigation.\nNo arrests have been made in the case and there is no suspect information to share with the public.\nAnyone with information about this case is encouraged to contact Detective Jeff Pontius at 503-823-2081, jeffery.pontius@portlandoregon.gov; or, Detective Todd Teats at 503-823-2137, todd.teats@portlandoregon.gov.\nThe Tactical Operations Division's Gang Enforcement Team (GET) and Gun Task Force (GTF) are continuing to investigate several incidents of gun violence citywide.\nAnyone with information about gun crimes in the City of Portland is encouraged to provide information to the Portland Police Bureau's Tactical Operations Division at 503-823-4106 or email information to gangs@portlandoregon.gov.\nInformation learned from social media sites such as Facebook, Twitter or YouTube should be shared with investigators as these tips may lead to the identification of a suspect or suspects.\nTips on gun crimes can be emailed to GunTaskForce@portlandoregon.gov.\nIf you see a gun crime in progress, call 9-1-1.\nThe Portland Police Bureau works closely with Enough is Enough PDX, a community-led campaign aimed at encouraging people to take a stand against gang violence in the area.\nFor more information about Enough is Enough PDX and how you can get involved, please visit https://www.facebook.com/EnoughIsEnoughPDX\nAdditional information about Enough is Enough PDX and other City efforts addressing youth violence can be found at the Office of Youth Violence Prevention, http://www.portlandonline.com/safeyouth/\nCrime Stoppers of Oregon is offering a minimum $250 cash reward to anyone who reports a convicted felon or a juvenile in possession of a firearm and tipsters can remain anonymous. Rewards of up to $1,000 are available for other unsolved felony crimes - $2,500 for unsolved homicides.\nSubmit an anonymous tip:\nText CRIMES (274637) - Type 823HELP, followed by the tip.\nOnline at http://crimestoppersoforegon.com/submit_online_tip.php\nCall 503-823-HELP (4357)\nVisit http://tipsoft.com to download the TipSubmit app for the iPhone or Droid.\n###PPB###\n###ORIGINAL MESSAGE BELOW###\nOn Saturday March 12, 2016, at 10:41 p.m., East Precinct officers responded to the area of Southeast 162nd Avenue and Stark Street after multiple reports of gunfire, including at least one victim inside a building.\nOfficers arrived in the area and located one gunshot victim, who was transported by ambulance to a Portland hospital. The victim's injuries are not believed to be life-threatening.\nOfficers located numerous witnesses at the scene and learned that the shooting appeared to be connected with an event or a party at the Rosewood Initiative Community Center, located at 16126 Southeast Stark Street.\nAs officers were working to contain the area, two additional gunshot victims arrived at a Portland hospital by private vehicle. Neither victim's injuries are believed to be life-threatening.\nAt this point, there have been no arrests and there is little suspect information or what led to the shooting.\nGresham Police Department officers and Multnomah County Sheriff's Office deputies responded to the scene and assisted with the investigation.\nWitnesses who may have left the scene without talking to police are encouraged to call the Police Non-Emergency Line at 503-823-3333.\nNo additional information is expected to be released this evening.\n###PPB###\n*************\nMedia Relations:\nSgt. Pete Simpson\nPeter.Simpson@portlandoregon.gov\nDesk: 503-823-0830\nPager: 503-790-1779"}