{"uri": "http://www.denverpost.com/2017/01/19/16-year-old-gunned-down-in-strip-club-shootout/", "title": "16-year-old Denver boy gunned down during Adams County strip club shootout", "dct": "Thu, 19 Jan 2017 17:01:00 GMT", "id": "e0f15b0efd04b9d1a32fdb28c49ac3e1", "content": "Authorities have identified a 16-year-old Denver boy as the person slain in a shootout with armed security guards this month outside an Adams County strip club.\nLuis Javalera Hinojos died of a gunshot wound in the Jan. 8 encounter at the Players Club on the 6700 block of Federal Boulevard, according to the Adams County coroner’s office.\nInvestigators believe Luis was one of three people who had been kicked off the strip club’s property but then returned in a car only to open fire on security workers standing outside the business. Hinojos was found dead in the driver’s seat of the vehicle — an Acura sedan — a few blocks away, slumped over and covered in blood, according to court documents.\nAdrian Sandoval, 20, has been charged in the shootout with seven counts of attempted first-degree murder. He also is accused of a crime of violence, a sentencing enhancer.\nProsecutors allege Sandoval fired shots at the Player’s Club security guards out of a passenger-side window. He is due in court for a preliminary hearing Feb. 1 and was being held in lieu of $500,000 bail.\nAccording to an arrest affidavit for Sandoval, he and Hinojos, along with a third man, drove to the strip club after a night of drinking and clubbing in Denver. Witnesses say the trio had been told to leave the property, and the three became upset as they drove off. They returned with a rifle, the affidavit says, opening fire.\nIn the Acura, investigators say they found .22-caliber shell casings and a rifle of the same caliber. The vehicle had several bullet holes, the affidavit says, including one in the right rear passenger-side window.\nSandoval and a third man in the vehicle were apprehended shortly after the shooting by an armed security guard from the strip club, according to the affidavit.\nSponsored Links\n.\nWar Bitz20 Images of Damaged B-17 Bombers That Miraculously Made It HomeWar Bitz\nHome Solar QuotesThinking About Going Solar In 2017? Read This FirstHome Solar Quotes\nVital Reds SupplementHow To Fix Your Fatigue (Do This Every Day)Vital Reds Supplement\nTrend Chaser9 Out Of 10 People Can't Get Through These Photos, Can You?Trend Chaser\nSenior Apartments OffersDo You Need A New Home? Check These Senior Apartment Deals Now.Senior Apartments Offers\nTrackr BravoNow You Can Track Your Car Using Your SmartphoneTrackr Bravo\nSponsored\nRumors Have Been Confirmed, Jolie Comes Clean\nThe Rumors Have Been Confirmed, Jolie Comes Clean - Will Family And Friends Forgive Her? Learn More Sponsored by Chatter Box Daily"}