{"uri": "http://www.wsbtv.com/news/news/local/man-accused-5-deaths-troup-county-held-without-bon/nj4ZR/", "title": "Family speaks after quintuple murder in Troup County", "dct": "Wed, 04 Feb 2015 11:13:00 GMT", "id": "47e9904ae283b219dd5a9385b7c8d2eb", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nTROUP COUNTY, Ga. - Bill Burtron will always be remembered as a father who tried to protect his family, even to the very end.\nBurtron's surviving children spoke exclusively to Channel 2's Liz Artz Wednesday about the murders that left their father and three other members of their family dead.\nRAW VIDEO: Siblings talk about murdered family\n\"It's like you want your dad to walk in and take care of this for you and you have to do it for him,\" Brenda Vega said.\nVega and her brother Trotsky Quinn did not attend a hearing for Thomas Jesse Lee, 26, in Troup County. Lee is accused of killing their father, mother, sister, niece and a family friend.\nJudge Vickie Sue McWaters read the charges against Lee and told him that he will remain jailed without bond until a preliminary hearing before a superior court judge on Feb. 19.\nLee was ordered to be held without bond.\nPolice say they found the five bodies inside a home on Woodstream Trail, in the Water’s Edge subdivision, just after 10 p.m. Saturday.\nPolice identified the victims as William Burtron, 69, Sheila Burtron, 68, Christie Lee, 33, Bailey Burtron, 16, and Iiaonna Green, 18.\nDeputies say they were called to the home for a welfare check because one of the victims hadn't shown up at work for a few days.\nWarrants read during Wednesday morning’s 3-minute hearing indicated that William and Sheila Burtron, Christie Lee and Green were all shot, and that William Burtron was also beaten.\nBailey Burtron died of asphyxiation, according to the murder warrant. It's believed William Burtron, a retired Navy mechanic, was trying to defend his family members.\n\"His fight to the end, I think he did for everybody in that house,\" Vega said. \"He didn't put up one, he gave one hell of one.\"\nQuinn said his mother nearly died of illness last year and her murder makes it even more difficult.\n\"There's a lot of anger and emotion about it but I'm trying to not let that be the focus, not let him get the best of me,\" Quinn said.\nThe siblings say Christie and Thomas Lee were married about five years.\n\"With us not living here we can't say one way or exactly what is going on there. People have speculated things but we don't know if we'll ever truly know why,\" Quinn said.\nThe family described Lee as quiet and disinterested but they never expected it would lead\n\"I want to see him pay for this. I want him to wake up every morning with that vision of what he did and I also want him to fry,\" Vega said.\nThe siblings are struggling to raise money for funeral and legal expenses because they have to bury their entire family. They've set up an account where you can make a donation. Click here for more information."}