{"uri": "http://www.latimes.com/local/lanow/la-me-ln-tulare-barricaded-gunman-20161013-snap-story.html", "title": "Officer's Kevlar helmet deflects gunman's bullet, but mother and 9-month-old baby are wounded", "dct": "Thu, 13 Oct 2016 18:40:00 GMT", "id": "943e1349fcc0dc7487f8d182298290f3", "content": "A suspect who barricaded himself inside a home is dead after he gravely wounded his girlfriend and 9-month-old daughter Thursday, then fired numerous shots at police, striking an officer’s Kevlar helmet, authorities in Tulare said.\nLarry Zamora, 37, died of a self-inflicted gunshot wound following an hours-long standoff and gun battle with law enforcement, Tulare County Sheriff Mike Boudreaux said at a news conference.\nA hail of gunfire from the home forced officers to seek cover behind an armored vehicle, which was struck by “multiple, untold number of rounds,” Boudreaux said. An officer’s Kevlar helmet was struck by gunfire. The officer was taken a hospital and later released.\n“That Kevlar helmet, frankly, has saved his life,” the sheriff said.\nThe chaotic scene unfolded about 3 a.m. when sheriff’s officials received a report of two gunshot victims in the 22400 block of Road 130. At the home, deputies found the 39-year-old woman and the 9-month-old infant suffering from gunshot wounds. They were listed in grave condition, Boudreaux said.\nZamora went to the home to visit a friend who was throwing a party there, he said.\nAt some point, Zamora got in a loud argument with the woman, with whom he was in a relationship, officials said. Zamora is the infant’s father, Boudreaux said.\nDuring the argument, witnesses told investigators they heard “two abrupt and quick shots” in a backroom, officials said.\nZamora left and drove away.\nPolice found him at another home in Tulare, where they were able to rescue two children and a woman inside before the gun battle began.\nAs officers surrounded the neighborhood, Zamora emerged from a garage door and fired multiple rounds “in rapid succession” at them, Boudreaux said. Zamora took cover behind the door and continued firing at officers before turning the gun on himself, he said.\nThe sheriff said the armored vehicle also “saved the lives of many of the officers on scene.”\nTulare Police Chief Wes Hensley said the officer whose helmet was struck by gunfire was able to walk away on his own.\nFor breaking news in California, follow @VeronicaRochaLA on Twitter."}