{"uri": "http://www.fresnobee.com/news/local/article108091112.html", "title": "Suspect in shooting of mother, baby takes his own life after hours-long Tulare standoff", "dct": "Thu, 13 Oct 2016 15:42:00 GMT", "id": "c102f2ff171f3d01c1eafea92b3d58b6", "content": "An hours-long standoff with a man wanted in the early morning shooting of a 39-year-old mother and her 9-month-old daughter ended Thursday with the man taking his own life, Tulare County authorities announced.\nTulare County Sheriff Mike Boudreaux said Larry Zamora, 37, was found dead of a self-inflicted gunshot wound in the hallway of a home on Richard Smith Avenue in Tulare.\nTulare County Sheriff’s deputies, the sheriff’s SWAT team and police from Tulare and Visalia surrounded the home and evacuated neighbors. A Tulare police officer was hit in his Kevlar helmet by a bullet or ricochet, and was treated at a hospital and released.\nThe incident began about 2:30 a.m. Thursday when the sheriff’s office got a call about a domestic disturbance in the 22700 block of Road 130, east of Tulare. The arriving deputy found a woman and her child who both had been shot. Both were described as being in “grave condition.” The infant was taken to Valley Children’s Hospital in Madera County.\nThe names of the victims were not released.\n“I can tell you they are fighting for their lives,” Boudreaux said. The woman has had two surgeries and the child has been revived twice, he said.\nBoudreaux said Zamora had gone to a home east of Tulare to attend a party. An argument took place and he shot the mother and her child.\n“She was holding her child,” Boudreaux said. The victim and suspect were not married but acted as a married couple. The child was theirs, he said.\nZamora was a known gang member with a record of violence, he said.\nDeputies got a description of the suspect’s car and found it at the home on Richard Smith Avenue in Tulare. A mother and two children were in the home with the suspect but officers were able to get them out safely by using a ruse, authorities said.\nNegotiators made telephone contact with Zamora, but he eventually turned off the phone.\n“He quit communicating with us,” Boudreaux said.\nBoudreaux said Zamora fired several rounds at an armored vehicle about 9:30 a.m. The gunfire was rapid as if it were an automatic weapon, and after the standoff ended deputies found a .45 caliber MAC 10 gun that could be fired in automatic or semi-automactic mode, he said.\nZamora opened fire from the garage and hit a Tulare police officer in the helmet, he said.\nDuring the standoff, officers heard other gunshots and it appears he also fired into the backyard, Boudreaux said. Tulare Police Chief Wes Hensley said it appeared that one round hit the officer’s helmet, although it might have been from a ricochet.\nA SWAT team used an armored vehicle to ram down a garage door and to pump gas into the home. A robot from the bomb squad opened the front door and entered the home, and a camera on the robot transmitted an image of Zamora on the ground with a gun next to him just about 2:30 p.m.\nAfter the incident, relatives of Zamora who waited outside the police barricade during the incident huddled with authorities who informed them of his death. They declined to speak with reporters.\nLewis Griswold: 559-441-6104, @fb_LewGriswold"}