{"uri": "http://www.nola.com/crime/index.ssf/2016/01/man_booked_in_toddlers_shootin.html", "title": "Man booked in toddler's shooting accused of drinking while handling gun, warrant says", "dct": "Thu, 28 Jan 2016 03:54:20 GMT", "id": "77ade84b2f65531fba2800d04ec19cc6", "content": "A 23-year-old man booked in the Tuesday night (Jan. 26) shooting and injuring of a 3-year-old boy in Algiers was drinking alcohol when the gun he was handling fired, the boy's mother told police as cited in the man's arrest warrant.\nLesean Rozumialski was booked early Wednesday morning on charges of second-degree cruelty to juveniles, cruelty to juveniles and aggravated battery. New Orleans police Wednesday said Rozumialski told police his gun discharged when he threw it on a table in the living room. A bullet struck the toddler in the stomach.\nThe child was taken by ambulance to University Medical Center, records said. NOPD Officer Gary Flot said Tuesday night the child was undergoing surgery. There was no immediate update on the child's status Wednesday morning.\nThe arrest warrant said the child's mother told police Rozumialski was drinking inside a residence in the 300 block of Huntlee Drive \"and was intoxicated,\" when the \"alcohol resulted in an argument.\" It said Rozuminalski then went to a room where the 3-year-old boy and his 2-year-old sister were playing.\nA toddler was shot Tuesday night in the 300 block of Huntlee Drive in Algiers (Jan. 26) when a gun discharged while it was being cleaned, the NOPD reported.\nRozumialski \"was handing a gun,\" which the mother believed was a .38 caliber, in the room with the children when one round fired, striking the boy, the warrant said.\nNOPD said that during the investigation, Rozumialski \"admitted that his actions caused the victim's injury.\"\nPolice said family members told officers they drove the injured boy and another girl to a Winn-Dixie near his house, where the man driving the vehicle made contact with a deputy who was working there and asked him to call EMS.\nNeither the warrant nor police have said what Rozumialski's relationship was with the injured toddler or his mother. It was not immediately clear whether Rozumialski was tested for alcohol or if the accusation that he was intoxicated would have any bearing on the charges.\nTuesday's shooting in Algiers was the second time in as many weeks that a 3-year-old boy was inadvertently shot inside a residence in New Orleans. Last week, police arrested an eastern New Orleans woman after her 3-year-old grandson was killed when a gun in the bed where both of them slept discharged, striking the toddler.\n\"I can't imagine what they're going through at that house,\" said Betty McCormick.\nThe NOPD Child Abuse Unit is investigating the shooting.\nAnyone with information about the incident is asked to call the child abuse unit at 504.658.5267 or Crimestoppers at 504.822.1111."}