{"uri": "http://www.delawareonline.com/story/news/crime/2016/07/19/teen-shot-dead-wilmingtons-east-side-neighorhood/87284058/", "title": "Police identify boy fatally shot in Wilmington", "dct": "Tue, 19 Jul 2016 00:00:00 GMT", "id": "9c94f96810ce0b94545ae2ad88f308d8", "content": "Alonzo Small/The News Journal\nWilmington police identified the 15-year-old boy shot dead late Monday as Tyreek Scott.\nNo arrests have been made in the latest slaying and police did not say why the boy was killed. Scott's shooting marked the 20th juvenile to have been wounded or killed by bullets in the city this year – nearly a quarter of all shooting victims in Delaware's largest city.\nMarcos Velez, a commander in the Wilmington Guardian Angels, a volunteer group that patrols the streets in an effort to reduce crime, attributes the high number of youths being shot to gangs.\n\"Most of them, I can't say all of them, extend from gangs,\" Velez said. \"We have a huge epidemic gang problem.\"\nNot all who have been shot are gang members, Velez said. Some victims have been caught in the crossfire, while others are targeted after they're seen associating with gang members.\nTwo of this year's shootings involving minors have resulted in fatalities, and authorities have linked one of those to people with gang ties. Three men with gang affiliations were indicted last month in the death of 15-year-old Brandon Wingo, who was shot three times as he walked home along Clifford Brown Walk on May 19.\nKevon Harris-Dickerson, 20, of Newark; Zaahir Smith, 19, of Newark; and Diamonte Taylor, 18, of Wilmington, were indicted by a grand jury on multiple charges including murder, possession of a firearm during the commission of a felony and conspiracy. Latasha Pierce, 34, of Wilmington, also was indicted on charges she supplied a gun to one of the men and lied to police.\nPolice and state prosecutors believe the men are members of the Shoot To Kill, or STK, gang.\nWingo's homicide occurred about eight blocks from Wilmington's most recent killing.\nGeorge Krupanski Jr., president and chief executive officer of the Boys & Girls Club of Delaware, said it was tragic that the violence taking place involves so many youths.\n\"Our teens need hope and opportunity,\" Krupanski said. \"They need more safe places to spend their time and enjoy their youth. They need hope that their futures can be bright – futures that bring educational and employment opportunities.\n\"They need a committed community that is willing to take the action needed to assure their well-being.\"\nTo do this, Krupanski said it would require bringing together community leaders and stakeholders and identifying specific initiatives that will result in more jobs and job training for teens, increases in graduation rates and more programs and activities for youth after school.\nSTORY: Wilmington PD: 71% of public safety recommendations implemented\nOn Monday, Wilmington officers were called to the area of 11th and Bennett streets just before midnight for a report of shots being fired, according to Sgt. Andrea Janvier, a police spokeswoman.\nArriving officers found Scott in the 700 block of E. 11th St. suffering from gunshot wounds to his upper torso. He was treated by New Castle County paramedics and taken to Christiana Hospital, where he was pronounced dead.\nA bronze statue of jazz trumpet great Clifford Brown, erected in 2012 in hopes of inspiring others growing up in his hometown, was a short distance from where Scott was found Monday night. Several chalk outlines remained on the sidewalk and street, near the entrance to Kirkwood Park, on Tuesday.\nNearby residents said they are concerned for the city's youths and would like to see more activities for them. Some said they worry when they let their children out.\nThis was Wilmington's second shooting death in two days.\nA 34-year-old man who was shot near the William Judy Johnson Memorial Park on Monday afternoon has died, police said on Tuesday.\nAnyone with information relative to the investigation of the teen's death is asked to call Detective Pete Leccia at (302) 576-3647 or the Homicide Hotline at (302) 576-3939, where information leading to the arrest and conviction of the perpetrator(s) involved in this crime can lead to a $10,000 reward. People can also call Delaware Crime Stoppers at (800) TIP-3333.\nContact Esteban Parra at (302) 324-2299, eparra@delawareonline.com or Twitter @eparra3."}