{"uri": "http://wate.com/2015/12/14/11-year-old-tennessee-girl-fatally-shot-over-weekend-by-classmate/", "title": "11-year-old Tennessee girl fatally shot over weekend by classmate", "dct": "Mon, 14 Dec 2015 18:04:00 GMT", "id": "b81469e2a0d03158386c0f5c77c1cfe4", "content": "ESTILL SPRINGS, Tenn. (WKRN) – Authorities said Monday a 12-year-old boy shot and killed an 11-year-old last Friday in Middle Tennessee.\nThe Franklin County Sheriff’s Office told News 2 victim Sienna Owens and the alleged shooter both went to North Middle School in Estill Springs.\nSienna was in 6th grade, along with the boy authorities believe fired the shot. The two were friends and their families were also friends.\nFranklin County Sheriff Tim Fuller said the two were at the boy’s home with four other students inside his family’s garage when the shooting occurred.\nHe would not disclose who the gun belonged to, where it was, how the boy got his hands on it, or what kind of weapon it was.\nOnly one shot was fired.\nAll of the investigation details will be handed over to District Attorney Mike Taylor to determine if charges will be filed and whether the shooting was accidental, intentional or neglectful.\nAuthorities are waiting on results of ballistics testing.\nIf charges are filed, he does not anticipate them until after the first of the year.\nSheriff Fuller said both children come from good families and the 12-year-old boy is not doing well at all.\nA pink bow and flowers adorned Sienna’s locker on Monday, and students are writing letters for her parents.\n“Just reading those letters is really very touching and tells a true story of what a beautiful young lady she was,” said Stanley Bean, her principal.\nTwo counselors are at the school to help the children deal with their grief.\nVisitation for Owens will be held at Moore Cortner Funeral Home on Tuesday, Dec. 15 from 5 p.m. until 8 p.m.\nServices will be held Wednesday at 3 p.m. at Moore Cortner Funeral Home, and burial services will be conducted at Franklin Memorial Gardens.\nThere will be a memorial service at 9 a.m. on Wednesday morning at North Middle School for 6th graders who can’t attend the funeral.\nFollowing the service, there will be a balloon release.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}