{"uri": "http://www.cajunfirst.com/news/local-news/double-shooting-in-crowley", "title": "Double Shooting in Crowley", "dct": "Mon, 07 Nov 2016 12:33:00 GMT", "id": "0a8c143573d9b2110bf811805dccb25c", "content": "Crowley Police were called to the scene of a double shooting in the early morning hours of Monday, November 7 in the 1100 block of Smith Street.\nA call was received by the 911 center, and the caller advised that a male subject was covered in blood. Upon arrival, officers observed two males, rather than one, in the vehicle, both with a large amount of blood.\nThe driver, one Dayton Harmon age 18, was transported to Acadia General Hospital and later to a Lafayette hospital by Acadian Ambulance with life-threatening injuries.\nThe passenger, one Jarius Wilson, age 17, was pronounced dead on the scene by the Acadia Parish Coroner's Office. He was transported to the Calcasieu Forensics Lab for an autopsy.\nDetails are sketchy at press time as to the motive or possible suspects. Evidence was collected on the scene and is being processed by Detectives with the Crowley Police Department. A person of interest is being sought in the incident who may possibly have pertinent information or association with the incident.\nIn commenting on the incident, Chief Jimmy Broussard implored the help of the community. \"This is our second incident since I have taken office. And that is two too many. As in the other incident, I am again asking the help of the community, as both of these victims are someone's child. We would want someone to help us if it were our children, and so we need the community's help in bringing these families some closure.\"\nBroussard asked that anyone with information either contact the Detective Division of the Crowley Police Department, or call Crime Stoppers of Acadia Parish at 789-TIPS with any information that will lead to the arrest of the persons responsible for this crime.\nCopyright 2017 Nexstar Broadcasting, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}