{"uri": "http://www.katc.com/story/33662341/second-victim-dies-in-crowley-shooting", "title": "Second victim dies in Crowley shooting", "dct": "Wed, 09 Nov 2016 00:16:00 GMT", "id": "a78207b1e526d10b25f6fefbcf33f369", "content": "The second person shot in Crowley Monday morning has died.\nPolice Chief Jimmy Broussard confirmed that Dayton Harmon died today. He and Jarius Wilson were shot Monday; Wilson was pronounced dead at the scene. Harmon was transported to the hospital with life-threatening injuries and has been fighting for his life since then.\nBroussard said the department needs assistance from the public to solve the case. Anyone with any information about this double homicide to call either the detective division of the Crowley Police Department or Crime Stoppers of Acadia Parish, 789-TIPS.\nThe shooting happened Monday morning in the 1100 block of Smith Street.\nPolice say they received a 911 call advising that a male subject was covered in blood. Upon arrival, officers saw two men, rather than one, inside of a car in the middle of Smith Street, covered in blood.\nBroussard said the driver of the car still had his foot on the brake when police arrived on the scene.\n\"The car was still in drive, so the officers were able to place it in park and turn the vehicle off,\" Broussard said. \"The driver was coherent at the time but was unable to speak.\"\nOfficials say the driver of the vehicle, now identified as Harmon, was transported to Acadia General hospital with life-threatening injuries. The passenger, identified yesterday as Wilson, was pronounced dead at the scene by the Acadia Parish Coroner's Office.\nPolice say a person of interest is being sough in the incident who may possibly have information as to what happened. No suspects have been identified\n\"This is our second incident since I have taken office. And that is two too many,\" Broussard said. \"As in the other incident, I am again asking the help of the community, as both of these victims are someone's child. We would want someone to help us if it were our children, and so we need the community's help in bringing these families some closure.\""}