{"uri": "http://fox6now.com/2014/11/06/breaking-five-year-old-girl-shot-in-milwaukee/", "title": "Chief Flynn on shooting of 5-year-old: “We’re going to find (the suspects), arrest them”", "dct": "Thu, 06 Nov 2014 18:52:00 GMT", "id": "0b8617cfc2f7f4f1f057138485487203", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nMILWAUKEE (WITI) -- Milwaukee police say a five-year-old girl was shot near 58th and Hampton on Thursday evening, November 6th. The five-year-old girl has died as a result of that shooting.\nThe shooting happened just before 6:30 p.m.\nPolice say their initial investigation indicates the girl was sitting on a family member's lap when bullets were fired into the home -- striking the child.\n\"When we got here, we learned a home had been targeted in the neighborhood and shots had been fired into the residence by unknown persons at this time. There was a five-year-old child in the residence, and the five-year-old child was struck,\" Milwaukee Police Captain Eric Moore said.\nA neighbor tells FOX6 News the five-year-old girl was watching television on a couch when she was shot in the head.\nNeighbors say two girls often stay at the home with their grandparents. We're told their grandfather rushed to a neighbor's home covered in blood looking for medical help.\n\"For something like this to happen -- it's real tragic,\" a neighbor named Gary told FOX6 News.\nGary didn't want to share his last name, but he says his angry to learn what happened.\nNo one is in custody. Milwaukee police say they're involved in an aggressive search to find those responsible.\n\"I have no idea what was in the minds of these actors. What I do know is we are going to find them, arrest them and they're going to jail,\" Chief Flynn said.\nThis shooting comes after a four-year-old girl was shot in the head while sitting in a car in Racine on Wednesday evening, November 5th.\nMonitor FOX6 News and FOX6Now.com for updates."}