{"uri": "http://www.foxnews.com/us/2014/11/07/police-5-year-old-girl-sitting-on-grandpa-lap-shot-when-bullets-fired-into/", "title": "Police: 5-year-old girl sitting on grandpa's lap shot when bullets fired into Milwaukee home", "dct": "Fri, 07 Nov 2014 00:00:00 GMT", "id": "4f5bdd71a424c9710e52fd51274a306c", "content": "MILWAUKEE – A 5-year-old girl was fatally shot while sitting on her grandfather's lap when two people approached her Milwaukee home and opened fire, according to police, who sought help Friday in finding the suspects.\nLaylah Petersen was shot in the head when one of a dozen bullets that hit the home came through a wall about 6 p.m. Thursday. Laylah, who was sitting on a couch with her grandfather, died at a hospital.\nInvestigators said there was no clear motive for the shooting and they needed the public's help to find those responsible for the shooting on the city's northwest side. Police said officers had no previous calls to the home, and they don't believe anyone living at the home was specifically targeted.\n\"We believe that this bullet read, 'To whom it may concern.' And that concerns all of us, and that should concern everybody in our community,\" Capt. Aaron Raap said during a news conference Friday. \"If you saw something, say something. If you hear something, say something.\"\nRaap said initial descriptions of the shootings as being \"targeted\" referred to the fact that all 12 bullets fired hit the house. Officers found a dozen casings at the scene, and were looking into whether more than one handgun was used. They also were interviewing witnesses and seeking any possible surveillance video.\nPolice Chief Edward Flynn said two young children were being raised by their grandparents in the house, where people left flowers, toys and other items in a makeshift memorial for the little girl Friday.\n\"This is a stable, loving, working family in a stable working-class neighborhood where everybody is trying to do the right thing,\" Flynn said.\nThe Bureau of Alcohol, Tobacco, Firearms and Explosives has offered a reward of up to $5,000 for information leading to an arrest and conviction in the case.\n\"There is no reason conceivable that I can think of that would explain this wanton, violent act,\" Flynn told reporters Thursday night. \"We are going to find (the shooters). We are going to arrest them. And they are going to jail.\"\nLaylah is the third child under age 13 whose death was considered a homicide this year in Milwaukee, Lt. Mark Stanmeyer said. But the city has seen fewer homicides this year than last, 76 compared to 93 at the same time in 2013. At this point last year, four children under 13 had been killed."}