{"uri": "http://www.sun-sentinel.com/local/broward/fort-lauderdale/fl-lauderdale-manslaughter-arrest-20160309-story.html", "title": "Accused shooter claims death was accidental, Fort Lauderdale police say", "dct": "Wed, 09 Mar 2016 14:53:00 GMT", "id": "c2a5b209a507dcbe81738cb5d8e788d2", "content": "James Davis, 30, is charged with manslaughter and possession of a firearm by a convicted felon for the shooting death of Kyle Alexander Miller, 29, in Fort Lauderdale, police said\n(Broward Sheriffs Office, courtesy)\nAn ex-convict who is accused of fatally shooting a friend is claiming it was an accident, Fort Lauderdale police said.\nJames Davis, 30, is charged with manslaughter and possession of a firearm by a convicted felon for the shooting death of Kyle Alexander Miller, 29, in Fort Lauderdale, according to the arrest report filed in the case.\nThe two men were talking about 7:21 a.m. on February 21 at an apartment in the 2300 block of Northwest Ninth Court near Franklin Park when a shot was fired. Davis' cousin was in the apartment at the time and he later told police he saw Davis holding a gun and Miller lying on the floor, the report stated.\nPolice answered a 911 call and found a conscious Miller on the back patio with a chest wound. He was taken to Broward Health Medical Center where he underwent emergency surgery, detectives said. He was pronounced dead about 9:10 a.m.\nInvestigators said Davis' cousin was under the influence of the street drug flakka when they interviewed him.\nThe cousin told them he saw Davis, who he called \"Bally,\" trying to stuff the gun in his waistband. He said there had been no argument and Davis and Miller were friends, the report stated.\nMiller's girlfriend was interviewed and she told detectives that Davis had phoned her about five minutes after the shooting to tell her to come over. She met Davis at a nearby gas station where she said Davis admitted to shooting Miller but said it was an accident, police said.\nAnother witness told investigators that Davis admitted to shooting Miller while handling a handgun that he thought was unloaded, detectives said.\nDavis was arrested February 26 and ordered held without bond.\nHis criminal record shows several convictions on drug charges, according to the Florida Department of Law Enforcement.\nStaff writer Linda Trischitta contributed to this report.\nwkroustan@tribpub.com or 954-356-4303"}