{"uri": "http://www.blythevillecourier.com/story/2248074.html", "title": "Murder suspect Billy Dee Williams arrested in Oklahoma City", "dct": "Fri, 06 Nov 2015 00:00:00 GMT", "id": "3a56b604ce94ba4134806cc773701699", "content": "Blytheville Criminal Investigations Division Commander Capt. Scott Adams and Blytheville Police Chief Ross Thompson said U.S. Marshals have arrested Billy Dee Williams, who is accused in the August slaying of 20-year-old Adline King.\nWilliams was arrested in Oklahoma City on Friday.\nKing was shot on Anderson Street on Aug. 8 and transported by friends to the Great River Medical Center where she died from her injuries.\nThat night, 12 people were shot, including King.\nPolice responded to 833 Anderson Street at around 11 p.m., Saturday, Aug. 8 in reference to the shooting.\nEmergency medical service units responded and transported two victims to Great River Medical Center (GRMC) in Blytheville. Officers then learned that other shooting victims had been taken to the GRMC Emergency Room by private transportation and that a fight had broken out at the hospital. Additional officers responded to the hospital where they found 10 additional victims from the Anderson Street incident, for a total of 12 injured victims.\nApproximately 200 family members and friends of the 12 separate gunshot victims arrived at what was described as a chaotic Great River Medical Center.\n\"Officers were confronted by a crowd of approximately 200 individuals at the hospital. The scene at the hospital was chaotic and emotional. Additional Blytheville Police officers were called to duty as well as support from deputies from the Mississippi County Sheriff's Department and troopers from the Arkansas State Police. Arkansas State Police investigators were also contacted and are assisting us in the investigation. We want to thank them for their assistance and support,\" Blytheville Chief of Police Ross Thompson said in a press conference held the day after the incident.\nFour patients were eventually transported with gunshot wounds to Region One Medical Center in Memphis, Tenn. Four adults and two male juveniles were treated for minor injuries at GRMC Emergency Room.\nOne patient was transported to St. Bernard's Hospital in Jonesboro in stable condition.\n\"Essentially, we had one fatality, 10 treated with gunshot wounds and all were either discharged or transported. One person, I believe, was injured while on our campus and was treated and released. From my point of view, I'm very proud of the hospital staff and all that came in that weren't scheduled to work. We had people helping provide care as well as providing support handling logistical services such as moving supplies, keeping things clean, maintaining order, etcetera. Law enforcement was here to control the large number of people in our parking lots, primarily,\" Great River Medical Center Chief Executive Officer Ralph Beaty told the Courier News in August.\nmbrasfield@blythevillecourier.com"}