{"uri": "http://www.cleveland.com/metro/index.ssf/2015/05/suspect_in_cleveland_quintuple.html#incart_river", "title": "Suspect in Cleveland quintuple homicide charged with murder", "dct": "Fri, 08 May 2015 08:05:29 GMT", "id": "8ee6279cd64b0474def689124ecf8ce4", "content": "CLEVELAND, Ohio - The suspect arrested Wednesday in connection with a quintuple homicide in Cleveland is 19-year-old James E. Henderson, according to a court document.\nHenderson is charged with aggravated murder in the November 2014 slayings at an East 92nd Street home that ended with five people shot dead and a 9-year-old girl wounded, according a Cleveland Municipal Court document.\nHenderson is accused of being the masked gunman who killed Lemon Bryant, 60; Shaylona Williams, 17; Ja'rio Taylor, 18; and Sherita Johnson, 41. Johnson's baby, Juwan, was delivered at a hospital after the shooting and died 16 minutes later.\nHenderson's criminal record began five years ago in Cuyahoga County Juvenile Court. In a 2009 case, Henderson admitted to charges of menacing and disorderly conduct. In August 2010, Henderson admitted to an aggravated robbery charge.\nHenderson was jailed from August 2010 to July 2011 for the robbery.\nHenderson's adult record -- until he was charged in connection with the quintuple homicide -- reveals only traffic-related offenses, according to Cleveland Municipal Court records.\nHe pleaded no contest earlier this year to displaying fictitious plates, attempting to play sound devices in a motor vehicle when prohibited and failing to illuminate a rear license plate, records show.\nCleveland police remain tight-lipped about possible motives. Department brass withheld Henderson's identity during a press conference Wednesday announcing that a suspect was in custody.\n(Correction: A spokeswoman for Cuyahoga County Juvenile Court initially reported that Henderson was sentenced to probation for the crimes. On Friday, she said Henderson spent time locked up for the aggravated robbery charge.)"}