{"uri": "http://www.mlive.com/news/bay-city/index.ssf/2016/12/deputy_who_fired_gun_in_school.html#incart_river_home", "title": "Deputy who fired gun in school tried to 'destroy evidence,' police say", "dct": "Wed, 21 Dec 2016 11:19:16 GMT", "id": "721ec9bc9c31d845f37536355a53d8d9", "content": "AUBURN, MI -- For an hour and a half after firing a gun inside the high school where he worked, a Bay County Sheriff's deputy played dumb.\nGoing a step further, he tried to conceal his deed from investigators by taking the bullet that had struck a teacher in the neck and getting rid of it.\nThis information is contained in reports written by Michigan State Police troopers who investigated the November incident that took place inside the Bay City Western High School and Middle School building at 500 W. Midland Road in Auburn. MLive/The Bay City Times obtained the police reports on Monday, Dec. 19, through a Freedom of Information Act request.\nThe reports state Deputy Adam J. Brown, the school's resource officer, at about 12:30 p.m. on Friday, Nov. 11, fired a .380-caliber Sig Sauer pistol while in a classroom. He and another teacher had been in the robotics classroom using a force machine to test the trigger pull on a Springfield EMP 9mm handgun. Surveillance camera footage shows Brown and the teacher exit the classroom, with Brown returning alone shortly thereafter. He again used the force machine, this time with the Sig Sauer, apparently causing it to discharge.\nThe Sig Sauer and the Springfield were Brown's backup weapons, both of which he was qualified and authorized to carry, according to the reports.\nThe bullet passed through two pieces of drywall and entered a classroom occupied by about 30 students. It traveled toward the ceiling, scraped a tile, proceeded to hit a cement wall, ricocheted off it, careened across the room, and struck teacher Brenda Amthor in the neck.\nAmthor was sitting down at her desk when the projectile struck her. She bore a small scratch, but was uninjured, as the bullet had lost its velocity, according to the reports.\nAt 12:26 p.m., Amthor called Assistant Principal Brad Pennell and said something had come through a wall and hit her in the neck. Pennell and other staff went to her room to check it out.\n\"She joked that she has been having bad luck with her room this year,\" Pennell wrote in a statement to police. \"She said that whatever hit her was hot because it landed by her feet and she tried picking it up, but it was too hot, so she dropped it.\"\nOnce the object cooled down, Amthor picked it up and handed it to Pennell. Pennell radioed for Brown and the school's custodian, both of whom came to the room.\nThough Brown was engaged in conversations with school staff on the projectile's origin, he did not admit to having fired a gun, reports indicate. As a result, the school was placed in secure mode while administrators attempted to discern what had happened.\nStaff gave Brown the object. He put it in his pocket and later told them he lost it, the reports state.\n\"During this incident, Adam did not initially confess to discharging his weapon,\" wrote Detective Sgt. William Arndt. \"He confessed after being confronted by school administrators. Adam also admitted that he attempted to destroy evidence when school administrators gave him the fired bullet to protect. Adam left the school building, placing the fired gun in his personal vehicle, and threw the fired bullet into the school lawn in an attempt to thwart the investigation.\"\nInvestigators summoned a K-9 Unit to the scene, which located the spent bullet in an area of grass covered in leaves near a chain link fence on the school's southeastern side. Police also recovered the gun Brown had fired.\nInvestigators conducted numerous interviews with school and sheriff's office staff, though most of those discussions' content is redacted from the reports.\nBay City Public Schools Superintendent Janet Greif requested troopers provide a trespass warning to Brown and retrieve his master keys to school properties. Brown turned over the keys, the Sig Sauer, and his cellphone, the reports state.\nArndt spoke with Brown, who was \"extremely emotional and explained that he had been in contact with his union representative who had advised him not to provide a statement. He did state 'It was a total accident.'\"\nInvestigators sent their reports to the Bay County Prosecutor's Office on Nov. 18. On Nov. 22, office staff forwarded the matter to the Michigan Attorney General's Office with a request that a special prosecutor be appointed to review the case, to avoid any conflict or appearance of impropriety. State Attorney General Bill Schuette on Nov. 29 signed an order granting the request, appointing the Tuscola County Prosecutor's Office to the task of determining whether charges are warranted.\nTuscola County Prosecutor Mark Reene on Dec. 5 said his staff is going to go over the material in a thorough, deliberate manner. As of Dec. 19, Reene has not commented on whether or not he's decided to issue criminal charges against Brown.\nBrown is currently on administrative duties within the sheriff's office.\n\"He's not serving in an official police capacity until everything is done with the court systems,\" said Undersheriff Troy R. Cunningham.\nIf charges are filed against him, Brown could be suspended, Cunningham added. Deputies can carry more than one backup weapon, Cunningham said.\nDeputy Seung Lee has replaced Brown as Western's school resource officer, Cunningham added.\nBrown has been on the force since 1996.\nIn May 2012, CrimeStoppers of Bay County named Brown its Police Officer of the Year Award. Brown started his own program training officers how to handle calls involving children with autism and other special needs. In 2015, he led an active school-shooter training scenario at the Bay-Arenac Intermediate School District education facility."}