{"uri": "http://www.wsaz.com/news/headlines/Woman-Shot-Search-on-for-Shooter-320594742.html", "title": "UPDATE: Woman Shot by Teen Could be Ruled Accidental; Charges Still Possible", "dct": "Tue, 04 Aug 2015 14:58:00 GMT", "id": "e9655a1cfe5c720f48e9a7c88dd21272", "content": "UPDATE 8/4/15 @ 2:30 p.m.\nCROSS LANES, W.Va. (WSAZ) -- A woman is recovering from surgery after getting shot in the stomach.\nIt happened just after 7 a.m. Tuesday at Perkins Parke Apartments in Cross Lanes.\nSheriff's deputies say Phoenix O'Dell, 21, of Cross Lanes, was shot in what they say may have been an accidental shooting.\nThe suspect has been identified as a 17-year-old boy. According to the 911 call, he ran away after the shooting.\n\"We're getting some inconsistencies in some of the statements, and what's matching up or not matching up with the evidence,\" Sgt. Brian Humphreys said.\nEven if the shooting was in fact an accident, the suspect could still be charged. His name is not being released because of his age.\nSome who live in the apartment complex say it was no surprise to wake up to the sight of police lights.\n\"I'm a little tired of it. Almost every day the police is here. It makes you feel for your safety here,\" Steven Owens said.\nWSAZ checked with 911 dispatchers to see how many calls they've received from the complex this summer.\nSince June 1, emergency crews have responded 27 times. A handful of those were for medical calls, but dispatchers say the majority were law enforcement related.\nThe office at the apartment complex was not open Tuesday. No officials were available for comment.\nUPDATE 8/4/15 @ 2:30 p.m.\nCROSS LANES, W.Va. (WSAZ) -- The Kanawha County Sheriff's Office has released the name of a woman who was shot in the stomach early Tuesday morning.\nIt happened at an apartment in Perkins Parke Apartments, on Drexel Place.\nDeputies say Phoenix O'Dell, 21, of Cross Lanes, was the victim. She was taken to the hospital. No word on her condition.\nDeputies say they have identified the suspect as a 17-year-old. The Sheriff's Office is working with the Kanawha County Prosecutor's Office to determine possible charges.\nKeep clicking on WSAZ Mobile and WSAZ.com for the latest on this story.\nUPDATE 8/4/15 @ 11:31 a.m.\nCROSS LANES, W.Va. (WSAZ) -- A 17-year-old has been identified as the suspect in a shooting in Cross Lanes Tuesday morning.\nThe Kanawha County Sheriff's Office says the shooting was reported just after 7 a.m. at an apartment in Perkins Parke Apartments, on Drexel Place.\nDeputies say a woman was shot in the stomach. She was taken to the hospital. Her name and condition have not been released.\nInvestigators say a 17-year-old has been identified as the suspect. They are working with the Kanawha County Prosecutor's Office on possible charges.\nThey say it may have been an accidental shooting, but the incident is still under investigation.\nORIGINAL STORY 8/4/15 @ 8 a.m.\nCROSS LANES, W.Va. (WSAZ) -- Deputies in Kanawha County are looking for a suspect in a shooting that happened Tuesday morning.\nIt happened about 7:06 a.m. Tuesday at the Perkins Parke Apartments in Cross Lanes.\nA Metro 911 dispatcher told WSAZ it was called in as an accidental shooting but the person who allegedly shot the woman left the scene.\nThe woman was taken to the hospital.\nDeputies are looking for the shooter.\nNo other details are being released.\n@KanawhaSheriff: Female shot at Perkins Parke Apts. Taken to hospital. Suspect fled. KCSO investigating.\n— Kanawha Co Sheriff (@KanawhaSheriff) August 4, 2015\nKeep clicking on WSAZ Mobile and WSAZ.com for the latest on this story."}