{"uri": "http://www.wsoctv.com/news/news/local/student-dies-accidental-shooting-3rd-bunker-hill-h/nhmmK/", "title": "Bunker Hill HS students mourn death of third classmate in last 2 weeks", "dct": "Sat, 18 Oct 2014 15:16:00 GMT", "id": "4d306a86eb5f9de9d2097455e63ac432", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCHARLOTTE - A Bunker Hill High School student has started a campaign to honor classmate Austin Hedrick.\nIn a Facebook post on Monday, Ashli Cooper said Austin was a big Dallas Cowboys fan.\nShe posted this photo in hopes that the Cowboys may see it, writing \"In remembrance for, we, as the Bunker Hill community would like the Dallas Cowboys to announce his name at the next Dallas game and show his picture.\"\nShe is encouraging people to use the hashtag #keepheavendancing, because she said Austin loved to dance.\nOn Monday morning, the message “Pray for our school and community” was posted outside of Bunker Hill High School, and counselors planned to speak with students following the death of a third classmate in the past month.\nJust two weeks ago, students spray painted the rock in front of the school to honor two classmates killed in a car crash.\nAs the school week starts, they will be mourning the loss of yet another classmate.\nThe Catawba County Sheriff's Office said Austin Hedrick, 16, was in the cab of a pickup truck with his father and 15-year-old friend. The truck was traveling down Hudson Chapel Road near Browns Chapel Road near midnight. Deputies said a high-caliber hunting rifle went off, killing Austin.\nInvestigators are still looking into how it happened but believe it was accidental.\nChannel 9 spoke with Austin’s family, who said the sophomore loved life, and they want to celebrate that life.\n\"We're taking it minute by minute, day by day,\" said John Hedrick, Austin's uncle. \"It's really hard to process.\"\nAustin played football and wrestled and was very involved in his church, his family said.\n\"He sang at church, he loved to sing and dance,\" said Linda Hedrick, Austin's grandmother. \"He loved to praise the Lord and I know that's where he's at now.\"\nThe latest incident to rock the Catawba County community comes just two weeks after Bunker Hill students Alec Sigmon and Justin Turner were killed in a car crash. Two other students and a recent graduate were also injured in that crash on River Bend Road on Oct. 3.\nThe school is cancelling this week's “Spirit Week” activities leading to Friday’s Homecoming following Austin’s death, and grief counselors will be on hand to help students cope with the tragedy.\nSchool officials said they chose to cancel the activities to create a respectful atmosphere for those who are grieving.\nThe game and other Homecoming activities will still take place Friday night.\n<blockquote class=\"twitter-tweet\" lang=\"en\"><p>Family says he played football, loved wrestling and was very involved in his church. <a href=\"https://twitter.com/wsoctv\">@wsoctv</a> <a href=\"http://t.co/KnZULfQHfW\">pic.twitter.com/KnZULfQHfW</a></p>&mdash; Blake Hanson (@BlakeWSOC9) <a href=\"https://twitter.com/BlakeWSOC9/status/523599176228429824\"></a></blockquote>\n<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>"}