{"uri": "http://www.10tv.com/article/family-murder-suspect-say-shooting-his-17-year-old-girlfriend-was-accidental", "title": "Family of murder suspect says shooting of 17-year-old girlfriend was accidental", "dct": "Wed, 03 Aug 2016 23:55:00 GMT", "id": "1b2b1428bda44d1343e0c75e776be185", "content": "According to Columbus Police, an Upper Arlington teenager was shot to death inside her boyfriend’s home in south Columbus Tuesday night.\n17-year-old Daylee Newman was staying with 18-year old Thomas P. Gutierrez on Markison Avenue, according to family members.\nGutierrez’s brother, Andre Mehler, said his brother had dated Newman for seven months and the shooting was an accident.\n\"They loved each other. He would not do this on purpose,” Mehler said.\nHe said he was with them in an upstairs bedroom when the gun went off.\n“I told him to put it away and stop playing with it. I get up to go…and I turned around and right before I turned around I hear a boom,” he said.\nThat boom was a single gunshot that struck Newman.\nMehler said Gutierrez was putting in the clip in and out of the gun when it fired.\n“[The gun] has a hair trigger on it. So if you touch it lightly, it's going to go off,” Mehler said.\nThe frantic call to dispatchers came from Gutierrez.\nDispatcher: Did you see who shot her?\nCaller: Yeah, it was me. We were playing with the gun. We were playing with a gun, ma'am. Babe, wake up.\nDispatcher: Where is she shot?\nCaller: In the arm or in the chest, I don't know. Please help me, please.\nPolice have charged Gutierrez with murder.\nMeanwhile, Mehler said he wants people to know his brother is not a killer.\n“I know it was accidental, I was right there,” he said. “It was not on purpose.\"\nGutierrez’s father said his son has no criminal record and was two credits away from graduating from South High School.\nOn Thursday, a judge set his bond at $1 million.\nNewman attended Upper Arlington High School until her junior year. The school said grievance counselors will be at the school Thursday and Friday."}