{"uri": "http://nbc4i.com/2016/08/03/one-dead-in-south-columbus-shooting-2/", "title": "17-year-old girl dead in south Columbus shooting; boyfriend arrested", "dct": "Wed, 03 Aug 2016 01:00:00 GMT", "id": "8b9b41c97aa1993c6fdbaa9b069c54bb", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCOLUMBUS (WCMH) — A 17-year-old girl was shot and killed at a south side home, and her boyfriend is in custody accused of her murder.\nPolice say Daylee N. Newman, 17, was found lying on the floor of a home on the 400 block of E. Markison Avenue shortly after 10:30pm Tuesday. Police originally responded to a report of a shooting.\nAccording to a 911 call obtained from Columbus Division of Police, 18-year-old Thomas Gutierrez called dispatchers and explained that they had been playing with a gun and he accidentally shot Newman.\nNewman was taken to Grant Medical Center where she was pronounced dead about an hour later.\nDestine Foster said she is a friend of Gutierrez’s, that the couple was on good terms, and the shooting was an accident.\n“They was just like sitting there on the couch and he accidentally pulled it,” said Foster.\nGutierrez will make his initial appearance in Franklin County Municipal Court Thursday morning.\nHe is charged with murder.\nKeep checking NBC4i.com for real-time updates on this story. To get alerts for breaking news, grab the free NBC4 News App for iPhone or Android. You can also sign up for email alerts.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}