{"uri": "http://www.sfgate.com/crime/article/Multiple-people-injured-in-downtown-Oakland-10595452.php", "title": "8 injured, 2 arrested in downtown Oakland shooting", "dct": "Sat, 05 Nov 2016 00:00:00 GMT", "id": "27fd61296b19d27974a872f90da27d9f", "content": "Eight people were injured in a shooting in downtown Oakland early Saturday, officials said.\nOfficers responded to the gunfire on the 400 block of 14th Street near Broadway just after midnight, according to a statement from the Oakland Police Department.\nTwo men — one age 21 and the other 28 — were arrested in connection with the shooting, police said. Both suffered gunshot wounds and were in stable condition.\nPolice reported that six others — four women and two men ranging from 17 to 28 years old — had been shot. One was in critical condition, while the others were in stable condition.\nA large crowd had gathered on the street outside a nightclub when some type of confrontation took place, authorities said. Police who were in the area on a separate call heard the gunshots and responded to the scene.\n“When officers arrived on scene, multiple victims were medically transported to local hospitals,” the statement said.\nThe shooting was the second big jolt in a week to a city that has struggled to chip away at its homicide rate. On Thursday, Oakland police found the badly burned body of a 21-year-old Alameda County Sheriff’s volunteer in Arroyo Viejo Park.\nThe events rattled Oakland Mayor Libby Schaaf, who has made public safety a top priority.\n“This week has been heartbreaking,” Schaaf said in an interview Saturday.\n“While we are working so hard to address violence in this city, and feel encouraged by a more than 40 percent reduction in shootings and homicides over the past four years, this week shows how much work we have to do,” she said.\nCity Council President Lynette Gibson McElhaney expressed concern that the city does not have enough police officers patrolling the downtown corridor at night.\n“You can’t have a robust nightlife and not staff it appropriately,” said McElhaney. For her, the gun violence in Oakland has personal dimensions: Last year a 17-year-old boy whom McElhaney considered a grandson was gunned down in West Oakland.\nPolice are investigating Saturday’s shooting.\nHamed Aleaziz and Rachel Swan are San Francisco Chronicle staff writers. Email: haleaziz@sfchronicle.com, rswan@sfchronicle.com Twitter: @haleaziz, @rswan"}