{"uri": "http://www.clickorlando.com/news/2-people-shot-pine-hills", "title": "Teen dies after being shot at his 17th birthday party", "dct": "Sat, 22 Oct 2016 23:07:00 GMT", "id": "9e363b1b2caecb5c9b629be611c9d34d", "content": "ORLANDO, Fla. - A teenager has died of his injuries after being shot at a house party celebrating his impending 17th birthday party in Pine Hills, deputies said.\nTerrance Givens was shot Saturday night and died Sunday before he would have turned 17.\nThe party in the 2400 block of Kingsland Avenue near Silver Star Road in Orlando was to mark his Oct. 24 birthday.\nThe shooting was reported at 10:25 p.m. on Saturday.\nGivens was standing on his front porch when he was shot, according to the Orange County Sheriff's Office.\n\"We thought it was fire crackers. I was at the next street. I couldn't get back in the house because the officers said it was like OK Corral,\" said neighbor Myrl Washington.\nWashington said she didn't know Givens too well, but her heart goes out to the family.\n\"When I got ready for church yesterday, the young man was crying on the porch, and I asked him could I help him. I asked him how was the child doing and he said, my brother died this morning,\" said Washington.\nAn 18-year-old woman was also shot in the foot, but was later released after being treated at Orlando Regional Medical Center.\nDetectives said there were 50 to 60 people at the party when the shooting occurred. Details about what led to the shooting, however, have not been released.\n\"He was a cool kid, always making people laugh. Just wanted to see smiles on people's faces,\" De'Andre Singh, a close friend of Givens said holding back tears Monday night.\nSingh was at the party Saturday night and heard about ten shots fired. \"I was just scared,\" he said. \"I didn't know what to do, I was shocked, and everybody ran to the back.\"\nSingh couldn't believe his friend has just been shot.\n\"Everybody just started telling me it was [Terrance],\" he said, \"I froze. I just broke down.\"\nSingh went to school on Monday, which was Givens' 17th birthday, missing his 6th period friend, saying grief counselors were there instead.\nOrange County investigators were in the neighborhood Monday working to gather any evidence that may help in the case. Investigators collected a bullet that was in a car across the street from Givens home.\nIt's not known if the shooter knew the victims, and a description of the shooter has not been released.\nAnyone with information about the shooting is asked to contact the Orange County Sheriff's Office, or Crimeline at 800-423-TIPS.\nStay with News 6 and ClickOrlando.com for updates on this story.\nCopyright 2016 by WKMG ClickOrlando - All rights reserved."}