{"uri": "http://www.ohio.com/news/break-news/four-people-found-shot-to-death-at-north-akron-apartment-complex-1.390771", "title": "Four people found shot to death at North Akron apartment complex", "dct": "Thu, 18 Apr 2013 15:38:00 GMT", "id": "2e8e7c76a011d4c745d2866257d1c455", "content": "The cries of mothers reverberated in the humid air around a North Akron apartment complex Thursday afternoon as the women learned of four young adults found shot to death execution style.\nThe victims, two men and two women all in their 20s, all died of apparent gunshot wounds to the heads, families and police said. They were found in the basement of a Kimlyn Circle townhouse leased by a victim’s sister.\nRelatives were told that shell casings were found on two levels of the apartment.\nThe victims’ identities were not released Thursday night.\nBut families and friends among the growing crowd of onlookers already knew the truth. Many had heard the names through witnesses who found the four bodies inside the AMHA-owned townhouse near Independence Avenue and Chapel Hill Mall.\nAt one point, police escorted the mothers of at least two victims across the yellow crime-scene tape. The women did not view the carnage, but were given enough information to know the identities of their adult children.\nAfterward, the women and their families walked back to the parking lot in tears, some wailing loudly in agony as they collapsed in the arms of loved ones waiting with the throng.\nThe bodies of the four victims were taken to the Summit County Medical Examiner’s Office where autopsies were to be performed and positive IDs established. No suspects had been identified and no motive had been formed, police said.\nApril Roberts-Gilbert, 45, came to the complex about 4 p.m. with her former husband. She was met by her father, Clifford Walters, and her son, Donald Roberts.\nRoberts-Gilbert said her son, Ronald Roberts, 24, of Akron, was one of the victims.\n“My son would not do anything for anything like this to happen,” she said, sobbing. “I just feel that it is wrong that they’re out there killing each other. And for what? What does it solve? It’s not solving anything.\n“Now, I have a 24-year-old son that I have to put away. And for what? Can you please tell my why? That’s all I want to know. Why?”\nJasmeen Wadud, 30, was friends with Ronald Roberts and his sister, Diamond Roberts, who lived in the townhouse where the shootings took place. Diamond Roberts was not home during the shootings, her family said.\nLast seen in morning\nRonald Roberts was staying at his sister’s home and was seen taking out the trash about 7 a.m. Friends said one of the female victims was dating Roberts. Wadud said she left her home about 10 a.m. and returned after learning of the shooting.\n“I saw Ronald in the morning like normal,” Wadud said. “And the next thing you know, I get a call about this.”\nDonald Durham, 54, the father of Ronald Roberts, said his son recently became a father for the second time and was training to be a draftsman. He said his son was a “good kid.”\n“I just think he might have got caught up with the wrong crowd,” Durham said. “Whoever did this wasn’t looking for him. But they weren’t going to leave any witnesses.”\nNearby, Donald Roberts was being greeted by family and friends, offering condolences for his slain younger brother.\n“My brother was a good kid, he didn’t deserve to be killed like that,” he said. “You didn’t have to do my little brother like that.”\nA contingent of Akron police officers, from patrolmen to detectives to Police Chief James Nice, were at the scene. Officers were canvassing the circular complex, talking to residents to determine if anyone heard or saw something related to the shooting.\nDetective work\nPolice Lt. Rick Edwards said he expected officers to be at the scene well into the night as the department tried to unravel the slayings, considered one of the largest mass shootings in recent city history.\nTony O’Leary, executive director of Akron Metropolitan Housing Authority, expressed surprise at the discovery of four bodies inside a unit the agency owns.\n“Historically, it has been a very calm development,” O’Leary said. “We track all police reports for all of our developments. There’s generally a low level of activity there that would require a police response.”\nA private developer initially built the town home complex, O’Leary said. AMHA acquired it several decades ago.\nAnyone with information is asked to contact Akron police at 330-375-2490. Anonymous tips for this or any crime can be left online at http://ci.akron.oh.us/ASP/tip.html.\nInformation may also be provided anonymously by calling Summit County Crimestoppers at 330-434-COPS (2677). Tipsters may qualify for a cash reward.\nPhil Trexler can be reached at 330-996-3717 or ptrexler@thebeaconjournal.com. He can be followed on Twitter at www.twitter.com/PhilTrexler."}