{"uri": "http://www.ksla.com/story/32725690/deputy-marshal-charged-in-shooting-death-of-6-year-old-wants-to-know-if-witnesses-were-hypnotized", "title": "Deputy marshal charged in shooting death of 6-year-old wants to know if witnesses were hypnotized", "dct": "Wed, 10 Aug 2016 10:33:00 GMT", "id": "006f47ad01b83d9e59af603185c56971", "content": "MARKSVILLE, LA (AP/WAFB) -\nOne of two deputy city marshals charged with murder in a 6-year-old boy's fatal shooting wants Louisiana prosecutors to disclose whether any of their witnesses were hypnotized to elicit trial testimony.\nA court filing dated last Friday doesn't explain why Norris Greenhouse Jr.'s lawyer, George Higgins III, is asking if any prosecution witnesses underwent hypnosis or any \"truth-determining examinations,\" such as polygraph tests or sodium pentothal. In his filing, he says hypnosis has become an increasingly common investigative tool for state law-enforcement agencies despite the technique's controversial nature.\nGreenhouse and Derrick Stafford have pleaded not guilty to charges of second-degree murder and attempted second-degree murder in the shooting that killed Jeremy Mardis and wounded his father, Christopher Few, in Marksville last November.\nOn a mobile device? Click here for related stories\nAttorneys for Derrick Stafford filed seven motions in June seeking a number of things before the case heads to trial. They requested a continuance in the case in order to go through all of the evidence in the case. The trial was initially scheduled to begin on Sept. 26, 2016. A new trial date has been set for Nov. 28, 2016, which was the original trial date for Greenhouse. A new date for Greenhouse's trial has not been set.\nInvestigators said Mardis was a passenger in his father’s car when a pursuit started on Nov. 3, 2015 and Stafford and Greenhouse fired at the vehicle. They later determined Greenhouse and Stafford were not justified and were charged. Both are currently out on bond.\nThe arrest report for both Greenhouse and Stafford detail the timeline of events on November 3 around 9:15 p.m. in Marksville. It states Greenhouse started pursuing Christopher Few's 2000 Kia Sport. From there, two more Ward 2 city marshals joined in the pursuit. They were identified as Lt. Jason Brouillette and Stafford. Sgt. Kenneth Parnell, who was working for the Marksville Police Department at the time, heard the call over the radio and responded. It is also when Parnell turned on his body camera that recorded the entire scene.\nTheir affidavits state when everyone reached the dead end of Martin Luther King Drive, Greenhouse and Stafford got out of their cars and \"...discharged their duty weapons towards the 2000 Kia Sport vehicle. The vehicle, Mr. Few and his son were struck by multiple gunshots fired by the deputy city marshals.\"\n\"Mr. Few was critically wounded by two gunshot wounds. Mr. Few's six-year-old son received five gunshot wounds and was pronounced dead at the scene,\" it also stated.\nThe body camera captured 13 minutes from that night...just 26 seconds in, it shows \"...Christopher Few's empty hands are raised and visible when gunfire becomes audible.\"\nWhen Louisiana State Police started its investigation into the guns used, troopers found \"...all spent casings recovered at the scene were fired from the duty weapons of deputy city marshals Norris Greenhouse and Derrick Stafford.\" Also, when Parnell was interviewed by investigators, \"...he stated he didn't fire his weapon because he didn't fear for his life.\"\nBrouillette and Parnell were not charged in connection with the shooting.\nCopyright 2016 WAFB. All rights reserved. The Associated Press contributed to this report."}