{"uri": "http://www.wafb.com/story/33283426/the-investigators-prosecutors-introduce-evidence-saying-officers-were-not-in-any-imminent-danger", "title": "The Investigators: Prosecutors introduce evidence saying officers were not in any imminent danger", "dct": "Thu, 29 Sep 2016 22:24:00 GMT", "id": "3a99470662712aff3635d1ca4c6fafb5", "content": "MARKSVILLE, LA (WAFB) -\nProsecutors with the Attorney General's Office introduced several different pieces of evidence in the case against two deputy marshals accused of killing a 6-year-old boy and critically injuring his father.\nThe attorneys for Norris Greenhouse Jr. and Derrick Stafford have said the officers felt their lives were in danger and were trying to stop Christopher Few, father of 6-year-old Jeremy Mardis, after a car chase.\nA diagram was introduced to show where all the cars involved came to a final rest. Vehicle one is Few's SUV, while vehicle four is from the officer who had on the body camera. Vehicle two was Greenhouse Jr. and vehicle three had two other deputies including Stafford as the passenger.\nThe key takeaway from the diagram, according to prosecutors, is the distance the officers were when firing. All the squares to the left of vehicles two and three are all bullet casings. Prosecutors said casings land to the right after a shot is fired. A majority of the shots were taken from more than 20 feet away with prosecutors saying that shows the officers were not in danger.\nA part of the video shows Few's hands out and visible to the officers. Prosecutors have also argued since the passenger window was down and the windows were not tinted, the deputies could have possibly seen the little boy.\nIn one of the officer's body camera footage, Stafford can be heard asking if Few, the driver, was hit and saying he did not see the child.\n\"Man, I didn't see a kid in the car. I didn't see a kid in the car,\" Stafford said.\nA picture shows the paths of some of the bullets entering Few's vehicle. There are red and green trajectory markers (which have been highlighted with yellow circles). Prosecutors said this shows if you're looking at the vehicle, the officers were standing to the left and shooting at the vehicle.\nThat's why they introduced another diagram. Prosecutors argue that cars can only drive forward or backwards and they cannot move side to side. Notice, according to the diagram, all the bullets are coming from the side and not into the front or rear windshields, with prosecutors again saying the officers were not in any imminent danger.\nThe ballistics report shows a detailed description of where all the bullets came from. In total, investigators have said there were 18 shots fired, 14 from Stafford's gun and four from Greenhouse's gun.\nOf the shots fired, Mardis was shot five times. Two bullets went through and through, meaning they did not remain in his body. The other three were lodged in the body and the projectiles reportedly tracked back to Stafford's gun.\nFew was shot multiple times with only one projectile found, but it was too damaged to compare.\nJudge William Bennett has allowed prosecutors to introduce Stafford's four previous \"excessive force complaints\" that can go on the record and be introduced to a jury.\nStafford's trial date is set for November 28 and Greenhouse Jr.’s trial is expected to begin March 13.\nWARNING: Some may find the body cam video disturbing and graphic.\nCopyright 2016 WAFB. All rights reserved."}