{"uri": "http://www.nola.com/crime/index.ssf/2016/06/attorney_for_louisiana_deputy.html#incart_river_index", "title": "Attorney for Louisiana deputy charged in boy's death hints at defense", "dct": "Wed, 29 Jun 2016 16:22:00 GMT", "id": "3fa779439563b82e40b5d0845aa1c9ce", "content": "MARKSVILLE -- A 6-year-old boy's father had drugs in his system when two deputy city marshals opened fire on the man's car, killing his son and critically wounding him, an attorney for one of the deputies said Wednesday.\nThe father's credibility and state of mind at the time of the November 2015 shooting will be crucial elements of defense for deputy Derrick Stafford, attorney Jonathan Goins told a judge. Goins also disclosed allegations that the father, Christopher Few, had battled a drug addiction and severe depression and had survived a suicide attempt only days before the shooting.\nStafford and the other deputy, Norris Greenhouse Jr., have pleaded not guilty to charges of second-degree murder and attempted second-degree murder in the shooting that wounded Few and killed his autistic son, Jeremy Mardis.\nDerrick Stafford's attorneys say he can't get a fair trial in Avoyelles Parish due to extensive media coverage of the case.\nState Police said the deputies opened fire on Few's car following a pursuit that a third deputy and a Marksville police sergeant also joined. A police report says video from Sgt. Kenneth Parnell III's body camera shows Few's empty hands were raised and visible inside the vehicle when gunfire erupted. The boy was strapped into the front seat.\nParnell told investigators he didn't fire his own weapon because \"he didn't fear for his life,\" the report says.\nState Police Col. Mike Edmonson cited the video when he announced the arrest of the two officers, calling it the most disturbing thing he's seen.\nPolice have said Stafford and Greenhouse fired at least 18 rounds at Few's car. Mardis had five gunshot wounds and his father had two, according to police.\nProsecutors have provided defense attorneys with copies of the video, but the footage hasn't been publicly released.\nGoins said amphetamines and benzodiazepines, a class of drugs that includes Xanax and Valium, were found in Few's system when doctors treated his gunshot wounds at a hospital. He didn't specify exactly what drugs were in Few's system.\n\"We believe that this could have affected his behavior,\" Goins told State District Court Judge William Bennett. \"He was also intoxicated, your honor, and the reports will show that.\"\nStafford's attorneys asked for an order requiring Few to disclose records related to any history of psychiatric treatment, but the judge rejected that request.\n\"It's the behavior that night that's important to this case,\" Bennett said.\nThe judge also refused to order Few to submit to a psychiatric examination by a defense expert.\n\"He doesn't have to talk to you all if he doesn't want to,\" Bennett said.\nFew attended Wednesday's hearing but didn't testify. Steven Lemoine, an attorney for Few and his son's family, declined to respond to Goins' allegations.\n\"Mr. Goins says a lot of things. I guess we will have to wait until trial to see what the facts are,\" Lemoine said.\nA political feud between two Marksville officials may have helped set off a series of events that led to the fatal shooting of a 6-year-old\nStafford's attorneys also asked the judge to move his trial to a different Louisiana parish, saying he can't get a fair trial in Avoyelles Parish due to extensive media coverage of the case and \"inflammatory\" statements made by Edmonson, the head of the Louisiana State Police.\nEdmonson \"made inflammatory statements instead of providing solely factual information,\" Stafford's attorneys said in a court filing.\n\"He proceeded to state during his press conference that Derrick Stafford had 'tarnished the badge' and that Jeremy Mardis 'didn't deserve to die like that,'\" they wrote.\nBennett put off a ruling on the change of venue request, saying they could revisit the issue after they begin questioning prospective jurors from Avoyelles Parish.\nGreenhouse's attorney, George Higgins III, has said he believes that a fair and impartial jury can be picked in the parish.\nStafford's trial is set for Nov. 28.\nStafford, a Marksville police lieutenant, and Greenhouse, a former Marksville police officer, were moonlighting as deputy marshals on the night of the shooting. Stafford also worked part-time as a deputy city marshal in nearby Alexandria, but he was fired from that job following his arrest.\nAfter a hearing in December, Stafford's wife said she believes that race was a factor in the decision by state authorities to bring charges in the case. Stafford and Greenhouse are both black. Few and his son are white."}