{"uri": "http://www.nola.com/crime/index.ssf/2016/01/trials_set_for_deputies_charge.html#incart_river_index", "title": "Trials set for deputies charged in boy's fatal shooting", "dct": "Wed, 06 Jan 2016 04:42:59 GMT", "id": "7047e7c90c84a47dfcfb50bbeb3f17e6", "content": "MARKSVILLE, La. -- A Louisiana judge on Tuesday scheduled separate trials for two deputy city marshals charged with murder in the fatal shooting of a 6-year-old boy who was strapped into the front seat of his father's car.\nA spokesman for the state attorney general's office said Derrick Stafford's trial is tentatively set to begin Sept. 26. Trial for the other deputy, Norris Greenhouse Jr., is scheduled to start Nov. 28.\nStafford and Greenhouse pleaded not guilty Tuesday to charges of second-degree murder and attempted second-degree murder. State District Court Judge William Bennett set the trial dates during their arraignments.\nStafford and Greenhouse were arrested less than a week after the Nov. 3 shooting that killed Jeremy Mardis and critically wounded his father, Chris Few.\nState Police said the deputies opened fire on Few's car following a pursuit that a third deputy and a Marksville police sergeant also joined. A police report says video from the sergeant's body camera shows Few's empty hands were raised and visible inside the vehicle when gunfire erupted.\nMardis had five gunshot wounds and his father had two, according to police.\nGreenhouse's attorney, George Higgins III, said he believes that a fair and impartial jury can be picked in Marksville and has no plans to request for the trial to be moved elsewhere.\n\"I think the case should be tried in Marksville. It's a Marksville case,\" he said.\nGreenhouse, 24, of Marksville, has been freed from jail on $1 million bond. Stafford, 32, of Mansura, has remained jailed on $1 million bond since his arrest.\nStafford, a Marksville police lieutenant, and Greenhouse, a former Marksville police officer, were moonlighting as deputy marshals on the night of the shooting."}