{"uri": "http://www.ksla.com/story/33271840/graphic-body-cam-video-released-from-officer-involved-shooting-that-killed-6-year-old", "title": "GRAPHIC: Body cam video released from officer-involved shooting that killed 6-year-old", "dct": "Thu, 29 Sep 2016 04:33:00 GMT", "id": "85f21c3169c22074786b306c56d3e4dc", "content": "MARKSVILLE, LA (WAFB) -\nWARNING: Some may find the body cam video disturbing and graphic. WAFB has only posted the first minute and 35 seconds of the raw video from the Marksville shooting.\nBody camera footage has been released from the night of a fatal officer-involved shooting in Marksville that resulted in the death of a 6-year-old boy and left his father critically wounded.\nThe highly controversial case has remained sealed, but during a pretrial hearing Wednesday, Judge William Bennett ruled that the footage can be released to the public.\nThe judge also ruled that the two officers involved and charged in the case, Norris Greenhouse Jr. and Derrick Stafford, will have separate trials after denying a motion filed by the defense.\nThe shooting happened Tuesday, Nov. 3, 2015 around 9:30 p.m. During the hearing prosecutors argued that as the shooting began, Chris Few, the father of the slain child Jeremy Mardis, can be seen with his hands raised.\nParish investigators initially said marshals were chasing Few because of an outstanding warrant. However, WAFB checked with the Clerk of Court, the District Attorney's Office, Marksville Police Department and City Court and did not find any outstanding warrants. Col. Mike Edmonson said so far, their investigation shows the same.\nThe shooting was captured by Marksville Police officer Sgt. Kenneth Parnell who said he responded to the pursuit after hearing the call on the radio.\nThe first few minutes of video released has no audio, so it’s not clear when the first shots are fired. The video does show Few with his hands up and out of the vehicle. When sound does kick in, it is deafening gunfire and sirens.\nAs the video continues, Parnell can be heard calling in the shooting to dispatch, but it takes about two minutes for anyone to approach the SUV. Another officer can be heard telling Few to show his hands several times.\nWhen officers do approach, it appears they discovery Few’s 6-year-old son Jeremy.\nParnell then walks back to Greenhouse and Stafford; both men’s names are visible on their shirts. It sounds like the Parnell tells them about Jeremy, and Greenhouse appears to respond, \"Don’t tell me that, bro.\"\nIt’s also at that point that other officers begin to arrive on scene, and someone asks if Few is armed. Investigators would later confirm that Few was not armed, despite conflicting early reports.\nIt also takes some time for officers to render aid, asking several times for gloves as Few fell from the car. Seven minutes into the video, the officer goes over to Jeremy’s lifeless body to check for a pulse.\nAt some point, the video again shows Stafford who asked if Few was hit. Few was injured but survived.\n\"Man, I didn't see a kid in the car,\" Greenhouse can be heard saying.\nDuring the pretrial hearing, other evidence provided was a testimony by Trooper Rodney Owens, the lead detective on the investigation. He said that out of 18 shells found, 14 came from Stafford's gun. The other four came from Greenhouse's gun.\nJeremy Mardis was struck five times and was pronounced dead at the scene.\nThe trial for Stafford is set for a November 28 and Greenhouse's trial is scheduled for March 13.\nMORE VIDEOS:\nCopyright 2016 WAFB. All rights reserved."}