{"uri": "http://www.ksla.com/story/30447357/lsp-gun-not-found-in-vehicle-after-officer-involved-shooting-that-killed-6-year-old", "title": "LSP: No gun found in vehicle after officer-involved shooting that killed 6-year-old", "dct": "Thu, 05 Nov 2015 23:41:00 GMT", "id": "aab91311844f568c08f99cc340e0af65", "content": "MARKSVILLE, LA (WAFB) -\nTwo days after 6-year-old Jeremy Mardis was accidentally shot and killed at the tail-end of a police pursuit, many are still confused about exactly what happened on Martin Luther King Drive in Marksville, LA.\nDuring a 2 p.m. news conference on Thursday, Louisiana State Police Col. Mike Edmonson said no gun was found in the vehicle the Ward 2 City Marshal deputies were chasing that resulted in the death of a 6-year-old boy. The shooting happened Tuesday, Nov. 3, 2015 around 9:30 p.m.\nOfficials say the child was shot five times during the shootout.\nDr. L.J. Mayeux, coroner of Avoyelles Parish, said the father of the victim, Chris Few, had warrants out for his arrest. Ward 2 City Marshal deputies reportedly spotted Few's vehicle on Washington Street and initiated a stop. Instead of pulling over, officials say Few led deputies on a chase through Marksville, finally turning down Martin Luther King Drive, which is a dead end street.\nParish investigators initially said marshals were chasing Chris Few because of an outstanding warrant. However, WAFB checked with the Clerk of Court, the District Attorney's Office, Marksville Police Department and City Court and we did not find any outstanding warrants. Col. Mike Edmonson says so far, their investigation shows the same.\n\"I am not aware of one but I have not been provided with anything that says otherwise,\" he said.\nMayeux added Few backed into the marshal's vehicle several times and would not get out and that is when the gunfire erupted. Officials initially stated there was an exchange of gunfire during the incident Tuesday night. As of Thursday afternoon, officials are now saying a gun was not found in Few's vehicle.\nAt last report, Few was listed in critical condition.\nCol. Edmonson says there is also no evidence, at this time, that Few backed into the deputy's vehicle. Investigators are reviewing at least one piece of video that shows part of the gunfire. A source tells WAFB that video is from a police body camera one of the officers was wearing.\nCol. Edmonson says the Louisiana State Police was contacted shortly after the shooting. For the first 12 to 15 hours, investigators were in a forensic mode - investigating the trajectory of the bullets fired.\nDuring the initial investigation, the Marksville Police Chief stated there were four officers involved. Three of them worked full time for the Marksville Police Department, one worked as a Reserve Officer for the Marksville Police Department. Three of the officers were moonlighting as Ward 2 City Marshals, a fourth officer was called in as backup with the Marksville Police Department. The problem is, the police chief and mayor did not know their officers picked up the part-time jobs with the City Marshal's office until about three months ago.\nMarksville Mayor John Lemoine sent a request to the Louisiana Attorney General's Office in September, concerned about the City Marshal's deputies. The letter, in part, read:\nWe have reason to believe that the Ward 2 Marshal is issuing tickets inside the city limits without consent or approval of the Marksville City Council.\n\"If we could have done anything to prevent it we would have but like I said, it wasn't our deputies. It wasn't our deputies who were on duty at the time for Marksville. You will need to talk to the Ward 2 Marshal,\" said Mayor Lemoine.\nHowever, Ward 2 Marshal Floyd Voinche was not at Thursday's news conference. He has declined on-camera interviews, but did tell WAFB by phone his marshals only work 17 hours in a month, and at least three of the four will not be coming back to work until the investigation is over.\nAccording to Col. Edmonson, officers involved in any officer-involved shooting are given a \"day or two to rest and get sleep\" before being interviewed for the investigation. As of 2:45 p.m. Thursday, the officers involved had not been interviewed. There is a question if the City Marshals had jurisdiction at the time of the shooting.\nThe officers are not on leave at this time, but LSP officials recommends the officers be placed on administrative leave, \"but it will be up to the chief.\" The names of the officers have not been released.\nJeremy Mardis was a first grader at Lafarue Elementary School in Effie.\nLouisiana State Police currently is heading the investigation. There is no word if Few is facing any charges at this time.\nCopyright 2015 WAFB. All rights reserved."}