{"uri": "http://www.ksla.com/story/30712920/grand-jury-expected-to-hear-evidence-against-2-officers-charged-in-marksville-shooting", "title": "Grand jury indicts 2 officers on murder charges in connection with deadly Marksville shooting", "dct": "Thu, 10 Dec 2015 10:46:00 GMT", "id": "cc77ca70e5c9679a43fb2f689867f18b", "content": "MARKSVILLE, LA (WAFB) -\nA grand jury has indicted two officers on murder charges in connection with a shooting that left a 6-year-old dead and his father wounded.\nNorris Greenhouse Jr. and Derrick Stafford are both now formally charged with second-degree murder in the shooting death of Jeremy Mardis and attempted second-degree murder because his father, Chris Few, was also shot. A second-degree murder conviction in Louisiana carries a mandatory life sentence without the possibility of probation or parole.\n\"I'm pleased with it,\" Few said in response to the decision.\nShortly after the grand jury hearing, Judge William Bennett vacated and dismissed the gag order that had been put in place as the investigation continued.\nGreenhouse Jr. and Stafford were arrested on November 6 on the same charges handed down in the indictment.\nFew was in his truck on November 3, with his son in the passenger seat. Sources have said Greenhouse Jr. may have known Few and that may have played a role into why he and Stafford allegedly shot at his truck multiple times, fatally striking Mardis and injuring Few.\nLouisiana State Police, the lead investigating agency in the case, said no gun was found on Few or in his truck and added there is no evidence that he returned fire at the two officers.\nBond was set at $1 million for each man. Greenhouse Jr.'s father, Norris Greenhouse Sr., was able to put up $1 million worth of property to secure the required bond for his son after a court hearing. Greenhouse Jr. was released on bond on November 24.\nStafford remains in Rapides Parish where he is being held on a $1 million bond.\nThe motion for bond reduction Stafford's lawyer filed on December 2, stated, \"Defendant lacks the financial ability to pay this bond and seeks to have the same reduced. The evidence in this matter is lacking and insufficient to support a conviction.\"\nCopyright 2015 WAFB. All rights reserved."}