{"uri": "http://www.ksla.com/story/30699487/the-investigators-2-marksville-officers-cleared-of-wrongdoing-in-deadly-shooting", "title": "The Investigators: 2 Marksville officers cleared of wrongdoing in deadly shooting", "dct": "Wed, 09 Dec 2015 15:57:00 GMT", "id": "ee20bb179bcd406a27851d86d7c16b40", "content": "MARKSVILLE, LA (WAFB) -\nTwo officers who were a part of the Marksville deadly shooting investigation have been cleared and have returned to work.\nPolice Chief Elster Smith said Sgt. Kenneth Parnell and Lt. Jason Brouillette returned to work on Friday after they were cleared both of any wrongdoing in the deadly shooting.\nSmith added that Parnell was working for the Marksville Police Department that night and responded to the call. His body camera is what captured the entire scene and helped troopers in their investigation. Brouillette was moonlighting as a Ward 2 city marshal when he arrived to the scene.\nJeremy Mardis, 6, was killed and his father, Chris Few, was injured at the dead end of Martin Luther King Drive on November 3.\nNorris Greenhouse Jr. bonded out of jail after his father, Avoyelles Parish Assistant District Attorney Norris Greenhouse Sr., put up enough property to secure the $1 million bond. Derrick Stafford is still behind bars in Rapides Parish, where his lawyer has requested a hearing for a bond reduction, saying his client cannot financially afford the $1 million bond.\nSmith said Stafford is suspended without pay and will remain that way until the investigation is completed.\nWard 2 City Marshal Floyd Voinche said both Greenhouse and Stafford are suspended without pay from the marshal's office pending the outcome of the investigation.\nGreenhouse also worked full-time for the Alexandria City Marshal's Office and Stafford worked for the agency part-time. Alexandria City Marshal Terence Grines said both have been fired.\nThe Office of the Louisiana Attorney General will present the case to an Avoyelles Parish grand jury on Thursday. The grand jury will decide if there is enough evidence to formally indict the two men.\nCopyright 2015 WAFB. All rights reserved."}