{"uri": "http://www.thegazette.com/subject/news/public-safety/jefferson-student-who-shot-himself-has-died-20160912", "title": "Jefferson student who shot himself has died", "dct": "Mon, 12 Sep 2016 21:57:00 GMT", "id": "59488350c59ba79f9fc8500ed988b697", "content": "CEDAR RAPIDS — Police continue to investigate the suicide of a student outside Jefferson High School and have been monitoring social media posts since the 15-year-old student shot himself Friday morning.\nThe student, who has not been identified, died Saturday afternoon, police said.\nPolice said in a news release Monday that they have not received “any information that indicates that anyone else was involved other than the 15-year-old male who took his own life.”\nThe social media posts purport to show links to school shootings, leading to speculation that the student may have been planning a school shooting of his own, but it was not possible to verify the authenticity of those posts Monday.\nPolice acknowledged those concerns but said investigators and the school district “are aware, have been monitoring and are continuing to investigate several social media posts that have been shared since Friday’s incident. There has been no evidence of any specific, credible threat to students or staff at Jefferson High School.”\nAdditional police officers were at the high school Monday “to reassure students, staff and parents,” police said, adding the district is continuing to provide counseling for those who feel they need it.\nPolice ask that anyone with information about the incident contact the Criminal Investigative Division at (319) 286-5400.\nCedar Rapids police officers responded to the high school, at 1243 20th St. SW, just before 8 a.m. Friday. The 15-year-old boy was found behind the Jefferson auditorium, suffering from a gunshot wound and taken to the hospital. Police said then the boy’s injuries were self-inflicted.\nThe shooting prompted the school to go on lockdown for less than two hours. Classes ultimately continued on an adjusted schedule and counselors and police chaplains were dispatched to the school.\nThe National Suicide Prevention Lifeline is 1-800-273-8255."}