{"uri": "http://www.nbcwashington.com/news/local/Howard-County-Triple-Shooting-Leaves-One-Dead-Two-Others-Injured-409143975.html", "title": "Police: 15-Year-Old Boy Kills 16-Year-Old Girl, Wounds Her Mother in Maryland Home", "dct": "Sun, 01 Jan 2017 15:53:00 GMT", "id": "040e2b858b1d8f849a522dc3374003f5", "content": "A 16-year-old girl was shot and killed inside her home in Ellicott City, Maryland, early New Year's Day after a 15-year-old boy shot the girl's mother, the girl and then himself, police said.\nCharlotte Zaremba was shot inside her bedroom on the 4800 block of Knoll Glen Road, Howard County police said. The shooter also shot her mother, Suzanne Zaremba.\nIt is unclear if the suspect had any connection to the victims, police said. His motive is unknown.\nAccording to the preliminary investigation, Suzanne Zaremba heard a scuffle in her daughter's bedroom about 2 a.m. Sunday. She entered and saw the teen boy.\nThe boy shot the 52-year-old woman and then her teen daughter.\nThen, he shot himself in the head, police said.\nCharlotte Zaremba was taken to Howard County General Hospital, where she was pronounced dead. Suzanne Zaremba was taken to the University of Maryland Shock Trauma Center. She was treated for a gunshot wound and released.\nThe suspect also was taken to Shock Trauma, where he was in critical condition with a life-threatening injury.\nPolice said Sunday afternoon they had confirmed the identity of the suspect but \"his name cannot be released.\"\nCharlotte Zaremba was sweet and strong-minded, her self-defense instructor, Brian Kushner, told WBAL TV in Baltimore.\n\"She was a great person,\" he said.\nAuthorities said there is no indication anyone else was involved in the shooting, which occurred in a residential neighborhood about 25 miles northeast of Washington, D.C.\nAnother family member was home at the time of the shooting but was not hurt, police said.\nA bouquet of flowers laid at the base of the family's mailbox Sunday afternoon.\nCharlotte Zaremba was a sophomore at Howard High School. Students there wore black on Monday as they mourned her death.\nThe students' first period was set aside for discussion and contemplation.\n\"The school system will have a team of counselors here to support students and staff,\" Howard County Public Schools spokesman John White said.\nThe investigation is ongoing. Anyone with information for police is asked to call 410-212-STOP or send an email to HCPDcrimetips@howardcountymd.gov.\nStay with News4 for more details on this developing story."}