{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-violence-labor-day-monday-20160905-story.html", "title": "31 shot, 9 fatally, over 21-hour period Monday into Tuesday", "dct": "Tue, 06 Sep 2016 02:43:00 GMT", "id": "82dc32d87c97128b4c8f76e94fb1ac96", "content": "Nine men were killed and at least 22 other people were wounded in separate shootings over a 21-hour period Monday morning into Tuesday morning, Chicago police said.\nThe most recent homicide left two people dead and three other people wounded in the Lawndale neighborhood on the city's West Side. The five were standing outside about 10:45 p.m. in the 2700 block of West Lexington Street when someone in a silver minivan opened fire toward the group on a sidewalk.\nA 22-year-old man was taken to Stroger Hospital and pronounced dead, and a 22-year-old man died at Mount Sinai Hospital. A 17-year-old boy was left in serious condition with a chest wound, a 20-year-old was left in serious condition with chest and arm wounds and a 16-year-old was left in critical condition with a chest wound.\nAnother shooting left two people dead in Ogden Park as more than 100 people celebrated Labor Day there. Authorities were called to the shooting about 7:20 p.m., according to Chicago Fire Department Cmdr. Walter Schroeder.\nTwo adult victims were taken to Stroger Hospital, where they were pronounced dead, said Officer Michelle Tannehill, a police spokeswoman.\nA 47-year-old man, was walking his dog when he heard shots being fired from a vehicle and he was struck in the chest, Tannehill said. The second man, 24, was hanging out in the park when he also heard the shots and began running. He was shot in the chest, police said. Police earlier said the two shot were possibly in their late teens.\nOne bystander, a man, said the park is an area that people gather for high school reunions and to play, but another man who is a long-time resident of the area said Ogden Park has “gotten worse over the years’’ and added that he heard about five shots.\nBoth men described the attack as “senseless.’’\nAnother fatal shooting happened a half hour earlier, about 6:50 p.m., in the 900 block of West 58th Street in the Englewood neighborhood.\nSomeone in a light-colored vehicle drove past him and fired multiple shots, hitting him in the back, said Officer Kevin Quaid, a police spokesman. The man, identified as LaShawn Carr, of the 5900 block of South Emerald Avenue, was pronounced dead at St. Bernard Hospital, at 7:07 p.m., said police and the Cook County medical examiner's office.\nEarlier, 44-year-old Albertano Medrano was fatally shot about 4 p.m. in the Back of the Yards neighborhood, according to the medical examiner's office and police. The man was driving in the 4500 block of South Hermitage Avenue when several people inside a white van began harassing him, Tannehill said.\nThe 44-year-old tried to drive away, but one of the van’s occupants opened fire and hit him in the head, neck and back. As he fled, he struck several parked cars. He was taken to Stroger Hospital, where he was pronounced dead at 4:30 p.m., according to the medical examiner's office.\nA van matching the description crashed on Western Avenue, and two men inside tried to flee and pitch a weapon in a clothing donation bin at a gas station in the 5200 block of South Western Avenue, police said.\nThe two fled and were later taken into custody and a rifle was recovered, police said.\nAbout 1:25 p.m., police were called to the 4500 block of South Whipple Street in the Brighton Park neighborhood where they found Enrique D. Morales, 22, with a gunshot wound to the chest, Tannehill said. His roommates found his body lying in a driveway, Quaid said. In earlier police reports the man's age had been 20.\nAbout 9:30 a.m., officers responded to a call of two men shot in the 6800 block of South Emerald Avenue in the Englewood neighborhood, said Officer Jose Estrada, a police spokesman.\nDavid Baldwin, 24, was shot in the head and taken to Advocate Christ Medical Center in Oak Lawn, where he was pronounced dead at 2:58 p.m. Monday, officials said. The second man, 26, suffered a wound to the upper left shoulder and a graze wound to the head and was taken in critical condition to Stroger Hospital, Estrada said.\nWitnesses told police the gunman fled to a building on Emerald, and a SWAT team was called to the scene, Estrada said. The building was cleared by 12:40 p.m., but no one was in custody, police said.\nEarlier Monday, an 80-year-old man was found fatally shot in the face in the city's South Shore neighborhood. The man was outside in the 2800 block of East 77th Street about 6:20 a.m. when he and another person, the assailant, began talking, Tannehill said. The assailant fired one shot, striking the 80-year-old, and then moved in and fired more shots, Tannehill said.\nPolice found the elderly man lying on the ground unresponsive, said Officer Nicole Trainor, a police spokeswoman. The man, who lived nearby in the 2800 block of East 77th Place, was pronounced dead on the scene, according to the Cook County medical examiner's office.\nA suspect was arrested and charges were pending, Tannehill said.\nPolice were investigating.\nIn non-fatal shootings:\nA 20-year-old man walked into the University of Chicago Hospital after being shot at 3 a.m. Tuesday and told police he had been walking in the 6300 block of South Winchester Avenue when someone shot him. He was otherwise uncooperative and transferred to Mount Sinai Hospital for treatment. He had been shot in the back and his condition was stabilized.\nAn 18-year-old man was shot in the 900 block of North Long Avenue in the Austin neighborhood about 2:15 a.m., police said. He was shot in the back and buttocks and taken to Mount Sinai Hospital, where his condition was stabilized.\nAbout 12:40 a.m., a 36-year-old man and a 25-year-old woman were wounded in as shooting in the Englewood neighborhood on the South Side, police said.\nThe two were in a vehicle traveling south in the 5600 block of South Green Street when someone in a white sedan fired shots at them. The man was shot in the left knee and was taken to St. Bernard Hospital, where his condition stabilized. The woman suffered graze wounds to both of her legs, and her condition also was stabilized, police said.\nA 26-year-old man told police he was shot on the Dan Ryan Expressway between 83rd and 85th streets about 11:25 p.m. Monday. The man crashed near 200 W. 87th St. and was taken to Advocate Christ Medical Center.\nAbout 11:10 p.m., two people in a car in the 3300 block of West Flournoy Street were shot. One man, whose age wasn't available, was grazed in the neck. A 36-year-old woman was shot right arm and back, and police said both of their conditions had been stabilized."}