{"uri": "http://www.syracuse.com/crime/index.ssf/2015/02/all_6_tipp_hill_shooting_victims_out_of_hospital.html", "title": "All 6 Tipp Hill shooting victims out of hospital", "dct": "Fri, 20 Feb 2015 20:47:13 GMT", "id": "f5a63a5538c777abbd49cdbf4602b91b", "content": "SYRACUSE, N.Y. -- All six people shot at McAvan's Pub in Syracuse's Tipperary Hill neighborhood Feb. 1 are out of the hospital, an official said.\nA friend of 28-year-old Lawrence Gabriel's family, who is helping run a fundraiser to benefit the \"hero of McAvan's,\" confirmed that Gabriel was recovering at home from four critical gunshot wounds.\nGabriel, a bouncer at the pub, Army veteran and reservist, wrestled the shooter out of the bar after he opened fire, striking six people, police said.\nGabriel was shot in his right arm and leg and twice in the abdomen, according to his uncle Jeff Gabriel. A metal rod was put in his leg and a metal plate was put in his arm, Jeff Gabriel said. In the week after the shooting, Lawrence Gabriel took steps, started eating solid food, and talked a little bit with his loved ones.\nThe fundraiser for Gabriel has collected more than $17,000.\nThe other five victims are no longer listed as patients at the hospital, the official said. Another was initially listed in critical condition, while two others were determined to have serious injuries.\nThe other victims were identified as Douglas Spossey, Joshua Kennedy, Rich Lighton, Jake Palmer and Christina Voultsios.\nThe shooting happened after Michael Morris, 22, of 1613 W. Onondaga St., kidnapped Spossey's sister and Morris' ex-girlfriend, Rebecca Spossey, after encountering her at a market on the city's South Side, police said. Morris forced his ex-girlfriend into a car at gunpoint, drove her to a cemetery twice and threatened to kill her, police said.\nMorris then forced Spossey to bring him into the bar, where her family and friends were celebrating a birthday, police said. When Douglas Spossey sensed something was wrong and tried to split them up, Morris shot him and continued to fire the gun, police said.\nMorris has been charged with five counts of second-degree attempted murder, second-degree kidnapping, second-degree criminal possession of a weapon and first-degree reckless endangerment, all felonies. He has also been charged with misdemeanor second-degree menacing.\nMorris is being held at the Onondaga County Justice Center without bail.\nContact Julie McMahon anytime: Email | Twitter | 315-412-1992"}