{"uri": "http://www.reviewjournal.com/crime/homicides/1-dead-after-shooting-near-north-las-vegas-airport", "title": "1 dead after shooting near North Las Vegas airport", "dct": "Mon, 11 Jul 2016 19:47:00 GMT", "id": "994840f262a9d0009854e4cd2eb3913d", "content": "A young man was shot dead at an apartment complex near the North Las Vegas airport Monday evening.\nMedics and Las Vegas police were called to the shooting about 6:30 p.m. just within the front gate of Alterra Apartments, 2701 N. Decatur Blvd. near Rancho Drive, Metropolitan Police Department Lt. Jeff Goodwin said.\nThe person shot was pronounced dead at University Medical Center’s trauma unit about 40 minutes later, Metro homicide Lt. Dan McGrath said. The man looked to be in his late teens, but his identity had not been confirmed as of 10 p.m.\nWhen the shooting happened, a 26-year-old man who lives in the complex heard two loud bangs from his nearby bedroom.\n“Like ‘pow-pow,’” the man, who did not want to be named, said. “At first, I didn’t know if was fireworks, but it did seem louder than expected.”\nWhen he stepped outside to check, he saw a man running.\nMcGrath said police are looking for two suspects: both Hispanic men wearing T-shirts and shorts. The shooter was wearing a black baseball cap with a ponytail in the back, held together with a rubber band. The other man had a short, trimmed beard.\nBoth men ran out of the complex’s front gates, east on Decatur, then north, per witnesses.\n“It looks like they might have chased him a little bit, because there’s a hat on once side of the parking lot and then the shots were fired on the other side,” McGrath said.\nAnyone with information is asked to call Metro’s homicide unit at 702-828-3521 or Crime Stoppers at 702-385-5555.\nAs of 10 p.m., homicide detectives had not yet determined a motive, but McGrath said “whatever the motive is, it’s probably going to be something that’s absolutely not necessary, senseless and didn’t need to get shot over.”\nThe county coroner’s office will identify the person shot once his family has been notified.\nThis was the 95th confirmed homicide Metro has investigated so far this year.\nContact Rachel Crosby at rcrosby@reviewjournal.com or 702-387-5290. Find @rachelacrosby on Twitter."}