{"uri": "http://www.chron.com/news/houston-texas/houston/article/Girl-4-died-in-apparent-murder-suicide-in-Katy-9226839.php", "title": "Girl, 4, died in apparent murder-suicide in Katy area", "dct": "Fri, 16 Sep 2016 00:00:00 GMT", "id": "59718391d1573a54cbf236ce29482cf6", "content": "A 4-year girl has died after she was wounded in an apparent murder-suicide that ended when her father killed himself Thursday night in west Harris County, officials said.\nThe shooting happened about 9 p.m. Thursday at a home in the 5400 block of Plantation Forest Drive in the northern Katy area, according to the Harris County Sheriff's Office.\nDeputies said the man, 26-year-old Tarel Felder, was discovered shot to death inside the house and the girl was wounded. The child was transported by LifeFlight medical helicopter to Memorial Hermann-Texas Medical Center, where she died.\nThe deceased child is Amari Felder, according to a case status from the Harris County Institute of Forensic Sciences.\nOn Friday morning, neighbors expressed disbelief that a father killed his little girl and then himself inside a house on their street.\nUrkia Lock, who lives two doors down, walked outside Thursday night when a friend on the way to visit couldn't get through because of emergency vehicles, law enforcement cruisers and police tape blocking the street.\nLock, who shot video of the scene of flashing lights, said she had seen the man and his daughter outside earlier in the day and remembered thinking the girl \"was so cute because of her hair.\"\nThat's why she recognized the braids and pink barrettes as the child was whisked on a stretcher from the home to the ambulance while paramedics pumped on the girl's chest.\nAn older woman who lives at the house also emerged with her \"hands full of blood,\" Lock said.\nThe details of the shooting were still being investigated Friday, but sheriff's officials said the incident appears to have resulted from a \"domestic situation\" and apparently a murder-suicide."}