{"uri": "http://wivb.com/2016/08/26/8-year-old-shooting-victim-in-critical-condition/", "title": "8-year-old shooting victim in critical condition", "dct": "Fri, 26 Aug 2016 15:00:00 GMT", "id": "179de0774024d9532dfe37f1f9073ff2", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nBUFFALO, N.Y. (WIVB)- 8-year-old Donnell Bibbes underwent a second surgery at Women & Children’s Hospital Friday morning. Hospital officials said as of Friday afternoon he remained in critical condition.\n“This is a senseless act of violence that leaves an 8-year-old fighting for his life,” said Mayor Byron Brown after meeting with the boy’s family.\nThe child was shot in the head Thursday night around 10 on South Division Street near Hickory and Pine Streets. Police told News 4 it occurred while Bibbes was visiting relatives in the area.\nBibbes was with his two older brothers and his mother at the time of the shooting. According to Buffalo Police Commissioner Daniel Derenda, one of the suspects ran up to the car and fired several shots at and inside the vehicle; 10-15 shots were fired.\nPolice were adamant Friday afternoon that this shooting was targeted, and likely an act of gang violence.\nThey believe one of Bibbes’ older brothers was like the intended target. Neither of the brothers or Bibbes’ mother were injured, according to Buffalo Police.\n“We need people to come forward. We know there are people who witnessed this and we are not getting a lot of cooperation in these gang shootings. We need them to come forward and step up because this was a total senseless tragic act,” Commissioner Derenda said.\nDerenda said solving gang related homicides and shootings usually poses a challenge, due to lack of cooperation from the community.\n“A lot of the victims are suspects in other homicides, other shootings, so we don’t get cooperation from them or their friends.”\nBibbes mother, Chawniqua Johnson, released the following statement:\n“Our family would like to thank everyone for their concern and prayers for Donnell. At this time, we have asked for our privacy. Please continue to pray for him as he fights to recover.”\nMayor Brown announced CrimeStoppers and the Buffalo Police Department are offering a $2,500 reward for anyone with information that leads to an arrest.\nAnyone with any information about the shooting is urged to call the BPD Confidential Tipline at 847-2255.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}