{"uri": "http://www.courant.com/community/hartford/hc-hartford-antiviolence-rally-1117-20161116-story.html", "title": "Girl’s Shooting Spurs Anti-Violence Rally At Hartford City Hall", "dct": "Thu, 17 Nov 2016 05:00:00 GMT", "id": "1f6a048f56fc7eeedaff35651cff9b94", "content": "To the Rev. Henry Brown, the silence that followed the shooting of a 10-year-old girl Nov. 6 was deafening.\n\"There has been no public outrage toward this,\" the longtime community activist said Wednesday. \"We want to raise the consciousness of the people in Hartford and show them we won't tolerate this behavior. What we're trying to do is show we care what happened to her.\"\nIn that vein, Brown and Mothers United Against Violence, the group he helped co-found, are organizing an anti-violence rally outside City Hall on Saturday at 1 p.m.\nHe was deeply troubled, he said, by the shooting of Ariana Wilson, a girl injured in a drive-by shooting as she sat inside her home in the city's Blue Hills neighborhood.\nBrown likened Wilson's shooting to that of Takira Gaston, a fitting comparison: Gaston was 7-years-old, out with her family at a summertime picnic, when she was caught in the crossfire of warring drug dealers.\nGaston, like Wilson, was shot in the face, an injury that sparked demonstrations, public comment by elected officials and beefed-up patrols in the city from state police officers.\nBut Brown hasn't seen that level of response this time around, he said. And it bothers him.\n\"We want people to understand that we cannot keep letting these things happen,\" he said. \"We can't keep endangering the lives of people in the community.\"\nWilson remained in Connecticut Children's Medical Center on Wednesday, according to Brown. She was taken there for treatment after a bullet from a 9mm handgun struck her in the jaw during the broad-daylight shooting outside her home.\nPolice have said she was an innocent bystander in the gunfire, initiated from a black sedan that sped away after spraying Wilson's home with bullets.\nNo arrests had been in the case, which remains active, as of Wednesday, according to Deputy Police Chief Brian Foley.\nThough dedicated to Wilson's recovery, Saturday's event is being held in honor of all recent shooting victims, especially those whose attacks remain unsolved.\n\"When we see something and say nothing, when we say something and do nothing, and when we hear something and tell no one, as a community, the blood and hurt and murder is on our hands,\" Brown said.\nAnyone with information is asked to contact Hartford police at 860-757-4179."}