{"uri": "http://wsvn.com/news/local/1-dead-2-hurt-in-hallandale-beach-shooting-1-in-custody/", "title": "1 dead, 2 hurt in Hallandale Beach shooting; 1 in custody", "dct": "Mon, 16 Jan 2017 00:00:00 GMT", "id": "d159bad75c88d2201b460228c4f7fa65", "content": "HALLANDALE BEACH, FLA. (WSVN) - One person was killed and two others were taken to the hospital after someone reportedly opened fire during an event celebrating Dr. Martin Luther King Jr. Day, in Hallandale Beach, Monday evening.\nPolice later took one subject into custody, who they believe is the gunman.\nPolice and fire rescue crews responded to the scene of the shooting, at a block party along the 700 block of Foster Road, near Foster Park, just east of Interstate 95, at around 6:30 p.m.\n“We were here having a great time. Everybody enjoying themselves, everybody was dancing,” said area resident Greg Clark.\nHowever, the good time came to an abrupt halt after, neighbors said, two people got into an argument.\nOne onlooker said the altercation spiraled into gun violence. “They said a guy pulled out a gun and shot him twice,” he said.\n“‘Boom, boom, boom, boom, boom,'” said Clark when asked to describe what he heard.\n“I heard a lot of people scattering,” said the onlooker.\n“Everybody went out running and getting out of the way,” said Clark.\nRELATED: 8 shot at Martin Luther King Jr. Memorial Park in Miami on MLK Day; 2 detained\n7’s Skyforce HD hovered above the scene as paramedics treated one of the victims and put another in an ambulance.\nOfficials said three people in total were shot. One of them, an adult male, later died from his injuries.\nPolice confirmed one of the victims sustained one gunshot wound to the leg, but both injured revelers are expected to be OK.\nInvestigators remained at the scene, as they tried to determine why the dispute turned violent. “It’s an unfortunate situation that things like this happen,” said Hallandale Police Maj. Pedro Abut. “However, we’re going to completely and thoroughly conduct an investigation, so we can understand what exactly happened tonight.”\n“It’s stupid,” said Clark. “We people are here enjoying ourselves, and then you come do something stupid like that. They didn’t do it like we did. We used to fight in the old days, but everybody wanna shoot.”\nInvestigators have not yet identified any of the victims. They said the subject is being questioned and is cooperating with detectives.\nIf you have any information on this shooting, call Broward County Crime Stoppers at 954-493-TIPS. Remember, you can always remain anonymous, and you may be eligible for a $3,000 reward.\nCopyright 2017 Sunbeam Television Corp. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}