{"uri": "http://www.cbs46.com/story/30793937/police-teen-accidentally-shoots-mother-in-the-neck", "title": "Teen who accidentally shot mother now faces charges", "dct": "Sun, 20 Dec 2015 02:53:00 GMT", "id": "56bc3bdc52801199bb25f6e96160a760", "content": "FULTON COUNTY, GA (CBS46) -\nA 13-year-old boy who accidentally shot his mother in the neck and throat Saturday night is now charged with aggravated assault and possession of a firearm. It happened inside the family's home on Hilltop Way in College Park.\nFulton County police are investigating and say they still haven't determined exactly how the teen got his hands on a loaded firearm. He told police and his older brother that he found outside in the neighborhood.\n“That’s as far as I know. He told me he found it in the subdivision,\" said Malik Touray, 20, about his younger brother. He added that he believed his brother thought is was \"just a toy.\"\nPolice said when the teen pulled the trigger, it fired and hit his mother in the neck. They are still trying to determine who owns the gun and who put a bullet in the chamber.\n“It is possible for a real gun to look fake. It’s also very possible for a fake or toy gun to look real,\" said Detective Melissa Parker.\nParker said it appears the shooting was an accident, but the investigation isn't over yet. Due to her injuries, the boy's mother has been unable to speak with investigators.\nThis is the second time a shooting has occurred at this address in the past 15 months. In September of 2014, police found a 45-year-old man shot to death in the driveway.\nInvestigators said Hardy Touray owned two local gas stations and robbery may have been a motive for that shooting. Touray was the uncle of the teen now accused of shooting his mother.\nCopyright 2015 WGCL-TV (Meredith Corporation). All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}