{"uri": "http://www.wptv.com/news/region-c-palm-beach-county/riviera-beach/3-year-old-boy-24-year-old-man-dead-in-riviera-beach-double-homicide", "title": "3-year-old-boy, 24-year-old man dead in Riviera Beach double homicide", "dct": "Mon, 15 Aug 2016 04:14:00 GMT", "id": "69eb10e35b848281699f558b34bdd225", "content": "Autoplay:Search continues for killer of 3-year-oldCONNECTING...XToddler, man killed in shooting\nRIVIERA BEACH, Fla. - Riviera Beach police continue to aggressively follow every lead in a double homicide that left a man and a child dead on Sunday night.\nMartavious Carn, 3, and his mother’s boyfriend, 24-year-old Amir Stepherson, were shot and killed Sunday night in Riviera Beach.\nThey were sitting in a vehicle in the parking lot at 4250 Leo Ln. when shots were fired by one or more people on foot.\nCarn’s mother, who was also in the vehicle, was not hurt in the shooting which happened about 9:42 p.m.\nCarn and Stepherson were pronounced dead at the scene.\nChief of Police Clarence Williams said the incident was out of retaliation, and not a random act of violence.\nA police spokesperson said there was an ongoing dispute over property between Stepherson and some other people.\n\"What are detectives doing right now to try to solve this case?,\" WPTV asked Rose Anne Brown, the spokeswoman for the Riviera Beach Police Department. \"Almost working around the clock following up on not just this county any leads,\" she explained.\n“We believe we’re heading in the right direction and additional information as it comes in is consistent with what we originally received,” police spokeswoman Roseanne Brown said.\nMonday afternoon police towed away two cars from an area near 45th Street and Military, which is a short distance from the shooting scene. Investigators say it is connected to their investigation.\n\"There were some individuals in that car that we wound up being able to question,\" explained Rose Anne.\nAndrea Sabater saw everything Sunday night.\n\"Hear the moms screams. They penetrated my soul. I can hear it, I can feel her pain.\"\nAndrea says she would see Martavious around the apartment complex.\n\"Bouncing, Happy, Joyful,\" says Sabater.\nPolice ask anyone with information to call Palm Beach County Crime Stoppers at 800-458-TIPS. You can remain anonymous.\nOfficers say a man and a woman were with that boy in a car when shots were fired from someone on foot. @WPTV pic.twitter.com/FKL6CcJaBt\n— Alex Hagan (@AlexHagan_WPTV) August 15, 2016\nCopyright 2016 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}