{"uri": "http://www.wyff4.com/news/firefighter-was-armed-during-takedown-of-shooting-suspect-sheriff-says/41938538", "title": "Firefighter was armed during takedown of shooting suspect, sheriff says", "dct": "Mon, 03 Oct 2016 20:05:00 GMT", "id": "1c0d81b285c6fb0337802c93e422b726", "content": "ANDERSON COUNTY, S.C. —\nA firefighter who had been reported to be unarmed when he took down a 14-year-old accused in a school shooting was actually carrying a handgun, the sheriff revealed Monday.\nJamie Brock, 30-year veteran volunteer firefighter, confronted Jesse Osborne, who is accused of killing his father and a first-grader and wounding a teacher and another 6-year-old on Wednesday.\nBrock was the first to reach Townville Elementary School Wednesday afternoon after Osborne opened fire on the playground, authorities said.\nFire Chief Billy McAdams said he and Brock were at his nearby farm when they heard the call about the shooting, and they raced to the school, getting there before deputies.\nThe Townville Volunteer Fire Department is just down the road from the school. Brock got to the elementary school moments before other officers could respond to a 911 call.\nBy the time Brock reached the playground, first-grade teacher Meghan Hollingsworth and Jacob Hall and another boy had been wounded.\nMcAdams said Brock took the shooter down, and he did not mention the gun.\nOfficials would not comment on whether Brock’s gun remained holstered or if it was used in the takedown.\nHollingsworth and the other first-grader were treated and released the day of the shooting.\nJacob suffered a severe brain injury caused by blood loss and died over the weekend.\nBrock has not spoken publicly about the shooting, but he released a statement saying: \"The true heroes of (the) senseless tragedy are the teachers that put their lives on the line to protect their students, the principal who through fears of her own did what’s right to ensure the safety of the school. They deserve to be called heroes, and to them I tip my hat.\""}