{"uri": "http://www.indystar.com/story/news/crime/2015/09/19/4-people-shot-northside/72498548/", "title": "Police ID child killed in Northside shooting", "dct": "Sat, 19 Sep 2015 00:00:00 GMT", "id": "aac937b3ff29311fd4f6c18700678055", "content": "Tony Cook / The Star\nA child is dead after a shooting that also injured three others Saturday night on the city's Northside.\nThe shooting took place around 8:35 p.m. at a home on the 3900 block of Graceland Avenue, where a memorial service for an elderly woman was underway, according to Officer Rafael Diaz, a spokesman for the Indianapolis Metropolitan Police Department.\nThe child who died was 10-year-old DeShaun Swanson. The other three victims, one of which also was a juvenile, sustained injuries to their limbs and are stable, Diaz said. He said three were transported to Riley Hospital for Children, including the victim who died, and the other was taken to Eskenazi Health. All of the victims were male, he said.\nPolice said Sunday that the three victims still in the hospital are expected to survive.\nAbout a dozen family and friends of the victims gathered at the scene Saturday night. IMPD chaplains and members of the Ten Point Coalition prayed with some of them as police interviewed witnesses and scoured the scene for evidence.\n\"This is unbelievable. My heart hurts so bad,\" said Elaine Ball, a family friend.\nWarner Berry Jr., a relative of two of the victims, said the family was already grieving the loss of his mother, Zelma Hutchins, who had died two days earlier.\n\"Now there's going to be more mourning,\" he said.\nBerry said the second juvenile victim, his great-nephew, was 16.\nDiaz said several shots from several calibers were fired outside the home. When police arrived at the house, the victims were inside the home, but police believe they were outside when the shooting occurred, he said.\n\"There's been several mentions of a vehicle that drove by and there's been some other conflicting information,\" he said. \"Those details are still being investigated.\"\nThe same home was the subject of an undercover investigation in February, Diaz said, but he couldn't say whether this shooting was connected. He said detectives do not think this was a random act.\n\"It's obviously a very sad situation,\" he said. \"There's no need for this type of violence to go on on our streets, especially when our kids are safely inside their home enjoying time with family.\"\nHe said no suspect information was available.\nHarrison of the Ten Point Coalition said the violence needs to stop.\n\"Something is going on in this neighborhood,\" he said. \"We've got to get a handle on what's going on in this neighborhood.\"\nCall Star reporter Tony Cook at (317) 444-6081. Follow him on Twitter: @indystartony.\nFamily members of victims say the shooting occurred at a gathering of people remembering their grandmother who died two days ago.\n— Tony Cook (@indystartony) September 20, 2015"}