{"uri": "http://wishtv.com/2015/09/19/4-shot-including-juvenile-on-near-north-side/", "title": "Police identify 10-year-old killed in memorial service shooting", "dct": "Sat, 19 Sep 2015 21:11:00 GMT", "id": "f368036f748b4abc5ef11a5df1a27eda", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nINDIANAPOLIS (WISH) — A 10-year-old boy was killed and three other people were wounded in a shooting Saturday evening on the near north side of the city, according to the Indianapolis Metropolitan Police Department.\nPolice have identified the juvenile killed in the shooting as 10-year-old De’Shaun Swanson.\nIt happened in the 3900 block of Graceland Avenue, near the intersection of 38th Street and Meridian Street.\nOfficers arrived to the scene around 8:30 p.m. and found two male adults and two male juveniles had been shot.\nFamily and friends were gathered for a memorial service when the shooting took place.\nThe memorial service was being held for the grandmother of the 10-year-old’s best friend, family members told 24-Hour News 8.\nAll four people were shot in the front yard of a home, police said.\nSwanson was transported to Riley Hospital for Children at IU Health in critical condition and later died, police said.\nA 16-year-old was shot and is in stable condition, police say. One adult was taken to Riley in stable condition. The second adult was transported to Sidney and Lois Eskenazi Hospital in stable condition.\nAccording to police, the others injured in the shooting are expected to survive.\nPolice have not released any suspect information, but they say the shooting does not appear to be random.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}