{"uri": "http://www.actionnewsjax.com/news/local/homicide-investigating-in-lakeshore/388351203", "title": "ActionNewsJax.com", "dct": "Wed, 06 Jul 2016 00:00:00 GMT", "id": "062f0419eea5da17df31062615cc6f68", "content": "JACKSONVILLE, Fla. - A 15-year-old was shot and killed early Wednesday morning in Lakeshore, police said.\nThe Jacksonville Sheriff's Office homicide team responded around 5 a.m. in the 2200 block of Vista Avenue, which is south of San Juan Avenue.\nJSO confirmed 15-year-old Johnnie Carter was shot and killed. He would have turned 16 this month.\nZach Linke told Action News Jax that he was with the victim hours ago before the shooting. He said he doesn't understand this.\n“We came back here and I dropped him off and my last words to him were, ‘See you later, homie,'\" Zach said.\nThere is no suspect information, and police are still interviewing witnesses.\nAnyone who has any information about the incident is asked to call Crime Stoppers at 866-845-TIPS. You can remain anonymous and receive a possible reward of up to $3,000.\nAction News Jax reporter Larry Spruill is at the scene. Refresh the page, watch CBS47 Action News Jax beginning at 5 p.m. and follow him on Twitter @LarryANjax for the latest developments.\nTrending on ActionNewsJax.com:\nFriends of 15-year-old Johnnie Carter say he was shot & killed not far from his home this morning. @ActionNewsJax pic.twitter.com/uiyJ04fhJ0\nFriends of 15-year-old Johnnie Carter say he was shot & killed not far from his home this morning. @ActionNewsJax pic.twitter.com/uiyJ04fhJ0\n— Russell Colburn (@RussellANjax) July 6, 2016\nZach Linke was w/ shooting victim just 6 hours ago. Said he walked into his home safely. Doesn't understand this. pic.twitter.com/r77Du9dMJA\n— Russell Colburn (@RussellANjax) July 6, 2016\nShooter(s) still on the run. If you have any information, pass it along to JSO. @ActionNewsJax\n— Russell Colburn (@RussellANjax) July 6, 2016\nJSO on shooting on @ActionNewsJax: Police are still working to identify the teenage victim right now & contact his family.\n— Romney Smith (@RomneyANjax) July 6, 2016\nJSO on shooting on @ActionNewsJax: Still trying to locate witnesses. Not able to release where on his body the teen was shot.\n— Romney Smith (@RomneyANjax) July 6, 2016\nJSO says teen shot and killed in Lakeshore neighborhood. Altercation took place and shooter left the scene.\n— Phil Amato (@PhilAmatoANjax) July 6, 2016\nJSO on shooting on @ActionNewsJax: Around 5 am @JSOPIO responded to a shooting and a white male was shot and killed. He was a juvenile.\n— Romney Smith (@RomneyANjax) July 6, 2016\nCrime scene van here. Much of this neighborhood roped off with crime scene tape. @ActionNewsJax pic.twitter.com/JPH7evpFUu\n— Russell Colburn (@RussellANjax) July 6, 2016\nJSO homicide responding in a residential area of Lakeshore, south of San Juan Ave. #ANjaxBREAKING @ActionNewsJax pic.twitter.com/98YhXYnnbp\n— Russell Colburn (@RussellANjax) July 6, 2016\n#ANjaxBREAKING: Homicide responding to an incident at 2200 Vista, per JSO. We're on the way & working to learn more. @ActionNewsJax\n— Russell Colburn (@RussellANjax) July 6, 2016"}