{"uri": "http://jacksonville.com/news/crime/2016-07-06/story/teen-identified-fatal-shooting-near-his-jacksonville-home", "title": "Teen identified in fatal shooting near his Jacksonville home", "dct": "Wed, 06 Jul 2016 06:58:00 GMT", "id": "902f38fdbbf675d9ae58864b72c0b598", "content": "A 15-year-old was shot and killed Wednesday near his home in Jacksonville’s Lakeshore neighborhood, the ninth teen homicide in the city this year.\nThe Sheriff’s Office identified the boy as Jonathan Matthew Carter who lived on Sunderland Road.\n“From what I understand some sort of altercation took place, there was a gunshot, gunfire, and one of the people left the scene,” said Sgt. Robert John.\nThe shooting occurred about 4:45 a.m. at Sunderland Road at Vista Avenue near Blanding Boulevard about the same time neighbors said they heard a woman screaming.\n“We’re still in the process of trying to find out what happened,” John said.\nHis mother, Erica Carter, expressed her grief on Facebook.\n“Today my world has been shattered,” her post reads. “My oldest son Johnnie Carter, was shot and killed this morning. I woke up to the cops telling me my son was dead. As much as I appreciate everyone’s concern, I am not capable right now of seeing or talking to anyone. Please give me time, and space.”\nFriends of Carter told Times-Union news partner First Coast News they were hanging out at a house and driving around.\nOne friend said Carter was dropped off at 4 a.m. A short time later officers found him shot to death in the road just a couple blocks from his home.\nCarter’s aunt, Sharon Quigley, said he snuck out of the house but his mom was home when he returned. Then he left again, Quigley told First Coast News.\n“She was asleep,” Quigley said. “The next thing she knew, the cops were knocking at the door and he was down there. That’s how she found out. She didn’t know he had left the house.”\nFifteen teens total were killed in 2015 in Jacksonville, according to the Times-Union’s death database at Jacksonville.com/homicides.\nThe city is unofficially at 61 homicides in 2016 compared to 56 at the same time last year.\nDana Treen: (904) 359-4091\nMore public safety coverage\nDatabase: Find sex offenders, predators near your neighborhood. | First Coast Fugitives"}