{"uri": "http://www.walb.com/story/28793012/buckeye-boy-7-wounded-in-accidental-shooting", "title": "Buckeye boy, 7, wounded in accidental shooting", "dct": "Tue, 14 Apr 2015 01:00:00 GMT", "id": "d0c1e95aada4bf56fac6be760b95cca4", "content": "BUCKEYE, AZ (3TV/CBS 5) - Buckeye police are investigating an accidental shooting involving a young boy.\nIt happened shortly before 5 p.m. in the Tartesso neighborhood in Buckeye, near 311th Avenue north of Thomas Road. Police said the 7-year-old was shot with a handgun.\"It is definitely very scary, very scary, that a little boy would get hold of a gun,\" says one neighbor, Taryn Moore. \"You know, it definitely should be more secure.\"\nThe boy was airlifted to Phoenix Children's Hospital, where he underwent surgery and was transferred to the ICU. He remained in critical condition on Tuesday.\nNeighbors said the boy was the only child that lives in the home. One neighbor said he baby-sits the boy some mornings.\n\"So, he's at our house quite a bit, so playing with our kids, goes to Scouts with my son on Tuesday night,\" Jesse Stone said. \"He's around a lot. He's a good kid.\"\nStone said the boy lives with his mother, and that his father comes over occasionally.\nBut Buckeye police weren't saying if anybody was home with the boy when the shooting happened, or where on his body the bullet hit.\nIt's also still unclear how the handgun ended up in the house.\n\"If there are guns in the home and children in the home, your guns should be up high enough to where the kids can't reach them and always locked,\" says Buckeye police Officer Tamela Skaggs.\nPolice are not saying who called 911, or if there was possibly another neighborhood child at the home at the time. One neighbor did say when all the police were at the home investigating, there were two bicycles in the front yard, and later, there was only one.\nFolks in the neighborhood say they are praying for his recovery. \"He is just a very nice little boy,\" says neighbor, Ginny. \"He plays with all the other kids on the street, rides his bike. He loves his bike and he's a good kid.\"\"Pretty tight-knit community out here,\" Stone said. \"So something like this to happen out here is pretty tragic.\""}