{"uri": "http://www.nola.com/crime/index.ssf/2013/12/arrest_made_in_old_towne_bar_s.html", "title": "Arrest made in Olde Towne bar shooting, Slidell police announce", "dct": "Sun, 29 Dec 2013 17:56:18 GMT", "id": "2350e811aa331f4482dc0d5d138f04d4", "content": "The Slidell Police Department on Saturday (Dec. 28) announced the arrest of 22-year-old Jamieon Chatman, who authorities say fired a .40-caliber gun into a crowd of 75 people gathered outside an Olde Towne bar, killing two and injuring six others. Police arrested Chatman without incident at a residence in Vermillion Parish early in the morning.\nPolice said they expect to make more arrests of those who aided Chatman after the shooting. The shooting happened at the Shooters Social Club overnight after Christmas.\nWitnesses said there were several fights inside the bar earlier in the night, and when the violence moved outside near the intersection of First and Cousin streets, someone opened fire into the crowd. Police responded around 1:30 a.m. Thursday and found Errol Scott, 22, dead. Mark Womack, 23, died later at a hospital. Six others also were struck.\nFour of the six wounded have been released from area hospitals, Slidell police Chief Randy Smith said. Two others are still undergoing treatment.\nSmith said the dead men were not the intended targets, despite previous reports to the contrary.\nChatman \"is cooperating with the police and feels remorse for what he's done,\" the chief told reporters.\nPolice were aided by tips that poured into Crimestoppers, which had offered an award of up $7,500 for Chatman's arrest.\nThe chief praised the fast work of investigators and tried to ease safety concerns of residents. \"Although we have experienced an increase in violent criminal activity, Slidell is still a very safe place,\" Smith said in a prepared statement. \"It always has been and always will be.\"\nChatman has a criminal history in St. Tammany Parish, with arrests dating back to at least 2010. He was arrested by Covington police in January along with a 15-year-old boy in connection with a shooting that wounded a motorist on North Filmore Street.\nAnd Chatman was due in court on Nov. 21 on charges stemming from a September shooting on West Edwards Street in Covington, but he did not show up. He was wanted for skipping that court date at the time of this week's fatal shootings.\nHe is being held on two counts of second-degree murder and six counts of attempted second-degree murder. He has not had his bond set. He'll appear before a court commissioner on Monday, a police spokesman said."}