{"uri": "http://ksnt.com/2015/07/08/topeka-police-identify-subjects-related-to-drive-by-shooting/", "title": "Topeka police locate 2 subjects concerning drive-by shooting", "dct": "Wed, 08 Jul 2015 08:26:00 GMT", "id": "1c73103fcad8de4d604e7f847c2c6dc0", "content": "TOPEKA (KSNT) — Topeka police have identified and interviewed the two subjects in this photo who they say might have information on a drive-by shooting that happened late Monday night.\nPolice tell KSNT News the two subjects were not involved, but had a similar vehicle description to one that was in the area at the time of the shooting.\nJust before midnight, Topeka Police officers were called to the intersection of SE Golf Park Boulevard and SE Fremont on a shooting involving a child. Police arrived to discover 5-year-old Lily Coats-Nichols with a life-threatening gunshot injuries. She was taken to Stormont-Vail Hospital.\nLily’s father, Bruce, told KSNT News on Tuesday the family hasn’t been able to see her yet. He explained that his daughter sustained a gunshot wound to the head while riding in her mother’s car Monday night. They were headed to his home on SE Fremont Street.\nBruce Nichols says health officials at Stormont-Vail have informed the family his daughter is now brain dead as a result of her injuries.\nPolice are looking for a vehicle that may be involved. The only description known at this time is that the vehicle is a white or silver, 4-door vehicle.\nPolice also say they are still seeking any information related to this incident.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}