{"uri": "http://ksnt.com/2015/07/08/friends-and-family-say-five-year-old-topeka-girls-memory-will-live-on/", "title": "Friends and family say 5-year-old Topeka girl’s memory will live on", "dct": "Wed, 08 Jul 2015 18:34:00 GMT", "id": "33efd5d574899711bfa4e0770dabfb0b", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nBREAKING (Thursday, 4:02 p.m.): Lily Coats-Nichols has been taken off of life support and donation of her organs is underway according to her great-aunt Deanna Coats:\nShe was taken off life support at noon, she will be in surgery for several hours. It was gut wrenching when they rolled her little body past us to go to surgery. That’s all I know for now.\nTOPEKA (KSNT) – Five-year-old Lily Coats-Nichols remains in the hospital on life support Wednesday, as family members deal with a painful decision.\nHer father, Bruce Nichols, tells KSNT News that the doctors say damage from the bullet has likely left her brain dead. It’s news that friends and loved ones are still trying to understand.\n“The little kid that could. I mean, she was littler than all my kids and she could do everything just as good and she just.. She’s a real good kid,” said Brian McCracken, who lives across the street from Lily’s mother.\n“Very fun to be with. You know she’s high spirit, independent,” said Leroy David McGee Jr., the next door neighbor.\nLily’s 5-year-old friends still don’t fully understand what’s happened.\n“She’s just sleeping,” said 5-year-old Yamilet Marin.\nJust a few days ago they were riding bikes, rolling down hills and petting kittens together.\nNow friends, family and neighbors are trying to cope with the news that the sweet little girl next door is unlikely to come home.\n“It hurts, it really does, because little girl was only 5 years old. She didn’t deserve that, she didn’t deserve that,” said McGee.\nLily’s father says doctors tell him she’s brain dead and bitterly described their medical options.\n“We’ll just cut the tube basically. Let’s pull it out and get rid of her organs, that’s what basically they made it sound like,” Bruce Nichols said Tuesday.\nAccording to the GoFundMe page created by Lily’s uncle, she will be “blessing many others with life from organs she’s donating.”\n“Anywhere you can give a life, even though one was taken is a great opportunity, even though something bad and tragic happened,” said McCracken.\nNot only that, neighbors say her memory will live on through the lilies she used to pick, and…\n“Where her spirit is concerned, I think it will live on through these little ones [kittens], because that’s what she was most connected to,” said McGee.\nLily’s aunt tells KSNT News all of Lily’s organs will be donated.\nFor the time being the family is just waiting on recipients and a transplant team to get everything coordinated, but that’s taking a while.\nShe says it’s been horribly hard on the family.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}