{"uri": "http://www.cleveland.com/akron/index.ssf/2016/12/man_wanted_in_akron_barbershop.html", "title": "Akron barbershop triple shooting suspect arrested", "dct": "Thu, 22 Dec 2016 15:57:00 GMT", "id": "d56d562b55ae5102bb5adc2bb263b646", "content": "AKRON, Ohio - A man wanted for shooting three people in an Akron barbershop following an argument has been arrested.\nRobert Lash Rodgers, 24, was charged Dec. 9 with three counts of felonious assault and one count of having weapons under disability in connection with a shooting that injured three people at the R.P.'s Blade Academy Barbershop.\nHe was arrested about 12:30 p.m. Thursday at an apartment on the 1300 block of Weathervane Lane in northwest Akron by the U.S. Marshals Northern Ohio Violent Fugitive Task Force, a news release from the task force says. Marshals received a tip that Rodgers was staying in the neighborhood, and he was spotted after hours of surveillance.\nThe barbershop shooting happened about 11 a.m. Dec. 1 after a customer came into the shop and got into an argument with Rodgers, who was getting a haircut. Rodgers pulled out a gun and fired several shots, police said.\nThe man arguing with Rodgers was seriously injured, police said. A 17-year-old boy was struck in the ankle by a stray bullet. A 49-year-old man was hit the shoulder. Both were treated for their injuries at Summa Akron City Hospital.\nRodgers is scheduled to appear for arraignment 8 a.m. Friday.\nThe Akron shooting was one of three high-profile Northeast Ohio barbershop shootings within the past two years. In November, one man was killed and another man was injured in a shooting at Skills Barbershop in Garfield Heights. No arrests have been made in that case.\nOn Tuesday, Cuyahoga County Common Pleas Judge Joan Synenberg denied a jury's death penalty recommendation for Douglas Shine, who was convicted in a February 2015 triple killing at a Warrensville Heights barbershop. Shine was instead sentenced to life in prison.\nA judge rejected the death penalty for Douglas Shine Jr., the 21-year-old Heartless Felon convicted in the 2015 barbershop massacre and death of a witness.\nIf you'd like to comment on this post, please visit the cleveland.com crime and courts comments section."}