{"uri": "http://ksnt.com/2016/11/10/officer-involved-shooting-investigation-underway-in-morris-county/", "title": "Officer-involved shooting investigation underway in Morris County", "dct": "Thu, 10 Nov 2016 11:46:00 GMT", "id": "b4644565756f9193502e69da968dc3fd", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCOUNCIL GROVE, Kan. (KSNT) – An officer-involved shooting Thursday morning caused an elementary school to temporarily go on lock down.\nAt 9:00 a.m. law enforcement received reports of shots being fired at a vehicle in Council Grove. After responding to the scene, additional 911 calls were received advising that the same subject was firing a weapon near the intersection of 7th and Main Street.\nEarly investigation by the Kansas Bureau of Investigation indicates when officers from the Council Grove Police Department and the Morris County Sheriff’s Office arrived, they located the armed subject and gave him verbal commands. The subject fired at the officers and a Council Grove police officer returned fire, striking the individual.\nThe 17-year-old male subject was first taken to a local area hospital, and then transported to a Topeka hospital. His injuries are believed to be non-life threatening.\nNo law enforcement officers were injured during the incident.\nThe KBI will complete a thorough and independent investigation into this matter. Once completed, the findings will be turned over to the Morris County Attorney for review.\nThis investigation is ongoing.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}