{"uri": "http://www.seattletimes.com/seattle-news/crime/mothers-boyfriend-charged-over-gun-that-toddler-used-to-shoot-himself/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_seattle-news", "title": "Mother’s boyfriend charged over gun that toddler used to shoot himself", "dct": "Tue, 12 Jul 2016 17:53:00 GMT", "id": "98ed7b701ec01e230a95733b78e288f0", "content": "The boyfriend of a woman whose 2-year-old son shot himself in the face at a Seattle motel was charged Tuesday with unlawful possession of a firearm in the second degree.\nAccording to charging documents filed in King County Superior Court, the toddler, his mother and her boyfriend, Francois Cunningham, 57, of Seattle, had checked into the Munson Motel on East Marginal Way on Friday.\nThe couple were still there and asleep about 9 a.m. Monday when, prosecutors say, the toddler found a loaded .40 caliber Glock handgun and shot himself in the face.\nThe child was taken to Harborview Medical Center, where police were called, court documents say.\nPlay VideoPlayMuteCurrent Time 0:00/Duration Time 0:00Loaded: 0%Progress: 0%Stream TypeLIVERemaining Time -0:00Playback Rate1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptionsAudio TrackFullscreen\nThis is a modal window.\nCaptions Settings Dialog Beginning of dialog window. Escape will cancel and close the window. Text Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps Defaults Done\nThe hospital did not release the boy’s condition, but police investigators said in the certification for determination of probable cause that the child is expected to survive.\nAccording to prosecutors, Cunningham is a “career criminal” with felony convictions for burglary and drugs who is banned from possessing firearms.\nThe boy’s mother, who denied knowing there was a gun in the hotel room, told police that Cunningham had been jealous because he believed she was trying to rekindle a relationship with her children’s father.\nCunningham is scheduled to be arraigned July 25."}