{"uri": "http://www.themonitor.com/news/local/state-rep-martinez-shot-in-head-by-stray-bullet-while/article_3835f250-d064-11e6-ba22-c33642edda65.html?utm_medium=social&utm_source=twitter&utm_campaign=user-share", "title": "UPDATE: State Rep. Martinez shot in head by 'stray bullet' while celebrating", "dct": "Sun, 01 Jan 2017 00:00:00 GMT", "id": "3905081ed25c0a1b531bedc48ef4ac6c", "content": "NORTH OF WESLACO — State Rep. Armando “Mando” Martinez confirmed Sunday evening that he’s now doing well after being shot in the head earlier that morning by what local law enforcement authorities are calling a stray bullet.\nMartinez said family and friends were celebrating the New Year at a residence located on the 5400 block of Sago, which is located just outside of Weslaco, when they began to hear gunfire.\nThey sought shelter inside a garage until just before midnight, when Martinez said he could no longer hear the shooting. The state representative for District 39 then ventured back outside with his wife and children to see the rest of the fireworks.\n“At the stroke of midnight, my wife comes over and gives me a hug and a kiss, and right after that I felt like a sledgehammer hitting the back of my head,” Martinez said in description of the pain suffered from a gunshot. “I grabbed it and she said, ‘What’s wrong?’ I said I was hit by something.”\nRemembering how a friend, a state trooper with the Texas Department of Public Safety, described the pain of being shot in the face as “a sledgehammer hitting you,” Martinez feared he had become the victim of a revelers’ bullet.\nThe representative’s fears were confirmed when a cousin who took a photo of Martinez’s head observed what appeared to be a bullet hole.\n“Before, the Valley wasn’t as populated as it is now, and growing up you used to hear gunshots many times,” Martinez said after crediting Weslaco firefighters and paramedics for their quick response in transporting him to a local hospital. “But you can’t do that now because somebody’s going to end up getting hurt. Unfortunately, last night it was me who got hurt. The fact that my family and friends were there and that they could’ve also gotten hurt pushes me to help put a stop to this. Right now, the important thing is that I’m alive … God blessed me.”\nMartinez underwent a 45-minute surgical procedure to remove the bullet, which was then collected by the Hidalgo County Sheriff’s Office for testing.\nSheriff Eddie Guerra has confirmed that his office launched a deadly conduct investigation into the shooting.\nJose P. Rodriguez, a spokesman for the sheriff’s office, also used the incident as an opportunity to once again discourage residents against firing weapons in the air.\n“We want to remind the public that celebratory gunfire is very dangerous and can cause property damage, and cause serious injury or death,” Rodriguez said.\nMonitor staff writer Lorenzo Zazueta-Castro contributed to this report."}