{"uri": "http://www.wrcbtv.com/story/32733790/child-shot-on-water-street", "title": "UPDATE: Shooting of 22-month-old baby boy is gang-related", "dct": "Thu, 11 Aug 2016 03:57:00 GMT", "id": "76b68fe6a7024efc92e3fbe54e24fc22", "content": "CHATTANOOGA, TN (WRCB) -\nUPDATE: Chattanooga Police Chief Fred Fletcher said Thursday morning that a 22-month-old baby was shot in a drive-by shooting Wednesday night, and that the shooting is gang-related.\nChief Fletcher on recent gang violence: \"We're not terribly good at solving shootings. But we'll put you in jail for other things.\" @WRCB\n— Kelly McCarthy (@KellyWRCB) August 11, 2016\nA group of one gang members, Fletcher said, were celebrating the release of one of their members from jail.\nGroup of known gang members were outside a house celebrating one's recent jail release when the drive-by happened, hitting the child. @WRCB\n— Kelly McCarthy (@KellyWRCB) August 11, 2016\nAnd that's when a red four-door sedan drove by, believed to be driven by someone or a group of people from another gang, and fired shots into the crowd.\nA bullet hit a 22 month-old baby in the leg. He is expected to survive.\nFletcher was visibly angry, saying “Listen to me. These cowards shot a baby.\"\nPlans for police to step up both patrols with marked vehicles as well and their continued undercover work.\n\"There are a number of people who know who shot this baby,\" Fletcher said, \"There were multiple people in the suspect car, there were multiple people on that porch and people talk about these things we watch them on social media, they brag about it.\"\nSurveillance video, social media posts and other tools will be used during this investigation, Fletcher said.\nHe said the fighting between the two gangs are over \"ridiculous\" reasons.\n\"All they want to do is shoot each other over ridiculous beefs about respect and girls and social media posts,\" Fletcher said.\nSeveral mothers who live in Alton Park said it sickens them to think it could of been one of their own. They're concerned for the safety of the families nearby.\n\"It's too close to home,\" said Tia Russell, \"I worry for her just sleeping in my living room because that's where the window is.\"\nJust a few doors down from Russell's home the evidence from the shooting is clear. Bullets from the drive-by shooting shattered windows, flattened car tires and left a hole in a child's toy car.\n\"I want to be able to go outside and my child don't get shot. I want to be able to have my baby ride her bike out here and don't get shot,\" said Lacretia Grayson.\nPolice believe this shooting is connected to other recent shootings. On Wednesday, four people were shot at two separate locations and, on Sunday, a person was killed on Water Street.\nThat's two shootings on the same street near these families in five days.\n\"It's ridiculous it really is,\" Grayson said, \"I've been ready to go, I've been ready.\"\nChannel 3 is told the little boy is expected to make a full recovery.\nAgain, police do not think children are being targeted in the community, but this is the second time a child under the age of 10 has been shot this year due to gang violence.\nPREVIOUS STORY: Chattanooga police say a child was shot on Water Street tonight.\nIt happened around 10:00pm in the 200 block.\nPolice say they were notified of the shooting after the child was taken to a local hospital in a personal vehicle with a wound to the leg.\nA witness told police they were standing outside when a vehicle rolled by and fired shots.\nThe child's injuries are non-life-threatening.\nThis is the second shooting on Water Street in less than a week. Sunday, 24-year-old Marquise Jackson was found with multiple wounds and later died from the shooting.\nREAD MORE | Chattanooga police investigating fatal shooting on Water Street\nIf you have any information about this shooting, you're asked to call Chattanooga police at 423-698-2525.\nStay with WRCBtv.com for updates to this story."}