{"uri": "http://newyork.cbslocal.com/2015/05/15/newark-mothers-day-shooting-arrest/", "title": "4 Arrested In Deadly Mother’s Day Shooting In Newark", "dct": "Fri, 15 May 2015 13:53:00 GMT", "id": "c6957043b0a9bfdf1063077a9e4693c9", "content": "NEWARK, N.J. (CBSNewYork) — Four people have been arrested in connection with the Mother’s Day shooting that claimed the life of a 15-year-old boy in Newark, officials announced Friday.\nThe shooting occurred during an annual event marking the opening of the motorcycle season, called “Blessing of the Bikes.” More than 2,000 people were in attendance when gunfire erupted at South 16th Street and 19th Avenue just before 8 p.m. last Sunday.\nHigh school football star Al-Shakeem Woodson was shot and killed.\nWoodson’s heartbroken mother told 1010 WINS’ Rebecca Granet.\nThree other people were wounded in the shooting.\nOfficials said Woodson was an innocent bystander caught in the crossfire between two groups involved in a longstanding dispute.\n“Two rival high school-aged groups had an ongoing dispute, which on Sunday they took to another level,” said Acting Essex County Prosecutor Carolyn A. Murray, who called the shooting tragic and senseless.\nJaqeuce Spinks, 19, and a 16-year-old boy have been charged with murder and weapons offenses. Marquise Cephus, 18, and a 17-year-old boy are charged with gun possession.\n“Gun violence has taken the life of a young man destined for better,” said Police Director Eugene Venable. “This is the beginning of justice for the victims as their families continue on a long and arduous road through the healing process.”\nMayor Ras Baraka said there was no link between the shooting and event, but he admits the city and organizers have to do a better job of planning such a large event.\n“I think the community, rightfully so, was outraged,” Baraka said, WCBS 880’s Levon Putney reported.\n“The reality is the police were there on the scene,” the mayor added."}