{"uri": "http://www.mcall.com/news/breaking/", "title": "In marijuana competition, a tension between clinical, alternative medicine", "dct": "NODATE", "id": "71387df6ad7216d566f0deca703a9f70", "content": "Tim Charles describes himself as a serial entrepreneur. The Allentown native has dabbled in energy efficiency, international trade, manufacturing and real estate. Now, Charles, CEO of PA Cannabis LLC, hopes to bring medical marijuana to Main Street via a dispensary that offers patients a holistic...\nPa. attendees rally for policy changes at March for Life East Allentown stabbing death Students Celebrate Chinese New Year Who is Thomas Hardiman? Grocery store tomatoes taste like cardboard — Florida... President Trump's proposals for student debt Chinese New Year begins tomorrow Butch Trucks' final interview: talking about his... Police: No charges against restaurant owner in racial slur... Chicago Bulls drama explained Three U.S. media blackouts We Tried It: Avocado burger bun WATCH: Mayor Ed Pawlowski delivers annual Allentown State of... Lehigh Valley Economic Outlook Presented by the Greater... How voter fraud once tipped an election — and why that... Driver Hit By Dumbbell On NJ Turnpike Dies Ivanka Trump to exit Trump Organization and her fashion... What is the Cassidy-Collins replacement plan? Danick Martel record hat trick in Phantoms 7-2 win White House aide promises website will restore Spanish... Federal agents raid Los Angeles charter school network Water Street bridge WATCH: Lehigh Valley's first Jersey Mike's Subs... VIDEO: Twenty One Pilots play Allentown's PPL Center Dow hits 20,000 for the first time PICTURES: Allentown Central Catholic Defeats Bethlehem... NIGHTCRAWLER: Pearly Baker's in Easton March for Life Chinese New Year around the world PICTURES: Bethlehem Catholic vs. Wyoming Seminary... MUGSHOTS: Lehigh Valley suspects PICTURES: Lehigh Valley restaurants for Valentine's Day Pictures: 65th Miss Universe pageant Notable deaths in 2017 Pictures: Can you believe these things happened 25 years... PICTURES: Historic Lehigh Valley amusement parks:... John Hurt: Career in pictures PICTURES: Easton Learning Center Students Celebrate... PICTURES: \"Disney on Ice Presents Dream Big\"... PICTURES: Police investigate stabbing death in East... PICTURES: Warm enough for a round of golf PICTURES: Closer look at Eagles defensive line confirms... PICTURES: Bucknell at Lafayette men’s basketball PICTURES: Legendary Business Leaders of the Lehigh Valley PICTURES: Shiffert’s 10 Memorable Games PICTURES: 'The Explorer’s Club' has premiere at PA... PICTURES: Eagles looking for upgrades at WR and TE PICTURES: Allen defeats Liberty 68-64 in Boys High School... PICTURES: Fighting repeal of the Affordable Care Act PICTURES: East Maple Street Fire in Allentown"}