{"uri": "http://www.capitalgazette.com/news/for_the_record/ph-ac-cn-brandon-stallings-0628-20160628-story.html", "title": "Man charged with shooting 9-year-old in head with BB gun in Edgewater", "dct": "Tue, 28 Jun 2016 19:08:00 GMT", "id": "22b1d3370f010a9a90de31594ecb2867", "content": "Brandon Lee Stallings, 18, of Prince Frederick, faces charges of attempted second-degree murder, first-degree assault, second-degree assault and reckless endangerment, according to police charging documents.\n(Anne Arundel County Police photo)\nA judge ordered on Tuesday that bail remain at $175,000 for a Calvert County man charged with attempted murder after a 9-year-old boy was shot in the head with a BB gun at his grandparents' home in Edgewater.\nBrandon Lee Stallings, 18, of Prince Frederick, faces charges of attempted second-degree murder, first-degree assault, second-degree assault and reckless endangerment stemming from the April 5 incident at an Edgewater home, according to police charging documents.\nThe day after the boy was shot, officers were called to Baltimore Washington Medical Center in Glen Burnie for a report of an assault.\nThe 9-year-old had been taken to the emergency room by his father. A scan of his head found a projectile that looked like a BB had punctured his skull and was lodged in his brain, charging documents state.\nHe was taken to the Johns Hopkins Hospital in Baltimore for further treatment.\nWitnesses told police that Stallings was in a bedroom of the Edgewater home with the 9-year-old and two other boys while adults were in the living room watching TV, police said in charging documents.\nOne of the boys told police Stallings pumped the air-powered BB rifle five times after he repeatedly told him to put the gun down, police said.\nHe told police he \"heard a noise then looked over and saw blood.\"\nAt around 9:30 p.m., one of the boys told adults in the home that Stalling had shot the boy in the head with the BB gun, police said.\nThey checked on the boy, who was bleeding from his right temple, but otherwise appeared to be OK, the documents say.\nMugshots and arrest information released by area law enforcement departments of people charged with various crimes in recent months. Charging information provided by police departments at time of booking.\nNo one initially thought the BB had penetrated the boy's skull.\n\"We didn't know it was that serious until the next day,\" said the boy's mother, Jonitra Parker, of Edgewater.\nPolice said Stallings told them in an interview that he was in the bedroom when he picked the gun up from the floor and began playing with it.\nStallings also told police, \"his finger was on the trigger of the BB gun and (he) swung the gun in (the boy's) direction when it fired and struck (him) in the head,\" according to charging documents.\nHe told police the muzzle was about 2 feet from the boy's head when the gun fired, police said.\nNo one in the home had seen anyone take the BB gun into the bedroom, police said. They said it was not usually kept there.\nThe BB was not removed from the boy's head because surgery posed a greater risk than leaving it in his brain, police said.\nParker said her son has not returned to school since the incident and can no longer play sports.\n\"It's been a long process, but he's getting a little better,\" she said.\nHe has since been discharged from the hospital.\nParker said Stallings had been living at her parent's home for a couple of years.\nShe initially had mixed feelings about charges being brought against Stallings, she said, because of the family relationship.\nParker said that after speaking with others who were there, she doesn't believe it was an accident.\n\"He has not apologized for what happened,\" she said.\nOnline court records indicate Stallings does not have a prior criminal record.\nStallings' attorney, Robert Harvey Jr., declined to comment after Tuesday's bail review hearing.\nA preliminary hearing is scheduled for July 20, online court records show."}