{"uri": "http://www.wnem.com/story/29747253/mother-son-dead-after-fatal-shooting", "title": "Family, community mourning 1-year-old, caregiver after fatal shooting", "dct": "Mon, 10 Aug 2015 09:32:00 GMT", "id": "99084f6eaf9af61597e545f3125117ff", "content": "FLINT, MI (WNEM) -\nA family is mourning the tragic loss of a young child, after a fatal shooting early Monday morning.\nGeneral Jasper Tyler is mourning the loss of his 1-year-old son.\n\"Was just with him yesterday morning, playing and happy, he was walking by 9 months, he was just so exciting,\" Tyler said.\nGenesis General Tyler and Rita Langworthy were shot dead around 2:30 a.m. in Flint.\nPolice said they believe someone was standing or driving outside and then opened fire at Langworthy’s home. Langworthy, 71, was babysitting Genesis and his seven siblings when the shooting took place.\n“She said she was bored and wanted to see the children,” Tyler said. “That’s her life.”\nLangworthy was a retired principal and active in the community.\n“Just a very polite lady,” said Pastor Joe Schafer. “Well with the kids and everything, she’s an angel, okay.”\nSchafer is a pastor at a local church. He said the sudden loss of his friend is devastating.\n“She’s going to be missed,” Schafer said.\nTyler said Langworthy had been a victim of crime before.\n\"She got robbed last week. And the police didn't do anything with the robbery,\" Tyler said.\nThe authorities are continuing to investigate this morning's incident. While they search for clues, Tyler said his family needs answers and demand to know what led to the brutal death of his young son and the woman he calls his mother.\n\"I mean they really did some damage to this family. This is a scar that I can't even explain. And I’m just trying to stay strong for the family. Because, I don't know, I have no problems in the community, no enemies, I don't know why, I just want to know why really!\" Tyler said.\nPolice have not shared any leads to who may be responsible.\nCopyright 2015 WNEM (Meredith Corporation). All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}