{"uri": "http://www.mlive.com/news/flint/index.ssf/2016/08/daughter_continues_life_missio.html#incart_river_home", "title": "Slayings of infant and caregiver remain unsolved one year later", "dct": "Wed, 10 Aug 2016 14:40:00 GMT", "id": "d909f995f0d9681da6c979dcf03b9d43", "content": "FLINT, MI - Rita Langworthy was watching over eight children the night of Aug. 10, 2015.\nAlthough the children were not related to her by blood, Langworthy considered it her life's work to elevate the children to a better life than they were born into.\nLangworthy's personal mission ended one year ago today when she was shot to death when someone stuck a gun inside a bedroom window and fired into the house while she slept at 201 W. Home Ave.\nOne-year-old Genesis General Tyler also was killed in the shooting.\nThe other children were not injured when an unknown gunmen walked up and fired into the home more than 30 times, family members said.\nThe shooting remains unsolved.\nBut the violent end of Langworthy's life was not the end of her life - it was the beginning of her legacy, her family said.\n\"Where there is despair, let me bring hope\"\nLangworthy was considered a grandmother to Genesis and the seven other children in the home who ranged in age up to 12 years old.\nWhen she retired as principal of Bunche Elementary in 2003, her idea of retirement meant taking an Alaskan cruise and owning a purple Jaguar. Not living in a north Flint home with nearly a dozen people and three dogs.\nLangworthy wrote in a stewardship story titled \"God's Unique Gifts\" in 2011: \"I am not a Mother Theresa. This is His story and these are His children. I am but a servant who has been given a 'talent' -- a unique gift -- for which I am responsible. When my Master comes for an accounting, I want to present college graduates, ministers, missionaries, loving mothers and fathers; grown-up, Christian, children of God ... proof that through the mighty power of God, generational curses can be broken.\"\nBut that mission at times, was too much for her daughter Lin Randolph.\nRandolph, who lives in New York, would talk to Langworthy often about Langworthy's living conditions.\nOftentimes the violence and environment would be too much, Randolph said.\nLangworthy met General Jasper Tyler Jr. while working for Flint schools. She formed a bond with Tyler and his children by the time she retired as a principal from Bunche. The Tylers moved into her Flint home, according to Randolph.\nIn her story, she wrote: \"As I retired after 40+ years in elementary education, I had a few plans, but none of them involved becoming granny/nanny. But here I am -- part of a household with three adults -- a granny/nanny (me), a father and a young mother. Three adults from three different generations, three different races, three different cultures; there are always at least six children ... usually seven or eight, and even more on the weekends; top it off with a poodle, a chihuahua and a bull mastiff and we have a very busy, interesting household. It happened so gradually, I never saw it coming.\"\nGeneral Jasper Tyler Jr., father to Genesis and other children in the home, said he considered Langworthy his mother, although they weren't related by blood. The two knew each other for 30 years and he said Langworthy had been living in the Home Avenue house for about three months.\n\"That was the only person like a mother that I had,\" General Jasper Tyler Jr. said. \"It's hard to cope with. It's really sad. We miss her a lot. She was just a very good person. She loved that baby so much.\"\n\"Where there is darkness, let me bring light\"\nRandolph said it feels like she falls into a black hole when she thinks of Langworthy's killing.\n\"It's affecting me a whole lot harder than I thought it would be,\" Randolph said.\nWhat pulls Randolph out of mourning is working on the Rita Langworthy Foundation.\nThe goal of the foundation is simple - to see Langworthy's spirit continue on by providing opportunities to children born into situations they have no control over.\n\"That is the bright, shining beacon in this whole ugly mess,\" Randolph said. \"I was going to refuse to let her life end with such ugliness and violence and pain. She wouldn't want anyone to focus on those last moments of fear, terror, pain and anguish.\n\"Her life mission wasn't finished by any means. I decided that I needed to continue that in whatever way I could. She reached out and touched everyone she could.\"\nYou can learn more about the Rita Langworthy Foundation at its website here.\nAnd in less than a year, the foundation was able to raise enough money to reach a goal it hadn't planned on achieving until its third year.\nSix children who were under Langworthy's care at the time of her death will get scholarships to remain in the private school they attend. It was the same tuition bill that Langworthy herself paid prior to her death.\n\"I look at these pictures of her on the wall and I know this is exactly what she would want,\" Randolph said of her mother. \"She would be so proud and so happy that the children are given this opportunity. She would be so proud that I was able to step aside and not let my personal feelings get in the way.\"\n\"Where there is sadness, let me bring joy\"\nPolice would update Randolph often in the days and weeks following her mother's death.\nBut Randolph said she hasn't heard from Flint police in nearly a year.\n\"We have to be the voices of the victims,\" Randolph said. \"We have to continue to keep their stories at the top of the page because they quickly drop to the bottom. It will always be the top priority to me.\"\nPolice Chief Tim Johnson told The Flint Journal on Tuesday, Aug. 9 that he did not have any new information to release about the double-homicide.\n\"The effort has stopped. It stopped a long time ago,\" Randolph said. \"It's just that much more soul-crushing. No one cared about a 70-year-old woman killed in the projects taking care of [someone else's] children.\"\nGeneral Jasper Tyler Jr. said the past year has been hard on his family, including the other children who were in the home at the time of the shooting.\n\"We haven't heard anything,\" he said. \"It's really rough on us right now. When you have a loss like this, you just don't know what to do.\n\"I think the story needs to be put out there. Anybody know anything or heard anything they can call police.\""}