{"uri": "http://abc13.com/news/multiple-people-hurt-in-shooting-at-raising-canes-in-the-woodlands/1621556/", "title": "Off-duty deputy kills robbery suspect at Raising Cane's in The Woodlands", "dct": "Wed, 23 Nov 2016 00:00:00 GMT", "id": "9d47dc2f192102d634447dd69ed18001", "content": "THE WOODLANDS, TX (KTRK) --\nPlenty of questions remain after the shooting of a robbery suspect at a Raising Cane's in Montgomery County.\nShooting at Raising Cane's on Research Forest Drive in The Woodlands. 3 ppl shot pic.twitter.com/EAjbhne8Am\n— Tracy Clemons (@TracyABC13) November 23, 2016\nThe restaurant recently hired an off duty sheriff's deputy because of a string of robberies at different locations.\nThe suspect was shot and killed inside the store, we are still waiting to learn his name and if he is considered a suspect in those other robberies of area Raising Cane stores, meanwhile this store is closed for now and people here are shocked that this happened.\nORIGINAL REPORT: Robbery suspect shot, killed in The Woodlands restaurant\nThe employee's mother, Tamela Lambert, said, \"My heart dropped. I absolutely started loosing my mind. I didn't know if it was my son that got hurt or not.\"\nLambert never thought her son would be in danger working at this Raising Cane's in Shenandoah. She says it's not the kind of area that sees violent crime and when she heard a robbery suspect had been killed inside the restaurant she was afraid for her son.\nPHOTOS: Officer-involved shooting at Raising Cane's\nLambert said, \"I was almost in tears, very upset.\"\nAnd with good reason. Sheriff's seputies say other Raising Cane's locations have been robbed over the last few weeks and that's why this location hired an off duty Montgomery County Sheriff's deputy.\nDetectives say when the suspect came in Tuesday night he had a gun and grabbed an employee. That's when the off-duty deputy confronted the suspect. All of it happened in front of customers and employees.\nEmployee Bralin Henderson said, \"Officer Skip, that's the guy who saved the day. He came in and he pretty much you know he pretty much had the gun out, like, you know 'drop the weapon' because he had his hand on a gun and he was like, 'no, I'm not going to hurt her' that was his exact words and he said, \"I said drop the weapon.\" And he still wouldn't listen and he fired five times into his chest at point blank range.\"\nThere were several customers inside the restaurant as this happened, one father telling me his daughter is still shaken up by all this.\nMontgomery County detectives are still trying to figure out if the suspect was alone, or if he had someone in car waiting outside, they say no vehicles were found so they are not sure if there were other suspects or not."}