{"uri": "http://www.al.com/news/birmingham/index.ssf/2016/09/4-year-old_child_shot_killed_w.html#incart_river_index", "title": "4-year-old boy shot, killed during Ensley crossfire when adults argue over cell phone", "dct": "Mon, 03 Oct 2016 13:49:06 GMT", "id": "e3fb4aa5ef3842d86431ac10ea8f3a9a", "content": "A 4-year-old was shot and killed today in Ensley.\nBirmingham police received a call of shots fired in the 3100 block of Avenue Q around 2:30 p.m. When officers arrived at the scene, they found the child had been shot outside his home.\nThe 4-year-old, whose name has not been released, was rushed to the Children's Hospital. He died soon after arrival.\nSgt. Bryan Shelton said the preliminary investigation revealed the suspect went to the home of the victim and confronted multiple adults there about a cell phone that both adults' children were arguing over.\n\"Birthdays, graduations, first this or that, none will be seen by this mother or the family. Precious moments lost over a cellphone.\"\nBoth people began shooting, and the toddler was struck during the crossfire.\nThe suspect then fled the scene.\n\"It really tugs at your heart that someone under the age of five is a victim of this kind of violence,\" he said.\nShelton said the incident was \"senseless\" and showed a disregard for life.\nHerman Henderson, president of Stop of the Violence Birmingham, said that the people responsible for the child's death are \"thugs.\"\n\"When you can't sit on your porch- that's sad.\"\nPolice initially said the child was critically injured. When they received news the young boy had died, Henderson became visibly distraught.\n\"They're talking about how black lives matter, this young baby's life matters.\"\nShelton said that the incident was tragic, because this family was enjoying their Sunday before the toddler, an innocent bystander, was shot.\n\"How many life moments in this child's life were lost tonight? You can't count the number. Birthdays, graduations, first this or that, none will be seen by this mother or the family. Precious moments lost over a cellphone. You can't make sense of that.\"\n\"It's the fifth birthday, the sixth birthday that they won't see,\" he said.\nNo suspects are in custody at this time and police did not give any physical descriptions of suspects.\nIf you have any information about the shooting, call the Birmingham police Homicide Unit at 205-254-1764 or CrimeStoppers at 205-254-7777."}