{"uri": "http://www.wrdw.com/content/news/Aiken-teen-in-hospital-following-accidental--410885365.html", "title": "UPDATE | Teen accused of accidentally shooting another teen is out of jail on bond", "dct": "Tue, 17 Jan 2017 00:00:00 GMT", "id": "8c319de0c41853afc1c7b6af38a13166", "content": "AIKEN, S.C. (WRDW/WAGT) -- 18 year old John Sitler is wearing a blue jumpsuit this afternoon standing in front a judge on two separate gun charges.\n\"He was just playing with the gun,\" said Aiken Dept. of Safety Capt. David Turno.\nSitler told investigators it was a camouflage 12 gauge Benelli and says he was \"trying to clear the shotgun when it accidentally went off,\" striking 16 year old Rebekah Weeks in the knee.\n\"She went into surgery yesterday in Augusta. It's not life threatening, but certainly a gun shot wound to the leg is going to be devastating to a young person,\" said Capt. Turno.\nDevastating to her and neighbors who heard the gunshot ring out.\n\"All I know is three police cars come up here and I didn't know what happened,\" said Rhonda Hoffmier. \"They came ringing the door bell and asked if they could look for evidence in our back yard,\" said Hoffmier.\nThe responding officer wrote he \"smelled the odor of marijuana coming from inside the garage\" when he got to the house where the shooting happened.\nThe incident report says Sitler told officers the last time he smoked marijuana was at 10 a.m. the day of the shooting.\nThe report says the shooting happened around 10:20 a.m.\nThey say a group of people ages 16 to 20 were hanging out at the house when the teen girl was shot.\nSome of the teens took off before officers arrived.\n\"They were not forth coming yesterday about this. They didn't cooperate some had left. they did come back. The shot gun being stolen. They weren't really truthful with us about that,\" said Turno.\nOfficers say their lies could mean more charges.\nAiken County Sheriffs Office is investigating the stolen shotgun.\nThe incident report says one of the people there stole it from a man because he owed him money.\nSitler is out on bond with no conditions. His next appearance in court is set for march 3rd at 9 a-m.\nTuesday, Jan. 17, 2017\n4 p.m.\nAIKEN, S.C. (WRDW/WAGT) -- Bond has been set for a man accused in an accidental shooting of a teenage girl.\nA judge set bond at $12,125 for John Sitler, 18, on charges including possession of stolen goods and for discharging a firearm into a dwelling.\nSitler has been released from jail. His first official court appearance is scheduled for March 3 at 9 a.m.\nCaptain David Turno with Aiken Public Safety confirms the shooting happened today on Robinwood Drive in Aiken. A group of friends was playing around with a stolen gun when officers said it was discharged and hit Rebekah Weeks.\nAccording to an incident report, the deputy who responded to the shooting said the garage the friends were in smelled of marijuana. Sitler told the deputy he was trying to clear the shotgun when it accidentally went off and hit Weeks in the knee.\nSitler told deputies the gun was stolen from a man that owed him some money. According to the incident report, Sitler appeared to be under the influence and he told deputies he smoked at 10 a.m. The shooting happened at 10:20 a.m. on Monday.\nWeeks is recovering at Augusta University.\n10:08 a.m.\nAn 18-year-old arrested in the accidental shooting of a teenage girl with a stolen gun will have a bond hearing Tuesday.\n18-year-old John Sitler is charged with possession of stolen goods valued at less than $2,000 and for discharging a firearm into a dwelling.\nHis first official court appearance is scheduled for March 3 at 9 a.m.\nRebekah Weeks is being treated at Augusta University, but her injuries do not appear to be life threatening.\nMonday, Jan. 16, 2017\nAIKEN, S.C. (WRDW/WAGT) -- A teenage girl is in the hospital tonight being treated for a gunshot wound after being accidentally shot.\nCaptain David Turno with Aiken Public Safety confirms the shooting happened today on Robinwood Drive in Aiken.\nRebekah Weeks is being treated at Augusta University, but her injuries do not appear to be life threatening.\nA group of friends was playing around with a stolen gun when officers say it was discharged.\n18-year-old John Sitler is behind bars in connection with the shooting. Charges will follow pending further investigation.\nCapt. Turno says others may face charges, too."}