{"uri": "http://www.wbtv.com/story/33639161/young-boy-among-three-hurt-in-gastonia-shooting-suspect-in-custody", "title": "Young boy among three hurt in Gastonia shooting, suspect in custody", "dct": "Sun, 06 Nov 2016 04:21:00 GMT", "id": "09dcf77249295ebe594e9b993580f9e9", "content": "CHARLOTTE, NC (WBTV) -\nThree people were hurt in a shooting in the parking lot of a Gastonia apartment complex Saturday afternoon. Police said a young boy was among the victims that were taken to the hospital.\nThe shooting happened at approximately 2:14 p.m. Gastonia police believe Pontus Adams shot three people at Quail Woods Apartments then got in a black Dodge Charger, crashed and was arrested.\nTwo of the victims, including the child, were taken to the hospital with serious injuries, according to officers on scene. The third victim was treated on scene and was released.\nNeighbors said a maintenance worker with the apartment complex was one of the victims. According to the arrest warrant for Adams, his name is Juan Gonzalez.\n\"He can't even do his own job, feeling safe, working his job,\" said Lindsay Jackson.\nAnother neighbor said they saw the shooter walk past them with a rifle.\n\"I opened up my door, and I seen the shooter walking by with a rifle. He looked right at me,\" said Allan Springs.\nSprings tells WBTV Adams shot two different guns. He says he also saw him fire a handgun.\nChristopher Stonger lives next to Springs, and was about to eat lunch when one bullet went through his wall.\n\"I hear a really loud bang. I feel the particulates of the wall hit my face,\" Stonger said.\nAdams is being charged with three counts of attempted murder.\nRight now, neighbors say they're just hoping Gonzalez and the boy who was shot recover.\n\"I hope they make a full recovery. This is just senseless,\" Springs said.\nThis wasn't the first time that there were shots fired at Quail Woods Apartments. One person was seriously injured in a shooting back in June.\nRELATED: Former EMT jumps into action after person shot at apartment complex in Gastonia\nCopyright 2016 WBTV. All rights reserved."}