{"uri": "http://www.wesh.com/news/man-charged-in-girls-accidental-shooting-death-bonds-out-of-jail/38331430", "title": "Man charged in girl's accidental shooting death bonds out of jail", "dct": "Fri, 04 Mar 2016 05:13:00 GMT", "id": "748b06ced5c7ca2ff5dd314a44720403", "content": "SANFORD, Fla. —\nA local man was arrested this week following the accidental shooting death of a little girl.\nWESH 2 News was there when Erik Dominick Williams, 35, walked out of jail Thursday.\nPolice said he left a loaded gun under a sofa where the 6-year-old found it. Police said Williams was babysitting the child and wasn't supposed to have a gun. The little girl found it and accidentally shot herself.\n>>Download the WESH 2 News app for iOS and Android\nWilliams walked out of the Seminole County Jail surrounded by his family members. WESH 2 News asked him about the child neglect charges he faces and whether he had anything to say to the 6-year-old's family.\n\"God bless America,\" said Williams' mother, Rosalind Williams.\n\"Talk to my lawyer, got to talk to my lawyer,\" Williams said.\nWESH 2 News asked why the gun was stored under a sofa.\n\"You've got to talk to my lawyer,\" Williams said.\n\"No comment, no comment,\" Rosalind Williams said.\nPolice said the 6-year-old found the gun under a sofa Tuesday night at a home on Highlawn Avenue in Sanford. She would later die of her injuries.\n\"The patient is in the trauma bay right now. I really don't know. They really didn't give me any details. They just carried the kid in,\" a caller told a 911 dispatcher.\nIn newly released 911 calls, a medical staff member can be heard talking with authorities when the child was taken to the emergency room after shooting herself in the shoulder.\n\"It's not his gun, he [doesn't] carry a gun. He's not a violent person,\" Rosalind Williams said.\nEarlier Thursday, the suspect's mother told WESH 2 News that Williams' intentions were good. She also confirmed that the 6-year-old victim was Williams' fiancee's niece.\nWESH 2 News asked Williams if he felt bad about what happened.\n\"Yeah, I feel bad,\" he said.\nWilliams is charged with child neglect, unsafe storage of a firearm and possession of a weapon by a felon. His next court appearance is April 5."}