{"uri": "http://www.nbcwashington.com/news/local/Police-to-Give-Update-on-Shooting-Death-of-16-Year-Old-Girl-in-SE-403585126.html", "title": "Sources: Person of Interest in Fatal Shooting of Teen Girl Turns Himself In", "dct": "Tue, 29 Nov 2016 00:00:00 GMT", "id": "6a5089a3dbeb250cf677d45b0aa9cb19", "content": "The man who police said fired into the housing complex courtyard where a 16-year-old girl was shot and killed the day after Thanksgiving has turned himself in to police, a source close to the investigation told News4.\nSaeve Evans, 30, was taken in to custody Tuesday evening, the source said.\nBreyona McMillian, 16, died after she was shot multiple times Friday morning on the 1200 block of I Street SE, near her mother's home in the Potomac Gardens housing complex.\nEvans was caught on surveillance video firing a gun multiple times near the time McMillian was shot, Interim Police Chief Peter Newsham said at a news conference Tuesday morning.\n\"It was almost noon on a relatively nice day. There were a number of people out there, and Saeve Evans discharged a firearm under those circumstances, which in my opinion was absolutely reckless,\" Newsham said.\nIt was not clear whether Evans is believed to have fired the shot that killed McMillian.\nPolice said Tuesday morning that they issued a warrant for Evans' arrest for unlawful possession of a firearm. Newsham asked him to come forward.\nWanted: Unlawful Possession of a Firearm, 1200 block I St SE. Have info? Call (202) 727-9099/Text 50411 pic.twitter.com/LfsL0BSVIN\n\"If he is listening and has any conscience, we ask that he turn himself in,\" he said.\nMcMillian grew up in D.C. and was home from out of town for Thanksgiving. She had been attending a boarding school in Iowa.\n\"Everybody loved her,\" McMillian's cousin Quashawn Wheeler said Friday about the teen known to loved ones as \"Bre.\"\nEvans was arrested in August 2014 after police said he and another man were believed to have shot and injured three men and three women in an alley near Nationals Park.\nHe was found living in an upscale neighborhood in Fort Washington, Maryland, with a group of squatters, police said.\nEvans was charged in May 2015 in that shooting but the case was dismissed.\nCourt documents show that one witness was a paid confidential informant. Two additional witnesses refused to cooperate and a fourth person said they did not know what happened.\nThe U.S. Attorney's Office declined to comment.\nSources told News4 that Evans had been a victim of gun violence himself. In one incident, he reportedly was shot more than six times. He survived, recovered and returned to the streets, News4's Pat Collins reported.\nAnyone who knew Evans' whereabouts was asked to call police immediately at 202-727-9099 or by sending a text message anonymously to 50411."}