{"uri": "http://www.nbcwashington.com/news/local/Woman-Shot-in-SE-DC--403025866.html", "title": "'Everybody Loved Her': 16-Year-Old Girl Killed in Southeast DC Shooting", "dct": "Fri, 25 Nov 2016 00:00:00 GMT", "id": "aa573a0815ac573e3f4deca6e003ee7f", "content": "A teenage girl home from out of town for Thanksgiving was killed Friday after she was shot in Southeast D.C.\nBreyona McMillian, 16, died after she was shot multiple times about 11:40 a.m. on the 1200 block of I Street SE, near the Potomac Gardens housing complex, D.C. police said.\nShe was taken to a hospital, where she was pronounced dead.\nMcMillian grew up in D.C. but moved to Iowa in February to attend boarding school. She was home this week for the first time since she left, her aunt said.\n\"Everybody loved her,\" McMillian's cousin Quashawn Wheeler said about the teen known to loved ones as \"Bre.\"\n\"She was young, pretty, educated, liked to go to school,\" Wheeler said.\nYoung people at the shooting scene Friday afternoon cried and screamed.\nD.C. Mayor Muriel Bowser said in a tweet that she was \"sickened\" by the violence.\nI'm sickened by today's violence in Potomac Gardens and the loss of a young life. MPD is investigating, please help, call 911 asap w/info.\nPeople who heard the gunfire Friday morning said there were as many as a dozen shots.\nPolice initially said the victim was an adult. Neither a suspect nor a motive were identified immediately.\nWheeler said she believes her cousin was not the intended victim of the gunfire.\nAimee Grace soon will represent the area on an advisory neighborhood commission (ANC).\n\"There are shootings around here. It is certainly better than it used to be, to my understanding. Certainly, any level of this kind of violence is unacceptable and we do not want this to continue to happen,\" she said.\nAnyone with information on the crime is asked to call police at 202-727-9099 or send a text message anonymously to 50411. A reward of as much as $25,000 is offered.\nStay with News4 for more details on this developing story."}