{"uri": "http://www.wthr.com/story/21528147/multiple-people-shot-at-east-indianapolis-residence", "title": "Police investigate fatal east side Indianapolis shooting", "dct": "Wed, 06 Mar 2013 01:16:00 GMT", "id": "f02d7eaed7e8b66d40016919bcfc4b09", "content": "The mystery continues about what led to the shootings of four people on the Indianapolis east side Tuesday night. One of those people died.\nIt happened at around 8:00 pm at Wellington Village Apartments. The complex is in the 1800 block of Edinburge Square, which is near East 16th Street and I-465.\nNow, we have new insight into who the victims are and how they knew each other.\nThe crime scene was chaotic as 25-year-old Michael Baker lay dead in the entry to this apartment building.\n\"I heard the gun sounds and thought 'no, not in Wellington Village,'\" said Kyana Waller, an apartment resident.\nBut, fifteen hours later, Wellington Village is quiet, with no major signs anything ever happened here. But if you talk to the victim's family, this crime is still fresh and the impact will be long-lasting.\n\"Whoever shot them, when they catch them, they need to electrocute him because that was attempted murder,\" said the father of one of the victims.\nThe man wouldn't give us his name, but didn't mind sharing his rage about the person or persons who shot his son, Christian Smith. The 19-year-old survived, but with multiple gunshot wounds.\n\"If you want to shoot at people, go to the Army and shoot at people that will shoot back. But you're so sorry and scared you want to shoot at people that ain't bothered you,\" the man said.\nAccording to witnesses, Michael Baker was leaning up against the door talking with the three nineteen-year-olds when someone started firing from outside. Up to six bullets went through the door, hitting everyone inside and killing Michael.\nDiana Shell is the grandmother of another victim. Dejour Martin is also 19. He was treated at the scene last night and tried to help police.\n\"He was shot in the hand and the bullet went in here and came out there,\" said Shell. \"He says all he knows is they heard shots and he was trying to get out of the way and get his friend out of the way.\"\nMichael Baker's brother told us the 25-year-old was the father of two young children, ages three and five. He also said he worked at CVS Pharmacy and all he did was go to work and go home.\n\"I never knew him to have any enemies. He just got off work and his mom said he changed clothes and went to hang with his friends,\" Waller said.\nAnyone with information should call Crime Stoppers at 262-TIPS or IMPD at 317-327-3475. Callers can also text \"INDYCS\" plus tip information to 274627(CRIMES)."}