{"uri": "http://www.gastongazette.com/news/20161105/shooting-leaves-two-critically-injured", "title": "Shooting leaves 2 injured", "dct": "Sun, 29 Jan 2017 00:42:51 GMT", "id": "628ee1ecfc40188b841376a5c781e5dd", "content": "By Eric Wildstein and Adam Lawsonewildstein@gastongazette.com and alawson@gastongazette.com\nGastonia Police have made an arrest in relation to a shooting that left at least two people with critical injuries, including one teen.\nPolice booked Pontus Joel Adams, 30, who lives at the Quail Woods Apartment complex in Gastonia, into Gaston County Jail shortly before 7:30 p.m. Saturday. He is charged with three felony counts of attempted first degree murder. He is being held at Gaston County Jail without bond.\nThe shooting occurred around 2:15 p.m. Saturday at Quail Woods Apartments, off Robinwood Road.\nAccording to Gastonia Police Sgt. Nancy Capistran, police found three people with bullet wounds when they responded to the scene. Capistran said two of the victims were taken to the hospital with life-threatening injuries and the other was treated at the scene and released.\nPolice have not disclosed the identities of any of those who were shot.\nThere also was a car wreck afterward in front of the apartment complex on Robinwood Road that witnesses say was related to the shooting. The wreck involved a black Dodge Charger and a white SUV. Police have not confirmed a relationship between the wreck and the shooting.\nChristian Duran said he and a friend were in the parking lot of the complex when they heard several gunshots. They found who they described as a maintenance worker laying on the ground in a pool of blood with at least two gunshots to his left arm and torso.\n“I saw the maintenance guy laying on the ground with his bucket knocked over and him not moving around,” said Duran, who was visiting several friends who live at the complex. “He wasn’t saying anything, he was just making noises.”\nDuran said he witnessed a black male get into a black Dodge Charger and speed away, driving around the body of the maintenance worker and around a police officer who had just arrived on-scene. Durant said the Charger then crashed into the SUV on Robinwood Road.\nComplex residents D.J. Hardin and Jaden Gordon said they also witnessed a man with a similar description shoot the same maintenance worker using what looked like a semi-automatic rifle. They said the other two victims are a 13-year-old male and another male who attends Ashbrook High School.\n“I lift weights with this man. He’ll come and talk and chill with us,” said Gordon, of the maintenance worker. “He’s a nice guy. It’s crazy.”\nResident Chris Sponger said he was sitting on a couch in his apartment when several bullets came through his wall. He said his girlfriend and daughter had left a couple of minutes before it happened.\n“I came outside and saw the dude, the maintenance guy on the floor, and I saw the guy with a rifle,\" he said, before describing the alleged gunman go back into his apartment. \"He comes out of his place with a camo duffel bag and pulls off.\"\nPolice continue to investigate.\nYou can reach Eric Wildstein at 704-869-1828 or Twitter.com/TheGazetteEric. Kevin Ellis contributed to this story."}