{"uri": "http://thetandd.com/news/local/accidental-shot-kills-grandfather/article_2d86d578-914b-11e3-afa2-0019bb2963f4.html", "title": "Attempt to deal with stray dogs led to accidental shooting death", "dct": "Sun, 09 Feb 2014 00:00:00 GMT", "id": "fa272094eff547e52d887875e61007f2", "content": "EUTAWVILLE — As dusk fell to darkness in the outskirts of Eutawville, Tyrone Frazier grabbed a shovel and scooped some dirt to cover blood that had spilled from his father hours earlier.\nJames Frazier, a 59-year-old disabled man, who had five sons and 22 grandchildren, died between 2 and 3 p.m. Saturday from a shotgun blast to the head. He was sitting on the porch of his mobile home that is clustered with about eight others at the end of Yearling Drive just east of the Hot Spot on Old Highway Six.\nAccording to witnesses and family members, Frazier told his 14-year-old grandson, a frequent hunting partner, to fetch his shotgun so he could “take care” of a stray dog problem that had become dangerous to his family and neighbors.\nThe elder Frazier, whose circulatory disorder impaired his mobility, was tired of a pack of mangy, aggressive dogs. He was intent on dealing with the problem, said Beverly Johnson, his wife’s cousin and neighbor.\n“This has been going on for about a year, and it got bad last night when this one dog was trying to attack me and was a menace around here,” Johnson said. “They had called animal control, and they said they were making a record of it. He said last night that he was tired of it and he was going to take care of it today. He was making good on his word today when all this happened.”\nWhen his grandsons went inside to retrieve the shotgun, the 14-year- old attempted to load it, but the gun already was loaded, Tyrone Frazier said.\n“When he tried to load it, it went off,” Frazier said. “It was a like a freak accident. They were going to shoot the wild dog, but the gun went off and hit daddy on the porch.”\nFrazier said that it was his son’s birthday and at 2:30 p.m. he had gone to Holly Hill to get a grill to bring back to his father’s to help the family celebrate the birthday.\n“When I got to Holly Hill, I got a call telling me I’d better come back. They said daddy got shot,” Frazier said. “That must have been about 3.”\nFrazier’s aunt was attending the Eutawville Heritage Festival at the community center where Orangeburg County Sheriff Leroy Ravenell was present about an hour before the incident.\nThe sheriff’s investigators spent more than three hours behind yellow crime scene tape to determine how Frazier died, with Ravenell saying later that the incident was an accident.\nOnce they determined the shooting was accidental, the officers promised to dispatch psychological counselors to the 14- and 13-year-old boys who were involved in the incident.\nTyrone Frazier was visibly shaken by the death of his father, and was greatly concerned about his son, the 13-year-old who was with his 14-year-old cousin when the gun went off.\nThe 13-year-old’s eyes were welled with tears as he stared at the dirt road leading to his grandfather’s home. The 14-year-old had gone inside the dark home, where the buckshot had knocked out electricity, to fetch a photograph of his grandfather.\nSheriff Ravenell stated: “Officers were called to the Yearling Drive residence at 2:18 p.m. in reference to a shooting incident. Our preliminary investigation indicates a 59-year-old male asked his 14-year-old grandson to retrieve a gun. As the 14-year-old was retrieving the weapon, it accidentally discharged, ricocheted through the house and struck the grandfather, fatally injuring him.”\n8:19"}