{"uri": "http://www.10tv.com/content/stories/2016/03/05/columbus-ohio-family-of-slain-7-year-old-boy-talk-about-shooting-possible-motive.html", "title": "Family of slain 7-year-old boy talk about shooting, possible motive", "dct": "Sat, 05 Mar 2016 23:26:00 GMT", "id": "4a04d84e0366759ce2596a5d7b6d2e40", "content": "Judith Huntley is dealing with a loss no mother should have to face.\n\"As a parent, like, how do you tell your kids that they're not going to see their brother anymore,\" she said. \"A lot of people keep saying they're praying for me and praying, asking God for strength, but I don't think He can give me enough strength to get me through this.\"\nHer seven-year-old son, Deontae Fisher, who loved school, playing video games and being around his brother and sister, was shot and killed, Friday.\nHuntley says she and her boyfriend were inside the Express Market on East Fifth Avenue and Peters Avenue, Friday afternoon, while her children Deontae, five-year-old Dakotta and four-year-old Saniah, as well as her boyfriend's brother, 19-year-old Rayquan Holloway, waited in the car.\nThen, they heard the gunshots.\n\"We weren't even in the store for a minute,\" she said. \"We heard gunshots. I thought it was only four shots, but it was 15.\"\nHuntley says the car her family was waiting in was riddled with bullet holes.\nShe says she ran outside and opened the door where Deontae was sitting.\n\"I got him out of the car and I just got him and I sat on the floor and said 'Deontae, it's going to be OK, mommy's got you',\" she said.\nAt the hospital Huntley was told her son, who had been shot in the head, would not survive.\n\"I just sat there in shock and said 'So, out of all the kids that you all can save at this hospital, you all can't save my son',\" she said.\nAccording to Huntely, Dakotta was shot in the leg and Saniah was hit in the arm. Both are now out of the hospital. Huntely says Holloway was released from the hospital Friday night.\nThe suspect, 18-year-old Marctarius Grace, is now in custody.\nHuntley and her sister, Sasha Fisher, say they believe the shooting was gang-related.\n\"I definitely think it is,\" Huntely said. \"It's a lot of tension.\"\n\"We need to save our youth, this is ridiculous,\" Fisher said. \"This was a senseless killing. My nephew didn't deserve this over a street you live on.\"\nColumbus Police have not confirmed a possible motive for the shooting.\nFamily of Deontae Fisher says there will be a candlelight vigil at the Express Market at 7:00 p.m., Saturday."}