{"uri": "http://www.ksla.com/story/33327339/nopd-gunman-opens-fire-near-group-of-children-hitting-one", "title": "NOPD: Gunman opens fire near group of children, hitting one", "dct": "Wed, 05 Oct 2016 23:13:00 GMT", "id": "ff759cb4438a1f3beba9eca8979d49b5", "content": "NEW ORLEANS, LA (WVUE) -\nNew Orleans police are investigating a shooting in the Leonidas neighborhood that left an 8-year-old boy injured.\nThe incident occurred Wednesday around 5:30 p.m. in the 1400 block of Monroe Street.\nWitness said the shooter was in a red car driving down Monroe when he opened fire on a home near the corner of Jeannette Street right in front of a group of children - some as young as 5 - hitting the 8-year-old boy in the leg.\n“Somebody that just don't have no sense, felt like being the devil, I guess, stuck his arm out that window and just went to shooting at that house where all those kids was out there playing,” said a witness, who FOX 8 is not identifying. “It sounded like - just like eight, seven or eight shots just going off, that little red car just going up Monroe just shooting, and I just broke and ran over there.”\nThe witness rushed to help the boy who was bleeding and clearly in pain.\n“He was just hollering and was just nervous. He was shaking, didn't know what to do. None of the kids knew what to do, hurt, they’re hurt, they’re used to playing out here, they’re probably not going to want to play out here no more,” the witness said.\nNeighbors said children are often playing in the area where police spent time Wednesday evening collecting multiple shell casings.\n“Riding their bikes, riding their little scooters and just playing, that's all, just playing. An everyday thing for them. They're either on the basketball goal, riding their bike, running up and down,” the witness said. “And that's what they get today - nonsense.”\nNow neighbors are worried about the boy who took a bullet and the other children whose lives are now marred by violence.\n“They don't even think of what they're doing to the neighborhood. I'm pretty sure they know we got to live around here, they probably come from somewhere else and they're not even thinking about our kids,” the witness said.\nThe investigation into the incident in ongoing. If you have any information that could help police with this case call Crimestoppers at (504) 822-1111.\nCopyright 2016 WVUE. All rights reserved."}