{"uri": "http://www.macon.com/2015/01/07/3517306/fort-valley-police-still-looking.html?sp=/99/148/198/", "title": "Arrest made in connection with fatal shooting of 8-year-old in Fort Valley", "dct": "Wed, 07 Jan 2015 14:43:00 GMT", "id": "325d99fde4fc6456803ecbbcd5a2ec1a", "content": "A 25-year-old man has been charged in connection with a Tuesday shooting that killed an 8-year-old boy at an apartment in Fort Valley.\nDennis Eason of Fort Valley was arrested Wednesday on a charge of terroristic threats. He was captured in Birmingham, Alabama, when attempting to board a Greyhound bus, a police news release stated. He’s expected to be extradited to Fort Valley.\nEason is a “person of interest” in the shooting, but authorities have not yet determined whether he fired the fatal shots into the front door of the apartment, Peach County Sheriff Terry Deese said. The boy was on an air mattress in the living room when he was hit.\n“That’s kind of where we’re at,” Deese said.\nEason is accused of sending a text message an hour before the shooting to De’Jad Williams, the boyfriend of the child’s mother, in which Williams was asked to come out and fight, Deese said.\nWilliams told The Telegraph that residents reported seeing two people running away from the apartment complex after the shooting.\nJai’mel Anderson, who was in his pajamas and had stayed up late to watch television, was shot once in the leg and once in the upper torso about 1:40 a.m. The boy was rushed by ambulance to the Medical Center of Peach County, Navicent Health, where he was pronounced dead at 2:25 a.m.\nWilliams, who rents unit 2-E at Indian Oaks Apartments where the shooting occurred, considers himself like a father to Jai’mel and his 6-year-old brother, who was asleep at the time. The boys’ mother was at work.\nA search warrant executed at the crime scene resulted in the discovery and seizure of cocaine, drug paraphernalia and a stolen firearm, the release stated. Charges are expected in connection with the drug seizure, the release stated.\nEason was arrested by the U.S. Marshal’s Southeast Regional Fugitive Task Force. His arrest was a cooperative effort by Middle Georgia law enforcement agencies, including the Peach County sheriff’s Drug Enforcement Unit, Bibb and Crawford sheriff’s deputies, Macon Regional Crimestoppers and the GBI.\nSCHOOL PRINCIPAL REMEMBERS BOY\nJai’mel was a third-grader at Westside Elementary School in Warner Robins.\nWednesday, administrators from the school and the district office were on hand to talk with students and provide support as needed at the school, Beth McLaughlin, school system spokeswoman, said in an email.\nSchool principal Cynthia Hammond released this statement Wednesday: “The Westside Elementary family is deeply saddened by the death of our beloved Jai’mel.\n“He was such a kind boy with an infectious smile. He enjoyed playing football and basketball during recess and took pride in his school work. He was loved by his family, friends, teachers and administrators. We miss him already and extend our thoughts and prayers to his family.”\nSchool administrators called his classmates’ parents Tuesday to inform them that a student in their child’s class had died, McLaughlin said. Administrators wanted to ensure that parents were informed, so they could talk with their children Tuesday night, she said.\nTo contact writer Becky Purser, call 256-9559."}