{"uri": "http://klfy.com/2015/07/23/reports-2-dead-including-shooter-after-shooting-at-the-grand-theater-on-johnston-street/", "title": "Lafayette Police, Gov. Jindal give update on Grand Theater Shooting", "dct": "Thu, 23 Jul 2015 19:57:00 GMT", "id": "e553e95df1d96131bc05191270f602f2", "content": "LAFAYETTE, La. (KLFY) –\nUPDATE (From The Associated Press):\nPolice chief: Gunman visited theater more than once, perhaps to see if it was ‘soft target’\nGov. Bobby Jindal: Movie theater gunman took his time and was methodical during rampage.\nPolice: Movie theater shooter bought handgun legally at pawn shop in Alabama in 2014.\nLafayette Police Chief Jim Craft announced the identity of the Grand Theater shooter as John Russell Houser, 59, of Phenix City, Alabama.\nCraft said investigators found several disguises including wigs and glasses. Houser fired 13 rounds.If you have any information about John Houser please call Lafayette Police at 337-291-8650.\nMayci Breaux, 21 died on scene. Jillian Johnson, 33, died later at a local hospital. Breaux’s boyfriend of four years, Matthew Rodriguez, was also shot inside the theater and was released from the hospital on Friday afternoon. Two victims were released from the hospital as well. One is still in critical condition.\nThree people, including the shooter, are now dead after a shooting at the Grand Theater on Johnston Street.\nThe Associated Press reports that Louisiana State Police searched a room at a Motel 6 in Lafayette early Friday morning in connection with the shooting.\nLouisiana State Police spokesman Maj. Doug Cain told the AP that the theater investigation led them to a room at the Motel 6. Cain also said authorities were investigating whether the shooter had stayed there. He said the bomb squad swept the room before going in as a precaution.\nThe AP also reported a dozen police personnel could be seen outside the motel. An officer carried out a cardboard box from the room and other officers were seen knocking on neighboring doors.\nThe shooting happened around 7:30 p.m. on July 23, 2015, during a showing of the movie “Trainwreck.”\nLouisiana and Lafayette Police believe the shooter, a 58-year-old white male, was sitting alone in the theater when he suddenly got up and started firing a semi-automatic handgun.\nLafayette Police Chief Jim Craft tells KLFY that the shooter died from a self-inflicted gunshot wound.\nTwo people who were sitting in front of him were killed. One of the victims died at the scene, the other died at a local hospital.\nNine other people were injured in the shooting. Our media partners at The Daily Advertiser report eight were transported by ambulance and one was taken by private party\nInvestigators say the shooting appears to be random. Police had to delay their investigation of the crime scene, for several hours, after a suspicious package was located in the car that they believed to belong to the shooter.\nAuthorities detonated the car and said the package turned out to be harmless.\nThe nearby Greenbriar Condominiums was evacuated due to the suspicious package but the evacuation order has been lifted.\nChief Craft also said that Lafayette Police know the identity of the shooter but are withholding his identity at this time.\nLouisiana Governor Bobby Jindal rushed to Baton Rouge to the scene and then later visited victims and families at Lafayette General."}