{"uri": "http://raycomgroup.worldnow.com/story/26244641/colerain-township-boy-shot-while-playing-with-gun", "title": "Colerain Township boy shot while playing with gun", "dct": "Tue, 12 Aug 2014 01:30:00 GMT", "id": "77beb95cb72db0c1dc82a20f7cf1655d", "content": "COLERAIN TOWNSHIP, OH (FOX19) -\nA 7-year-old boy was shot while playing with a gun in his backyard Sunday.\nThat's what Colerain Township police say happened around 1 p.m. on Impala Drive.\nHe had surgery earlier Sunday and it appears he'll be okay.\nPolice say the boy was playing with his brother in the backyard when the boy was accidentally shot in the back.\n\"I heard the gunshot, I knew right away it was a gunshot and I knew it was close to my house,\" said Terri Cutter.\nTerri Cutter lives right next door to the home where police say the boy was shot. She says it appears the kids got the gun from the shed out back. But she knows this could have been much worse because her daughter was outside when it happened.\n\"It could have hit her. It could have changed our lives not just theirs and it scares me,\" said Cutter.\nCutter says after she heard the gunshot she ran outside and saw the boys walking into the house.\n\"He was communicating and able to communicate his pains and everything else on the way out. He was very cogent which I would think is a good sign,\" said James Love with Colerain Township police.\nThe brothers live with their grandparents, and Cutter says there's been problems in the past.\n\"I don't see a lot of guidance from their grandparents,\" said Cutter.\nPolice say it appears the grandparents were \"clueless\" what the boys were getting into this afternoon. Cutter says they need better supervision.\n\"Parents need to be parents. They need to not just sit in their house thinking that their kids told them I'm doing this, check up on that, follow through with your kids,\" said Cutter.\nHow the boys had access to a gun so easily is what investigators are trying to figure out next.\n[Related: Listen to a portion of the 911 call here]\n\"They're also looking around in the back to see if there's any more situations. Also talking to the adults involved to find out how this happened, how did this come about,\" said Love.\n\"I hope that they're okay, but they need help though,\" said Cutter.\nPolice say once their investigation is complete, child services will take a closer look to see if any actions need to take place regarding proper supervision for the boys.\nThis is the third incident this year involving kids playing with guns and accidentally firing them off. In March, an eight year old boy from East Price Hill died from his injuries\nwhen he was shot in the chest. Then last month a 13 year old died after his friend accidentally shot him in the head in Green Township.\nCopyright 2014 WXIX. All rights reserved."}