{"uri": "http://www.ocregister.com/articles/street-741257-south-police.html", "title": "6 people shot in 5 shootings in Santa Ana on Saturday night", "dct": "Sun, 15 Jan 2017 17:53:00 GMT", "id": "2b8de46e78186c26da40b0258d636468", "content": "/ STAFF WRITER\nSANTA ANA – Police are investigating two separate shootings late Saturday in Santa Ana - in addition to three shootings that happened earlier in the night.\nIn all, six people were shot.\nSanta Ana Police Cpl. Anthony Bertagna said Sunday he couldn’t remember hearing about that many shootings in one night.\nHe said a 17-year-old boy arrived at UC Irvine Medical Center just before 9 p.m. with a gunshot wound in his upper torso.\nThe victim said he was walking home on the 600 block of South Raitt Street when he heard gunshots and realized he had been struck. He only told officers he heard a vehicle fleeing westbound toward Bristol Street, Bertagna said, and was uncooperative when officers questioned him on how the shooting occurred.\nIn a separate incident, several officers heard numerous shots fired at the 900 block of South Main Street at about 10:45 p.m. and upon arrival, found a man with a gunshot wound in the lower torso, Bertagna said.\nThe victim was walking on the west side of South Main Street when he was confronted by a suspect on the east side of the street. Several rounds of shots were fired and one struck the victim, Bertagna said. He was taken to a nearby hospital. The suspect is described as a male with curly hair wearing a hooded sweatshirt.\nEarlier, at just before 7 p.m., a man was shot in the upper torso in an alley in the 900 block of South Townsend Street – nearby the South Raitt Street incident – and was taken to a local hospital in critical condition, according to Santa Ana police. A few minutes later, another man shot possibly in the vicinity of that shooting went to a local hospital with a not life-threatening gunshot wound.\nThe second incident occurred at 7:55 p.m., when two police officers driving north on Durant Street by 15th Street heard gunshots and saw a man running with a handgun. The man dropped the gun and hid, and officers captured him and found he had a gunshot wound in his upper torso, police said. He is expected to survive.\nIn a third shooting, officers responded to shots fired in the 1100 block of South Standard Avenue at 8:47 p.m. and found a man caught in the crossfire of another shooting had sustained a gunshot wound to his lower extremities. He was treated at a local hospital for the non-life-threatening wound.\nSuspects in all the shootings remain at large.\nContact the writer: 714-796-7762 or jkwong@ocregister.com or on Twitter: @JessicaGKwong"}