{"uri": "http://www.wlwt.com/news/police-arrest-man-in-connection-with-fatal-shooting-of-5yearold/29869426", "title": "Police arrest man in connection with fatal shooting of 5-year-old", "dct": "Sat, 22 Nov 2014 04:18:00 GMT", "id": "35e53caf48726440a1474524479960ae", "content": "CINCINNATI —\nMore than two weeks after a 5-year-old boy was fatally shot inside a Mount Auburn home, a man has been arrested and charged in connection with the death.\nTerrile Short, 23, was in jail on Friday night, charged in the death of Daniel Redmond-Hamilton.\nDaniel, 5, was shot and killed in a Mount Auburn apartment in the 200 Block of Kinsey Avenue on Nov. 2.\n\"He's just a toddler. You might as well say he was a baby,\" said Daniel's mother, Danielle Redmond. \"I feel relieved on one hand that someone is being held accountable for their actions, but on the other hand, I still miss my son. There's nothing that's going to bring him back.\"\nAccording to court documents, Short was charged with tampering with evidence, reckless homicide and having weapons under disability in connection with the Daniel's death.\n\"He loved school. He loved to go to school and play with his friends there as well,\" said Daniel's great-grandfather, Robert Bronaugh.\nPolice said Short hid a 9mm Glock so that it would not be used as evidence.\nBronaugh said Daniel was a kindergartner at Mount Auburn International Academy and was with his father when he was shot in the face.\n\"I don't know exactly what happened, but I know there shouldn't be guns or any shooting or any type of harm towards children. Nothing like that should ever happen,\" Redmond said.\nAuthorities said Short has previously been convicted of drug possession and should not have been carrying a gun.\n\"I met him once, but that's about it,\" Redmond said.\nDaniel's family members must rely on times past to keep them from focusing on the tragic reality of the present.\n\"I can't hug him or kiss him or play with him or talk to him. I can't do any of that anymore,\" Redmond said.\nShort was being held at the Hamilton County Jail. He was scheduled to be arraigned Saturday morning."}