{"uri": "https://www.washingtonpost.com/local/public-safety/no-arrests-made-after-stray-bullet-grazes-toddler-in-rash-of-gunfire-in-nw-dc/2016/02/07/18ea26d6-cdc8-11e5-b2bc-988409ee911b_story.html", "title": "No arrests made after stray bullet grazes toddler in rash of gunfire in NW D.C.", "dct": "Sun, 07 Feb 2016 00:00:00 GMT", "id": "7b44ce53937c39f591649df9baddbaec", "content": "No arrests have been made in connection with a shooting Saturday that wounded a man and a toddler who was with his mother in a Georgia Avenue NW hair salon.\nAccording to a D.C. Police report, a flurry of gunfire broke out near a Georgia Avenue hair studio Saturday night, wounding a man and a 2-year-old boy, who was taken to a hospital after a stray bullet grazed him behind the left ear.\nA police spokeswoman declined to comment on the case Sunday and referred a reporter to the report, filed just before 2 a.m. Sunday. The report did not name a suspect and said no arrest had been made in the case.\nAccording to the report, the toddler was with his mother inside Under the Sun Hair Studio, 5425 Georgia Ave. NW,when shots rang out, about 10:25 p.m. A police spokesman told the Post on Saturday night that a bullet came through the window and struck the boy, who was taken to a local hospital, treated and released.\nThe report indicates an unknown shooter began firing in multiple directions — striking the victims, multiple businesses and three cars before fleeing.\nThe male victim reportedly was exiting S&G Wine & Liquors at 5421 Georgia Ave. NW when he heard gunshots. According to the report, the man began “running southbound on Georgia Ave. NW, before realizing he had been shot in the left ankle.”\nThe man, who was treated and released from a local hospital, said he did not see who was shooting, according to the report.\nMultiple bullets struck a vehicle parked in front of the salon, hitting the front driver’s side door, the fender, the rear driver’s side door, the front bumper, and a tail light, the report said. Another vehicle was struck near its trunk while traveling southbound on Georgia Avenue, the report said. A third vehicle was struck in the front drivers’ side bumper.\nThe report noted the hair studio was struck twice in its storefront window and the liquor store was struck once."}