{"uri": "http://www.news9.com/story/33524405/okc-man-arrested-man-in-connection-with-manhunt", "title": "Two Arrested In Connection With Manhunt, One Other Sought", "dct": "Tue, 01 Nov 2016 12:55:00 GMT", "id": "21ff3cd258832b3b8ec1e3311b517de9", "content": "OKLAHOMA COUNTY, Oklahoma -\nThe United States Marshals Service arrested Danny Roach, 34, in connection with the manhunt for Michael Vance and the Oklahoma County Sheriff's Office identified two others they are looking to arrest.\nApril Harden (who also goes by April Roach) was arrested Monday evening. She and 33-year-old Reginald Moore are accused of assisting Vance during the early hours of the manhunt.\nAccording to a probable cause affidavit, the investigation led U.S. Marshals to Roach, a convicted felon. When authorities located Roach they found him in possession of several guns including two rifles and two handguns.\nRoach was arrested on October 29.\nOklahoma County jail records show he is being held on complaints of accessory to felony and possession of a firearm after a former conviction of a felony.\nThe Oklahoma County sheriff's office held a news conference at 3 p.m. Monday. Sheriff John Whetsel announced they arrested Roach in connection to the manhunt. Sheriff Whetsel said after the murders in Luther, Roach provided Vance with bandages and two 30-round magazines for an AK-47. He also traded Vance's rifle with a different AK-47 that has a shorter barrel. That was the weapon Vance reportedly used in the attempted carjacking in Sayre, the shooting of Dewey County Sheriff, and the shootout with Oklahoma Highway Patrol (OHP) troopers that ended in his death.\nThe Sheriff said Roach was aware of Vance being involved in the shootout with Wellston police officers and the homicides. Roach said Vance admitted to, \"cutting the wrong side of the victim's neck,\" and he told Roach he had to cut the other side. He said he killed the female victim after she lied to him.\nRoach admitted he was looking out for Vance while Vance was at his home in Oklahoma City. He said as Vance was leaving, a police car drove by and Roach let Vance know when it was clear for him to leave.\nRoach is facing multiple charges, including two counts of accessory to felony murder after the fact and two counts of possession of a firearm after a felony conviction. His bond has been denied.\nLater Monday afternoon, the Oklahoma County Sheriff's Office also announced that two other arrest warrants were to be issued for Moore and Harden.\nAccording to court documents, Moore is accused of swapping rifles with Vance. Harden is accused of initiating the call with Moore two exchange the weapons. She is also accused of providing bandages for Vance's gunshot wounds.\nRoach and Moore reportedly helped Vance heal from his gunshot wound.\nMoore reportedly went to a hardware store and bought a pair of needle nose pliers to try and remove the bullet that may have been lodged in Vance from the Wellston officer involved shooting, according to an affidavit."}