{"uri": "http://www.nbcnews.com/news/us-news/michael-vance-hunted-after-allegedly-shooting-2-oklahoma-cops-n671621", "title": "Michael Vance Hunted After Allegedly Shooting 2 Oklahoma Cops", "dct": "Mon, 24 Oct 2016 21:03:00 GMT", "id": "ae4a9c7a3d30c6d669b0097e4145e63b", "content": "Authorities were hunting a double-murder suspect on Monday after he shot two police officers, stole their vehicle and live streamed his getaway on Facebook.\nAuthorities believe Michael Vance brutally killed two people and injured two more after he fled a shootout with police near Wellston, Oklahoma, on Sunday night, according to a probable cause affidavit released Monday.\nHe was struck at least twice during the exchange of gunfire and is believed to be armed with an AK-47.\nThe two injured officers — identified in the affidavit as Sean Stewart and Jimmy Hampton of the Wellston Police Department — were responding to reports of shots fired at a mobile home park in Lincoln County, northeast of Oklahoma City.\nThey came under fire almost immediately after arriving at the scene around 6:30 p.m. local time (7:30 p.m. ET), Sheriff Charlie Dougherty said during a news conference.\nStewart and Hampton were struck in their lower extremities and transported to a local hospital, the affidavit says.\nA man identified in the document as Tony Heavner was taken into custody at the scene. But Vance fled in a stolen patrol car, posting streaming video to Facebook as he drove, the affidavit says.\nIn the footage, Vance is behind the wheel and blood can be seen on his t-shirt. \"This is more intense than I thought it was gonna' be,\" he says, adding that he preparing to steal a second vehicle.\nThe affidavit alleges that Vance then carjacked a Lincoln Towncar, shooting a woman in the process and continuing to live stream his getaway.\n\"What's up y'all,\" he says, pointing the camera toward what appears to be a gun. \"Letting y'all know this is real.\"\n\"If you want to know what's up next, stay tuned in to your local news,\" he says.\nAt 9:30 p.m. local time, authorities spotted the stolen Lincoln at a home eight miles away, in Luther, Okla., the affidavit says. Inside, they found the bodies of Ronald Wilkson and Valerie Wilkson. Ronald had been shot once, but he also had a large cut on his neck \"consistent with an attempt to sever his head,\" the affidavit says.\nInvestigators found a similar wound on Valerie's neck, several defensive wounds on her arms and a large cut around her shoulder.\n\"The size and depth of this cut led investigators to believe that Vance was trying to remove Wilkson's arm,\" the affidavit says.\nVance allegedly then stole Valerie's Mitsubishi and drove 150 miles west, to Sayre, where he shot a gas station clerk twice in the leg.\nAs of Monday evening, Vance was still at large. In a Wanted poster released by Oklahoma High Patrol, he was described as armed and dangerous. The poster also says he has an unspecified medical condition and \"may try to spread disease.\"\nEarlier Monday, Sheriff Charlie Dougherty said during a news conference that Vance had recently been accused of child sexual assault.\n\"We were doing an investigation,\" Dougherty said. \"We arrested him. That is supposedly what set him off but we don`t know that for sure yet.\"\nIn one of the Facebook videos, Vance can be heard thanking his sister for believing him and saying, \"it was all a setup,\" but it's unclear what he's referring to."}