{"uri": "http://www.pennlive.com/news/2016/06/donald_meyer_perry_county_man.html", "title": "Man charged in 12-year-old daughter's shooting death should be evaluated by psychiatrist, attorney says", "dct": "Tue, 14 Jun 2016 15:55:00 GMT", "id": "1d4ec266f7c9cd09ec46bc13ea69356d", "content": "Donald B. Meyer Jr., the Perry County man charged with homicide in his daughter's shooting death, should be evaluated on whether he is mentally competent to stand trial, his attorney says.\nA motion filed May 18 by Jerry Philpott, Meyer's court-appointed lawyer, asks Perry County Court to appoint a psychiatrist to evaluate his client, who is charged in the death of his 12-year-old daughter, Ciara Meyer.\nCiara Meyer was struck in the chest by a bullet that passed through her father's arm after Constable Clark Steele fired at her father.\nDonald Meyer Jr., the Perry County man charged with homicide in connection with his daughter Ciara's death in January, entered a not guilty plea Thursday morning and asked for a new attorney.\nSteele, who has not been charged, said he was acting in self-defense after Meyer pointed a rifle at him during an eviction.\nDonald Meyer Jr., the Perry County dad accused of homicide in the death of his 12-year-old daughter, had warned he would \"go out in a hail of gunfire\" regarding his eviction, witnesses said at his preliminary hearing Tuesday.\nPhilpott asks the court to have a psychiatrist evaluate Donald Meyer Jr., 58, on his mental competency and whether there is a viable insanity defense in the case.\nThe attorney also asks the court to evaluate Meyer's contention that there is a conflict of interest in Philpott representing him.\nPhilpott said he disputes Meyer's allegation of a conflict. Still, he has asked Chief Public Defender Barbara Wevodau to participate in the defense so Meyer has two advisers in the case.\nPhilpott said Meyer's concern over a potential conflict stems from his representation of the family of Sherrie Gehman, Meyer's wife, prior to their marriage. He said he was representing her family in their effort to obtain a power of attorney document on Sherrie Gehman's behalf. The action wasn't found to be feasible, he said, and a guardianship was pursued instead. Philpott said Meyer did not participate in that proceeding.\n\"Meyer's belief that there is a conflict arises out of the fact that he believes that his brother-in-law, Sherrie Gehman's brother, is instrumental in causing a lot of his problems,\" Philpott said in the court motion. Philpott said he never met Sherrie Gehman's brother.\nAt his May 5 arraignment hearing, Meyer entered a not guilty plea to charges of homicide, involuntary manslaughter, persons not to possess firearms, aggravated and simple assault, endangering the welfare of children and terroristic threats."}