{"uri": "http://lancasteronline.com/news/local/death-of--year-old-girl-shot-by-constable-in/article_baff89f6-ba28-11e5-a4b8-17bd7bc5874e.html", "title": "Death of 12-year-old girl, shot by constable in Duncannon eviction dispute, ruled a homicide", "dct": "Wed, 13 Jan 2016 00:00:00 GMT", "id": "22e185fda74469efa0516c156a6d2701", "content": "The shooting death of a 12-year-old girl — killed by a central Pennsylvania constable who was serving an eviction notice Monday in Duncannon — has been ruled a homicide.\nThe Perry County coroner made the determination after an autopsy Wednesday, according to a report Wednesday afternoon by Fox 43 News.\nCiara Meyer was shot by state constable Clarke Steele at her home in Penn Township, about 10 miles northwest of Harrisburg. She was pronounced dead at the scene.\nCiara died as a result of a single gun shot wound, according to Perry County Coroner Michael Shalonis.\nA homicide is defined as any time “one human being causes the death of another,” according to the Legal Information Institute at Cornell University Law School.\n“Not all homicide is murder, as some killings are manslaughter, and some are lawful, such as when justified by an affirmative defense, like insanity or self-defense,” the school’s website explains.\nAccording to the Associated Press, Steele fired after 57-year-old Donald Meyer, the girl’s father, threatened him with a loaded, .223-caliber rifle, which Meyer pointed at Steele when the constable tried to serve a district judge’s eviction order.\nSteele’s bullet passed through Meyer’s arm, AP reported, and fatally struck the girl, who was standing behind her father.\nSteele, who has served in Perry and Dauphin counties for the past six years, is \"completely distraught over this incident — this is the worst nightmare any of us as constables can encounter,\" Bill Stoeffler, a Dauphin County constable and spokesman for the region's constables' association, told PennLive.com.\nStoeffler said it was \"absolutely not intentional\" that the girl was shot.\nState police confirmed there was an ongoing eviction process and that Meyer knew the constable was on his way to execute the order to vacate the home.\n\"It was absolutely no surprise he was coming at this date and time,\" Trooper Rob Hicks, state police spokesman, told the Associated Press.\nMeyer was flown to Hershey Medical Center for treatment. He remains in the hospital and will be charged with assault and reckless endangerment upon his release, police said.\nA GoFundMe site named “Ciara’s Fund” was created to help pay for funeral costs and to set up a scholarship fund in Ciara’s memory."}