{"uri": "http://abc27.com/2016/04/05/preliminary-hearing-scheduled-for-father-in-daughters-eviction-shooting/", "title": "Duncannon man to stand trial for daughter’s fatal eviction shooting", "dct": "Tue, 05 Apr 2016 11:39:00 GMT", "id": "876ef6f691899fdd94ee651cddada6ba", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nENOLA, Pa. (WHTM) – A Perry County man is headed to trial for criminal homicide and related charges in the fatal shooting of his 12-year-old daughter during an apartment eviction.\nAll charges against 58-year-old Donald Meyer were held for court after a preliminary hearing Tuesday before Magisterial District Judge Richard Dougherty.\nPolice say Meyer on Jan. 11 pointed a loaded .223-caliber rifle at Constable Clarke Steele’s chest as Steele was evicting the family from the Pfautz Apartments in Penn Township. Steele fired a shot that passed through Meyer’s arm and struck his daughter Ciara, standing directly behind him, in the chest.\nDonald Meyer also was held for court on felony counts of aggravated assault and illegal possession of a firearm. He also faces misdemeanor counts of involuntary manslaughter, simple assault, endangering the welfare of a child, reckless endangerment, and terroristic threats.\nSteele has been cleared of any wrongdoing and will not face any charges. Perry County District Attorney Andrew Bender has said Steele fired in self-defense when Meyer placed him in “imminent and immediate fear for his life.”\nGet breaking news, weather and traffic on the go. Download the ABC 27 News App and the ABC 27 Weather App for your phone or tablet.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}