{"uri": "http://www.reviewjournal.com/crime/homicides/man-woman-dead-2-children-injured-north-las-vegas-shooting", "title": "Parents dead, 2 children injured in North Las Vegas shooting", "dct": "Thu, 05 May 2016 07:38:00 GMT", "id": "17baaa7578a5b3120a21439ff04d7ee3", "content": "A mother and father were killed in a shooting that also injured their two children Thursday morning near the entrance of a North Las Vegas day care center.\nOfficers responded just after 6 a.m. and found the parents’ bodies outside the Kids Campus Learning Center at 3901 N. Martin Luther King Blvd., North Las Vegas police spokeswoman Ann Cavaricci said. She said the incident may have been a murder-suicide.\n“We’re not looking for any outstanding suspects at this time,” the spokeswoman said.\nCavaricci said the two children, a 4-year-old boy and a 3-year-old girl, suffered possible gunshot wounds and were taken to University Medical Center with injuries that were not life-threatening. At least one of the children underwent surgery.\n“We just need to all keep them in mind right now and really focus on thinking about that they’ve been injured and that this is going to be a traumatic experience for them,” Cavaricci said.\nA preliminary investigation indicates that the shooting was domestic-related, she said, adding that it was the eighth homicide in North Las Vegas this year.\nPolice identified the parents only as a 27-year-old woman and a 40-year-old man. The Clark County coroner’s office will release their names after relatives have been notified. “The preliminary investigation indicates the female victim was dropping off her two children, ages three and four, at the day care they attend,” police said in a news release Thursday evening. “Moments later the father arrived at the same location, after which witnesses reported hearing what sounded like gunfire.”\nA weapon was recovered from the scene. Police do not know how many shots were fired or whether any neighboring homes or businesses were struck by rounds, or whether any struck the day care facility.\nKids Campus opens at 6 a.m., according to its website, but no other children were present at the facility during the shooting, Cavaricci said.\nMartin Luther King Boulevard was closed for several hours between Gowan and Alexander roads but was reopened Thursday afternoon.\nThe two bodies could be seen lying near the entrance of the day care center Thursday morning. They remained there until nearly 1 p.m. as crime scene investigators and detectives examined the scene.\nThe day care center did not open Thursday, though several employees remained throughout the day. Cavaricci said police were called by employees, and she credited them for helping the investigation.\nAn employee for the center, who did not give her name, said the shooting occurred before the doors opened for business. She said the facility planned to reopen today.\nCavaricci said the children were injured as a result of the shooting, but it was unclear whether their injuries were inflicted intentionally or were caused by ricochets.\nPolice are investigating whether the parents had a history of domestic violence.\nA neighbor, Theresa Hughes, heard the commotion Thursday morning.\n“Lots of gunshots, very loud,” she said.\nHer husband ran out of the house to find a woman lying next to a white sport utility vehicle in the parking lot.\nShannon Lee and Laticia Almeida work at a nearby dentist’s office. They were shocked to learn of the shooting and see the police activity right across the street.\n“Normally it’s a quiet neighborhood,” Lee said.\nBoth said they had been to the day care center before to give the children supplies and give presentations on hygiene techniques such as brushing and flossing.\n“Everything has always been calm,” Almeida said. She said the police presence and handling of the scene was a comforting sight.\n“We just hope those kids are OK,” she said.\nLee added, “It’s sad that they’ll grow up without parents.”\nChristine Briley has a child who attends the facility and said she, too, was shocked when she heard the news.\n“The center is held in a high regard; that’s why I chose it,” she said.\nDavid Sherlock has lived in a home across the street from the day care center for 10 years and said he has seen increased police activity in the neighborhood in recent months.\nIvan Mieja, Sherlock’s next-door neighbor, recently bought the home with his fiancee and lives there with their young son.\nMieja said a shooting occurred in front of his house in July and recalls the sight of shell casings in front of his home. He installed a security and surveillance system at his home but said Thursday’s shooting convinced him that he should leave the area.\n“At this point we just want to move to the other side of town,” he said with his young son at his side.\nMieja’s son is close in age to the two children injured Friday, and he said he had tried to enroll him at Kids Campus but could not because of a long waiting list. He said the shooting “hit close to home.”\n“What’s going to happen to those kids?” Mieja said.\nKids Campus has three Las Vegas locations and offers “proven educational programs for toddlers, preschoolers, kindergartners and school-age children,” according to its website, which indicates the center was established nearly two decades ago.\nReview-Journal photographer Brett LeBlanc contributed to this story. Contact Christian Bertolaccini at cbertolaccini@reviewjournal.com and 702-383-0381. Find @bertolaccinic on Twitter. Contact Lawren Linehan at llinehan@reviewjournal.com or at 702-383-0381. Find @lawrenlinehan on Twitter."}