{"uri": "http://www.chicagotribune.com/news/local/breaking/chi-shooting-chicago-20150309-story.html", "title": "3 dead, 11 wounded, including woman and toddler she was putting in car", "dct": "Tue, 10 Mar 2015 07:13:00 GMT", "id": "17edc639f0732055a48ff98c1103f3e3", "content": "Three people were killed and at least 11 others were wounded, including several children, in Monday shootings on the North, Northwest, West, South and Far South sides, officials said.\nAbout 6:30 p.m., police responded to the 200 block of West 105th Street on the Far South Side and found four people with gunshot wounds, police said.\nA 34-year-old woman was shot in the chest and left hand. A 2-year-old boy who the woman was putting into a car was shot in the back, police said. Both were taken to Roseland Community Hospital. The woman was transferred in serious condition to Mount Sinai Hospital, and the boy was transferred to Advocate Christ Medical Center in Oak Lawn where he was listed in critical condition, police said.\nIn addition to those victims, a 77-year-old man was shot in the head, and a 5-year-old boy, who was a relative, was shot in the arm, police said. The two were in a home when bullets crashed through a window and struck them as they watched TV, police said.\nThe man was later pronounced dead at Christ Medical Center, and the boy suffered a graze wound and was taken to the Oak Lawn hospital, where his condition had stabilized, police said.\nPolice said the shooting was gang-related, and several people were being questioned.\nAbout an hour after that shooting, at 7:35 p.m., a 26-year-old man died after being shot on the 9200 block of South Ada Street on the Far South Side, said Chicago Police News Affairs Officer Hector Alfaro.\nPolice responding to calls of “shots fired” found the man, identified as Larry Hardin Jr., of the 1400 block of East 90th Street, lying on a sidewalk with a gunshot wound to the head, according to the Cook County medical examiner's officer and police.\nThe man was pronounced dead at John H. Stroger Jr. Hospital at 7:53 p.m., according to police and the medical examiner's office.\nShortly before 3 p.m., a 20-year-old man was fatally shot on the North Side in the 900 block of West Agatite Avenue, police said.\nThe man was walking on a sidewalk eastbound on Agatite with a group of people, police said. The attacker was in a nearby alley. As the man passed the mouth of the alley, the attacker fired several shots with a .45 caliber semiautomatic weapon, police said.\nThe man was shot in the chest and pronounced dead on the scene, police said. He was pronounced dead at 3:05 p.m., according to the Cook County medical examiner's office.\nThe people the man was with ran away, authorities said. No other information was released by News Affairs.\nThe man was later identified Troy Phelon, 20, of the 300 block of South Kedzie Avenue.\nIn the latest non-fatal shooting, a 42-year-old man drove himself to a hospital after he was shot around 11:45 p.m. in the West Garfield Park neighborhood, Alfaro said.\nThe man was in his car in an alley in the 100 block of South Pulaski Road when a man got inside his car, sat in the passenger seat and displayed a handgun, Alfaro said.\nA struggle ensued and the gun discharged, hitting the man in the right calf, Alfaro said.\nThe man drove himself to Swedish Covenant Hospital where his condition stabilized.\nAround 9:10 p.m., a 23-year-old man was wounded in a shooting in the Hermosa neighborhood on the Northwest Side, Alfaro said.\nThe man was walking on a sidewalk in the 4400 block of West Palmer Street when a gray-colored sedan pulled up and a gunman fired shots, Alfaro said.\nThe man was shot in the left leg and was taken to Community First Medical Center where his condition stabilized.\nAround 8:10 p.m., a 17-year-old male was wounded in a shooting in the Lawndale neighborhood, Alfaro said.\nThe teen was walking with two other people in the 1600 block of South Springfield Avenue when he heard gunfire and realized he'd been shot, Alfaro said.\nHe was struck in the right buttocks and was taken by a relative to Mount Sinai Hospital where his condition stabilized.\nAt 6:35 p.m., two men were shot in the 7000 block of South Honore Street in the West Englewood neighborhood, police said. An 18-year-old and a 19-year-old each had graze wounds to the leg, police said.\nThe men were in a parked car when another vehicle drove up and someone inside began firing, Chicago police spokesman Thomas Sweeney said. Both were taken to Holy Cross Hospital.\nAround 6:30 p.m., a 21-year-old man was wounded in the South Austin neighborhood, Alfaro said.\nThe man was standing in the front yard of his home in the 5000 block of West Ohio Street when an unknown man fired shots, striking him. The gunman fled, Alfaro said.\nThe man was hit in the back and taken to Mount Sinai where his condition stabilized, Alfaro said.\nIn the Back of the Yards neighborhood about 4:30 p.m., a 22-year-old man was wounded in the arm in a gang-related shooting, police said.\nHe was in an alley near 50th and Wood streets when he heard gunshots and realized he'd been struck, police said. When he turned around, he saw a yellow four-door vehicle driving westbound on 50th Street, police said.\nHe was in good condition at Mount Sinai Hospital with a wound to the arm, police said. The man is a documented member of the Satan Disciples street gang, according to police.\nAt the scene, police found one shell casing and one unfired bullet.\nEarlier, a 22-year-old man was in serious condition after being shot in the abdomen and arm about 10:30 a.m.\nHe was in an alley in the 300 block of West 42nd Street in the Fuller Park neighborhood on the South Side when someone shot him, police said. The man was taken to Northwestern Memorial Hospital, according to police."}