{"uri": "http://www.nydailynews.com/news/national/chicago-deacon-grandson-wounded-family-couch-report-article-1.2144578", "title": "Chicago deacon killed, 3 wounded in apparent gang-related gun battle: report", "dct": "Tue, 10 Mar 2015 17:27:00 GMT", "id": "2baba97f388b2c1ec37e5f05f8628bb2", "content": "A Chicago church deacon was gunned down on his couch as bullets ripped through his family’s home.\nOdell Branch Sr., 77, was settling in for ice cream and westerns with his 5-year-old great-grandson on Monday when the gunfire erupted, killing him and grazing the boy’s arm, the Chicago Tribune reported.\n“They took my soul,” Branch’s wife, Irene Branch, told reporters gathered on her doorstep. “I can’t help but be angry.”\nThe bullets also shattered a mini van's windows and wounded a mother and her 2-year-old son who were outside the house.\nThe toddler was shot in the right shoulder, ABC 7 reported.\nIt was a quiet evening before the 6:30 p.m. shooting.\nIrene Branch had just returned from the store when bullets rained through the family’s door, inches below a “Stop Killing People”sticker. Relatives dived for safety, and Branch never got up.\n“They said, 'Dad, dad,' and he didn't move,” Irene Branch told the Chicago Tribune. “And they touched him, and they saw blood, and they called the paramedics.\n“I felt him — I believe he was gone, right there on that floor.”\nThe 2-year-old was in critical condition, and his mother was in stable condition, the paper reported.\nPolice suspect the victims were caught in the crossfire of rival gangs, CBS Chicago reported. Branch’s grandson may have been with the second group, which returned fire, according to the station.\nPolice detained several people while investigating the attack but hadn’t filed any charges.\n“They took my husband’s life,” Irene Branch told WGN-TV. “Oh my God.”\nON A MOBILE DEVICE? SEE THE VIDEO HERE."}