{"uri": "http://www.holyokeenterprise.com/news/local-news/krieger-shot-in-arm-in-gun-range-misfire-GE82671", "title": "Krieger shot in arm in gun range misfire", "dct": "Wed, 26 Oct 2016 00:00:00 GMT", "id": "fe6590bc4e2c59adf7cb25a5a6c9588f", "content": "Life can change in an instant, as Jeremiah Krieger, pastor at First Baptist Church in Holyoke, can attest. In a fluke accident at the Phillips County Gun Range south of the Phillips County Landfill the afternoon of Saturday, Oct. 22, Krieger was shot through the right forearm after a neighboring shooter’s weapon misfired.\nKrieger had only meant to make a brief stop at the gun range to make sure his gun was in working order after a minor repair in Denver.\nDrew Wills, who was with Krieger at the time of the incident, said Krieger was at the shooting table looking through his scope when the shooter to his right must have experienced a hang fire, meaning there was a delay between the pull of the trigger and actual firing of the weapon. The individual turned his weapon to inspect it, and that is when it discharged, shooting a field-point bullet through Krieger’s right forearm.\nIn the position one would hold a gun to look down the scope, the crook of the right arm is very close to the rest of the body. “It’s pretty wild,” said Krieger, a father of four. “If it was the head or chest, that could have changed the whole story.”\nThe shot was from a 9-millimeter pistol, according to Wills. He said it was fortunate that it was not a hollow-point bullet that would have expanded upon impact and caused far more damage to the arm.\nKrieger underwent a surgery that was several hours long over the weekend, coming out with a plate and eight screws to repair a shattered radial bone. The shot hit a vein and shattered the bone but missed the artery and any major nerves in the arm.\n“It was the scariest thing in my life,” said Wills. Watching the scene unfold from behind the neighboring shooter, Wills said Krieger seemed just as confused and shocked as anyone else when the misfire took place, crying out “how could this have happened?” in pain.\nStill, Wills was impressed by how professionally Krieger handled the situation. “He stayed really calm about it and kept talking. He knew what to do.”\nA former nurse for 13 years, Krieger immediately told the young man whose gun had misfired (whose name has not been released) that he needed a tourniquet. The man took off his own shirt to be tied around Krieger’s arm.\nThe pastor also told Wills to take his cellphone from his pocket and call 911, his wife Samantha Krieger and Sgt. Mark Werts. He also had Wills move his truck from in front of the gate where it was parked so an ambulance would be able to get by.\nWerts and Officer Joe Marcum were soon on the scene to give emergency medical care, and Werts tied a real tourniquet around Krieger’s upper arm. By this point, the young man whose gun had misfired was vomiting, according to Wills.\nMeanwhile, Samantha had been preparing for their son’s eighth birthday party when she got the call. “The first word I heard was ‘shot,’ so that was pretty traumatic,” she said.\nAn ambulance soon arrived to take Krieger to Melissa Memorial Hospital, where a Med Evac helicopter was called to take him to Greeley’s North Colorado Medical Center. However, in another twist, warning lights came on in the helicopter, so Krieger had to travel to Greeley by ambulance instead. Samantha said it was nerve-wracking knowing the pain he was in for the long trip.\nUpon arrival at NCMC, Krieger was admitted into the emergency department and went straight into surgery.\n“I’ve really felt the presence of God,” said Krieger. As of Monday, Oct. 24, Krieger still had yet to regain feeling in his right thumb and index finger but said he has been in good spirits and is grateful to be alive. He was discharged Tuesday, Oct. 25, and is expected to be out of a cast in four to six weeks.\nKrieger and his wife both expressed great appreciation for the prayers and support of their community, neighbors, friends, church family and the staff caring for Krieger at the hospital.\nAs for the young man whose weapon misfired, the Phillips County Sheriff’s Department was still investigating the case as of Monday, and Sheriff Rob Urbach said that charges were still pending. A citation had been issued but could possibly be amended by the District Attorney’s Office."}