{"uri": "http://wfla.com/2017/01/24/4-year-old-child-injured-from-shooting-in-tampa/", "title": "Hillsborough deputies: 4-year-old child shot himself in chest after finding unsecured gun", "dct": "Tue, 24 Jan 2017 09:42:00 GMT", "id": "17c7ff457a6857f5908ecb18b275d3c3", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nTAMPA, Fla. (WFLA) — The Hillsborough County Sheriff’s Office said a child was shot once in the chest in Tampa Tuesday morning.\nOfficials said the little boy was home with his mother’s boyfriend, Akia Thomas, at the time of the incident. His mother was taking the other two children in the home, ages one and six, to school.\nDeputies arrested Thomas for felony possession of a gun. Officials are currently trying to obtain a search warrant for the home.\nThe gun is a stolen .38 Taurus handgun.\nDeputies believe that the child grabbed the firearm he found unsecured underneath a dresser and accidentally shot himself in the chest.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nThomas has 24 prior felony charges, including drug charges, and has five felony convictions.\nThe child was transported to St. Joseph’s Hospital. The boy underwent surgery and is now in stable condition.\nNeighbors in the area claim there are too many guns in the community that are left unattended with children.\n“Our law enforcement, they do their job. But, they can’t be everywhere at one time. So, if you do have a gun, I pray to God that you lock it up,” says neighbor Melvin Hicks.\nThe Sheriff’s Office said the shooting happened at the gated Key Vista Apartments, located at 12536 Tinsley Circle in Tampa.\nThomas faces charges of possession of a weapon by a convicted felon, possession of ammo by a convicted felon, unsafe storage of a firearm and possession of cocaine.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}