{"uri": "http://www.wbrc.com/story/32144825/3-shot-suspect-dies-following-officer-involved-shooting-in-eufaula", "title": "UPDATE: 3 shot; suspect dies following officer involved shooting in Eufaula", "dct": "Sun, 05 Jun 2016 15:11:00 GMT", "id": "cd25ac1addec14e8f0606aa964052b57", "content": "EUFAULA, AL (WTVM) - Three people were shot in separate locations and a suspect was killed Saturday morning in Eufaula.\nAt 7:54 a.m. officers received a report that an individual was shot at Level Acres Mobile Home Park.\nOnce they arrived on the scene, police confirmed that a 2-year-old girl had been shot in the leg and Demarco Rhymes, 35, of Eufaula was named as a suspect.\nAccording to reports, Rhymes left Level Acres after shooting the 2-year-old and went to Davis Street where he shot a 42-year-old female. He then allegedly proceeded to Norman Street where a 39-year-old man received multiple gunshot wounds.\nEufaula Police officers first made contact with Rhymes near Zion Church where he fired shots at the officers. During the vehicle and foot pursuit, Rhymes continued to fire at the officers.\nIn order to stop the imminent deadly threat posed by Mr. Rhymes, the officers employed deadly force.\nRhymes was pronounced dead at Medical Center Barbour. No officers were injured in the incident. Pursuant to the Eufaula Police Department’s established policy, the officers involved have been placed on paid administrative leave.\nThe 2-year-old was taken by jet to Birmingham. The other two victims were transported to hospitals in Dothan in critical condition. Investigation of the officer involved shooting has been turned over to the Alabama State Bureau of Investigation.\nThe other shootings remain under investigation by the Eufaula Police Department. Preliminary reports indicate domestic disputes involving multiple parties as a possible motive for the shooting rampage by Mr. Rhymes.\n“Our prayers are with the victims, officers and all those affected by this incident. Our highly trained officers are prepared to address such incidents and I commend the officers who responded and deployed their training both effectively and efficiently this morning,” Chief Steve Watkins said.\nCopyright 2016 WTVM. All rights reserved."}