{"uri": "http://www.wthr.com/article/children-at-home-during-officer-shooting", "title": "Officer accused of shooting detective extradited to Indianapolis", "dct": "Mon, 01 Aug 2016 21:13:00 GMT", "id": "4b6f974b385941aafbb94a303c8e0392", "content": "INDIANAPOLIS (WTHR) - An IMPD officer accused of shooting a detective at the home of his estranged wife has been extradited to Indianapolis to face charges.\nCourt records show that two children, ages two and seven years old, were at Officer Adrian Aurs’ estranged wife’s apartment when he allegedly broke in and opened fire on a fellow police officer Friday night.\nAurs fled to Cincinnati after the shooting. He was returned to Indianapolis Tuesday evening. The 18-year veteran police officer faces a single charge of attempted murder for opening fire and hitting Sgt. Robert Pearsey at least one time in the arm.\n“This case, to this point anyway, is built primarily on civilian witness statements, who observed what happened and on that instance it's no different than any attempted murder case,” said Marion County Chief Deputy Prosecutor Denise Robinson.\nBut it is unusual: one officer opening fire on another. Pearsey was shot while investigating a domestic disturbance. Pearsey is a member of IMPD's special investigation unit. He was at the residence in relation to a domestic violence report involving Aurs and his wife, who are in the process of divorcing. Legal experts were surprised by the charge of attempted murder.\n“We have to show, in an attempted murder charge, that at the time the shots were fired, the shooter acted with specific intent to kill and that does make it one of the more difficult charges in Indiana to prove,” said Robinson.\nBut they say Aurs knew what he was doing.\n“He fired multiple shots, that he certainly, as a police officer, but even as a civilian, a police officer would certainly know the ramifications of shooting someone multiple times,” said Robinson.\nAnd while some have suggested a special prosecutor or judge from another county might be necessary because of potential conflicts of interest, at this point, the case will be prosecuted in Marion County.\n“He's a person just like any other person and it's a crime just as would be any other crime that is an attempt murder crime,” said Robinson.\nAurs faces up to 40 years in prison if convicted of attempted murder.\nHe has been suspended from IMPD without pay. The department has recommended to the police merit board that he be fired."}