{"uri": "http://www.wthr.com/article/impd-officer-wounded-in-south-indianapolis-shooting", "title": "Off-duty IMPD officer in custody for shooting IMPD detective", "dct": "Sat, 30 Jul 2016 03:35:00 GMT", "id": "aede3cdd99c343ce747c8a0281247ff0", "content": "INDIANAPOLIS (WTHR) - A Metro Police officer is in custody for allegedly shooting a fellow officer at a south Indianapolis home.\nThe shooting happened shortly after 9 p.m. Friday on Valley Brook Way, which is near Southport and Emerson.\nPolice say an IMPD detective was investigating a domestic violence allegation between Adrian Aurs, an 18-year veteran of the department, and his estranged wife. Police say Aurs came back to the residence while the detective was speaking with the wife and opened fire.\nThe detective was struck by at least one gunshot and returned fire, but did not hit Aurs, who fled. The detective -- a 20-year veteran -- was taken to the hospital in good condition and is expected to be okay.\nAurs got away and made his way to Cincinnati in his personal vehicle. Sources say he made two phone calls - one to a fellow officer and one to his mother, who tried to calm him down. He wound up on the Brent Spence Bridge with a gun shortly after 12:30 a.m. Traffic was stopped for more than an hour as police investigated, eventually taking the 42-year-old into custody.\n\"Through cooperation efforts with Indianapolis and Cincinnati, we believe he was heading this direction, so we notified local authorities and the Ohio State Police and they were able to locate the vehicle accordingly based on the description of the vehicle and the plate number that we gave them,\" said IMPD Sgt. Steve Fippen.\nMetro Police detectives went to Cincinnati Saturday morning to begin the process of bringing Aurs back to Indianapolis. He is expected to arrive back in Indy sometime next week, when he'll face an attempted murder charge.\nAurs' assigned police vehicle and duty belt have already been recovered. He was immediately suspended without pay pending termination from IMPD.\nThis was the second time in less than a week a Metro Police officer was shot.\nThe Indianapolis Fraternal Order of Police issued a statement about the situation which said, in part, \"The actions of the criminal suspect in this matter do not represent the values and ethos of the women and men of our organization or our policing profession. We are confident the full measure of the applicable laws will be utilized to ensure proper justice is fulfilled. Our thoughts are with all the families involved, especially the children.\"\nThat's just who neighbors of Aurs' estranged wife were thinking about Saturday after learning details of the gun battle that happened in their apartment complex.\n\"To be shooting like that, it's just lucky he just got hit the one time and nobody else got hurt in any of the apartments,\" said neighbor Paul Lopez.\nPolice say Aurs' children witnessed it all.\n\"I feel for the kids having to see that,\" Lopez added. \"And I'm just glad none of them are hurt and the detective that showed up wasn't hurt any worse than he was.\"\nOfc. Aurs' history\nAurs has been in the news several times during his career.\nIn 2003, a suspect shot him after a car chase ended in a shootout. His life was saved by a bullet-proof vest. Afterward, he spoke to state legislators about the importance of life saving vests.\nOne year later, he was arrested for OWI. He pleaded guilty and served probation.\nIn 2008, he was hailed as a hero when he and other Metro Police officers helped pull a woman from a burning car. Their bravery was later recognized by the Red Cross, who inducted them all into their Hall of Fame the following year.\nFinally in 2012, a 78-year-old driver died on the west side when he ran a stop sign and hit Aurs' car. A blood test revealed Aurs' blood alcohol level was .05 at the time. Prosecutors did not file charges against him in that instance saying he was within the legal limit and the other driver was at fault.\nWLWT-TV contributed to portions of this article."}