{"uri": "http://www.fresnobee.com/news/local/article111892927.html", "title": "In tragic accident, deputy fatally struck by bullet from colleague’s gun, sheriff says", "dct": "Tue, 01 Nov 2016 14:28:00 GMT", "id": "cfeadcc36194da651de8909d7aa9b7a3", "content": "A bullet fired accidentally from a colleague’s gun fatally struck in the chest a sergeant with 20 years in law enforcement, an emotional Fresno County Sheriff Margaret Mims said Tuesday.\nMims identified the sergeant, who died shortly after the incident, as Rod Lucas, 46, a husband and a father of four.\nThe gun went off as Lucas and three colleagues gathered Monday afternoon in a room at the sheriff’s special investigations unit office near Fresno Yosemite International Airport.\nAt a news conference Tuesday afternoon, Mims said Lucas and a colleague, described only as a detective, were discussing safety of backup weapons when the detective’s gun went off.\nLucas died later at Community Regional Medical Center. Mims said staff in the investigations unit are plainclothes officers who investigate crimes such as narcotics and vice. No one was wearing a bulletproof vest.\n“He was truly a leader in the best terms I can describe,” Mims said of Lucas, who joined the Sheriff’s Office in September 1996. “He was the sergeant that people wanted to work for.”\nLucas is the 12th sheriff’s deputy killed on duty since the office’s inception in 1856.\nThe incident still is being investigated. Mims said the detective whose gun went off has not been interviewed, nor had the sheriff spoken to him, “because of his mental state,” she said.\nPlease pray for us.\nMessage Sgt. Rod Lucas’ wife asked Fresno County Sheriff Margaret Mims to pass along\n“We’re giving him the time he needs,” said Mims, who declined to identify the detective by name. “We’re taking care of him.”\nThere was no disagreement or argument occurring when the gun went off, Mims said. “There was nothing like that going on. We have no reason to think it was anything but an accident.”\nThe sheriff said Lucas’ death, coming less than two months after two correctional officers were shot in the jail lobby in early Septermber, hit the office hard.\n“We’re grieving,” she said.\nfacebook twitter email Share\nProcession for Fresno County sheriff's deputy who died after accidental shooting\nA procession of law enforcement vehicles travels from Community Regional Medical Center to highways 41 and 99 on Monday, October 31, 2016, for a Fresno County sheriff's deputy who died after being shot accidentally.\nSilvia Flores The Fresno Bee\nThe sheriff said she had spoken with Lucas’ wife, and said she passed along a request: “Please pray for us.”\nFamily man\nLucas grew up in Tranquillity in western Fresno County. He was married and had four children ranging in age from 12 to 28. He had one grandchild.\nLucas was an active member at Riverdale Assembly of God church in Riverdale. Pastor Charles Spencer said Lucas spoke at chapel services for the church’s K-12 school and volunteered with outreach programs in the community’s poorer neighborhoods.\nSpencer recalled an occasion when the sheriff’s office brought in its dog unit for a demonstration and Lucas put on the protective gear. “They had the dog chase him down. He would say, ‘I really hate to do this. It’s not fun.’ But he did it for the families.”\nSpencer said several Fresno County sheriff’s chaplains attend his church, including his son-in-law. Spencer’s daughter and son-in-law taught Lucas and his wife in an adult Bible study class every Sunday and took the news very hard, he said.\n“He was a stable gentleman – faithful,” Spencer said. “Everyone in the church looked up to him.”\nSunday’s service would likely center around Lucas, Spencer said. The church typically has around 450 attendees each week.\n“His life is in harm’s way all the time, but to have an accident like this happen – it affected me and my family very much,” Spencer said.\nBoxing gold medalist\nLucas was athletic, playing football at least through community college (he was on the 1990 roster at then-Kings River, now once again Reedley College) and winning a gold medal in boxing at the 1997 California Police Summer Games in Fresno.\nFresno police Chief Jerry Dyer released a statement shortly after Tuesday’s news conference:\n“On behalf of the Fresno Police Department, I would like to offer my condolences and ongoing support to the Fresno County Sheriff’s department over the tragic loss of Sgt. Rod Lucas. Rod was a godly man with a reputation for being a great cop. He will be sorely missed in the law enforcement community and by those he worked with. My thoughts and prayers are with the sheriff’s department, as well as Rod’s wife, children, and parents.”\nAt the news conference, Fresno County Supervisor Buddy Mendes said Lucas and his family lived in a tight community. Mendes said he knew Lucas’ mother, and learned of the connection when he went to Community Regional hospital Monday night.\nAs the news conference ended, several sheriff’s staff in attendance hugged each other.\nJim Guy: 559-441-6339, @jimguy27 Rory Appleton: 559-441-6015, @RoryDoesPhonics\nHow to help\nAnyone wishing to offer financial help to the family should send it to:\nFresno Deputy Sheriff’s Association\n1360 Van Ness Ave., Fresno CA 93721\n(Place “Rod Lucas” in the memo field)"}