{"uri": "http://www.news9.com/story/34150049/man-shoots-teen-burglarizing-mobile-home", "title": "Man Shoots Teen Burglarizing Mobile Home", "dct": "Thu, 29 Dec 2016 22:48:00 GMT", "id": "1e6c745eee668763ffe5a9e2bfb037f7", "content": "OKLAHOMA CITY -\nA 17-year-old boy was shot in the shoulder after a man found him breaking into a mobile home near SE 89th St. and Bryant Ave.\nPolice say the teen, identified as Camron Atkinson, is suspected in other mobile home break-ins.\nIt all happened in the middle of the afternoon on Tuesday at the Burntwood mobile home park. According to police, there were at least two homes that had their doors kicked in.\nPolice tell News 9 it was a very observant kid who noticed his grandmother's mobile home door was wide open. So he went to get his father, who then grabbed his gun and went to investigate. And when the dad of that young kid went to check out grandma's home, he found a stranger standing in the kitchen.\n\"He ordered the suspect to stop what he was doing, but the suspect got aggressive and lunched for the homeowner,\" said OKC Police Capt. Paco Balderrama. \"Therefore he discharged his weapon hitting the suspect.\"\nPolice say the teenager ran out of the home and then tried to hide in another mobile home but was found by police and taken to a nearby hospital to be treated for his injuries. Police say the teenager is accused of breaking into several of the homes in the mobile home community and also lived there as well.\nPolice say Atkinson is being charged out of custody because of his injuries. He's accused of at least one count of Second-Degree Burglary.\nSome of the information in this news story may have been provided by law enforcement with the request News 9 inform the public of, and/or assist in locating a person in connection with, a police investigation. News 9 can make no independent verification of the accuracy of the information, photographs and/or video provided to it by police or other law enforcement agencies."}