{"uri": "http://www.clickondetroit.com/news/detroit-police-chief-fight-on-facebook-led-to-3yearold-girls-deadly-shooting/29191582", "title": "Detroit police chief: Fight on Facebook led to 3-year-old girl's deadly shooting", "dct": "Fri, 17 Oct 2014 23:25:00 GMT", "id": "6d2e7d941d1d9c163b215f3ab9fb588f", "content": "DETROIT - Detroit Police Chief James Craig said Friday morning two people are in custody in connection to a shooting which killed a 3-year-old girl and injured three of her family members Thursday afternoon on the city's east side.\nAmiracle Williams was killed when gunfire broke out in front of her family's home on Mogul Street. Four other people were injured in the shooting, including Amiracle's 47-year-old father, Demetrius Williams, and 40-year-old mother, Frieda Tiggs. Tkira Steen, Amiracle's 17-year-old sister, also was hit with the gunfire. The fourth person injured is one of the men in custody.\nSteen is 6-months pregnant, Local 4 has learned. She is in fair condition at St. John Hospital, where Demetrius Williams also is in fair condition and Tiggs is in good condition. Amiracle died at the hospital on Thursday. She was transported by police officers.\n\"The two officers who transported Amiracle to the hospital are struggling,\" said Craig.\nCraig said this started as a fight between two young females on Facebook. It became physical in front of the home on Mogul Street. Demetrius Williams saw the fight and tried to stop it. He was armed with a gun. The fight was between his teenage daughter and another teen. He allegedly was defending his daughter.\nIt's unclear who fired the first shot, but Craig said a 23-year-old man who showed up at the home opened fire on Amiracle and her parents with a TEC-9 semi-automatic handgun. This apparently was in direct retaliation to Amiracle's father shooting a 22-year-old man who was involved in the fight.\nContrary to reports on Thursday, Craig said this did not start as a fight at Denby High School, but instead started on the social media site and spilled over to outside in front of the home.\nThe chief said the shooter and his getaway driver, the 22-year-old man who was shot, both are in custody. He said the shooter was wanted on an out-of-state warrant.\n\"The suspect who we have in custody, the shooter, removed the machine gun and began to fire repeatedly, striking, as I pointed out, five victims including the fatal shooting of the 3-year-old,\" said Craig.\nHe said known gang members were involved in this shooting, but said that doesn't mean this was \"gang-related.\"\n\"It's not gang-related, but gang-involved. Gang-related means two different gangs were involved in a conflict. That's not the case here,\" the chief said. \"It's very upsetting. This was a decision made by a coward.\"\nCopyright 2014 by ClickOnDetroit.com. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}