{"uri": "http://www.nbcdfw.com/news/local/One-Fatality-and-Three-Wounded-During-an-Arlington-Bar-Shooting-251787781.html", "title": "Arlington Shooting Kills Father of 3; Three Others Injured", "dct": "Mon, 24 Mar 2014 15:20:00 GMT", "id": "5178a1b0fb8597dc6d1e25decaf33ab7", "content": "Arlington police are trying to figure out who fatally shot a man and three others at a bar early Sunday morning.\nKetron Nathan, a father of three with a fourth child on the way, was shot and killed early Sunday in a shooting at the Jumbo Pocket Sports Bar and Billiards in the 2700 block of Majesty Drive in Arlington.\nNathan's mother, Cassandra Nathan, confirmed Ketron's death and said another one of her sons, Aleke, was one of three people wounded in the shooting.\nIdentities for the two other injured victims have not yet been released by police.\nPolice at the scene said the shooting happened sometime after a person was kicked out of the bar for having a confrontation with a bouncer.\nCassandra Nathan said her sons are rap artists who went to the bar to try to perform. But when they were told they could not, Ketron went back to his car.\nAleke Nathan said he heard a commotion, so he and his brother ran back inside to see if their girlfriends were OK.\nOfficers said after someone got into a confrontation with the bouncer, the shooting began.\nThe identity of the gunman is not known.\nOn Sunday night, Aleke Nathan was released from the hospital and attended a vigil in his brother's honor. Their mother called on the community not to retaliate with violence.\n\"We just want to cherish Ketron's life,\" said Cassandra Nathan. \"I just want the young people to know — sometimes you just have to think twice about the things you do and the consequences — this could be anybody, anybody. I never thought it would be and my family.\"\nThe Arlington Police Homicide Unit is conducting an investigation to identify the person or people responsible for the shooting. It is still unclear what exactly led to the shooting, police said.\nWhomever shot her son, Cassandra Nathan is ready to forgive them.\n\"I just want to know that I forgive you because I believe in Jesus and if it wasn't for Jesus, I wouldn't be standing here today,\" Nathan said. \"I just want them to know they have an opportunity to repent and change their lives.\""}