{"uri": "http://www.star-telegram.com/news/local/community/fort-worth/article84469317.html", "title": "Fort Worth man found not guilty in fatal Arlington shooting", "dct": "Fri, 17 Jun 2016 16:37:00 GMT", "id": "5430d88c93af9e3387d8ee776039da22", "content": "A 23-year-old Fort Worth man was found not guilty this week in the fatal shooting of an aspiring rapper in the parking lot of an Arlington sports bar two years ago.\nAlvin Bell, 23, was charged with murder in the fatal shooting of Ketron Nathan, 24, of Arlington, on March 23, 2014, at Jumbo Pockets Sports Bar and Billiards.\nThe jury acquitted Bell because of faulty identification procedures, said attorney Christy Jack, who represented Bell with attorney Joetta Keene.\nClub employees had escorted a number of people out of the club in the 2700 block of Majesty Drive after an altercation inside, police said.\nWitnesses reported seeing a man shooting at a group in the parking lot. When the crowd dispersed, Nathan was dead, three people were wounded, and the gunman had fled, police reported.\nJack said the shootout involved multiple factions and multiple firearms. Prosecution witnesses identified Bell after seeing his Facebook photo, she said.\n“Bell was inside the club on the dance floor bringing a pretty girl a drink to celebrate her birthday when shots rang out,” Jack said.\nOne witness had previously denied seeing the shooter at all, Jack said. Another repeatedly told police he would not be able to recognize the gunman, and the final witness admitted being drunk that night and never actually seeing the shooting, Jack said.\nNone of the scientific tests performed linked Bell to the shooting, Christy Jack, defense attorney.\n“Early in their investigation, authorities interviewed an eyewitness who informed police that Bell was not involved in the shooting, and another witness placed Bell inside the club when gunfire erupted outside,” Jack said.\nAlso, she said, “None of the scientific tests performed linked Bell to the shooting.” And other suspects were never investigated, Jack said.\n“The Bell family is overcome with gratitude and relief that their son will not spend one more day behind bars for a crime he did not commit,” Jack said. “This case illustrates how social media, Facebook in particular, has ushered in a new frontier of suggestibility when it comes to eyewitness identification. We are thankful for the jury’s verdicts and that justice was served.”\nProsecutors declined to comment. Arlington police have not identified any other suspects, said VaNessa Harrison, Arlington police spokeswoman.\nCandice Rainwater, Nathan’s sister, said that Nathan was a rap artist and was at the sports bar that night with his brother to see if they could perform. The brother, A’leke Rainwater, 20, of Arlington, was wounded, she said.\nNathan was the father of three sons and had another baby due at the time of his death, a relative said.\nThis report includes material from the Star-Telegram archives.\nMitch Mitchell: 817-390-7752, @mitchmitchel3"}