{"uri": "http://6abc.com/news/dozens-attend-vigil-for-shooting-victim-tyhir-berry-/1655066/", "title": "Dozens attend West Philadelphia vigil for shooting victim Tyhir Berry", "dct": "Tue, 13 Dec 2016 00:00:00 GMT", "id": "269a853b691f645f61e22b055ef0bee5", "content": "WEST PHILADELPHIA (WPVI) --\nDozens attended a vigil Tuesday night in West Philadelphia to remember a young man shot and killed just weeks after his 17th birthday.\nApproximately 100 people gathered in the 100 block of North Dewey.\nThey brought candles, balloons and posted pictures of 17-year-old Tyhir Berry on a piece of plywood.\n\"He just celebrated his 17th birthday. Nobody would have thought it would be Ty on a board with balloons and candles and the news and all, all these people out here,\" friend Latifa Kepper said.\nIt was just after midnight Monday that Berry, an 11th grader at Strawberry Mansion High, was gunned down as he stood at the corner of 60th and Market while on his way to visit his sister.\nInvestigators believe two people fired at Berry and that he was targeted for some reason.\nThey later fled in a white SUV.\nHis mother, who did not want to show her face on camera, implored those responsible to turn themselves in.\n\"I'm very heartbroken and I wish whoever did it to come forward because my son was a good boy,\" Tyhir's mother said.\nShe and others say they have no idea who would want to shoot and kill Tyhir.\nMeanwhile, his brother-in-law Poo Harley condemned the vicious cycle of violence on the streets of Philadelphia that never seems to end.\n\"We kill each other, get t-shirts made, put up pictures and on to the next one. Over and over and over again. We are just wiping each other out, man,\" Harley said.\nAnd yet, no sooner did the vigil end, an 18-year-old was shot twice in the neck a couple blocks from where Berry was killed.\nThe teen is in stable at Penn Presbyterian Medical Center.\nIt is unknown at this time if the shootings are related.\nTuesday night's vigil ended with several dozen balloons released into the chilly night sky.\nPolice were questioning several people in connection with the killing, but so far, no arrests have been made."}