{"uri": "http://www.cbs46.com/story/29334909/man-arrested-for-shooting-child-in-the-head?autostart=true", "title": "Man arrested for shooting his 10-year-old brother", "dct": "Tue, 16 Jun 2015 20:18:00 GMT", "id": "6a14d48b999cfff541c265d578529046", "content": "DEKALB COUNTY, GA (CBS46) -\nPolice arrested a man after they say he shot his 10-year-old brother in the head and lied about it, initially claiming the child shot himself.\nTyderris Cash, 24, was arrested for shooting 10-year-old DeShawn Beedles.\nAccording to a police report, officers responded to a home in the 2600 block of Embarcadero Drive in Lithonia, which is about 18 miles east of downtown Atlanta.\nWhen the officer arrived, he said he saw Beedles lying on his back in a breezeway with Cash kneeling over him, applying pressure to a gunshot wound on the left side of his forehead.\nCash continued to provide pressure to the wound until emergency crews arrived, according to the incident report.\nAn officer said in the incident report that Cash claimed his brother was playing with a hand gun when he shot himself. Police later confirmed that was a lie and that Cash shot his brother.\n\"Every time I see him out, he waves, always smiling, always riding his skateboard up and down the street,\" said Deshawn's neighbor Bart Washington. \"I love him, he has me laughing all the time.\"\nCash has been charged with reckless conduct, tampering with evidence, cruelty to children and possession of a firearm by a convicted felon. He is currently in the DeKalb County jail.\nBeedles was taken to the hospital after the shooting, last listed in critical condition.\nCopyright 2015 WGCL-TV (Meredith Corporation). All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}