{"uri": "http://www.mdjonline.com/neighbor_newspapers/north_fulton/update-roswell-police-idenitfy-two-bodies-discovered-behind-publix-store/article_74e3444a-a2a0-5092-8953-bca7fa2d8409.html", "title": "Police execute search warrant for Cobb County home in connection to Roswell Publix homicide", "dct": "Wed, 03 Aug 2016 00:00:00 GMT", "id": "0c7a1bf1ce6a33072484535c2c288df0", "content": "Roswell police executed a search warrant at 8 a.m. on a home located on Gilhams Road, off of Mabry Road [in Cobb County], in connection with the homicide investigation in the deaths of [high school students] Natalie Henderson and Carter Davis.\nThe bodies of Henderson and Davis were found behind the Publix grocery store in King Plaza in Roswell on Monday morning.\n\"Roswell in general is a very nice city, so it is very unusual for this to happen,\" said Roswell Police Department Detective Zachary Frommer at a press conference on Monday morning.\nThe identities of the two teenagers were released on Monday afternoon.\nAccording to the initial police report, officers on the scene suspected a relationship-based motive for the crime, but that has not been confirmed.\nFrommer has ruled out one possibility stating, “there is no indication of any drug involvement.\"\nNo suspects have yet to be reported in the double homicide investigation of the deaths.\nPolice did issue a search warrant \"based on information received during the investigation,\" said Frommer.\nCobb County Police were on the scene to assist in the search.\nAccording to police, the residents of the home cooperated with the search warrant.\nFrommer declined to comment on what was removed from the home or if any additional warrants had been issued or executed in relation to this case.\nHenderson and Davis's connection to the home has yet to be established.\nCharlene Kurkjian, a neighbor, described what she has seen around the house, but did not recall any occurrence of late night activity.\n\"I am happy that Roswell police are starting to find something that fast, I believe it is positive that they are on top of [the case] and that they are being aggressive to find out what happened to these kids,\" Kurkjian said.\nAnother neighbor, who wished to remain unidentified was \"surprised and shocked\" to see this in her \"quiet neighborhood.\"\nShe has resided in her home since 1988 and believed the family moved into the home sometime thereafter.\nThe same neighbor recalled seeing children in and out of the home throughout the years, she believed that all, but one of the children are adult age and have moved out of the home.\nShortly after the search concluded, a woman was seen consoling a crying teen-aged girl, both were walking towards the front door of the home.\nNo information has been released that could connect the residents to the victims.\nA statement from the Fulton County Medical Examiner was released on Tuesday evening indicating the cause of death of Henderson and Davis.\n\"Each died from a single gunshot wound of the head. The manner of death in both cases is homicide,\" according to a news release.\nHenderson and Davis were both 17 years old and set to start their senior years of high school.\nHenderson was a student at Roswell High School and member of the color guard.\nDavis was a student athlete at River Ridge High School in Woodstock.\nThe administration at both schools have been working to set up counselors and resources for students as needed."}