{"uri": "http://www.actionnewsjax.com/news/top-stories/roswell-pd-executes-search-warrant-at-home-in-connection-to-teens-murder/416403790", "title": "Man charged with murder in deaths of Roswell teens", "dct": "Thu, 04 Aug 2016 07:30:00 GMT", "id": "561bcaf1b6b5b328425d7029a100b1ce", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nROSWELL, Ga. - Police arrested a 20-year-old man Wednesday for the murders of two teens in Roswell.\nJeffrey A. Hazelwood has been charged with two counts of murder for the deaths of Natalie Henderson and Carter Davis behind a Publix supermarket Monday morning.\nPolice say they believe Hazelwood acted alone and they are not releasing any information about a possible motive at this time.\nThey say surveillance video and evidence at the scene, along with cellphone communication and social media ,led them to Hazelwood. He was taken into custody and questioned Wednesday morning. He was then arrested, charged and booked into the Roswell Detention Center. He will be transferred from there to the Fulton County jail.\nThe chief of police would not say whether a murder weapon was recovered or if Hazelwood told them what happened.\nRELATED STORIES:\nAccording to the Fulton County Medical Examiner's Office, Henderson and Davis, both 17, died from a gunshot wound to the head and the manner of death in both cases was homicide.\nDetectives say from the evidence they have at this time, they believe the teens were killed in the parking lot where their bodies were found.\nOfficers say Henderson and Davis were found lying beside their cars.\nPolice say the teens arrived at the shopping center between 2 and 4 a.m. Their parents told officers they thought the teens were still at home in bed.\nSearch warrant executed\nPolice executed a search warrant at a house in an East Cobb neighborhood Wednesday morning.\nThe house is located on Gilhams Road, off Mabry Road in Roswell.\nRoswell police say they searched the home after receiving information about the case.\nInvestigators were at the house for more than three hours looking for evidence. Officers were seen walking out of the home with bags, but did not say what they found inside the home.\nTRENDING STORIES:\nChannel 2’s Tom Jones talked to neighbors about all the police activity in their community.\n\"This is a very middle/upper-class neighborhood. So this is very alarming actually. Even to hear the news but to have this right around in our neighborhood is very surprising,” said neighbor Charlene Kurkjian.\nThe victims\nHenderson was a student at Roswell High School and Davis was a student at River Ridge High School. Both were about to begin their senior years.\n© 2017 Cox Media Group.\nThe families and friends of the teens described them as bright, generous and outstanding students.\nDavis was a beloved lacrosse and football player with a big heart. Hundreds attended a vigil in his honor Tuesday night.\n“He, in many ways, was like a coach on the field. In fact, we sometimes joked and called him Coach Carter,” lacrosse Coach Mike Britt said about Davis. \"Our team is just devastated.\"\nHenderson was an honor-roll student with a passion for music and a thirst for life.\n\"Our beautiful shining girl: Natalie, a rising senior at Roswell High School, was smart, funny, sassy, and strong, a free spirit with a gorgeous smile that could make your day or your week. She was a leader in the award-winning Color Guard of the Roswell High School Band, a life guard for Swim Atlanta, a talented singer, a guitar player, and a lover of animals who volunteered countless hours to animal rescue. Natalie had a loving heart and an infectious zest for life. Unusual for one so young, she had the courage to always be, unapologetically, herself. Natalie will forever be loved and missed by all whose lives she touched,\" Henderson's obituary reads.\nHenderson's funeral will be held Friday at 10 a.m. at Roswell Presbyterian Church.\nThe suspect\nHazelwood, 20 , lived in Roswell with his grandparents.\nHe worked at Michaels in Roswell, but the manager there says he is no longer employed and referred Channel 2's Nefertiti Jaquez to the company's media relations line. We have not heard anything back from them.\nOne neighbor who's known Hazelwood since he was young says she couldn't believe Jeff was capable of hurting anyone.\n\"It's just hard to believe. I just don't picture Jeff doing that,\" she said.\nShe said he was always kind and sweet-hearted towards her.\n\"Quiet, polite and just a nice kid,\" she said.\nPolice have not released any sort of connection between Hazelwood and the victims.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\n© 2017 Cox Media Group."}