{"uri": "http://www.ajc.com/news/local/arrest-warrants-issued-for-tex-mciver-shooting-his-wife/ZAFjkWsjMupVrD8MHrm5SO/", "title": "Tex McIver surrenders at Fulton jail after being charged in wife’s death", "dct": "Thu, 22 Dec 2016 00:00:00 GMT", "id": "cf3cdfacbc8f000c347449d2207ace14", "content": "Atlanta attorney Claud “Tex” McIver turned himself in at the Fulton County jail Wednesday night after Atlanta police charged him with involuntary manslaughter and reckless conduct in the shooting death of his wife, businesswoman Diane McIver.\nMcIver shot his wife in the back as the couple rode in their SUV near Piedmont Park, late on the night of Sept. 25. He was in the back seat and she in the front when his .38-caliber revolver discharged. She died later that night at the hospital.\nMcIver has said the shooting was an accident. Atlanta police have been investigating for the better part of three months.\nThe involuntary manslaughter charge is a felony, police said. The reckless conduct charge is a misdemeanor.\n“This has completely destroyed his life,” John “Spike” McIver, Tex’s brother, told The Atlanta Journal-Constitution this morning. “This was his life mate. They were inseparable. This was a horrible accident.”\nSpike McIver said his brother called him last night to say that he’d heard the warrants were being issued and that he was trying to arrange for booking at the jail.\n“He’s very depressed about it,” McIver said of his brother. “He keeps getting hit over and over from one direction and another. ... He’s upset that this is occurring on Christmas week. They could’ve waited, but they work in strange ways.”\nMcIver’s attorney, Steve Maples, told the AJC that the charges don’t make sense to him.\n“We’re very, very disappointed,” Maples said. “We feel it was an accident. Hopefully the grand jury would dismiss it when they hear the evidence.\n“He was not doing anything in a reckless or negligent manner.”\nHe described his client as “very, very embarrassed and very, very humiiliated” by the charges. “Tex said this was the second worst day of his life,” Maples said.\nHe also noted that neither of the charges suggest that McIver had any malice toward his wife nor intent to cause her harm.\nAndrew Ward, a longtime friend of McIver’s, said Wednesday that the couple adored each other.“\nThis was a tragic accident. If it has to go through court to prove that, so be it,” said Ward, who has known McIver for more than a decade. “He meant no harm to Diane. … I would not hesitate to be a witness in court to support their wonderful relationship.”\nThursday will be McIver’s 74th birthday, his lawyer said.\nTIMELINE\nFebruary 27, 1990: Three teenagers accuse Claud “Tex” McIver of firing shots into the air and into their Ford Mustang outside his DeKalb County home.\nMay 1990: Tex McIver is indicted in DeKalb County on three counts of aggravated assault as well as other lesser charges in the shooting incident. Prosecutors would go on to drop the case after the parties decided to settle privately.\nJuly 31, 2000: Tex McIver and his first wife are divorced.\nNovember 2005: Tex McIver and Diane Smith are married.\nSept. 25, 2016: Tex McIver shoots Diane in their SUV near Piedmont Park. She dies early the next morning at Emory University Hospital on Clifton Road.\nSept. 26, 2016: An autopsy performed on Diane McIver determines she died of a gunshot wound to the back. The medical examiner declares the incident a homicide.\nSept. 30. 2016: Bill Crane, a spokesman for Tex McIver, says the lawyer shot his wife accidentally after the Ford Expedition they were riding in hit a bump. Crane told The Atlanta Journal-Constitution the McIvers became alarmed and took their .38-caliber revolver from the console after individuals approached the vehicle. Crane said the McIvers were also worried about unrest surrounding recent Black Lives Matter protests in the area.\nOct. 6, 2016: In his first public comments on the case, Tex McIver tells The AJC that the shooting was an accident. McIver’s lawyer, Stephen Maples, also says some details provided by Crane about the night of the shooting were wrong. Maples said there was never a concern about Black Lives Matter. And he disputes that the gun went off after the SUV struck a bump. Instead he says Tex McIver was startled awake and the gun, which was in his lap, went off.\nOct. 24, 2016: State Sen. Vincent Fort, D-Atlanta, issues a letter to Senate leaders calling for the removal of Tex McIver as vice chairman of the state Board of Elections.\nNov. 2, 2016: Dani Jo Carter, a friend of Diane McIver who was driving the couple the night of the shooting, speaks for the first time. Carter says the SUV was stopped when the gun went off."}