{"uri": "http://www.ajc.com/news/local/atlanta-attorney-accidentally-shot-wife-back-report-says/1pA2ZtJkQI94xnIr9J0zcL/", "title": "Atlanta attorney says gun in his lap went off, striking his wife", "dct": "Fri, 30 Sep 2016 00:00:00 GMT", "id": "ea194d69e019d70cf97445399e4bbe2e", "content": "Atlanta lawyer Claud “Tex” McIver was driving with his wife Sunday night near Piedmont Park when their car hit a bump and a gun in his lap accidentally fired, killing his wife, a family spokesman told The Atlanta Journal-Constitution.\nDiane McIver was taken to Emory University Hospital on Clifton Road and died in surgery several hours later.\nThe incident unfolded after the McIvers vehicle was approached by several individuals near the intersection of Peachtree and Pine streets in Midtown, spokesman Bill Crane, a McIver family friend, said.\nThe McIvers retrieved their gun — a .38 snub-nose revolver — from the center console of the 2013 Ford Expedition, alarmed about recent unrest surrounding several Black Lives Matter protests in the area and fearing a carjacking, Crane told The AJC.\nThe couple, who were being driven by an unidentified individual, left the area unharmed. But several blocks later on Piedmont Ave. near the park, the SUV hit a bump and the gun fired, Crane said. It was still wrapped in a plastic Publix bag in which it had been stored, Crane said.\nCrane said McIver does not remember firing the gun. He was leaning back in the seat and nodding off when they hit the bump, the gun in his lap, Crane said.\nTex McIver was in the SUV’s back seat. Diane McIver was seated in the front passenger seat.\nThe Fulton County Medical Examiner said she died of a gunshot wound to the back that had passed through the seat.\nThe couple had been traveling from their home in rural Putnam County to another in Buckhead. The driver exited at the Downtown Connector at Edgewood Avenue to avoid traffic, Crane said.\n“It’s a tragedy. They are two great professionals, philanthropists,” Crane said.\nCrane said Tex McIver is “under extreme duress. Trauma.”\nCrane said the couple had not been drinking.\nThe Atlanta Police Department has said almost nothing about the case, which involves two prominent residents. They declined to elaborate on Friday.\nThey released an incident report of the shooting on Wednesday, more than two days after officers responded to a call of a gunshot victim at the university hospital.\n“This is one of those situations we’re working through very slowly,” police Sgt. Warren Pickard said. “We want to get it right.”\nThe police report did not list who was in the SUV, other than Diane McIver. An officer talked to the driver, but didn’t include in the report what the driver said. Nor did the report say why the driver took the injured woman to a hospital on Clifton Road, 4 ½ miles away. Piedmont Hospital is less than half that distance from the shooting scene.\nDiane McIver, whom one associate described as “extremely intellectual,” made a successful career as president of Corey Airport Services, an Atlanta-based marketing company.\nHer husband, a partner in his firm, is vice president of the Georgia State Election Board. In August, he assumed another seat on another board. The American Bar Association appointed him to the advisory committee of the association’s Standing Committee on Gun Violence."}