{"uri": "http://www.detroitnews.com/story/news/local/detroit-city/2016/01/28/gang-members-plead-guilty-may-shooting-family-still-sought/79474800/", "title": "4 gang members plead guilty in family attack; 1 sought", "dct": "Thu, 28 Jan 2016 00:00:00 GMT", "id": "0de285f94befc2236321f01aea97f45f", "content": "Four members of the Vice Lords Detroit street gang pleaded guilty to charges in the shootings of four members of a local family, federal officials said Thursday.\nLast year, the U.S. Attorney’s Office in Detroit indicted Antonio Clark, Aramis Wilson, Tyrone Price, Jonathan Kinchen, Kojuan Lee, Kirshean Nelson, Dion Robinson and Kenneth Smith on federal racketeering, or RICO, and firearm charges for the gang-related shooting.\nU.S. Attorney Barbara McQuade said in a press release Thursday that law enforcement agencies are working under a Detroit One partnership to fight gang violence.\n“Gang members should take note that these recent cases demonstrate that the Detroit One strategy is permitting us to address gang violence with swift action and strong penalties,” McQuade said. “If any individual wants to leave gang life, we are here to help them do that safely.”\nFederal authorities say that on May 7, 2015, Clark, Wilson, Price, Kinchen, Lee, Nelson and Robinson went to their intended victims’ homes where Clark opened fire with an AK-47, wounding four people. The others, reads the indictment, aided and abetted.\nActing at the direction of Smith and others, the defendants were looking for two brothers who had left, or had tried to leave, the gang. The plan was to harm the brothers.\nThe four victims are recovering.\nThe indictment also charges that the defendants sold drugs and narcotics across Detroit, including at the now-shuttered Northland Mall in Southfield.\n“The significant arrests and prosecutions made by Detroit One make certain that the citizens of Detroit and the region can once again start to feel safe in their communities,” Detroit Police Chief James Craig said. “We will maintain our focus and remain steadfast in our pledge to bringing swift justice to all those who commit violent acts against our city.”\nThe Vice Lords is a national gang engaged in crime in Chicago and Detroit, according to federal officials.\nFour of the six suspects pleaded guilty to numerous charges this week.\nWilson, aka “Ace,” 25, of Detroit pleaded guilty Monday to two counts of assault with a dangerous weapon in aid of racketeering and one count of use and carry of a firearm during, and in relation to, a crime of violence. The firearm charge is a mandatory minimum 10-year prison sentence.\nNelson, 19, of Detroit pleaded guilty Tuesday to one count of RICO conspiracy.\nOn Wednesday, Clark, aka “Cheeto,” 26, of Detroit pleaded guilty to two counts of attempted murder in aid of racketeering. He also pleaded guilty to one count of use and carry of a firearm during, and in relation to, a crime of violence.\nLee, aka “Juan,” 20, of Detroit and Kinchen, aka “Deago,” 22, of Detroit each pleaded guilty Thursday to one count of RICO conspiracy.\nAlso Thursday, Price, 27, of Detroit pleaded guilty to two counts of assault with a dangerous weapon in aid of racketeering and one count of use and carry of a firearm during, and in relation to, a crime of violence.\nRobinson is expected to plead guilty next week on certain charges. Smith is a fugitive. Anyone with information on his whereabouts should call (313) 234-5656."}