{"uri": "https://www.justice.gov/usao-edmi/pr/six-vice-lords-plead-guilty-rico-conspiracy-and-gang-related-shootings", "title": "Six Vice Lords Plead Guilty to RICO Conspiracy and Gang-Related Shootings", "dct": "Thu, 28 Jan 2016 00:00:00 GMT", "id": "a2365da1738997dbc5ce886798c820c4", "content": "DETROIT – Six members of the Vice Lords street gang pleaded guilty this week to racketeering and firearms offenses for their roles in the shootings of four members of a family. The guilty pleas are the result of the collaborative efforts of law enforcement and the community to reduce homicide and other violent crime under the Detroit One program. The announcement was made by U.S. Attorney Barbara L. McQuade of the Eastern District of Michigan, Assistant Attorney General Leslie R. Caldwell of the Justice Department’s Criminal Division, Detroit Mayor Mike Duggan, Special Agent in Charge Robin Shoemaker of the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) Detroit Field Division, Special Agent in Charge David P. Gelios of the FBI’s Detroit Division and Chief James Craig of the Detroit Police Department. In 2015, Antonio Clark, Aramis Wilson, Tyrone Price, Jonathan Kinchen, Kojuan Lee, Kirshean Nelson, Dion Robinson and Kenneth Smith, were indicted on charges of RICO conspiracy and other racketeering and firearms charges relating to the May 7, 2015, gang-related shooting of four members of a family. The indictment charges that, from 2011 through 2015, the defendants trafficked in controlled substances, including marijuana, Xanax, and ecstasy, at locations around the Detroit metropolitan area, including in Detroit and at Northland Mall in Southfield, Michigan. According to the indictment, the Vice Lords is a national gang engaged in a variety of crimes, including murder, robbery, narcotics trafficking and witness intimidation. The indictment alleges that the Vice Lords’ leaders are located in Chicago and Detroit, and that the gang is broken down into various “sets,” “decks,” or “branches,” including the Detroit-based Traveling Vice Lords, Insane Vice Lords, Imperial Insane Vice Lords, Conservative Vice Lords, and Mafia Insane Vice Lords. The indictment further alleges that members who seek to leave or withdraw from the gang often endure a physical beating, known as a “beat out,” by multiple Vice Lord members, or are targeted for killing, known as a “green light.” According to court documents, leading up to the May 7, 2015 shooting, members of the Vice Lords, acting at the direction of Kenneth Smith and others, searched for two brothers that had left, or had attempted to leave, the Vice Lords, as part of a plan to harm those individuals. On May 7, 2015, Vice Lords members Antonio Clark, Aramis Wilson, Tyrone Price, Jonathan Kinchen, Kojuan Lee, Kirshean Nelson, and Dion Robinson, traveled together to the intended victims’ house in multiple cars. These Vice Lord members first met at Kenneth Smith’s house to discuss their plans. They gathered firearms, including an AK-47 assault rifle, to assist in their plans. After a brief confrontation with family members, Clark opened fire with an AK-47 hitting four victims. The indictment charged these Vice Lords members with aiding and abetting one another in the shooting of the four family members after firing more than two dozen times at the family. All four victims suffered gunshot wounds, but are recovering. On January 25, 2016, Aramis Wilson, aka “Ace,” 25, of Detroit, pleaded guilty to two counts of Assault with a Dangerous Weapon in Aid of Racketeering, and one count of Use and Carry of a Firearm During, and in Relation to, a Crime of Violence. The firearm charge carries a mandatory minimum sentence of ten years in prison. On Tuesday, January 26, 2016, Kirshean Nelson, 19, of Detroit, pleaded guilty to one count of RICO conspiracy. On Wednesday, January 27, 2016, Antonio Clark, aka “Cheeto,” 26, of Detroit, pleaded guilty to two counts of Attempted Murder in Aid of Racketeering, and one count of Use and Carry of a Firearm During, and in Relation to, a Crime of Violence. The firearm charge carries a mandatory minimum sentence of ten years in prison. On Thursday, January 25, 2016, Kojuan Lee, aka “Juan,” 20, of Detroit, and Jonathan Kinchen, aka “Deago,” 22, of Detroit, each pleaded guilty to one count of RICO conspiracy. Also on Thursday, Tyrone Price, aka “Price,” 27, of Detroit, pleaded guilty to two counts of Assault with a Dangerous Weapon in Aid of Racketeering, and one count of Use and Carry of a Firearm During, and in Relation to, a Crime of Violence. The firearm charge carries a mandatory minimum sentence of ten years in prison. Dion Robinson is expected to plead guilty next week on certain charges. Kenneth Smith is currently a fugitive. Anyone with any information about Smith’s whereabouts is encouraged to call 313-234-5656. “The Detroit One partnership is focusing our efforts on combating gang violence,” McQuade said. “Gang members should take note that these recent cases demonstrate that the Detroit One strategy is permitting us to address gang violence with swift action and strong penalties. If any individual wants to leave gang life, we are here to help them do that safely.” \"The significant arrests and prosecutions made by Detroit One make certain that the citizens of Detroit and the region can once again start to feel safe in their communities\" said Chief James Craig. \"We will maintain our focus and remain stead-fast in our pledge to bringing swift justice to all those who commit violent acts against our city.\" S. Robin Shoemaker, Special Agent in Charge of the Detroit Field Division of ATF said, “Countering firearms violence, particularly when it relates to violent street gangs remains one of ATF’s primary missions, when it comes to gun violence ATF will continue to work hand in hand with our Detroit One partners to ensure that those individuals’ who engage in violent criminal activity are removed from our neighborhoods. \"These convictions represent the significant impact law enforcement can have on violent criminal enterprises when local, state, and Federal partners combine forces to address the violent gangs responsible for terrorizing our communities,\" said David P. Gelios, Special Agent in Charge, FBI - Detroit Division. \"The quality of life in our community will remain closely aligned to our successful ongoing collective efforts to remove violent offenders from Detroit's streets.\" The charges relating to the May 7, 2015, shooting of the four family members are one component of the federal government’s prosecution of the Vice Lords street gang, which has led to the arrests and convictions of Vice Lords leaders and members over several years. In two trials in March and May 2015, juries convicted eight leaders and members of the PhantomOutlaw Motorcycle Club, many of whom also were leaders and members of the Vice Lords, for various crimes, including a September – October 2013 mass murder plot against a rival organization of the Phantoms, and the September 2013 shooting ofa member of another rival organization. Among those eight convicted defendants was Antonio Johnson, aka “MT” or “MisterTony,” the National President of the Phantoms and the “Three-Star General” over the Vice Lords in Michigan. On September 8, 2015, Johnson was sentenced to 35 years in prison. Also, on January 13, 2015, Christopher Tibbs, a.k.a. “Chief Fatah,” the leader of the Michigan branch of the Mafia Insane Vice Lords, was sentenced to almost 29 years in prison for his role in helping plan an armed robbery of a Little Caesars restaurant in Redford, Michigan, in September 2013. This case marked the first time that the federal criminal streetgang enhancement was charged in the Eastern District of Michigan. The case is being investigated by the ATF’s Comprehensive Violence Reduction Program, which includes representatives of the Detroit Police, Michigan State Police, and Michigan Department of Corrections, in coordination with the FBI and DEA. The case is being prosecuted by Assistant U.S. Attorneys Christopher Graveline and Mark Bilkovic of the Eastern Districtof Michigan, and Trial Attorney Joseph Wheatley of the Criminal Division’s\nUSAO - Michigan, Eastern"}