{"uri": "http://www.star-telegram.com/news/local/community/fort-worth/article86637622.html", "title": "Gang member arrested in deadly shooting at Fort Worth dance studio", "dct": "Wed, 29 Jun 2016 12:20:00 GMT", "id": "a05a8f6d406b42050838d2eea152e769", "content": "A 19-year-old man has been arrested in the deadly weekend shooting at an east Fort Worth dance studio that police say was gang-related.\nTommy Lee Ward was arrested Tuesday on a murder warrant, jail records show.\nHe was being held in the Mansfield jail with bail set at $500,000.\nHomicide Sgt. Joe Loughman said Ward is a known gang member and that investigators believe the shooting was gang-related. He declined to release more details Wednesday, citing the ongoing investigation.\nThe shooting occurred after midnight Saturday at Studio 74, 2466 E. Lancaster Ave.\nPolice have said an argument broke out at a party being held at the studio. As one person tried to run out of the warehouse, shots were fired.\nfacebook twitter email Share\nDance studio witness describes shooting: 'No, no, not here.'\nJason Moore, a musician who lives on site at Studio 74 near downtown Fort Worth, describes the scene Saturday when shots were fired at the nonprofit dance studio.\nrcadwallader@star-telegram.com\n“An unknown number of people with firearms began shooting at each other outside of the warehouse and from across the street,” police said in a news release.\nTreavon Lewis, 22, and Jordan Larkin, 18, were killed in the shooting. Larkin was a recent graduate of North Crowley High School. Lewis was a 2013 graduate of The Phoenix Academy in Mansfield.\nFive others were injured.\nLoughman it appears that at least one of the dead was targeted in the shooting. More arrests are possible, he said.\nThe owner of the studio and building has told the Star-Telegram that an acquaintance had been holding an unauthorized party there when the shooting occurred.\nCourt records show Ward was sentenced to three years of deferred-adjudication probation in February on a charge of evading arrest.\nA community supervision violation warrant was issued for him Tuesday in the evading arrest case because of his arrest on the murder warrant.\nDeanna Boyd: 817-390-7655, @deannaboyd"}