{"uri": "http://www.wfaa.com/news/crime/6-injured-2-dead-in-shooting-outside-fort-worth-dance-hall/255719569", "title": "2 dead, 5 injured in shooting outside Fort Worth dance hall", "dct": "Sun, 26 Jun 2016 00:00:00 GMT", "id": "b1f7251e86b8b1662288e968da953a27", "content": "FORT WORTH -- Two people are dead and at least five others were injured in a shooting outside a party at a nonprofit dance hall in Fort Worth early Saturday morning.\nThe studio's owner, Laura Reyna, told News 8 that the group never signed a contract to rent the building, located in the 2400 block of E. Lancaster Avenue, and wasn’t authorized to be there.\n\"Nobody was supposed to be here last night,\" said Reyna. \"I was in shock and awe when I got a call.\"\nReyna said Studio 74 is a non-profit dance hall, seven years in the making, aimed at celebrating hip hop culture, serving as a creative outlet, and teaching young people to dance.\n\"We run this place as a family. My kids have built this up,\" said Reyna, through tears.\nAn argument inside Studio 74 dance hall spilled out into the streets just after midnight Saturday, according to investigators.\nAccording to Fort Worth Police, shots were fired as a man tried to run out of the building. Then, investigators say an unknown number of people started shooting at each other outside the building and from across the street.\nThe two killed were identified as Treavon Lewis, 22, and Jordan Larkin, 18, according to the Tarrant County medical examiner’s website.\nJason Moore, who helps take care of the building, said he helped let the group inside around 10 p.m Friday night, without realizing they apparently never signed a contract.\n\"They were charging at the door like it was a legit thing, they had a metal detector at the door and everything,\" said Moore.\nHe also said a DJ brought his own speakers and equipment.\nAt one point, Moore heard multiple gunshots outside, and saw chaos inside.\n\"I saw a dude up here that was struggling with a gun,\" said Moore.\nFWPD said it was called at 12:28 a.m. When officers arrived four minutes later, the shooters had fled the scene.\nThere were no immediate details available on a suspect. Homicide detectives and officers from FWPD's gang unit were investigating to see if the shooting was gang-related.\nA Studio 74 dance performance scheduled for Saturday night in Plano would go on as planned, said Reyna.\n#FWPD says a disturbance inside the Studio 74 dance hall spills outside where 6 people were shot. 2 victims died. pic.twitter.com/jAONFAPy3U\n— Mike Forbes (@mikeforbeswfaa) June 25, 2016\nOn Facebook, Studio 74 posted a statement Saturday morning: “To all studio family, fans and supporters, first I would like to thank all of you for the calls, concerns and prayers that have been sent my way. I’m writing to respond to your concerns in regards to the incident that occurred in the parking lot of Studio 74. We as dance family had no involvement with the incident that occurred last night. Our thoughts and prayers are with the victims and their families. Please continue to pray for them.”\nStudio 74 website describes it at as a place that brings “dance programming to underserved communities and the general public to reach audiences and participants of all ages, abilities, ethnicities, and socio-economic backgrounds.”\nContributing: Robert Cadwallader, Star-Telegram.\nCopyright 2016 WFAA"}