{"uri": "http://accesswdun.com/article/2016/2/367136/charges-shifted-added-in-south-hall-shooting-case", "title": "Charges shifted, added in south Hall shooting case", "dct": "Tue, 02 Feb 2016 00:00:00 GMT", "id": "6fb524b6319fae198960f37f87f93dd4", "content": "A reckless conduct charge filed in a Friday night shooting in the Oakwood area has been dropped on one teenager and added for another as authorities continue to investigate the case.\nThe investigation also led to burglary charges against two people connected to the case, authorities said Tuesday.\nThe shooting happened as a group of teenagers were riding in a vehicle on Candler Highway near Tanner's Mill Road around 8:00 p.m., according to the Hall County Sheriff's Office.\nA female front seat passenger suffered a gunshot wound to her back, apparently at the hands of a backseat passenger who was handling the gun. Authorities Tuesday said the firearm was stolen.\nSergio Salamanca, 17, was initially charged with reckless conduct in the case, but the charge was dismissed, according to a Tuesday media release from the sheriff's office.\n\"After further investigation, it was determined that another passenger of the vehicle in which the teens were traveling, Sergio Canales-Vasquez (age 17, of Gainesville), was in possession of the firearm at the time it was fired and struck the front seat passenger,\" Deputy Chad Mann stated in a media release. \"Sergio Canales-Vasquez was subsequently charged with reckless conduct, making false statements (Felony) and discharging a handgun near a public highway.\"\nAnother passenger, Julisa Canales-Vasquez, 18, has been charged with making false statements (felony).\nSheriff's Deputy Nicole Bailes earlier said the victim was taken to Northeast Georgia Medical Center where she underwent emergency surgery.\n\"The victim is still receiving treatment for her injury,\" Mann said Tuesday.\nThe original suspect in the shooting, Salamanca, allegedly jumped from the vehicle before the group flagged down an Oakwood Police Officer for help. Salamanca had been wanted by the Department of Juvenile Justice for escape. He was arrested later Friday evening.\nInvestigators have since recovered the gun from the shooting and said it was stolen during a previous burglary in the county.\n\"Both Sergio Canales-Vasquez and Sergio Salamanca were listed as suspects in that burglary and an additional burglary in Hall County. Vazquez and Salamanca were additionally charged with two counts of burglary, 1st degree,\" Mann said.\n© Copyright 2017 AccessWDUN.com\nAll rights reserved. This material may not be published, broadcast, rewritten, or redistributed without permission."}