{"uri": "http://www.news4jax.com/news/crime/police-make-arrest-in-connection-with-deadly-landing-shooting", "title": "18-year-old arrested in connection with deadly Landing shooting", "dct": "Mon, 23 Jan 2017 13:20:00 GMT", "id": "681e63705893e4aaeef14164986621a5", "content": "JACKSONVILLE, Fla. - Police have made an arrest in connection with a deadly shooting Jan. 16 in front of The Jacksonville Landing, as sources tell News4Jax that the 16-year-old killed in the shooting drew a gun first.\nKhamoi Petersen died in the double shooting, and a 13-year-old boy suffered non-life-threatening injuries.\nTeen shot at Landing helped dying girl in November shooting\nTyrik Charles Solomon, 18, has been charged with carrying a concealed weapon and is being held on $100,000 bond.\nSolomon was arrested at his parents' home Jan. 18, and the case number, date and incident location on his arrest report match those for the Landing shooting.\n“We know there are a lot of cases out there where no one is ever caught and no one ever comes forward, there’s no evidence ever for anyone. So we’re very happy that someone is in custody,\" said Kalica Lee, Petersen's aunt.\nAccording to investigators, it appeared that a fight escalated into gunfire, which shattered a glass door at the front of the Landing.\nMultiple sources told News4Jax that surveillance video of the shooting showed Petersen drawing a weapon first. Based on shell casings recovered, more than one gun was fired, police said.\n\"Obviously, video evidence is great but it isn’t everything. Different perimeters, different perspectives can change the way people see things,\" explained attorney Randy Reep, an expert on video surveillance used as evidence.\nSolomon's father said he's upset about his son's arrest and that if he was involved in the shooting, it was self-defense. He said his son, a rapper involved in the Jacksonville music scene, has never been in a gang and is a promising football player with scholarship offers. He said Solomon is a senior and is supposed to head off to college this summer.\nBased on Solomon's arrest report, he is cooperating with police. Officers read him his rights and he admitted he had a gun in his possession.\n“We have a victim who is dead, yet (Solomon) was only charged with carrying a concealed firearm, which tells me that one possibility is it may be a self-defense issue, and since he is cooperating he's telling a story, it must also line up with other evidence the sheriff's office has,” News4Jax crime and safety analyst Gil Smith said.\nSolomon's dad did confirm that his son was at the Landing at the time of the shooting, when two off-duty officers working security for the Landing responded to the gunfire on Water Street and found the two teens wounded. Petersen died later at UF Health Jacksonville.\nPolice said at the time that a handgun was recovered from the scene and several people had been detained for questioning.\n“(Detectives will) continue to interview those witnesses to see if his story does completely match up with what other witnesses are telling them,” Smith said. “Also this may be tied with a retaliation-type shooting from some prior cases, so they'll tie those in to see if there's any connection with those cases as to why these two happened to get together or meet for whatever reason at the Landing.”\nDespite early indications that the shooting might have been self-defense, it will likely be months before the state attorney’s office makes a final determination.\n\"If surveillance really bears that out, how did that fight start? Who was the first shooter can lead its way to self-defense, but let me tell you about self-defense -- you can’t go and start a fight then later say, 'I was defending myself.' If you are the initiator of it, you’re in a penny for a pound,\" Reep said.\nIn the meantime, Petersen's family is relieved just to know that police have arrested a man connected to the case.\n\"The family is really pleased to know that someone is in custody and so we are at a little ease, but it doesn’t take away the pain and the hurt right now,\" said Jacklyn Wynn, Petersen's aunt.\nWynn told News4Jax Monday that despite what has been said, the family is only asking for a thorough investigation to determine who was at fault.\n“I don’t want to hear that maybe it has something to do with this because of this. No. I want concrete evidence. I want something that can say, 'Yes, this is what we have and we have proof of this.' Whatever they find that is truthful, we are OK,” she said.\nCopyright 2017 by WJXT News4Jax - All rights reserved."}