{"uri": "http://www.news4jax.com/news/police-reports-of-2-shot-at-jacksonville-landing_", "title": "Sheriff: Teen's death in Landing double shooting likely gang related", "dct": "Tue, 17 Jan 2017 10:43:00 GMT", "id": "bcb12b5345fdf54ab7cdd5a0840ff66f", "content": "JACKSONVILLE, Fla. - Monday's double shooting at the Jacksonville Landing that resulted in the death of a 16-year-old boy was connected to a double shooting of two teenagers at the downtown Art Walk 12 days earlier, police said.\nSheriff Mike Williams added Tuesday that the Landing shooting was likely gang-related.\nKhamoi Petersen died after the Monday afternoon shootings. A 13-year-old boy who suffered non-life-threatening injuries has not been named.\nWilliams said they have not found the shooters, and while everyone involved knew each other, the shooting was random. He added that those involved have not been very cooperative with investigators.\nWilliams said it did not happen at an organized event and that police and security staffing at the time was appropriate for the situation.\nThe Jan. 4 Art Walk shooting occurred two blocks from the Landing and one of the victims ran to the Landing to get help.\n\"We're working both of those (shootings) diligently,\" Williams said. \"We’re going to do everything we can do to make people feel safe downtown. That’s what we want to happen, and we need cooperation from the public.\"\nWilliams said that though the two double shootings were likely linked, the Landing shooting was not a direct retaliation. He said something specific happened Monday that prompted the Landing shooting.\nBut Williams acknowledged that retaliation often becomes a motive for shootings.\n“I think it’s a problem everywhere, and we’ve had our share of those, abosultely,” Williams said. “At the same time, we’ve had a new level of cooperation, but in some of these circles, we’re not going to get that cooperation, and this is potentially one of them.”\nNews4Jax crime and safety analyst Gil Smith said that the lack of cooperation, also called a code of silence, is unfortunately common.\n“That happens quite often for a couple reasons: One, because they’re also involved in these revenge shootings. Another is they’re just afraid and scared to report these people because they could come back on them,” Smith said.\nBut Smith said people should remember that even if police make an arrest and a tipster collects a reward, the tip remains anonymous when called in to Crime Stoppers. The tipster can’t even be subpoenaed into court if their tip leads to an arrest.\nWilliams said the Sheriff's Office was to meet Tuesday afternoon with managers of the Jacksonville Landing to discuss security and ways to prevent people from gathering at certain times in certain places, within the limits of the law. He said he was open to the possibility of a daytime curfew for minors.\nGunfire on Martin Luther King Jr. Day\nJust after 4 p.m. Monday, two off-duty officers employed by the Landing responded to gunfire immediately outside the front of the Landing on Water Street, said JSO Assistant Chief Scott Dingee.\nThat's where the officers said they found two teenagers with gunshot wounds. Peterson died later at UF Health Jacksonville.\nAccording to investigators, it appeared that a fight escalated into gunfire, which shattered a glass door at the front of the Landing.\nPeterson's family said there would be a vigil for him from 5-7 p.m. Tuesday at the Landing.\nPhoto by Jerry McGovern\n\"There appears to be some kind of confrontation of a group of individuals outside the Landing,\" Dingee said. \"The incident, based on some of the individuals that we know were involved, was possibly related to the Art Walk shooting.\"\nDingee said a handgun was recovered from the scene, and several people were detained for questioning, but no arrests have been made.\nAs of Monday night, investigators were still collecting surveillance video from surrounding businesses and interviewing at least 30 witnesses.\nSleiman Enterprises, the owner of the Landing, issued the following statement:\n\"The incident that occurred on city property outside of the Landing today saddens us. This is an ongoing investigation by Jacksonville Sheriff's Office, therefore we cannot comment any further.\"\nDingee said they do not believe the shooting was related to the city's annual Dr. Martin Luther King, Jr. parade, which ended at 2 p.m., or the continuing celebration that followed at Hemming Park.\nAnyone with information or tips is asked to call JSO at 904-630-0500. To remain anonymous, contact Crime Stoppers at 1-866-845-TIPS.\nWitnesses describe 'utter pandemonium' as gunshots rang out\nA day that began celebrating the life of a man who preached nonviolence ended with two teenagers shot during a time when there was a lot of foot traffic at the Jacksonville Landing.\nMany people were forced to halt their celebrations of Dr. Martin Luther King Jr. Day when the gunshots rang out. Witnesses said bullets were flying everywhere and people were ducking for cover.\nA witness inside the Landing posted on Facebook that a shooter pulled out a gun and \"opened fire on us\" with five to 10 rounds. Another witness said he saw two shooters jump into a white car and head toward the Main Street Bridge.\nRudy Hinton said he was near the two teens, who were asking a security officer for help, right before the shots were fired and everyone in the line of sight became a potential target.\n\"JSO was interviewing two young men. They were telling him that it was about to go down. The boy asked for protection and they said sure, so I stood there and the next thing, 'Pop, pop, pop.' Everybody went running,\" Hinton said. \"They shot at the officer and everybody standing around. They were shooting to kill.\"\nDespite Hinton's version of events, JSO has yet to confirm whether or not the boys were seeking protection from the shooters.\nAnother witness told News4Jax that he had been coming off the Riverwalk and heard what he thought were fireworks going off.\n\"I get around the corner, and all these young people are running around and screaming and the guy's laying on the ground bleeding. The cops were over him and he’s not moving,\" Ronald Wallace said. \"They were saying, 'He’s dead,' and screaming that another victim is inside the building.”\nWallace said he was glad he wasn't hit by the gunfire.\n\"I was right there. It could have been me if a stray bullet would have come my way,\" Wallace said. \"I was flabbergasted. First time I've been close to something like that. It's real messed up.\"\nDaniel Griffin, who works at the Landing, said he and some other chefs had been outside smoking cigarettes when they heard the gunfire.\n\"Utter pandemonium,\" he said. \"You heard at least maybe 20 shots. It sounded like two, maybe an automatic. Definitely wasn't one person firing. It was bad. Everybody scattered and took off running. We knew pretty much at first what it was.\"\nKrista Chestnut, 13, was dining at Hooters with her 17-year-old brother, Keron Chestnut, and other friends at the time of the shooting. She described the unsettling experience as patrons were told to stay inside.\n\"It's a shooting. I'm going to be scared. I don't know if they're going to come over here,\" she said.\nThe double shooting not only frightened those at the Landing, but also sparked anger among many community members like T. Greedy, who said he was offended by the shooters' reckless behavior and disregard for the national holiday.\n\"MLK -- this is not what he wanted,\" Greedy said. \"Disrespect to the city and to Martin Luther King. That’s not right. Period. Point blank. By no right should a man have a gun down here. Period. You shouldn’t have a gun down here, at all.\"\nCopyright 2017 by WJXT News4Jax - All rights reserved."}