{"uri": "http://www.berkeleyind.com/news/crime-blotter/article_5ed8f09e-d85f-11e6-84ac-bb8e6f839df1.html", "title": "Crime Blotter", "dct": "Wed, 18 Jan 2017 00:00:00 GMT", "id": "648194ad95e7c1d79f22c8d4a8700c6c", "content": "Accidental Shooting\nA Berkeley County man told deputies he accidentally shot himself in the foot with a shotgun while squirrel hunting in his back yard, according to a Berkeley County Sheriff’s Office. The man said he was raising his gun to shoot the squirrel and he must have “accidentally pulled the trigger.” The man was transported to Trident Medical Center with a severe shotgun wound on the top of his left foot.\nAnimal Attack\nA Goose Creek woman told officers that her bulldog had broken through her privacy fence and killed her next-door neighbor’s dog, a Goose Creek Police Department report said. The officer placed the bulldog in his vehicle to be transported to the Doc Williams Society for the Prevention of Cruelty to Animals center. The officer also noticed a “100 pound plus” pig on the woman’s property and notified her that pig ownership is not allowed within city limits.\nSuspicious Fire\nGoose Creek police responded to a suspicious car fire in a driveway. A witness said after hearing a car alarm, he came outside to observe smoke emitting from the vehicle. Firefighters said upon arrival, small flames were coming from the top of the vehicle. The owner of the vehicle said the car’s oil was changed the previous day. There were no indicators of arson.\nGrand Larceny\nA Frampton Construction superintendent notified police that a generator had been removed from a gated construction site, according to a GCPD report. As the lock was in place, the complainant stated the gate had been knocked off the hinges. The generator is valued at approximately $5,000.\nOverdose\nPolice responded to Quality Inn in Goose Creek regarding a drug overdose. Upon arrival, officers observed a syringe, glass pipe and white crystal substance in plain view. The suspect was arrested after being transported to a local hospital for examination.\nStretcher Theft\nHanahan Fire Department Chief Bo Bowers notified Berkeley County deputies that a medic unit stretcher was missing after being left at the county maintenance shop. The stretcher is valued at over $6,900.\nMail Theft\nA woman at Royle Road told deputies she observed a man wearing a stocking cap exit a grey vehicle, open her mailbox and take two letters, both of which contained money.\nAggravated Assault\nA woman at Harbour Lake Drive reported that a man “forcefully” struck her with a skateboard during an altercation. Upon the suspect’s arrest, deputies reported the suspect attempted “to strangle himself with the handcuff chains,” and subsequently used to the seat belt attempting to suffocate himself. Deputies successful removed him from the vehicle and he was attended to by EMS."}