{"uri": "http://www.stltoday.com/news/local/crime-and-courts/girl-is-fatally-shot-by-masked-gunmen-in-st-louis/article_3dcd1cd8-3dc1-5367-905c-dbaee3a8c2c9.html", "title": "St. Louis neighborhood in fear after girl, 15, is killed by masked gunmen", "dct": "Thu, 19 Jan 2017 00:00:00 GMT", "id": "e1afd7017566c2f4685836cb54de6e61", "content": "To view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nST. LOUIS • Fear gripped a St. Louis neighborhood Wednesday, the night after a 15-year-old girl was fatally shot by two masked men — or boys — with assault rifles.\nThe death of Toni Stevenson came less than two months after the fatal shooting of a 17-year-old boy who attended the same school as Toni. Neighbors pointed to other shooting scenes nearby, and classmates left school Wednesday afternoon with the shootings on their minds. But few felt safe talking. Anyone could be watching, anyone could find out.\n“She was nice, funny and determined,” one girl said of Toni, but even that simple statement drew warnings from her friends to shut her mouth. The girl wanted to talk, though, about the sadness she felt, and how she saw teachers crying Wednesday.\n“It’s unsafe now,” the girl added as she waited for a bus. “I don’t trust nobody out here.”\nPolice say Toni was shot just before 7 p.m. Tuesday. Toni had just driven to her home in the 6000 block of Thekla Avenue shortly after leaving a basketball game and had pulled over to park when the two gunmen ran up and opened fire. The shooters ran off.\nToni died at the scene of multiple gunshot wounds. She was the only person in the car and the only person hit by gunfire.\nLt. John Green said detectives did not believe the shooting was random. “We think they were looking for a target and they found it,” he said, adding that he didn’t know a motive.\nToni was a sophomore at Northwest Academy of Law, a magnet high school in the St. Louis Public School District that’s just a few blocks from the home on Thekla. She was on the school’s basketball, volleyball and soccer teams.\nPatrick Wallace, a school district spokesman, said she was returning from a basketball game she had played in when she was killed. Northwest Academy of Law was playing at Gateway STEM High School in St. Louis.\n“She was a very academically bright child,” Wallace said. “Very popular, civic-minded.”\nWallace said students and staff were taking her death hard. It was the second murder of a Northwest Academy student in two months, after Damani Aitch, 17, was slain in December. A spokeswoman said Wednesday that police did not believe the two shootings were related.\nDebra Jones, 50, moved to the area a few months ago and regrets it. From her bus stop, she pointed out where Toni and Damani had been killed, and said she worried for her teenage granddaughter and a young grandson.\n“I want to get them out of this neighborhood,” she said. “It makes you scared to come outside.\n“I can’t do this. All this killing, and they are all babies.”\nMotive unknown\nGreen, the police lieutenant, said he had no theories about why the girl might have been targeted.\n“I kind of find it hard to believe that a 15-year-old girl would be doing something to cause this to happen,” he said.\nDetectives were on the scene late Tuesday interviewing potential witnesses. Police have not released a description of the gunmen.\nToni lived on Thekla in a brick home with her 28-year-old brother, said her aunt, Jada Jenkins. Jenkins became the girl’s legal guardian after Toni’s mother died of cancer in 2015. She said the girl’s father died several years ago.\nJenkins said she had no idea why Toni might have been targeted. She said Toni was a spirited student who got good grades and was very active at school.\n“She was life,” Jenkins said through tears. “Nothing could get her down.”\nDominique Patterson, one of Toni’s cousins in Atlanta, said Toni had just gotten her driver’s permit. “She was so excited. Her brother let her have her mom’s car,” said Patterson, 26.\nPatterson said Toni’s brother wanted the best for Toni. “We all did, because she didn’t have a mother or a father anymore,” Patterson said. “We wanted her to move to Atlanta, with her three aunts and grandmother. But she wanted to finish her school.”\nPatterson described Toni as “very quiet, never any drama.”\n“I know St. Louis is a rough city, I’m from St. Louis, but I don’t know who would want to do something like that,” Patterson said.\nVideo cameras are mounted on the home where Toni lived and appear to be pointed in the direction where the shooting happened. The police spokeswoman, Schron Jackson, said investigators were reviewing surveillance video from the shooting. She did not say it came from the home.\nEthel Walker, 65, lives across the street from Toni, where she runs a day care.\nWalker saw Toni get in the car to go to school Tuesday morning, she said. That night, she heard gunshots “like big shotguns.”\n“The gunshots were so loud,” Walker said. “I never heard gunshots like that.”\nWalker said she went outside and saw Toni. She ran out to the passenger seat of the car and held Toni’s hand as she took her last breath, she said.\n“I said, ‘Toni, hold on,’” Walker said. “She looked at me like, ‘Granny, I can’t.’ She still had her backpack on her back.”\nThe scene is just west of Riverview Boulevard in the Walnut Park West neighborhood.\nThe night after\nAbout a dozen women and young children gathered around Toni’s home Wednesday night, where they placed stuffed animals around a framed picture of Toni and lit candles in the shape of a heart around a cross.\nSome of the visitors were relatives, neighbors and Toni’s childhood friends who had known her all her life; others were strangers who came by to pay their respects.\n“Who’s going to the walk?” one person said, referring to a vigil planned for 8 a.m. Saturday where attendees plan to meet at Northwest Academy and walk to Toni’s home.\n“All of us,” another person responded.\nJolonda Barnes stood on the porch of Walker’s home and watched the small crowd gather. She and her daughter, Sherricka Robinson, 16, had stood at the same spot Tuesday night just after the shooting.\nWalker, who is Barnes’ mother and Sherricka’s grandmother, had called them to the house, Barnes said. Sherricka had grown up with Toni, and the pair had been friends since they were toddlers.\n“She just stood there and watched it all,” Barnes said about her daughter. “She hasn’t broken down yet. We’re still in shock.”\nThe shooting shocked the neighborhood, said Keisha Whitney, who is also a daughter of Walker’s. Many of the houses on the block have been occupied by the same families for years.\n“Toni wasn’t just a neighborhood kid, she’s family,” Whitney said. “We see a lot of crime everywhere in this area, but we’ve never seen something so bad happen to someone so young. People don’t value life anymore.”\nDenise Hollinshed and David Carson of the Post-Dispatch staff contributed to this report."}