{"uri": "http://www.kmov.com/story/34282790/teenager-shot-and-killed-in-north-city", "title": "Girl, 15, killed in Walnut Park West neighborhood described as ' - KMOV.com", "dct": "Wed, 18 Jan 2017 00:00:00 GMT", "id": "f422ff29b3a7c63a543e845783deb9d5", "content": "NORTH ST. LOUIS (KMOV.com) -\nA 15-year-old girl was shot and killed in the Walnut Park West neighborhood Tuesday night.\nThe teen was sitting the driver’s seat of a parked vehicle in the 6000 block of Thekla, in the Walnut Park West neighborhood, around 7 p.m. when she was shot by two men, police said.\nJason Watkins, is a senior at Northwest and says he knew Toni for about two years.\n\"I don't see why her? Out of all people, why her? I've never seen her into it with anybody,\" said Watkins.\nWatkins says she was always positive, always smiling and was a star athlete.\nPatrick Wallace with the St. Louis Public School District identified the teenager as Toni Stevenson, a student at Northwest Academy of Law.\nJUST IN: 15yo Toni Stevenson was murdered last night. School leaders say she was a \"bright student\" with so much potential @KMOV pic.twitter.com/yFLAxGUMYP\n— Justin Andrews (@Justin_EAndrews) January 18, 2017\nWallace said Stevenson played basketball, soccer and volleyball, and was also a member of the after school social justice club.\nA friend of Toni Stevenson described her as \"joyous\" and says she was loved by everybody in the school. @KMOV\nStevenson was pronounced dead at the scene, police said.\n\"She lost her mother last year, I do know that,\" said Wallace. \"That's one of the things that make sit more difficult for the staff here. They kind of took her in under their wings and gave her extra comfort in her time of need over the last year. So again it's a real loss for not only her fellow students, but also the staff who feels like they lost a child.\"\nWallace told News 4 counselors and extra security would be at the school throughout the day Wednesday.\nDescriptions of the suspects have not been released.\nThe investigation is ongoing.\nCopyright 2017 KMOV (Meredith Corporation). All rights reserved"}