{"uri": "http://www.startribune.com/13-struck-by-gunfire-in-a-weekend-of-violence-in-minneapolis/390256251/", "title": "13 struck by gunfire in a weekend of violence in Minneapolis", "dct": "Tue, 16 Aug 2016 00:00:00 GMT", "id": "6f345ff03266fee873c0dc698b2126df", "content": "The gun violence that has plagued parts of Minneapolis this year struck again over the weekend as at least 13 people were shot, one fatally, in separate incidents across the city, according to police and scanner reports.\nAs homicide detectives continued Monday to investigate the slaying of 28-year-old Jaquan Oatis in the North Side’s Jordan neighborhood late Friday, officers also searched for clues in the shooting of five people early Sunday morning.\nThe five victims — three men, ages 21, 21 and 20, and two women, ages 51 and 21 — were shot at the Plymouth Avenue Townhomes in the 1700 block of Plymouth Avenue N., police said.\nAccording to scanner traffic, witnesses reported seeing a suspect — described as a man with a thin build, buzz haircut and wearing a white T-shirt — fleeing westbound on Plymouth moments after gunfire erupted.\nOfficers on the scene told dispatchers that the “mouth of the alley” behind the complex was littered with spent 9mm and .45-caliber shell casings.\nNo arrests have been announced in the shootings.\nBetween Friday morning and Sunday night, at least seven other people were shot across the city. They included:\n• A 39-year-old Minneapolis man who was wounded about 4:30 a.m. Friday when he was robbed at gunpoint by a masked man near the corner of S. 28th Avenue and E. Lake Street.\n• A 27-year-old Minneapolis man who walked into the emergency room at Hennepin County Medical Center and told police that he had been shot in south Minneapolis. The man later changed his story and said the shooting took place near Lyndale and 40th avenues N. He admitted that he had lied to officers about the location and that he had given them a phony name because he had two outstanding warrants.\n• A 26-year-old man from Benson, Minn., who was shot in the arm when gunfire broke out about 1:10 a.m. Saturday in the area of N. Knox and Plymouth avenues, near the Plymouth Avenue Townhomes complex.\n• A St. Paul man who was wounded just before 7 p.m. Saturday in the 2300 block of James Avenue N.\n• Minneapolis police also responded to a “shots fired” call in the 2700 block of Girard Avenue N. sometime before midnight on Saturday to find a victim shot in the hand, according to scanner reports.\n• And on Monday morning, emergency dispatchers reported that a victim showed up at Unity Hospital in Fridley with gunshot wounds stemming from a shooting Sunday night in the 3900 block of Colfax Avenue N., where a woman was wounded.\nMeanwhile, police on Monday were still searching for leads in the death of Oatis, of Minneapolis, who was shot several times on the sidewalk outside a house in the 2900 block of Morgan Avenue N.\nHe died at the scene.\nNo motive for the killing has been disclosed.\nOatis’ death was the third of four homicides in the city last week and the 22nd so far this year, down from 29 by this time last year.\nAccording to scanner reports, witnesses saw several vehicles fleeing the area shortly after 11 rounds were detected by the city’s ShotSpotter network, which uses sensors to pick up the sound of gunfire.\nNo one has been arrested."}