{"uri": "http://fox17online.com/2016/04/01/charges-possible-in-accidental-shooting-death-of-battle-creek-woman/", "title": "Charges possible in accidental shooting death of Battle Creek woman", "dct": "Fri, 01 Apr 2016 17:27:00 GMT", "id": "46eca956023422a799c5f854e0b86b68", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nBattle Creek, Mich. — Kayla Babick’s birthday was last week and her family did what they could to remember her. She was shot and killed on Valentines Day when, according to Battle Creek police, her boyfriend was cleaning his gun. They said they believe the case to be accidental. But now the it's in the prosecutors hands.\n\"We’re looking into how much responsibility does a firearm owner have to make sure that firearm is safe to where it won’t go off or it won’t be an incident like this that takes place,\" said Detective Sergeant Troy Gilleylen with the Battle Creek Police Department.\nInvestigators said they've conducted multiple interviews with the boyfriend, 25-year-old Deangelo Gaines. Gaines initially told them that his .45 caliber gun went off when he was cleaning it. But then he said the gun was lying on the bed when Babick laid on top of it. When she tried to move it, it discharged.\n\"The firearm was left out, loaded obviously,\" said Gilleylen. \"What we’re now looking at is whether or not someone’s careless acts contributed to the death of a human being.\"\nGilleylen said there are no laws stating a gun has to be locked or stored away when it's inside a residence. However, the department is looking into whether it was reasonable to have it out in the open.\n\"She wasn’t taking the gun apart when it went off,\" said lead detective Scott Silverman. \"She wasn’t cleaning it when it went off. She wasn’t playing with it when it went off. She was actually on the telephone talking to her mother.\"\nDue to a number of interviews with Gaines and other witnesses, police believe the incident to be unintentional. But it is a peculiar case.\n\"For an adult I think it is unusual,\" said Gilleylen. \"I know we do hear on occasion of a child that’s able to get a hold of a parent or firearm that’s left out. And I think that it happens all too much.\""}