{"uri": "http://www.wxii12.com/news/4-dead-in-stokes-county-shooting/31092850", "title": "Parents, 2 children dead in Stokes County murder-suicide", "dct": "Thu, 05 Feb 2015 22:20:00 GMT", "id": "40085de9b5f3bce63a2f09e907950748", "content": "STOKES COUNTY, N.C. —\nThe shooting deaths of a husband, wife and their two children inside a Stokes County home are being investigated as a murder-suicide, deputies said.\nAll four bodies were found around 11:50 a.m. Wednesday on Ralph Boyles Road off Highway 66 a few miles northeast of King.\nStokes County deputies identified the parents as Coleton Lee Tarpley, 36, and his wife, Amanda Tarpley. The boys were identified as Coleton Tarpley, 9, and Charlie Tarpley, 6.\nBoth boys attended Poplar Springs Elementary School, and Charlie was a special needs child, deputies said. | Mobile users, tap here to watch Margaret Johnson's report.\nDeputies said the early investigation appears to point to Coleton Tarpey as the suspected shooter. All four people were shot in the head, deputies said.\nDeputies said they responded to a welfare check after grandparents went to pick up the children at the home and noticed that vehicles still parked out front. The children didn't go to school Wednesday, and the adults didn't go to work, deputies said.\nDeputies went inside the home and discovered the bodies. Neighbors told WXII's Margaret Johnson that they never heard the shots that killed the family.\nCourt records obtained by WXII Thursday indicated the elder Coleton Tarpley had taken out a domestic violence protective order against his wife last March. In the order, which was later voluntarily dismissed, Coleton alleged his wife was having an affair and said he was afraid she was going to either take the children away or be violent toward them.\nPaperwork filed last May indicated Coleton was granted sole custody of the children, and his wife was able to see them twice a week after school.\nSBI officials are helping Stokes County deputies with the investigation.\nKeep checking WXII 12 News, WXII12.com and the WXII news app for iPhone and Android for updates."}