{"uri": "http://myfox8.com/2015/02/04/2-adults-2-children-killed-in-stokes-county-shooting/", "title": "2 adults, 2 children killed in Stokes County murder-suicide", "dct": "Wed, 04 Feb 2015 14:48:00 GMT", "id": "916416442cfd3dcd29b6bf26e420dd85", "content": "STOKES COUNTY, N.C. -- The Stokes County Sheriff’s Department believes Coleton, Amanda Tarpley and their two children, Charlie, 9, and Coleton, 6, likely died as a result of a murder-suicide.\nThe family was found dead from gunshot wounds at a residence on Ralph Boyles Road Wednesday morning.\nA Stokes County school official told FOX8 the two children were students at Poplar Springs Elementary School.\nSchool was only in session for half a day today. At 11:50 a.m., the children’s grandparents went to get them off the bus and found their parents’ cars still at the home.\nThe grandparents called the Stokes County Sheriff’s Office to do a welfare check and deputies found all four deceased.\n“It’s always tough any time you're dealing with young people,” said Sheriff Mike Marshall.\nThe Sheriff’s Department has not determined a motive for the killings nor have they identified the killer.\nThe Tarpleys had family that lived next door. They did not want to be interviewed.\nOther neighbors are in shock. Amy Parsons was lifelong friends with the father. She said he was always quick to help out friends in need.\n“I just felt sick to my stomach for the kids the little children in there,” said Parsons. “It just breaks your heart.”\nParsons lives across the street from the Tarpleys’ home. She said she never noticed any marital problems and said Coleton loved his special-needs son Charlie immensely.\n“Coleton revamped the whole inside of the house just to accommodate Charlie, you know; if there was something Charlie needed he would build it for him,” said Parsons.\nAnother neighbor, Patricia Stark, was also shocked by the crime just two doors down from her home. She said she didn't hear anything out of the ordinary Tuesday night or Wednesday morning.\n“My heart goes out to the family members of those people because that is horrible,” said Stark. “I cannot imagine.”"}