{"uri": "http://www.mlive.com/news/saginaw/index.ssf/2016/07/family_of_7-year-old_who_fatal.html", "title": "Alma authorities 'just trying to do what we can' for family of boy who shot stepfather", "dct": "Wed, 13 Jul 2016 09:13:00 GMT", "id": "fdb8fca66fe0eeaab4b7a196e1fd39b4", "content": "ALMA, MI -- A two-story house with white siding and a white truck in the driveway on Penrith near Hampton in Alma showed no activity about noon Friday, July 8.\nThe street was quiet as well. No neighbors were outside, and those who were went back inside when media crews arrived.\nJust a few hours earlier, police, medical crews, and Michigan State Police Crime Laboratory personnel were outside of the white house at 126 Penrith that was surrounded by police tape.\nPolice were dispatched to the home about 12:15 a.m. for a report that a 7-year-old boy shot his stepfather.\nA 7-year-old boy fatally shot his stepfather while the family was asleep in their Alma home.\nThe boy removed the weapon from a locked case after finding the keys and fatally shot his stepfather with a \"high-powered rifle\" while his family was asleep, police stated.\nAlma Police Detective Jason Biehl said police determined the shooting was accidental based on \"circumstances, location of items, and statements from people talked to.\" The child's mother called police, Biehl said.\nPolice have not released the name of the boy or his stepfather. The boy and another child were removed from the home while police continue to investigate the shooting.\n\"We are just trying to do what we can for the family,\" Biehl said.\nNeighborhood resident Ashley Gross said she would often see the stepfather in his yard from her backyard.\nGross lives around the corner from the home where the shooting happened and said she was awakened about 4 a.m. by police who asked her if she had heard anything around the time the shooting occurred.\nShe had, but she thought it was a firecracker.\n\"Which is normal around this time,\" Gross said.\n'A hunting family'\nBiehl said there were a few guns in the home where the shooting occurred and said the victim's family is \"a hunting family.\"\n\"It's pretty common in this area for people to hunt,\" he said.\nGross said the incident is tragic and said the child should have had some kind of gun-safety training. Gross said she doesn't own a gun herself, but she said that many of the people in the area own them for hunting.\nWhen she was leaving for work early Friday morning, Gross said she saw the police tape and the crime lab, which brought back memories of her own tragic event.\n\"My mom was murdered in Alma 13 years ago,\" she said.\nGross has lived in the area for 10 years and said that she doesn't hear about incidents like the shooting often.\n\"Why is a 7-year-old,\" Gross asked, \"able to get to the keys while the family sleeps?\"\nFellow resident Ellie Martin, 14, said her \"heart just kind of dropped\" when she heard of the shooting.\n\"I felt really worried and upset for them,\" Martin said.\nTrevor Connor, who lives about five minutes away in St. Louis, said he was at his girlfriend's apartment at the intersection of Pinrith and Hampton.\nConnor said he was leaving for work when he saw the caution tape, police, and ambulance outside, but he didn't think anything of it.\nHe later learned what happened on Facebook. Connor said he often would see the children playing in the area.\n\"They seemed pretty normal,\" he said. \"The dad was always in the garden.\"\nBob Johnson is a reporter for MLive/The Saginaw News. Contact him at 989-395-3295, by email at bob_johnson@mlive.com or follow him on Twitter, Facebookor Google+."}