{"uri": "http://www.recordnet.com/news/20161026/boy-slain-in-apparent-gun-accident-identified", "title": "Boy slain in apparent gun accident identified", "dct": "NODATE", "id": "de6c3924b85909202b20d4f3485050c7", "content": "Hide caption Bernique Mimmitt, left, is comforted by neighbor Mary Edwards after Mimmitt learned that her 11-year-old son had been shot in the head last Thursday in front of their Ledgewood Avenue home. Authorities on Wednesday identified the boy as Tahj Harris. CLIFFORD OTO/RECORD FILE 2016\nSTOCKTON - Authorities on Wednesday released the name of a boy who died after being shot in the head under uncertain circumstances last week in a north Stockton neighborhood.\nThe San Joaquin County Coroner's Office identified the boy as Tahj Harris, 11, of Stockton. The Coroner's Office said the boy died Sunday after being shot about 5:05 p.m. Thursday in the front yard of his family's home in the 9000 block of Ledgewood Avenue.\nTahj's 18-year-old brother initially said the boy was wounded in a drive-by shooting, but police immediately cast doubt on that story. They said first responders found a gun beneath the boy and added that there was no indication that a drive-by shooting had occurred.\nOfficer Joe Silva, a spokesman for the Stockton Police Department, said investigators view the shooting as a \"possible accident.\" Police have not revealed who the gun belonged to.\nInvestigators were seen testing the boy's older brother for gunshot residue shortly after the shooting occurred. Silva said any evidence collected at the scene would be sent to a lab for testing.\nSilva said Wednesday the shooting was still under investigation and there was nothing new to report.\nKatora Brye Mimmitt, the boy's aunt, announced on Facebook on Wednesday that a candlelight vigil will be held for Tahj at 7:30 p.m. Friday outside the family's home at 8926 Ledgewood Ave.. A Facebook event page for the vigil included the following message:\n\"Please come join our family for a candlelight vigil in memory of our sweet Tahji Boo. He will be deeply missed by all of us and will be forever in our hearts. May God wrap his loving arms around all of us in this time of sorrow.\"\n- Contact reporter Jason Anderson at (209) 546-8279 or janderson@recordnet.com. Follow him at recordnet.com/crimeblog and on Twitter @Stockton911."}