{"uri": "http://www.newsandtribune.com/news/jeffersonville-toddler-shoots-himself-in-leg-mom-s-boyfriend-jailed/article_f810c2c8-114b-11e5-b848-2f20538afffb.html", "title": "Jeffersonville toddler shoots himself in leg, mom's boyfriend jailed", "dct": "Fri, 12 Jun 2015 00:00:00 GMT", "id": "6d7788088e94f56997ffd46735d8c47a", "content": "JEFFERSONVILLE — A Jeffersonville toddler was hospitalized this week after shooting himself in the leg with a handgun belonging to a man charged earlier in the year with two felony handgun-related charges.\nDimitri Miles, 22, the owner of the handgun and the boyfriend of the 2-year-old child’s mother appeared in a Clark County circuit court Friday afternoon, but he has only been preliminarily charged with child neglect.\nMiles is now in the Clark County jail under a $15,000 cash-only bond.\nThe Jeffersonville Police Department was dispatched to Clark Memorial Hospital about 8:15 p.m. Tuesday and made contact with the child, his mother and Miles.\nMiles was taken from the hospital to the Jeffersonville Police Department for questioning. He confirmed to police that he resided in a Middle Road home with the mom and child.\nMiles reported during the interview that, “Among his belongings on the floor next to the bed, he keeps a 9-millimeter handgun usually stored in a gym bag or a shoe box. He normally keeps the gun fully loaded without a gun lock or any other safety device,” according the probable-cause affidavit.\nHe told police that he and the child and the child’s mother had been together in the home earlier in the day. Miles reported that he had fallen asleep, and “awakened by the sound of a loud pop and discovered [the toddler] crying and his handgun was close to the child.”\nMiles further told police that upon realizing the toddler had been shot, the couple took the boy to a relative’s home before going to the hospital. He was placed under arrest following the questioning and later booked in the Clark County jail.\nUNRELATED CASES\nMiles has a pending case in Clark County Circuit Court No. 1 after being charged in January with two counts of level 5 felony carrying a handgun and A misdemeanor possession of marijuana. A level 5 felony has a sentencing range of one to six years in the Indiana Department of Correction. A trial date is scheduled in August on the handgun charges.\nIn 2013, Miles was charged in Clark County Circuit Court No. 3 with class A misdemeanors carrying a handgun without a license and dealing in marijuana. He was sentenced to one year probation after pleading guilty to the marijuana charge, and the unlawful possession of a handgun charge was dismissed."}