{"uri": "http://www.wlox.com/story/32583030/rest-in-peace-bay-st-louis-community-mourns-losses", "title": "Friends and family struggle to cope with Bay St. Louis shooting deaths", "dct": "Mon, 01 Aug 2016 19:43:00 GMT", "id": "c77f5ff09970a5e4339b08d675c49be8", "content": "BAY ST. LOUIS, MS (WLOX) -\nTwo days after a shooting in Bay St. Louis left two people dead and an infant wounded, investigators have more questions than answers. Police Chief Mike DeNardo said Monday his investigators are in the process of collecting important information and additional evidence.\nPolice were responding to a missing persons report at a duplex in the 800 block of Louis Piernas Drive around 6 p.m. on July 30 when they found the bodies of 29-year-old Demetrius Mueller and 28-year-old Kristina Quintini, both shot to death.\nMOBILE USERS: Click here to view a slideshow of photos from the Sunday night vigil\nThe couple's 6-month-old daughter Mia was also shot, and is currently under observation at Children's Hospital in New Orleans.\n\"It's hurting both families. Neither one of them deserved it, the baby didn't deserve it. I mean, it's just a lot going on with the family right now, we're really hurting,\" said Quintini's cousin, Aaliyah Williamson.\nQuintini's family is no stranger to violent tragedy. According to Williamson, Kristina lost her brother, father and, most recently, a cousin to gun violence.\n\"It's crazy. We just lost my cousin in the past year, April 3. I mean, it's just a lot going on with our family right now,\" Williamson added.\nDozens of people joined hands in prayer and lit candles in Kristina's honor Sunday evening. Many of those who attended the vigil say they were touched by the former University of Southern Mississippi dance captain in some way.\n\"The most caring, loving person, always smiling. If there was ever a person who didn't deserve this, it was Kristina,\" said Angela Smith, a friend of the family.\nBut even in the darkest tragedy, mourners tried to find light.\n\"This is hard, very hard, to come together in the community,\" said outreach minister Connie Lyons. \"I know one thing for sure, sometimes it takes tragedy for us to triumph as a community.\"\nOn Sunday, Myrick Laneaux was arrested and charged with felony taking possession of a motor vehicle after he was found with a car that belongs to a family member of one of the victims.\nKristina's mother, Susan Trudo, did not want to go on camera, but was heard telling family members that she was going to raise her granddaughter.\nA GoFundMe account created for Kristina's funeral expenses raised nearly $3,000 in the 24 hours following her death.\nThe two deaths are the first reported shootings in the city in 2016, and brings the number of shooting fatalities on the Coast to 21.\nCopyright 2016 WLOX. All Rights Reserved."}