{"uri": "http://www.dailymail.co.uk/news/article-2330162/Former-police-officer-hunt-pain-pills-shoots-dead-pharmacy-owner-customer-robbery.html?ito=feeds-newsxml", "title": "Former police officer on the hunt for pain pills 'shoots dead pharmacy owner and customer during robbery'", "dct": "Fri, 24 May 2013 07:10:00 GMT", "id": "41b41be37ed14f927b9a218c7ca1807b", "content": "A former small-town police officer from Tennessee shot dead a pharmacy owner and a customer during a robbery gone awry, which also left two other people injured, officials said Thursday.\nDistrict Attorney Jimmy Dunn said during a press conference that 37-year-old Jason Brian Holt, from Bean Station, was taken into custody shortly after the shooting and robbery at the Down Home Pharmacy.\nAccording to Dunn, the ex-cop took ‘a large quantity of pills’ during the late-morning heist.\nThe pharmacy owner, identified as 42-year-old Stephen Lovell, and the customer, Richard Sommerville, 32, died at the scene.\nAlexia Wilson, 45, and Janet Cliff, 46, who work at the drug store, were injured in the shooting.\nBoth women were flown by helicopter to the University of Tennessee Medical Center, where they were in stable condition.\nHolt was apprehended by local police and sheriff's officers at around 11.15am, about 15 minutes after the shooting, in the vicinity of Down Home Pharmacy on Main Street.\nThe former law enforcement officer is facing two counts of first-degree murder, two counts of felony murder, one count of especially aggravated robbery and two counts of attempted murder.\nAccording to Dunn, Holt stole the prescription painkiller oxycodone from the pharmacy but no money. Arresting officers recovered the pills and a six-shot revolver handgun.\nTerry Wolfe, who is the mayor of Bean Station - a town of under 3,000 - said that Holt worked for the local police department from 2002 to 2004.\n'He subsequently quit our department and went to the Grainger County Sheriff’s Department, where he was a short-lived officer there, also,' Wolfe said, according to the Knoxville News Sentinel.\nLocal resident Brad Milton, who has known Holt for several years, told the local station WATE that he is not surprised by what happened Thursday.\n'He was running around on drugs,' Milton said. 'If he did that, he deserves to be put under the jail, if you ask me.'\nHowever, Holt's neighbor of more than a decade, Anita Hayes, said the 37-year-old was very professional while he was on the force.\nThings started changing a few years ago when Hayes said Holt had gone on some kind of medication. Then recently, her once friendly and quiet neighbor turned unstable.\nDerek Green, a nephew of the slain pharmacy owner Stephen Lovell, was working at the supermarket next door to the drug store at around 11am when he was told that a shooting took place inside his uncle's business.\nAccording to the relative, Lovell was not the kind of person to resist a robbery.\nGreen told the TV station WBIR that the married father of three had just celebrated his 42nd birthday last week.\nHe had purchased the pharmacy just over a year ago, and according to his nephew, he was excited to see his small business grow.\n‘He was just easy to talk to, always there, never seen him unhappy. Always playing with his kids,’ said Green."}