{"uri": "http://legacy.wbir.com/story/news/local/hamblen-jefferson-cocke-greene/2014/10/01/developing-pharmacy-shooting-suspect-to-make-plea-deal/16526831/", "title": "Bean Station pharmacy shooter pleas, gets life in prison", "dct": "Wed, 01 Oct 2014 00:00:00 GMT", "id": "ea70f1c6136c6681b9e85bb78ad5eb09", "content": "The man charged with killing two men and injuring two others during a pharmacy robbery has pleaded guilty to two counts of first-degree murder and two counts of attempted first-degree murder.\nHe was sentenced to life in prison without the possibility of parole. Prosecutors were going to seek the death penalty.\nInvestigators said Jason Holt went to the Down Home Pharmacy in Bean Station in May 2013 to steal prescription drugs. While there, he shot and killed the pharmacist and owner, Stephen Lovell, and a 72-year-old customer, Richard Sommerville. Pharmacy technician Alexia Gail Wilson and Janet Colleen Clift were also shot but survived.\n\"It was a very difficult case,\" Jimmy Dunn, district attorney said. \"Very difficult on the surviving victims, and very difficult on all of their families.\"\nClift as well as several other family members were able to address Holt in their victim impact statements.\n\"You killed two wonderful people,\" Clift said while in tears.\n\"For me, I had to go home and tell a three-year-old, a just turned 8-year-old, and a ten-year-old that their daddy was never coming home,\" Suzanne Lovell added.\nHolt was able to respond prior to his sentencing.\n\"I ruined five families. I wish I could turn it around but I can't. I have to live through this every day,\" he said.\nHolt's trial was set for January 21. On Wednesday, the judge was set to question a possible jury pool for the trial.\nInstead, the deal was announced that would send Holt to prison for the rest of his life.\nSally Sommerville, the daughter of one of the victims, said the plea brings a sense of closure, but she is still hurting every day.\n\"I can't ever forgive him for what he did,\" she said. \"Maybe in time. I'm not sure if I will ever forgive him.\"\nDistrict Attorney Jimmy Dunn was originally seeking the death penalty on Jason Holt. He said Wednesday's outcome turned out for the best.\n\"I had no guarantee that a jury would give the death penalty,\" he said. \"Talking to the families of the victims, I think this has helped them today. They know now this man will not get out of the penitentiary. He will serve the rest of his natural life in the penitentiary.\"\nThe outcome is something the families of victims were hoping for.\n\"If it would have been a death row case, it would have went out a lot longer than anyone would have wanted it to,\" said Lucas Clift, a victim's son. \"I think we got the overall verdict we were looking for and the answers we were looking for.\"\nDefense attorney, Edward Miller, said they have been working on a plea deal for months.\n\"Mr. Holt has always accepted responsibility. It was just a matter of fully investigating the case and working out what's best for everybody,\" he said.\n\"I'm sorry to everyone. I'm not asking for forgiveness because I wouldn't forgive myself,\" Holt said in court."}