{"uri": "http://abc7.com/news/4-year-old-boy-playing-outside-highland-home-shot-to-death/892956/", "title": "4-year-old boy playing with stuffed animal shot to death in Highland; suspect search underway", "dct": "Thu, 30 Jul 2015 00:00:00 GMT", "id": "31ee3c8a6e96b4ef0b7fff72923223b6", "content": "HIGHLAND, Calif. (KABC) --\nA 4-year-old boy playing outside his grandmother's home in a Highland neighborhood was struck and killed by gunfire in a suspected gang shooting.\nSheriff's deputies responded to a call of shots fired in the 7400 block of McKinley Avenue shortly before 8:30 p.m. Wednesday. At least 12 shots were fired.\nResponding deputies found the injured child on scene. He was transported to an area hospital, where he was pronounced dead.\nInvestigators said the boy, identified as Daniel Munoz, was playing with a stuffed animal in the front yard when he was shot. Daniel's aunt shared a photo with Eyewitness News, showing the boy when he was just a baby.\nDaniel was visiting his grandmother at the time of the incident. His mother Juliana Morales, who lives in Riverside, arrived at the home to mourn with family members.\nThe boy's aunt, who wished to remain anonymous, said she heard the gunshots, ran to the front yard and saw her nephew fall face first to the ground.\nNeighbor Angelica Garcia said she heard Daniel's grandmother scream. When Garcia came out to see what was going on, she said she saw paramedics take the boy away.\n\"My heart dropped down to my ankles. It's sad. A 4-year-old boy,\" said Regina Cleveland, an area resident.\n\"It's very sad when you come upon victims that are children, because they're innocent,\" Deputy Adam Cervantes said.\nDetectives were interviewing possible witnesses. A motive was not known.\nInvestigators are looking for a four-door early 1990s model white Toyota Camry with black front and rear bumpers.\nAccording to deputies, that car was at the scene when the gunfire rang out, and it's possible that the people in the vehicle were the intended targets.\nAuthorities are searching for the driver and a passenger in that vehicle as persons of interest.\nInvestigators released a photo of the passenger, who was described as a Hispanic male in his early 20s, about 5 feet 8 inches to 5 feet 11 inches tall and weighing between 160 and 180 pounds.\nDeputies say locating this man could lead them to the actual suspect.\n\"It's very heartbreaking. You know, a lot of us are parents, and we feel a sense of urgency to want to determine what happened and bring the suspects to justice,\" Cervantes said.\nIf you have any information about this shooting, you're urged to contact the San Bernardino County Sheriff's Department at (909) 387-3589."}