{"uri": "https://www.dnainfo.com/new-york/20160705/bed-stuy/7-shot-by-gunman-barred-from-july-4-bbq-brooklyn-nypd-says", "title": "7 Shot by Gunman Barred from July 4 BBQ in Brooklyn, NYPD Says", "dct": "Tue, 05 Jul 2016 07:45:00 GMT", "id": "1085da86715136cfe3b4c16a597a5c80", "content": "BEDFORD-STUYVESANT — A man shot seven people including a 17-year-old girl at an Independence Day barbeque in Brooklyn when he was denied entry into the gathering Monday night, police said.\nThe man, who hasn't been arrested, tried to get into the party in a yard next to 419 Chauncey St., near Saratoga Avenue, about 11:30 p.m. but wasn't allowed in, an NYPD spokesman said Tuesday morning.\nHe was on the sidewalk when he pulled his gun and started shooting through a black metal fence draped with a green tarp and into a crowd of about 200 people who convened for a joint graduation and Fourth of July party, police and witnesses said.\nJustin Johnson, 18, was with one of his friends when the gunfire erupted.\n\"We were talking about the girls at the party, then he literally dropped right next to me. He said, 'I got shot! I got shot!' I thought he was playing, then I saw the bullet wound in his arm,\" Johnson said.\n\"I felt bad because I couldn't help him. The guy just started shooting eight or nine times after that. he just shot through the whole party. Everyone was trying to run for dear life,\" Johnson added.\nJohnson hopped a rear fence to safety as the party erupted in mayhem and three of his friends were hit.\n\"I heard shots and firecrackers at the same time. Firecrackers had been bursting all night, then you'd hear, 'Boom!' It was chaos,\" said neighbor Vernon Wilson, 66.\n\"People were running into the back, trying to jump over the fence. It was a stampede,\" Wilson said.\nHe hit four men — ages 18, 18, 19 and 20 — and three women — 17, 19 and 20, police said.\n\"I saw a guy around the corner on the ground who'd been shot. he was breathing, talking. He was sitting on the sidewalk,\" said Ted McQueen, 60, who owns the venue and rents it out regularly.\nAnother man was tending to the victim, asking him, \"Where you shot at?\" according to McQueen.\nIn the mayhem, people were desperately screaming, \"What happened?\" over an over, according to neighbor Rosie Smith, 23.\n\"One of the girls on a stretcher said, 'Mommy, a guy didn't get into the party.' Then they put her in an ambulance and took her away,\" Smith added.\n\"It was horrifying. These were just children,\" Smith said.\nThey were all treated at Brookdale and Kings County hospitals where they're listed in stable condition, police said.\nInvestigators are questioning a 21-year-old man who they consider a person of interest, a spokesman said.\nMcQueen regularly rents out the venue for parties and said the party was a joint graduation and Independence Day celebration."}