{"uri": "http://nypost.com/2016/07/05/bloody-4th-of-july-14-shot-in-10-incidents-across-the-city/", "title": "Bloody Fourth of July: 20 shot in 12 incidents across the city", "dct": "Tue, 05 Jul 2016 02:51:00 GMT", "id": "277c0c71ea923504224501402dafb7b9", "content": "Twenty people were shot in 12 separate incidents — eight of which happened in Brooklyn — in a bloody Fourth of July across the city.\nSeven people were blasted during a large gathering on Chauncey Street near Saratoga Avenue in Bed-Stuy at about 11:30 p.m. Monday.\nTwo men, 18 and 20, and one woman, 19, were transported to Brookdale Hospital. A 20-year-old woman, 17-year-old girl, and two men, 18 and 19, were rushed to Kings County Hospital.\nPolice said the gunman opened fire after being denied entry to a backyard barbecue. The shooter then fled and is still being sought.\nIn the same neighborhood about 2½ hours earlier, a 22-year-old man was shot in the chest at Broadway and Chauncey Street and then walked into a nearby firehouse, cops said. Five suspects — three men and two women — fled on foot.\nPolice believe the two incidents are connected and are gang-related.\nAn 18-year-old man was blasted five times in the torso at Wilson and Cooper streets in Bushwick at 10:15 p.m. Cops said an unknown person discharged a gun from a vehicle, striking him.\nThe other Brooklyn shootings included a 24-year-old man who was shot twice in the back on East 29th Street in Flatbush at 5:17 p.m., a 22-year-old man who was shot in the right leg when he was walking at St. John’s Place and Franklin Avenue in Crown Heights at 11:15 p.m. and a man who was shot at Ocean Avenue and St. Paul’s Court in Prospect Park South after midnight Tuesday.\nA woman also walked into Kings County Hospital with a gunshot wound shortly before midnight.\nIn East Harlem, a 20-year-old man was shot in the head by another man at East 116th Street and Pleasant Avenue at about 8:15 p.m. Monday.\nEarlier on Monday, two men were grazed in the legs on 140th Street near Foch Boulevard in Jamaica — and two men, 33 and 19, were shot on East 94th Street near Willmohr Street in East Flatbush. The older man was shot to his forehead, cops said.\nAt about 12:30 a.m. Tuesday, a man was shot on Intervale Avenue near Chisholm Street in the South Bronx. Another person walked into Richmond University Medical Center on Staten Island after midnight.\nNone of the victims suffered life-threatening injuries, cops said."}