{"uri": "http://www.abcactionnews.com/news/region-sarasota-manatee/accidental-shooting-at-high-noon-gun-shop-in-sarasota-leaves-1-victim-with-serious-injuries", "title": "Father accidentally kills son, 14-year-old Stephen Brumby, at Sarasota gun range", "dct": "Sun, 03 Jul 2016 17:01:00 GMT", "id": "31245351ce098d813482732fc5835cc2", "content": "Autoplay:Father accidentally kills son, 14, at Sarasota gun rangeCONNECTING...XFather accidentally kills son, 14, at Sarasota gun range\nA father accidentally shot and killed his 14-year-old son at a Sarasota gun range Sunday, according to a sheriff's office report.\nDeputies responded to an accidental shooting at the High Noon Gun Shop in Sarasota at 3:15 p.m. on Sunday.\nEmergency responders transported a 14-year-old boy, later identified as Stephen Brumby, to Sarasota Memorial hospital with serious injuries. He died at the hospital, according to officials.\nThe Sarasota Sheriff's Office combed through the scene, taking out several bags of evidence. Monday, the sheriff's office released a statement confirming the boy's father, 64-year-old William \"Clayton\" Brumby, fired the lethal shot.\nPer video evidence and witness accounts, a shell casing had bounced off the wall next to Clayton during target practice and landed in the back of his shirt. He then reached back with his right hand, still holding the gun, to remove the shell casing and accidentally fired off a round. The bullet hit his son, who was standing behind him.\nFAMILY IN MOURNING\nClayton was with three of his children at the range, including his 24-year-old son, 12-year-old daughter and Stephen.\n\"No matter how calm you try to stay, there's no way to wipe the images away from your mind of your little brother bleeding out in your arms,\" said David Brumby, Stephen's oldest brother.\nDavid Brumby, the 24-year-old son who was there at the range, spoke to us Monday and shared his loving memory of his brother. He called him a sweet kid, one of seven home-schooled children in the family.\n\"He was the most outgoing, gregarious, friendly, loving person that you'd ever know,\" David Brumby said.\nDavid told us the siblings were all very close and shared a love of music. Stephen played in the worship band at his family's church.\nThe family said they want to set the record straight about their father ever pointing the gun at Stephen. In an interview, they told us the medical examiner said the fatal shot went up toward the ceiling and ricocheted downward.\nThere is a GoFundMe page to help the family with expenses related to Stephen's death. You can visit that page here.\nThe shop commented on its gun safety programs in a Facebook post just a few weeks prior to the accident, saying, \"Properly trained kids don't have accidents.\"\nBut after what happened Sunday, the owners didn't want to comment on camera, only saying they offer condolences and prayers to the family of the teen killed.\nThe shop owner told us Monday that every safety protocol was in place, and said he couldn't have prevented this tragic accident even if he had been standing right there next to them.\n\"There was a freak breakdown in the personal safety of owning and operating a firearm that never should've happened. I'm not trying to blame anybody, won't place blame on anybody. All I can say is it was a freak thing, and our thoughts are with the family,\" said John Buchan, co-owner of High Noon Gun Shop.\nThe sheriff's office is continuing to investigate the incident, but said Monday morning there were no pending charges for the father."}