{"uri": "http://www.wtsp.com/news/local/sarasotacounty/sheriff-teen-died-after-being-shot-by-father/263182630", "title": "Teen accidentally shot at gun range, laid ro rest", "dct": "Sat, 09 Jul 2016 00:00:00 GMT", "id": "8a80227175bc73cb8530b5a8d4613f70", "content": "***UPDATE***\nA final goodbye to a Sarasota boy who lost his life in an unimaginable accident. Stephen Brumby's father -- accidently shot his son at a gun range.\nFamily and friends celebrated the 14-year-old's life at Bayside Community Church.\nHis sister and brother watched the freak accident at High Noon Gun Range.\nStephen loved playing the Ukele and he loved fishing.\nHis family has set up a memorial fund to help pay for the funeral and other expenses. It's currently raised more than $36,000.\n--\n14-year-old Stephen Brumby died Sunday as a result of an accidental shooting by his father at a gun range, according to the Sarasota County Sheriff's Office.\nInvestigators say around 3:15 p.m. 64-year-old William Brumby was in the last shooting lane with a wall to his right at the High Noon Gun Range at 4583 Bee Ridge Road.\nWilliam Brumby's 24-year-old son David and his 12-year-old daughter were also there and saw what happened. They were not hurt.\nDavid says, \"My dad was firing a .22 - just a little semi-automatic pistol. What happened was the ejected casing -- which is super hot -- bounced off the wall and ricocheted down my dad's shirt. Because it was super hot the knee jerk reaction was to try to brush it off and he pulled the gun hand up and tried to brush it off him and the gun went off into the ceiling and ricocheted into my little brother Stephen.\"\nStephen died at Sarasota Memorial Hospital.\nDavid told 10News WTSP that his father is struggling with what happened and is just trying to process it all. He says they've called in a grief counselor to help.\nDavid says, \"He wanted to take us to the shooting range to spend time with us but also teach us how to be a man; how to protect the family when it needed to be protected. It was just a complete freak accident. I cried so much yesterday that my eyes were stinging.\"\nHe says his brother loved playing the Ukele. From a Christian family with seven kids, Stephen also played piano for the worship band at their church and like most boys, he loved the great outdoors. David adds, \"He loved fishing. I know right now he's probably catching fish, a whole bunch of fish with Jesus.\"\nMeanwhile, High Noon Gun Range was open for business Monday but co-owner John Buchan was visibly upset over the accident. He says the Brumby family are more like family than customers. He adds, \"The worst possible thing that could possibly happen, happened. All of our thoughts and prayers are with the family. There are things that affect you. This did.\"\nBuchan says William was always trying to improve his shooting ability, teach the kids the right way, and implement all the safety features. He was a good guy -- teaching his kids the right way.\"\nThe Sheriff's Office said no charges are being filed against William Brumby."}