{"uri": "http://homicide.latimes.com/cause/gunshot/neighborhood/hyde-park", "title": "The Homicide Report", "dct": "Fri, 27 Jan 2017 00:00:00 GMT", "id": "f23957ef6a2b28b0913988950d79bbf8", "content": "Jacob Vincent Juarez, a 21-year-old Latino, was shot and killed Saturday, Jan. 7, in the 2600 block of West Slauson Avenue in Hyde Park, according to Los Angeles County coroner’s records.\nShortly before 9:30 p.m., people in the area heard arguing, then gunshots, said Los Angeles Police Det. Chris Barling.\nJuarez, who was discovered in the street suffering from gunshot wounds, was pronounced dead at the scene.\nPolice believe two Latinos ran east on West Slauson Avenue away from the scene. Authorities are looking for additional witnesses.\nAnyone with information is asked to call the LAPD's Criminal Gang Homicide Division at (323) 786-5113. Those who wish to remain anonymous can call Crime Stoppers at (800) 222-8477.\nKeenen Devontee Hogue, a 24-year-old black man, was shot and killed Wednesday, Aug. 31, in the 2300 block of West 54th Street in Hyde Park, according to Los Angeles County coroner's records.\nAbout 12:40 a.m., Hogue had had food delivered, took it upstairs to his apartment and went back downstairs to get change, said LAPD Det. Chris Barling. Hogue was standing on the sidewalk in front of his home waiting for change when he was shot, Barling said.\nHogue was taken to a hospital, where he was pronounced dead at 1:11 a.m., according to coroner's records.\nHogue did not have a criminal record or any gang ties, Barling said, and at this point, the killing looks like a case of gang members mistaking someone in the neighborhood for a rival gang member.\nAnyone with information is asked to call the Criminal Gang Homicide Division ...\nKenyada Thornton, a 27-year-old black man, was fatally shot Saturday, Aug. 13, in the 3300 block of West 63rd Street in Hyde Park, according to Los Angeles County coroner’s records.\nAbout 10:45 a.m., a man pulled up to where Thornton was standing, got out of a car and the two got into an argument, said LAPD Det. Chris Barling.\nThe man then pulled out a gun and shot Thornton. The person, described only as a black man, got into a dark sedan, which fled south on Crenshaw Boulevard, Barling said.\nThornton was taken to a hospital where he was pronounced dead at 11:14 a.m., according to coroner’s records.\nAnyone with information is asked to call the the LAPD's Criminal Gang Homicide Division at (323) 786-5113. Those who wish to remain anonymous can call Crime Stoppers at (800) 222-8477.\nContact the Homicide Report. Follow ...\nKeith Bursey Jr., a 31-year-old black man, was fatally shot by Los Angeles police Friday, June 10, near West Slauson and Brynhurst avenues in Hyde Park, according to Los Angeles County coroner’s records.\nAbout 8:30 p.m. gang officers stopped a car in the area. A man armed with a gun got out of the car, LAPD Chief Charlie Beck said. A scuffle ensued, Beck said, and at some point, police opened fire.\nBursey was taken to a hospital, where he was pronounced dead at 9:10 p.m., according to coroner’s records.\n“This is obviously a tragic incident for all involved, but there is nothing on the face of it that would cause me to think that the officers were doing anything but their jobs,” Beck told police commissioners June 14.\nBursey’s sister, Kia Bursey, questioned the police account and wondered why officers approached the ...\nAndre Alexander Howard, a 23-year-old black man, was fatally shot Saturday, Feb. 6, in the 3400 block of West 67th Street in Hyde Park, according to Los Angeles County coroner’s records.\nAbout 12:45 p.m., Howard was standing in the area when a person rode up on a bicycle, LAPD Det. Chris Barling said.\nThere was a small verbal exchange, then the man pulled out a gun and shot Howard.\nHoward ran east and collapsed at the back door of a beauty salon, Barling said.\nHe was pronounced dead at the scene at 1 p.m., according to coroner’s records.\nSo far, the gunman has been described as a Latino in his late teens or early 20s, Barling said.\nThe killing does not appear to be racially motivated, he said.\nAnyone with information is asked to call the Criminal Gang Homicide Division at (323) 786-5113. Those ...\nJamarie Jones, a 16-year-old black teenager, died after he was shot Friday, Jan. 29, in the 4400 block of Crenshaw Boulevard in Hyde Park, according to Los Angeles County coroner’s records.\nAbout 11:50 p.m., Jones and three others were in a light-colored Toyota Camry about to pull into a parking lot when a man opened fire at the car, LAPD Det. Dave Garrido said.\nThe other people in the vehicle ran away. Jones was struck and was pronounced dead at the scene at 12:02 a.m. Jan. 30.\nAnyone with information is asked to call the Criminal Gang Homicide Division at (323) 786-5110. Those who wish to remain anonymous can call Crime Stoppers at (800) 222-8477."}