{"uri": "http://blogs.sacbee.com/crime/archives/2013/08/homicide-suspect-denies-involvement-in-valley-hi-shooting-of-four.html", "title": "Homicide suspect denies involvement in Valley Hi shooting of four", "dct": "Wed, 07 Aug 2013 00:00:00 GMT", "id": "dcceff09e21a97f606750a0a08d6c86a", "content": "The 19-year-old man accused of shooting four teens at a Valley Hi house party in June - killing one of them - said today that he had nothing to do with the shooting, and wondered aloud how Sacramento police settled on him as a suspect.\n\"Why would my name come up?\" Elijah Rodgers asked during an interview with The Bee at the Sacramento County Main Jail.\nAsked why he thought detectives might suspect him, he tugged at his shoulder-length dreadlocks and said: \"I think it's my hair.\"\nPolice arrested Rodgers on Tuesday after he was released from a local hospital, where he had been treated since July 17 when homicide detectives shot him during a confrontation in which detectives say they saw Rodgers armed with a handgun.\nDetectives had wanted to talk to Rodgers about his suspected involvement in the June 23 shooting on Sea Drift Way. Alvin Saivon Valentine, a 19-year-old Kennedy High School graduate who worked at a local nursing home, died in the melee. A 15-year-old girl, a 17-year-old boy and an 18-year-old man suffered gunshots but survived.\nPolice suspect the incident was gang-related, but said they do not believe Valentine was an intended target.\nOn Tuesday, police arrested Rodgers on suspicion of murder and shooting into an occupied dwelling in connection with the Sea Drift Way shooting. In a separate case related to the day he was shot, Rodgers also was arrested on suspicion of possession of a concealed firearm, possession of cocaine for sale and resisting arrest.\nRodgers is expected to appear in court Thursday for arraignment on all five felony charges.\nPolice also have arrested a 17-year-old teen they describe as being an \"active participant in the shooting.\" The teen was booked into juvenile hall July 27 on suspicion of assault with a deadly weapon, shooting into an inhabited dwelling and negligent discharge of a firearm, according to police.\nRegarding the day he was shot, Rodgers said he does not remember running from the police, as they have said happened. In fact, Rodgers said he doesn't remember much about his interaction with the detectives: He also admitted to being high on cocaine that day - cocaine that he had on his body for personal use and not for sale, he said, as police allege. Rodgers said he also was high on pot and possibly an Ecstasy pill, adding that he had a \"lot of narcotics in my body.\"\n\"All I remember is walking to the store and waking up in the hospital bed,\" he said.\nAs for the gun that police said he had in his possession, Rodgers said he wasn't sure - but that it was possible. He said he sometimes carries a gun for protection in his rough neighborhood.\n\"Right there on Elder Creek (Road) is pretty dangerous,\" he said.\nAnd as for the homicide, Rodgers claims he was never at the Sea Drift Way party and that he rarely ventures out of his Elder Creek Road neighborhood. Despite sometimes carrying a gun, Rodgers said he has never pointed one at anyone, let alone fired one.\n\"I'm not really into violence,\" he said. \"I just try to protect my own self.\""}