{"uri": "http://www.theindychannel.com/news/crime/double-shooting-leaves-2-people-dead-in-beech-grove", "title": "Double shooting leaves two people dead in Beech Grove", "dct": "Sat, 07 Jan 2017 13:47:00 GMT", "id": "346f966fdb76e6dae8a7774b60f5d962", "content": "Autoplay:Beech Grove mayor gives details on overnight double shootingCONNECTING...\nBEECH GROVE, Ind. – Two people were found dead, including a 14-year-old boy, after they attempted to rob two people sitting in a vehicle in Beech Grove early Saturday morning.\nThe Mayor of Beech Grove, Dennis Buckley, said the two male suspects, ages 14 and 29, were casing the outside of The Grove sports bar in the 3200 block of South Emerson Avenue around 1 a.m.\nTwo security guards, a mother and son, sitting in a vehicle saw the suspects and one of them decided to call 911. Police said the suspects then walked up the vehicle and attempted to rob them.\nBuckley said when the 14-year-old told the guards “give me everything you have,” the suspects were shot by the male sitting in the driver’s seat of the vehicle.\nThe guard fired at least four shots, striking one suspect in the chest twice and hitting several vehicles in the car lot across the street, said Buckley.\nOne of the suspects shot was 29-year-old Seth Easley, police said. The 14-year-old was a student at IPS Tech High School. The Marion County Coroner says the teen's death was a homicide and he was shot three times in the torso.\n“Throughout all of this you have to have respect for the deceased, no matter what they’ve done,” said Buckley. “I was very proud that the police department treated both of the suspects with dignity but I am very disheartened with society. We can do a lot better. There is something wrong when we have 14-year-old kids…14-year-old kids should be home.”\nThe two guards were interviewed by police but then released.\nBuckley said the gun used by the 14-year-old during the attempted robbery was stolen from Greenwood. He does not believe the guards will face any charges.\nDuring the incident that happened outside of The Grove, the business continued to operate as normal.\n“I was very disappointed with The Grove tavern because they continued to do business when there is two people laying out in the street,” said Buckley.\nThe names of the guards have not been released by police.\nIf you have any information on this case, call Crime Stoppers at (317) 262-TIPS.\nCopyright 2016 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}