{"uri": "http://wishtv.com/2017/01/07/2-dead-following-shooting-outside-beech-grove-bar/", "title": "Police identify man killed in double fatal shooting outside Beech Grove bar", "dct": "Sat, 07 Jan 2017 05:55:00 GMT", "id": "de3cd0af9dee50b08b4b1a2569ea54b9", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nINDIANAPOLIS (WISH) — Two people are dead after a shooting in Beech Grove.\nIt happened outside of The Grove bar on South Emerson Avenue and Alton Street around 1:15 a.m. Saturday morning.\nAccording to Beech Grove Mayor Dennis Buckley, the two were shot and killed when they walked up to two armed security guards that were sitting in a vehicle outside of the bar and pulled a gun on them.\n“The two deceased walked up to the car, pulled a gun on the two security guards and said give me everything you have and they said we don’t have anything except the cell phone. He said give me your cell phone,” said Buckley.\nThe security guards were a mom and son. According to Buckley, the son was the one who shot the two. Both were pronounced dead on scene.\nPolice have identified the 29-year-old man killed as Seth Easley. The identity of the 14-year-old boy also killed has not yet been released.\nAccording to Buckley, the 14-year-old was the one who allegedly pulled the gun on the security guards. He said the gun was loaded and reported stolen from Greenwood. He said Easley did not have a gun on him.\nNobody else was injured, but police say situations like this put the whole community at risk.\n“We don’t want anybody to die during a robbery, I mean that is not the sentence for robbery, death, but if you do a robbery things like this can happen to the person doing the robbing, to the other person, to somebody just in the neighborhood,” said Captain Robert Mercuri of the Beech Grove Police Department.\nDoug Pettigrew, the owner of the bar, said that the security guards had noticed the 14-year-old and Easley acting suspiciously before they approached the vehicle.\n“As far as I’m concerned my security did their job,” said Pettigrew. “Nothing happened in here which is what we’re after.”\nBoth security guards were interviewed by detectives and released. Detectives will meet with prosecutors in the coming days. The mayor says charges in this case are unlikely.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}