{"uri": "http://www.lohud.com/story/news/crime/2016/08/31/suspects-shooting-4-year-old-arraigned/89663774/", "title": "Suspects in shooting of 4-year-old arraigned", "dct": "Wed, 31 Aug 2016 00:00:00 GMT", "id": "b841245591bafad35809e4d6144cc14b", "content": "Two men accused in the mistaken shooting of a 4-year-old girl in Yonkers were arraigned Wednesday.\nActing Westchester County District Attorney James A. McCarty said that Floyd Bruce, 19, of 354 Nepperhan Ave. in Yonkers fired a .22-caliber semi-automatic pistol, striking the girl in the leg, on July 16 on Willow Street in Yonkers.\nMcCarty said the girl was not the intended target.\nBruce was identified after investigators reviewed security camera footage and collected shell casings from the scene.\n\"It is certainly egregious that someone would actually commit a violent crime while small children are in such close proximity,” Detective Lt. Patrick McCormack said earlier this month. “Our detectives were immediately struck by this when they first viewed video of this crime. I think this is why they worked so hard to identify and arrest this violent suspect.”\nEARLIER STORY: Arrest made in 4-year-old's shooting\nTen days after the shooting, police say, Bruce and a second man linked to the girl's shooting, Lamont McLean, 23, also of 354 Nepperhan Ave., robbed two men in a parked car at gunpoint then ran from the scene.\nBruce and McLean were arrested by Yonkers police the next day, with a .22-caliber handgun found in Bruce’s possession matched to the shooting by ballistics tests, police said.\n(Photo: Photo: Yonkers Police Department)\nBruce was charged with one count of second-degree attempted murder, two counts of first-degree robbery, one count of first-degree attempted assault, one count of second-degree robbery. two counts of criminal possession of a weapon, two counts of assault, one count of first-degree reckless endangerment and one count of criminal possession of marijuana.\nMcLean was charged with two counts of first-degree robbery and one count of second-degree robbery.\nBoth defendants pleaded not guilty and were sent to the Westchester County Jail. They are expected to return to court on Sept. 27.\nBoth defendants face a maximum of 25 years in state prison, according to the DA’s office. Deputy Bureau Chief Nadine Nagler of the Career Criminal Division is prosecuting the case."}