{"uri": "http://www.wsmv.com/story/30184612/toddler-shot-killed-in-clarksville-2nd-victim-in-critical-condition", "title": "Toddler killed, adult critically injured in Clarksville shooting", "dct": "Mon, 05 Oct 2015 09:22:00 GMT", "id": "68b305462456fce786c0aa12b02a3642", "content": "CLARKSVILLE, TN (WSMV) -\nThe search continues for the gunman who killed a 2-year-old boy and critically injured an adult man in Clarksville.\nPolice were called out to the 900 block of Princeton Drive just after 11 p.m. Sunday.\nAccording to officers, 2-year-old Joseph Bankston was at was at home with his grandmother, mother, her boyfriend and Joseph’s 1-year-old sister when the shooting happened.\nCandace Johnson, a neighbor and Joseph’s babysitter, told Channel 4 she received a frantic call from the grandmother telling her to call 911. She said someone knocked on the door, broke in and started shooting.\n“She just called me and she was yelling, telling me to call 911,” Johnson said. “I called 911, and she told me Joseph had been shot.\nJohnson said Joseph was shot in the head and killed. His mother’s boyfriend, 22-year-old Brandon Jimenez, who was stationed at Fort Campbell, was also shot. He was flown to Vanderbilt University Medical Center, where he remains in critical but stable condition.\nNeighbors said there are a lot of children and some military families in the neighborhood.\n\"I'm like, who could it be, you know? I think that car drives around here a few times and if someone had maybe turned him in or said something weird was going on before, it wouldn't have happened,\" said neighbor Jennifer Marchisio.\nPolice told Channel 4 they need the public’s help in finding Joseph’s killer, who remains on the run.\n“If anybody knows anything, please come forward,” Johnson said. “He doesn’t deserve to die that way.”\nThe suspected gunman is described as a black man who was wearing a long black coat with a hood and a gray checkered shirt. He was driving a maroon or red Chevrolet Impala. Witnesses said the Impala may have a loud engine and tinted windows.\nAnyone with information about the shooting is asked to call Detective Tim Anderson at 931-648-0656, ext. 5132, or the Crime Stoppers TIPS Hotline at 931-645-8477.\nJoseph would have celebrated his third birthday in a few days. A GoFundMe page has been set up to help his family with expenses. An account \"Justice for Joseph\" has also been set up at US Bank.\nCopyright 2015 WSMV (Meredith Corporation). All rights reserved."}