{"uri": "http://www.theleafchronicle.com/story/news/2015/10/15/suspects-gun-matched-shells-crime-scene/73999770/", "title": "Gun, sketch led Clarksville police to suspect in toddler killing", "dct": "Thu, 15 Oct 2015 00:00:00 GMT", "id": "dfbc4839c10041131f1de1bbbe379ccb", "content": "CLARKSVILLE, Tenn. — A man accused of intentionally killing a toddler was arrested after a pistol found in his vehicle was linked to fired shell casings at the crime scene, according to an arrest warrant.\nZackery James Alexander, 21, of Hopkinsville was arrested Wednesday night and charged with criminal homicide in the Oct. 4 slaying of 2-year-old Joseph Bankston.\nClarksville Police Chief Al Ansley said Thursday that the shootings were deliberate and the home where the boy was killed was not randomly selected but he did not say why.\n\"The public does not need me telling them what a heinous crime this was, how awful it was, but I would like to clarify that this was an intentional shooting of this infant,\" Ansley said in an interview with The Leaf-Chronicle. \"This was not accidental.This infant was intentionally shot and killed... We have people in this community that can do something like this. It even shocks us and we've seen it all.\"\nAnsley said the child and 23-year-old Brandon Jimenez were both shot multiple times. Joseph's mother, grandmother and two other children were also inside the Princeton Street.home when he and Jimenez were shot but they were not injured, the chief said.\nSketch leads to suspect\nJimenez was critically injured but was able to work with a Tennessee Bureau of Investigation artist to produce a sketch of the suspect. That sketch led police to look at photographs of Alexander and similarities were noted, the arrest warrant says.\nAnsley also said \"the murder weapon\" was found in a vehicle owned by Alexander.\nAlexander gave police permission to search his vehicle Wednesday and a .40-caliber Smith & Wesson pistol was found. It was sent to the TBI crime lab and \"was a positive match to having fired shell casings recovered at the scene of the homicide,\" the warrant says.\nAlexander's arrest came 10 days after the child's death and on the same day police released the sketch and Gov. Bill Haslam announced a $15,000 reward for information \"leading to the apprehension, arrest and conviction of the person or persons who have committed, attempted to commit or conspired to commit the murder of Joseph Bankston.\"\nAnsley said that the reward did not lead to Alexander's arrest but is helping the police department get more tips. The sketch was very important, along with the cooperation of other agencies.\n'This was not a random act'\nThe Tennesse Bureau of Investigation's crime lab was able to match the gun to shell casings found at the crime scene the same day the weapon was found, Ansley said. The CPD detectives assigned to the case worked many \"sleepless nights\" to solve the crime and were helped by other agencies, he said. That helped them make an arrest\n\"The result was good cooperation with all these agencies and just damn good police work by our homicide division,\" he said.\nCPD was helped by TBI agents and crime lab, Fort Campbell's Criminal Investigations Division, the District Attorney's Office and the Governor's Office.\n\"It's an incredible job by everybody involved and we appreciate the cooperation from other agencies,\" he said.\nAnsley said the case is still under investigation and he could not release details that may jeopardize it.\n\"This was not a random act, this was a deliberate act, but I'm not ready to tell you what the motive was because we don't know for sure,\" he said. \"He didn't just start popping rounds at everyone else and happen to hit a child.... He didn't just walk in and decide to kill a 2-year-old kid. It was deliberate. That home itself, it was a deliberate act.\"\n'Really upsetting to all'\nHe said the case was a hard one for everyone involved, and especially those closest to the investigation.\n\"There are some evil people in this community capable of doing something like this but at the same time, this is a testament to how quickly we all come together, everybody cooperates — Fort Campbell, the police department, the state, the governor, you name it. It's just a testament to how people are in this community and this state and it's outstanding,\" he said. \"Anytime you have a defenseless, harmless victim, as we did in this case, it is just really upsetting to all of us.\"\nJimenez remained in critical condition at a Nashville hospital Thursday, said CPD spokeswoman Natalie Hall.\nHe is a medic with the 86th Combat Support Hospital at Fort Campbell.\nAlexander is a private with the 101st Airborne Division.\nAnsley said he does not believe Jimenez knew Alexander, but because the investigation was still in its early stages he could not say for sure.\nAlexander was booked into the Montgomery County jail shortly after 11 p.m. Wednesday night on a $5 million bond.\nA court date was set for Oct. 21.\nBankston and Jimenez were shot at the child's home at 935 Princeton Drive on Oct. 4. According to the news release, Alexander's birthday is also Oct. 4.\nThe investigation is ongoing and anyone with information related to this incident is urged to contact lead Det. Tim Anderson (931)-648-0656 ext 5132 or CrimeStoppers TIPS Hotline at 931-645-TIPS (8477)."}