{"uri": "http://www.brainerddispatch.com/news/3937780-itasca-county-teen-charged-friends-shooting-death", "title": "Itasca County teen charged in friend's shooting death", "dct": "Mon, 01 Feb 2016 21:25:00 GMT", "id": "64f25d50dfb278417a5860f881cc3711", "content": "GRAND RAPIDS, Minn. -- An Itasca County teen has been charged in the accidental shooting death of his friend in November.\nA criminal complaint filed last month in State District Court in Grand Rapids charges Walter Everett Charwood, 18, with first-degree manslaughter in the Nov. 29 death of 17-year-old Dallas James Graciano.\nGraciano was found dead in Charwood's Squaw Lake home, according to court documents. Charwood was initially arrested but released on his own recognizance pending further investigation.\nAccording to a criminal complaint filed on Jan. 12:\nItasca County Sheriff's Office investigators were dispatched to the Squaw Lake residence shortly after 11:30 a.m. after Charwood called 911 to report that he had accidentally shot his friend. Graciano was found dead in Charwood's bedroom.\nInvestigators interviewed another friend who said the three of them were preparing to leave the residence when Charwood picked up a rifle and loaded some rounds into the chamber.\nCharwood closed the chamber, flicked off the safety and turned toward Graciano when the gun discharged, the friend reported. The witness said Graciano fell to the ground and Charwood ran outside, dropping the gun on the porch and calling 911.\nIn a follow-up interview, the friend told authorities that it was not out of the ordinary for Charwood to take the rifle outside and shoot, but said he didn't typically load it in the house. He stated that he believed Charwood was trying to \"be cool\" by flicking the safety off and spinning.\nCharwood also spoke with investigators and acknowledged that he picked up the firearm, loaded it and turned the safety off while turning in the room. Charwood said he was attempting to turn the safety back on when the weapon discharged and Graciano fell to the floor.\nCharwood told the investigators that he typically loads the gun outside the residence and that he was not sure why he decided to load it inside. He stated that the shooting was accidental and that he and Graciano were \"best friends\" and \"like brothers.\"\nAn autopsy found that Graciano died of a single gunshot wound. The bullet, which was found lodged in the bedroom wall, entered his upper torso and exited through his neck, according to the report.\nInvestigators said there were no indications of alcohol or drug abuse being a factor in the shooting.\nThe first-degree manslaughter charge alleges that Charwood unintentionally caused Graciano's death while committing the misdemeanor crime of reckless handling or use of a gun. If convicted, the charge carries a maximum sentence of 15 years in prison.\nCharwood's next court appearance is scheduled for March 8.\n---\nBy Tom Olsen\nForum News Service\nThe Forum Communications News Service is the premier news wire service covering the Upper Midwest, including the Dakotas, Minnesota and Wisconsin. In addition to breaking and enterprise news, we offer a wide variety of sports, features, business, agriculture, outdoors and opinion content. For more information about the services we offer or to discuss content subscriptions, please contact us."}