{"uri": "https://www.facebook.com/HunterStrong07/?hc_ref=PAGES_TIMELINE&fref=nf", "title": "HunterStrong", "dct": "Tue, 27 Dec 2016 00:00:00 GMT", "id": "41a00a2e9402fa2fdb3e4fc28be6df2a", "content": "Hunter was in a hunting accident Christmas Eve. He is currently in the ICU at UMass in Worcester. He will be in the ICU indefinitely, and will have a long road to recovery after that. If you can, please donate to the Go Fund Me page we have created. Any denomination will help! if you can't donate, please like this page and share the link. Thank you!\nhttps://www.gofundme.com/7m-hunter-strong\nUpdate #32 on Hunter... Hunter's doing much better!... I asked his nurse to give him a bath because he stinks!... He had a really good night of deep sleep!... He sat up in the chair today and he's off of the oxygen and breathing on his own.... They've taken 3 X-rays so they can decide when to take out the drainage tubes out of his chest... He still has to cough up more gunk out of his lungs so he doesn't get pneumonia again... He's off of all IV medications except the epidural and the only medications he's taking are in pill form... He's eating regular food and we just went and got him a chocolate shake from 5 Guys so he's definitely on the mend!... We're optimistic of his recovery but he still has a long road ahead of him and he's not out of the woods yet!\nI will do my best to keep everyone updated on Hunter's condition as we get info from his parents. Here is the most recent update from Hunter's mom, LeeAnna...\nUpdate #19 on Hunter... Hunter was moved to a new room last night! It's quieter and bigger so his stats seem to be doing better! They've dropped his Fentanyl and Versed by 1/2... They've increased his Oxycodone which is taken as a crushed up pill and then is mixed with Tylenol and the PTSD med... They're waiting until tomorrow to decide when they might take out the chest tube and air tube... His temperature always seems to go up in the late morning so we're on iced wash cloth duty!... He's breathing on his own but he's not strong enough to be off of the machine just yet... Keep those prayers coming because they're working❣"}