{"uri": "http://www.houmatoday.com/news/20170104/fifteen-local-murder-cases-set-for-trial-this-year", "title": "Fifteen local murder cases set for trial this year", "dct": "NODATE", "id": "a2deb5fa8485eb577a776aaecc221585", "content": "Fifteen murder cases are set for trial this year in Terrebonne, Lafourche and Assumption parishes, though dates are all subject to change.\nA first-degree murder conviction carries a mandatory sentence of life in prison without the possibility of probation, parole or suspension of sentence. Prosecutors may also seek the death penalty.\nThe only penalty for second-degree murder is life in prison without the possibility of probation, parole or suspension of sentence.\nA principal, or accomplice, can face the same penalty even if he doesn't directly commit the murder. An accessory after the fact - someone who helps an offender after a felony with the intent that he'll avoid criminal consequences - can face up to five years in prison.\nThis list does not include manslaughter, vehicular homicide or negligent homicide cases nor any murder cases not yet set for trial.\nTERREBONNE\nKyle Cedotal, 31; Joshua Babin, 22; and Tiffany Dardar, 32, are set for trial Jan. 9. Cedotal is charged with second-degree murder in the shooting of Robert Swan, 24, while Dardar is charged as a principal and Babin is charged as an accessory after the fact. Swan's body was found Oct. 7, 2015, in a car in a Gibson driveway. Investigators believe the murder was drug-related.\nSimon Quinn, 47, is set for trial Jan. 9. He is charged with second-degree murder in the death of Robbie Coulon, 46, whose body was found May 14, 2015, in a Cocodrie waterway. An autopsy showed the cause of death was asphyxiation. Authorities said Quinn and Coulon were close associates but had gotten into an argument.\nAnthony Sylvester, 27; Elward Williams, 23; and Maurice Banks, 25, are set for trial Jan. 9 in an Oct. 28, 2015, quadruple shooting on Morgan Street in Houma that left Corey Butler, 18, dead. Sylvester and Williams are charged with second-degree murder, and Banks is charged as a principal to the crime.\nShantelle White, 28, is set for trial Jan. 9, and Charles Hammonds III, 19, is set for trial March 20. They are charged with second-degree murder in the heroin overdose of Christy Hurst, 35, whose body was found Dec. 3, 2015, inside in a room at the Economy Inn in Houma.\nZamante Alvis, 15, and Denzel Brown, 17, are set for trial Jan. 17. They are charged with second-degree murder and being tried as adults in the July 10 shooting of Roderick Davis Jr., 17, in Scott Lane Park in Houma. Investigators said an argument started after Davis and the suspects entered the park.\nAhmad Lawson, 26, and Joshua Swan, 24, are set for trial Jan. 17. They are charged with second-degree murder in an Oct. 21, 2015, double shooting that killed Willie Hart Jr., 36, on Roselawn Avenue in Houma.\nTerrance Moore, 31; Michael Scott, 39; and Sophia Smith, 28, are set for trial Jan. 17 in the Nov. 11, 2015, shooting of Ernest Sims, 38, outside his Ashland North home. Moore is charged with second-degree murder, while Scott and Smith are charged as accessories after the fact.\nTreyvance Fanguy, 21, is set for trial Feb. 21. He is charged with second-degree murder in the Aug. 8, 2013, shooting of Vincent Naquin, 20, at Naquin's residence on Louise Street in Houma. Authorities said Naquin sold marijuana out of his home and that the killing occurred during a botched armed robbery.\nJalen Francis, 22, is set for trial Feb. 21. He is charged with first-degree murder in the Dec. 18, 2013, shooting of Elizabeth Davis, 25, during what authorities said was a drug deal in the Smithridge community.\nKenny Veal, 28, is set for trial Feb. 21. He is charged with second-degree murder in the June 13, 2015, shooting of Roosevelt Stewart, 68, on North Bayou Black Drive in Gibson.\nBrandon Robinson, 20; Tyren Joseph, 21; and Cyrus Carter, 19, are set for trial March 1 in the shooting of Kardale Johnson, 21, whose body was found Jan. 17 inside a car in a field off of Payne Street in Houma. Robinson is charged with first-degree murder, Joseph is charged with second-degree murder, and Carter is charged as an accessory after the fact. Authorities said the killing was drug-related.\nDavonta Verret, 19, is set for trial March 1. He is charged with second-degree murder in the Dec. 4, 2015, shooting of Davonte Maryland, 21, during a dice game at a Houma trailer park.\nJoshua Calloway, 26, is set for trial April 17. He is charged with second-degree murder in the shooting of Kerry Randolph, 56, whose body was found July 10 inside a pickup truck outside Bottoms Up bar in Houma.\nLAFOURCHE\nToronzo Thompkins, 38, and Traveyon Blackledge, 21, are set for trial Jan. 24. They are charged with second-degree murder in the shootings of Nikki Landry, 41, and Harry Lefort, 54. The victims' bodies were found Sept. 22, 2013, in Landry's Larose apartment. Investigators believe Thompkins ordered Blackledge, who is his son, and Jerrard Major, 38, to kill Landry, a police informant set to testify against him in his cocaine distribution trial. Thompkins was convicted of that charge and is serving a life sentence. Major is set for a hearing Jan. 20 on a motion to suppress his police statement.\nASSUMPTION\nMatthew Jordan, 28, is set for trial April 5. He is charged with second-degree murder in the Sept. 14, 2014, shooting of Franky Joseph, 33. Authorities say the killing occurred during a fight at the Alexis Sports Bar in Paincourtville.\n-- Staff Writer Bridget Mire can be reached at 448-7639 or bridget.mire@dailycomet.com. Follow her on Twitter @bridget_mire."}