{"uri": "http://www.columbiatribune.com/news/crime/columbia-police-looking-for-man-charged-in-vfw-shooting/article_fbc63096-3917-5c52-b2de-e5706881ed5c.html", "title": "Columbia police looking for man charged in VFW shooting", "dct": "Wed, 09 Sep 2015 00:00:00 GMT", "id": "266518fdd9d92e10b2ce10a37f8c48a4", "content": "Columbia police on Wednesday were looking for a Boonville man charged in connection with a Saturday morning shooting that injured four people at VFW Post 280.\nProsecutors charged Louis Lee Green Jr. on Tuesday in Boone County Circuit Court with four counts of first-degree assault and one count of armed criminal action. Bond was set at $500,000 cash-only.\nPolice were dispatched to the post at 1509 Ashley St. at 12:50 a.m. Saturday. When officers arrived they found one victim with a gunshot wound to her abdomen who was taken to a hospital by ambulance. Three others with gunshot wounds were taken to hospitals in private vehicles.\nAccording to a probable cause statement, a fight broke out during a party at the VFW post and security staff told everyone to leave. A VFW official said over the weekend that the party was an album release event. As people were passing through a hallway leading to the front door, a black man with dreadlocks fired a gun into the crowd, the probable cause statement said. On Saturday police said the shooter fired from the parking lot at the building, though the probable cause statement does not say whether the shooter was outside the building.\nOne of the victims told an investigator she was standing about 15 feet from the gunman when the shooting began. The victim, who recognized Green as one of her Facebook friends, said she saw Green with the gun facing the crowd and watched as he shot at her.\nPolice on Wednesday didn’t have any information about how the victims were recovering, said Officer Latisha Stroer, CPD spokeswoman.\nStroer said Green should be considered armed and dangerous. He is described as 6 feet tall, weighing 170 pounds, with black hair and brown eyes.\nPolice ask anyone with information about Green’s location to call the police department at 573-874-7652 or Crime Stoppers at 573-875-8477 to remain anonymous.\nThree glass doors were replaced and the building sustained other damage, post quartermaster and canteen manager Kim Wischmeyer said on Saturday. Staff also cleaned up blood in the building. Those who rent the VFW for events are responsible for damage costs, he said.\nNo one responded by the Tribune’s deadline to messages left Wednesday at the post. No photo of Green was available Wednesday morning."}