{"uri": "http://www.roanoke.com/news/crime/roanoke/roanoke-man-arrested-in-shooting-death-of--year-old/article_10568ca3-fd7d-588c-a283-87dc84354429.html", "title": "Roanoke man arrested in shooting death of 2-year-old girl", "dct": "Fri, 17 Jul 2015 07:27:00 GMT", "id": "fef862961d77ed45d1b17c83a39b0100", "content": "Police said Aryah Leigh Lipford, 23 months, and Rachael Quesenberry, 26, were found Friday with gunshot wounds in the street in front of this house on Oakland Boulevard.\nView all 2 images in gallery.\nPolice found Aryah Leigh Lipford and 26-year-old Rachael Quesenberry in the street when they arrived at the residence on the 3100 block of Oakland Boulevard Northwest off Williamson Road at 9:22 p.m.\nAryah was pronounced dead after she was taken to Carilion Roanoke Memorial Hospital. She would have turned 2 years old on July 24, relative Jasmine Washington said.\nCarilion officials had no information on Quesenberry’s condition or status as a patient as of Friday afternoon.\nRoanoke police spokesman Scott Leamon said the department is not releasing additional information about the victims’ injuries due to the investigation. He also declined to say whether either victim was conscious and whether Aryah was alive when police arrived on scene.\nWarner Lovings Hunter III, 25, was arrested by state police at a house in Covington about 1 a.m. He was taken to Roanoke City Jail, where he remains without bond. He is charged with second-degree murder and malicious wounding.\nThe victims were shot in the street in front of Hunter’s home. Hunter fled in a 2007 silver Mazda, according to police.\nWashington, the mother of Aryah’s second cousin, said she had not met Hunter prior to the shooting and was unaware that Quesenberry had been in a relationship with him. Washington said Aryah and her 2-year-old daughter often played together.\n“She was a sweet baby,” Washington said. “They would dance together all the time. Any song you play, when they heard music they had to dance.”\nJennifer Stewart, a neighbor who lives close to Hunter’s residence, said she was watching television when she heard the shots. She said she heard two shots fired together and a third fired a few seconds later.\n“It was really scary when I came outside and realized it wasn’t fireworks, it was actually gunshots,” Stewart said. “I was standing on my sidewalk and I could hear a woman screaming. I heard a little boy screaming for his mom and saw a police officer carrying a child with no shirt and no shoes on to a police car.”\nLeamon said a second child was placed in the care of other family members. Additional information about that child was not immediately available.\nStewart said she has never interacted with Hunter, Quesenberry or any children in the residence. She said Thursday’s shooting is the only time in the eight years she’s lived in the neighborhood that she remembers a violent crime taking place.\n“I’ve seen pictures on the news of the suspect and I don’t even recognize that person,” Stewart said. “This kind of thing just doesn’t happen here. We have kids doing Easter egg hunts and vacation Bible school right across the street.”\nLeah Fleming, another neighbor, said she had only spoken with Hunter in passing since he arrived in the neighborhood about two years ago. Fleming first noticed Hunter taking walks with Aryah six months ago.\n“He was always a real nice, quiet guy. He kept to himself,” Fleming said. “He would say ‘Hey, what’s up?’ But we never had a full conversation.”"}