{"uri": "http://wtkr.com/2016/06/21/one-dead-two-injured-in-early-morning-shooting-in-norfolk/", "title": "17-year-old killed, two injured in early morning shooting in Norfolk", "dct": "Tue, 21 Jun 2016 03:36:00 GMT", "id": "20ed2c30627d6a615818e84b04244623", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nNORFOLK, Va. - A 17-year-old is dead and two other people are in the hospital after a shooting Tuesday morning in Norfolk.\nPolice were called to the 400 block of North Military Highway just after midnight where they found two people with gunshot wounds.\nBoth were transported to Sentara Norfolk General Hospital, where one was pronounced deceased. That victim has been identified as 17-year-old Don Demetrius Brown, Jr.\nBrown's immediate family was too upset to talk to News 3 on Tuesday. At the shooting site, several of Brown's loved ones came out to remember him, including one of his teachers.\n\"He kept everyone laughing and always had stories to tell and always had a smile on his face,\" explained Kristin Ramussen, Brown's Resource Teacher at Renaissance Academy.\nRamussen brought a sealed letter and rose for Brown. She wasn't the only one to come to the scene. Destiny Clark, a longtime friend of Brown's also came out. She told News 3 Brown asked her to hang out on Monday, but didn't feel like going.\n\"It's hard because I just talked to him earlier yesterday and he asked me to come and see him but I didn't feel like it because it was hot, but now I regret not going,\" Clark explained.\nBrown's loved ones say they don't know why he would have been out on Military Highway when the shooting happened. They say they also don't know who would want to hurt him.\nPolice have not released the names of the other two people shot, but say one was transported with Brown to the hospital. The other walked into Sentara Leigh Hospital shortly after the shooting. Both have non-life threatening injuries and are expected to be okay.\nAt this time police have not released any suspect information. The incident remains under investigation.\nIf you know anything that can help police, take action and call the Crime Line at 1-888-LOCK-U-UP."}