{"uri": "http://wivb.com/2014/08/12/four-people-shot-one-person-dead/", "title": "Four teens shot, one fatally, near Rt. 33 in Buffalo", "dct": "Tue, 12 Aug 2014 16:32:00 GMT", "id": "ffa9f863f3a9fbeaa16b4e25c45d2487", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nBUFFALO, N.Y. (WIVB) – Buffalo Police say four male teenagers were shot, one fatally, Tuesday afternoon.\nThe shootings happened just after 3:30 p.m. at the footbridge on Oakmont Avenue, which goes over Rt. 33 near Roosevelt Park. That is in the Langfield Homes on the city’s east side.\nOne teenager was declared dead at the scene. According to authorities, the three others who were shot suffered non-life threatening injuries. Tuesday evening two were released from ECMC and the other was released from Women and Children’s Hospital.\nPolice are looking for a lone male suspect, believed to be in his 20s. Anyone with information should call the Buffalo Police confidential TIPCALL line at 847-2255.\nNeighbors were shocked by the violence. The Stop the Violence Coalition stopped by Tuesday night, but the storm had chased residents inside. They plan to return Wednesday to encourage residents to talk about what they know.\n“We need to be more active. Stop hiding behind the curtains. Step out and say enough is enough, we need to stop this,” said Rita Turner, who works with the Coalition.\nReverend Al Wilson from the Martha Mitchell Community Center says he knows the victim. The center is less than a block away from the shooting and feeds around 300 kids breakfast and lunch each day.\n“They come into the center all the time and it’s very sad,” Wilson said.\nCommunity members are already talking about ways to help stop this violence from happening again.\nDawn Sanders-Garrett, executive director of the Buffalo Municipal Housing Authority, says the organization wants to “provide activities for the children, so they have positive way to work with one another and to be engaged with their local communities.”\nWilson says the healing process will be hard but the community should stick together. He told News 4, “It’s time to get together and pray for our community. It’s time for us to open up our doors and our hearts and actually do something to transform lives.”\nThe Martha Mitchell center will have grief counseling available. Crisis Services will also be available and can be reached at 834-3131.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}