{"uri": "http://www.cleveland.com/court-justice/index.ssf/2016/10/witness_in_warrensville_height_1.html", "title": "Witness in Warrensville Heights barbershop shooting trial: 'I'm scared for my life'", "dct": "Tue, 11 Oct 2016 18:28:00 GMT", "id": "35f27d21e8e27199e112c7c213a11431", "content": "CLEVELAND, Ohio -- A victim and witness to the mass shooting at the Chalk Linez barbershop in Warrensville Heights told a jury Tuesday that she was scared for her life to testify and couldn't identify the defendant in the courtroom.\nDouglas Shine, Jr., a member of the Heartless Felons gang, is on trial facing a possible death sentence for the mass shooting that killed Walter Barfield, Brandon White and William Gonzalez.\nHe is also charged with arranging the assassination of Aaron Ladson, one of the witnesses from the barbershop who gave a recorded statement to police naming Shine as the shooter.\nWhitney Clay was at her first day of work at the Harvard Road barbershop on Feb. 5, 2015 when a man come in wearing all black, pulled out two handguns and started shooting, she said Tuesday. She was shot in the arm, but was able to see the shooter's face before retreating to a bathroom.\nOn Tuesday, Clay told the jury that she didn't recognize the shooter in the courtroom.\nIt was almost two months after the Chalk Linez shooting, on April 3, 2015 when police came to see her in Euclid and asked her to identify the shooter from a photo lineup. She chose the photo of Shine because she recognized his facial tattoos, his mustache and his lips.\nShe also saw his picture on television news reports at least three times between the time of the shooting and her interview with police, she testified.\nBut Clay, who testified on behalf of the prosecution, appeared nervous. She told the jury she was scared for her life, and that she couldn't identify the shooter in the courtroom.\n\"You're not sure that a person in this courtroom came in the barbershop,\" defense attorney Russell Tye asked.\n\"That's correct,\" she said.\nShine was sitting at a table no more than 10 yards away.\n\"Why aren't you sure the person in the room is not the same?\" Cuyahoga County Prosecutor Timothy McGinty asked later.\n\"He doesn't look like the person I saw walk into the barbershop,\" Clay replied.\n\"What's different?\" McGinty asked.\n\"He was skinnier.\"\nClay is one of 17 people witnesses from inside the barbershop expected to testify in Shine's trial, which started Sept. 6.\nAt least one witness, Alvin Wright, positively identified Shine as the shooter in the courtroom last week.\nSurvivors of a mass shooting at the Chalk Linez barbershop in Warrensville Heights described a violent and panicked scene inside.\nEarlier Tuesday morning the co-owner of the barbershop, Marion Randle, testified that he couldn't see the shooter because a barber had his head tilted back at the time.\nRandle wore a prison jumpsuit to testify. He is currently serving a drug-trafficking sentence at Trumbull Correctional Institution.\nAnother witness in Shine's case was arrested this week after he was accused of stabbing a man to death outside a West 6th Street bar. Prosecutors say Shine shot Stefon Robinson oustide his grandmother's on Jan. 20, 2016, less than two weeks before the barbershop massacre.\nTestimony in Shine's trial resumes Wednesday morning at 8:30 a.m.\nIf you'd like to comment on this story, please visit our crime and courts comment section."}