{"uri": "http://www.newsnet5.com/news/local-news/oh-cuyahoga/wife-of-warrensville-heights-barbershop-owner-i-saw-my-husband-lying-face-down-in-a-pool-of-blood", "title": "Wife of Warrensville Heights barbershop owner: 'I saw my husband lying face down in a pool of blood'", "dct": "Fri, 14 Oct 2016 07:02:00 GMT", "id": "7f2580bef60bb7e4bfded19151adf342", "content": "Autoplay:\nCLEVELAND -\nDarlese Gonzalez has blocked out the night she saw her husband and two others killed in a Warrensville Heights barbershop last year. There was a series of rapid fire gunshots, smoke, blood and hysteria, she said Monday during a tearful testimony.\n“I remember seeing him lying on the floor, so I picked him up,” Gonzalez said. “Smoke was coming out of his chest.”\nGonzalez was the first witness called by the Cuyahoga County Prosecutor’s Office as they began to layout their case against Douglas Shine Jr., who is charged with aggravated murder in the death of her husband, William Gonzalez, 32, of Garfield Heights, and Walter Lee Barfield, 23, of Cleveland and Brandon White, 31, of Warrensville Heights. Three other people were injured in the Feb. 5, 2015 shooting at the barbershop on Harvard Road.\nProsecutors tried to paint a vivid portrait of the murder scene with a handful of pictures and tearful and gut-wrenching testimony from relatives of some of those who were killed during the city’s harsh winter cold.\nThe case is being heard in front Cuyahoga County Common Pleas Court Judge Joan Synenberg. Jurors will decide whether or not Shine, 21, is at fault for the murders.\nProsecutors are seeking the death penalty in the case, which is expected to last four or five weeks.\nWilliam Gonzalez owned the barbershop. His wife worked as a hairdresser at the shop.\nA virtual tour and photos were used to show the moments following the shooting, as Darlese and others told jurors what occurred before the shots were fired.\nDarlese Gonzalez said she saw a man with a dark or black hoodie enter the barbershop and start shooting. Her and several others ran to the back of the shop until the shooting stopped.\nThere was a lot of dust and gunshots that night, she said.\n“I don’t know how many gunshots there were,” Darlese Gonzalez said as she sobbed. “I just know when I came out of the back room I saw my husband lying face down in a pool of blood.”\nDarlese Gonzalez became overwhelmed during the virtual tour as she saw multiple bodies sprawled out on the barbershop’s blood stained floors.\nShe repeatedly cried, “I need a break,” before running off of the bench into a side hallway of the courtroom.\n“I’m sorry, Mrs. Gonzalez. I know you haven’t saw this before,” said Mahmoud Awadallah, assistant prosecuting attorney, “but we have to get through this.”\nAfter the shooting, Darlese called 911 but was too emotional to speak. She handed the phone to a man who tried to give dispatchers the address of the shooting. That didn't work.\nSeveral people, including Darlese, loaded William into a car and drove him across the street to a local hospital.\n“After they told me he didn't make it, I just got cold,” she said. ‘I don’t remember anything else.”\nA recording of the 911 tape was played Monday. The call was difficult to understand, but the court heard shouting, crying and moans.\nThroughout the hearing, Shine who was dressed in black, could be seen speaking with his defense attorneys, sipping water and taking notes on a yellow note pad. He didn't show much emotion, but his facial expression was plain.\nA second woman told jurors she saw Shine’s face when the shooting occurred. She said she saw a man with a hood enter the shop with his arms to the side. Immediately after, the man raised both of his arms and started shooting two guns.\nThe woman, who also worked at the barbershop as a hairdresser, said she was standing at the dryers when she heard the door open. Her back was turned, but she always turns around when she hears the door sounds, she said. Evans hid under the dryer during the shooting.\nChristopher Perkins, the father of the woman's 5-year-old daughter was shot in the groin area. She helped him to a nearby bar for safety. Her daughter was in the shop at the of shooting, but was not injured.\nShine’s defense attorney, Thomas Shaughnessy, challenged the woman during a cross-examination. He questioned whether she could see the man shooting from where she was standing.\nAt one point, Shaughnessy walked back to the courtroom doors and asked her if it was a fair estimation to how far she saw the shooter. She agreed, but said it could be further or shorter.\nShaughnessy also challenged statements and descriptions she gave to Warrensville Heights Police Department during their investigation about the shooter.\n“The person that came through that door, have you seen him before?” Shaughnessy asked.\nVisibly annoyed, she said she identified Shine in a photo lineup to police and pointed at him out as barbershop’s shooter during Monday’s hearing.\n“Because that’s the man’s face I looked at when he walked in through the door,” she said.\nRELATED:\nCopyright 2015 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}