{"uri": "http://www.11alive.com/news/crime/multiple-people-shot-at-henry-county-home/343027755", "title": "Fourth victim in Henry County bonfire shooting dies", "dct": "Mon, 31 Oct 2016 00:00:00 GMT", "id": "80eb143e2c05163125be3a3bae05df2f", "content": "HENRY COUNTY, Ga. -- Sunday afternoon brought with it a tragic update to a shooting that came earlier in the week in Henry County.\nThe Henry County Coroner confirmed that Destiny Olinger, the fourth victim who was left in critical condition, has died.\nPolice confirmed late Thursday that they have made five arrests in a Henry County shooting that has now left four people dead.\nPolice said that the crime actually began as a late-night gathering or bonfire, but somehow devolved into gunfire. The call originally came in as a home invasion, but when police arrived they found four victims shot in the living room and kitchen.\nNeighbors told 11Alive’s Erin Calandra that the owner of the house was on his way back from Florida. However, a 20-year-old woman was house-sitting at the time of the shooting. Her family, who arrived on the scene just after 8 a.m. that morning, said she was shot and is in critical condition.\nOlinger was taken to hospital by medical helicopter but was confirmed deceased on Sunday just after 4 p.m.\nThe other victims' identities were released Friday morning. They where:\nMatthew Hicks, 18, of McDonough, Ga.\nKeith Gibson, 29, of Covington, Ga.\nSophia Bullard, 20, of Thomason, Ga.\nThe initial investigation turned up two suspects for the fatal shooting in the 600 block of Moccasin Gap Road. But during the process of trying to find them, police also uncovered three other people who had some part, knowledge or direct involvement in the incident.\nPolice 19-year-old Matthew Baker Jr. of McDonough was arrested after a felony traffic stop in a vehicle at his home.\nElsewhere, 22-year-old Jacob Cole Kosky of McDonough was arrested after he called 911 from a location on Jonesboro Road to turn himself in.\nThe additional three people, 18-year-old Jacob Williams of McDonough, 21-year-old Kayla Head of McDonough and 19-year-old Brooke Knight of Locust Grove, were arrested and charged with obstruction of a police investigation.\nPolice do not believe there are any remaining suspects.\nPolice said that it appeared that everyone was awake when the shooting happened. They interviewed witnesses who were inside the house at the time of the shooting and reached out to others who may have known those shot, but were not in the home, in an effort to find the shooter.\n(© 2017 WXIA)"}