{"uri": "http://www.dailyjournal.net/2016/11/12/man_charged_in_accidental_shooting/", "title": "Man charged in accidental shooting", "dct": "Sat, 12 Nov 2016 00:05:00 GMT", "id": "627ce5c07be25968a3efce0ca3a5b4d8", "content": "A man who was trying to teach his young son about gun safety has been charged with a misdemeanor after he accidentally shot a neighbor during target practice.\nDonald Ethan Lawlis, 54, of Whiteland, faces a misdemeanor charge of criminal recklessness following the Oct. 14 incident in rural Franklin.\nLawlis had gone to his father’s property of State Road 144 that afternoon to examine some relatives’ weapons that weren’t functioning properly, shoot his own pistol with a laser he had recently installed and teach his young son about gun safety with his BB gun, according to a probable cause affidavit.\nA neighboring family who lives in the 1700 block of North County Road 125W was outside and heard bullets whizzing by in the moments before resident Kevin Destrampe was shot in the knee. Other bullets were found lodged in the side of their home or on the property.\nJohnson County Sheriff’s Office investigators found that the target Lawlis was shooting at did not have a backstop, and the direction he was shooting went straight toward the Destrampe home, the report said.\nLawlis was surprised when he realized the line of shooting went toward the neighbor’s home, and told the investigator that he thought he was shooting across a field, and he didn’t think the rounds would travel as far as they did, the probable cause affidavit said.\nHe apologized to the sheriff’s office and wrote the Destrampes a letter apologizing as well.\nJohnson County Prosecutor Brad Cooper charged Lawlis with the misdemeanor after reviewing the investigation. The misdemeanor charge applies to a suspect who recklessly, knowingly or intentionally performs an act that creates a substantial risk of bodily injury to another person, according to state law. If convicted, Lawlis could face up to 180 days in jail and a $1,000 fine."}