{"uri": "http://abc7ny.com/news/7-people-shot-during-july-4-barbecue-in-brooklyn/1413599/", "title": "20 people shot in NYC on July 4, including 7 during barbecue in Ocean Hill, Brooklyn", "dct": "Tue, 05 Jul 2016 00:00:00 GMT", "id": "a4eafae1a310bde0c57b01447f2b84fa", "content": "OCEAN HILL, Brooklyn (WABC) --\n20 people were shot in 12 shooting incidents in New York City on the Fourth of July, including seven who were wounded at a barbecue and graduation party in Brooklyn Monday night.\nPolice said four men and three women were wounded in a private greenspace outside a Chauncey Avenue apartment building in Ocean Hill around 11:30 p.m.\nTwo of the men are 18 and the other two are 19 and 20. The three women are 17, 19 and 20. They were shot in the legs, arms and torso; all are expected to survive. At least one already has been released.\nDetectives were talking to a person of interest, but it is unclear if that person is the suspected gunman. The investigation is continuing.\nPolice are trying to determine whether the gunman was denied access to the event, and came back with a gun in retaliation.\nOne of the victims, Bless Thomas, 18, said Tuesday that he never saw the shooter, just heard the shots and then screaming. \"Everything was good. We was enjoying ourselves,\" he said. \"Everybody was running, screaming, trying to get somewhere safe.\"\nThomas said there were about 80 people at the backyard barbecue. Police said they believe the shooter fired into the backyard from the street.\nCondo board president Ted McQueen, an eyewitness, said he wasn't sure whether it was fireworks or gunshots, but when he walked around the corner, he literally ran into people in a panic. \"It makes it bad because it make it look like these young people brought the trouble. No, the trouble came to them. They was having a good time.\"\nBut the partygoers were boxed in, the only way out was straight toward the shooter. The shooter slipped away, leaving behind casings and chaos.\nMcQueen says he OK'd Monday night's party and insists organizers are in no way responsible for the shooting.\n\"They were there to have a festive time period,\" he said.\nInvestigators spent much of the morning going over the crime scene, trying to piece together what triggered the incident and who may be responsible.\nOfficers even passed out flyers urging neighbors for information to help stop the violence that turned a community gathering into a crime scene.\n\"The fact that nobody was killed, yes, that's a great relief on my part,\" said McQueen.\nOTHER VIOLENCE\nEarlier in the night, a 22-year-old man was shot in the chest at Broadway and Chauncey Street in Brooklyn. It happened at around 9:30 p.m. Police said it was originally believed to be connected with the barbecue shooting, but later said it was not.\nHe walked into a nearby firehouse and was taken to Brookdale University Hospital in stable condition. Three men and two women fled on foot.\nAnother shooting took place at 10:15 p.m., when an 18-year-old man was shot five times at Wilson and Cooper streets in Bushwick, Brooklyn. No arrests were made in that shooting.\nAt 11:15 p.m., a 22-year-old man was shot in the right leg while walking on St. John's Place and Franklin Avenue in Crown Heights.\nJust after midnight, a man was shot at Ocean Avenue and St. Paul's Court in Prospect Park South, Brooklyn.\nAlso around midnight, a woman walked into Kings County Hospital with a gunshot wound; she had been shot at an unknown location.\nAt 12:30 a.m. Tuesday, a man was shot on Intervale Avenue near Chisholm Street in the Bronx. He sustained non-life-threatening injuries.\nEarlier in the evening, at 5:15 p.m., a 24-year-old man shot twice in the back on East 29th Street in Flatbush, Brooklyn; at 8:15 p.m., a 20-year-old man was shot in the head at East 116th Street and Pleasant Avenue in East Harlem."}