{"uri": "http://www.daytondailynews.com/news/crime--law/third-person-pleads-deadly-hamilton-bar-shooting/FCtAvnrtb5HsjjmPh5iuRJ/", "title": "Third person pleads in deadly Hamilton bar shooting", "dct": "Tue, 10 Jan 2017 00:00:00 GMT", "id": "1f3347025397b86a47c09eb7dcc042a4", "content": "STAFF FILE/2016 Cory Cook II entered a guilty plea Jan. 10 for his involvement in a deadly Hamilton bar shooting. He was one of four people charged in the gun violence outside Doubles Bar that killed Kalif Goens and injured seven others in July 2016.\nHAMILTON\nA third man charged in a deadly Hamilton bar shooting last summer has entered a guilty plea.\nCory Cook II, 23, of 9th Street in Hamilton, was scheduled to be in Butler County Common Pleas Court today for a pre-trial hearing but that changed when he accepted a plea deal.\nCook was one of four people charged in the gun violence outside Doubles Bar on the city’s west side that killed Kalif Goens and injured seven others. He was charged with felonious assault, a second degree felony, but entered a guilty plea to attempted felonious assault with a one year gun specification.\nJudge Greg Stephens set sentencing for February. Cook faces up to four years in prison.\nRodrick Curtis Jr., 20, of North 7th Street, was charged with felonious assault and having weapons under disability. He accepted a plea deal to aggravated assault that has a mandatory three-year jail term for the firearms specification associated with it.\nMondale Goens, 21, of Maple Ave., was charged with two counts of felonious assault in the shooting that killed his brother. He plead guilty aggravated assault that has a mandatory three-year jail term for the firearms specification associated with it.\nBoth men face up to 4½ years in prison and are scheduled to be sentenced by Stephens later this month.\nThat leaves only the case of Cornell McKennelly II pending of those charged in the July 24 shooting.\nMcKennelly, 38, of Franklin Street in Hamilton, is charged with murder and having weapons under disability, for allegedly shooting and killing Kalif Goens. His trial is scheduled to begin Jan. 31.\nDays after the shooting at Doubles Bar, two men were killed in a drive-by shooting along Central Avenue, which was a murder for hire, according to court records.\nFour people are facing the death penalty in the Central Avenue shooting and are scheduled for trial later this year They are:\nZachary Harris, 24, of Columbus, charged with two counts of aggravated murder\nTony Patete, 23, of Newark, two counts of aggravated murder\nMelinda Gibby, 35, of Lancaster, two counts of aggravated murder\nMichael Grevious II, 23, of Maple Ave., Hamilton, one count of aggravated murder"}