{"uri": "http://www.wlwt.com/news/at-least-2-shot-in-hamilton-bar-shooter-on-the-run/40858130", "title": "Shooter remains on the run after killing 1, injuring several at Hamilton bar", "dct": "Sun, 24 Jul 2016 22:32:00 GMT", "id": "dd02c823579f7aea0613c2108c8a0e74", "content": "HAMILTON, Ohio —\nSeveral people were shot at a Hamilton bar early Sunday morning, police said.\nThe incident happened just before 2 a.m. at Doubles Bar on Main Street. Several people called 911 to report the shooting. One 911 caller reported at least 20 shots fired.\nHamilton police said upon arrival, officers located multiple victims of gunshot wounds. At least one person was killed.\nHamilton Fire Department transported the victims to various local hospitals. No conditions have not been released.\nPolice said someone fired multiple shots inside the bar. A witness described it as sounding like firecrackers.\nAnother told WLWT the shooter used a \"long gun.\"\n\"It was chaotic,\" said Taye Adesha, who was inside the bar when the shooting occurred. \"And you know, you're either thinking, you know, either play dead or just be quiet. I was trying to console her to, you know, trying to calm her down while trying to hide at the same time ... It felt like hours, but it was only seconds,\" said Adesha.\nThe gunman reportedly exited the bar through a back door. Police surrounded nearby Planet Fitness shortly after the shooting.\nA witness told WLWT that she saw a man run from the bar, shouting that he had been shot. He was taken away in an ambulance. She also saw two others taken away in ambulances.\nJust after 4 p.m., crime tape was being pulled from the scene and the manager of Double's bar said they were \"open and cleaning up.\"\nPolice are searching for the shooter. No description has been released.\nAnyone with information is urged to contact the Hamilton Police Department’s Investigation Section at (513) 868-5811 ext. 2002\nWLWT is on the scene and will bring you more information as it becomes available."}