{"uri": "http://wkrn.com/2016/05/27/victim-of-drive-by-shooting-in-nashville-now-wanted-for-murder/", "title": "Victim of drive-by shooting in Nashville now wanted for murder", "dct": "Fri, 27 May 2016 16:50:00 GMT", "id": "e55be498c69058c1c0bbc684f276fca7", "content": "NASHVILLE, Tenn. (WKRN) – Metro police said a woman shot last Sunday night in a drive-by shooting may have been specifically targeted in an act of retaliation.\nDameisha Clark, 20, is wanted on charges of criminal homicide in the May 14 shooting death of 21-year-old Johnny Broadnax.\nBroadnax was found lying in the grass near an SUV that had crashed into the Hickory Manor Apartments on Hamilton Church Road in Antioch.\nHe was transported to Vanderbilt University Medical Center where he died.\nMORE: Man dies after shooting, car crash in Antioch\nPolice say their investigation found Clark contacted Broadnax to arrange a drug deal and was behind the wheel of a stolen Dodge Charger from which shots were fired that night.\nClark is thought to have been in the Charger with at least one other person, according to officials.\nA little over a week later, Clark was one of four injured in a drive-by shooting near the Nashville Speedway in South Nashville—and now police believe she was targeted.\nMetro-Nashville police said she was in the front passenger seat of a Nissan Sentra when two people inside a small black sedan with custom wheels opened fire.\nClark and the driver, Kayla Blakely, received non-critical wounds. Both were treated at the hospital and release.\nMORE: 4 injured in drive-by shooting South Nashville\nThe two rear seat passengers, Michael Myers Jr., 25, and Michael Shaw, 32, were more seriously hurt. Myers was released from the hospital last Monday. Shaw was released Thursday.\nBlakely, Myers and Shaw are not suspected of being involved in the Broadnax homicide.\nAnyone seeing Dameisha Clark or knowing her whereabouts is asked to contact Crime Stoppers at 615-742-7463.\nCallers to Crime Stoppers can remain anonymous and qualify for a cash reward.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}