{"uri": "http://www.oregonlive.com/pacific-northwest-news/index.ssf/2016/06/mother_boyfriend_after_toddler.html", "title": "Mother, boyfriend face charges after toddler's gunshot injury", "dct": "Tue, 14 Jun 2016 14:56:00 GMT", "id": "d09771f334d02c570902b13c649ea8c7", "content": "The mother of an 18-month-old boy hindered investigators after her boyfriend accidentally shot her son in the leg during a hike in Douglas County, court records claim.\nDouglas County sheriff's deputies, in a probable cause affidavit, said that Brookelynn Weiker, 25, of Glide told a 911 operator that her son had been shot by a stranger June 7 during an outing to Idleyld Park, according to the affidavit, and gave deputies a bogus description of the culprit.\nDeputies, Roseburg police dog units and Bureau of Land Management personnel spent hours looking through trails, roads and in trees without luck. Deputies later obtained permission from Weiker to look through her Ford Explorer, where they found the boy's bloody shorts with a bullet hole, according to the affidavit.\nAbout an hour into an interview with investigators, Weiker acknowledged that a gun belonging to her boyfriend, 23-year-old Bradley Allen of Glide, had discharged from his lap, according to the affidavit. She said she knew her boyfriend had a warrant and wasn't supposed to be in possession of the .22-caliber gun, according to the affidavit.\nShe told deputies she didn't want her boyfriend in trouble and did not want to give investigators his last name or home address, according to the affidavit.\nMeanwhile, police looked for Allen through nearby residential areas without success, according to the affidavit. The following morning, detectives used the cell phone belonging to Allen's ex-girlfriend to communicate with him, and they learned he was in Roseburg, according to the affidavit.\nThey arranged a meeting and arrested him without incident, according to the affidavit. Allen had a meth pipe and heroin in his pants, and a gun in a backpack, according to the affidavit. He was booked into the Douglas County jail.\nDuring his interview with deputies, Allen said he bought the gun for $30 or $40 a few hours before taking the hike with his girlfriend, according to the affidavit. During the hike, they stopped to sit down and he placed the gun on his lap, he said.\nAllen told deputies that the toddler ran up to him, hit his lap forcing the gun to move and potentially removing the safety switch, according to the affidavit. That's when the gun discharged, according to the affidavit.\nAllen told detectives he ran because he was a felon in possession of a gun, had a warrant and was scared of being arrested, according to the affidavit.\nDeputies later learned the child suffered potential nerve damage to his leg, and the injury will need to be monitored as he grows up.\nThe Douglas County District Attorney's Office charged Allen with third-degree assault, felon in possession of a firearm, possession of heroin and possession of methamphetamine. Deputies arrested Weiker on Monday on accusations of hindering prosecution and criminal mistreatment.\nBail was set at $50,000 apiece, according to the Douglas County Sheriff's Office website.\n-- Tony Hernandez\nthernandez@oregonian.com\n503-294-5928\n@tonyhreports"}