{"uri": "http://www.local10.com/news/crime/3-found-shot-to-death-inside-car-in-collier-county", "title": "Miami woman's death could be linked to 3 found fatally shot in Collier County", "dct": "Fri, 21 Oct 2016 09:17:00 GMT", "id": "2f3ff4c60d5dc8eba287f2cda9579fc4", "content": "MIAMI - A woman has been found dead inside a Miami apartment, and her death could be linked to three people who were found shot to death in a car along U.S. Highway 41 in Collier County near the Miami-Dade County line.\nMiami police Lt. Freddie Burden said officers were asked to conduct a welfare check at an apartment complex on Northwest 51st Avenue, where they found a woman dead inside apartment 38.\nBody found on Don Shula Expressway in southwest Miami-Dade\n\"They discovered the body of a young lady in her 40s,\" Burden said. \"At the current moment, we are investigating it as a homicide.\"\nThe woman's death could be connected to a murder-suicide investigation in Collier County, where three bodies were found inside a car.\nA witness who spotted the car Thursday saw a woman inside and thought she was asleep. That witness called 911 after noticing blood in the car.\n\"She was slumped over to the passenger side and had blood on her face. I could tell her eyes were open,\" Jim Brunson said.\nAccording to a Collier County Sheriff's Office report, a girl, a woman and a man were found dead with gunshot wounds. The man was found with a pistol in his hand, authorities said.\nBurden said Collier County sheriff's investigators asked police to conduct the welfare check in Miami.\nCrime scene investigators could be seen dusting for fingerprints and taking photographs of apartment 38.\nPolice are asking for the public's help with information about what led to the woman's death.\n\"If they know of anything, if they heard something maybe yesterday, maybe some sort of an argument at this apartment or anything of that manner, or maybe they know this couple, maybe they can come forward and give us some information,\" Burden said.\nAnyone with information is asked to call police or Miami-Dade Crime Stoppers at 305-471-TIPS.\nCopyright 2016 by WPLG Local10.com - All rights reserved."}