{"uri": "http://www.fresnobee.com/news/local/article112598478.html", "title": "Fresno County sheriff’s deputy accidentally shoots himself in leg", "dct": "Fri, 04 Nov 2016 13:23:00 GMT", "id": "645fcad8533a54e339a99fbcc7371d68", "content": "A Fresno County sheriff’s deputy was rushed to the hospital Friday afternoon after shooting himself in the leg in southeast Fresno.\nThe wound will not endanger the deputy’s life, Fresno police Lt. Joe Gomez said. The Police Department is investigating the incident because it occurred at East Church and South Gearhart avenues in the city of Fresno.\nFresno County Sheriff’s Office spokesman Tony Botti said a detective from his office also is working to find out how the accident occurred. Botti said the wound was “through and through,” meaning the bullet did not remain in the deputy’s leg. He was expected to leave Community Regional Medical Center by Friday evening.\nThe wounded deputy, who Gomez did not identify, was part of a MAGEC anti-gang team that was staging in the area about 1 p.m. before an enforcement operation was to start nearby.\nGomez said the deputy had just stepped out of an SUV and was putting his firearm in a thigh holster when it discharged. He got back in the vehicle and waited for help.\nPolice, deputies and CHP officers sped to the industrial area where the incident occurred. The deputy is an eight-year veteran and has been with MAGEC for two years.\nFriday’s incident follows the accidental shooting death Monday of sheriff’s Sgt. Rod Lucas. A bullet fired accidentally from a colleague’s gun struck Lucas in the chest. At a news conference Tuesday, Sheriff Margaret Mims said Lucas and a detective, who has not been identified, were discussing the safety of backup weapons when the detective’s gun discharged.\nGomez said it seemed “very unusual” to have two accidental shootings in one week. Botti called the shootings “two separate incidents, unlike one another.”\nUnlike Monday’s shooting, Gomez said it appeared the deputy was armed with his service weapon, which would be a Smith & Wesson M&P .40 caliber handgun. The weapon remained on the floorboard of the deputy’s pickup after the shooting.\nAsked about the weapon, Gomez said the M&P, like the better-known Glock handgun, has “no external safety … it’s very easy for these guns to go off. You’ve got to be careful.”\nLike the Glock, the M&P uses a “striker trigger.” According to the website thearmsguide.com, the trigger itself is a safety. Such weapons have been criticized on occasion. A Los Angeles Times report in 2015 disclosed that accidental discharges by Los Angeles County Sheriff’s Department deputies more than doubled – from 12 to 30 – after the department adopted the M&P.\nHowever, Botti disputed the validity of the Los Angeles County sheriff’s study as it applied to the Fresno County Sheriff’s Office, because L.A. County deputies transitioned from a Beretta sidearm – which he said had a “very heavy” trigger pull – to the M&P. Fresno deputies were previously issued the Smith & Wesson 4506, which has an external safety.\nThe latest incident compounds a difficult time for the Fresno County Sheriff’s Office, already coping with the shooting of two correctional officers in the Fresno County Jail lobby in September. They both continue to recover from their wounds.\nJim Guy: 559-441-6339, @jimguy27"}