{"uri": "http://www.nytimes.com/2016/01/13/us/lumberton-nc-store-shooting-manal-abdelaziz.html?_r=0", "title": "3-Year-Old Finds Gun in Dad’s Store, and Old Story Plays Out", "dct": "Tue, 12 Jan 2016 00:00:00 GMT", "id": "7699d6fd78fc61952125ba8875d0a8c7", "content": "The 3-year-old was sitting on a stool behind the counter near the cash register while his father, the owner of a small convenience store in North Carolina, chatted with a customer on Sunday.\nSuddenly a shot rang out, and the owner, Manal Abdelaziz, 56, turned and saw his son, Manal, lying on the floor.\nManal, who was nicknamed Cash, had found a 9-millimeter handgun that was kept in the store for protection, and fatally shot himself.\n“All we heard is something happening, and I look: Oh my God, my son is on the floor,” Mr. Abdelaziz told a local television station, WMBF. They called 911. “Help comes, but it was late,” the store owner said. “It happened quick.”\n“He loved life, he loved people,” Mr. Abdelaziz said.\nThe shooting took place at the Brother’s Minit Store in Lumberton, N.C., a small city of more than 21,000 people about 95 miles south of Raleigh. Brother’s Minit is the kind of store where customers are known by name and can stop in for everything from cellphone covers to tobacco and snacks.\nBut the events that unfolded there just before 11 a.m. Sunday touched a nerve far beyond the region, reflecting a growing concern around the country about gun violence, particularly involving children. Many of the shootings happen when young people pick up and play with guns they find in stores, cars or residences.\n“It just sounds like from our investigation, it is truly a tragedy,” Capt. Terry W. Parker of the Lumberton Police Department said on Tuesday.\nThe Gun Violence Archive said there were 692 incidents of children age 11 years or younger killed or injured by gunfire in 2015, up from 628 in 2014.\nSo far in 2016, such shootings exceed the number of days. The archive shows that as of Jan. 11, there have been 19 shootings so far involving children 11 or younger. Among them was one in which an 11-year old boy was shot and killed Monday night in a drive-by shooting at a housing complex in Alton, Ill.\nMost of the shootings were accidents, like when an adult drops a gun and it discharges, or when a child happens upon a gun. A 2-year-old in Houston shot himself in the hand on Jan. 3 when he picked up a gun his father was cleaning, and a 9-year-old in Trinidad, Colo., was taken off life support on Sunday after he was shot in the head with a gun he and his brother found while sitting in a parked car.\nMany states have rules intended to cover safe storage in addition to laws governing purchase and ownership of guns. North Carolina law requires owners to store firearms so children do not have access.\nCaptain Parker said his department was trying to trace the origins of the handgun to decide whether to turn the case over to the Robeson County district attorney to determine whether charges are warranted. He said his officers were still gathering information, including about how the weapon had been stored and why it was in the store. He said his department had been called to the store one or two times in the past for shoplifting cases.\nDetails about the shooting were provided by Captain Parker and local news reports.\nManal regularly accompanied his father to work, where he helped arrange the shelves and exchanged smiles with customer. “I met Cash this summer when the store first opened and he ran up to me and jumped into my arms and wouldn’t let me go, and I fell in love with him,” Adia Peguise, a store worker, told WMBF.\nMs. Peguise said she often looked after the boy, most recently on the Saturday night before his death, when she put him down to sleep in a room after trying to get him to eat some soup.\nThat was the last time she saw him.\n“They called for me the next morning,” she said. “His father called because he said he woke up asking for me and by the time I called him back he was gone.”"}