{"uri": "http://www.kgw.com/news/crime/triple-murder-in-woodland-wa/274949854", "title": "Woodland triple-murder suspect may face death penalty", "dct": "Mon, 01 Aug 2016 00:00:00 GMT", "id": "518cffa3fd6c2ea0bc70b7e13170d04b", "content": "WOODLAND, Wash. – A man charged with murdering three people in Woodland in July may face the death penalty, though the prosecuting attorney said no decision has been made.\nBrent Luyster, 35, had his arraignment postponed until Wednesday, Aug. 24 during an appearance in Clark County Superior Court on Monday. Bob Yoseph, the defense attorney for Luyster, requested more time to build a case against capital punishment for his client that he will present to the prosecution, according to The Columbian.\nLuyster, who has been denied bail and is being held at the Clark County Jail, has been charged with three counts of first-degree aggravated murder. He also has been charged with one count each of first-degree attempted murder, and first- and second-degree unlawful possession of a firearm.\nThe Clark County Prosecuting Attorney's Office decided to amend the charges from first-degree murder to first-degree aggravated murder. Aggravated murder charges allow the prosecution the right to seek the death penalty in the state of Washington.\nIn an interview Monday with KGW, Clark County Deputy Prosecutor James Smith said that there are two circumstances alleged in this case that warrant the aggravated murder charges: first, that there are multiple victims and second, that one of the victims was allegedly murdered to conceal a crime.\nSmith said they are looking at all the facts of the case and have not decided whether they will seek capital punishment for Luyster.\n\"We are going to have a full and fair investigation and then make a decision as to what we think is the appropriate outcome. No decision has been made yet,\" Smith said.\n\"These are extremely severe, very grave crimes that we're going to take very seriously,\"\nThe prosecution has 30 days from the date of the arraignment to make a decision about seeking the death penalty. The defense team has requested that the 30-day period be extended, which is allowed.\nLuyster's girlfriend, 27-year-old Andrea Sibley, had her bail reduced from $400,000 to $250,000 during Monday's court appearance. Sibley and Luyster appeared in court separately.\nSibley faces charges of first-degree rendering criminal assistance. Police said Sibley was at the scene of the murder and provided Luyster a getaway ride after the murders were committed.\nSibley has no previous criminal record. The trial date for Sibley is scheduled for Sept. 22.\nThe investigation into Luyster began when deputies were first called at 10:20 p.m. on July 15 about a gunshot victim at an AM/PM on CC Street. They found a woman suffering from a gunshot wound to the face, according to Sgt. Tony Barnes of the Clark County Sheriff's Office.\nNew court documents reveal the woman was unable to communicate with deputies, but she was able to answer questions by writing answers. She told them she passed out, then \"army-crawled\" away from the home to escape. She says she flagged down a car and rode to the gas station to get help.\nDeputies learned the shooting happened at a home in the 4000 block of Northwest 417th Street. Upon arrival, they found three people dead.\nThe victims have been identified as Joseph Lamar, Janell Knight and Zachary Thompson. According to court documents, all three victims were shot in the head.\nDocuments reveal the two men were found dead, on their backs, side by side in the driveway. The woman was found dead, on her back, on the couch inside the home.\nLuyster was considered armed and dangerous while deputies searched for him.\nCowlitz County deputies and Washington State Patrol troopers detained Luyster at around 4:15 p.m. on July 16. He was found driving a gold Ford Explorer on Ocean Beach Highway and taken into custody without incident.\nLuyster's criminal history\nAccording to court documents, Luyster has a criminal record that goes back to the late 1990s including multiple charges of assault, malicious harassment and other crimes. His most recent run-in with the law appears to be in May. He was charged with second-degree assault and harassment.\nThe Columbian newspaper reports that Luyster was scheduled for trial in Cowlitz County Superior Court on allegations that he pistol-whipped his ex-girlfriend at his Longview home. He pleaded not guilty in May to charges of assault, harassment and illegal firearm possession.\nLuyster was arrested in 2013 on accusations of felony assault and racially-motivated malicious harassment in an assault at a Vancouver bar. The Oregonian reports he pleaded guilty to rioting with a weapon and was sentenced to 90 days in jail.\nAn older picture of Luyster shows his body covered in Nazi and skinhead tattoos.\n“That ideology is both kind of violent in terms of confronting people they view as their enemies but also tied into a larger view of kind of… racial conflict,” said Randy Blazak, the Director of the Hate Crimes Research Network. Blazak is also a faculty member at the University of Oregon.\n“The Northwest has a long history of skinhead activity going back to the 1980s and they've been involved in some pretty serious violence in the region,” he said.\nOn Luyster’s Facebook page, people left comments of support. Some posted phrases that included references to Odin and Valhalla.\n“A lot of white supremacists, especially in the Northwest, subscribe to this racist version of Odinism where they believe in the Viking lords and to die in Valhalla. It's kind of like a white supremacist version of jihad so there's this belief that there's a righteous way to die in battle for this larger cause,” explained Blazak.\nWhile he said there are pockets where the white supremacist ideology still resonates, it’s becoming less prevalent.\n“While the organized hate groups like the Ku Klux Klan and skinheads have been on the wane, the real growth has been inside prisons and jails where they kind of organize themselves around a protection racket,” said Blazak.\nBlazak said it’s important to recognize that just because someone may have tattoos suggesting a certain ideological stance, there are people who were temporary members of the skinhead subculture.\n“Some of those folks come out the other side and do work against racism and try to undo the harm they've done,” Blazak said."}