{"uri": "https://www.flashalert.net/id/ClarkSheriff", "title": "Arrest in Arson Homicide from the Sifton area 1-19-17", "dct": "Thu, 19 Jan 2017 22:33:00 GMT", "id": "d77dc24642885f9883533edb9a235b72", "content": "Subscribe to receive FlashAlert messages from Clark Co. Sheriff's Office. Please use any browser other than Internet Explorer.\n- 01/19/17\nOn January 19, 2017, Detectives with the Clark County Sheriff's Office Major Crimes Unit developed a suspect in the arson/ homicide from the Oasis Market which occurred on Sunday January 15th. After developing concrete information Major Crimes Detectives along with Detectives from the Tactical Detective Unit located the suspect at a relative's home and took him into custody without incident.\nDetectives, with the assistance of the Southwest Washington Regional SWAT Team then served a warrant at the 13608 NE 72 St. apartment D31 which is where the suspect had been living.\nMitchell Heng a 21 year old Vancouver resident was booked into the Clark County Jail on Murder in the first degree, Arson in the first degree and Robbery in the first degree.\nMitchell Heng should make his first appearance on January 20th.\nThere will be no further information released tonight.\nUpdate 1-17-17 1000\nToday the Clark County Sheriff's Office was able to confirm the identity of the victim found deceased in the fire scene on January 15th.\nThe victim is identified as Amy Marie Hooser, a 47 year old Vancouver resident. The manner of death has been ruled a Homicide and the cause listed as Smoke Inhalation and Blunt Force Trauma. THE VICTIM WAS AN EMPLOYEE OF THE STORE.\nCurrently there is no suspect information on this incident. The Sheriff's Office will release information via Flash News as it becomes available.\nDuncan Hoss\nUPDATE 1-16-17 15:00\nThere will be no victim identification or cause of death on the victim from the Sifton fire today. We are working with the Medical Examiner's Office to confirm the victim's identity and contact family members.\nOn January 15th at approximately 0533 hours 911 received a report of a business on fire at 13412 NE Fourth Plain rd. Vancouver Fire responded and arrived to a convenience store which was fully involved in fire. Despite the best attempts from the Vancouver Fire Department, the building could not be saved.\nInvestigators with the Clark County Fire Marshall's Office and the Clark County Major Crimes Unit responded to the location. During the investigation the body of a deceased subject was located within the rubble.\nClark County Major Crimes detectives took over the case and now are investigating this incident as a possible homicide. Anyone with information on this incident is asked to contact the Sheriff's Office Major CrimesTeam.\nThe victim has not been identified as of this point. No further information on the victim will be released tonight. The will be no other information released until sometime on January 16.\nPrepared by:\nSgt. Duncan Hoss\nMajor Crimes Detectives investigating stabbing incident - 01/10/17\nArrested: CHADWICK, Marvin J. DOB 01/08/1946 4017 NE 425th Street Woodland, WA.\nAt 07:25 Hrs. today, 01/10/2017 911 received a call from the residence at 4017 NE 425th Street of a reported stabbing incident. The caller reported that Chadwick had stabbed three other family members that also reside at this residence in a fit of rage. Chadwick was being restrained by family members. Sheriff's deputies arrived on scene and took Chadwick into custody. Two adult females and one adult male were transported via ambulance to SWPHMC with what is believed to be non-life-threatening injuries. Detectives with the Sheriff's Office Major Crimes Unit are en-route to conduct the investigation. The exact motivation for the assaults is still under investigation. No further details will be released at this time.\nATV collision - 01/02/17\nOn 1/2/2017 at approximately 2004 hours, units with the Clark County Sheriff's Office were dispatched to assist Clark County Fire District 3 and American Medical Response with a single vehicle accident involving an All-Terrain Vehicle (ATV) at the intersection of NE Berry Road and NE 240th Avenue.\nUpon arrival deputies learned that a total of four subjects were riding two ATV's southwest on NE Berry Road, and attempted to make the northbound turn onto NE 240th Avenue. The driver of one of the ATV's failed to negotiate the turn and left the roadway, striking a power utility box. The passenger on the ATV was ejected and sustained significant injuries.\nLife flight was dispatched to a near-by location and the passenger was airlifted to an area hospital. The extent of injuries is not known at this time.\nNone of the riders of either ATV were wearing helmets at the time of the incident.\nAlcohol, icy conditions and the use of non-street legal vehicles on public roadways are all believed to be possible contributing factors.\nThe Clark County Sheriff's Office Traffic Unit is investigating. There is no additional information at this time.\nSheriff's Office Trying to identify Theft Suspects (Photo) - 12/31/16\nOn December 28, 2016 in the early afternoon a male and female entered the Treasure Trove, a Consignment Store in the Orchards area of Vancouver. The female distracted the store clerk while the male entered a locked office at the rear of the store and stole the manager's cell phone and wallet. The pair then exited. Due to other customers the theft was not discovered for a couple hours. From the time the theft occurred and was discovered the victim's credit card was used several times at other businesses in Vancouver and Portland. Video in the store captured images of the couple and video of the male entering the office.\nThe female is described as White approximately 30 to 35 years of age with dyed red hair. The male was described as white approximately 30 to 35 years of age with an average build with brown hair in a ponytail and a beard.\nThe attached images of the two are provided in the hopes that someone can identify the suspects.\nAttached Media Files: Suspect 2 , Suspect 1\nSingle Vehicle Collision in Yacolt area - 12/30/16\nAt approximately 0230 this morning deputies with the Clark County Sheriff's Office responded to reports of a single vehicle collision at the 34000 block of NE Kelly Road. When deputies and Fire Personnel from Clark County Fire District 10 arrived they located a single vehicle off the roadway. The vehicles driver and only occupant was conscious but had to be extracted from the vehicle. The driver of the vehicle was transported to an area hospital for treatment. His current condition is unknown.\nDetectives from the Clark County Sheriff's Office Traffic Unit responded and are conducting the investigation. Speed and Alcohol appear to be factors in the collision.\nNo other information will be released at this time."}