{"uri": "http://www.clickondetroit.com/news/15-year-old-girl-fatally-shot-after-family-requests-speeding-driver-to-slow-down", "title": "15-year-old girl fatally shot in Detroit after family requests speeding driver slow down", "dct": "Sun, 16 Oct 2016 11:12:00 GMT", "id": "49b022a89fe628f20e34ca196ca882ac", "content": "DETROIT - A 15-year-old girl was fatally shot after a speeding driver became angry at requests to slow down, police said.\nDetroit police said the shooting happened at approximately 2 a.m. Sunday, on the 14300 block of Ardmore Street on Detroit’s west side.\nA family celebrating a birthday was standing outside when a man started speeding up and down the street.\nWhen the family confronted the speeding driver, the driver produced a handgun and began firing shots.\nPolice said one of the bullets struck 15-year-old Jada Rankin and that Rankin’s uncle attempted to follow the shooter in his own vehicle, but lost control and hit a light pole.\nRankin was transported to a hospital, where she died.\nRankin's family said she was a student at Sterling Heights High School with a 4.0 GPA who was getting ready for her first homecoming this Friday.\nDevastated family members said the last thing Rankin said was “Chris,” which is her brother’s name.\nWitnesses said the shooter, who is described to be a black man in his 20s, was driving a royal blue Fusion, Impala or Malibu.\nWarren Consolidated Schools is mourning the teenagers death. They released the following statement Sunday:\n“Jada was a great student who had an energy about her and was always willing to help out,” Principal Craig Miller said. “This is a tremendous loss for the Stallion community.”\nThe district’s crisis team, including social workers and counselors, will be in place on Monday to assist students in dealing with the grieving process.\nIf anyone has information on this shooting, contact Detroit police at 313-596-2200.\nCopyright 2016 by WDIV ClickOnDetroit - All rights reserved."}