{"uri": "http://www.cleveland.com/metro/index.ssf/2016/05/family_relieved_that_cleveland.html#incart_river_home", "title": "Family relieved that Cleveland child injured by stray bullet is recovering (video)", "dct": "Sat, 14 May 2016 15:17:00 GMT", "id": "31f8293d84c72353a3fe5cdb6c0c1b96", "content": "CLEVELAND, Ohio -- Family members are relieved that a stray bullet did not seriously harm a 2-year-old girl after it shattered a bedroom window and grazed her chest Friday in Cleveland.\nDy'aira Carter DeVaughn is recovering after the bullet grazed her chest Friday on Golden Avenue near East 80th Street.\nShe received treatment at Rainbow Babies & Children's Hospital and has since been released, her great-grandmother said Saturday.\n\"I just thank God that I don't have to prepare for a funeral,\" Joyce Carter Burden said. \"The way the bullet hit her chest, it could've killed her.\"\nDy'aira was in the bedroom with her mother and uncle at the time. Carter Burden said she heard a loud noise and thought someone fell out a window.\n\"We jumped up from the table and they came running downstairs,\" she said. \"They brought her downstairs and we saw the mark on her chest where the bullet grazed her.\"\nInvestigators said the shooting might be related to a fatal shooting that happened several blocks away.\nDavonte McLean, 23, suffered several gunshot wounds in a suspected drive-by shooting near the intersection of East 80th Street and Cedar Avenue, police said.\nHe died after being taken to University Hospitals Case Medical Center, the Cuyahoga County Medical Examiner's Office said.\nInvestigators told Dy'aira's family that a stray bullet from that shooting might have injured the girl, Carter Burden said.\nIncidents like the shooting that injured Dy'aira have Carter Burden considering a move out of the neighborhood, she said Saturday.\n\"Every six months someone is getting killed,\" she said. \"It's too much.\"\nDy'aira is the fourth child injured in a shooting in the past week in Cleveland.\nThe first injured a 12-year-old boy May 7 on East 66th Street near Superior Avenue. The boy suffered a gunshot wound to the knee in a drive-by shooting, police said.\nThe second shooting injured a 13-year-old boy Sunday in a house on East 153rd Street near Harvard Avenue. The bullet entered a living room and hit the boy's lower back while he was visiting family for Mother's Day.\nCouncilman Zack Reed witnessed a shooting the following night that wounded a 14-year-old boy outside the Cleveland Public Library's Mt. Pleasant Branch on Kinsman Road. The shot hit the boy's thigh.\nComment on this story and other crime stories in today's crime and courts comments section.\nThe Cuyahoga County Medical Examiner's Office has identified the man killed Friday evening in a drive-by shooting on Cleveland's East Side."}