{"uri": "http://www.mlive.com/news/grand-rapids/index.ssf/2016/02/man_who_killed_3_including_own.html#incart_2box_news_grand-rapids", "title": "Man who killed 3, including own son, shows no remorse for 'horror,' judge says", "dct": "Mon, 29 Feb 2016 11:36:00 GMT", "id": "135c2791676b70897e02c1fc671f37c6", "content": "ALLEGAN COUNTY, MI - A man who shot and killed his girlfriend and two children, including his own son, before setting their mobile home on fire, was sentenced Monday, Feb. 29, to 55 years in prison.\nThe crimes were \"unspeakable,\" Edine Bronold told a judge.\nShe lost her daughter, Debra Sheppard, 33, and grandchildren, Emma McComber, 12, and Corey LaValley Jr., 10.\nWitnesses previously testified that LaValley had questioned if he was the biological father of his son.\nHe earlier pleaded no contest to three counts of second-degree murder and claimed he had no memory of the crimes.\nOthers, however, said he confessed in the hours after the March 10 killings at Sheppard's home on Briarwood Street in Dorr Township.\nWitnesses said he and Sheppard had a rocky relationship.\nBronold said she had treated him like family, letting him live with her for time, and invited him to holiday gatherings, including Christmas.\nThe betrayal crushed her.\n\"This was premeditated, planned and executed,\" she said.\nAll of the victims were shot in their heads, presumably while sleeping, by a single-shot shotgun.\n\"It's clear this was a premeditated attack on the victims,\" Assistant Allegan County Prosecutor Rob Kengis.\n\"He had to reload every time.\"\nKengis said that LaValley has shown no remorse.\nHe said the 55- to 82-year sentence, part of a plea deal approved by the victims' families, would likely keep the 33-year-old locked up the rest of his life.\nLaValley, in a black-and-gray striped jail uniform, disputed Kengis' assertion he showed no remorse.\n\"Remorse is something that you don't show outwardly, it's something when you're alone at night. For somebody to say there's no remorse, they don't know. They just don't know,\" he said, his voice cracking.\nAllegan County Circuit Judge Margaret Zuzich-Bakker said LaValley told a pre-sentence investigator that he loved his family and the \"tragedy breaks his heart\" but she said he has not shown remorse.\n\"That's a pretty obtuse statement for somebody who shoots people in the head - shot his own son in the head,\" the judge said.\n\"I hope and pray they were all asleep when this happened. I can't imagine the horror of seeing (a loved one) pointing a weapon at their face and shooting. You have committed the ultimate act of power control.\"\nShe said that Sheppard's other son, Jacob Shambeau, who was 14 at the time of the killing, has suffered overwhelming loss. Fortunately, she said, he has support of others in the family.\n\"I feel very, very, very sad for Jacob,\" she said.\nShe said that LaValley had a chance to think about what he was doing every time he reloaded.\n\"You wanted to kill three people,\" she said. \"A mother, a son, a daughter, a sister, a sibling. It's inconceivable.\"\nShe said LaValley has suggested there was another side.\nShe said there wasn't.\nJohn Agar covers crime and other issues for MLiveE-mail John Agar: jagar@mlive.com and follow him on Twitter at twitter.com/ReporterJAgar"}