{"uri": "http://www.freep.com/story/news/local/michigan/detroit/2015/11/12/detroit-boy-shot-father/75643966/", "title": "Dad charged after son apparently shoots self to death", "dct": "Thu, 12 Nov 2015 00:00:00 GMT", "id": "0a9e20268194935f658f78cdab4b1368", "content": "The father of a 9-year-old boy who fatally shot himself Monday on Detroit's west side was charged Thursday with second-degree murder and other charges.\nChristopher D. Head, 45, of Detroit was arraigned in 36th District Court in the death of Daylen Makhai Head, the Wayne County Prosecutor's Office announced. Daylen's death sent ripples through the community and the Academy for Business and Technology in Dearborn, where he was in the third grade.\nAccording to the prosecutor's office, Daylen was found around 12:36 p.m. in a home in the 6600 block of Barton with a fatal gunshot wound to the head. Detroit police previously said his father found him in an upstairs bedroom.\n\"It is alleged that the father possessed a loaded shotgun that was not secured and accessible to the child,\" the prosecutor's office said in a statement.\nThe case remains under investigation, and no further details will be released at this time, the office said. Head was charged with second-degree homicide, involuntary manslaughter, second-degree child abuse, use of a firearm in a felony, firearm possession by a felon and a \"short-barreled shotgun\" firearms charge.\nMeanwhile, those who knew Daylen, 9, are grappling with the loss.\nHe was well-loved at his school and was known for his energetic spirit. According to his school's leader, Daylen had a smile that could warm anyone's heart and was a bright spot in the lives of those who knew him.\n\"He was a fine young man — full of life, high energy,\" said Paul Merritt, school leader of the Academy for Business and Technology.\nDaylen's family, friends, classmates and teachers are shocked and grief-stricken, Merritt said. Grief counseling support has been made available for students and staff, Merritt said.\nDaylen was a student at the school for more than two years and had a remarkably positive attitude, Merritt said. \"The report cards for the first marking period are coming out today,\" Merritt said. \"He would have had above-average grades with no absences, which is quite an accomplishment.\"\nThe school has united to help Daylen's family. Merritt said the school has launched a GoFundMe account, Funeral Expenses for Daylen Head, on behalf of the family. About $1,600 of the $5,000 goal had been raised. Funeral arrangements will be announced in the coming days, Merritt said.\n\"Whenever someone passes, there are a lot of expenses associated with that,\" Merritt said. \"We just wanted to help out. A member of our family has been taken from us. It just seems like the right thing to do.\"\nHead was remanded to jail Thursday morning. A probable-cause hearing is scheduled for 8:30 a.m. Nov. 19. A preliminary examination is scheduled for 1:30 p.m. Nov. 25 before Judge Shannon Holmes.\nContact Katrease Stafford: kstafford@freepress.com or 313-223-4759."}