{"uri": "http://www.detroitnews.com/story/news/local/detroit-city/2016/07/25/father-prison-son-death/87529036/", "title": "Father gets up to 50 years in prison in son’s death", "dct": "Mon, 25 Jul 2016 00:00:00 GMT", "id": "b4a85bef6ed9f3ab3c6d4c4382c324cf", "content": "A Detroit father was sentenced up to 50 years in prison Monday for the shooting death of his 9-year-old at the hands of the boy’s sister.\nChristopher Head, 45, was sentenced to 25 to 50 years for manslaughter alone in the death of his son by Wayne County Circuit Court Judge Dana Hathaway. He was also sentenced on child abuse and several weapons charges. Those sentences, ranging up to 50 years, will run concurrently with the manslaughter conviction. Head will get 116 days credit for time already served.\nThe boy was shot to death by his sister when she found a loaded shotgun in the man’s home last year. It was originally reported that the boy shot himself.\nHead was convicted for the shooting by a jury July 7.\nHead’s son, Daylen Head, was shot to death with a sawed-off shotgun in November at the father’s home in the 6600 block of Barton, on the west side. A felon, Head also violated the law because he was not legally allowed to own a gun.\nThe boy’s 8-year-old sister found the shotgun in an unlocked closet and fired the loaded weapon, allegedly mimicking a video game, striking her brother in the head. She took the stand during the trial to testify about the shooting.\nDuring her victim-impact statement Monday, the boy’s mother, Abbey, told Head that although her son’s death was an accident “it very well could have been prevented.”\n“I’m not here for closure because I know it’s something I’m not going to get,” the boy’s mother said through tears. “My son is gone. My children will never be the same.”\nShe continued: “I’ve tried and I prayed and I continue to try and pray so I can forgive you, but right now I’m not there.”\nShe criticized Head for “not reaching out” and comforting his children.\nHead cried and told Hathaway “bad things do happen on some of the most beautiful days.”\n“I know I was doing my job as a father,” Head told the judge, before he begged her for leniency and pleading with her not to take “me away from my babies for a long time.”\nHathaway told Head “you are still blaming your daughter” for the incident.\nHead’s brother Reginald called the sentence “harsh” given that the shooting was an accident.\n“I knew he was going to get some time but not that much time,” Reginald Head said following the sentencing, in which family members cried over the loss of the child and the father’s lengthy prison sentence. “It was a mistake.”\nReginald Head said his brother tried to plead guilty in a plea deal that would have sent him away for 15 years but the deal fell apart.\nAssistant Wayne County Prosecutor Michael Woodyard, called the case one “that is exceptionally tragic” and “an unspeakable tragedy.”\nHead’s prior criminal record dates back to 1989, and includes charges for extortion, stalking, possession of a concealed weapon, and the delivery and manufacture of cocaine in Wayne County. A 2006 arson case against Head was dismissed.\nbwilliams@detroitnews.com\n(313) 222-2027"}