{"uri": "http://www.mlive.com/news/detroit/index.ssf/2016/05/girl_shoots_brother_while_mimi.html#incart_river_home", "title": "Girl shot brother while mimicking video game", "dct": "Fri, 27 May 2016 07:24:00 GMT", "id": "d30a2a4f9573839a1715307a058c6680", "content": "A Detroit father is jailed, awaiting a July trial for the killing of his 9-year-old son, but it's actually his daughter who pulled the trigger, Wayne County Prosecutor Kym Worthy's Office says.\n\"This is really an example of the most egregious set of allegations ... that we've seen in recent memory,\" Worthy said at a press conference about child shootings in Detroit Wednesday.\n\"The allegations in that case are the defendant knowingly kept a loaded, unsecured, sawed-off shotgun in his bedroom closet on the floor, in plain site ...\n\"His room is also where the video game console was located. His daughter -- allegedly -- age 10 years old, pulled the shotgun out of the closet ... and mimicked the activity in the video game she had just seen her brother playing with.\"\nWorthy called a press conference to draw attention to the increasing problem of child shootings involving unsecured, loaded firearms Wednesday. She said eight Detroit kids have been killed or seriously injured after finding unsecured guns in the last 17 months.\nThe 45-year-old father, Christopher Head, told police in a signed statement his two children, including Daylen, who died, were upstairs about 15 minutes before he heard the \"boom\" at his home on Nov. 9.\n\"As I was running up the stairs, (my daughter) was running downstairs, yelling, 'Daddy, I didn't do nothing, I didn't do nothing,'\" a Detroit police officer said, reading from Head's statement at the preliminary examination in December.\nAt the time, it wasn't clear how the weapon discharged. Police were vague when asked if they believed Daylen shot himself and cited an ongoing investigation. On Dec. 1, the Wayne County Medical Examiner said the matter was still under investigation and listed the manner of death as \"indeterminate.\"\n\"At the time of the preliminary examination, at least according to The People, they were not aware of this, that the young lady had not confessed to her role in her brother's shooting,\" Christopher Head's Detroit-based attorney, Byron H. Pitts said this week.\nChristopher Head's Detroit-based attorney, Byron H. Pitts, says Wayne Prosecutor Kym Worthy is \"overcharging\" the grieving father in reaction to the tragedy, but has little evidence to support -- specifically the murder charges -- against Head.\nNot only was Head, because of his prior felony record, not legally allowed to possess a gun, but the gun he possessed was itself illegal, a sawed-off, short-barrel shotgun, Wayne County District Judge Shannon Holmes said at the preliminary examination.\nHead's prior record includes a plea of no contest to extortion and aggravated stalking and the dismissal of an arson charge in 2006, according to Wayne County online court records. He was also found guilty of illegally carrying a concealed pistol in 1989 and cocaine possession in 1994.\nHolmes called it a \"wanton and willful disregard\" for the safety of his children before upholding the murder charge against Head in December.\nHead decided not to take his case any further once it was bound over to the Wayne County Circuit Court. He pleaded guilty to all charges as part of a plea agreement\n\"He pleaded guilty to second-degree murder and he was willing (to forgo) trial to save his daughter from testifying about her role\" in Daylen's death, Pitts said Wednesday.\nIn exchange for Head's plea, Worthy's office agreed to request a sentence of six years in prison -- but the deal stalled.\nAt sentencing -- after guilty pleas were already entered by Head and typed into the court's computer system -- Wayne Circuit Court Judge Dana Hathaway called it off.\nHathaway \"felt she could no longer give him the agreed upon sentence,\" Pitts said, so now the matter will likely go before a jury.\nPitts previously said Worthy was \"overcharging\" his client and is confident a jury will agree.\n\"I plan to win this case,\" he said. \"Period.\"\nHead was initially denied bond but freed from jail after family -- and a good Samaritan who took interest in his case -- hired Pitts. Pitts argued for and won a reduced bond Nov. 19, but Hathaway remanded Head to the Wayne County Jail on the day she rejected the plea deal.\nHe is set for trial before Hathaway at 9 a.m. July 5."}