{"uri": "http://homicides.suntimes.com/2016/07/18/it-was-crazy-witness-recounts-aftermath-of-fatal-shooting-of-trevon-smith-wounding-of-second-teen-in-kenwood-alley/", "title": "‘It was crazy’: Witness recounts fatal shooting of Trevon Smith, wounding of second teen, in Kenwood alley", "dct": "Mon, 18 Jul 2016 11:45:00 GMT", "id": "19543f6337cf6743c7e267aa6014436c", "content": "Fifteen-year-old Trevon D. Smith was killed and a 16-year-old boy was wounded in a shooting early Sunday in a Kenwood neighborhood alley.\nIt happened just outside Michelle Fulton’s bedroom window.\n“I’ve never seen anything like this before,” Fulton, 49, said. “I’ve seen a lot, but nothing like this.”\nThe teens were walking in the alley about 12:50 a.m. in the 4700 block of South Ellis when a red minivan pulled up and someone inside opened fire, according to Chicago Police.\nSmith, of the 7300 block of South Dorchester, was shot multiple times and was pronounced dead at the scene at 1:15 a.m., according to police and the Cook County medical examiner’s office.\nThe other boy suffered a gunshot wound to the left leg and was taken to a hospital in serious condition, police said.\nA GoFundMe page has been set up by the family to help with funeral expenses.\nThe teen’s body could be seen lying a few yards from at least eight shell casings on the alley sidewalk next to Fulton’s building.\nFulton, who has lived in the building for 17 years, said she was watching “Game Of Thrones” when she heard eight gunshots.\nWhen she looked out of her window into the alley, she saw one boy lying in a pool of blood and the other running, but limping, and yelling, “Help me somebody, help me! He shot my brother, they killed my brother! He’s dead, he’s dead!”\nFulton said she saw the minivan drive out of the alley, turn north on Ellis and stop at the light on 47th Street, before completing a left turn.\n“They waited for the light to change before they turned left,” she said. “It was crazy.”\nThe boy with the leg wound rested against one of several cars parked outside the building while he waited for paramedics, Fulton added.\nA mother of three, she said she is worried about her 19-year-old son.\n“The streets are calling his name every day, that’s why I’m talking,” she said, adding she will never forget the sight of the teen’s body lying in her alley.\n“I’m kind of undone tonight,” she said. “You hear about it, but when you see something like this happen—I have a son, it could’ve been him. Thank God it wasn’t, but that boy, he was somebody’s son, too.”"}