{"uri": "http://www.wbaltv.com/news/maryland/baltimore-city/man-faces-35-charges-in-quadruple-shooting/21001854", "title": "Man faces 35 charges in quadruple shooting", "dct": "Wed, 17 Jul 2013 12:52:00 GMT", "id": "66e84a309eccce5eb05457a62ad62a42", "content": "BALTIMORE —\nBaltimore City police have arrested a man in a quadruple shooting last week in west Baltimore.\nPolice Commissioner Anthony Batts is trying to send a message that neighborhoods willing to talk have his ear.\nLamont Jones, 29, faces 35 criminal charges related to last Tuesday's shooting of four men in west Baltimore. They were sitting on steps in the 600 block of North Carrollton Avenue near Edmondson Avenue. The men suffered injuries that were not considered life-threatening.\nInvestigators said Jones and another man approached the victims wearing construction vests and hats, and they started shooting. According to the police commissioner, the motive was personal.\n\"This is a modern day Hatfield and McCoys. All of these people have been related or somehow connected to each other, and what we are doing is peeling them apart and bringing them to justice,\" Batts said.\nJones is charged with the shooting of the four men. Police said they believe two other cases that happened nearby -- two homicides on the same block -- are related.\nBatts promised to next go after two drug houses on the North Carrollton block. He credited the community with stepping up with information.\n\"I walked out here personally myself and talked with neighbors. They are sharing information. They are concerned about their neighborhood and concerned with people terrorizing their neighborhood, and (they) don't want to put up with it anymore,\" the police commissioner said.\nPolice confirmed the highly-sought public enemy No. 1, Darryl Anderson, may have struck again in connection with a home invasion Monday morning in Rosedale. Anderson is linked to two slayings that were motivated by anger and hate, police said.\n\"What the rumor mill is, he is an enforcer or a hit man for the Black Guerrilla Family. He is tied to a number of violent incidents, not just one,\" Batts said.\nHe said the quadruple shooting is also linked to the BGF gang. The organization is believed to be responsible for the surge in violence in the past month."}