{"uri": "http://www.wbrc.com/story/34140737/17-year-old-killed-in-hueytown-identified", "title": "UPDATE: Hueytown police say suspect in 17-year-old's murder is in custody", "dct": "Thu, 29 Dec 2016 04:05:00 GMT", "id": "5a32966c1d8afa814d7d8b2cc12d5d13", "content": "HUEYTOWN, AL (WBRC) -\nHueytown Police Chief Chuck Hagler says that the suspect accused of the capital murder of a 17-year-old has turned himself in.\nDeion DeWayne Jones, 21, is charged with two counts of capital murder in Steven Colt Coggins' death. One count of capital murder is for a shooting during a robbery and the other count is for shooting into an occupied vehicle. He is booked into the Jefferson County Jail with no bond.\nCoggins, who is from McCalla, was shot around 3:30 p.m. Tuesday, Dec. 27 in the 500 block of Carver Avenue in Hueytown.\nHueytown police say Coggins was shot in the course of an \"illegal transaction involving a firearm.\" Chief Chuck Hagler says Coggins nor the two suspects are even from Hueytown.\nWhen officers arrived on Carver Avenue they did not find the victim or a suspect. Police say after the shooting, Coggins was driven to his home in the McCalla community by the people he was with. This area of McCalla is in Tuscaloosa County so the Tuscaloosa County Sheriff's Office notified Hueytown police of his death.\nThe coroner has not released how Coggins died.\n\"As much as we'd like to pretend that whatever little kingdom we run or work for is some how isolated and indifferent, it's not,\" Chief Hagler said. \"Crime in the metropolitan area will reach out and touch all of us, no matter where we live. It's just a fact.\"\nHueytown police say the investigation led to Jones as a suspect.\nHueytown police say a second suspect was arrested by the Jefferson County Sheriff's Office at another location in McCalla. He has not been formally charged yet but police expect to file charges on Thursday.\nCoggins grandfather tells us he is very upset by the situation and called his grandson a good kid.\nCopyright 2016 WBRC. All rights reserved."}