{"uri": "http://www.al.com/news/birmingham/index.ssf/2016/12/18-year-old_is_2nd_suspect_cha.html", "title": "18-year-old is 2nd suspect charged in shooting death of McCalla teen in Hueytown", "dct": "Thu, 19 Jan 2017 04:06:56 GMT", "id": "b3bfcd4f15dc2a64e90bf6a1af65b484", "content": "A second person has been charged in the shooting death of a 17-year-old McCalla boy killed during an illegal gun transaction and robbery attempt in Hueytown earlier this week.\nHueytown police on Thursday announced a felony murder charge against 18-year-old Brenden Jordan Long, also of McCalla. Long, held since Tuesday night, was booked into the Jefferson County Jail at 1:31 p.m., jail records show. His bond is set at $75,000. His mugshot wasn't immediately available.\nLong is charged in the Tuesday shooting death of Colt Coggins. Under Alabama law, a person commits felony murder when \"in the course of and in furtherance of the crime\" another is killed. The charge is a Class A felony.\nAlready charged is Deion Dewayne Jones, 21, of Dolomite. Jones, believed to be the shooter, is charged with two counts of capital murder in Coggins' death. The charge against Jones is capital because the killing happened in the course of a robbery, and because the shots were fired into a vehicle. It appears, said Hueytown police Chief Chuck Hagler, that Jones was planning to rob Coggins during the gun deal.\nJones surrendered to the Jefferson County Jail Wednesday evening. He was booked in at 5:16 p.m. and is being held without bond. He refused to answer detectives' questions following his arrest.\nThe shooting happened about 3:30 p.m. Tuesday in the 500 block of Carver Avenue in Hueytown. Hagler said the victim and several other juveniles were in a car on the dead end street \"There was an illegal transaction involving a firearm,'' the chief said. \"And during the course of the transaction, Mr. Jones shot the victim in the head.\" He did not say whether Coggins and Jones and Long previously knew each other.\nThe shooting happened about 3:30 p.m. on Carver Avenue in Hueytown. The victim's friends then drove him back to a home on Huggins Drive in McCalla, right off of Tannehill Parkway just inside the Tuscaloosa County line.\nCoggins' friends then panicked, and drove him back to Coggins' home on Huggins Drive in McCalla, right off of Tannehill Parkway in Tuscaloosa County. The teen was pronounced dead in the car at the Huggins Drive home.\nHagler said Hueytown officers responded to the shooting on Carver Avenue, but arrived to find everyone had scattered, including the victims and the suspects. They set up a perimeter and began searching for two suspects, both black males, and also issued a lookout bulletin for the car that fled the scene with the victim inside.\nWhile they were searching in Hueytown, they received word from the Tuscaloosa County Metro Homicide Unit that the teen had been brought back to Tuscaloosa County and was in a car matching the description of the lookout bulletin. Once they determined the shooting had happened in Jefferson County, the Jefferson County Coroner's Office and other investigators responded to that scene.\nThe friends of the slain teen were taken in for questioning, and the chief said detectives determined they weren't involved in the homicide.\nHueytown police, joined by Pleasant Grove police and the Jefferson County Sheriff's Office, continued their hunt for the shooters. Long was taken into custody about 9 p.m. in McCalla.\nCoggins' death is Hueytown's first homicide of 2016. The western Jefferson County city averages about one homicide every 18 months or so.\nOn Wednesday, the chief noted at that neither the victim nor the suspects lived in Hueytown. \"Nobody involved in the crime lives here,'' he said, adding that crime knows no boundaries. \"Crime in the metropolitan area will reach out and touch all of us.\"\n\"Once again, we have a senseless crime involving a bunch of kids that are way too young to be getting killed or killing people,'' he said. \"It's a sad commentary.\""}