{"uri": "http://www.ksla.com/story/34031896/lcpd-shooting-at-1835-rena-street", "title": "UPDATE: Arrest made in Rena street homicide", "dct": "Tue, 13 Dec 2016 04:09:00 GMT", "id": "88d9cae6690e8486faf941b6d1540169", "content": "LAKE CHARLES, LA (KPLC) -\nLake Charles police arrested an 18-year-old man in the death of a 17-year-old female who was killed in a shooting in the 1800 block of Rena Street Monday.\nJames Lemarcus Freeman, of Lake Charles, was arrested at 6:35 p.m. on charges of second-degree murder and second-degree feticide, said Sgt. Jeffrey Keenum, police spokesman.\nHe's in jail on a $375,000 bond.\nLake Charles police responded to the shooting at 11:30 a.m, said Deputy Chief Mark Kraus, Lake Charles Police Department spokesman.\nOne neighbor who lives behind the woman, heard the gunshot.\n\"I was in my house when I heard a gunshot, and when I came out I heard a young man hollering,\" said neighbor Tatanisha Jackson. \"When I ran to the corner he was saying that he shot the young lady and he had to call his mom.\"\nAnother neighbor heard the gunshot as well and also witnessed what happened afterward.\n\"I heard a pop and then the guy had decided to start moving around in the house, and then afterward he took the baby and made his phone call and then he went around the house,\" said neighbor D.L. Richard. \"I didn't see what he put in the house or on the side of the building, but afterward he came back and finished his phone call.\"\nWith this being the fourth shooting that's happened here in Lake Charles in the last five days, it's left Jackson feeling uneasy.\n\"..I have a grand baby and it's getting worse,\" she said. \"They need to do something about.\"\nThe recent shootings have also concerned Richard, and made him more aware of his surroundings.\n\"It just keeps going on, but you got to remember this world is going down, but God doesn't want you going down with it,\" he said. \"..You got to make sure you're living right.\"\nThe case remains under investigation.\nCopyright 2016 KPLC. All rights reserved."}