{"uri": "http://www.wesh.com/news/deputies-man-turns-gun-on-self-after-killing-wife-two-kids/39080024", "title": "Man shoots self after killing wife, 2 young children", "dct": "Mon, 18 Apr 2016 16:00:00 GMT", "id": "18a1342576766c3521fd98263a0c1f7e", "content": "ALTAMONTE SPRINGS, Fla. —\nA family is dead after authorities said a man stabbed and ran over his estranged wife and shot his two young children before turning a gun on himself Sunday night.\nAccording to Seminole County deputies, it started when the estranged couple got into an altercation at the Chili's on West Lake Mary Boulevard just after 10 p.m.\n>>Download the WESH 2 News app for iOS and Android\nDeputies said the woman's estranged husband, Henry Ramone Brown, 30, had been hiding in the trunk. He waited for her to come out of the restaurant before attacking his wife, Chericia Brown, 31, stabbing her several times, according to officials.\nTwo people inside the restaurant came out to render aid. But Brown then returned in his vehicle and ran over the woman and the two people helping her. All three victims were taken to Central Florida Regional Hospital, where the woman died from her injuries.\nAccording to authorities, Brown then fled to an apartment complex in Altamonte Springs, where he switched vehicles and picked up his two children, ages 1 and 4, from the babysitter.\nAbout half an hour later, deputies and Sanford police encountered the suspect trying to find Chericia at the hospital.\nDeputies confronted the suspect, who pulled out a gun and began firing as he ran out of the hospital. Gunfire was exchanged, but no one was struck or injured and the suspect fled again.\nLaw enforcement officers pursued the vehicle on westbound I-4 until they reached U.S. 17-92 in Seminole County, where deputies had deployed stop sticks. Deputies surrounded the vehicle to find him and the children deceased.\nInvestigators said they believe Henry Brown killed his children at some point after picking them up and then killed himself as law enforcement prepared to take him into custody.\nAccording to deputies, the suspect and the woman were married, but split following a domestic violence incident in December.\nOf the two people who were struck by the vehicle in the Chili's parking lot, one remains hospitalized and the other has been released.\nFDLE is investigating the officer-involved shooting that happened at the hospital.\nWESH 2 News received a letter from the chief judge of Seminole/Brevard County courts.\nJudge John Galluzzo said, \"In this instance, the judge did everything in her power to enjoin Mr. Brown from having contact with his spouse, and yet he did. These deaths are tragedies that a piece of paper could not prevent.\"\nA Chili's Grill & Bar spokesperson released the following statement:\n\"We are shocked and devastated by the tragic incident that happened last night. We are fully cooperating with local authorities to support their investigation to understand what happened. Our hearts and prayers go out to everyone affected by this tragedy.\"\nCheck back for updates on this developing story.\n---\nIf you or someone you know needs help, contact the Florida Domestic Violence Hotline anytime at 1-800-500-1119."}