{"uri": "http://www.afro.com/suspect-arrested-in-baltimores-harlem-park-shooting-spree/", "title": "Suspect Arrested in Baltimore’s Harlem Park Shooting Spree", "dct": "Thu, 18 Jul 2013 00:00:00 GMT", "id": "319959a43dca703764c0f5f9cbf7acf5", "content": "Baltimore police have arrested a man they believe may be linked to as many as four shootings that left a total of seven people injured in less than a week in the city’s Harlem Park neighborhood in early July.\nLamont Jones, 29, of West Baltimore, was taken into custody July 14 in connection with the July 9 shooting of four people in the 600 block of N. Carrollton Ave. He is charged with attempted murder and other charges for each of the four victims.\nDuring a July 16 news conference, Baltimore City Police Commissioner Anthony Batts told reporters that police were assisted by “tips and people in the neighborhood.”\n“Four people were shot on this block,” Batts said at the news conference, which was held at the scene of the violence. “Lamont tried to take the lives of citizens on our block.”\nThe brazen daytime shooting shook local residents. According to police, bullets flew at about 2:45 p.m. on an afternoon when many local residents were sitting on their stoops and children were playing outside.\nWhen police arrived on the scene, they found two men lying on a stoop, another in the middle of the street and a fourth lying on his own front porch. Each had been shot, police said.\nAccording to witnesses, the man in the street had been gunned down as he attempted to run away. None of the victims have been identified by police.\n“All the dudes that got shot were my buddies,” said Keith Gillman, who lives on the block. “I heard gunshots and saw my dude ‘Pop’ laying on his step…and my other two buddies ‘Lil’ Troy’ and ‘Homicide,’ who ran in the 700 block and then fell to the ground.”\nGillman told the AFRO the man he identified only as ‘Pop’ was shot in the leg. Gillman said he stayed with him until the police arrived. “I just held him down,” he said.\nBatts said the shooting is indicative of the violence sweeping the western district of the city.\n“This neighborhood is on fire,” Batts said. “I’ve been out here a lot and talking to the neighborhoods. The neighbors provided a tremendous amount of data for us to follow up on. Half way through the year and the city has been faced with multiple shootings in areas of concern.”\nBatts said local residents are frustrated that people are being killed in their neighborhoods.\n“They are…concerned that people are terrorizing their neighborhoods,” he said.\nOn the day of the shooting, resident Yvette Sarabia, who moved to the neighborhood three months ago, told the AFRO she doesn’t feel safe.\n“I have four kids and I don’t allow them to go outside,” she said.\nAs of July 15, 126 people had been murdered in Baltimore this year, compared to 111 at the same time last year. During the same period this year, the city tallied 219 people shot, compared to 192 in 2012, according to police.\nBatts told reporters that police recently received tips that the Black Guerilla Family is trying to move into Harlem Park.\n“I will be out here and we will root out the problems that are impacting the young kids and their safety in their neighborhoods,” Batts pledged."}