{"uri": "https://www.baltimorebrew.com/2013/07/09/mayor-to-go-on-safety-walk-as-city-shootings-escalate/", "title": "Mayor to go on safety walk as city shootings escalate", "dct": "Tue, 09 Jul 2013 17:48:00 GMT", "id": "86261e728075d958a348ee42ce015520", "content": "Mayor Stephanie Rawlings-Blake will attend a public safety walk tonight in the Belair-Edison section of Northeast Baltimore as a new wave of shootings struck the city today.\nA man was killed and another injured early this morning less than a mile from where the mayor is scheduled to walk with community leaders, clergy and concerned citizens, starting at 7 p.m. at the Herring Run Library at 3801 Erdman Avenue.\nThe double shooting took place around 2:30 this morning in the 1800 block of East Lanvale Street, police said. A gunman opened fire on two men. One died at 4:45 a.m., while the other is listed in stable condition. The victims’ names have not been released.\nAt 3:45 this afternoon, four men were shot in West Baltimore’s Harlem Park neighborhood, according to police, who have not released their names or condition, though all are believed to have survived the attack.\nThe shootings took place on Carrollton Avenue, near Harlem Avenue, just four blocks from Bennett Place, an alley street that has been the scene of three murders so far this year.\nThe uptick in violence – nearly 50 shot since June 21 and 19 killed – has been attributed to the drug trade and turf battles between rival gangs by Police Chief Anthony Batts.\nBegan in late June\nThe shooting spree – the worst in the city in many years – has become the biggest challenge yet faced by Batts, who was hired nine months ago by Mayor Rawlings-Blake to run the police force.\nA palpable sense of fear and revulsion by many city residents – capped by a 10-mile march last Friday on North Avenue by 600 men – is also a blow to the prestige of the mayor, who has pledged crime reduction to be her No. 1 priority.\nTonight’s safety walk was announced by the mayor’s office before the latest shootings in West Baltimore. She is scheduled to be at the walk for about an hour.\nThe spike in violence began on Friday, June 22, when the mayor was attending a five-day conference of mayors in Las Vegas. Returning to the city on June 26, she noted at a press conference the importance of reducing the number of illegal handguns in Baltimore and other cities, a matter she and other mayors debated during the conference and passed a resolution directed at Congress.\nLast week, she led a safety walk through the McElderry Park neighborhood in East Baltimore, near a quadruple shooting that left 18-year-old Donyae Jones dead.\nThe mayor has repeatedly called on the community to help police find and lock up the perpetrators, while Chief Batts told reporters on June 26 that he had gotten matters under control.\nHe faulted his office for not releasing more information about police efforts to find the murderers. He also disclosed that he had demoted chief spokesman Anthony Guglielmi following his comment that the department was overall satisfied “with the way the city is headed, violence-wise.”\nSince then, official information from the police has been relatively scant, but last week the city registered the lowest weekly number of homicides (three) since the end of May, and there was a sense that the worst of the violence was over."}