{"uri": "http://triblive.com/news/allegheny/9365481-74/neighbors-police-county#axzz3qLbt9h00", "title": "Neighbors mourn 'lovable kid' dead in shocking Mt. Oliver shooting", "dct": "Mon, 02 Nov 2015 08:54:00 GMT", "id": "cbecf4be3d287822ed058a16495cae0e", "content": "David McIntyre liked art and reading, played hide and seek with kids on his street, held the jump rope while the neighbor girls played Double Dutch, and would shoot the breeze with friends and neighbors on any number of stoops along close-knit Hays Avenue.\nNeighbors on the Mt. Oliver street were at a loss Monday as to who would want to gun down the 11-year-old and his teenage brother, CJ Conrad, killing the sixth-grader and leaving the teen in critical condition.\n“He would sit here on the steps — the kids would all sit around and laugh,” said Gemiller Hughes, who has lived on the block for nearly a decade. “I'd bring them snacks. I'm just so upset. He was just a baby.”\nThe shootings happened about 8:45 p.m. Sunday, according to county police Lt. Andrew Schurman. Authorities believe there was a knock at the door of the residence and the shootings occurred inside, he said. They did not release information about any suspects.\nOthers were with the boys inside the home at the time, he said, and Allegheny County and Mt. Oliver police continue to investigate. Authorities did not release information about the boys' parents.\nThe family released a statement through attorney Lauren Darbouze, thanking their neighbors.\n“We are grateful for the outpouring of love and support from the community,” the statement read. “We have suffered a devastating loss and are requesting that our privacy is respected during this difficult time.”\nThe family does not own the home. Records say the property belongs to Martin and Cheryl Hinnebusch, who could not be reached.\nMonique McCullough walked two bundles of balloons up Hays Avenue to leave at the growing memorial outside the multi-family home where the boy was killed.\n“They would play in my yard,” she said through tears. “They would play in my yard every day.”\nDavid attended Pittsburgh Classical Academy, where he could often be found in the library, said school spokeswoman Ebony Pugh. She said he was well liked by both teachers and students.\nConrad, 16, attends Pittsburgh Carrick. The school made counselors available at Pittsburgh Classical Academy and sent a letter home to parents on how to help their children cope, Pugh said.\nHays Avenue residents say they're close, and neighborhood kids play in the street and throughout the surrounding backyards.\nThe brothers played football and were always willing to help neighbors with yard work and other chores, said June Saunders, 58, who lives down the road. He said he's known the boys for years.\n“They were always respectful, very responsible,” he said. “They always spoke to me when they saw me.”\nHughes said the brothers and other neighborhood children would sit on the couch on her porch, and she'd bring them Popsicles in the summer. Her daughter, Ardrea Hughes, lived on the street for many years before moving to Penn Hills recently. She said the brothers would play with her niece and nephew when they were at the house.\n“He was a lovable kid,” she said. “He wasn't bad.”\nShe said her niece stayed home from school, too upset by the death of her friend.\n“They would play ball together in the street,” she said. “When they were younger, they would draw hopscotch here on the sidewalk. When I heard the news, my mouth just dropped.”\nMargaret Thompson of Lawrenceville works as a care assistant at a home on Hays and said she was shocked to hear about the shooting.\n“It's just so sad,” said Thompson, who said her son was killed by gun violence almost three years ago. “It's so sad we have to live in this state. It seems like it's getting worse and younger.”\nMegan Guza is a staff writer for Trib Total Media."}