{"uri": "http://www.cincinnati.com/story/news/crime/2016/07/23/police-2-dead-millvale-shooting/87473300/", "title": "11 shot, 3 dead in less than 30 hours in Cincinnati", "dct": "Sat, 23 Jul 2016 00:00:00 GMT", "id": "694e75b8d9ad0c93d14edb5bd387ff12", "content": "Since 10 p.m. Friday night, 11 people have been shot in the city of Cincinnati. Three of those victims died, police confirmed.\n\"The Cincinnati Police Department is doing everything possible to investigate and address these violent acts,\" Lt. Steve Saunders said Saturday. \"But we need the cooperation of the community to identify whoever is involved. We need people to come forward and call Crime Stoppers. It's difficult for us to investigate these serious incidents without information.\"\nAs of July 16, police reported that the total number of shooting victims in 2016 was down 13 percent from last year and homicides were down 17 percent, according to the Strategic and Tactical Analytic Review for Solutions report published by CPD.\n\"I would look at what has occurred this weekend as a momentary uptick in shootings. I think a great deal of it is attributable to the heat,” City Manager Harry Black said “It’s not scientific. It’s not quantifiable, but I believe there’s a direct correlation between the weather and crime.”\nBlack explained that increased social activity and more people outdoors could lead to more conflicts. He has been in conversations with police officials through the weekend.\n“The victims, as of right now, as well as the perpetrators don’t appear to have been on any of our watch lists,\" Black said. \"A couple of the victims may have had some minimal previous contact with law enforcement, but nothing that would rise to a level of concern.”\nSince last summer, when shooting numbers were high for months, the city has begun several initiatives to combat the problem.\n“We have beefed up our CIRV activities. We have beefed up the resources that are in our Human Relations Commission. We’ve expanded staffing resources. We have reactivated the Partnering Center. Our outreach workers are out and engaged and active in terms of engaging community groups as well as families,” Black said.\nThe Cincinnati Police Department also began the P.I.V.O.T. program, which allows investigators go beyond neighborhoods when identifying high crime areas prone to gun violence. The new data collection and analysis allows block-by-block analysis and even allows officers to examine specific areas with apartment buildings.\nDespite these efforts, Black said the violence this weekend may fall outside of ongoing gang and drug trafficking activity, which can be tracked and investigated.\n“A lot of this is boiling down to personal conflict,” Black said. “How do you anticipate personal beefs and personal conflict? I don’t think you can do that.”\nBlack explained that while the violence this weekend is tragic, he doesn't believe it will continue.\n\"Safer streets is one of our top priorities and we are investing in it,” Black said. “The key is…we are trying to spend more money, but we’re trying to spend it in a very strategic and smart way.”\nPastor Ennis Tait has responded to every homicide in Cincinnati this year through Project Nehemiah Ceasefire and Cincinnati Works with vigils, anti-violence marches, youth mentorship and other programs. Tait was on the scene of Saturday's shooting in Avondale.\n\"This rash of shootings in the past 24 hours has been more than we've seen in a long time,\" Tait said. \"One of the things that I know that's missing in our city right now is hope.\"\nHe explained that he believes preventing violence in the streets starts with families.\n\"If you see an increase in broken relationships at home, you're going to see broken relationships in other places,\" Tait said. \"The spirit of brokenness eats away at a person's conscience and when that happens their respect for life begins to dissipate.\"\nTait said he plans to continue with vigils and take other action in response to Saturday's homicides.\n\"There have to be people inside our families who are willing to use their influence,\" he said.\nShootings presented in chronological order:\nNorth Fairmount: 2 injured\nAt least two men were shot late Friday night in the area of Beekman and Cummins streets. Police report they believe the two incidents were not connected.\nLt. Tim Brown said one victim was located in North Fairmount, and a second victim was found at Mercy West Hospital at approximately 10:30 p.m.\nPolice received reports of a third person shot, but could not locate a third victim, Brown said.\nA silver car with damage to a rear corner and a tire was taped off and investigated in the 2700 block of Beekman Street. The road was closed for more than an hour.\nBrown said no suspect information is available and that the victims were not cooperating with investigators.\nMillvale: 2 killed, 2 injured\nAbout a mile north of the shooting in North Fairmount, three men and one woman were shot early Saturday in Millvale in an incident that left two people dead, according to Cincinnati police.\nBobbie Odneal III, 23, was found dead on the sidewalk in the 3400 block of Beekman Street, police reported. Rickey McGowan, 25, was found wounded inside a building and died from his wounds at the University of Cincinnati Medical Center.\nThe other two victims were treated at UCMC and are expected to survive.\nThe intersection of Millvale and Beekman was closed for several hours and later reopened, but homicide detectives confirmed the investigation is ongoing.\nWest End: 1 killed\nA man was killed in the courtyard of the Stanley Rowe Community apartments Saturday on Lockhurst Lane near Liberty Street, police said.\nShe-ar Dornal, 18, was fatally shot just before 3 p.m. and was pronounced dead at the scene, according to press release from the homicide unit.\nA woman rushed up to the police tape and screamed, \"That's my brother\" as police held her back from the crime scene. Another man was tackled by police after running past the tape to the body.\nPolice said a suspect fled toward a nearby basketball court, but no arrests have been reported in connection with the homicide.\nAvondale: 1 injured\nA man was shot in the 800 block of Lexington Avenue at approximately 3 p.m. Saturday, police said.\nSaunders said the man was in surgery at 5 p.m. and is expected to survive his injuries.\nNo suspect information has been released regarding the incident. The identity of the victim has also not been released.\nOver-the-Rhine: 1 injured\nA 36-year-old man was shot in Over-the-Rhine near the corner of McMicken Avenue and Vine Street just after 4 p.m. Saturday, police reported.\nThe victim was struck once in the torso, and was taken to UCMC for treatment, officials said. He is expected to survive his injuries.\nInvestigators are searching for a 19-year-old man in connection with the shooting. A purple, hooded sweatshirt police believe belongs to the suspect was recovered near the scene.\nClifton Heights: 2 injured\nTwo women were shot in the 300 block of Warner Street at around 1 a.m. Sunday, police said.\nThe women were taken to the hospital and are expected to survive their injuries. Saunders said the women were in their late teens to early 20s but he was not sure if they were UC students.\nPolice do not have any information on the incident or suspects.\nAnyone with any information on these shootings is asked to call the Criminal Investigation Section at 513-353-3542, Crime Stoppers at 513-352-3040 or text CINTIP plus your message to CRIMES (274637). Callers may remain anonymous and may receive compensation for their information."}