{"uri": "http://www.kansascity.com/news/local/crime/article2968119.html", "title": "Girl, 6, fatally shot at south KC convenience store", "dct": "Fri, 17 Oct 2014 20:33:00 GMT", "id": "20b6f08787a82c4fdab27021fd8f118a", "content": "A 6-year-old girl was fatally shot Friday night at a south Kansas City convenience store.\nAngel Hooper was rushed to a hospital where she was pronounced dead, according to police Capt. Tye Grant. Police were looking for the gunman.\nThe shooting occurred shortly after 7 p.m. at a 7-Eleven store at 10615 Blue Ridge Blvd.\nGrant said the Hooper was walking out of the store with a family friend when someone in a passing car fired multiple shots. The girl was struck by at least one bullet.\nThe car was driving on 107th Street, on the south side of the convenience store.\n“I’m sure they were not intending to hit the young lady,” Grant said. “But this is what happens when you’re irresponsible like this.”\nInvestigators will review surveillance video from the store. “We have some leads that we are working on right now,” Grant said.\nA 7-year-old girl was in the store with a family friend when the shooting occurred.\n“We heard a big boom,” the girl said. “There was a lot of drama going on. Everybody was freaking out.”\nOfficers who were detaining possible witnesses at the store released the girl to her mother about 9 p.m.\nTia Strickland said her father and daughter drove into the store parking lot a few moments after the girl was shot.\n“They did see the little girl on the pavement. Very disturbing,” Strickland said. “... It could have been my daughter.”\nIn a Twitter message, Police Chief Darryl Forté urged the shooter or shooters to surrender to police:\n“TO SUSPECT(S): Please turn yourself in. I know you have a conscience. I don’t believe the (girl) was the intended victim.”\nThe store has been the site of other shootings in recent years.\nOn the afternoon of June 5, 2014, a shootout occurred in the store parking lot. Two men got into an altercation, and both pulled out guns and began shooting. Bullets struck the front window of the store and a nearby auto repair shop. No one was injured.\nOn April 17, 2013, a gunman tried to shoot a rival in a car parked outside the store. He hit the man’s pit bull and broke two store windows.\nTo reach Brian Burnes, call 816-234-4120 or send email to bburnes@kcstar.com."}