{"uri": "http://www.wave3.com/story/33072263/3-year-old-who-died-from-self-inflicted-gunshot-identified", "title": "3-year-old who died from self-inflicted gunshot identified", "dct": "Mon, 12 Sep 2016 14:15:00 GMT", "id": "cf492294c342d30b04b08944b93b2b26", "content": "LOUISVILLE, KY (WAVE) - A 3-year-old boy has died of a self-inflicted gunshot wound, according to Louisville Metro Police.\nThe incident happened at approximately 10:43 p.m. Sunday, September 11 at a home in the 1600 block of Brashear Drive.\nAnthony Blake Wells was rushed to Kosair Children's Hospital in critical condition. He died at 4:25 a.m. on Monday from a gunshot wound to the head, according to the Jefferson County Coroner's Office.\nALSO ON WAVE3.COM\n+ Student arrested after 'credible' threat to Floyd Central HS\n+ Police: Driver in deadly crash had .217 blood-alcohol level\n+ 5 bicyclists hit by vehicle in Bardstown\nLMPD spokeswoman Alicia Smiley said other people were inside the home when the shooting happened, but no one else was injured.\nSgt. John Lesher told WAVE 3 News the boy's parents were sleeping when the boy woke up and found the gun.\n\"The family everyone was there, everyone was sleeping,\" said Lesher. \"The child woke up after seeing someone put the gun in an unsecured spot.\"\nThe gun belongs to the boy's father and was found behind a TV, Lt. Todd Kessinger said. No charges are expected to be filed at this time.\nJust a month ago, there was a similar situation in the same housing project when a four-year-old girl found a stolen gun inside her home and accidently shot herself. Her injuries were non-life threatening.\nHugh Bell, 21, was charged with receiving stolen property and possession of a handgun by a convicted felon.\nAll of this can be prevented, according to WAVE 3 News Safety and Security Expert D'Shawn Johnson. He says gun owners must be responsible with their guns.\n\"We must protect our children and stop this repeated cycle of kids getting a hold of loaded guns,\" said Johnson.\nWATCH: Maira Ansari’s report\nJohnson is urging gun owners who have children in the home to get gun locks and put the gun in a safe location.\nPolice say the gun in Sunday's case was not stolen. LMPD's Major Crimes Unit is investigating.\nCopyright 2016 WAVE 3 News. All rights reserved."}