{"uri": "http://www.whas11.com/news/local/3-year-old-critically-injured-in-shooting/316765914", "title": "Police: Child shot self with gun found hidden behind TV", "dct": "Mon, 12 Sep 2016 00:00:00 GMT", "id": "d5a9a307be9d5f72bca135708f4b22c7", "content": "LOUISVILLE, Ky. (WHAS11) -- A Louisville family is mourning and a neighborhood wonders how this could have happened to a small child for a second time in a month. A three-year-old died early Monday morning hours after police say he found a gun and accidentally shot himself.\nAccording to investigators, that gun was hidden behind a television. The little boy retrieved it while his parents slept. The sound of a gunshot woke the couple about 10:30pm Sunday. They've been living a nightmare ever since.\nAs families made their way through the Park Hill Complex Monday there were no obvious signs of the awful ordeal that had played out Sunday night in the Algonquin neighborhood.\nParents held their children just a bit tighter after hearing what happened to three- year-old Anthony Blake Wells.\nLMPD investigators say, so far, they do not expect charges. The gun was legally owned, hidden behind a television in the apartment. The parents were asleep when little Anthony found it, accidentally firing the deadly round.\nWorkers at the community center nearby told us that they're considering bringing in grief counselors. It's the second time in a month children in this neighborhood have had a friend injured like this. On August 11th, a four-year-old girl accidentally shot herself after finding a gun in her apartment. She survived that shooting.\nInvestigators tell us that case has not yet been sent to the Commonwealth's Attorney's office, but charges are pending for someone connected to the shooting. In that case, police say the gun was stolen.\nThis time police stress that it appears there will not be charges.\nMany of the neighbors we spoke with told us that the pain the couple must be feeling is a punishment none of them would want to endure.\n“I couldn't even imagine,” said Chastity Moredock. “No one can imagine something like that happening. It just hurts. I hurt for the little boy. I hurt for the mother, the family, period. It's just sad.”"}