{"uri": "http://www.whio.com/news/local/fatal-victim-others-injured-dayton-shooting/HLaVPlbaqX6BlUe4XBHz1M/", "title": "Fatal victim ID’d, 3 others injured in Dayton shooting", "dct": "Sat, 29 Oct 2016 00:00:00 GMT", "id": "3465bd9790238e323782a5ef7b4b492e", "content": "UPDATE @ 11:40 a.m.\nThe Montgomery County Coroner’s Office has identified the man shot and killed in the area of Cornell Ridge Apartments overnight as 34-year-old James Appels, of Trotwood.\nUPDATE @ 2:21 a.m.\nA man is dead and three others are in the hospital following a shooting at the Cornell Drive Apartments in Dayton, according to police.\nThe man, whose age and name are unavailable at this time, was dead when police arrived, officers at the scene said.\nPolice said another man and woman who were both shot at the scene are in surgery at Miami Valley Hospital.\nOfficers told our crew they believe a fourth victim in the shooting was driven to the hospital from the scene.\nUPDATE @ 1:48 a.m.\nA portion of Cornell Drive is closed as police and medics respond to a shooting at the Cornell Ridge Apartments, according to our crew at the scene.\nOur crew reports police tape is surrounding the apartment complex and at least ten police cruisers are in the area.\nInitial reports indicate another victim in this shooting was taken to Miami Valley Hospital in a private car, potentially bringing the total number of people shot to four.\nWe are working to confirm additional details and will continue to post new information to this page.\nINITIAL REPORT (Oct. 29)\nAt least three people are reported shot on Cornell Drive in Dayton, according to dispatchers.\nPolice and medics were dispatched to the 3800 block of Cornell Drive around 12:30 p.m.\nInitial reports indicate a man has been shot in the area.\nDispatcher said at least three people have been shot and two are on their way to Miami Valley Hospital from the scene.\nWe have a crew heading to the scene to learn more and will update this page with new information."}