{"uri": "http://nbc4i.com/2016/10/23/columbus-police-child-taken-to-hospital-with-gunshot-wound/", "title": "Columbus Police: Child taken to hospital with gunshot wound", "dct": "Sun, 23 Oct 2016 12:59:00 GMT", "id": "2cb67e575d44116ae491d5a90bbf85e4", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCOLUMBUS (WCMH) — What started as a typical Sunday afternoon visit to play the neighbor’s house turned into a nearly awful accident in Columbus’ Hilltop neighborhood.\nA ten-year-old boy and his friends were playing inside the home at 560 Columbian Ave. when they came in possession of a gun and the boy was accidentally shot. His injuries are non-life threatening.\nThe landlord of the home said the tenants have given them issues in the past, but this will be the final incident as they were evicted today.\nNeighbors say this house was one of a few that cause the majority of the problems in the neighborhood.\n“A lot of where kids are out here running the streets at 12, 13, 14 years old and they don’t need to be,” says one woman who lives in the area and asked not to be identified. “They need to have their butts at home, doing productive things, making your kids productive members of society because at some point, they become everybody else’s problem.”\nColumbus Police have closed the case.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}