{"uri": "http://www.grandforksherald.com/news/4154055-bond-set-western-nd-man-charged-manslaughter", "title": "Bond set for western ND man charged with manslaughter", "dct": "Mon, 07 Nov 2016 16:42:00 GMT", "id": "d4bd407229c50f8b406bc624aa7757fb", "content": "DICKINSON, N.D.—A 20-year-old Dickinson man has been charged with manslaughter after he allegedly shot another man, who later died, with a handgun early Saturday morning, Nov. 5, according to Dickinson police.\nBoyd Stroh was arrested on Saturday morning after he allegedly shot Tanner Carrico, 21, of Dickinson, in the abdomen at close range on the 1700 block of Abraham Parkway in east Dickinson around 1:30 a.m. Saturday, according to a news release.\nCarrico was brought to the emergency room of CHI St. Alexius hospital by a friend. He died a short time later at the hospital.\nThe subsequent investigation by the Dickinson Police Department revealed that Carrico was \"socializing\" with Stroh and other acquaintances when \"Carrico was negligently shot by Stroh.\"\nA search warrant was obtained for the residence and police found and seized a large caliber revolver that they believed was used during the shooting.\nStroh was taken into custody later Saturday morning and was charged with Class B felony manslaughter.\nStroh made his initial appearance in Southwest District Court on Monday afternoon. Southwest District Judge Rhonda Ehlis set his bond at $15,000.\nSydney Mook\nSydney Mook started working as the multimedia editor for The Press in January 2016. She graduated from the University of South Dakota with a bachelor's degree in journalism and political science in three and half years in December 2015. While at the USD, she worked for the campus newspaper, The Volante, as well as the television news show, Coyote News. She also interned at South Dakota Public Broadcasting and spent the summer before her senior year interning in Fort Knox for the ROTC Cadet Summer Training program. In her spare time, Sydney enjoys cheering on the New York Yankees and the Kentucky Wildcats, as well as playing golf. If you've got an idea for a video be sure to give her a call!"}