{"uri": "http://www.nbc12.com/story/29191649/sources-deadly-on-i-295-tied-to-chesterfield-double-homicide", "title": "Police ID victims in crash connected to Chesterfield double homicide", "dct": "Sat, 30 May 2015 18:26:00 GMT", "id": "abf67ffc423e18f9958f7f24fc23ff3e", "content": "HANOVER, VA (WWBT) -\nVirginia State Police have confirmed Friday's deadly crash on Interstate 295 in Hanover is connected to the killings of a woman and young girl in Chesterfield reported hours earlier, and that the suspect is among the dead.\nWendell E. Hayman, 65 of Kansas City, KS and Ethel D. Ellis, 66, of Washington, D.C., both died at the scene of the crash. Two other people, Cynthia Robinson, 55, and John C. White, 66, were transported to the hospital with non-life-threatening injuries.\nThe suspect in the double homicide, Stafford Shaw, also died at the scene.\nShortly before 3 p.m., Chesterfield County Police requested State Police's assistance with pulling over Shaw, who was traveling on I-295 northbound around the 37 mile marker.\nShaw's Chevrolet Corvette sped away at a high rate of speed after a state trooper activated his lights. Within seconds, the Corvette ran off the left shoulder, went through the grassy median and struck a Chevrolet Malibu head-on that was traveling south on I-295 in the left lane. The Malibu then spun around, striking a Nissan Sentra in the southbound lanes. As the Nissan spun around, it was then struck by a Lincoln MKZ, also traveling in the southbound.\nShaw, who was the only person inside the Corvette, died at the scene.\nHayman, the driver of the Chevrolet Malibu, and passenger Ellis both died at the scene.\nRobinson, the driver of the Nissan, was transported to MCV. White, the driver of Lincoln, was transported to Memorial Regional. Both have non-life threatening injuries.\nSouthbound lanes near Chamberlayne Avenue and Meadowbridge Road (mm 41) were closed for several hours due to the crash. All lanes re-opened shortly before 7 p.m., and the backup had cleared by 7:30.\nCHECK CONDITIONS ON NBC12 TRAFFIC MAP: http://shout.lt/4Pkn\nNorthbound traffic is moving again as lanes were reopened around 4 p.m.\nSeveral witnesses reported seeing police pursuing a car in the moments before the crash took place. One witness to the accident, Allison Bryant, wrote on Facebook \"What I think was a Camaro came across the median and hit the car behind me and two more cars got hit.\"\nCLICK HERE FOR PHOTOS FROM THE SCENE: http://shout.lt/4PcY\nShe added, \"The police were already in the emergency vehicle area before it happened, so I am not sure if they were pursuing him or what happened.\"\nPictures from the scene show multiple vehicles involved with a huge debris field scattered across the road and into the median.\n34-year-old Morgan Rogers and her 1-year-old daughter Leah were found dead inside their Chesterfield home shortly after noon, when officers responded to a residence in the 20300 block of Ferintosh Court for a welfare check. Upon arriving and checking the residence, police found the two victims, dead from gunshot wounds.\nPolice continue their investigation into this incident and ask anyone with information to call Crime Solvers at 804-748-0660.\nCopyright 2015 WWBT NBC12. All rights reserved"}