{"uri": "http://www.shreveporttimes.com/story/news/breaking/2016/05/10/breaking-man-killed-shooting-wilkinson-street/84185194/", "title": "Tragedy results from mishandled handgun Tuesday morning", "dct": "Tue, 10 May 2016 00:00:00 GMT", "id": "c39b110ab7578792ad5ba8b5a3d10a84", "content": "A Shreveport man has been arrested in connection with the Tuesday morning shooting death of a local teenager.\nShreveport police responded to the shooting in the 1100 block of Wilkinson Street just after 9:30 a.m. Officers arriving at the scene learned the victim, Joshua Clark, 17, had been transported to University Health by a private vehicle after being shot once in the upper body. Clark died shortly after arriving at the hospital.\nClark and another man were sitting in a car parked on the shoulder of the intersection of Wilkinson Street and Barrett Street when the shooting occurred, police say.\nInvestigators believe the other man in the vehicle, Joshua's uncle, DaMarcia Clark, 18, was mishandling a handgun when it discharged and fatally wounded his nephew.\nDaMarcia Clark was detained by investigators and taken to the Shreveport Police Department. Following interviews, he was booked into Shreveport City Jail on a charge of manslaughter.\nAt least nine units responded to the incident, which was initially reported at 9:25 a.m., according to information on Caddo 911.\nCaddo Parish School Board spokesperson Mary Nash-Wood said Joshua Clark was enrolled as a freshman at Byrd High School and was listed as absent from classes Tuesday morning, but the reason for his absence was not reported.\nNash-Wood said Byrd's principal has a certified counselor on site and has not requested any additional staff to assist with grief counseling for students. However, staff were already assisting those who knew Joshua as news of his death spread Tuesday.\nDaMarcia Clark is not listed as a current student in the Caddo Parish school system, Nash-Wood said.\nA review of records from both Caddo and Bossier parishes does not show any history of criminal records related to DaMarcia Clark.\nAs of Tuesday afternoon, investigators with SPD were still working to determine the events leading up to the shooting. .\nSPD has not confirmed whether the gun belonged to one of the two people involved."}