{"uri": "http://www.wsbtv.com/news/local/dekalb-county/3-people-shot-in-dekalb-county/357421648", "title": "Police: 1 dead, multiple people injured in drug transaction shooting", "dct": "Thu, 23 Jun 2016 13:21:00 GMT", "id": "0e5aa1c1aafe7f991f9be9282a80994a", "content": "DEKALB COUNTY, Ga. - DeKalb County police say one person died and at least three others were hurt in a shooting near Stone Mountain.\nOfficers were called to an apartment on Lancashire Drive near Central Drive at about 3 p.m. Wednesday.\n\"I heard like 50 shots. It was going back-to-back like 'pow, pow, pow, pow, pow,\" said witness Ambreia Gray.\nBy 8:15 p.m. Wednesday Channel 2’s Nicole Carr and her photographer got a close look at what was left from the early afternoon gunfire.\n“Almost sounds like a war zone,” community activist Amos King told Carr.\nOne bullet hole was so big you could see right into the house. All of bullets were scattered across a front door of a Hidden Meadows townhome.\nDeKalb police say it's the result of a drug deal shootout between two groups.\n“Unfortunately it was outside. It could have gotten a little worse than it was. We're glad it didn't,” said Maj. Antonio Catlin.\nOne man ran across the street, dropping dead. The victim was identified as 18-year-old Antoine Alexander.\nThree others who were injured in the shooting are expected to face charges.\nKaren Powell told Carr that someone connected to the scene rushed to her home to call his brother, believed to be in the middle of that shootout.\n\"When he was dialing the phone it wouldn't ring. He was saying please answer, please answer the phone and they wouldn't pick up,\" Powell said.\n“This is very unfortunate today that many people shot in our neighborhood,” King said.\nKing said enough is enough.\n“You know what's going on in your community. You've got to say something about it,” King said.\nKing said he's organizing a town hall type meeting with police and neighbors at Victory Church next week.\nMeanwhile, DeKalb police say those injured suspects are at Grady Memorial Hospital and one other hospital. It's unclear what specific charges they'll face."}