{"uri": "http://www.nbcphiladelphia.com/news/national-international/Thirteen-People-Shot-at-Bridgeport-House-Party-390839752.html", "title": "13 Shot at Connecticut House Party", "dct": "Sun, 21 Aug 2016 13:26:00 GMT", "id": "3765ee41e1f2cc0bc0085352eece70a0", "content": "Thirteen people were shot while they were attending a house party in Bridgeport, Connecticut, early Sunday morning.\nPolice responded to a report of shots fire at 19 Plymouth St. at 1:27 a.m. Sunday.\nWhen they arrived, 13 people, 11 males and two females, were located with gunshot wounds.\nTen victims were treated at Bridgeport Hospital and three were treated at St. Vincent's Hospital.\nEleven of the victims sustained non-life threatening wounds to the lower extremities.\nOne male sustained a gunshot wound to the face. One female is in critical condition with a gunshot wound to the face.\nEight of the victims have been released from the hospital, Bridgeport Police Chief “AJ” Perez confirmed at a press briefing Sunday. Four remain under observation and one remains critical. Most of the victims are between 18 and 24. None of them have been publicly identified at this time.\nAccording to police, and party-throwers attempted to apply for a permit for the event but it was denied.\n“It was denied because they wanted to sell alcohol and charge for the party. So we frown upon that and did not allow this party to go on,” Perez said.\nInvestigators believe the party appears to have been for profit and there may be charges against the people who threw it.\nThe party went on without a permit, and the 13 victims were injured when at least two shooters fired through the hedges from the backyard at 31/33 Plymouth St. and struck the victims at 19 Plymouth St. Police said it was a confusing scene and witnesses said at first they didn’t realize what was happening.\n“We had what we believe in excess of 100 party goers,” said Bridgeport police Capt. Brian Fitzgerald. “So people initially thought was fireworks. By some accounts even the DJ said don’t worry about it, it’s fireworks until people started realizing they were shot.”\nPolice recovered 10 shell casings from a large-size caliber handgun, and it’s possible other weapons without casings were also used. Right now police are still looking for a motive.\nPerez said the department has stepped up patrols in the area while detectives investigate.\n“I am very confident and I say this with full confidence because I believe in the Bridgeport police department, the men and women that work here, we’re going to have an arrest in this matter in the very near future,” Perez said.\nAnyone with information should contact the police at (203) 576-8477.\nBridgeport Mayor Joseph Ganim and US Senator Richard Blumenthal, who both also attended the media briefing, praised police efforts. Blumenthal said he had a meeting with ATF earlier Sunday afternoon and promised federal assistance in the case if needed."}