{"uri": "http://www.ctpost.com/news/article/13-shot-Sunday-morning-at-Bridgeport-house-party-9175786.php", "title": "13 shot Sunday morning at Bridgeport house party", "dct": "Sun, 21 Aug 2016 00:00:00 GMT", "id": "d39e62f9cd81c9210c8dddd080a91a0d", "content": "BRIDGEPORT — An apparent ambush shooting on Plymouth Street early Sunday morning that injured 13 people — including one critically — occurred during an illegal, for-profit party attended by over 100 people, police said.\nPolice Chief A.J. Perez said the party hosts, who were not identified, applied for a city permit to sell alcohol prior to the party but were turned down because such sales violate city ordinances. He said the hosts, who rent one of two duplexes at 19 Plymouth Street, went ahead with the party anyway.\n“We had a tough morning,” Perez said during a Sunday afternoon press conference. “Officers encountered a chaotic scene with people suffering from gunshot wounds.”\nAt about 1:30 a.m. Sunday morning, two shooters, hiding behind six foot hedges at a next door property at 31-33 Plymouth Street, opened fire on the party goers with multiple weapons, including high powered handguns, police said. No suspects have been apprehended and a motive was not yet known, police said.\nEleven victims sustained non-life threatening wounds to their lower extremities and one male sustained a gunshot to the face that is not life threatening One female is in critical condition at Yale New Haven Hospital with a gunshot to the face. She is expected to survive but will require reconstructive surgery.\nMany of the victims were taken to a hospital by private car while others were transported by ambulance, making the situation even more confusing for officers, police said.\nMayor Joseph Ganim called the incident a “horrendous act that impacted so many people and, God willing, we will not have a fatality.”\nU.S. Sen Richard Blumenthal, D-Conn, said police will find the “animal who committed this atrocious act of criminality,” and called for Congress to enact “common sense” gun laws to take weapons off the streets of city’s like Bridgeport.\nCitizens with information about this crime should call 203-576-TIPS (8477)."}