{"uri": "http://www.tulsaworld.com/news/crimewatch/suspect-in-slaying-of--year-old-arrested-after-car/article_daae19ec-bf72-59cb-b9ce-e1cca07613b1.html", "title": "Suspect in slaying of 17-year-old arrested after car crash", "dct": "Wed, 03 Aug 2016 00:00:00 GMT", "id": "5bfb7a8d31c8118c59a2fc6d637e4430", "content": "Related story: Charges filed in double shooting that left one Tulsa teen dead, another critically injured\nA man charged with killing one teenager and critically wounding a second when firing into their vehicle was arrested after being involved in a crash Monday night, according to police.\nOfficers arrested Marcus DeWayne Boyd, 27, at the scene of a one-vehicle crash on U.S. 169 near 11th Street shortly before midnight, according to a statement from homicide Sgt. Dave Walker.\nAn arrest report states Boyd identified himself to responding officers and told them he was wanted for murder.\nBoyd was booked into the Tulsa Jail on charges of first-degree murder, two counts of shooting with intent to kill and possession of a firearm after a felony conviction.\nA warrant was issued for Boyd’s arrest on Thursday in connection with the slaying of 17-year-old Daniel Carter, who died when a gunman opened fire on an SUV at Virgin Street and Madison Avenue on June 28. A 16-year-old girl who also was in the vehicle was hospitalized in critical condition. Three other occupants escaped injury.\nPolice previously said investigators uncovered a relationship between Boyd and several of the people in the victims’ vehicle, and the relationship is thought to have led to the shooting. Walker said it appeared Boyd and a second man waited at the intersection for Carter’s vehicle to appear.\nBoyd is on probation for unlawful possession of a controlled drug and possession of a firearm after a felony conviction.\nWalker said he believes there are more witnesses who have not been interviewed and that “this is their opportunity to make a difference in this case.”\nAnyone with information may contact Crime Stoppers by phone at 918-596-COPS (2677), online at p3tips.com/918 or through the Tulsa Tips app, which can be downloaded from the Google Play or iTunes stores.\nThe homicide tip line may also be reached at 918-798-8477 or emails sent tohomicide@cityoftulsa.org."}