{"uri": "http://www.newsnet5.com/news/local-news/cleveland-metro/two-children-shot-on-clevelands-west-side", "title": "Two girls shot on Cleveland's west side, police looking for vehicle", "dct": "Tue, 04 Oct 2016 22:46:00 GMT", "id": "306d1a72e6e7d6a8518dded6a3fb2b42", "content": "Autoplay:Tara Molina talks to victims of Cleveland drive-by shootingCONNECTING...XTwo childen shot in drive-by on Cleveland's west side, police looking for vehicle- Tara Molina\nCLEVELAND - Two girls were shot late Tuesday in a drive-by shooting on Cleveland's west side.\nAt about 10:30 p.m. Cleveland police were called to the 7300 block of Dudley Avenue for a report of a shooting.\nA 3-year-old girl was shot in the forehead while sitting a woman's lap on the front porch of a home.\n\"She was sleeping on her shoulder. Baby got hit,\" Sally Davis told News 5.\nA 9-year-old girl, Davis' daughter, was inside the home and was shot in the back.\n\"The bullet missed the spine,\" Davis said.\nBoth children were taken to the hospital. The 3-year-old child in serious condition, and the 9-year-old in critical condition.\nAccording to witnesses cited in the report, the shooting happened after two men approached the porch and admitted to taking a woman's purse. Moments later, four men inside a black four-door car pulled up to the home and fired shots.\nA witness told police the men in the car were \"harassing\" the people on the porch before shots were fired.\nThe men ran away, and the women ran inside the house to help put pressure on the gunshot wound. One of the girl's mothers called 911 and waited for emergency crews to arrive at the home.\nDuring the investigation, police located one of the men who was shot at. He said he knew the men involved in the shooting. The man was later arrested for the initial robbery of the purse, the incident report said.\nAs of Wednesday afternoon, police were looking for a black, newer model Honda Accord and the accused shooters.\n\"I just hope they get caught and pay for this crime that they did. Not one crime, two,\" Sally Davis told News 5."}