{"uri": "http://m.ajc.com/news/news/crime-law/three-people-dead-two-wounded-in-forsyth-county-sh/nm4jg/", "title": "Forsyth County murder-suicide: Man kills wife, her 2 boys, then self", "dct": "Wed, 22 Jul 2015 00:00:00 GMT", "id": "5b3d671d9c7353b5be28bebac2b3226b", "content": "“No, nothing’s going on,” Rebecca Manning told Forsyth County deputies Tuesday night.\nDespite the argument neighbors saw and heard, Manning said nothing had happened between her and her estranged husband, the sheriff’s office said Wednesday. Hours later, she and her two sons were dead and her father critically injured, allegedly because of her husband’s actions, according to authorities.\nMatthew Kyle Fields left the small home where he lived with his wife, her kids and her father for several hours late Tuesday. Fields didn’t answer his cellphone or return a message left by a deputy, Major Rick Doyle said. But shortly after 6 a.m. Wednesday, Fields returned to the home, firing multiple shots, authorities said. When he was done, four people, including Fields, were dead and a 75-year-old man remained hospitalized.\nOn a street lined with neighborhoods, churches and schools near Suwanee, one small home in a culvert became a gruesome shooting scene, leaving investigators with more questions than answers. Could the seemingly senseless act of domestic violence been avoided?\n“It’s up to victims to open up and say something or else no one else can help,” Doyle told The Atlanta Journal-Constitution.\nEarly Wednesday, Fields called his mother in Dawson County to say he’d shot four people and planned to kill himself, though she tried to convince him not to do it, according to the preliminary incident report. Fields’s stepfather called 911 to report the shootings. By the time deputies arrived again at the home, Fields was dead along with his wife’s two young sons, authorities said.\nShortly after 6 a.m. Wednesday, deputies found Manning, 37, on her knees on the front porch screaming. She said she had been shot, but deputies couldn’t see her wound at first because she was shot in the back.\n“He’s dead,” she yelled, according to the preliminary report obtained by The AJC.\nManning was taken to a hospital, but did not survive, authorities said.\nInside the home, Manning’s two sons — Jacob Smith, 9, and Jared Smith, 8 — were dead. Fields, 32, was dead from a self-inflicted gunshot wound and Manning’s father was critically injured, the sheriff’s office said. Jerry Manning remained in critical condition late Wednesday afternoon with multiple gunshot wounds.\nHours later, investigators admittedly had no motive for the shooting spree, Forsyth County Sheriff Duane Piper said during a 10 a.m. news briefing.\n“As the investigation goes on, of course, we hope to find some type of motive,” Piper said. “There’s no reason that any of us are ever going to understand to wipe out an entire family. We have absolutely no clue at this moment what precipitated it.”\nDeputies had previously been called to the home, but Piper declined to discuss specifics of previous calls.\n“We’re familiar with the residence,” Piper said. “We’ve been here before.”\nFields’ criminal history spans through three counties — Forsyth, Dawson and Lumpkin — records showed. But he never served time in prison. In 2003, he was convicted of burglary and sentenced to probation. The following year, he was convicted of forgery in Dawson County, records showed.\nIn Forsyth County, Fields was charged with more than a dozen misdemeanors since 1999, court records showed. But he was no longer on probation and had no outstanding charges, a spokeswoman for Superior Court said.\nThe white, single-story, ranch-style house where the shooting happened is on property that backs up to the Olde Atlanta Club, a golf course community of $500,000 homes along the Chattahoochee River. But the home was assessed at less than $50,000, online records show. Jerry Manning had owned the home for more than 30 years, records showed.\nFor most of the day Wednesday, Old Atlanta Road remained closed in the area of Olde Atlanta Club, and the sheriff’s office urged motorists to avoid the area. After the county coroner’s work was done, the road re-opened, shortly after 5 p.m.\nLate Wednesday afternoon, a neighbor brought flowers and stuffed animals to place outside the home. One family stopped briefly to reflect on the Smith brothers, who both attended Johns Creek Elementary School just down the road from their home.\n“Jacob was one of my brother’s friends,” a child told Channel 2 Action News. “It’s really sad that he’s gone now.”\nBoth boys celebrated birthdays this summer, with Jared turning 8 on July 16.\nWednesday afternoon, members of a church across the street from the Mannings’ home set up a memorial fund to assist the family with funeral costs and medical bills. Those wishing to donate to the Rebecca Manning and Smith family fund can visit any Wells Fargo branch, a church member posted on the sheriff’s office’s Facebook page.\nWednesday’s shooting was the latest in a string of multiple murder-suicides in metro Atlanta this year.\nRelated\nIn early January, Paulding County sheriff’s Cpl. Samuel Driskell, his wife and 12-year-old daughter were killed, allegedly by the deputy’s 21-year-old stepson, who then killed himself.\nLater that month, a Cobb County woman killed her three children, ranging in age from 9 months old to 10 years old, before killing herself, according to investigators.\nAnd in February, five members of a Douglas County family died in a shooting that investigators said was a murder-suicide."}