{"uri": "http://wavy.com/2017/01/01/juvenile-seriously-injuried-in-todds-lane-shooting-in-hampton/", "title": "Juvenile seriously injured in Todds Lane shooting in Hampton", "dct": "Sun, 01 Jan 2017 17:08:00 GMT", "id": "b531bb4345bd9362fd98e56987366de1", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nHAMPTON, Va. (WAVY) — A juvenile was seriously injured in a shooting Sunday evening in Hampton.\nOfficers responded to the scene around Todds Lane and Northampton Drive after dispatchers were alerted at 3:47 p.m.\nPolice say a male juvenile was shot and went to Sentara CarePlex Hospital. His injuries were considered life-threatening.\nDijuan Holland lives in the area and says the crime scene stretched the entire block.\n“It went down the block from the school,” said Holland. “This is a very quiet neighborhood and I’ve been here since I was small and I’ve never seen something like this.”\nThe shooting happened just across the street from Alfred S. Forrest Elementary School.\n“I see little kids come up the street everyday that go to Forrest and back and I see little kids out here play and it’s just too much, too much,” said Holland. “It’s a New Year and we should do something a little better than what we’ve been doing.”\nThere is no other information at this time.\nStay on WAVY.com for developments in this story.\nNewport News police have been asking the community to start turning in…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}