{"uri": "http://www.mlive.com/news/saginaw/index.ssf/2015/07/boy_9_shot_with_shotgun_found.html#incart_river", "title": "'Incapacitating injury' threatens arm of Saginaw boy who found a shotgun in field", "dct": "Fri, 24 Jul 2015 14:15:00 GMT", "id": "b85702e4ec7d045afcc36d158858700f", "content": "SAGINAW, MI -- A 9-year-old boy shot in the arm after he and friends found a loaded shotgun has an injury that is threatening his limb, the Michigan State Police confirms.\nThe shooting happened Friday, July 17, in a vacant lot near Bridgton Place Townhomes on Saginaw's South Side, where a group of children was playing outside, police said.\n\"Kids were looking for snakes and playing,\" Michigan State Police Special Lt. David Kaiser said.\nThey found the loaded gun instead.\nBefore giving an update on the boy's injuries on Thursday, July 23, Kaiser earlier said the boy was \"doing better\" after another 9-year-old holding the gun discharged a round of bird-shot into his bicep.\nThe Saginaw County Prosecutor's Office is reviewing the case, in which there is \"potentially a victim with long-term incapacitating injuries,\" for possible charges related to the incident, Kaiser said.\nThe shotgun and shell casing from the July 17 shooting were sent to a lab for analysis and comparison.\nPolice believe the gun was used in an earlier shooting on Saginaw's West Side, Kaiser said. Authorities think someone then dumped the gun in the lot across town.\nIn the earlier shooting incident, shots were fired on Saginaw's West Side, which led investigators to an apartment complex, Kaiser said. One man ran from the scene, he said. Three people have been arraigned on a shooting charge in connection with the West Side apartment incident, Kaiser said. He did not know if there were shell casings on file from the earlier shooting to compare to the shells from the shotgun found by the boys.\n-- Brad Devereaux is a public safety reporter for MLive/The Saginaw News. Follow him on Twitter, Facebook and Google+"}