{"uri": "http://www.silive.com/northshore/index.ssf/2015/11/teen_who_shot_victim_with_bb_g.html#incart_river_home", "title": "Teen who shot victim with BB gun pleads to robbery attempt", "dct": "Tue, 17 Nov 2015 18:48:00 GMT", "id": "4b1fdc8191a765f04d77f5e469d240a8", "content": "STATEN ISLAND, N.Y. - A Stapleton teen who, authorities said, shot a victim with a BB gun in his community during an early-morning stickup five months ago, has pleaded guilty to attempted robbery.\nDestin Burks, then 17, and an accomplice, Shane DeGroat, 18, also of Stapleton, approached the victim and another man as they sat on a stoop on Sands Street at about 5:10 a.m. on June 17, said authorities.\nBurks pointed what appeared to be a gun at the two men and demanded, \"Give me everything you got,\" according to a criminal complaint.\nDeGroat then punched one man in the face, and that's when the other victim, a 29-year-old man, made a grab for the gun, police said.\nA police source familiar with the case said the man didn't believe the weapon was real. As it turned out, it was a BB gun, a law enforcement source with knowledge of the investigation recently told the Advance.\nBurks and the man struggled, and the gun went off, grazing the top of the victim's head, police allege. As Burks fled, he opened fire, hitting the 29-year-old in the right hip and left inner thigh, police said.\nThe defendants snatched a cell phone and cash from both victims, said the complaint.\nBurks was arrested two days after the incident.\nDeGroat was busted on July 8. His case is pending in Criminal Court.\nBurks pleaded guilty Monday in Criminal Court to attempted second-degree robbery. According to the law enforcement source, one witness couldn't identify him as the shooter.\nIn exchange for his plea, Burks is scheduled to be sentenced Feb. 1 to six months in jail and five years' probation, according to information from Acting District Attorney Daniel Master's office.\nBurks' lawyer could not immediately be reached for comment."}