{"uri": "http://wkrn.com/2016/12/29/teen-arrested-for-murder-of-16-year-old/", "title": "Teen arrested for murder of 16-year-old", "dct": "Thu, 29 Dec 2016 19:39:00 GMT", "id": "3bc6c1e352fbbd8c00fe05eb6ab4f384", "content": "NASHVILLE, Tenn. (WKRN) – A 16-year-old has been arrested for the murder of another teen.\nAccording to Metro police, Kevonta Williams was taken into custody Thursday at his Buchanan Street home.\nHe was booked into juvenile detention on a charge of criminal homicide.\nRELATED: Mom of slain teen: ‘I want them to pay for killing my baby’\nWilliams is accused of shooting 16-year-old Ricky Hambrick on the night of Dec. 19. Hambrick’s body was discovered the next morning on the roadside near the intersection of Mattie Street and East Lane off Buena Vista Pike in Bordeaux.\nPolice say a nearby resident found his body, and other people in the area reportedly heard something that was likely gunfire.\nHambrick was a junior at Whites Creek High School and played on the school’s football team. The teen dreamed of one day working in the criminal justice field.\nNews 2 spoke with Hambrick’s mother, Courtney, about the new development in the case. She said Thursday was the first day they were able to see their son’s body because of the investigation.\nShe also said they were overwhelmed by the news of an arrest, but they are praising God that justice is being served.\nThe motive for the shooting remains under investigation.\nNews 2 is committed to tracking crime across Middle Tennessee. Read the latest at wkrn.com/crimetracker.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}