{"uri": "http://www.mlive.com/saginaw-river/index.ssf/2013/03/victim_from_buena_vista_shooto.html", "title": "Victim from Buena Vista shootout at Better Dayz bar said he thought his life was over", "dct": "Sun, 03 Mar 2013 15:36:00 GMT", "id": "371fc0f52e0da0f37e2f33349f1811fe", "content": "View full size Brad Devereaux | MLive.com\nBUENA VISTA TOWNSHIP, MI — Gunfire erupted in the early morning hours as patrons were visiting Better Dayz Bar and Grill in Buena Vista Township on Sunday, March 3. Officials report four or five people were injured in the incident.\nAround 12:30 a.m. Buena Vista police, Saginaw police, Bridgeport police and the Saginaw County Sheriff's Department were dispatched to Better Dayz on Dixie near Farmer to investigate a report of multiple shots fired.\nEdgar G. Jones, 34, of Saginaw, said he was injured during the incident.\nJones, who said it was his first time visiting the bar, said he was just stepping outside to smoke a cigarette when he realized he was shot.\n“It hurt real bad,” he said. “I was just trying to go out and enjoy myself.”\nJones said he was with his fiancée and “never expected to be shot” as they enjoyed the night out in the town.\n“I got shot in the middle section of my back, right above my kidney,” Jones said.\n“I was in their hospital for about eight or nine hours until they did surgery. I could’ve been killed last night, but it was faith.”\nJones said he feels bad for those who were shot Saturday night, but said most of the violence in Saginaw could be averted if more leaders lived in the city.\n“I feel bad for those other people who got shot and their families. I wish it never happened. I hope those fools don’t shoot nobody else,” he said.\n“With officials living in the neighborhoods I think people would be more hesitant to do things like this.”\nJones said he knew he was shot when he couldn’t control his bowels.\n“Gunshots went off and I felt something,” he said. “At first I thought it was a strain in my back, but then I felt the boo-boo coming out my butt, and I started thinking why am I (expletive) on myself. And then I realized I must be shot.\n“I thought it was over, but I had to calm myself down. My kids went through my mind. I thought about my moms and people were asking should they call her. I told people not to worry her. I just kept thinking, why me?”\nPolice said they collected dozens of spent shell casings that were ejected from at least three weapons at the scene.\nDetectives have identified persons of interest responsible for the shooting but police said they have not received a lot of cooperation in the investigation.\nPolice are asking anyone with information to contact the Buena Vista Police Department Detective Division at 989-753-7790 or the detective tip-line 989-233-2363."}