{"uri": "http://www.wnem.com/story/21447002/four-people-shot-outside-bar-in-buena-vista-township", "title": "Four people shot outside bar in Buena Vista Township", "dct": "Sun, 31 Mar 2013 11:46:00 GMT", "id": "a7c5249f2e27590d65a8797041031caa", "content": "BUENA VISTA TOWNSHIP, MI (WNEM) -\nTwo men remain in the hospital after a shooting outside a bar in Buena Vista Township. Police said the scene was chaotic as at least 100 patrons flooded the parking lot and took cover inside.\nOfficers from Buena Vista, Bridgeport and the Saginaw County Sheriff responded to multiple shots fired at 12:26 a.m. Sunday morning. The shooting happened outside Better Days Bar, located at 4030 Dixie Hwy.\nOne 23-year-old man is in critical condition, a 34-year-old man is stable and two women ages 17-year-old and 25-year-old were treated and released.\nPolice believe a dispute between rival gang members quickly escalated and guns were pulled. Detectives have interviewed several persons caught in the crossfire and throughout the early morning hours and are trying to sort out what caused the conflict.\nDetectives have identified persons of interest responsible for the shooting but are not receiving a whole lot of cooperation. Police collected dozens of spent shell casings that were ejected from at least three weapons.\nPolice are asking anyone with information to contact the Buena Vista Police Department Detective Division at 989-753-7790 or the detective tip-line 989-233-2363.\nCopyright 2013 WNEM (Meredith Corporation). All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}