{"uri": "http://www.trentonian.com/general-news/20161112/2-shootings-rock-trenton-november-12-2016-police-blotter", "title": "2 shootings rock Trenton: November 12, 2016 Police Blotter", "dct": "Sun, 13 Nov 2016 00:32:00 GMT", "id": "ae2b957cf7aa0900b28d379e17bed8a6", "content": "The following information was provided by police, unless otherwise noted:\nTrenton\nTeenager Shot: A 16-year-old boy suffered a gunshot wound to his left knee about 9:15 p.m. Friday at the Kingsbury Towers housing complex. The victim was walking in the area when a suspect got out of a vehicle, pointed a gun and fired several shots. The victim was taken to Capital Health Regional Medical Center for treatment. Trenton Police did not announce any arrests or release a description of the suspect as of Saturday evening but said the incident remains under investigation by the Mercer County Shooting Response Team. Anyone with information is urged to contact the Trenton Police Confidential Tip Line at (609) 989-3663.\nMan Shot: A 28-year-old man was expected to survive after being shot in his chest early Saturday on the 1000 block of South Clinton Avenue. The incident occurred about 1:50 a.m. Police quickly responded to the incident and observed several individuals fleeing from the scene and then found the victim suffering from the gunshot wound. The victim was rushed to Capital Health Regional Medical Center, where he was listed in critical but stable condition after undergoing emergency surgery. The victim told police he was walking to his vehicle when he saw several individuals involved in an altercation and then heard several pops. The Mercer County Shooting Response Team is investigating the incident. Anyone with information is urged to contact the Trenton Police Confidential Tip Line at (609) 989-3663.\nLower Makefield, Pa.\nFraud attempt: On Nov. 9 at 11:01 a.m., police received a report from a resident in the 1000 block of Stony Hill Rd. Police said the resident reported receiving an email to wire money that appeared to be from their boss. Police said that it was determined the email account was hacked. No money was transferred.\nAdvertisement\nFraud attempt, too: Police received a report at 2:48 p.m. from the 300 block of Oxford Valley Road in which they were told that a resident reported receiving a call from someone claiming to be from PECO advising that their electric bill had not been paid since September. This was recognized as a scam and no money was sent.\nBurgled: Police received a report from the 200 block of Elm Ave at 8:30 p.m. that someone forced entry into the residence via a rear door. Nothing reported missing at this time.\nHightstown\nWarrant: Police said that on Nov. 1, Daquan A. Perry, 22, of Camden, was arrested on an active warrant out of Camden City Municipal Court, during the course of a motor vehicle stop on Mercer Street. Perry was transported to headquarters, booked, processed, and later released on his own recognizance with a pending court date.\nDrugs: While patrolling the area of Manlove Avenue on Nov.5, police observed a suspicious vehicle parked with its interior lights on. Police stopped to investigate and while at the driver side window, the officer observed two women in the vehicle. When the officer announced himself, the woman in the driver’s seat, Natalie E. Tuchez, 22, of Hightstown, attempted to conceal CDS in the vehicle. The woman was identified as Janice Alvarez, 23, of Hightstown. The pair were subsequently arrested for possession of less than 50 grams of marijuana, and for possession of drug paraphernalia. Both were transported to headquarters, booked, processed, and released with a pending court date."}