{"uri": "http://www.live5news.com/story/26646404/three-surrender-in-connection-to-colleton-co-gang-related-shooting", "title": "Three surrender in connection to Colleton Co. gang-related shooting", "dct": "Sun, 28 Sep 2014 12:22:00 GMT", "id": "dcbe37e32373c0cf035e5ad61eafa73f", "content": "WALTERBORO, SC (WCSC) -\nInvestigators with the Colleton County Sheriff's Office say three people have surrendered to authorities in connection to an early-morning gang-related shooting on Sunday that left one man dead and six others wounded.\nAccording to CCSO officials, 23-year-old Leviticus Ford, 17-year-old Kadeem Singleton and a male juvenile turned themselves in to the sheriff's office after investigators announced warrants for their arrest on charges of obstruction of justice.\nThe sheriff's office continues to search for 20-year-old Matthew Jones, 24-year-old Khiry Broughton and 20-year-old Zaquann Hampton who are wanted for the same charges.\n\"Investigators are still pursuing leads,\" Stivender said. \"As a result, several persons are being sought for providing false or misleading information, thus hindering investigators' efforts.\"\nInvestigators confirmed the shooting was gang-related based on the information gathered from interviews of various victims and witnesses, and have also determined the shooting was not the result of actions between rival gangs, Stivender said.\nWhile initial reports indicated six men had been shot, CCSO officials were able to discover a seventh victim in the incident and confirmed that one of the other victims gave false information to investigators.\nThe shooting occurred at a home on Sandy Dam Lane in Walterboro at around 6:42 a.m. Sunday. Deputies say they found multiple gunshot victims and spent ammunition inside the home. According to Stivender, the shooters went inside the home and opened fire.\nElijah Mikel, 27, was pronounced dead at the scene of the shooting, according to the Colleton County Coroner's Office. Officials said the victims were all taken to area hospitals. One victim has since been released.\nThe motive of the shooting remains unclear, Stivender said. Anyone with information about the shooting should call the Colleton County Sheriff's Office at (843) 549-2211 or Crime Stoppers at (843) 554-1111.\nCopyright 2014 WCSC. All rights reserved."}