{"uri": "http://www.northwestgeorgianews.com/cherokee_county/two-shot-and-two-stabbed-in-dekalb-county/article_588b8090-a915-11e6-881c-bbf52c818c67.html", "title": "Two shot and two stabbed in Dekalb County", "dct": "Sat, 12 Nov 2016 15:19:00 GMT", "id": "e28d3d95a495cd77174eaf1622c35bf8", "content": "The shooting, according to a press release from Dekalb County Sheriff Jimmy Harris, took place on County Road 9055 in the Kilpatrick community.\nOne of the victims was a Hispanic male in his early 20s and the other was is a juvenile. Both subjects was flown from Marshall Medical South. One was flown to Huntsville hospital and the other to Birmingham hospital, according to the press release.\nWitnesses stated the victims were driving a white van when a small dark color SUV pulled up beside the van and started shooting. This is still an active investigation by the DeKalb County Sheriff’s Office and no names will be released at this time. If anyone has any information about this shooting please call the DeKalb County Sheriff’s Office at (256) 845-3801.\nAlso on the evening of Nov. 11, DeKalb County Sheriff’s Office and Henagar Police Department responded to a residence on Road 1945 in Henagar to a report that a male individual had been stabbed. Investigators responded and discovered Cody Earl Seegar, 29 of Summerville, Ga with a stab wound. Mr. Seegar was pronounced dead at the scene by the Coroner’s Office, the press release stated.\nAccording to witnesses, Mr. Seegar and another male individual, Anthony Tracy Shaw, 48 also of Summerville, Ga, entered the home at Road 1945 in Henagar to confront the homeowner following a family dispute that occurred earlier in the day. Mr. Seegar and Mr. Shaw forcefully entered the home and began to physically assault the homeowner. The homeowner stabbed Mr. Shaw one time and Mr. Seegar one time. Mr. Seegar died from the results of his injuries. Mr. Shaw was transported to Erlanger Medical Center as a result of his wound. The investigation is still ongoing at this time, the press released stated."}