{"uri": "http://www.chicagotribune.com/news/local/breaking/chi-chicagoshootings-20140725,0,6288181.story", "title": "13-year-old boy killed, 6 others shot on West Side", "dct": "Sat, 26 Jul 2014 09:58:00 GMT", "id": "4f0469acdd3f232fdaaf8a6201c6a707", "content": "A 13-year-old boy and six other people were shot in what was believed to be a drive-by shooting Friday evening in the Lawndale neighborhood, police said.\nIt happened just before 6 p.m. outside at the intersection of Lexington Street and California Avenues on the West Side, police said.\nThe 13-year-old was dead on the scene after being shot in the head, Chicago Police Department News Affairs Officer Veejay Zala said.He was later identified as Samuel Walker, of the 3000 block of West Flournoy Street.\nA 21-year-old man was shot in the right leg and taken to Mount Sinai Hospital in serious condition, Zala said.\nAlso injured were three 14-year-old boys, each of them shot in the left leg, whose conditions were stabilized at Mount Sinai; a 15-year-old boy who was shot in the right foot and whose condition was stabilized at Mount Sinai; and a 25-year-old man who suffered a graze wound to the abdomen and who was treated on the scene, Zala said.\nWitnesses at the scene said that some of those injured were young teens who had been playing tag before the shooting, while others may have just left a nearby corner store.\nThe Chicago Fire Department called an Emergency Medical Services Plan 1 for the shooting, sending at least six ambulances to the scene.\nTwo people were taken in serious-to-critical condition to Mount Sinai Hospital, two were taken to an area hospital in fair-to-serious condition, and one was taken to an area hospital in good-to-fair condition, said Chicago Fire Department spokesman Chief Juan Hernandez. One other person declined to be taken to a hospital, Hernandez said.\nOne woman whose mother lives in the neighborhood said her daughter was visiting her grandmother in the neighborhood at the time of the shooting.\nTonyanika Harris' 12-year-old daughter was in the area with about 10 friends, including the boy who was killed. Her daughter was not injured, Harris said.\n\"They were running outside playing tag, and shots rang out,\" she said through tears. \"Then she just ran. There was blood everywhere.\"\nHarris was at work when she got a call first from her nephew and then her daughter. She rushed to the scene from her North Side job as a nurse's assistant.\n\"She was crying, she was emotional,\" said Harris.\n\"It's not safe,\" Harris said.\nHarris, who said her daughter witnessed another killing in their South Deering neighborhood home near 108th Street and Torrence Avenue, was very glad her daughter was not hurt.\nHarris said the boy who was killed was a student at Jensen Elementary Scholastic Academy. Others at the scene said he'd just graduated and was about to start at Manley High School this fall.\n\"He was very energetic. He loved playing tag and playing with girls,\" Harris said of the 13-year-old.\nHarris, who didn't have any information about the other victims, said her mother had been watching her daughter at her home near the shooting.\n\"She (her daughter) has no safe ground. They have safe passage during school but what about summer?\" Harris said. \"I'll just be glad when summer's over.\"\nTwo sisters, ages 12 and 13, said they were near the group before the shooting. When the shots rang out, the older girl saw the victims falling down.\n\"We were trying to help them up,\" said the older one, as she stood on a corner near the scene.\nHer sister, 12, was inside a house but ran out when she heard the shots.\nBoth girls said the victim was \"like a brother\" to them and he was very funny like a \"class clown.\" Both said he was not a \"gangbanger\".\nA woman who lives in the area, Jennifer Willis, said she has 8 children, two of whom normally play in that area. \"I thank God they weren't here,\" Willis said.\nDarryl Stiff said the area has been his neighborhood for most of his 49 years.\n\"Anybody who was out there didn't have a chance\" Stiff said.\nStiff was walking south on California and headed to the same store some of the victims had just left when he stopped because he saw a friend named Bruce.\nHe dove under a car when he heard the shots.\n\"Bruce saved my life,\" Stiff said.\nStiff said the shots came from a brown Cadillac that sped away towards the Eisenhower Expressway and over the bridge, heading north after the attack.\nTribune reporter Liam Ford contributed"}