{"uri": "http://wnep.com/2015/03/27/update-toddler-who-shot-himself-needs-more-surgery/", "title": "Update: Toddler Who Shot Himself Needs More Surgery", "dct": "Fri, 27 Mar 2015 16:15:00 GMT", "id": "2b24252e2fa9dc052a0abb9842565b3e", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nMONTOURSVILLE -- A two-year-old boy in Lycoming County who got his hands on a loaded gun and shot himself is still in the hospital.\nThat toddler has already had one surgery and is expected to have a second.\nIn the meantime, Montoursville police are investigating why a loaded gun was left out in plain sight of a two-year-old boy while his mother and her fiance were in the shower.\nMontoursville police say the loaded handgun was lying on the couple's bed Thursday and the two year old grabbed it, walked downstairs, and accidentally shot himself. The bullet went through his leg and is lodged in his back.\nA Facebook photo from last June shows a boy identified as Zackary with his mother, Mandi Fry, and her fiancé, Cody Asher. Fry is pregnant and the caption reads: \"Watch out boys you better run. It's a girl and Dad's got guns!\"\nMontoursville police say it was one of Asher's guns that little Zackary found on the couple's bed. The handgun was loaded and the boy ended up shooting himself while his mother and Asher were in the shower. Police say the bullet went into Zackary's leg and is lodged in his back. Police believe the couple's other child, an infant girl, was in a crib when this happened.\nThe Montoursville police chief calls the situation \"the poster incident of what not to do.\"\n\"It was a tragedy. It was terrible. It was a hard lesson to be learned of what not to do. How you should handle a handgun and firearms in your house when you have small children,\" said Montoursville Police Chief Jeffrey Gyurina.\nThe gun in this case was a .45 caliber handgun.\n\"It's a large caliber handgun and a small child and he's just lucky to be alive,\" Gyurina said.\nThe chief said Asher and Fry both have gun permits. According to Fry's Facebook page, Asher works as an electrician in the natural gas industry and Fry has a background in nursing. Neighbors say they moved in over the winter. A neighbor who did not want to be identified says she thought of them as the all-American family. Now that neighbor says she has concerns.\n\"Me being a mom, I know I have no guns in my house and if I did I wouldn't have it somewhere loaded where a child could get it.\"\nPolice say Zackary is at Geisinger Medical Center near Danville waiting for a second surgery. Lycoming County Children and Youth are investigating the case, but say the couple still has custody of their infant daughter.\nThe Montoursville police chief says charges against the couple are pending."}