{"uri": "http://wnep.com/2015/03/26/police-toddler-shot-himself-in-montoursville/", "title": "Police: Toddler Shot Himself in Montoursville", "dct": "Thu, 26 Mar 2015 22:54:00 GMT", "id": "775c0f232263ffe8831f58cf78e0a2a7", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nMONTOURSVILLE -- Police in Montoursville say a two-year-old boy shot himself in the leg with a handgun at his mother's home Thursday afternoon.\nIt happened at a house on Broad Street. Investigators said the boy was watching cartoons downstairs while his mother and her fiance were upstairs showering.\nAt some point, police said the child went upstairs into a bedroom, grabbed a loaded .45 caliber handgun and took it downstairs where he then shot himself in the leg.\n\"Cop came in pulled out a little kid. His pants were down. Couldn't tell what was wrong at all, couldn't see blood at all. Knew something was wrong because the kid was completely limp,\" said Joshua Plocinski of Montoursville.\nPeople living in the neighborhood were shocked to hear what happened.\n\"Amazed that something like this could happen so close to me. A two year old, it's sad. Makes me want to cry,\" said one woman who lives nearby.\nNicole Phillips has four children, including a two-year-old boy.\nShe lives just a few houses down from where the shooting happened.\n\"It's very scary that a two year old could get a hold of a gun like that. Gun safety should be taken into consideration a little bit more when you have a small child in your home,\" said Phillips.\nMontoursville police said the investigation into what happened continues. There is a possibility the couple may be facing criminal charges.\n\"It's not unlike for the adults to be upstairs because when you're in your own home, you think it's safe enough to leave them while you run upstairs or whatever, but when you have a gun in the house, you have to keep it locked and certainly, not loaded,\" said Phillips.\nPolice said the boy who shot himself is expected to survive. They also said an infant was also living in the home where the shooting occurred."}