{"uri": "http://www.lansingstatejournal.com/story/news/local/2014/09/04/lansing-teen-stand-trial-shooting-near-sexton/15099107/", "title": "Lansing teen to stand trial for Sexton shooting", "dct": "Thu, 04 Sep 2014 00:00:00 GMT", "id": "90c4fd73ec49ee651c8250bba057d819", "content": "LANSING – A Lansing teenager has been ordered to stand trial on four felony charges stemming from a shootout that left four other teens injured near Sexton High School last fall.\nTimothy Minor III, 17, fired shots from a car during a gunfight that erupted in a residential neighborhood about two blocks from the school, according to testimony Thursday in 54A District Court.\nJudge Charles Filice ordered Minor to stand trial in Ingham County Circuit Court on one count of assault with intent to murder, a maximum life felony, and three weapons charges.\nThree Sexton students and an Everett High School student suffered non-life-threatening gunshot wounds during the Sept. 17 shootout.\nCourt records show that Minor and co-defendant William Johnson were supposed to be at a county youth center when the shooting happened. Two weeks earlier, they escaped from state Department of Human Services custody while being transported between facilities.\nJohnson, 16, pleaded guilty in juvenile court in May to assault with intent to do great bodily harm and was sentenced as an adult to three to 10 years in prison.\nOn Thursday, he testified both he and Minor fired rounds from a car at the scene of a fight near Ottawa and Spencer streets on the afternoon of Sept. 17, apparently in retaliation for a previous shooting incident at his home.\nJohnson appeared reluctant to testify, covering his face and mouth with his hands several times and making barely audible responses, prompting warnings from Filice.\nHe said Minor, who was in the front passenger seat, fired the first shot from the open passenger-side window with a .380-caliber handgun. Johnson said he fired a .40-caliber handgun through the same window from the driver's seat.\nJohnson said he fired 15 or more rounds but didn't know how many shots were fired by Minor because other people at the scene also were firing shots.\nOne of the shooting victims, a teenage girl, testified that two people were fighting on \"the island\" at Ottawa and Spencer streets before the gunfire erupted and \"everybody evaporated.\"\nBesides the assault charge, Minor faced charges of felony firearm possession and carrying a concealed weapon. On Thursday, Filice granted a request by prosecutors to add a count of intentionally discharging a firearm from a vehicle."}