{"uri": "http://www.startribune.com/several-people-were-shot-near-black-lives-matter-protest-site/353121881/", "title": "Five people were shot near Black Lives Matter protest site", "dct": "Tue, 24 Nov 2015 00:00:00 GMT", "id": "9a5621e70ad8e274d810fd98987dd41b", "content": "Five protesters were shot late Monday night near the Black Lives Matter encampment at the Fourth Precinct police station in north Minneapolis, according to police.\nThose who were shot sustained non-life-threatening injuries, said police spokesman John Elder in a statement.\nMiski Noor, a media contact for Black Lives Matter, said “a group of white supremacists showed up at the protest, as they have done most nights.”\nOne of the three men wore a mask, said Dana Jaehnert, who had been at the protest site since early evening.\nWhen about a dozen protesters attempted to herd the group away from the area, Noor said, they “opened fire on about six protesters,” hitting five of them. Jaehnert said she heard four gunshots.\nThe shootings occurred at 10:45 p.m. on Morgan Avenue N. about a block north of the precinct station.\nThe attackers fled. No arrests had been made by midnight Monday. Police said via their Twitter feed that they are searching for three white male suspects.\nThe gunshot victims were taken to North Memorial Medical Center and Hennepin County Medical Center (HCMC), deputy police chief Medaria Arradondo said at the scene.\nA person at the scene said one of the victims had been shot in the stomach, and was undergoing surgery overnight at HCMC.\nJie Wronski-Riley said angry protesters moved the men away from the encampment at the police station. Wronski-Riley heard what sounded like firecrackers and thought, “surely they’re not shooting human beings.” Two young black men on either side of him were hit, one in the back and leg, the other in the arm.\nAt least two of the three men who had been taunting protesters were firing guns, said Wronski-Riley, who described the incident as “really chaotic, really fast.”\n“I am obviously appalled that white supremacists would open fire on nonviolent, peaceful protesters,” said Nekima Levy-Pounds, president of the Minneapolis chapter of the NAACP, who returned to the site after the shootings.\nThe protesters, angry over the fatal police shooting of 24-year-old Jamar Clark on Nov. 15, have maintained a presence outside the police station ever since.\nEddie Sutton, Jamar’s brother, issued this statement early Tuesday morning in response to the shootings:\n“Thank you to the community for the incredible support you have shown for our family in this difficult time. We appreciate Black Lives Matter for holding it down and keeping the protests peaceful. But in light of tonight’s shootings, the family feels out of imminent concern for the safety of the occupiers, we must get the occupation of the 4th precinct ended and onto the next step.”\nMARY LYNN SMITH and CLAUDE PECK"}