{"uri": "http://www.whky.com/archive/item/13705-statesville-man-charged-in-fatal-accidental-shooting#.WCYIpHeZNAY", "title": "Statesville Man Charged In Fatal Accidental Shooting", "dct": "Fri, 11 Nov 2016 05:42:00 GMT", "id": "abc8ae9ffc30bc6d353ed2ff8591f2b5", "content": "Jason Rashon Tenor Courtesy of Iredell County Sheriff's Office\n21-year-old Jason Rashon Tenor of Treeline Drive in Statesville was arrested by Iredell County Sheriff's Officers. He's charged with involuntary manslaughter, possession of marijuana and possession of drug paraphernalia.\nTenor is charged in connection with a deadly shooting Monday night (November 7). On that date, Deputies and Detectives responded to 132 Treeline Drive in Statesville to a reported shooting. The initial calls came in at approximately 9:45pm. The callers reported a woman had been shot inside a residence. One of the 911 callers was the victim’s boyfriend who told Telecommunications that he had accidentally shot his girlfriend. Deputies arrived on scene along with Emergency Medical Personnel and found the female victim in the bedroom floor with a gunshot wound. Deputies and First Responders attempted CPR on the victim, but were unsuccessful. The victim, Cortney Smith, was pronounced dead at the scene by EMS.\nDetectives interviewed Jason Rashon Tenor, the boyfriend of the victim, who cooperated with Investigators and gave a full statement. According to a news release from the Iredell County Sheriff's Office, in his statement, Tenor admitted that he was handling a firearm that had been left there a few days prior by a third party. He admitted that he was handling the gun in a reckless fashion but indicated that he believed the gun was unloaded because the magazine was taken out. In addition, Tenor admitted that Marijuana and Paraphernalia found in the bedroom belonged to him.\nTenor's bond was set at $15,000.00 Unsecured. He made his first court appearance on Wednesday (November 9). His next appearance is scheduled for December 5 in District Court."}