{"uri": "http://www.chron.com/news/houston-texas/article/One-dead-two-wounded-after-midtown-club-brawl-10828323.php", "title": "Aspiring rapper dead, three others wounded after midtown club brawl turns to gunfire", "dct": "Sat, 31 Dec 2016 00:00:00 GMT", "id": "af713194f74baaa02e48dcf2fa24f24a", "content": "An aspiring rapper is dead and three men are wounded after an overnight club brawl ended in gunshots, according to authorities.\nThe fighting started inside Club Life in the 3700 block of Fannin, then spilled out onto the street.\nFisticuffs turned to gunfire and multiple people started shooting, according to LaTonya Bailey, an investigator with Houston Police Department.\nMusician Kionn Lamothe, 25, was killed in the exchange and three others - Marvin Ray Hart, Herbert Lee Briscoe and Tristian Mouton - ended up in the hospital, according to HPD spokesman Victor Senties.\nAround 30 shell casings littered the ground after the shoot-out, Bailey told reporters at the scene.\nIt's unclear if the men who were shot were part of the altercation, but the victims did not all know each other.\nGiven the number of rounds fired, Bailey said there could be other injuries, although none were immediately reported.\nAs of now, there are no known suspects.\nAs word of the shooting began circulating on social media, Lamothe's friends started mourning his loss.\n\"So full of talent, so full of LIFE,\" one Facebook friend wrote in a post about the aspiring rapper. \"Everybody that heard your music knew you were going places but never did we imagine that you would be going to that 'magic place' up above so soon.\"\nMonths before his death, Lamothe posted about single release parties to celebrate his track \"I Go Away.\"\nDerrick Harper, who'd known the budding musician since they went to Dekaney High School together, described him as a \"down-to-earth, solid dude\" who was \"really spreading positivity\" through Spring and the northern side of Houston.\n\"Even though he is originally from Brooklyn, Houstonians accepted him as if he was one of our own,\" Harper said.\nThe last time the two friends hung out was about two weeks before Lamothe's death.\n\"We just talked about the upcoming success. He put himself in a situation to make it in the music world,\" Harper said.\n\"His time was coming. It's just sad to not witness all of the success he had in store for himself to unfold.\""}