{"uri": "http://www.krem.com/story/news/local/kootenai-county/2014/12/30/deadly-shooting-kills-hayden-walmart-shopper/21058855/", "title": "Toddler fatally shot Blackfoot, ID mom at Hayden Walmart", "dct": "Mon, 05 Jan 2015 00:00:00 GMT", "id": "816c6639b98df97e7524a533f332e2f2", "content": "HAYDEN, Idaho—A toddler shot and killed a Walmart shopper Tuesday morning in what deputies described as an \"accident.\"\nThe woman was later identified by authorities said Veronica Rutledge from Blackfoot, Idaho. The father-in-law of Walmart shooting victim spoke with KREM 2 News Tuesday night. He called the shooting \"tragic.\" He added the family \"lost a beautiful, loving mother.\"\nWalmart employees evacuated the Hayden store around 10:20 a.m. following the gunshot.\nDeputies with the Kootenai County Sheriff's Office responded to the scene and found a 29-year-old woman dead inside the store.\nRutledge was shopping with four kids, when her two-year-old son reached into her purse, accessed her concealed 9mm Smith & Wesson M&P Shield semi-automatic handgun and accidentally discharged the weapon, according deputies. Authorities said the toddler was seated in the shopping cart when the gun was discharged. The woman and children were in the back of the store near the electronics area when the deadly shooting happened.\nThe bullet struck Mrs. Rutledge in the head, killing her instantly.\nAuthorities interviewed the kids, who were all younger than eleven-years-old, who witnessed the shooting.\nDeputies said the Rutledge was in town for holidays and is not from the area. Authorities said the victim did have a concealed weapon. Authorities said Rutledge had a concealed weapon permit out of Spokane.\nIdaho recognizes concealed-weapons permits from other states, but people who decide to keep their guns hidden must carry the out-of-state license with them at all times, according to the Idaho Attorney General's Office website. Unless a private business prohibits weapons on its property, anyone with a concealed-weapons permit can carry a firearm.\nAbout 7% of adults in Idaho — more than 85,500 people — had concealed-weapons permits at the end of 2012, according to data from the Crime Prevention Research Center, a Swarthmore, Pa.-based gun-advocacy group. That ranks Idaho in the top third among states.\nVideo surveillance in the store, along with eye witness testimony helped deputies determine that this was an accident. Walmart issued this statement Tuesday afternoon:\n\"A very sad incident occurred at our store today involving the death of a female customer. We are fully cooperating with the Kootenai County Sheriff's deputies as they investigate this matter.\"\nWalmart plans to reopen their Hayden location at 6:00 a.m. Wednesday, December 31st."}