{"uri": "http://www.batesfuneralchapel.com/obituaries/Isaac-Hoven/#!/Obituary", "title": "Obituary for Isaac M Hoven", "dct": "NODATE", "id": "599f3fca0daf7278d1387025832b5052", "content": "Isaac M. Hoven, 13, died Saturday evening, March 12, 2016, at his home. He was born December 11, 2002, at Oskaloosa, the son of Shane and Heather Hoven. He was a longtime member of the Gateway Church of the Nazarene, and active in the Middle School Youth Group at the church, and worked very well with younger kids at the church. Isaac went through the Bible Quizzers Program at the church and won several awards with the program. Isaac was in the 7th Grade at the Oskaloosa Middle School, and active in Cross Country; Basketball, and Drama. He was a very energetic youngster, and could make anyone laugh quite quickly, and loved the out of doors. He enjoyed hunting and fishing, and being with his dog, Nala, and cat, Sassy.\nHis family includes his parents, Shane and Heather Hoven, Sr. of rural Oskaloosa; a brother: Shane Michael Hoven, Jr., at home; grandparents: Clare and Marla Hoven of rural Albia; his maternal grandparents: James Pangburn in Indiana; Valerie Pangburn in Florida; Maternal Great grandma, JoAnn Crawford in California; aunts: Heidi (Mark) Watt of Creswell, Oregon, Tina (Jonathon) Main of Oskaloosa, and Catherine Jones in Florida; uncles: Travis (Samantha) Hoven of Grinnell, and Ben (Shawna) Hoven of Moravia; Numerous cousins: Chris, Jonny, Alax, and Justyn Watt; Gage and Grant Main; Joe Hoven and Richard Hoven; and numerous great uncles, and great aunts.\nIsaac was preceded in death by both sides of Paternal Great grandparents, an uncle, Anthony Pangburn and a great uncle George Hoven.\nFuneral services will be held Friday, March 18, 2016 at 1:30 p.m. in the Gateway Church of the Nazarene with the Rev. Bill Hines officiating. Burial will be in Henness Cemetery southwest of Oskaloosa. Open visitation will begin at the Gateway Church of the Nazarene on Thursday after 11 a.m., and the family will be present at the church Thursday from 3:30 p.m. – 7:30 p.m. to greet friends and relatives. Memorials may be made to the Isaac Hoven Memorial Fund. The Bates Funeral Chapel, Oskaloosa, is entrusted with the care of Isaac, and helping his family during this very difficult time.\nAs one final caring gift, Isaac gave heart valves as a most generous and thoughtful donation through the Iowa Donor Network.\nTo send flowers or a memorial gift to the family of Isaac M Hoven please visit our Sympathy Store."}