{"uri": "http://tbo.com/news/crime/police-man-had-gun-at-tampa-park-where-shooting-occurred-20140421/", "title": "Police: Man had gun at Tampa park where shooting occurred", "dct": "Mon, 21 Apr 2014 00:00:00 GMT", "id": "c177f00206e0611d2c3f1b2edec76905", "content": "Location of shooting\nTAMPA — Al Barnes Park is nestled in a quiet neighborhood in East Tampa and is known as a popular place for kids’ birthday parties. Neighbors walk and jog on a paved path beneath majestic oaks. Typically, the only noise that comes out of the nine-block city park happens once a week when city lawn mowers visit, keeping the grounds neatly clipped and trimmed.\nSunday, the serenity of an Easter afternoon was shattered by gunfire that left two dead and two wounded. Tampa police Monday continued their search for two men who shot into a crowd. One man was charged with being a felon in possession of a firearm, but police had not charged him in connection with the shooting.\nThe shots were fired at the park, 2902 N. 32nd St., just after 5 p.m. Sunday. Nearby, nearly 100 children were participating in an Easter egg hunt hosted by Monte Irvin, who coaches and mentors youth in East Tampa.\n“It was Easter; people were in their church clothes,’’ Irvin said Monday. “You’re supposed to be happy, listening to gospel and the word of the church, and they just be killing. Why you got to come up here where all these kids are with a gun on you?”\nIrvin had reserved the pavilion at the park for neighborhood children to have an Easter egg hunt.\n“I had 3,000 eggs, so everyone could be taken care of,” he said. He invited lots of people, including kids on a ball team he coaches, but as the day went on, more and more people showed up, he said. In all, maybe 85 children participated, with that many adults, he estimated.\nLater in the day, another group showed up and gathered near the softball field across the park from the pavilion, he said. That group had no children with them, he said.\n“They probably were just hanging around,” said Irvin, who performs as local rapper Mowhawk Munchie. “They were far away from what we had going on. One dude kept running around; he was initiating some kind of problem over there. It just seemed like a fight broke out and I seen a guy pull out a gun and start shooting.”\nHe was concerned about the children, but he ended up running to a man who had been shot in the head, wrapping his own shirt around the wound.\n“I been crying all morning,” he said Monday afternoon. “I can’t sleep. I been watching over my kids. Thank god my kids are OK. These are innocent people. It’s just crazy.”\nPolice made contact with Ronald Milliron III, 22, at the park on Sunday. Officers said that during a search, they found a pistol in his jacket pocket along with some marijuana. He was charged with 16 counts, including being a felon in possession of a firearm, tampering with evidence and carrying a concealed firearm.\nHe remained in the Hillsborough County jail. Bail was set at $96,250.\nPolice did not immediately charge him in the shooting and have not called him a suspect.\n“This is a very dynamic investigation,” said police spokeswoman Janelle McGregor, “and right now we are working to determine what his role was, if any, in the shooting.”\nFlorida Department of Corrections records show Milliron served a year in prison for a 2012 burglary, grand theft and possession of marijuana and was released in August.\nThe wounded victims, identified as Danielle Allen, 21, and Ransom Flowers, 27, both of Tampa, were not cooperating with investigators, police said. Their conditions have stabilized, police said.\nTwo young men pronounced dead at the scene Sunday were Nico Charles Crawford, 22, and Zelmound Culpepper, 17, both of Tampa.\nThe shooting occurred after a small group of people began to argue, police said. The argument escalated into a physical fight and one person took out a gun and began firing it at a group, police said. A second person then took out a gun and also began to fire, police said.\nThey were not part of the Irvin’s group, which had set up bounce houses for children.\nThe park, bordered by 21st Avenue to the north and 18th Avenue to the south, typically is quiet, neighbors say. It has a few basketball, tennis and racquetball courts and a softball field. A playground for children is in the northeast corner, along 29th Street.\nAlton Gaines lives nearby and jogs and walks nearly every day along the winding path that meanders beneath the huge oaks.\nThe park typically is a serene haven from drug activity and thug behavior, he said.\n“This is a nice neighborhood,” he said as he took his daily walk Monday morning. “There’s never any kinds of trouble.”\nHe was in the park Sunday before the shooting and said there were children enjoying the playground and bounce houses.\n“It’s a clean environment,” he said, “I can’t say nothing bad ever happens here, but I’ll still come here to do my jogging.”\nAnne Gordon’s house faces the park across 32nd Street. She’s lived there for almost four decades and described the place as quiet, just like her neighborhood. It’s been that way for as long as she could remember.\n“I’ve been here 37 years and it’s always been a safe park,” she said. During the week, few people gather there, she said.\n“On the weekends, they have children’s parties,” Gordon said.\nHer observations were echoed by neighbor Attie Parker, who said other than the bustle on the weekends - usually people holding cookouts and birthday parties – the park is serene. She has lived in her home for 20 years.\n“Usually,” she said, “it’s pretty peaceful.”\nPolice reports confirm that. Over the past year, there are five pages of calls for service at or near the park, but most are for minor issues like parking violations and building checks, disturbances and park patrols. Occasionally, there are calls for drug activity and fights, but not often.\nOn Monday, detectives followed up on several leads, saying the community was cooperating to help identify the shooters.\nAccording to Hillsborough County jail records, Crawford has 13 arrests dating back to December 2009, but only one for a crime of violence. That was in May 2013 when he was arrested for aggravated battery with a deadly weapon, a brick, and that charge was dismissed, records show. Most of the other charges were on trespassing, possession of marijuana and obstruction charges, records show.\nFlowers has a criminal record dating to 2002, including arrests on charges of aggravated stalking, possession of marijuana, robbery, grand theft and battery on a police officer.\nAnyone who has information is asked to contact Crime Stoppers immediately. Anonymous tips that lead to an arrest are eligible for up to $3,000 in cash.\nIrvin, who hosted the Easter egg hunt at the park Sunday, said the incident has rattled him. He said he had a few youthful years where he ran afoul of the law, but not for nearly a decade. Now, he’s dedicated to raising — and protecting — his children and helping neighborhood kids rise above that bad behavior.\n“I grew up in foster homes and I’m trying to be a role model for a lot of people,” he said. “I coach baseball and football and try to give back to the community. I’m trying to keep these kids from going down the wrong path.”\nkmorelli@tampatrib.com\n(813) 259-7760"}