{"uri": "http://www.thepilot.com/news/arrests-made-in-fatal-drive-by-shooting-in-southern-pines/article_c0f4575c-9ee2-11e6-9379-4ba01c70fef0.html", "title": "Arrests Made in Fatal Drive-By Shooting in Southern Pines", "dct": "Sun, 30 Oct 2016 00:00:00 GMT", "id": "4248e60b73992af6bd4ecb412f030b5f", "content": "Two suspects have been arrested in connection with a drive-by shooting that killed a teen and critically injured a 3-year-old in Southern Pines.\nMontice Tyree McManus, 16, of Southern Pines is charged with murder and assault with a deadly weapon inflicting serious injury. He was placed in the Guilford County Jail with no bond.\nMalik Rashad Crawford, 20, of Aberdeen is charged with accessory after the fact of murder. He was placed in the Moore County Detention Center under a $300,000 secured bond.\nBoth suspects are scheduled to appear in court on Nov. 22.\nThe arrests stem from a shooting that occurred at about 4 p.m. Friday on West Michigan Avenue. Jalinda Campbell, a 12-year-old student at Southern Middle School in Aberdeen, died as a result of her gunshot injuries. Her nephew Kyleigh Graham, 3, received surgery Saturday at Duke University Medical Center and is in stable condition, according to authorities.\nThe two young victims were shot on the porch of their duplex apartment, according to a neighbor who witnessed the incident. Police say the shooter was aiming for a separate individual who has not been identified.\nCrawford was a standout basketball player at Union Pines High School. He led the team in scoring during his senior year, averaging 15 points per game, and was a first team all-conference selection.\nThe investigation was described as \"active and ongoing\" in a news release on Sunday. People with information about the shooting are being asked to call the police department at (910) 692-7031; the department’s Investigation Division at (910) 693-1481 or the Crime Tip Line at (910) 693-4110.\nAll information will remain confidential and can be provided anonymously, the release said.\nThis story is developing.\n+7 +5"}