{"uri": "http://kdlg.org/post/kokhanok-boy-killed-accidental-shooting", "title": "Kokhanok boy killed in accidental shooting", "dct": "Tue, 26 Jan 2016 00:00:00 GMT", "id": "70b08af9e4a6d81e9d6b94932bf98f97", "content": "Kadin T. Mann was shot accidentally by another boy Saturday, and died Sunday morning in an Anchorage hospital.\nKadin Tige Mann, age 5, died Sunday after he was accidentally shot Saturday in the village of Kokhanok. State troopers say an 11-year-old boy got a hold of a .22 caliber rifle while the two were playing video games, and fired the one shot that hit Mann. The identity of the boy and his relation to Mann were not released publicly.\nThe boy found the unsecured rifle in the home. Troopers had not finished the investigation by Tuesday.\nThe tragedy was a blow to the tight-knit community of about 160, which sits on the south shore of Iliamna Lake. A GoFundMe account to help his mother Tina Mann with funeral arrangements quickly raised more than its goal of $5,500.\n“He was the sweetest boy you could ever meet,” said Terry Mann of his nephew. “He loved life, loved his family, loved to play and have fun.”\nKadin Mann's father Glenn Ney doesn’t live in Kokhanok, and learned of the death of his son by text message. Early in the week, as he was making his way to the village, he said he was frustrated by the lack of information from the state troopers. “I have to know what really went on,” he said.\n“His mother was shaken badly by this tragedy,” Ney added. He said he was glad Tina Mann had gotten Kadin quickly to Anchorage for medical care, and was there in the hospital with him through the night. Kadin died Sunday morning. “I will always admire her for being a wonderful mother to our son,” he said.\nLast month, William Anderson, the four-year-old son of a state trooper in Bethel, was killed after he accidentally shot himself with a handgun he found in the living room. According to the gun control advocacy group Everytown for Gun Safety, a total of three children in Alaska were killed last year by accidental shootings. Nationwide, there were 265 known accidental shootings by children in 2015, 83 of which resulted in the death of the shooter or another."}