{"uri": "http://www.ajc.com/news/news/crime-law/at-least-1-person-killed-3-injured-in-shooting/nr8yz/", "title": "Teen killed in DeKalb shooting two weeks shy of her 16th birthday", "dct": "Wed, 03 Aug 2016 00:00:00 GMT", "id": "ad7788c4c6cb155600a8c56199334a2f", "content": "Keaira Palmer, like many teenagers, had much to look forward to – including a Sweet 16.\n“My heart is so heavy right now. I’m struggling to understand why my 15-year-old niece was shot and killed in a drive-by while at a convenience store,” Palmer’s aunt, Charlene Riley, wrote Wednesday on a GoFundMe page.\nPalmer would have turned 16 on Aug. 18, but she was killed during what police believe might have been a gang-related shootout Wednesday morning outside a convenience store along Glenwood Road in DeKalb County. Three others also were shot.\n“She was just supposed to be going to the store to get a Sprite, a bag of hot chips and a Slim Jim,” Palmer’s mother, Lawanda Riley, told Channel 2 Action News.\n“According to reports, the victims had gone to a convenience store,” DeKalb police spokeswoman Shiera Campbell said. “Upon exiting and while walking to a nearby apartment complex, they were fired upon by unknown persons, striking all four victims.”\nRiley said her daughter was an innocent bystander in the shooting, which she heard from her living room.\n“And my mind was saying: ‘I hope my baby ain’t outside,’” she told the news station.\nPalmer was rushed to the hospital along with two others. A 25-year-old man remains in critical condition and a 19-year-old man who sustained minor injuries was treated and released from the hospital, police said.\nAn 18-year-old man was also treated on the scene for a graze wound.\nPalmer died at the hospital.\n“And I felt her last breath. I felt her take her last breath. I did,” Riley told Channel 2. “It was like a wind just hit me and it just went straight up.”\nRiley went from planning a birthday party to planning a funeral.\nNo arrests have been made, and the investigation is ongoing, Campbell said. The names of the other victims will be released when the families are notified.\nPalmer’s family started the GoFundMe page to cover funeral costs. More than $1,000 had been raised as of 3:40 p.m."}