{"uri": "http://bnonews.com/news/index.php/news/id4209", "title": "5 dead in Appling, Georgia mass shooting, Wayne Hawes sought", "dct": "Sat, 23 Apr 2016 03:31:00 GMT", "id": "c3b33a30e50790f99b4f36110bf1b608", "content": "Five people have been killed in Georgia after two connected shootings on Johnson Drive and Rosemont Road in Appling, officials in Columbia County confirm. The suspected gunman, identified as Wayne Anthony Hawes, is still at large. (more)\nLIVE UPDATES: Twitter, Facebook\nThe shootings happened on early Friday evening with one shooting in the 3000 block of Johnson Drive and a second shooting happening just a short distance away on Rosemont Road near the intersection with Washington Road. Both are believed to be linked.\n\"We're working a multiple shooting. We have 5 victims, and the sheriff's department is looking for the shooter. And that's all I can tell you right now because we haven't finished processing the crime scene,\" Columbia County Coroner Vernon Collins told BNO News.\nFour victims died at the scenes of the shootings and a fifth died while being rushed to Augusta University Medical Center.\nDeputies identified the suspect as 50-year-old Wayne Anthony Hawes, but he remained at large by 11 p.m. ET as a manhunt got underway. Video from the area showed police patrolling the area, though the incident was not being treated as an active shooter situation.\nThere was no immediate word on the identities of the victims, and information about what may have led to the killings was not yet known, but deputies said Hawes knew the victims. The scenes are about 15 miles northwest of Augusta.\nThis is a breaking news alert. Please check back or follow @BNONews on Twitter as details become available. If you want to receive breaking news alerts by email, click here to sign up. You can also like BNO News on Facebook by clicking here.\nFive people confirmed dead in Columbia county shooting. pic.twitter.com/7Mj2bcDPwl\n— Margaret-Ann Carter (@MargaretAnnWJBF) April 23, 2016\nDeputies on scene along Johnson Drive in Appling, Georgia after reports of shots fired. Story is developing pic.twitter.com/KKWYrfLhhP\n— Ben Billmyer (@BenWRDW) April 23, 2016"}