{"uri": "http://www.adirondackdailyenterprise.com/page/content.detail/id/556487/Police--Woman-hurt-in-accidental-shooting-in-Lake-Placid--update-.html?nav=5047", "title": "Police: Woman hurt in accidental shooting in Lake Placid (update)", "dct": "Tue, 22 Sep 2015 00:00:00 GMT", "id": "41fa1808dc06a55e95d7c1f7f9da089b", "content": "LAKE PLACID – A woman suffered a gunshot wound this morning in what village police believe is an accident.\nPolice Chief William Moore said police got a 911 call at 9:01 a.m. for a gunshot wound in one of the apartments at The Commons Way off Mill Pond Drive. Moore said a couple was home with their children when a handgun went off. The bullet apparently hit the 24-year-old woman in the buttocks area and came out of her abdomen.\nMoore said he can’t say with any degree of certainty at this point who fired the gun, but police believe it was an accident. Police would not identify any of the family members.\nThe woman was taken by ambulance to Adirondack Medical Center in Saranac Lake. Moore said she was in stable condition as of noon, which was the last he had heard.\nAt The Commons Way outside the apartments, police interviewed a man holding a baby and escorted a pre-school-looking boy into a police car. Moore said police have located the gun and were still looking for the bullet and its spent shell casing as they process the scene for forensic evidence.\n“The only (criminal) charges we may be looking at are weapons-related charges,” Moore said.\nMayor Craig Randall said police told him that the couple’s 3-year-old child was believed to have fired the weapon.\n“The thought was that it was a 3-year-old child involved,” Randall said. “He may have picked it up and certainly not realizing he had a loaded weapon, may out of curiosity pulled the trigger.\n“It’s a very, very sad situation if in fact the ultimate investigation bears out those early thoughts.”\nMoore said he would not comment yet on whether a child fired the weapon “without a more thorough investigation.” But he did say the shooting appeared to be the result of the “careless storage of the weapon.”\nLandlord Fred Mills, who owns The Commons apartments, said he also heard that it was the toddler who accidentally shot his mother.\n“I think it’s just horrible, devastating,” Mills said. “You hear about this in the paper all the time, but it’s not something you expect to happen.”\nA neighbor in the apartment complex reacted with shock, saying he never expected a shooting to occur here.\n“I’ve been living here 30 years, and there has never been any kind of violence here,” Joe Liberatorie said. “It’s a perfectly safe place to live.”"}