{"uri": "http://www.sacbee.com/news/local/crime/article117239943.html", "title": "Suspect in Carmichael officer-involved shooting identified as West Sacramento teen", "dct": "Sat, 26 Nov 2016 11:18:00 GMT", "id": "02161af9ae2dccf16c49f7f1328909c2", "content": "The Sacramento County Coroner’s Office identified the suspect who repeatedly stabbed himself in the neck before being shot at by a Sacramento County sheriff’s deputy as 17-year-old Logan Ron Augustine of West Sacramento.\nThe incident happened about 1:50 p.m. on Thanksgiving Day at a Carmichael 7-Eleven near Marconi and Walnut avenues. The Sacramento County Sheriff’s Department received a 911 call from a person believed to be Augustine, said Sgt. Tony Turnbull, a department spokesman.\nTurnbull said Augustine was belligerent and talked about his hatred for police.\n“The suspect stated he wanted to talk to cops, but that they should dispatch a really big cop,” according to a department news release.\nWhen deputies arrived, officers saw Augustine run down an aisle. He told deputies he had a gun and was seen with a knife in his hand, Turnbull said Thursday.\nAugustine began to stab himself in the neck, hitting an artery and causing him to bleed profusely, Turnbull said. Deputies fired a rubber bullet in an attempt to disable Augustine, but were unsuccessful.\nAugustine remained armed and became more agitated. Turnbull said an officer at the scene, fearing for his life, fired a single bullet toward Augustine, though it was unclear whether it hit the teen.\nAugustine was bleeding heavily and fell to the ground, where deputies were able to take him into custody and begin providing medical aid, Turnbull said. He was later pronounced dead at the scene.\nBoth a knife and a handgun were found at the scene of the incident, which is being investigated as an officer-involved shooting, authorities said. The deputy who fired his weapon is a 27-year veteran with the department, Turnbull said.\nNashelly Chavez: 916-321-1188, @nashellytweets"}