{"uri": "http://fox6now.com/2015/05/07/charged-24-year-old-man-in-connection-with-shooting-that-left-two-members-of-the-same-family-dead/", "title": "Charged: 24-year-old man in connection with shooting that left two members of the same family dead", "dct": "Thu, 07 May 2015 21:02:00 GMT", "id": "3dcc6f5627fc2db288d6c2e3a346fe15", "content": "MILWAUKEE (WITI) — A 24-year-old Milwaukee man faces several charges in connection with a shooting that left two people from the same family dead. It happened last Friday, May 1st near 37th and Nash following a fight in the street.\nDevon Loggins faces the following charges:\nfirst degree reckless homicide (two counts)\nfirst degree recklessly endangering safety (three counts)\nfelon in possession of a firearm\nHe is accused in the deaths of Damario Jones and Montrell Burdine.\nPolice were dispatched to the area of 37th and Nash for a report of shots fired on the morning of May 1st. Upon arrival, an officer observed Jones lying on the grass — unresponsive. Life-saving attempts were unsuccessful, and Jones was pronounced dead at the scene.\nOfficers began to search the area for evidence — and they came upon Burdine, lying in the street, conscious and alert. Officials with the Milwaukee Fire Department began to treat him, and observed that he had lost a significant amount of blood. Police say Burdine had been shot in the thigh, and he eventually lost consciousness and was pronounced dead.\nAutopsies were performed on Jones and Burdine. The Milwaukee County Medical Examiner’s Office says Jones was shot three times. Burdine was shot once in his right thigh.\nA criminal complaint filed in this case says officers in the area of 35th and Vienna were flagged down by a man reporting he had been shot in his left leg. He told officers he was in the 3600 block of N. 37th Street with numerous other people when he heard shots fired. He then realized he had been shot.\nDuring the course of their investigation into the incidents that occurred early on May 1st, police spoke with an individual who reported he had received a telephone call from a friend who told him “somebody got into it,” and he requested he come to the area of 37th and Hopkins. When he was dropped off, the man told police he saw Damario Jones arguing with his “baby momma” and another man — and as this argument was going on, the man told police several cars pulled up — and a man began shooting from the side of a house. The man told police he saw Jones get shot and killed — and he told police he himself was shot in the leg as he ran to a nearby yard.\nPolice spoke with another man who reported that early on May 1st, he received “several” telephone calls from Jones and Jones’ sister. The man told police Jones wanted to be picked up from his “baby momma’s” house. The man said Jones’ sister requested he respond to the area of 37th and Nash for a fight involving Jones.\nWhen he showed up at the scene, he told police he saw several people fighting, and shortly thereafter, he heard gunshots. The man told police he felt pain in his right knee and realized he’d been shot.\nPolice spoke with Jones’ sister, who reported Loggins as the person who shot Jones and Burdine. Jones’ sister said Loggins’ mother is dating her father. Jones’ sister reported her brother, Damario Jones was dating, living with and has a child with Loggins’ sister.\nJones’ sister told police that prior to the shooting, Damario Jones, Jones’ girlfriend (Loggins’ sister), and Loggins were arguing when Loggins pulled out a gun and fired 12 times — shooting toward Damario Jones and the others who were there.\nJones’ sister told police that the shooting occurred because of an earlier incident in which Loggins punched Jones’ father, according to the complaint.\nPolice spoke with Jones’ girlfriend (Loggins’ sister), who reported she lived near 37th and Nash with her boyfriend, Damario Jones, her three children and her brother, Devon Loggins.\nJones’ girlfriend told police she arrived home around 10:30 p.m. on April 30th, and Jones wasn’t home. Devon Loggins and another brother showed up at the house and while there, the other brother said he “just had to do it” — saying “he was disrespecting Mama again. I had to do it to him.”\nShortly thereafter, Jones’ girlfriend got a call from Damario, indicating he was on his way home.\nWhen Damario Jones showed up with “his guys,” his girlfriend told police she yelled out the window for them to leave. That’s when she says her brother Devon and her other brother went outside, and a fight ensued.\nDuring that fight, shots were fired — and Jones’ girlfriend/Loggins’ sister said she saw her brother Devon Loggins in the street, firing a gun. She told police she saw Damario Jones’ sister screaming.\nDevon Loggins is a convicted felon — after pleading guilty to a felony charge of possession of a firearm by a felon. Therefore, he should not have been in possession of a weapon on May 1st, as police say he was.\nBefore that case was filed, Loggins was adjudicated delinquent for armed robbery back in 2007."}