{"uri": "http://m.ajc.com/news/news/crime-law/as-many-as-20-people-involved-in-fatal-gwinnett-sh/nnmr2/", "title": "Lilburn man, 20, killed in Gwinnett shootout", "dct": "Thu, 24 Sep 2015 00:00:00 GMT", "id": "0c7069695435ecd62036a765806ce37f", "content": "It didn’t look good to one Gwinnett County resident when 20 young men gathered in the street after 10 p.m. Two groups were ready to fight, a caller reported to 911.\nBy the time officers arrived Wednesday night, dozens of shots had been fired, multiple houses and cars had been hit, and a 20-year-old man was dead in the street. Three others were also injured by gunfire and in stable condition late Thursday.\nAs officers worked throughout Thursday to piece together what happened, residents of Reddington Lane picked up the pieces, including glass from broken windows. Multiple homes and vehicles were damaged by bullets, so many that Gwinnett police could only guess.\n“It would be fair to say dozens at this point,” Cpl. Jake Smith said.\nNo arrests had been made late Thursday and police declined to speculate on what may have led to the shootout, other than it was a disagreement. It wasn’t known why the groups met on a neighborhood street, just off Singleton Road.\n“We have two conflicting parties that had two conflicting viewpoints on some matter that led to a physical confrontation and then the physical confrontation led to a shootout,” Smith said. “When we have two opposing groups like this and we have a fairly large number of people involved, that will be an angle that we’re going to investigate, whether or not there was any gang activity going on here.”\nTre Edwards of Lilburn was killed in the shootings. The names of three others who were injured were not released, but they were all in stable condition and expected to survive their injuries, police said Thursday.\nOne of the shooting victims was found by a police K9 on an adjacent street, where he was seeking shelter in a shed, according to police. All of the people shot were adult or teenage males, Smith said\nInvestigators believe all of those shot were involved in the altercation. At least one bullet entered a room of a home and another went through the headrest of a parked car, but no other injuries were reported.\nMarlene Ebanks, who has lived in the neighborhood for six years, said she was in her bedroom when, “all of a sudden, I heard all of these gunshots, and then I heard a car screeching, speeding off.”\nEbanks said there has been “a lot of trouble” recently in her neighborhood.\n“You see a lot of drug trafficking going on in the neighborhood,” Ebanks, who is from the Cayman Islands, told The Atlanta Journal-Constitution. “It makes me feel like I want to pack my clothes and leave and go back home to the islands. You don’t feel safe.”\nThe investigation continued late Thursday."}