{"uri": "http://www.kjct8.com/content/news/MCSO-One-person-taken-to-the-hospital-after-being-shot--400965705.html", "title": "MCSO: 11-year-old shot, killed in Fruitvale; suspect arrested", "dct": "Sat, 12 Nov 2016 18:53:00 GMT", "id": "6634984c4fa6fe8068a46c225d1d69d9", "content": "FRUITVALE, Colo. (KKCO/KJCT)-- An 11-year-old boy was killed in a shooting in Fruitvale over the weekend, according the Mesa County Sheriff's Office.\nCaden Randolph of Grand Junction was rushed to Saint Mary's Hospital, but he later died from the injuries. The coroner's office said the cause of death was a gunshot wound to the chest and listed the manner of death as a homicide.\nThe shooting happened around 6:15 p.m. in the 3000 block of Sandpiper Avenue, near 30 1/2 and D roads.\nAfter the incident, the authorities said Jeremy Mushrush, 41, of Grand Junction went to the sheriff's office to give a statement. He was not arrested at that point. He was free to leave.\nFollowing his statement, deputies learned about criminal activity surrounding Mushrush.\nAround 10:30 a.m. on Sunday, deputies and Grand Junction police officers found Mushrush at the Woodspring Suites on Market Street, according to a press release. Around the same time, Mushrush called authorities to turn himself in to police.\nHe was arrested on weapons and manslaughter charges, according to police.\nIn court on Monday, prosecution said Mushrush was intoxicated at the time of the shooting.\nProsecutors also say Mushrush originally tried to blame the shooting on his son. He later said the gun went off accidentally when he set it on the table, but later admitted he was pointing the gun when the shot was accidentally fired.\nDeputies said Mushrush is not related to the victim.\nHe is being held on a $100,000 cash bond.\nAuthorities did not release the boy's identity, and all documents related to the case have been sealed by the court.\nThere's no available information on how the shooting happened.\nDeputies said there is no danger to the public. They were interviewing witnesses as they continued the investigation.\nWe will update this story as more information becomes available."}