{"uri": "http://www.wrcbtv.com/story/34057831/person-shot-early-this-morning-on-blanche-road", "title": "Man says he thought his wife was intruder; shot her in the ear", "dct": "Thu, 15 Dec 2016 22:46:00 GMT", "id": "0c05897a0ae98339aef449171e7029c5", "content": "OOLTEWAH, HAMILTON COUNTY -\nAn unwanted guest in your home can be frightening and dangerous for a homeowner. A couple in Ooltewah said it happened to them, but with a twist.\nA man accidentally shot his wife early Thursday morning, mistaking her for an intruder, according to the Hamilton County Sheriff's Office.\nHCSO Deputies responded to the report of a shooting on Blanche Road about 4:20am.\nWhen authorities arrived, it was found that the husband had been sleeping in the bedroom and was awoken by his wife who had been downstairs in the kitchen working.\nWhen the wife returned to the bedroom the husband was awoken, startled, and accidentally fired his weapon believing she was an intruder.\nMillions of Americans own firearms, some for recreation, others for protection, but when can you legally shoot your gun at an intruder?\nHamilton County District Attorney Neal Pinkston said if a person feels threatened by an intruder; in the state of Tennessee, they are protected by self-defense law under justification for crimes.\n\"At some odd hour the mere presence of someone that you didn't invite me into your home, in my opinion, and I think the law reflect that you have the opportunity to protect yourself at that point,” Pinkston said.\nThe shooting is still under investigation, but the Hamilton County Sheriff’s Office does not expect to file charges. If there were, Pinkston said the shooter could have a compelling argument for self-defense.\n\"It depends on what witnesses say, what evidence the police find. did someone force entry? where did they shoot? where was the person the intruder at when they shot? all those things have to be evaluated.\"\nFortunately, the bullet grazed the wife's ear and caused no serious injury. The wife was transported to a local hospital for medical review.\nWe have a crew currently on the scene.\nStay with Channel 3 on air and online for more information."}