{"uri": "http://www.orlandosentinel.com/news/pulse-orlando-nightclub-shooting/os-orlando-shooting-survivors-hostage-20160614-story.html", "title": "Survivors describe horror inside Pulse with gunman", "dct": "Wed, 15 Jun 2016 07:24:00 GMT", "id": "515cdfa8b5fc978a6fc906712a1334ea", "content": "Patience Carter lay on the floor with gunshot wounds to both her legs while her captor, gunman Omar Mateen, terrorized her and several others in a bathroom at the Pulse nightclub.\n\"'Are there any black people in here?'\" he asked.\nCarter was too afraid to answer. But another man spoke up: \"Yes,\" he said, \"there are.\"\n\"I don't have a problem with black people,\" Mateen replied. \"This is about my country. You guys have suffered enough.\"\nFor three hours, Carter and her two injured friends, Akyra Murray and Tiara Parker, cowered on the floor. They heard Mateen talking to police on the phone, pledging his allegiance to the Islamic State and saying he was doing it because America was bombing his country.\nAt one point, his handgun jammed, so he put down his AR-15 and began trying to fix it.\nAnd he told the hostages to stay off their phones.\n\"Every time a phone rang or every time a text message went off, he would say, 'Where is it? Give it up.'\"\nAfter what felt like \"hours and hours,\" she heard police yell to get away from the wall. Then she heard three explosions.\nMateen shot two more people before dying in a gun fight with police.\nCarter crawled out of the stall.\n\"I was able to sit up and pull my leg up from the person who just was shot dead,\" she said.\nCarter's friend Murray was unconscious but still breathing.\nShe later died.\nCarter said she and Murray had actually gotten out of the club when the shooting started, but they went back in to get Parker.\n\"The guilt of being alive is heavy,'' Carter said.\nThe three women were visiting from Philadelphia and had Googled what the best clubs were; Pulse popped up.\n\"We just went from having the time of our lives to having the worst time of our lives within minutes,\" she said.\nCarter and another victim recounted their ordeals Tuesday at Florida Hospital Orlando.\nAngel Santiago, 32, of Orlando, said he and a friend were near the rear bar when the shots rang out.\nThey scurried to another bathroom.\n\"There was just a lot of blood,\" he said. \"A lot of people were hit and [there were] even some fatalities which were apparent. Everyone was just panicking.\"\n'We started running'\nAngel Colon, 26, and his friends were wrapping up a great night at Pulse nightclub when the shots began.\n\"We were saying our goodbyes. I'm hugging everyone ... and out of nowhere, we just a heard a big shotgun. We stopped what we were doing and it just kept going. We started running,\" Colon said.\nTwo days after the mass shooting, he was wheeled into an overfilled room at Orlando Regional Medical Center to share his story of survival.\n\"At first I was hesitant to come out here, because it's all so fresh for me,\" said Colon, surrounded by his siblings. \"But I wanted to get my story out so everyone would know what is going on now in this community.\"\nHe was shot three times in the leg.\n\"I tried to get back up, but everyone started running everywhere, I got trampled over. I shattered and broke the bones in my left leg,\" he said.\nHe realized he couldn't walk at all.\n\"All I could do was to lay down there while everyone was just running on top me of me trying to get where they had to be. And all I could hear was the shotgun ... people screaming, people yelling for help,\" he said.\nBy this time, Mateen had moved to another part of the nightclub, but Colon could still hear the shots.\n\"I thought I was a little safe by this time because I thought it's giving everyone time to tackle him and get him down. But unfortunately, I hear him getting back and shooting everyone that's already dead on the floor, making sure they're dead,\" he said.\n\"I was able to peek over and I could just see he's shooting everyone. I could hear his shotgun get closer and I look over and he shoots the girl next to me. And I'm just thinking I'm next. I'm dead.\"\nMateen tried to kill Colon, too – but those bullets hit him in the hip and hand.\n\"I had no reaction. I was prepared just to stay there, laying down so he won't know that I'm alive,\" Colon said.\nA police officer eventually dragged Colon out of the club, his body getting cut with shards of glass on the ground.\nHospitals respond\nDr. Chadwick Smith got a call from an emergency room resident telling him of multiple gunshot wounds.\nOut in the field, the emergency responders were loading patients into ambulances and cars and taking them to the hospital, which is only a few blocks away from the nightclub.\nIt only took a few minutes before the patients started arriving after Smith got the call.\n\"One came, then another came, then another came,\" Smith said on Tuesday.\nHe started calling other surgeons.\n\"I said that this is not a drill. This is not a joke. Twenty-plus gunshot wounds are coming in. I need you here as fast as you can. And every time the answer I got was 'I'll be right there,'\" Smith said.\nNurses arrived, too, even those who weren't on call.\n\"The toughest thing was hearing them scream,\" said Meagan Noblet, a registered nurse. \"They weren't worried about themselves; they were worried about their loved ones.\"\nThe voices, she said, still keep replaying in her head.\n\"You can never prepare for a disaster like this,\" said Dr. Michael Cheatham, chief surgical quality officer for ORMC. \"It's the largest we could have imagined, but we were never at want for anything because of everyone's support.\"\nTwenty-seven survivors of the Pulse shooting remain at ORMC. Six are in critical condition, and the death toll could go higher in the coming days, said Cheatham.\nFive other patients are in a guarded condition and 16 are stable. Another six are at Florida Hospital Orlando.\nMateen's lifestyle\nOn Tuesday, a U.S. official said the FBI was looking into a flurry of news reports quoting patrons of the Pulse as saying Mateen frequented the nightspot and reached out to men on gay dating apps. The official was not authorized to discuss the investigation and spoke on condition of anonymity.\nSome psychologists raised the possibility that Mateen was sexually conflicted and that those feelings might have contributed to his lashing out against gays.\n\"People who are struggling to come to terms with their sexual identity do at times react to that by doing the exact opposite, which could be to become more masculine or more vocal about their ideals of a traditional family,\" said Michael Newcomb, a Northwestern University psychologist.\ndharris@tribune.com or 407-420-5471; nmiller@orlandosentinel.com or 407-420-5158\nThe Associated Press contributed information to this report."}