{"uri": "http://www.wftv.com/news/local/i-thank-god-im-here-but-its-not-easy-pulse-survivor-says/428450590", "title": "‘I thank God I'm here, but it's not easy,' Pulse survivor says", "dct": "Thu, 08 Sep 2016 11:33:00 GMT", "id": "54c19a733ea785a5fea6611f58b6aff1", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nORANGE COUNTY, Fla. - Victims of the Pulse nightclub shooting on June 12 are still a month away from receiving financial help from the OneOrlando Fund.\nFor Ilka Reyes, who was shot nine times, the money can’t come soon enough.\n“I’m not a person that likes to ask for help. I like to do things myself,” Reyes told Channel 9’s Nancy Alvarez.\nReyes has undergone five surgeries so far and will always carry bullet fragments in her body. She said she’s grateful to be alive. Three friends who went with her to Pulse with that night died.\n“For me, it's so hard to believe that they're not here,” Reyes said.\nRaw: 'Thank God I'm here, but it's not going to be easy'\nBeyond the physical and emotional pain, Reyes and her parents are facing a struggle to simply make ends meet.\nShe often sleeps in a recliner or in bed with her mom while her dad sleeps on the floor, in a tiny apartment they share with other family members.\nReyes’ father had to leave his job at a local resort to become a full-time caretaker, the family said.\nReyes has applied for help from the OneOrlando fund, which has raised millions for the victims, but that money won't be distributed until October. Until then, she continues to rely her own strength and on friends and strangers who've stepped up to help and on her strength.\n“People see me here because I'm strong and I don't give up. I want to get better and be the person I was before,” Reyes said.\nA fund managed by Osceola County called \"Osceola Cares\" has also assisted Reyes and other victims with things ranging from bills to free mental health counseling.\nReyes goes to physical therapy and she was told it could t ake up to six months for her to regain full use of her arm.\nThe family has set up a GoFundMe page to help cover some of the expenses until money comes in from the OneOrlando Fund.\n© 2017 Cox Media Group."}