{"uri": "http://www.orlandosentinel.com/news/pulse-orlando-nightclub-shooting/os-pulse-survivors-hospital-reunion-20160619-story.html#nt=oft03a-1gp3", "title": "Pulse survivor, strangers who saved his life reunite", "dct": "Sun, 19 Jun 2016 22:35:00 GMT", "id": "8a650267c8d43fc6f1145071bc40a55c", "content": "Jose \"Junior\" Martinez is recovering at Orlando Regional Medical Center. He was a shooting victim at Pulse nightclub last Sunday morning. Christopher Hansen and Christopher Rosario helped Jose out of the club. They reunited for the first time on Friday, June 19, 2016.\nAs he faded in and out of consciousness while being carried away from Pulse nightclub, Jose \"Junior\" Martinez felt the warmth of two strangers.\nOne told him in Spanish, \"God is with you\" and held on to Martinez's rosary, a gold and black beaded necklace with a small cross on the end. The other stuffed a knotted bandanna into one of Martinez's two gunshot wounds, trying to stanch the bleeding that already soaked his pants. Each of the men held his hands as Martinez screamed in pain. They waited with him until paramedics hauled Martinez away on a gurney.\nFive days after the worst shooting in U.S. history, Martinez finally learned the names of the two men he credits with saving his life: Christopher Hansen and Carlos Rosario.\nIn a teary-eyed reunion in his hospital room Friday, a smile spread across Martinez's face as he hugged Hansen and told him he had a new best friend. He cried while talking in Spanish again with Rosario, who was out of town but Skyped in over an iPhone.\n\"(Martinez is) very thankful to God that you guys were in his path, that you guys helped him,\" translated a friend of Martinez, who is orginally from El Salvador.\nIt was also the first time Rosario and Hansen were able to reconnect since a gunman wreaked chaos on a gay night club, killing 49 innocents. News media on the scene captured images of Hansen and Rosario working together to treat the injured, but they never got each other's names.\nJose \"Junior\" Martinez is recovering at Orlando Regional Medical Center. He was a shooting victim at Pulse nightclub last Sunday morning. Christopher Hansen and Christopher Rosario helped Jose out of the club. They reunited for the first time on Friday, June 19, 2016.\n(Alejandro Tamayo / San Diego Union-Tribune)\nNow, together again, they recounted that terrifying night:\nFrom what he remembers, Martinez, 24, was on the dance floor talking to friends about 2 a.m when he heard three loud bangs and saw people dropping to the ground. He ran, not knowing he was hit twice, and fell near Rosario, a medical assistant at Florida Hospital who grew up in Kissimmee.\n\"We had already gotten out through the back patio door ... but the shooting happened again,\" Rosario said. \"That's when I saw Junior about to lay down, and that's when I started taking off his shirt to tie around his wounds.\"\nRosario, 21, threw Martinez over his shoulder and dragged him outside onto the street. Hansen, who moved to Florida two months ago from Ohio, noticed Rosario carrying an injured man on his own and thought, \"Oh man, he can't do it by himself.\" He dipped under Martinez's other shoulder and helped put him down on a grassy area. He still had a glass in his hand.\nRosario and Hansen tried to stop the bleeding, but it was so heavy.\nThey didn't know if the bullets went through, or exactly where they had penetrated. Without gloves, they tried to plug the wounds, their arms streaked red from their fingers to their elbows.\nThey tried talking to Martinez, but didn't know his name. All he could say was that he went by \"Junior.\" He was speaking in Spanish.\nRosario, who also speaks the language, consoled him and noticed his rosary.\n\"God is with you because you have this on,\" he said.\nHansen couldn't understand the conversation. He took a blue bandanna off his head, knotted it and stuffed it into a bullet hole on Martinez's lower back. Both men helped until first responders loaded him on to a gurney and sped to the hospital.\n\"We were going to stay with you the whole time,\" Hansen told Martinez when they met. \"I couldn't have kept going, just not knowing. The nightmares would have been a whole lot more worse for me.\"\nFor days, Hansen and Rosario looked for Martinez. They did interviews on major news networks, each time mentioning the bandanna and the man they knew only as Junior.\n\"I was just hoping that by saying your name, someone would find you and I could find out if you were OK,\" said Hansen, who has since been awarded a medal by Florida Gov. Rick Scott and mentioned in an address by presidential candidate Hillary Clinton.\nNothing helped him sleep, though.\nUntil he learned, through the Orlando Sentinel, that Martinez was healing and wanted desperately to meet him.\nThe hour-long meeting Friday at Orlando Regional Medical Center wasn't enough time for them.\nMartinez was released from the hospital after undergoing surgery and being revived with chest compressions. He's recovering at a home in Altamonte Springs.\nThe three exchanged phone numbers and joked about teaching Hansen to dance for the next Latin night they attend.\nMartinez said he considers Hansen and Rosario among his family.\n\"It just feels like a huge weight has been lifted from my chest,\" he said after talking to Hansen and Rosario. \"I feel like I have a reason to smile again, like I can smile again."}