{"uri": "http://www.telegram.com/news/20160614/leominster-native-jeffrey-rodriguez-survived-orlando-shooting", "title": "Leominster native Jeffrey Rodriguez survived Orlando shooting", "dct": "Wed, 15 Jun 2016 00:00:00 GMT", "id": "cf0e193ec398d1c55d190c3e21ea690b", "content": "LEOMINSTER - A Leominster native who was among the 53 injured Sunday in the mass shooting at a gay nightclub in Florida is in critical condition, but is expected to pull through, according to his family.\nJeffrey Rodriguez, 37, of Orlando and formerly of Leominster, was shot three times at Pulse Club in Orlando, his stepmother Mary Ann Rodriguez said Tuesday.\nMs. Rodriguez, who has helped raise Mr. Rodriguez since he was 6, was talking from inside a hotel in downtown Orlando across from the Orlando Regional Medical Center, where she and others are staying near loved ones who were injured in the worst mass shooting in the U.S. Her stepson was shot in the leg, chest and heart, she said.\nIn the massacre around 2 a.m. Sunday, 49 people were killed and 53 injured by gunman Omar Mateen, who was previously investigated by the FBI on suspicion of ties to terrorism. Some people in the gay community feel the act was a hate crime targeting gays.\nMr. Rodriguez moved to Orlando from Leominster when he was about 20, Ms. Rodriguez said, and often frequented the nightclub with a group of friends. Saturday was Latin night at the club, she said, and there were mostly gay Hispanics in the club.\nShow more...\nOn Sunday morning at closing, Jeff texted his 29-year-old stepbrother, Santos Rodriguez, \"I'm bleeding. I'm going to die.\"\nMs. Rodriguez said Santos didn't believe him at first. They were always kidding around with each other and Santos thought Jeff was joking and told him to \"just cut it out,\" she said.\nThen Santos went on the internet, she said, about 2:45 a.m.\n\"He woke us up and said, 'Mom, Dad, get up. Jeff has been shot,' \" she said. \"We didn't know it was a terrorist attack. We thought it was a fight. We weren't watching the news.\"\nSantos drove about 100 mph from Spring Hill to Orlando, normally a two-hour drive, she said.\nWhen they arrived outside the club, she said, the scene was chaotic, with police cruisers and people crying and waiting. No one knew what was going on, she said.\nOne of Jeff's last texts to his brother was to have him tell his family that he loved them, she said. They wouldn't get the news that he was alive for more than 15 hours. Around 7:30 p.m. Sunday, the family was told Jeff was at the hospital.\n\"We waited 15 hours after his last text to know he was alive,\" she said, crying. \"We all rushed to the front of the hotel and rushed to the hospital. When we got there, he was unconscious, with tubes in his mouth, but he was alive. We felt bad for the ones who stayed behind, whose children passed away.\"\nHer stepson is still in ICU, but is able to talk after doctors removed his breathing tubes.\nMr. Rodriguez keeps repeating how the horror unraveled that night and crying, his stepmother said, including how he and 14 others hid in a handicap bathroom stall in one of the club's three bathrooms while the gunman returned six times, each time putting the assault rifle underneath the stall door and shooting.\n\"The gunman had a machine gun and kept shooting and shooting,\" Ms. Rodriguez said. \"Jeff was hiding underneath the sink and he got his legs and came back again. They all were hiding in the handicap bathroom stall because it was the big one, and locked the door and were trying to be quiet. He walked into that bathroom and took the gun and shot underneath the stall. He came back six times and they had to act like they were dead and hide under the bodies.\"\nThe 15 victims in the handicap stall were the last ones rescued from the club that night, Ms. Rodriguez said. She said she thinks five to 10 of those in the stall with her stepson died.\n\"They had to knock down a wall, and they took him through a hole in the wall, put him in a police car, then an ambulance, and rushed him to the hospital,\" she said.\nMr. Rodriguez was able to survive, his stepmother said, because a good friend he went to the club with that night, a woman who works as a physician's assistant, took off her bra and wrapped it around his leg and put pressure on his chest. The woman was covered in blood and had cuts from glass, but somehow was not shot, she said. The woman is devastated, Mr. Rodriguez said, and cannot talk about what happened.\n\"She is like our hero,\" she said. \"He's alive, thanks to her. He had a friend who died that they went to club with.\"\nTuesday afternoon, Mr. Rodriguez was recovering after his second leg surgery. Doctors are trying to restore feeling in his leg, she said. Monday he underwent surgery on his intestines. Doctors are leaving two other bullets, one near his spine, alone for now, Ms. Rodriguez said.\nShe said Mr. Rodriguez, who she described as loving and soft-hearted, is going to need counseling, and nurses advised the family not to talk about the gunman. Santos, she said, feels guilty about not believing his brother's texts during the shooting.\n\"They said when you get there, show him love and do not mention about the gunman,\" she said. \"They told us to tell him we're here and love him.\"\nHis mother, Millie Rodriguez, arrived Monday from Puerto Rico, but family did not let her see her son right away because they were concerned about a heart condition she has. He also has a younger brother, Yaniro Rodriguez, 30, who lives in New York, his stepmother said.\nHospital staff has been amazing, she added, and the family is touched by the outpouring of support they have received.\n\"He is strong, thank God,\" she said. \"He survived this ordeal. I can just imagine the images he has. I can't believe one man could have killed so many people for no reason. To me, he terrorized everyone. People in the hospital are telling us it was a terrorist attack.\"\nHis lifelong friend Raevin Starr of Fitchburg feels differently. She said she believed the gunman targeted gays.\nMs. Starr, 37, and Mr. Rodriguez met in kindergarten, she said, both growing up in an apartment complex on Litchfield Street in Leominster. They remained friends throughout their childhood, she said, and he moved to Florida as a young adult. In 2006, Ms. Starr traveled to Orlando to visit him, she said, and keeps close contact with him on Facebook.\nAround 3 a.m. Sunday, Ms. Starr said, a mutual friend texted her that Mr. Rodriguez had been shot.\n\"I woke up to a text that said, 'I think Jeff was shot,' \" she said. \"I was in disbelief, but then I knew for sure as soon as I jumped on Facebook.\"\nShe said she cannot imagine the horror her friend went through.\n\"It is crazy,\" she said. \"I just couldn't believe it. To imagine, and know he saw it and to know people were dead in there with him.\"\nMr. Rodriguez, she said, was a funny kid who loves to dance, loves music and loves X-Men. He has a large extended family, she said, in the Leominster-Fitchburg area, in Florida and in Puerto Rico.\nShe said she knew in high school he was gay.\n\"We loved him anyway just the way he was because he was awesome,\" she said.\nShe said she believes what happened was a hate crime.\n\"For someone to do that to a group of anybody is hateful,\" she said. \"I'd say it was a hate crime.\"\nAida R. Maldonado of Fitchburg said she grew up with Ms. Rodriguez in Worcester. They lived in the same neighborhood and are still good friends. Ms. Rodriguez updated Ms. Maldonado on her son's condition throughout a vigil held on the Upper Common in Fitchburg Monday evening in remembrance of the Orlando shooting victims.\n\"We're so happy\" that Mr. Rodriguez survived, Ms. Maldonado said Tuesday morning. \"I believe in prayers and things are working out.\"\nMr. Rodriguez's cousin Tito Algarin, 42, of Fitchburg said he is very close to his cousin and is praying his condition improves.\nMr. Algarin said he received a notification on his phone around 2 p.m. Sunday that Mr. Rodriguez had posted to Facebook that he had been shot.\n\"I was watching the news and was about to lay down when I got a notification about his Facebook post,\" he said. \"It said, 'I've been shot in club Pulse and I'm bleeding out. I love you all.' I took it as a joke like his brother did.\"\nWhen he saw the news the next morning and realized that the post was not a joke, he said, he panicked.\n\"It was like when 9-11 happened - I freaked out and took my son out of school,\" he said. \"When this happened, it was the same feeling of helplessness. I have other family in Florida - my mother, sister, and two gay brothers who hang out with him. They busted that guy in LA at the gay pride parade, too. Obviously they are targeting gays, and that freaked me out.\""}