{"uri": "http://www.wftv.com/news/pulse-shooting/orlando-nightclub-shooting-victim-a-stranger-saved-my-life/341196896", "title": "Orlando nightclub shooting victim: ‘A stranger saved my life'", "dct": "Fri, 01 Jul 2016 12:02:00 GMT", "id": "e62c509b2bb3707a3f7784256811c39b", "content": "© 2017 Cox Media Group.\nORLANDO, Fla. - Fred Johnson says he’s blessed to be alive. That he’s still breathing, he says, is nothing short of a miracle.\nAs a group of friends celebrated a graduation early Sunday at one of Orlando’s most popular gay nightclubs, joy turned into terror when a man massacred 49 people.\nJohnson was among the 53 others wounded in the country’s deadliest mass shooting.\n“The shots came out consecutively, like, right behind each other, so we thought it was the music,” he said. “But come to find out, it was someone that was shooting in the club.”\nJohnson immediately ran to the restroom to search for his friends.\n“I was unable to locate them when I went to the bathroom,” he said. “But I did locate someone that was trying to use me as their human shield. They all packed themselves into the bathroom stall and tried to close the stall and people were trying to get into there.”\nJohnson knew he had to get out of there.\n“The people outside of the stall were trying to gather people as a human shield,” he said. “That’s when I decided that I couldn’t stay in there, because if he were to come into the bathroom, I knew I’d be shot.”\nAs Johnson peeked out of the bathroom, he spotted someone lying on the ground. He made a split decision to make a run for it.\n“That’s when I knew it was really serious,” he said. “I heard the gunshots coming from afar, so I took my chance to run out of the club. I ran out to the nearest exit that I could see.”\nAs soon as he made it out of the club, Johnson felt two bullets pierce his body -- one through his right hip, another in his left arm.\n“It went through my right-hand side and my hip. I had an entry and an exit wound, so it went right through,” he said. “My left-hand side, when I got shot, it actually shattered my bone and that was protruding from my arm.”\nAt the risk of his own life, a complete stranger came to Johnson’s aid. The man removed a bandana and used it to stop Johnson’s bleeding. He also brought Johnson water to drink as he awaited an ambulance.\n“If I were to see him again, I’d tell him thank you,” Johnson said. “He tried his best to keep my mind occupied on something else and to not pay attention to the wound, to have faith in dialogue. So I was very thankful for that.”\nSurgeons at Orlando Regional Medical Center spent four hours drilling screws into Johnson’s bone to put it back in place. He has two more surgeries ahead of him.\n“I was thinking I was going to get out,” Johnson said. “I have faith in God, and I know he was going to direct my path through this situation. I’m just blessed. It’s nothing short of a miracle.”"}