{"uri": "http://wncn.com/2015/08/11/he-just-killed-my-dad-911-calls-reveal-moments-before-nc-shootout/", "title": "‘He just killed my Dad’: 911 calls reveal moments before NC shootout", "dct": "Tue, 11 Aug 2015 06:48:00 GMT", "id": "c1fc0fe4357589ca3082019d4c226c4f", "content": "GASTONIA, N.C. (WNCN) – Authorities in North Carolina released audio from two 911 calls on Monday that captured the terrifying moments before a deadly shootout between a gunman and police in a suburban neighborhood outside Charlotte.\nGaston County police received a call at approximately 9:18 p.m. Saturday from a home located at 4621 Balsam Court in Gastonia.\nIn the call, a man can be heard whispering into the phone.\n“He’s in the house,” the man says.\n“Your dad’s in the house?” the dispatcher asks.\n“The gunman,” the man says.\nShouting can be heard in the background and then the man tells the dispatcher, “He just killed my dad. He just killed my dad.”\nThe father, who was apparently dead before the police showed up, was identified as a retired Gastonia Police Officer Charles Dean Thompson.\nIn a second call, a woman in a nearby home tells the dispatcher that a man was in the front yard shooting a gun. “Please hurry,” the caller says, adding, “He shot me in the arm.”\nAs the woman, Debra Childress, explains that the gunman is in the house and appears to be coming after her, the dispatcher calmly tells her to remain as quiet as she can.\n“Stay on the phone with me,” the dispatcher says.\nOfficers responded to a residence located at 4908 Greenwood Drive in Gastonia and were confronted by the suspect, Jeffrey Clyde Wilkes.\nWilkes was holding a shotgun and wearing a pistol. When approached by officers T.M. Leopard and C.M. Belli, he shot them with the shotgun. Other Gaston County officers returned fire and fatally wounded Wilkes.\nOfficers located Thompson’s body inside the home on Balsam Court. He retired from the department in 1995 after serving five years.\nA second victim, Debra Maness Childress, also of 4908 Greenwood Drive, was located at a neighbor’s home where had fled to after being shot by Wilkes at the Balsam Court address. She was transported to Caromont Regional Medical Center with non-life threatening injuries.\nThe two wounded officers were also transported to Caromont with non-life threatening injuries. Both officers have been released from the hospital.\nThe investigation is ongoing. The Gaston County Police Department is conducting the investigation involving the murder of Thompson and the attempted murder of Childress.\nThe North Carolina State Bureau of Investigation has been requested by the department to investigate the officer-involved shooting. A parallel investigation is being conducted by the Gaston County Police Department Professional Standards Unit to insure all policies and procedures were followed.\nA total of five officers were involved in the shooting and all five have been placed on administrative leave with pay. Their names will be released after the SBI completes its investigation.\nAnyone with information concerning this incident is asked to contact the Gaston County Police Department at 704-866-3320 or Crime Stoppers at 704-861-8000.\nCary's mayor strongly hinted in a blog post that a \"blue and yellow\"…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}