{"uri": "http://www.southbendtribune.com/news/local/four-injured-in-st-joseph-county-banquet-hall-shooting/article_f241d43c-7e24-11e4-ba15-67a1a0af4ad1.html", "title": "Four injured in St. Joseph County banquet hall shooting", "dct": "Mon, 08 Dec 2014 00:00:00 GMT", "id": "4c6776492338339572b3b3c6129a914d", "content": "An outdoor affair exploded into gunshots early Sunday morning at a St. Joseph County banquet hall, leaving four wounded, with three hospitalized and one victim fleeing an ambulance.\nThe shooting occurred shortly after 2 a.m. at The Oaks, a parties and special events rental hall in the 16000 block of Roosevelt Road, in rural southeastern St. Joseph County.\nAccording to a release issued by St. Joseph County Police, a county police officer was conducting a traffic stop nearby when he heard several shots fired.\n“We had gotten some complaints from people in the area about cars driving recklessly along Roosevelt Road,” said Lt. Matt Blank of the St. Joseph County Police Department. “One of our officers had a car stopped literally right in the front of (The Oaks), and he heard the gunshots go off.”\nPolice responded to the scene, where an estimated 500 party-goers were gathered. Four victims were found with gunshot wounds, one of which Blank described as “a significant wound above the ankle.”\n“Everybody tried to flee the scene” before officers were able to secure the area and lock everything down, Blank said.\nThree of the victims were taken by ambulance to an area hospital, where they were treated for “non-life threatening injuries,” police said.\nA fourth victim fled as he was being treated inside the ambulance. “Apparently he dropped a little bit of marijuana on the floor of the ambulance, and he took off running,” Blank said.\nSt. Joseph County detectives investigating the shooting have “one guy they’re looking at,” although no arrests have been made, Blank noted.\nSunday morning, workers milled around inside The Oaks cleaning empty beer bottles and leftover trash still visible on the grounds outside the building and assessing damages.\nOne man, who didn’t give his name, said the original plans for the event “started out at about 80 people” before spiraling out of control with gunshots.\nThe man, who said he didn’t know the reason for the event, admitted, “It wasn’t what we thought it was supposed to be.”\nAnyone with information about the shooting or the missing victim should contact Capt. Randy Kaps at 574-235-9569, or 574-235-9611."}