{"uri": "http://www.wdbj7.com/content/news/Man-charged-in-Halifax-shooting-377024511.html", "title": "Man charged in Halifax shooting", "dct": "Tue, 26 Apr 2016 08:11:00 GMT", "id": "4d0a786335e1710d03b4920d37a12bf6", "content": "HALIFAX, Va. (WDBJ7) A man has been charged in connection with a weekend shooting that injured 5 people in Halifax.\nMalik Ratwon Cobbs is charged with one count of shooting into an occupied building.\nCobbs is 19 years old and is from Danville, according to Halifax County Sheriff Fred Clark.\nCobbs was arrested Monday afternoon at the Duke University Medical Center where he had been a patient.\nSunday morning's shooting injured five people outside a party in the town of Halifax.\nA deputy then shot the suspected gunman, though Virginia State Police have not released any names related to the case.\nHalifax Police chief Kevin Lands tells WDBJ7 he met with his command staff Monday to discuss the incident and he will continue to do so all week.\nChief Lands says there have not been any issues at the VFW during his 3.5 years as chief.\nHe says an ordinance was passed in 2012 which helped solve issues with the facility at that time.\nThe VFW post commander told WDBJ7 on Sunday, the facility was rented out to a birthday party.\nWDBJ7 was able to contact the party host, who declined to comment on the situation.\nCobbs went before a magistrate Monday in North Carolina.\nHe's waiting to be extradited to Virginia.\nMeanwhile, the Halifax Commonwealth Attorney says the investigation continues and there could be more charges.\nHere is the news release from Virginia State Police:\nThe Virginia State Police investigations into two shooting incidents that occurred within the Town of Halifax early Sunday (April 24) remain ongoing.\nShortly before 2 a.m. Sunday, the Halifax County Sheriff’s Office responded to a parking complaint called in by a security officer at the VFW Hall on Route 501, where dual birthday celebrations were being held. After arriving on scene to address the parking issue, the deputy heard what sounded like an argument growing into an altercation taking place inside the building. The deputy stepped in to address the issue and then walked back outside. Seconds later he heard a burst of gunfire and saw people fleeing the building. The shooting suspect also exited the building still firing and the deputy immediately confronted the subject. The male subject refused to comply with the deputy’s commands to drop the weapon and the male subject was subsequently shot by the deputy.\nFour people inside the building were injured in the initial shooting. A 23-year-old male and 23-year-old female were both flown to Duke Health in Durham, N.C., for treatment of serious injuries. As of Monday, only the male remains at the hospital. A 25-year-old female and a 21-year-old male were treated and released Sunday from Sentara Halifax Regional Hospital in South Boston, Va.\nThe male shooting suspect, Malik R. Cobbs, 19, of Danville, Va., was flown to Duke Health for treatment of a non-life threatening injury.\nThe deputy was not injured in the incident.\nState police has charged Cobbs with one felony count of shooting into an occupied building. He is currently being held in Durham, N.C., awaiting extradition back to Halifax County, Va.\nAt the request of Halifax County Sheriff Fred Clark, the Virginia State Police Bureau of Criminal Investigation’s Appomattox Field Office is investigating both the initial shooting and deputy-involved shooting. Both investigations remain ongoing at this time."}