{"uri": "http://www.news9.com/story/31013751/community-of-anadarko-heartbroken-over-recent-suicides", "title": "Community Of Anadarko Heartbroken Over Recent Suicides", "dct": "Wed, 20 Jan 2016 19:03:00 GMT", "id": "621f80aa4e10477301b3ec9bdfbee8dc", "content": "ANADARKO, Oklahoma -\nThe city of Anadarko is struggling to make sense of four recent suicides involving young people in their town.\n“They've been violent and they've really shook the community to the core,” said Anadarko Police Chief Jason Smith.\nThe latest suicide happened Tuesday involving an 11-year-old boy. Chief Smith is trying to come up with a plan to address what is happening and asks for the community’s support. He said staying silent is helping anyone.\n“Not talking about the last three didn't prevent the fourth one,” Smith told News 9.\nSmith said there have been four suicides involving young people in the last seven weeks and all of them used a gun.\nThe first was 16-year-old sophomore Jaidon DuBois. His father, Jamie DuBois, allowed News 9 to use his son’s name and pictures. DuBois said Jaidon fought with depression and the family watched it closely, taking him to a counselor and making sure he was taking his medicines. He said Jaidon seemed to be doing well lately, but DuBois believes Jaidon had an inner depression that he just could not overcome.\nThe other deaths involved a 21-year-old, a 22-year-old and the most recent was an 11-year-old.\nAfter the 11-year-old’s suicide, Anadarko Police wrote about it on their Facebook page and addressed the suicides for the first time.\nChief Smith is a 20-year veteran and said he has never seen anything like it.\n“Never this many this close together that seem to be unrelated,” Chief Smith explained.\nHe specified that they were unrelated as far as the cause. While they search for answers, the city, police and Anadarko Public Schools are working together with the Oklahoma Department of Mental Health and Substance Abuse Services to make sure resources are available.\n“I want them to know that suicide is a permanent solution to a temporary problem,” Smith said. “Life gets so much better,” he added.\nA community Care Station will be open for all interested January 20 and January 21. Services will be available at The Physicians Hospital in Anadarko between the hours of 1:00 p.m. and 4:00 p.m., and again from 5:00 p.m. to 8:00 p.m. No appointment is necessary. Services are available for anyone impacted by the recent events, those who are experiencing thoughts of suicide or self-harm, or persons seeking help for mental health or substance abuse concerns.\nAssistance is available for those unable to access the “Care Station” by calling 1-800-273-TALK (8255). This is a toll-free number staffed 24-hours a day by caring professionals, available every day of the week.\nFor anyone local to the Anadarko area who would like more information regarding the care stations or future events, please call 405-247-8231.\nSuicide Risk Factors:\nAccording to the Oklahoma Department of Mental Health and Substance Abuse Services, common risk factors and warning signs of suicide as listed in the recommendations for reporting on suicide:\nTalking about wanting to die (online or verbally)\nLooking for ways to kill oneself\nTalking about feeling hopeless or having no purpose\nTalking about feeling trapped or in unbearable pain\nTalking about being a burden to others\nIncreased use of drugs or alcohol\nActing anxious, agitated, or recklessly\nSleeping too little or too much\nWithdrawing or feeling isolated\nDisplaying extreme mood swings\nThe more of these signs a person shows, the greater the risk. Warning signs are associated with suicide but may not be what causes a suicide. If someone you know exhibits warning signs of suicide:\nDo not leave the person alone\nRemove any firearms, alcohol, drugs, or sharp objects that could be used in an attempt\nCall the National Suicide Prevention Lifeline 1-800-273-8255 (TALK)\nTake the person to the emergency room or seek help from a mental health professional\nRead more on Suicide Prevention and Early Intervention Initiative"}