{"uri": "http://www.heraldandnews.com/breaking/article_dfb1b2ba-9b2b-11e3-8dff-001a4bcf887a.html", "title": "Alturas shooting victims identified", "dct": "Fri, 21 Feb 2014 00:00:00 GMT", "id": "c8d25a42e473e339c41dc9fdfb82fa4d", "content": "ALTURAS, Calif. (AP) — A woman who opened fire at the headquarters of a Northern California Indian tribe killed her brother, nephew and niece, police said Friday.\nCherie Lash Rhoades, former chairwoman of the Cedarville Rancheria tribe, killed a total of four people and critically wounded two others on Thursday during a meeting at tribal headquarters about evicting her and her son from tribal land, authorities said.\nThose killed included the suspect's brother, 50-year-old Rurik Davis, her niece, 19-year-old Angel Penn and her nephew, 30-year-old Glenn Calonicco, Modoc County Sheriff Mike Poindexter said.\nThe other person killed was identified as Sheila Ross, 47, who was not related to the suspect.\nOne of the people wounded was alert and talking. The other remained in critical condition.\nAfter running out of bullets, authorities said, Rhoades grabbed a butcher knife and stabbed a woman. One person escaped the building, covered in blood, and ran to the Alturas police station to alert the authorities, according to KRCR.\nRhoades was taken into custody after the attack in the small Northern California community of Alturas, police Chief Ken Barnes said.\nWhen officers arrived after the attack, Barnes said, Rhoades was outside the building, running and clutching a knife. A Rancheria employee helped tackle her and she was quickly subdued and brought into custody.\nA person who answered the phone at a residence listed for declined to comment.\nThe headquarters — a ranch-style building with a pitched brown metal roof — is in a residential area about a block from the police station. The area was cordoned off with yellow police tape, and a light powered by a generator was illuminating the building.\nInvestigators said they found two guns but Barnes said he didn't know whether both had been used in the shooting, according to the paper.\nAlturas, the seat of Modoc County, is about 55 miles south of the Oregon border and 35 miles west of the Nevada line. The motto of the community of 2,800 — \"Where the West Still Lives\" — reflects the area's wilderness and natural beauty.\nThe Cedarville Rancheria is a federally recognized tribe with 35 members, according to its website. The Rancheria owns 26 acres in Cedarville, where many of its families reside.\n\"You wouldn't think this would happen in a small town like this,\" said Mike Tedrick, a retired county auditor who lives about 50 yards from the tribal headquarters. \"If it happened here, it could happen anywhere.\"\nTedrick said he and his wife were watching television and did not hear any shots. They did, however, hear police sirens.\n\"Police were all over the place,\" he said."}