{"uri": "http://www.chron.com/neighborhood/fortbend/news/article/friend-says-mother-shot-daughters-mental-hospitals-8330131.php", "title": "Graphic 911 calls capture the moments before Fort Bend mom killed daughters", "dct": "Tue, 28 Jun 2016 00:00:00 GMT", "id": "fddd8f0ac06aa3adc24d710b27d995eb", "content": "A graphic 911 call detailed the violent eruption of a Fort Bend County family just minutes before the mother and her two daughters lay fatally wounded in the street.\n\"Please forgive me, I'm sorry,\" a voice can be heard saying on a call that the Fort Bend County Sheriff's Office said was placed by daughter Madison Sheats, 17.\n\"Please don't shoot, I'm sorry.\"\n\"Please don't point that gun at us.\"\nThen husband, Jason Sheats, can be heard saying, \"I promise you, whatever you want, I'll ...\" before the call drops off.\nThe mother, Christy Byrd Sheats, 42, opened fire on her children Friday after calling a family meeting. She chased the girls out of the house into the street, and then stood over them trying to fire more bullets.\nShe went back into the house to reload, then fired another shot into the back of one of the girls, according to another 911 call by a neighbor who witnessed the shootings.\nDaughters, Taylor, 22, and Madison, died of gunshot wounds. Christy Sheats was shot and killed by law enforcement officers who arrived at the scene as she was firing the final shot.\nA family friend, Madison Davey, 21, said Tuesday she knew the mother had a history of mental illness, and had been \"in and out of mental hospitals.\"\n\"I do want people to know the truth, and everybody is like 'What is Christy's motive?'\" Davey said. \"Christy did not have a motive. Christy was not mentally stable, and mental illness is a serious issue.\"\nFort Bend County sheriff's officials also confirmed Monday that they had received several mental health-related calls for help over the past four years at the family's residence.\nThree of the phone calls the sheriff's office responded to in the past were suicide attempts, although the Sheriff's Office would not confirm who the calls concerned.\nREAD MORE: Police say family argument caused mother to shoot, kill daughters\nChristy and her husband, Jason, 45 — who was also targeted by his wife in the shooting but was unharmed — had been separated in the past, Davey said. The two never divorced.\n\"I know that Jason and Christy were fighting about several different issues but I'm not sure what the final thing was that made her snap,\" she said.\nDavey also said Christy never liked people coming over to the house while she was around.\nTaylor was a student at Lone Star College-Cy Fair and was engaged to be married on Monday. Madison was an incoming senior at Seven Lakes High School, Katy Independent School District officials confirmed.\nDavey shared memories of her friend Taylor as a passionate and talented artist who was thinking of pursuing a career in teaching.\n\"The thing I enjoyed most about Taylor was her attitude towards life,\" Davey said. \"Taylor never complained. She was always laughing and smiling.\""}