{"uri": "http://www.nydailynews.com/new-york/yonkers-police-investigate-4-year-old-girl-shot-article-1.2236586", "title": "Yonkers police search for answers on how 4-year-old girl shot herself in the face", "dct": "Wed, 27 May 2015 11:10:08 GMT", "id": "7bd56f6d851487dda3f187d41062e1d4", "content": "Police in Yonkers are investigating how a 4-year-old girl who apparently shot herself in the face Monday night got a hold of the gun.\nThe girl, identified by family friends as Makayla Manners, was in critical condition Tuesday at Jacobi Medical Center in the Bronx, where tension among family members was running high.\n“This is a life-and-death matter. I have to be strong for you. That’s your daughter, that’s my granddaughter,” an older man yelled at his son outside the hospital.\nMakayla’s father shot back, “They can’t make me walk upstairs and say goodbye to my first daughter. I didn’t come out here to say goodbye.”\nOthers also started arguing, and police were eventually called to calm the group of about 15 relatives.\nThere was still confusion about what exactly happened to the little girl.\nCops said they believe Makayla accidentally shot herself in a second-floor apartment shortly after 10:30 p.m.\nUpstairs neighbor Christyl Banks said she “saw people arguing outside” before hearing the crack of a gunshot. Then, she said, “I heard people screaming and running inside. It was surprising.”\nAnother neighbor told the Daily News on Monday that the girl’s mother, identified by friends as Tantania Manners, was outside talking to friends on Walnut St. The girl’s aunt was in the apartment with Makayla, according to the neighbor.\nPolice said they found a semiautomatic handgun inside the apartment, and they’re “investigating the origin of the weapon.”\nThe mom, 22, could not be reached for comment.\nOn her Facebook page, she lists her occupation as “Full-time mommy :).”\nThe page is filled with pictures of her adorable daughter, including one photo of Makayla in what appears to be a Catholic school uniform.\nIn others, she’s mugging for the camera with her mom, and in one, she’s cradling a cat. “Mother Makayla,” the caption said.\nTo view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nThe girl’s prognosis is unclear. A family friend told The News on Monday night that she was “very responsive” after the shooting.\n“She was squeezing my hand and I was talking to her. She had one eye open,” said the friend, a neighbor who declined to give her name.\n“She is a brilliant little girl,” she added.\nOutside of the hospital Tuesday, the girl’s grandfather admitted to family friends that he was having problems following his own advice and staying strong.\n“I’m fine when I’m here but I can’t see her. I can’t see her like that,” he said.\nNo charges have been filed in the case.\nYonkers police said the investigation “is active and ongoing,” and they ask anyone with information to contact the Detective Division at (914) 377-7724.\nAll calls will be kept confidential."}