{"uri": "http://www.cleveland.com/metro/index.ssf/2015/09/5-year-old_boy_dead_after_driv.html#incart_2box_news_index.ssf", "title": "5-year-old boy dead after drive-by shooting on Cleveland's East Side", "dct": "Sat, 05 Sep 2015 15:11:44 GMT", "id": "510688c2e15aa268c60316c1c9934138", "content": "CLEVELAND, Ohio -- A 5-year-old boy has died after being shot in the chest in a drive-by shooting on Cleveland's East Side Friday.\nThe boy has been identified by the Cuyahoga County Medical Examiner's Office as Ramon D. Burnett.\nRamon was playing outside about 5 p.m. Friday on the 2300 block of Louise Harris Drive, off Central Avenue, when he was shot in chest in an apparent drive-by shooting, Cleveland police spokeswoman Det. Jennifer Ciaccia said.\nHe was taken to MetroHealth Medical Center by paramedics, where he died, Cleveland Police Chief Calvin Williams said.\nRamon is the third child shot in a drive-by shooting this week. About 8 p.m. Tuesday, two children, a 13-year-old and a 15-year-old, were shot at the corner of East 117th Street and St. Clair Avenue following a possible dispute over a dirt bike.\nDuring their initial investigation of Friday's shooting, Cleveland police detained two males who are currently being questioned to determine their role in the incident, Ciaccia said.\nPolice initially said they were looking for a dark blue or gray Pontiac G6 that may have been the vehicle from which shots were fired.\nResidents gathered together at the corner of Bohn Road and Louise Harris Drive, while officers questioned family and residents of the homes closest to the scene. Some family members who arrived on scene were visibly distraught but were not allowed to cross the police tape to be with their loved ones.\nMayor Frank Jackson was among city officials at the scene Friday. He said he was leaving City Hall when he heard about the shooting, which occurred streets away from where he lives. Jackson said he was fearful because his grandchildren often play with friends in the neighborhood where the shooting occurred.\nJackson said he hopes for peace in the Labor Day holiday weekend ahead.\nCleveland Councilwoman Phyllis Cleveland was at the scene as well, calling the fatal shooting a \"damn shame.\"\nMembers of the local activist group Black Man Army were on the scene, encouraging the community to come together to prevent further violence.\n\"Police can only do so much. The rest is up to us,\" an activist said."}