{"uri": "http://baltimore.cbslocal.com/2014/11/04/toddler-playing-with-a-shotgun-accidentally-shoots-3-year-old/#.VFk2RNI01lw.facebook", "title": "Toddler Playing With A Shotgun Accidentally Shoots 3-Year-Old", "dct": "Tue, 04 Nov 2014 17:20:00 GMT", "id": "67471d63c39037722260feb86ae46dc4", "content": "BALTIMORE (WJZ) — A three-year-old was rushed to the hospital with a gunshot wound to the leg and another child pulled the trigger.\nRochelle Ritchie reports now the state’s attorney’s office will decide if charges should be filed.\nBaltimore city police say the child’s playmate, another toddler, pulled the trigger and accidentally shot the boy in the leg.\nA single gunshot rang out on the 44-hundred block of Lucy Pen Road. Monday night, police say a three-year-old boy was found shot.\n“Anytime there is an incident involving children, that raises everyone’s level of concern,” said Lt. Eric Kowalczyk.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nBaltimore City police detectives were able to determine the shooting happened in one of the bedrooms. Police say the children were playing with a gun when another toddler pulled the trigger, shooting the boy in the leg.\nNeighbors say they were stunned to learn the gunman was another child.\n“I was thinking, `How could he get a gun at three years old?’ What was going on that somebody would leave a gun unprotected like that?'” said neighbor Anna Murphy.\nThe child was taken to a nearby hospital and treated for his injury.\nPolice are calling the shooting an accident that could have been prevented if gun safety rules were followed.\n“It highlights the fact of how important firearms safety really is. We ask people to keep firearms in a secured lock location and separate from the ammunition,” said Kowalczyk.\nPolice are currently working with the state’s attorney’s office to determine if any charges will be filed.\nPolice are not saying who the gun belonged to.\nOther Local News:"}