{"uri": "http://www.tbreporter.com/crime/pinellas-sheriff-arrests-teen-16-accidental-shooting/", "title": "Pinellas Sheriff Arrests Teen, 16, after Accidental Shooting", "dct": "Sun, 18 Dec 2016 00:00:00 GMT", "id": "0f50c71d8a0bae9648bb4d1424f6de1b", "content": "The victim, 17, at first claimed he was injured in a drive-by shooting, Pinellas deputies say.\nPINELLAS COUNTY – Sheriff’s deputies arrested a teenager Saturday (Dec. 17) after he accidentally shot a friend with a handgun.\nBrandon J. LaBoy, 16, of 7949 50th Ave. N in unincorporated Pinellas, was charged with one count each of delinquent in possession of a firearm, delinquent in possession of ammunition, culpable negligence and felony violation of probation.\nDeputies said they were called to 7949 50th Ave. N about 11:40 a.m. after a 17 year old reported being shot in the ankle. The victim, whose name is being withheld because of his age, told deputies he was walking near the intersection of 50th Avenue and 80th Street North when an unidentified black male in a vehicle, drove by and shot him in the ankle. The victim told deputies he walked to his friend’s house and his friend called 911.\nParamedics responded to the scene and took the victim to Bayfront Medical Center for non-life threatening injuries. Deputies said they re-interviewed the victim at the hospital and determined that he had accidentally been shot by his friend, LaBoy, at LaBoy’s home.\nDeputies interviewed LaBoy at the Sheriff’s Administration Building. They said he first denied any involvement, but later told detectives that he was showing the handgun to the victim when the\ngun accidentally discharged and shot the victim in the ankle.\nDetectives found both the .45 caliber handgun involved in the shooting and a second gun at Laboy’s residence.\nFor information about the Pinellas sheriff, go to pcsoweb.com.\nPinellas Sheriff | Teen Arrested | Accidental Shooting | Arrests | TB Reporter\n#PinellasSheriff #TeenArrested #AccidentalShooting #Arrests #TBReporter"}