{"uri": "http://www.wbaltv.com/news/woman-boy-fatally-shot-in-head-in-southwest-baltimore/33263598", "title": "Mother, boy fatally shot in head in southwest Baltimore", "dct": "Fri, 29 May 2015 22:12:00 GMT", "id": "30d4dfe42f82128ad88ee9078977cb9e", "content": "BALTIMORE —\nA mother and son were found fatally shot Thursday morning in southwest Baltimore.\nCity police said officers were called around 8:19 a.m. to the 100 block of Upmanor Road, where a 31-year-old woman and a 7-year-old boy had been shot in the head.\n\"This person is an absolute coward to shoot a child in the head and snatch his life away from him. We definitely need the community's help to get him taken off the street,\" Baltimore police Sgt. Jarron Jackson said.\nFamily members identified the victims to 11 News as Jennifer Jeffrey Browne and Kester \"Tony\" Browne III.\nOvercome by grief, wondering who killed them and why, family and friends rushed to the scene.\n\"That was my godson. Whoever did it, I hope they find him. It's somebody that doesn't have no heart,\" said Seamea Cammue, Kester's godfather.\nA relative told 11 News Jennifer Browne has lived in the house for five years and just got married a month ago to her child's father, Kester Browne, who is currently serving a 12-year prison sentence on felony assault and gun charges. He said his son was born the day after his arrest.\nA relative said the boy attended the Baltimore International Academy and was learning Chinese.\nThe relative told 11 News that she last spoke to Jennifer Browne on Wednesday morning. When she didn't get a response to a text message that afternoon, she just thought Jennifer Browne was busy.\nThe relative also told 11 News that a neighbor called Thursday morning, saying something didn't seem right. It was Jennifer Browne's brother who went into the house and found her on the dining room floor. Her son was located in a second-floor bedroom.\n\"So much has been going on here in Baltimore. I don't know what to think anymore. It's just heartbreaking, especially when it involves children,\" neighbor Rella Scott said.\n\"Every loss of life is tragic, none more so than when we have such a young life that is taken away. This woman and this child did not deserve to have this happen. This is a truly tragic incident, and I'm begging and pleading for anyone that may have any small bit of information to please call us. They can call 911. They can call our homicide section at 410-396-2100. They can always remain anonymous. Why I'm begging so much is because we need to solve this case. There is no other time than right now when we need to come together as a city, as a Police Department, as a community as a whole and find justice for this young man who lost his life and this young woman,\" Jackson said.\nPolice have not released many details about their investigation.\n\"It was early in the morning. We know people were outside. We know people were going to work. We know someone must have seen or heard something. No matter how small or how minute you think it is, please call us with that information, it may be the key piece of information that can help us bring closure to this case,\" Jackson said.\n\"I'm called upon, the community is called upon, the police is called upon to do even more to get this under control. We can't afford to lose another young life, another life at all in our city, but it will take all of us coming together,\" Baltimore Mayor Stephanie Rawlings-Blake said.\nAnyone with information about the shootings is asked to call police at 410-396-2100."}