{"uri": "http://6abc.com/news/suspect-arrested-in-fatal-shooting-of-3-year-old/234850/", "title": "Suspected gunman arrested in fatal shooting of 3-year-old", "dct": "Mon, 04 Aug 2014 00:00:00 GMT", "id": "92941115fbc0a7272ce11ece0c563410", "content": "GRAYS FERRY (WPVI) --\nPolice have arrested the suspect wanted in the fatal shooting of a 3-year-old girl in Philadelphia's Grays Ferry section.\nU.S. Marshals arrested 22-year-old Brandon Ruffin without incident Monday night on the 5600 block of Lloyd Street.\nRuffin's last known address was in the 2300 block of Wharton Street in South Philadelphia.\nDetectives believe Ruffin was the gunman who took the life of 3-year-old Tynirah Borum.\nRuffin's alleged accomplice, 22-year-old Douglas Woods, is in custody and has been charged with murder, three counts of attempted murder, aggravated assault and related offenses.\nHe was arraigned early Sunday morning and held without bail.\nThe shooting happened around 9:40 p.m. Friday in the 1500 block of South Etting Street.\nTynirah Borum was among the three bystanders shot when the gunfire broke out. She was struck in the chest and rushed to Children's Hospital of Philadelphia where she was pronounced dead.\n\"I heard gunshots and I ran from down the street to come around the corner. I was asking everybody where my baby was at. Nobody said nothing then somebody came over to me and said she got hit,\" said her mother, Tamika Borum.\n\"Beautiful, just full of life. Loved everybody around the neighborhood. Was just a gift from God,\" said Borum.\nPolice say Ruffin and Woods rode up on a bike and got into a confrontation with a 24-year-old-man.\nOne of the suspects, believed to be Ruffin, allegedly pulled out a gun and opened fire on the 24-year-old, who was shot in the head. He was rushed to the Hospital of the University of Pennsylvania in critical condition and underwent surgery on Saturday.\nWhen the bullets went flying, three innocent bystanders - little Tynirah and two adults - were also hit.\nOne of the victims hit was 28-year-old Sherita Dickens, who was braiding Tynirah's hair on a porch when shots rang out.\n\"This was my first time doing her hair,\" said Dickens.\nDickens was also shot in the arm and a 21-year-old man was shot in the leg."}