{"uri": "http://www.wpxi.com/news/news/local/3-shot-1-dead-west-end-shooting/nnK5P/", "title": "4 men shot while playing dice; 19-year-old killed", "dct": "Sun, 16 Aug 2015 16:30:00 GMT", "id": "9861e68c8363c60b3e89f2119af2088c", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nPITTSBURGH - Authorities continue investigating after shots fired at a group of men playing dice left one dead and three others injured Saturday night in Pittsburgh’s Fairywood neighborhood.\nThe shooting happened about 10 p.m. in the 400 block of West Prospect Avenue, killing 19-year-old Kason Barnes, of Chartiers City, according to the medical examiner.\nStories of the day...\nPolice spokeswoman Sonya Toler said the four men were outside when two vehicles drove down the street. At least two people got out of the vehicles, a gold minivan and a silver car, and fired multiple shots.\nBarnes was shot in the head and left shoulder, Toler said. He was pronounced dead at the scene.\nA 22-year-old man from Fairywood suffered a minor gunshot wound to a hand.\nTwo other men, both 20 years old, were taken to area hospitals by private means, Toler said. One, from the Hill District, was shot in the legs and side; the other, from Sheraden, had a minor gunshot wound to his leg.\nThe surviving victims were all last listed in stable condition, according to Toler.\n“Everything was quiet for quite a long time,” Christine Carioto said. “All of us neighbors are nice. We keep to ourselves and help each other out as much as we can.”\nFriends and family held a memorial for Barnes Sunday evening.\n“It seems like, just within the year, it seemed like things started picking up and getting worse,” Carioto said.\nHomicide detectives continue to investigate.\n“It’s scary knowing that that’s right down the street and you can’t let your child out to enjoy the weather because he might be caught in the crossfire,” Carioto said.\nAnyone with information on the shooting is urged to contact police."}