{"uri": "http://www.columbiatribune.com/news/crime/police-release-name-of-alleged-shooter-in-wednesday-slaying/article_ae530d98-826f-5cae-9ef6-ee6dfe656430.html", "title": "Columbia police credit cooperation in identifying shooting suspect", "dct": "Fri, 29 Jul 2016 00:00:00 GMT", "id": "2dc92c9b096b80f52d94286b7e6959aa", "content": "Columbia police credit assistance from witnesses and the public for quickly solving the city’s latest homicide, but investigators are asking for more help in finding the suspected shooter.\nWithin 24 hours of the fatal shooting Wednesday evening of Marquez Reed, 17, police had arrested an 18-year-old man accused of being an accomplice and had identified a suspected gunman. Tyrone James Jr., 18, of Columbia is wanted on a warrant for second-degree murder and armed criminal action. Charges were filed against James on Thursday, and his bond was set at $1 million, cash-only. Police sent out his picture in a news release and warned people not to confront him, calling him armed and dangerous. He also is listed in court records as Tyrone James III.\nAuthorities have said James shot Reed from a stationary vehicle during an argument.\nPolice served three search warrants related to the investigation, at 105 Park Ave., 2613 Quail Drive and 4200 W. Bethany Drive, according to a news release. Columbia Police Department Assistant Chief Jeremiah Hunter on Friday said investigators recovered a handgun and a black Volkswagen. Hunter declined to say where the gun or car was found.\nSeveral people have cooperated with investigators, he said, leading to police identifying all three people in the car at the time Reed was shot, including James and the suspected driver, Jadarius C. Sanders.\n“In this instance, the community really solved this,” Hunter said.\nSanders is being held at the Boone County Jail on a $100,000, cash-only bond on charges of hindering prosecution and tampering with physical evidence. Sanders was arrested at 6:06 a.m. Thursday at the Columbia Police Department, 600 E. Walnut St.\nSanders told Detective Joe Jackson he had been driving the car at the time of the incident, about 7:50 p.m. Wednesday near La Salle Place and Allen Street, according to a probable cause statement. After he heard the gunshots, Sanders said, he saw James, who was in the front passenger seat, place an item into his backpack and heard James tell someone on the phone that he had shot someone, the statement said. A passenger in the back seat of the car volunteered to help James dispose of the gun, Jackson wrote, and to take them to his house, 4200 W. Bethany Drive.\nReed was found near the shooting scene with a gunshot wound and was pronounced dead at a hospital.\nAfter the shooting, James first tried to meet up with a woman who said she didn’t want to place herself or her kids in danger, Jackson wrote. James then decided to go to his aunt’s house in northeast Columbia.\nReed, who several people have said went by the nickname “Li’l Lucky,” is Columbia’s third homicide victim in 2016.\nHunter said police are speaking with James’ friends and family to get him to surrender. It was too early to tell whether more people will be arrested and charged, he said.\n“There’s always a lot of work to continue doing, so I can’t say one way or another as we keep talking to people and finish the investigation,” Hunter said.\nThe department’s Forensic Evidence Team still was processing the Volkswagen for evidence Friday morning and will send anything of value to the Missouri State Highway Patrol Crime Lab in Jefferson City, as well as the gun. It could take several months for the gun to be processed at the lab and confirmed as the gun used to shoot Reed, Hunter said.\nThe slaying happened nine days after James was released from the Boone County Jail after posting a $25,000 bond on charges of first-degree attempted robbery and armed criminal action. He is suspected of being the driver in an armed robbery in south Columbia in April.\nNeither Sanders nor James had an attorney listed in online court records. Sanders was scheduled to make his first court appearance at 1:30 p.m. Friday."}