{"uri": "http://www.syracuse.com/crime/index.ssf/2016/11/syracuse_veteran_murdered_26-year-old_with_legal_handgun_in_armory_square_police.html", "title": "Syracuse veteran murdered 26-year-old with legal handgun in Armory Square, police say", "dct": "Fri, 25 Nov 2016 21:17:01 GMT", "id": "670cd47fbe4b8b70257818846384d82f", "content": "SYRACUSE, N.Y. -- A Syracuse military veteran was arrested in the murder of a 26-year-old man in Armory Square Thanksgiving morning, police said.\nPolice have identified the victim in the early morning shooting as Jonathan Diaz of Onondaga. Diaz was shot in the chest and killed around 1 a.m. in the 100 block of Walton Street, police said. AMR Ambulance transported the victim to Upstate University Hospital, where he died of his injuries.\nPolice arrested Sangsouriyanh Maniphonh, of 351 S. Collingwood Ave., in connection with the homicide. Maniphonh, 28, was charged with felony second-degree murder, which carries up to 25 years to life in prison.\nManiphonh is being held at the Onondaga County Justice Center without bail.\nThe victim and suspect in this morning's shooting were among the hundreds of holiday revelers who patronized Armory Square bars on the eve of Thanksgiving, Chief Frank Fowler announced at a press conference.\nFowler provided the following account of the Thanksgiving morning incident:\nDiaz and Maniphonh were at The Bar, also known as Corner Bar, at 400 S. Clinton St. early Thanksgiving morning. The two men were familiar with one another, Fowler said, but police are continuing to investigate their history.\nDiaz and Maniphonh got into a verbal argument that became physical while inside The Bar. Bar employees broke up the fight and escorted both men outside from different doors.\nThe men re-engaged with each other outside on the street. Maniphonh was in possession of a licensed handgun, which he fired twice when the fight turned physical, Fowler said.\nSyracuse police officers working an Armory Square detail, a typical security measure on weekend and busy nights downtown, heard shots fired and immediately responded to the fight.\nThey found Diaz suffering from at least one gunshot wound to his chest, Fowler said.\nManiphonh suffered a self-inflicted wound to his hand, which Fowler said was believed to be accidental. Maniphonh was immediately taken into custody by police. He did not resist, Fowler said.\nHe was treated for an injury at Upstate University Hospital before being lodged at the Justice Center. His weapon was recovered by police.\nDiaz was pronounced dead around 1:30 a.m. at Upstate University Hospital.\nFowler said police are continuing to investigate whether the men were intoxicated.\nHe said neither man has a history of violence or gang affiliation. He noted that the suspect is a military veteran.\nFowler said police would look into a history of alcohol and violence-related incidents that have occurred at or in relation to The Bar, but did not place blame for the dispute on the business.\nFowler was critical of gun owners who bring their weapons into bars where alcohol is served.\n\"I think the onus is on the gun owner,\" Fowler said. \"I'm in no way faulting The Bar on this. I'm saying to you, legal or illegal, no one should bring a weapon into a bar. What is the point of that?\"\nReporter Julie McMahon covers Syracuse University and Syracuse city schools. She can be reached anytime: Email | Twitter | 315-412-1992"}