{"uri": "http://www.dispatch.com/content/stories/local/2015/12/03/Three-year-old-shoots-self.html", "title": "Three-year-old stable after shooting self at South Side home", "dct": "Sat, 28 Jan 2017 20:49:28 GMT", "id": "b61dc894ecb6a941a63eda2c4e85d89c", "content": "A 3-year-old boy was hospitalized on Thursday after accidentally shooting himself with a gun in his South Side home. The shooting occurred just before 3 p.m. at a home in the 700 block of Kelton Avenue south of I-70, according to Sgt. Rich Weiner, spokesman for the Columbus Police Division.\nA 3-year-old boy was hospitalized on Thursday after accidentally shooting himself with a gun in his South Side home.\nThe shooting occurred just before 3 p.m. at a home in the 700 block of Kelton Avenue south of I-70, according to Sgt. Rich Weiner, spokesman for the Columbus Police Division.\nThe boy was taken with a gunshot wound in his abdomen to Nationwide Children's Hospital, where he initially was said to be in critical condition but was upgraded to stable condition after surgery.\nPolice would not release the name of the child on Thursday night.\nThe boy was home with his mother, whose name they also wouldn't release, when he apparently shot himself in an upstairs bedroom. The mother was in another part of the house when the shooting occurred and possibly asleep, said Sgt. Loucious Hollis of the assault squad.\nDetectives were planning to question the mother on Thursday night and had obtained a search warrant for the house. They didn't say who owned the gun. No charges had been filed as of Thursday evening.\nWhen police arrived, they found the boy and mother in a neighbor's car, about to leave for the hospital. The neighbor had come home and heard screaming inside the child's home.\nShe ran inside and found the injured boy and was going to take him to the hospital with the mother. Police and paramedics arrived as they were about to leave because someone else had called 911.\nDispatch Reporter Jim Woods contributed to this story."}