{"uri": "http://www.oregonlive.com/pacific-northwest-news/index.ssf/2016/02/rural_washington_state_shootin.html", "title": "Washington state gunman kills 4, himself after standoff", "dct": "Sat, 27 Feb 2016 13:32:19 GMT", "id": "b7b0b531d0d68d13752adcfb46e3f389", "content": "Updated at 6:39 p.m.\nBELFAIR, Wash. -- A man who killed four people in rural Washington state called an officer he previously encountered to say he shot his family, leading to an hourslong standoff at a home Friday that ended with his suicide, authorities said.\nA 12-year-old girl related to the victims survived and was taken to the hospital for an evaluation, Mason County sheriff's Chief Deputy Ryan Spurling said.\n\"Apparently she's OK,\" Spurling said. \"I don't know if this is a daughter, or step-daughter, or what the relationship is, but she escaped from the house.\"\nThe officer who took the shooter's call went to the home across Puget Sound from Seattle with another deputy. Authorities negotiated with the man for about three hours before SWAT members entered the house in a heavily wooded area and found the bodies.\nThe gunman \"apparently came outside the home and shot himself,\" Sheriff Casey Salisbury said. \"It's a terrible tragedy.\"\nNeither the gunman nor his four victims have been identified. Authorities did not detail the previous interaction between the shooter and the officer he called.\nJack Pigott, who lives down the road, said he heard gunshots Thursday night but none Friday.\nThe couple who lived in the house about 25 miles southwest of Seattle were in their 40s and had been married for four or five years, Pigott said. The wife had two teenage sons who were adopted from Russia during a previous marriage. She also had a daughter who was adopted from China.\nPigott said the husband had a heating and air conditioning contractor business. He had recently been hospitalized, Pigott said, but he didn't know why. When he returned home, he was on a lot of medications, Pigott said of the man.\nIt was common for the family to do shooting practice, Pigott said, and that's what he thought of when he heard the gunfire.\n\"I was getting a load of wood into the house, and I hear some gunshots,\" he said. \"Four or five, a pause and then another round.\"\nPigott said residents know each other in the area that has homes with large lots with room for horses.\n\"It's actually really scary because when you live out like this, you want to feel like your neighbors are someone you can rely on, not somebody you have to be afraid of because we are out in a secluded area,\" said another neighbor, Lynn Johnson.\nThe SWAT members went in around 12:30 p.m., Spurling said. Officers said they had 11 buildings to clear on the property but reported they had found the bodies shortly after entering the first building.\nThe shooting comes two days after an Arizona man killed his parents and two sisters before he was fatally shot by police. It also follows a mass shooting Thursday involving a Kansas factory worker who killed three people and wounded 11 before he was killed, and one last week in Kalamazoo, Michigan, that left seven people dead.\n-- The Associated Press"}