{"uri": "http://www.seattletimes.com/seattle-news/crime/officials-investigating-mans-claim-he-shot-4-people-in-belfair/?utm_source=RSS#038;utm_medium=Referral&#038;utm_campaign=RSS_seattle-news", "title": "Family shot to death in Mason County ID’d by coroner", "dct": "Sat, 27 Feb 2016 20:22:00 GMT", "id": "f62e18e72b6bbd5e860cfc00ec3d44fb", "content": "The Mason County coroner’s office released the names of the family members, including a mother and her two sons, killed in the shooting at a residence in Belfair. The name of the fourth victim, a neighbor, has not been released.\nBELFAIR, Mason County — Authorities say they used tear gas to flush a suicidal man who had killed several family members from his house — and that’s when he stepped outside and killed himself.\nThe Mason County Sheriff’s Office on Saturday released a timeline of the standoff, which began after David W. Campbell, 51, called a sheriff’s office supervisor Friday morning to say he had done something bad and was suicidal.\nA small number of deputies initially responded, speaking with Campbell by phone and setting up a perimeter to keep him on the property until a SWAT team could arrive.\nOver 3½ hours, trained negotiators tried to persuade Campbell to surrender, but “it became evident that the suspect was not going to leave the residence voluntarily,” the sheriff’s office said. Deputies could see him pacing inside, often holding a handgun to his head.\nWhen they deployed tear gas in the house, Campbell came outside with a gun in his hand and yelled at police. He then returned indoors before coming out once more, putting the gun to his temple and firing as the police watched.\nAuthorities said they found four other bodies in a chicken coop on the remote, wooded property on Horseshoe Drive, near Belfair.\nMason County Coroner Wes Stockwell released the identities of three of them Saturday: Campbell’s wife of six years, Lana J. Carlson, 49, and her sons, Quinn and Tory Carlson, who were 16 and 18, respectively.\nStockwell said he was withholding the identity of the fourth victim pending notification of relatives.\nWhen deputies first contacted Campbell, a 12-year-old girl fled from the home, the timeline said. Authorities said she wasn’t shot, but they used a military-surplus armored vehicle to pick her up and bring her safely past the home so she could be evaluated by medical personnel.\n“I don’t know if this is a daughter, or stepdaughter, or what the relationship is,” Chief Deputy Ryan Spurling said. “But she escaped from the house.”\nJack Pigott, who lives down the road, said it was common for the family to practice shooting. When he heard gunfire about 8:15 p.m. Thursday, that’s what he assumed it was.\n“The gunshots, I figured, was target practice. I never thought more about it,” Pigott said.\nCarlson’s sons and a daughter were adopted during a previous marriage. Her husband died of cancer, he said.\nCampbell ran a business called Campbell Family Heating and Air Conditioning, according to state records, while Carlson — who also went by Lana Jane Campbell — had registered a business called Crispy Edges. She had purchased a food truck, and she and Campbell had been working on the truck but had not been able to secure the county permits needed to operate it, Pigott said.\nHe said Campbell had recently been hospitalized, but he didn’t know why.\nAnother family friendsaid Friday she had seen the family the night before and didn’t see that anything was wrong.\nPlay Video\nPlay\nMute\nCurrent Time 0:00\n/\nDuration Time 0:00\nLoaded: 0%\nProgress: 0%\nStream TypeLIVE\nRemaining Time -0:00\nPlayback Rate\n1\nChapters\nChapters\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptions\nFullscreen\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done\nMason County Sheriff's Office Chief Ryan Spurling speaks Friday afternoon near the property where a man claimed to have shot four people. All five are dead\nCampbell “loved his family, he did everything for them,” said Adeline Peebles, as she sat in her car Friday on Horseshoe Drive.\n“I can’t believe this happened,” she said.\nPeebles, whose husband had worked with Campbell, said the two families were so close they spent holidays together, sometimes birthdays.\nShe described Tory as “the best kid” and a “hard worker.”\nTory was a culinary arts student at Bremerton’s Olympic College, according to a spokesman for the school.\nAs Lana Carlson talked about opening the food truck, Peebles said, “We’d just sit here and eat all the little things she was trying out.”"}