{"uri": "http://www.moultrieobserver.com/news/jury-says-not-guilty/article_013dc4e6-6ad4-11e4-a86b-ef334c46f871.html", "title": "Jury says ‘not guilty’", "dct": "Wed, 12 Nov 2014 00:00:00 GMT", "id": "176c8426a13968fddba06f16573b1351", "content": "MOULTRIE — A Colquitt County jury took less than an hour on Wednesday to return not-guilty verdicts on 16 separate counts in a 2013 murder case.\nSuperior Court Judge James E. Hardy ordered the release of Antonio Dewayne Williams following a two-day trial in which a co-defendant reneged on a plea deal that called for him to testify.\nWilliams, 25, had been indicted in an 18-count indictment that included two counts each of felony murder and malice murder. Two of the lesser counts were dismissed for technical reasons before the case went to trial.\nWilliams was accused of taking part in the murders of 50-year-old James L. Key and Key’s nephew Eric Debruce, 42, by driving the shooter to and from the scene.\nHenry Lee, who attended the trial with his wife Lola, said it was tough to see a man who was involved in his step-son’s and brother-in-law’s slayings walk out of court.\n“I’m not going to judge him,” said Lola Lee, mother of Debruce and Key’s sister. “I’m going to let God judge him.”\nWilliams was the final witness, testifying in his own behalf. He told jurors that he was not aware that Derek Lamar Rushing, who pleaded guilty in the case in August, planned a mass shooting that night in northwest Moultrie.\nHe said that he gave co-defendant Derek Lamar Rushing a ride in his girlfriend’s Chevrolet Tahoe. Over a period of about an hour he drove Rushing to his residence, where he said someone handed Rushing an AK-47 assault rifle, then to a Fourth Court Northwest residence and later to the 200 block of Second Street Northwest.\nAfter parking in a driveway where Rushing directed him, Williams said, he waited while Rushing got out of the car with the gun. Rushing returned to the car after the gunfire and Williams dropped him off with the gun at Rushing’s residence.\nRushing, the alleged triggerman, earlier pleaded guilty to two counts of involuntary manslaughter in the case. Superior Court Judge Harry J. Altman II sentenced him to a 20-year prison sentence on one count and withheld sentencing until the disposition of Williams’ case.\nAs a condition of the plea agreement, Rushing had agreed to testify if Williams went to trial.\nProsecutors had argued that Williams was a willing participant March 3, 2013, shooting at 224 Second St. N.W., in which Key, was pronounced dead at the scene. Debruce died on March 20.\nMargaret White-Tuff and Elijah Daniels, who were also at the residence, also were struck by some of the 32 bullets law enforcement said were fired that night. Bullets also punctured the walls of a house next door, with several passing completely through concrete-block walls. One lodged in an oven after puncturing the walls.\nThe 12 jurors were not allowed to hear of a previous conviction of Williams on aggravated assault and gang charges.\nWilliams pleaded guilty in March 2011 to one count each of party to the crime of aggravated assault and violation of the Georgia Street Gang Terrorism and Prevention Act, according to Dougherty County court records. The indictment charged him with taking part with two other men in a Sept. 13, 2009, assault of another man with a pistol and doing so while associated with the Southside Bloods gang.\nWilliams was banished from Doughtery County as a condition of his sentence at that time.\nIn his closing statement, Quitman attorney Luke Mitchell, who represented Williams, questioned the motive given for his client’s involvement.\nOn Tuesday Patrick McCloud, 32, led to the witness stand in manacles and an orange jump suit, said that he had two run-ins with Williams in the weeks prior to the shooting. During the second incident, he told jurors, he punched Williams and pulled a gun.\nThat incident occurred at the same Fourth Court Northwest residence where Williams said he took Rushing prior to the shooting.\nMitchell suggested that March 1 incident between one of Rushing’s brothers and another man known to hang out in the 200 block of Second Street precipitated the shooting.\n“It’s a hard feeling to swallow,” Henry Lee said during an interview a short time after the trial. “That’s a hard pill to swallow, especially when he admitted being there, having the gun in the car, transporting the gun twice and then taking the gun back to that point (Rushing’s residence). Justice wasn’t done.”\nHe said that the suppression of Williams’ prior violent background to jurors and a lack of lesser charges that they could have considered gave the 10 women and two men only two choices. Jurors would have been more likely to convict Williams based on the available evidence -- which did not point to Williams planning the assault -- as being party to a crime, he said.\n“Just him driving the car, they either had to convict him on the (murder) charges or release him,” Henry Lee said.\nFor the victim’s family and Rushing the ordeal may not be over. With Rushing’s refusal to testify he is facing the same 18 felony counts on which he was indicted, including the four murder counts as well as five counts of aggravated assault and nine counts of possession of a firearm during the commission of a felony.\nIn cases where a co-defendant’s final sentencing depends on his testimony at trial, failing to do so is a deal-breaker, said Senior Superior Court Judge Loring A. Gray Jr. of Dougherty County, who discussed a hypothetical murder case, not the specific case at hand in Colquitt County.\n“The fact of the matter is, the deal will be off,” he said. “You’d be back to square one.\n“Once he fails to testify the original charges would (return) and he would again stand charged with murder.”"}