{"uri": "http://www.moultrieobserver.com/news/local_news/murder-trial-set-to-start-tuesday/article_e47c8fc4-2b2f-11e4-a7af-001a4bcf887a.html", "title": "Murder trial set to start Tuesday", "dct": "Sat, 23 Aug 2014 00:00:00 GMT", "id": "5ae53492bc0203e86e6cb60793bada7d", "content": "MOULTRIE — The trial of one of two men accused in a March 2013 drive-by shooting that claimed two lives and injured others is scheduled to begin on Tuesday.\nAntonio Dewayne Williams, 25, who is accused of driving the car used in the shooting that claimed the lives of James L. Key, 50, and his 42-year-old nephew Eric Debruce, is the first defendant scheduled in the case.\nDerek Lamar Rushing, 24, is the alleged triggerman in the shooting in which a group of people was sprayed by bullets as they were gathered around a fire in the front yard of 224 Second St. N.W. His trial is scheduled for later.\nHowever, in the event of a situation that changes the scenario — such as Williams entering a guilty plea — Rushing’s trial would start on Tuesday.\nThe Georgia Bureau of Investigation said in the days after the shooting that at least 30 bullets were fired at about 9:50 p.m. on March 3, 2013.\nKey was pronounced dead at the scene on March 3, while Debruce died March 20 due to complications from being shot multiple times. He was shot twice in the upper body and once in the leg, and part of the leg was amputated while he was hospitalized.\nMargaret White-Tuff and Elijah Daniels also were struck in the hail of bullets, several of which hit the house next door.\nAn indictment issued in the case charges both Williams and Rushing with two counts each of malice murder, two counts of felony murder, five counts of aggravated assault and nine counts of possession of a firearm during the commission of a felony.\nThe GBI has said that Rushing had an argument with someone earlier in the day, and that the shooting was intended to settle a score from that encounter. The intended victim apparently was one of Key’s relatives, who was not at the Second Street residence at the time of the shooting.\nIn addition to ironing out issues in the upcoming trial this week, Superior Court Judge Harry Jay Altman II handed down sentences to two unrelated defendants.\nPaul Lewis Strickland, 31, pleaded guilty to possession of cocaine and possession of marijuana. He was sentenced to three years in prison and seven years’ probation on the cocaine charge and ordered to pay a $2,000 fine. Lewis was also sentenced to a 10-year probation sentence on the marijuana charge that will run concurrent with the other sentence.\nAltman sentenced Zayvone Tyshaun Brown, 18, to eight years’ probation, $2,000 fine and community service on a plea to one count of felony burglary."}