{"uri": "http://www.cleveland.com/metro/index.ssf/2015/09/warrant_issued_for_man_accused_1.html", "title": "Warrant issued for man accused of fatally shooting 3-year-old boy in Cleveland", "dct": "Sun, 20 Sep 2015 20:20:38 GMT", "id": "0eccce79ee1b66abe965679d9a14d98c", "content": "CLEVELAND, Ohio -- Investigators have obtained an arrest warrant for a man accused of fatally shooting 3-year-old Major Howard in a drive-by shooting in Cleveland.\nThe warrant accuses Donnell \"Nell\" Lindsey, 22, of firing the shots that killed Major and wounded a woman about 7:15 p.m. Tuesday on East 113th Street near Union Avenue.\nLindsey remains at large.\nMajor, the woman and another man were sitting in a parked car when the shooting happened. A light-colored sedan pulled alongside their car, and someone inside the sedan opened fire, witnesses said.\nMajor was shot once in the chest and the 24-year-old woman was shot once in the thigh, police said.\nThe male driver, who was not injured, drove the victims to Cleveland Clinic. The victims were then flown to MetroHealth Medical Center, where the boy died.\nA rented Toyota that matched the description of the sedan was found torched early Wednesday in the 2900 block of East 104th Street. Investigators have not said whether the Toyota was the sedan involved in the drive-by shooting.\nMajor is the second child killed by gun violence in Cleveland in as many weeks. On Saturday, an emotional funeral for Ramon Burnett included a pastor's impassioned plea for an end to the violence that claimed the 5-year-old boy's life.\nMayor Frank Jackson decried the slayings at a Wednesday news conference.\nIn 2012, Lindsey pleaded guilty in Cuyahoga County Common Pleas Court to drug possession, attempted tampering with evidence and trafficking. He was sentenced to two years' probation, according to court records.\nSix months later Lindsey pleaded guilty in a separate case to having weapons while under disability. He was subsequently sentenced to two years in prison."}