{"uri": "http://www.cleveland19.com/story/30946656/arrest-made-in-death-of-three-year-old-major-howard", "title": "Arrest made in death of three-year-old Major Howard", "dct": "Tue, 12 Jan 2016 18:26:00 GMT", "id": "13a7a362a6649430b52dc70c5830522b", "content": "CLEVELAND, OH (WOIO) -\nAn arrest has been made in connection to the death of three-year-old Major Howard.\nAaron Dunnings, 23, was arrested Tuesday by the Northern Ohio Violent Fugitive Task Force.\nHe was arrested in the 700 block of East 90th Street in Cleveland. Dunnings was wanted in the Sept. 15, 2015 shooting death of the toddler.\nMajor was shot while sitting in a car on East 113th Street and later died following surgery at MetroHealth Medical Center. Rob'Dasha Smith, 24, Major's godmother, was shot in the leg, but survived.\nDunnings is currently in police custody. He will be booked on aggravated murder charges. He has a criminal history dating back to 2010 for trafficking and 2012 for carrying a concealed weapon and drug possession.\nPolice are still looking for Donnell Lindsey.\nAn arrest warrant was issued for Lindsey, a.k.a. Lionel, Lonell, or Nell.\nAccording to Cuyahoga County court records, Lindsey's criminal history dates back to the age of 18.\nIn May 2011, Lindsey was arrested and charged with possessing criminal tools, drug possession, trafficking and an attempt at tampering with case evidence.\nHe pleaded guilty to another trafficking offense in February 2012.\nLindsey's last known offense was in August 2012. He pleaded guilty to having weapons while under disability.\nLindsey is described as a 23-year-old black man standing approximately 6-feet tall and weighing 170 pounds. He has black hair and brown eyes. He is believed to be hiding on the east side of Cleveland.\nIf you have any information on the whereabouts of Lindsey, you're encouraged to call the Cleveland Police Homicide Unit at (216) 623-5464. You can also call the Northern Ohio Violent Fugitive Task Force at 1-866-4WANTED or text keyword \"WANTED\" with the tip to TIP411. Tipsters can remain anonymous and reward money is available.\nCopyright 2016 WOIO. All rights reserved."}