{"uri": "http://www.cleveland.com/metro/index.ssf/2015/10/recent_cleveland_killings_tied.html#incart_river", "title": "3 recent slayings, including death of Major Howard, tied to Cleveland street gang", "dct": "Sat, 03 Oct 2015 16:37:56 GMT", "id": "20095843561c5328bd6e4755d5b46a25", "content": "(Brandon Blackwell, Northeast Ohio Media Group)\nCLEVELAND, Ohio -- Investigators believe three recent Cleveland killings are tied to a street gang that law enforcement sources say is at war with a neighboring group on the city's East Side.\nCleveland homicide detectives believe the gang 103 MurdaBlock is behind the killings of 3-year-old Major Howard, 19-year-old Sidney Smith and 23-year-old Dexter Mangham, according to court records filed late Thursday.\nThe information was included in a request for high bond for Lejon Robinson, a 23-year-old man arrested Wednesday on weapons charges.\nIt is the first time investigators have formally linked Sunday's slayings to the gunfire that killed Major. It's also the first time that investigators have acknowledged the shootings are gang-related.\nCleveland Police Chief Calvin Williams said at a Friday press conference that Sunday's killings of Mangham on Euclid Avenue near East 4th Street and Smith on Way Avenue near East 100th Street near were connected. But he said investigators were still working to determine if Major's Sept. 15 death on East 113th Street near Union Avenue was tied to the other shootings.\nThe latest information was filed in court papers charging Robinson. He was arrested at East 105th Street and Hampden Avenue Wednesday, after he ran from narcotics detectives trying to question him, according to court records.\nThe detectives knew Robinson was a member of 103MurdaBlock, court records say.\nWhen police caught up with him, Robinson had a loaded 9mm pistol in his pants, according to court records. The pistol was reported stolen from Ashtabula County.\nRobinson is not charged in connection with any of the shootings.\nPolice Friday obtained arrest warrants for four men in connection to Mangham's killing. Each man is accused of having a handgun at the scene, but court records do not indicate who fired. Investigators found shell casings from two different handguns on Euclid Avenue, records say.\nIn an emotional moment, Williams called Smith an innocent victim caught up in a gang battle. Less than an hour after Mangham's death, a drive-by shooter fired shots into Smith's home killing the young woman as she sat on her family's couch.\n\"A young lady was killed in her living room because of what her brother was doing out there in the neighborhood and everybody in that family and that neighborhood knew this [and it] resulted in an innocent 19-year-old, sweet girl being killed,\" Williams said.\nAnd police and the U.S. Marshals continue to search for Donnell Lindsey, who is wanted in Major's death.\n103 MurdaBlock has been involved in a months-long feud with the Benham Boys, who claim to be affiliated with the Bloods, according to multiple law enforcement sources.\nOne self-described former member of Benham Boys, RJ, told Northeast Ohio Media Group he believed the bullet that struck Major was actually meant for him.\nRobinson and his brother were named in the police report filed after Smith's killing, but neither has been charged in the shooting.\nRobinson is being held on $100,000 bond.\nRobinson has past weapons and felonious assault convictions, according to court records."}