{"uri": "http://www.wpxi.com/news/2-teens-charged-as-adults-in-shooting-death-of-boy-16-in-aliquippa/453012507", "title": "Teenager identified as shooter in death of 16-year-old in Aliquippa turns himself in", "dct": "Wed, 05 Oct 2016 17:52:00 GMT", "id": "7b038748dd836c79f19f46c223158348", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nALIQUIPPA, Pa. - A 17-year-old identified by police as the person who fatally shot a 16-year-old last week in Aliquippa turned himself in Wednesday afternoon.\nLawrence Reddick Jr. is one of three teenagers charged as adults in connection with the death of William Cade Booher, of Beaver. Ronald Foster Jr. and Deontae Jones were already in police custody.\n“He has nothing to run from, nothing to hide. We want to see the complaint and face the charges,” Reddick’s attorney, Blaine Jones, said. “This is a young man that has never been in trouble before. He has no juvenile record. He has no record. Nothing. He was not selling any drugs like that. I hope the public will hold their judgment until the evidence comes out.”\nCharges against the three teens include criminal homicide, a charge that Channel 11’s Amy Marcinkiewicz reported Wednesday would be amended to double homicide for Reddick, who smiled at times while turning himself in.\nOn Tuesday, the body of a missing teenager who was driving the car in which Booher was fatally shot was found by a homeowner in Aliquippa, Marcinkiewicz reported.\nAuthorities identified the body as that of 18-year-old Dane Mathesius, who was found behind an abandoned home less than 500 feet from the scene of the fatal shooting of Booher. The Beaver County County Coroner's Office said Mathesius died from a gunshot wound to the chest.\nRELATED: 16-year-old shot, killed while sitting in car in Aliquippa\nMarcinkiewicz learned Foster and Jones play for Aliquippa High School's football team. Both teenagers went to school Friday, the morning after the shooting that killed Booher. They also played in the football game Friday night.\nBeaver Area School District Superintendent Dr. Carrie Rowe released the following statement Tuesday evening:\n\"Beaver Area School District is saddened by the death of former student Cade Booher. Cade was a student at Beaver Area High School until 2016 when he transferred to PA Cyber. Our thoughts and heart felt sympathies are with his family during this difficult time. \"The Student Assistance Program team, which includes licensed professional counselors, guidance counselors, and teachers were mobilized this morning and are ready to meet with any current Beaver Area Middle or High School student who is grieving related to Cade's untimely death. Administration and counseling staff recognize that the gentle support that all school community members give to each other during this time is the first step in healing. Parents who have concerns about their child's emotional or behavioral response to this event are encouraged to contact the principal of the middle or high school.\"\nPolice Chief Don Couch said a resident called 911 Thursday after a 13-year-old boy knocked on his front door at 8:30 p.m. and said his friend had been shot. Officers found a car parked in the middle of the street riddled with bullet holes and Booher's body inside.\nInvestigators said they believe that the 13-year-old, Mathesius and Booher came to Aliquippa to sell marijuana and picked up Reddick, who officers said pulled a gun, demanded money and shot Booher in the head several times after he handed over $50. Police said they recovered a gun from the scene.\nAccording to a criminal complaint, Reddick, Foster and Jones conspired to rob Booher of marijuana and money outside Plan Twelve Market. Police said Mathesius and Reddick set up the deal, citing phone records that showed they were in contact with each other just before the shooting.\n“When a senseless tragedy like this happens, it’s a sock in the stomach,” Couch said.\n© 2017 Cox Media Group."}