{"uri": "http://fox6now.com/2015/05/18/shot-during-a-vigil-to-remember-a-young-life-lost-to-gun-violence-victims-want-to-know-why/", "title": "Shot during a vigil to remember a young life lost to gun violence, victims want to know why", "dct": "Mon, 18 May 2015 17:04:00 GMT", "id": "8c943b46358e6556a7eabeec4985614f", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nMILWAUKEE (WITI) -- It was a particularly violent weekend in Milwaukee -- with at least nine shooting incidents on Saturday, May 16th and at least four incidents on Friday. There were two homicides this weekend -- one on Friday and one on Saturday. One of those killed this weekend was 18-year-old Kendrai Walker. A large group gathered on Saturday near 28th and Burleigh to remember Walker, when there was gunfire yet again. Five people were shot and injured as they remembered a young life lost to gun violence.\nKendrai Walker's mother was one of those who was shot on Saturday evening around 6:00 p.m. She remains hospitalized, receiving treatment for her injuries.\nPolice say they have multiple people in custody in connection with Walker's death, but the person(s) who opened fire during the vigil remain unknown.\nFOX6 News was able to talk with a couple of the people shot and injured during the vigil Saturday. They say they're thankful no one was killed.\n\"If I didn`t have my arm up, it probably would have hit my head because I was running with my arms up in the air,\" one shooting victim, who didn't want to be identified told FOX6 News. \"It pisses me off. We had kids and everything out here. Why would y'all just shoot in the crowd like that? You're lucky nobody didn't die!\"\nJaquel Simmons was shot twice in the shoulder.\n\"Both of the bullets bounced off my bone and came out. I don`t know why they targeted (Kendrai Walker). I didn't even know why they shot us,\" Simmons said.\nKendrai Walker's sister, Kenshawna Walker says she's overcome with emotion over the loss of her brother and what happened Saturday evening as they tried to remember his life.\n\"I miss the water fights. I miss arguing over washing the dishes. I miss all that. I can't deal with it. They tried to take another life from me -- my momma. They just don't care,\" Kenshawna Walker said.\nKenshawna Walker says her mother has a bullet in her leg or knee.\n\"They could get it out. They did hip surgery on her,\" Kenshawna Walker said.\nThose who were shot Saturday say they just want to know why -- and they're extremely thankful no more lives were lost.\n\"We been cool with everybody. Never had beef with anybody. We were all family around here,\" Kenshawna Walker said.\nThese shooting victims, like many others in the community say they want peace in Milwaukee.\n\"People need to watch their kids because a lot of this is little teenage boys. They don`t even know what their kids are out here doing. Young kids don`t value life anymore,\" the shooting victim who wishes to remain anonymous said.\nPolice say they are seeking at least one other known suspect in connection with Kendrai Walker's death."}