{"uri": "http://www.contracostatimes.com/news/ci_24214195/oakland-two-arrested-july-slaying-8-year-old", "title": "Police: Retaliation was motive behind shooting that killed Oakland girl at sleepover", "dct": "Tue, 01 Oct 2013 10:44:00 GMT", "id": "818440bb775e2e01d83f3a60bccdff17", "content": "OAKLAND — Two suspected gang members have been charged with murder in the shooting death of an 8-year-old girl killed while answering the front door during a sleepover in July, authorities said Tuesday.\nAuthorities said suspected gunman Darnell Williams, 22, and Joe Carroll, 27, who apparently planned the July 17 attack that left Alaysha Carradine dead, intended to seek revenge for the killing of Carroll’s cousin, 26-year-old Jermaine Davis, in Berkeley earlier that day.\nWilliams and Carroll were each charged with murder, three counts of attempted murder and shooting at an inhabited dwelling. Prosecutors will decide whether to seek the death penalty against Williams, who was embarking on a brutal crime spree when he killed the girl, investigators said.\nWilliams is also accused of killing a man who he attempted to rob during a dice game in Berkeley in September, authorities said.\n“Some crimes rock the agency and the community; they affect us forever. This is one,” said Oakland police Assistant Chief Paul Figueroa. “Killing an 8-year-old is as despicable as it gets.”\nAlameda County District Attorney Nancy O’Malley said the suspects went to the Wilson Avenue apartment intent on killing someone they believed was responsible for Davis’ killing and “did not care” who was inside when they opened fire.\nCourt documents show the suspects knew that their intended target’s children and their mother lived in the Dimond District apartment. Carradine was staying at her friend’s house.\nWilliams, after orchestrating the killing with Carroll, rang the doorbell at 11:18 p.m.; as soon as Alaysha’s friend, a 7-year-old girl, opened the door, he started shooting, O’Malley said. The bullets pierced the apartment’s metal gate and hit four of the five people inside. Alaysha was killed and her friend, a 4-year-old boy and their 64-year-old grandmother were wounded.\nCarroll was arrested Sept. 27 in Houston, and Williams was arrested Sept. 8 by Berkeley police.\nWilliams and Laquana Nuno are also charged with the Sept. 8 killing of Anthony Medearis in the 1400 block of Eighth Street in West Berkeley. Williams was shooting dice with Medearis and others when he decided to rob Medearis, according to court papers.\nWilliams shot Medearis, and in the process, a bullet fragment struck Williams’ 7-year-old nephew in the face, documents show. Nuno agreed to be a getaway driver for Williams, and fled police after Williams jumped out of her car, authorities said.\nWilliams was arrested later that night, found hiding in a shed, according to police.\nCarroll and three other suspected gang members — Joseph Connors, Emando Roos and Travon Wilson — were also charged with conspiring to murder two men who Carroll believed had disrespected him and his brother, authorities said. Information developed during the course of the investigation into Alaysha’s death allowed police to prevent the killing, including when some of the men were stalking the targets at an unnamed Oakland nightclub, authorities said.\nNuno, Connors, Roos and Wilson were arrested Saturday after police served search warrants in Berkeley, Oakland and Hayward.\nSpeaking at a news conference announcing the arrests, O’Malley said the killing of Alaysha “shocked all of us” and showed the ‘disregard for human life” that gang members have.\nShe singled out Oakland police homicide investigator Officer Rob Rosin, who headed the case, for bringing it to a successful conclusion.\nMayor Jean Quan said Alaysha’s killing “really broke my heart” and said she hopes the arrests “will send a signal” that violent crime will not be tolerated.\nAlaysha, whose family called her “Ladybug,” would have started third grade at Fruitvale Elementary School in August. Her death was Oakland’s 54th homicide this year, and she is one of the youngest Oakland homicide victims this year.\nLess than three weeks after Alaysha’s death, 16-month-old Drew Jackson was shot and killed, along with his 20-year-old father, as the two slept next to each other at an aunt’s East Oakland home."}