{"uri": "http://www.chron.com/neighborhood/spring/news/article/Fatal-Spring-shooting-leaves-5-dead-suspect-5610401.php", "title": "6 members of Spring family shot to death in likely domestic dispute", "dct": "Thu, 10 Jul 2014 00:00:00 GMT", "id": "b7c3b1147f122629d08ddce0fa05a765", "content": "Six members of a Spring family, including four children and two adults, were shot to death Wednesday after an apparent domestic dispute at their Spring home and a relative was arrested hours later after a police chase and a tense standoff in the cul-de-sac of a nearby neighborhood.\nAuthorities held a news conference about 5:30 a.m. Thursday to announce that Ron Lee Haskell, 33, had been captured and charged after a slow-speed chase and lengthy standoff.\nA 15-year-old girl was wounded in the shooting at the home in the 700 block of Leaflet Lane and was airlifted to Memorial Hermann Hospital where she remained in critical condition late Wednesday.\nHarris County Sheriff's Office identified the victims as two males, ages 4 and 13, two females, ages 6 and 9, and two adults, a 39-year-old male and a 34-year-old female.\nMark Herman, assistant chief deputy for the Precinct 4 Harris County constable, said authorities responded to a report of a shooting about 6 p.m. at the home on Leaflet Lane. There they found five people dead and two others with gunshot wounds to the head. Both were taken by Life Flight helicopter to the hospital, where one of them died.\nBefore being flown to the hospital, one of the wounded was able to tell police that the shooting arose from a domestic dispute involving \"someone who had left the family.\"\nHerman said the victim, a female, gave them a description of the person, the type of car he was in, and said he was on his way to kill other family members at another address.\nAuthorities were dispatched to the home of the relatives a short distance away, near Ponderosa and Anvil, and arrived just before Haskell.\n\"As soon as they got over there, he came driving up, and that's when the chase started,\" Herman said, crediting the victim's information with saving the relatives' lives.\nA 25-minute pursuit ended in a standoff at a cul-de-sac in a nearby subdivision on Country Meadow Drive after police, using spike strips, disabled Haskell's car. Authorities evacuated residents near the scene in the Country Lake Estates subdivision, while SWAT negotiators attempted to defuse the situation.\nThe standoff with Haskell lasted late into the night. SWAT teams sandwiched his Honda sedan between two hulking armored vehicles at the end of a quiet neighborhood street and bathed it in floodlights.\nThe suspect eventually surrendered after several tense hours and was taken into custody.\nAt one point during the standoff, Haskell pointed a gun at his head, police said.\nGirl, 15, sole survivor\nSpeaking at a news conference late Wednesday, Pct. 4 Constable Ronald Hickman identified the victims as a man, a woman and four children ages 4 to 13. He said a 15-year-old girl was the only survivor at that hour.\nHe said investigators were trying to sort out the exact family relationships.\nIt was \"obviously a domestic situation that went south,\" Hickman said. \"Probably a divorce or at least a separation.\"\nHe credited the victim who gave police a description of the suspect with providing \"critical information\" to authorities: the name of the gunman and where he was going next.\n\"While quickly responding to that location, we saw him coming up to that residence where other relatives of that family lived and we assumed he meant to shoot them as well,\" Hickman said.\nPublic records indicate that Stephen Robert Stay and Katie Stay, ages 39 and 34, were living at the residence on Leaflet Lane, though they do not appear to have been the owners of the house.\nA web page from the Houston Association of Realtors listed Stephen Stay as an area real estate broker and listed the home's address as his contact information.\nResidents on the quiet suburban street where the shootings took place were stunned by the violence in their neighborhood.\nFamily 'close-knit'\nA woman who said she lives across the street from the house described the family as \"close-knit.\"\n\"It was a Mormon family,\" she said. \"They were very sweet and their kids were very shy. This is a sad, sad day.\"\nThe woman, who asked not to be identified, said five children and two adults lived in the house.\nJohn Barros, a real estate agent, said one of the residents of the home where the shootings took place was a broker with whom he worked.\n\"It's a great family … very religious,\" Barros said. \"They pray every day.\"\nWesley Carr, who lives nearby in the Enchanted Oaks subdivision, said the Spring neighborhood is typically quiet.\n\"I've lived here 20 years. It's a very quiet neighborhood. It's not a through area,\" he said. \"People just don't come here.\"\nSecond shooting this year\nThe shooting on Wednesday comes six months after another Harris County family was found shot to death in their Cypress home.\nThe deaths of Maoye Sun and Mei Xie and their children, Timothy Sun and Titus Sun, which made headlines across the globe and shook the Chinese-American community, has not yet been solved.\nTheir bodies were found about 7:30 p.m. Jan. 30 at their home in the 14000 block of Fosters Creek Drive.\nThe couple was last seen on Jan. 24. The boys attended school at Sampson Elementary the day before.\nChronicle photographer Brett Coomer contributed to this report."}