{"uri": "http://www.sun-sentinel.com/local/broward/dania-beach/fl-dania-beach-two-dead-shooting-20160727-story.html", "title": "Deputies: 7-year-old clinging to life after father shot him, killed sister in Dania Beach murder-suicide", "dct": "Wed, 27 Jul 2016 18:46:00 GMT", "id": "9f7f10c1276f099f0c708db54a8bcfaf", "content": "A 7-year-old boy was clinging to life Wednesday evening after, investigators say, his father shot him and killed his baby sister before turning the gun on himself in Dania Beach.\nWhat began as an argument between parents led to the murder-suicide in which Timothy Hollis, 32, killed Kalila Hollis, 1, and critically injured Timothy Hollis Jr. before taking his own life, the Broward Sheriff's Office said.\nThe bodies of Hollis and his daughter were found on the sidewalk near the intersection of West Dania Beach Boulevard and Southwest Eighth Avenue early Wednesday.\nTimothy Hollis Jr. was found in the street with life-threatening injuries. He was taken to Joe DiMaggio Children's Hospital in Hollywood, according to the Broward Sheriff's Office.\nThose involved didn't live in the neighborhood where the shootings took place about 1:30 a.m.\nEarlier, the children, their father and their mother, Lashunda Bowers, 34, left their residence in the 2300 block of Northwest Sixth Court in Fort Lauderdale after an argument between the parents, said Gina Carter, a spokeswoman for the sheriff's office.\n\"They drove from that central Broward location to this neighborhood. Once they were in this area, the mother actually left the vehicle they were in trying to reach a relative's home to seek aid. While in that home, she heard shots being fired. When she and her relatives came out, they discovered the bodies and the injured child,\" Carter said. It was not known what sparked the argument.\nRelatives could not be reached for comment.\nThe sheriff's office asks anyone with information about the incident to call Detctive James Hayes at 954-321-4231. Tips can also be made, anonymously, to Broward Crime Stoppers at 954-493-8477 or browardcrimestoppers.org.\nStaff writer Erika Pesantes and correspondent Jim Donnelly contributed to this report."}