{"uri": "http://nbc4i.com/2016/10/25/four-shot-in-southwest-columbus/", "title": "Second suspect arrested in southwest Columbus shooting that left two-year-old dead", "dct": "Tue, 25 Oct 2016 18:29:00 GMT", "id": "e398da9d057f7469e6b368f5eb315834", "content": "COLUMBUS (WCMH) – A two-year-old girl died Tuesday after a southwest Columbus shooting. Three others were injured.\nIt happened just after 6pm on the 4600 block of Parkwick Drive.\nPolice say Norman Robert Burke and Jaquon Lamont Poindexter fired multiple shots at the victims. Burke was also shot in the incident. He was located by responding officers east of the location according to Columbus Police. It is not clear who shot him at this time.\nTwo-year-old Amiyah Bice was taken to Nationwide Children’s Hospital in critical condition and pronounced dead at the hospital.\nHer parents, 28-year-old Julian Bice and 25-year-old Jessica Stanford, were taken to Mount Carmel West Hospital in critical condition.\nBurke was taken to Grant Medical Center in stable condition.\nBurke has been charged with two counts of felonious assault and one count of murder. Police say that police identified Poindexter through their investigation and filed warrants for his arrest. He was found on October 27 while he was exiting his vehicle and was placed under arrest by SWAT without incident.\nColumbus Police spokeswoman Denise Alex-Bouzounis said originally that investigators hoped Poindexter, unidentified at the time, would turn himself in.\n“Especially for the sake of the child who lost her life, who was defenseless, who could not protect herself from the gunshots, we want that second suspect to come forward and do the right thing,” Alex-Bouzounis said.\nNeighbors told NBC4’s Tyler Carter that this area is getting attention for all the wrong reasons, and it has been that way for some time now.\nThe neighbors say this home is known for having drug activity. They said police are called frequently.\n“Everything kind of clicks now because when I was walking or running I would see people knocking on the door,” said a neighbor who asked us not to reveal her identity. “I thought that house was abandoned.”\nShe says this neighborhood is normally a quiet neighborhood.\nKeep checking NBC4i.com for real-time updates on this story. To get alerts for breaking news, grab the free NBC4 News App for iPhone or Android. You can also sign up for email alerts."}