{"uri": "http://www.wthr.com/article/greenwood-teen-shoots-and-kills-another-teen-during-argument", "title": "Police: Greenwood teen shoots and kills another teen during argument", "dct": "Sun, 15 Jan 2017 19:22:00 GMT", "id": "8ecee37908ccda35ce004217ba5cca1c", "content": "GREENWOOD, Ind. (WTHR) - Greenwood Police Department are investigating the shooting death of 16-year-old Zachary Edwards was shot and killed by 18-year-old Isaac Stinemitz in a car early Sunday morning,\nStinemitz is in the Johnson County Jail after telling police he pointed the gun at his 16-year-old friend's head and pulled the trigger. Stinemitz told police he didn't think the gun was loaded when he pulled the trigger.\nStinemitz is being held on a charge of reckless homicide. Greenwood police say Stinemetz, Edwards and two other teens were in Stinemetz' car in the 2000 block of Jaden Lane in the Pebble Creek subdivison early Sunday morning when the shooting happened.\nPolice say the teens panicked and ran while Stinemitz threw the gun in a storm drain.\nA neighbor called 911 to report a person passed out in the backseat of a car in the front of her house. That's when police found Edwards, who was dead.\nJohnson County coroner Craig Lutz confirmed Edwards' identity to Eyewitness News Sunday night, and said an autopsy may take place Monday.\nPolice say the two teens who saw the shooting showed up at the police station with their parents to report what happened.\nStinemitz surrendered to police at his home on of Palisades Court. Investigators say they had a difficult time locating Edwards' family and his parents learned of his death on social media.\nDeputy Chief Matt Fillenworth described Edwards' parents, \"They are distraught. The mother said she can still smell her child. As a parent of teenagers, I cannot fathom the grief that they feel.\"\nFillenworth said this is the first homicide in Greenwood this year.\nThe suspect is being held without bond\nThe gun was recovered from the storm drain by Greenwood Police."}