{"uri": "http://www.sacbee.com/news/local/crime/article10876679.html", "title": "Shots fired after Nipsey Hussle show at Ace of Spades in Sacramento", "dct": "Sat, 21 Feb 2015 10:26:00 GMT", "id": "c182ada882c46809a056096fc4cfe966", "content": "Sacramento police continued Saturday to investigate a shooting late Friday outside the Ace of Spades music club in the 1400 block of R Street.\nPolice officers were already in the area when they heard gunshots as patrons were leaving a concert by rapper Nipsey Hussle at the club around 11:20 p.m., according to the Sacramento Police Department daily activity log. The officers located one victim who suffered gunshot wounds. He was taken to a hospital and was in stable condition Saturday.\nThree additional victims arrived at a hospital with non-life-threatening injuries.\n“It appears a few people were shooting at the time,” said Sacramento Police Department spokeswoman Michele Gigante.\nShe described a chaotic, crowded scene before the shooting. A person was being chased by police after “jumping on one of our patrol cars,” she said, when the shots were fired.\nShe said one gun and several rounds were found in the area.\nThe R Street corridor has been a story of transformation for downtown Sacramento. The once-rundown industrial district has blossomed in recent years into a popular enclave of restaurants, clubs and retail venues that attracts visitors throughout the day and well into the night.\nOn Saturday afternoon, under blue skies and a bright winter sun, restaurant patrons relaxed at outdoor patio tables with pitchers of mimosas, beer and sweaty glasses of white wine. The black doors to the Ace of Spades remained shut, but a marquee announced that the night’s attraction – Bone Thugs-N-Harmony – was sold out. Next weekend will feature Black Veil Brides and Dem Bay Boyz, the marquee read.\nMost R Street pedestrians interviewed Saturday by The Sacramento Bee had heard about the shootings the night before, but few expressed grave worries about their own well-being or the safety of the rehabilitated commercial district.\n“It doesn’t worry me,” said Marcus Richards, 40, an attorney who lives in midtown. “I think these things are pretty targeted. Now, if random people like me start getting shot ...”\nSeveral said they believed alcohol likely fueled the situation. “Drinking makes people aggressive, and they want to fight,” said Mike, who would not give his last name but described himself as a 58-year-old Sacramento native. “Their whole behavior changes.”\nSkyler Henry and Hollis Lawrence, who paused in front of the club to study the upcoming acts, said they have enjoyed the music venue and are unconcerned about Friday’s outburst of violence.\n“You could go anywhere and something bad could happen,” said Henry, 31, who waits tables.\nPhil Logsdon, 43, who works as a barber near the club, isn’t worried about any fallout for the salon, which closes at 6 p.m. on Saturdays. “It doesn’t affect my business at all.\n“It’s downtown,” he said. “It’s Sacramento.”\nCall The Bee’s Denny Walsh, (916) 321-1189.\nThe Bee’s Brian Nguyen contributed to this story"}