{"uri": "http://www.burlingtonfreepress.com/story/news/local/vermont/2016/02/16/vsp-investigate-shrewsbury-shooting-death/80444680/", "title": "Man arrested in Shrewsbury shooting", "dct": "Tue, 16 Feb 2016 00:00:00 GMT", "id": "2349730ebce8d81c3d64a33981f0d04f", "content": "Frank Weir, 54, of Shrewsbury, has been arrested in the Monday night shooting death of his longtime girlfriend, Donna Marzilli, 57, also of Shrewsbury, Vermont State Police said late Tuesday night.\nWeir faces charges of second degree murder and aggravated domestic assault.\nPolice siad Weir and Marzilli were in a long-term relationship and lived together in a home on Cold River Road in Shrewsbury. He is being held without bail at the Marble Valley Correctional Facility pending a arraignment Wednesday at Rutland County Superior Court.\nThe victimn’s body was been transported to the Office of the Chief Medical Examiner for autopsy to determine official cause and manner of death.\nAnyone with information is asked to contact the Vermont State Police in Rutland at 802-773-9101.\nPolice earlier reported that a woman was shot and killed as part of a domestic dispute late Monday .\nMaj. Glenn Hall, Commander of the Criminal Division, said detectives from the Vermont State Police Bureau of Criminal Investigations and Major Crimes Unit were on scene at Cold River Road on Tuesday morning.\nPolice responded to the home late Monday night after receiving a call from a man saying he had been in a domestic dispute with a girlfriend and she had been shot, Hall said. The woman was pronounced dead on scene of an apparent gunshot wound.\nHall said the incident appears to have been isolated and there is no danger to public safety.\nThe investigation into the incident is ongoing. Police are applying for a warrant to search the home on Cold River Road, Hall said. Investigators are also looking into any history of domestic violence between the couple.\nDetectives are working with the Rutland County State’s Attorney’s Office. and Hall said he expects a decision on charges by the end of the day Tuesday.\nContact Elizabeth Murray at 651-4835 or emurray@freepressmedia.com. Follow her on Twitter at www.twitter.com/LizMurraySMC."}