{"uri": "http://www.wbtv.com/story/33862413/grandmother-hurt-7-year-old-girl-killed-is-salisbury-shooting", "title": "Grandmother hurt, 7-year-old girl killed in Salisbury shooting", "dct": "Mon, 05 Dec 2016 05:17:00 GMT", "id": "9cbf5df2d7ebc30b73064958ce638fe0", "content": "SALISBURY, NC (WBTV) -\nA shooting in Salisbury left a 7-year-old girl dead and her grandmother wounded early Sunday morning.\nSalisbury police arrived on scene just before 4:30 a.m. in the 200 block of Harrel Street.\nA'yanna Allen, 7, was pronounce dead at the scene. Her grandmother, 56-year-old Shirley Robinson, was found with a gunshot wound to the leg. Robinson was taken to the hospital to be treated and has since been released from the hospital.\nSunday afternoon, Robinson told WBTV she and A'yanna were sleeping on the same bed when bullets were fired through their bedroom window.\n\"That was a 7-year-old child, innocent. We were laying in the bed sleeping. What are we doing 4 or 5 o'clock in the morning? We're in here sleeping,\" Robinson said.\nAllen was a second grade student at Koontz Elementary.\nRobinson said her granddaughter lit the room up with her smile.\n\"She was a joyful child, real joyful child. She was a happy and joyful kid. Wouldn't a day go by she'd make someone smile.\"\nThis is not the first time Robinson has dealt with tragedy.\nOn Christmas morning in 2009, Robinson's son, Antonio Allen - who is A'yanna's father - was shot and killed.\nRobinson said it took her a long time to cope with that, but it may take even longer this time.\n\"She was my joy, she was my everything. She was my everything, no matter where she go, she had to go home and be with grandma, and that was my heart.\"\nRobinson has to get around on crutches, but she said this pain is nothing compared to what she and the rest of the family are feeling now.\nShe asks the shooter to confess.\n\"Whoever did it, needs to go turn themselves in,\" Robinson said.\nThe shooting is under investigation. Anyone with information regarding this case is encouraged to call the Salisbury Police Department at 704-638-5333 or Crime Stoppers at 1-866-639-5245.\nCopyright 2016 WBTV. All rights reserved."}