{"uri": "http://www.wowt.com/home/headlines/360839371.html", "title": "Police: Murder Suspect Will Not Face Additional Charges Per Autopsy Results", "dct": "Mon, 07 Dec 2015 15:21:00 GMT", "id": "fcbc2cd012db841bd940492b092fa0b4", "content": "A woman and her two year old daughter were shot and killed Sunday. Three other women are still fighting for their lives following the shooting.\nFamily and friends are feeling heartbreak and anger as more and more details on this double murder and triple shooting come out.\nOfficers called to the Bluffs at Cherry Hills Apartments near North 108th Street and Military Road just after 11 p.m. Sunday found 22-year-old Destacia Straughn and 2-year-old Kenacia Amerson-Straughn dead. Twenty-two-year-old Kachelle Roby, 21-year-old Larrion Williams and 18-year-old Jamie Latner were wounded.\nThe suspect in this case was clear from the start. Police confirm Dontevous Loyd to be the main suspect.\nDestacia’s mother and grandmother spoke with WOWT 6 News Monday. They say Destacia had been dating Loyd and was pregnant. Police say autopsy results show that Destacia was not pregnant.\n\"I just don't know how I am going to live with out them,\" Destacia’s mother tells WOWT 6 News.\" But to kill a two year old little girl, how heartless can you be?\"\nNo words can describe this mother's pain after losing both her daughter and her granddaughter in such a gruesome way.\n\"He came back and he killed them, all of them. He tried to kill all of them, but he made sure he killed Destacia and her daughter, and his kid inside her stomach,\" said Destacia’s mother.\nA tear slides down the cheek of Karolyn Roby as she talks about the double murder and triple shooting. Her daughter, Kachelle Roby, is one of the three shooting victims fighting for their lives.\n“She begged for her life, and he still shot her twice in the neck and once in the back and she just kinda played dead,” said Karolyn. “She took off running and went into a closet. He shot everybody else downstairs and then came up stairs after her.”\nMany victims’ families are frustrated because they say police were called out to the apartment just hours before the shooting.\nA police report says Loyd has been accused of stealing Destacia’s car that same day. According to police reports, when officers arrived the car had already been returned and Loyd had already left the area.\nFamily members at the hospital say they are scared to talk more because they say Loyd has been texting the hospitalized victims threatening messages. Loyd turned himself into police Tuesday morning.\nDestacia's mother has set up a fund in honor of her slain daughter and granddaughter. Anyone wishing to donate can at area Metro Credit Unions under the, Destacia & Kenacia Straughn Fund. A GoFundMe page was also created for Kenacia Amerson-Straughn, Click HERE to donate."}