{"uri": "http://www.sun-sentinel.com/local/broward/plantation/fl-plantation-fatal-shooting-20160320-story.html", "title": "Spring Break party packed with 400 people ends with one dead, four hurt", "dct": "Mon, 21 Mar 2016 00:16:00 GMT", "id": "4bb79ef3aa9a5ec08eadd70775f2464a", "content": "One person was killed and four others injured early Sunday when shots were fired at a large house party in the 12000 block of NW 4 court, police say.Partygoers went by to pick up their cars early Sunday afternoon, which were left after the commotion, and many were still shocked.\nA Spring Break party in a house packed with 400 people ended in gunfire that killed one man and wounded four others.\nPlantation police on Sunday afternoon said Serge Pierre Dumas, 28, was found dead inside the five-bedroom, two-story house in the 12000 block of Northwest Fourth Court.\nFour other people, three women and one man, were taken to Broward Health Medical Center in Fort Lauderdale with gunshot wounds, according to a news release issued by Plantation police Sunday afternoon.\nUp to three officers were near the front of the house responding to neighbors' complaints about noise and parking when the shots were fired at 11:37 p.m. Saturday, police said.\nThe unidentified shooter escaped.\n\"The shooting was inside the house, and as soon as gunshots went off, people came pouring out of the house,\" said Detective Philip Toman. \"It was chaotic.\"\nPlantation police interview people going to pick up their cars Sunday morning after a man was shot dead late Saturday night. Four other people were injured at the party where as many as 400 people attended in a Plantation home on Northwest 118th Avenue and Northwest Fourth Court.\n(Maria Lorenzino / Sun Sentinel)\nToman said officers on the scene tried to get control of the situation, but some of the party guests were able to flee from the home at the end of a dead-end street in a semi-rural neighborhood.\nDozens of others were ordered to line up, and according to guest Jalen Chapman, 17, ordered to put their hands in the air and marched east down the street toward Northwest 118th Avenue.\nNear that corner, police patted down some of those guests and asked for identification. Many were then taken to the Plantation Seventh-day Adventist Church less than a block away.\n\"We didn't know who the shooter was,\" said Toman, \"and the officers were doing their best to pat people down, see that their hands were visible.\"\nPlantation police interview people going to pick up their cars Sunday morning after a man was shot dead late Saturday night. Four other people were injured at the party where as many as 400 people attended in a Plantation home on Northwest 118th Avenue and Northwest Fourth Court.\n(Maria Lorenzino / Sun Sentinel)\nPlantation police, assisted by officers from the Sunrise Police Department, questioned hundreds of people but collected little information, Toman said. \"We still don't know who the shooter was,\" he said Sunday afternoon. \"We are looking for better witnesses. They are not giving us any information.\"\nDavon Carter, 25, said he went to the party with Dumas. They were standing inside the house and had decided to go outside for air, he said. Carter said he was walking a few steps behind Dumas when \"five or six shots\" were fired.\nWhen he found Dumas, he was on the floor. \"I watched my best friend die,\" said Carter. He said there had been no fights or signs of trouble at the party. \"He was a random person,\" said Carter.\n\"He was the greatest up-and-coming artist that the world will never see,\" said Aisha Balkich, 23, the mother of Dumas' 15-month-old son Darian. She said Dumas performed hip-hop under the name Illy-Illz.\nOne of the guests held at the church for hours after the shooting was Jalen Chapman, 17, a junior at Flanagan High School. He said he and his girlfriend were standing in the house's back yard when he heard gunshots.\n\"It was just crazy,\" Chapman said. \"Everybody was trying to get out at the same time.\"\nChapman and his girlfriend did make it out, but when he realized he had forgotten his cell phone, he returned to a scene that had grown even more chaotic, he said.\nAfter being questioned, he and many others were told they could leave but they could not take their cars, which were parked along Northwest Fourth Court and 118th Avenue.\nAfter several hours, some were permitted to leave in their vehicles, but others, including Chapman, called friends for rides and returned later Sunday to retrieve their cars.\nChapman, along with another guest, Joshua Lewin, 18, said they found out about the party from postings on a social media. The affair was advertised as a Spring Break celebration, with a $5 cover charge for men, Lewin said.\nStudents from several area high schools and colleges, as well as a few older people, packed the premises, including the house and a pool area in the back, guests said.\nLewin, a student at Broward College, said he was in the crowded living room when he heard gunfire. Frightened, he and a friend ran upstairs and hid, he said.\nAbout 10 minutes later Lewis said he ran out the back door and into the yard, where he was told by police to get in line with his hands up.\nAt the church, Lewis said he was asked questions such as, \"Did you see the gunman?\" and \"Why do you believe this happened?\" Lewin said he had no answers.\nSeveral guests said they didn't know who lived in the house.\nToman said detectives interviewed a resident of the house, also its former owner. The house is now owned by Boss Group Ministries, according to Toman. Attempts to contact the company were unsuccessful Sunday.\n\"We'll be digging into that,\" said Toman, \"but right now the focus is on catching the shooter.\"\nToman said he suspects that some party guests may have seen the shooting, or have knowledge of what happened. \"They are not very cooperative,\" he said. \"Not one person can tell us who shot that gun. But as far as far I am concerned, someone in that room knows who shooter is and they need to come forward.\"\nAdded Toman: \"In my 27 years of police work, I have never seen a case like this.\"\nThe wounded included Shamar Byfield, 21, of Pembroke Pines; Ashley Adamson, 16, of Miramar; and Sophia Hernandez, 18, of Hollywood, police said. Their conditions were not available Sunday night.\nTahmya Phillips, 17, of Miramar, was hit in the legs and hip, according to her father, Army Command Sgt. Maj. Jeremy Burton.\nBurton, stationed at Fort Meade in Maryland, says he caught a red-eye flight to South Florida early Sunday after receiving a phone call just after midnight that his daughter, a senior at Somerset Academy High School in Pembroke Pines, had been shot.\n\"My reaction? Shock,\" Burton said.\nHe accompanied another daughter, Makayla Phillips, 19, to the scene Sunday afternoon to pick up their car before returning to Tahmya's side in the hospital.\n\"The safety of my children is all I worry about,\" said Burton. \"She is stable, she will recover. I just have to put all my faith in God.\"\nPolice ask anyone with information to call Detective Toman at 954-797-2118 or Crime Stoppers at 954-493-8477."}