{"uri": "http://www.fox5vegas.com/story/32388105/homicide-victim-denied-protective-order-weeks-before-slaying", "title": "Homicide victim denied protective order weeks before slaying", "dct": "Thu, 07 Jul 2016 00:49:00 GMT", "id": "b3fd1b6b76a6c6aab93e3e6d2366f34c", "content": "LAS VEGAS (FOX5) -\nCourt documents show the woman shot and killed by her husband last week filed for a protection order against him. That request was denied.\nLas Vegas Metro police say Jason Dej-Oudom killed his wife and three children before taking his own life.\n[READ: 3 juveniles among 5 dead in Vegas apparent murder-suicide]\nThe victim, Gayle Dej-Oudom, worked at a Sports Clips haircut salon up until about a week before the murder-suicide.\n“She was awesome. She was amazing, the nicest person. [She was] full of life,” said Allyson Wall, Gayle Dej-Oudom’s former co-worker.\nThe victim’s co-workers said they lost a family member in the incident.\n“I was here at work, doing a haircut with one of her regulars, actually, and we both just kind of lost it. We just started crying,” Wall said.\nGayle Dej-Oudom quit her job about a week before her murder. She told co-workers she was afraid of her husband.\n“When asked why, she said that she had feared for her life and she couldn’t be anywhere that he could fine her,” Wall said.\nCo-workers said they knew little about her abusive relationship. Before she quit, she filed for a temporary protective order that would have made it illegal for her husband to come near her.\nA court denied that request on June 9.\n“I couldn’t believe it. I just don’t know when you have that kind of evidence how you can be denied a restraining order,” Wall said.\n“The criticism of TPOs is that they’re not taken seriously enough, that they’re not reviewed closely enough, and I suspect there’s a high volume of TPO requests,” FOX5 legal analyst Bob Massi said.\nMassi said that high volume of request comes from people abusing the system, seeking orders when they aren’t in danger.\n“The people who review these, they see it all, and they have to use some gut feeling. Obviously in this case, for whatever reason, it was denied,” Massi said.\nCo-workers aren’t convinced a protective order would have saved their friend.\n“I don’t think that would’ve done anything. I think he was going to do what he did no matter what,” Wall said.\nCopyright 2016 KVVU (KVVU Broadcasting Corporation). All rights reserved."}