{"uri": "http://www.pennlive.com/news/2016/08/petition_emerges_seeking_doj_i.html", "title": "Petition seeks DOJ investigation into teen's accidental shooting death", "dct": "Sun, 04 Sep 2016 03:05:55 GMT", "id": "06984c3d9410c9009a6db8ae6a542b94", "content": "An online petition was launched Monday morning calling for a U.S. Department of Justice investigation into the shooting death of a 15-year-old Mountville boy Aug. 12.\nIbram Hanna died of a single gunshot wound from a semi-automatic pistol at an unidentified 17-year-old shooter's home on West Main Street in Mountville. Investigators have said the shooting was accidental, but the petition filed by Becky Holzinger calls the shooting a murder.\nThe two boys were looking at the gun that the 17-year-old boy had stolen from a vehicle in the township before it fired, officials said, describing the death as a result of \"criminal reckless behavior rather than a premeditated killing.\"\nHolzinger, who publishes Lancaster Independent News online, accuses West Hempfield Township police of closing its investigation into the shooting in under 11 hours.\nFady Hanna, Ibram's brother, told PennLive there are people who have information about the shooting who have not been interviewed by police. He said Ibram's family is struggling with his death and want to see the matter fully investigated.\nChief Mark Pugliese of West Hempfield Township police said the department is following all leads in the case, adding that investigators have looked into rumors going around in the community. He said the charges filed against the teen reflect what can be substantiated.\nBrett Hambright, a spokesman for the Lancaster County District Attorney's Office, said charges have been filed based on evidence collected and examined, interviews conducted and from other sources of information. He added that there was no supportable evidence that anyone else was present for the shooting.\nHambright, like Pugliese, encourages anyone with information about the incident or the circumstances around it to contact police.\nThe 17-year-old is charged with involuntary manslaughter, theft from a vehicle, possession of drug paraphernalia and theft of a firearm. He will be prosecuted in juvenile court.\nA person charged with involuntary manslaughter cannot be charged and prosecuted as an adult under the Juvenile Act.\nA gofundme campaign was launched to help Hanna's family with funeral costs. The campaign raised $8,577 in eight days.\nThe petition was posted as follows:\n\"15-year-old Ibram Hanna was shot dead in Mountville, PA on the morning of Friday, August 12th. In under 11 hours, the Lancaster County District Attorney's Office under Craig Stedman issued a press release that it was accidental and the 17-year-old shooter would be tried as a juvenile.\nThere are several erroneous statements in the DA's press release which implied these were the only two boys in the home where he was shot and that they were friends and were \"looking at the gun\" when it went off. The gun was stolen by the 17-year-old from a car but the public was not told when or the circumstances of the theft. There were reportedly a number of other teens in the home at the time. The 17-year-old has a troubling history of drinking and drugs.\nIt is impossible that a thorough investigation of this murder could have been completed within 11 hours. It borders on ridiculous.\nThe U.S. Department of Justice needs to investigate this murder and review the actions of the West Hempfield Township Police Department and the Lancaster County District Attorney's Office.\"\nThe petition had 27 signatures as of Monday afternoon."}