{"uri": "http://lipnews.com/2016/08/justice-for-ibram-3/", "title": "AFTERNOON UPDATE – SIGN! ** – * JUSTICE FOR IBRAM! – 3", "dct": "Mon, 22 Aug 2016 00:00:00 GMT", "id": "b4d25b0c762f637a930f21acb4206a11", "content": "The response to the petition immediately below has been wonderful. Please share the petition on Facebook, Twitter, by email and any other way you can. Thank you so much. Justice for Ibram!\n** Sign the petition to have the Department of Justice investigate the murder of Ibram Hanna – click here.\n* The people of Lancaster County are known for their generosity. It’s why the refugee program is so successful here. There are people here who are willing to help, and who see meeting the practical needs of another human being as an outward expression of faith.\nFrom today’s LNP editorial, “A photo reminds us of Lancaster County’s history of helping children like Omran,” (click here).\nHere’s an idea, LNP! Instead of writing these platitudes day after day and doing the exact opposite, why don’t you investigate the murder of Ibram Hanna? Why don’t you do something to help? Why don’t you send a reporter to Mountville and why don’t you question the West Hempfield Township police and the DA’s office? Why don’t you do your job and hold these officials accountable?\nWhy don’t you do it today!\nThey left Egypt to avoid Christian persecution and worship God without fear of death. To keep their family safe. Only to lose a son in such a violent way. They deserve love, respect, justice and support.\nPosted on social media about the family of Ibram Hanna, 15, who was shot to death in Mountville on August 12.\nThis family needs justice. The West Hempfield Township Police and the District Attorney’s Office need to be investigated for their handling of this murder and this travesty of justice.\nGeorge Rosado, a very troubled 17-year-old being raised by his grandmother, with a stolen gun, with several teens in his house, pulls the trigger and shoots Ibram dead between the eyes at approximately 10:30 am in the morning. Before 10:00 pm that night, the DA’s office issues a statement essentially closing the case – stating it was an accident and Rosado will be charged as a juvenile and the public will learn nothing further about this case or his punishment.\nThat is not going to happen. This is unacceptable. This is the direct antithesis of how American justice is supposed to operate. The Hanna family deserves answers and justice.\nEmail or call Brett Hambright, the DA’s “media specialist” and tell him to tell District Attorney Craig Stedman to reopen this investigation now or bring in outside help!\n— 717-295-2041\n— bhambright@co.lancaster.pa.us\nThere will be much more later today."}