{"uri": "http://www.cleveland.com/metro/index.ssf/2016/12/host_of_live-streamed_clevelan.html", "title": "Deadly Cleveland dinner party was live-streamed online, host charged in accidental shooting death of friend", "dct": "Sat, 10 Dec 2016 17:04:00 GMT", "id": "9544842191705ab96938cd37933990fd", "content": "CLEVELAND, Ohio -- A Cleveland man is charged in connection with the deadly accidental shooting of a friend during a dinner party on Thursday night, part of which was live-streamed on Facebook Live, according to court records and a partial-recording of the video obtained by cleveland.com.\nSteven Leannais, 30, was charged with third-degree felony involuntary manslaughter. He is in the city jail awaiting his first court date.\nPolice say he was drunk at the time of the shooting, according to court records.\nAnthony Stanford II, 27, was killed in the shooting that happened about 9:50 p.m. Thursday in Leannais' apartment in The Brick Lofts Apartments at Historic West Tech High in the 2200 block of West 93rd Street, according to police reports.\nLeannais live-streamed the dinner party on Facebook Live. A person who viewed the recording of the incident provided the video to cleveland.com. The video was posted prior to the shooting.\nFamily members and friends verified that Stanford was in the video.\n\"Guns and alcohol don't mix,\" Stanford's mother, Trina Ford, said.\nThe events in the video match the descriptions of what happened that were included in the police report.\nCleveland police have not confirmed if they are reviewing the video as part of the case.\nLeannais was hosting Stanford, 27, and two other friends for dinner and drinks when the shooting happened, police say.\nOne of the other partygoers went into Leannais' bedroom and grabbed his handgun.\nThe video shows a man waving a gun around. He asks if the video is recording and says: \"We're going to walk up to this guy and say 'we're going to cap this guy's ass.'\"\nSomeone tells the man the gun is loaded and a woman says \"Don't point that at me.\"\nThe man points the gun at his face and Leannais grabs the gun and takes out the magazine and gives it back, the video shows.\nLeannais grabbed the gun from his friend and told him it was still loaded, police reports say.\n\"There you go,\" Leannais says in the video. \"Now it's not loaded.\"\nLeannais took out the magazine and gave the gun back to the other man, who has not been charged with a crime in connection with the case.\nThe group laughs about it and the man puts the gun in his mouth and says: \"I'm going to do it, I swear to God.\"\nThe man then says: \"The last thing they say is always, 'I didn't know it was loaded.'\"\nLeannais said that's why he took the clip out and assures the viewers he took out the bullets.\n\"See that,\" he says putting the bullets up to the camera. \"That would have made a bloody mess. See that hollow point right there?\"\nSomeone shows a bottle of vodka in front of the camera while the man again puts the gun in his mouth. Stanford then arrives. The man with the gun jokes with him, shakes his hand and Stanford looks into the camera.\nLeannais grabs the camera and walks over to a kitchen counter where he shows Stanford what he made for dinner.\n\"Yeah, that's what's up,\" Stanford says. The video recording ends.\nLeannais eventually picked the gun up, lowered it to his side pulled the trigger, unaware a bullet was in the chamber, according to police reports and court records. The bullet hit Stanford in the upper abdomen, the records say.\nStanford ran out the door after he was shot. Leannais followed and called 911, police reports say.\nParamedics met the pair in the apartment's lobby and rushed Stanford to MetroHealth where he was pronounced dead about an hour later.\nLeannais submitted to a blood-alcohol content test, which showed a 0.058 blood-alcohol content in his system three-and-a-half hours after the shooting, according to court records.\nFord and other family members and friends were emotional after viewing the video.\nStanford, a father of a 5-year-old girl, was a kid at heart who matured but never lost his sense of fun, his family said.\nStanford, who went by his middle name, Curtis, was a maintenance worker at the building where the shooting happened, said Ford. He also repaired homes on the side.\nHe always had a talent for mechanical work, including when he built a go-cart out of the family lawnmower as a kid, Ford said.\nHe made friends wherever he went. Ford, a nursing assistant, said childhood friends have been pouring into her West Side home offering condolences and telling stories about her son.\n\"If you came across him, you would remember him forever,\" Ford said. \"If you met 50 people that day, you'd remember him. He was just that way.\"\nStanford, a graduate of John Marshall High School, was a boxer when he was younger and still worked as a trainer for young up-and-coming boxers, Ford said.\n\"He was very inspiring to people,\" Ford said.\nStanford stayed out of trouble as a kid and as adult and hated guns, friends and family said.\n\"There was bad stuff when we were growing up,\" friend Samuel Pettway said. \"Be he was always the stay-out-of-the way guy. There's nothing bad anybody could say about him.\"\nIf you'd like to comment on this story, visit Saturday's crime and courts comment section."}