{"uri": "http://wsvn.com/news/local/at-least-1-killed-multiple-people-injured-in-miami-shooting/", "title": "Man, woman killed in Miami shooting ID’d; boy recovering at JMH", "dct": "Sat, 23 Jul 2016 00:00:00 GMT", "id": "514244388ec59be23fb79bb0022d2ea3", "content": "MIAMI (WSVN) - A 7-year-old boy is on the road to recovery, two days after he was injured in a shooting that claimed the lives of his mother and a man who, police said, shot them, then turned the gun on himself.\nMiami Police responded to the scene of the shooting on the 3600 block of Northwest Second Street, Saturday, at around 4 p.m. “Three or four cop cars are zooming, ‘zoom,’ ‘zoom,’ ‘zoom,'” said longtime area resident Raul Torres.\nInvestigators said multiple calls had come in about the shooting. “We received multiple calls where shots were being fired,” said Miami Police Officer Rene Pimentel.\nInside the residence, which had been divided into some type of duplex, officers found a man, woman and child with gunshot wounds.\nInvestigators said the female victim, later identified as 36-year-old Ivy Abigail Torres, had succumbed to her injuries by the time police arrived.\nSpeaking in Spanish with 7News, neighbor Arturo Claro, who knew the woman, reacted to her death. “It’s terrible, terrible, because no matter what, she was a human being,” he said.\nPolice set up a perimeter in the area shortly after. Crime scene investigators were seen collecting a bloody piece of clothing.\n7News cameras captured Torres’ mother breaking down just beyond the police tape. Moments later, an officer could be seen comforting her.\nThe man who, police said, was the shooter, was transported to Jackson Memorial Hospital, where he was pronounced dead. Investigators later identified him as 55-year-old Roberto Alfonso Jr. and confirmed he died of a self-inflicted gunshot wound.\nThe child was transported to JMH in stable condition. He is expected to be OK. Officials said his injuries were not life-threatening, and he is scheduled to be released later this week, possibly on Thursday.\nInvestigators confirmed that this was a domestic situation but did not specify whether the deceased were a couple. They said the child is Torres’ son but is not related to Alfonso.\nGretchen Avello, a friend and former co-worker of Torres, is still reeling from the tragedy. “Oh, my goodness, incredible,” she told 7News on Monday. “She’s very young.”\nAccording to court documents, domestic violence had been an ongoing issue between Torres and Alfonso. Records revealed there have been instances of domestic discord as recently as June.\nTorres said this is the first time he’s seen such an incident in this neighborhood. “I’ve been here 27 years, and it’s been calm,” he said. “It’s been calm like any other neighborhood. I haven’t seen this, though.”\n“Nobody should take the life of another person,” said Avello. “It’s very, very, very, very sad.”\nThe Florida Department of Children and Families is reviewing the case to determine who will take custody of the child. A hearing has been scheduled for Tuesday.\nCopyright 2017 Sunbeam Television Corp. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}