{"uri": "http://www.rrstar.com/news/20161021/two-critically-wounded-remain-hospitalized-after-deadly-rockford-clock-tower-shooting", "title": "Two critically wounded remain hospitalized after deadly Rockford Clock Tower shooting", "dct": "NODATE", "id": "b7f311c4a361184cff75fcfb964d7092", "content": "Hide caption Rockford fire, building, and trades inspectors in addition to Rockford Police Department officers conducted inspections and security checks at the Clock Tower Resort & Conference Center Thursday, Oct. 20, 2016, in the wake of a shooting that left one dead and five injured. JEFF KOLKEY/STAFF PHOTOGRAPHER/RRSTAR.COM\nROCKFORD - Police continue to investigate a deadly Oct. 15 shooting at the Clock Tower Resort & Conference Center that left five wounded and one dead.\nMarcello Brown, 23, was shot and killed at a birthday party held in two rooms of the hotel.\nA critically wounded 19-year-old male and a critically wounded 21-year-old male remain hospitalized and in stable condition. An 18-year-old female shot in the leg and a 20-year-old male who was shot in the leg have been treated and released from area hospitals. An 18-year-old female shot in the head was transferred from the hospital to a rehabilitation facility, according to the Rockford Police Department.\nPolice have declined to identify the victims of the shooting because of the \"sensitive nature of the investigation.\"\nNo arrests have been announced.\nRockford code enforcement officers, fire investigators and police conducted a four-hour inspection on Thursday of the Clock Tower Resort.\nBuilding and health and life safety code violations were discovered during the inspection. Those included a faulty fire alarm system, faulty fire suppression systems, door security, outdated and untested automated fire extinguishers over the cooking areas of the kitchen, inoperable heating and cooling equipment, and electrical and plumbing problems.\nInspectors ordered the hotel to hire a third party to provide fire protection and security on a 24-hour basis until repairs are made.\nAnyone with information is asked to call the Rockford police detectives at 779-500-6551 or Rockford Area Crime Stoppers at 815-963-7867.\nJeff Kolkey: 815-987-1374; jkolkey@rrstar.com; @jeffkolkey"}