{"uri": "http://www.wifr.com/content/news/One-dead-and-five-injured-in-shooting-at-the-Clock-Tower-397182351.html", "title": "UPDATE: Police release condition updates on five injured in Clock Tower shooting", "dct": "Fri, 21 Oct 2016 00:00:00 GMT", "id": "d9bbc859ef9c734ca0e9d711aa9e318c", "content": "ROCKFORD, Ill. (WIFR) – Police have released new information regarding the victims of a shooting at the Clock Tower Resort last weekend.\nAn 18-year-old woman and 20-year-old man who were both shot in the leg have been treated and released from the hospital.\nAnother 18-year-old woman who was shot in the head is now in rehab. Two other male victims, a 19-year-old and a 21-year-old are still in the hospital in stable condition.\nThe Rockford Police says they are not releasing the victims’ names due to the nature of the investigation.\n------\nUpdated: October 20, 2016\nUPDATE: ROCKFORD, Ill. (WIFR) The city is calling on the clock tower to make some much needed improvements in repairs and security of the building after a deadly shooting last weekend.\nAfter a four hour inspection city inspectors called for hotel management to implement some immediate actions including 24 hour security of the building until several of the violations are corrected.\nRockford police and fire were on hand for the inspection conducting a security check of the 250 room hotel in the 7800 block of east state street.\nInspectors found several building and fire code violations including .. improper locks and security on main entrance and exits .. fire alarm system connection issues, emergency exit lighting issues and outdated fire safety equipment.\nRockford inspectors met with management who agreed to hire security to patrol the building 24 hours a day until these violations are resolved. Earlier this week Mayor Morrissey addressed the shooting that left one person dead and five injured.\n\"we have enforcement opportunities, we would do this if it were a liquor establishment or any other establishment. If the property itself shows a pattern of lending itself to inappropriate criminal behavior then we'll do everything we can to try to bring enforcement actions against the property owner,\" said Mayor Larry Morrissey.\n\"Some of the building and life safety codes were of concern so we wanted to verify those today and when we completed the inspection there were some issues of concern that need to be addressed by the property owner,\" said Rockford Director of community and economic development Todd Cagnoni\nCagnoni says the top priority for the city is the security and fire safety violations of the building.\nThe city has given the clock tower one week to address these violations. We did reach out the hotel management they did not return our calls.\nUPDATE: ROCKFORD, Ill. (WIFR) – A shooting that left one man dead and five injured has the city questioning the security of the clock tower prompting them to inspect the 250 room hotel, finding several problems.\nA nearly four hour inspection was conducted at the hotel by city and fire inspectors who have now ordered management of the 250 room hotel to hire additional fire watch and security at the convention center located in the 7800 block of East State Street.\nRockford Fire and Police were involved in the inspection. Officers conducted a security check after growing concerns after the shooting last Saturday that left one man dead.\nProblems found during the inspections included problems with the fire alarm system and door security.\nHotel management met with Todd Cagnoni and city fire and police. After the inspection, management agreed to hire additional fire watch and security which are scheduled to be on the property until the problems found during the inspection are fixed.\nWe did reach out to management, although they have not returned our calls. Earlier this week, the mayor addressed the Clock Tower shooting and mentioned that the city would be looking into inspections at the hotel.\nHe says there are enforcement opportunities if the property where crimes are taking place show a pattern of inappropriate criminal behavior.\n------\nUpdated: October 16, 2016\nUPDATE: ROCKFORD (WIFR) -- The man killed in Saturday morning's shooting at the Clock Tower Resort has been identified.\nThe Winnebago County Coroner's Office says Marcello Brown, 23, was pronounced dead around 4:15am Saturday.\nAn autopsy is pending.\nRockford Police are investigating.\n-----\nUpdated: October 15, 2016\nROCKFORD, Ill. (WIFR) - A 23-year-old man is dead and five others are hurt. One of those victims critically after an overnight shooting at a party.\nOne guest of the resort who wanted to remain anonymous says she was in her room at the time of the shooting. \" I heard screaming and called the police. I was scared to open my door.\"\nPolice say the shooting happened Saturday before 12:50AM at a private party at the Clock Tower Resort in the 7000 block of East State Street.\nOfficers found a 23 year-old gunshot victim lying in the hallway floor. He was pronounced dead on the scene.\nInvestigators say another gunshot victim a 20 year-old man was taken to the hospital and is in critical condition. Officers found four other gunshot victims at the party, an 18 year-old woman, and three men ages 18,19 and 21. All of their injuries were non life threatening.\n23 News spoke with a Rockford man checking into the resorts who wanted his identity kept private. He says he's not worried for his safety and believes this is an isolated incident.\n\"It doesn't really bother me. I don't think it's going to really occur again. It's possibly one of those things that just happened to occur where it was just an unfortunate situation.\"\nThe resort declined to comment on the shooting. They remain open today.\nThe victim's name has not been released and no arrests have been made. Anyone with information regarding this crime is asked to call Rockford Police.\n------\nPosted: October 15, 2016\nROCKFORD, Ill. (WIFR)- A 23-year-old Rockford man is dead and five are injured, one critically after an early morning shooting at the Clock Tower Resort.\nRockford police say it happened just before 1 a.m. at the Clock Tower Resort at 7801 East State Street. They say during a private party at the resort, a fight broke out that ended in the shooting.\nPolice say they found two men suffering from gun shot wounds, one was pronounced dead at the scene. The other is in critical condition at the hospital this morning. Four other people were taken to the hospital for non-life threatening injuries.\nDetectives are conducting an investigation, and the name of the deceased is being withheld pending family notification. If you know anything about this shooting, call Rockford police or Crime Stoppers."}