{"uri": "http://www.wral.com/police-2-children-1-teen-shot-in-durham/15948348/", "title": "Police: 2 children, 1 teen shot in Durham", "dct": "Sun, 21 Aug 2016 00:00:00 GMT", "id": "35bccdecab846dfbc2933599108d5500", "content": "Video Playback Not Supported\nPlay Video\nPlay\nMute\nCurrent Time 0:00\n/\nDuration Time 0:00\nLoaded: 0%\nProgress: 0%\nStream TypeLIVE\nRemaining Time -0:00\nPlayback Rate\n1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptions\nFullscreen\nAutoplay:\nOn / Off\nThis is a modal window.\nThis video is not supported on your platform. Please make sure flash is installed.\nCaptions Settings Dialog\nBeginning of dialog window. Escape will cancel and close the window.\nText Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps\nDefaults Done\nPolice: 2 children, 1 teen shot in Durham\nAre you still watching?\nYes, ContinueNo\nFind News Near Me\nDurham, N.C. — Officials say a 16-year-old and two children were shot late Saturday in Durham.\nAround 11:30 p.m., officers with the Durham Police Department responded to a shooting in the 600 block of Reservoir Street.\nThey found three males, a teenager and two 11-year-old children, with gunshot wounds. One of the 11-year-old boys was seriously injured in the shooting and remains in the hospital, officials say.\nAccording to the brother of one of the victims, the boys were playing outside in the street when the shooting occurred.\n“All of a sudden, I heard some ‘pop, pop, pop, pop pow’ and next thing I know, we were ducking; people running around here man, scattering everywhere,” said neighbor Bernard Hatley.\nIn the daylight Sunday morning, a bullet hole was plainly visible in Hatley’s Toyota Camry. He was inside his home when the incident occurred and didn’t see where the shots came from.\n“I just call it something random, you know. It’s sad, just sad man,” Hatley said. “It’s a sad day for me, knowing what happened to the kids in this neighborhood.”\nThe brother of one of the victims said his parents are out of the country and family members at the homes of the other two victims did not want to speak.\nThe investigation is ongoing.\nAnyone with information is asked to call Crime Stoppers at 919-683-1200."}