{"uri": "http://www.nbclosangeles.com/news/local/Three-Shot-Including-Child-in-Altadena-385651721.html?_osource=taboola-recirc", "title": "'A Bullet Has No Name': Gunman in Vehicle Shoots, Kills Boy Outside Home", "dct": "NODATE", "id": "5e8ac7773af1c0db78599f1af86c7cad", "content": "The hunt continued Wednesday for a gunman who killed a 4-year-old boy and wounded a 27-year-old man in a drive-by shooting in Altadena.\nThe gunman drove up to a home in the 300 block of Figueroa Drive, just east of the Foothill (210) Freeway, at 10:30 p.m. Tuesday and opened fire, according to the sheriff's department.\nBoth of the victims were sitting on the porch of the home. Both were taken to Huntington Memorial Hospital in Pasadena. The boy, identified as Salvador Esparza III, died, said coroner's Assistant Chief Ed Winter. The man -- who deputies described as a family friend not related to the child -- remained hospitalized with injuries that are not life-threatening, Deputy Trina Schrader said.\nA sheriff's detective said the boy was not a target, but at least 13 rounds were fired.\n4-Year-Old Shot and Killed in Drive-By Shooting in Altadena\nA four-year-old was shot and killed in a drive-by shooting in Altadena on Tuesday night, July 5, 2016. Detectives are still searching for the shooter. Annette Arreola reports for NBC4 News at 11 a.m. on Wednesday, July 6, 2016. (Published Wednesday, July 6, 2016)\n\"It's never easy when you see a child lose his life and it's never easy for anybody and of course he's not the intended target, not the intended victim in this,\" sheriff's Lt. John Corina said. \"You know a bullet has no name so it just ends up striking a child who just happened to be on the porch.\"\nDetectives were investigating if there was some kind of disturbance or altercation earlier in the evening, Corina said. The suspect was described as a man driving a dark or black car. Sheriff's officials said its unknown if the shooting was gang-related.\nFamily and friends mourned the death of the boy.\n\"He was a nice little boy, happy,\" said neighbor Cameron Jackson. \"He liked to have fun, played in the front yard, always had fun.\"\nCity News Service contributed to this report."}