{"uri": "http://www.greenvilleonline.com/story/news/crime/2015/11/02/4-dead-pendleton-shooting/75051464/?from=global&sessionKey=&autologin=", "title": "4 victims identified after shooting reported in Anderson County", "dct": "Mon, 02 Nov 2015 00:00:00 GMT", "id": "bec3bc4a793fd0eabb1fbc1db1e314c7", "content": "A man, his wife and their mothers were found dead Monday afternoon at their home in Anderson County, authorities said.\nThe Coroner's Office identified the decedents as: Mike Scott and wife Cathy Scott, 60, and their mothers Barbara Scott and Violet Taylor, 82. Mike and Cathy Scott had been married for about nine years, Coroner Greg Shore said. Ages for Mike Scott and Barbara Scott were not available.\nThe Anderson County Sheriff's Office is investigating the deaths at the rural home outside of Pendleton. Deputies were called to the residence on Refuge Road at about 12:30 p.m. in reference to a shooting, Lt. Sheila Cole said.\n\"At this point, we don't know how, why or anything else,\" Capt. Garland Major said as he address the media about 4:30 p.m.\nMajor said there are two homes on the property. The four adults were found inside the home at the front of the property, he said. Cathy Scott's daughter found her family members and called 911, Shore said.\nMike Scott talked to his boss Sunday via text message, Shore said. Authorities are trying to determine a time frame between that conversation and when the adults were found dead. Investigators on Monday night continued to process the scene and look for evidence, Major said.\nAuthorities said there is no threat to the community. No arrests have been reported.\nThe Scotts and their mothers were the only four people who lived at the home, Shore said, although other family members lived at the other home on the property.\nNeighbors and family members were standing outside in the rain under umbrellas for hours on Refuge Road, waiting for answers from investigators. When asked if the incident was a murder-suicide, Shore said, \"We don't want to speculate because we really don't know.\"\n\"We want to give you the right information when we know that it's for a fact,\" Shore said."}