{"uri": "http://www.cleveland.com/metro/index.ssf/2016/08/girl_shot_in_backseat_of_car_i.html#incart_river_home", "title": "Girl shot in backseat of car in Cleveland's North Broadway neighborhood", "dct": "Thu, 25 Aug 2016 11:40:00 GMT", "id": "af13df3ef9b26e9bb4385ec169f61ea0", "content": "CLEVELAND, Ohio -- A bullet grazed an 11-year-old girl riding in a car with her family Wednesday night after a man opened fire at a stop light in the city's North Broadway neighborhood.\nCleveland police are still trying to identify the shooter.\nThe shooting happened about 11 p.m. near the intersection of East 69th Street and Union Avenue, according to a police report.\nThe girl was in the backseat of a Mitsubishi Galant with her 9-year-old brother and an 18-year-old family friend. Her mother and her 18-year-old sister sat in the front, the report says.\nThe mother, who was driving south on Broadway Avenue, noticed an SUV with a lei hanging from the rearview mirror following her, the report says.\nThe mother stopped the car at a red light at Broadway and Pershing avenues. The SUV pulled up behind her. A man got out of the SUV, pulled a pistol and fired four-to-five shots at the car, the report says.\nThe mother sped through the stoplight when she heard the gunfire.\nOne of the bullets grazed the 11-year-old girl's back. Her mother called 911, but kept driving to the Fourth District police station.\nParamedics picked up the girl and took her to University Hospital. Her injuries were described as a \"superficial abrasion,\" according to the report.\nPolice found a bullet hole in the Galant's license plate and one in the back seat. Police towed the car as towed as evidence.\nInvestigators also found bullet fragments at Broadway and Pershing avenues. They did not find the SUV.\nThe girl became the second child in two days shot.\nA 13-year-old boy was shot Tuesday while looking out the window of his house in the city's Hough neighborhood.\nTo comment on this story, please visit our crime and courts comments section."}