{"uri": "http://onlineathens.com/mobile/2015-11-28/oconee-teen-surgery-after-wounding-himself-while-hunting", "title": "Oconee County teen wounds self with rifle while hunting", "dct": "Sat, 28 Nov 2015 15:05:00 GMT", "id": "d9ecdb9be29721f486f10108065fda50", "content": "A 13-year-old Oconee County boy underwent surgery in a metropolitan Atlanta hospital late Saturday afternoon for injuries he sustained after accidentally wounding himself with a .30-06-caliber bolt-action rifle while hunting off Rocky Branch Road in Oconee County earlier in the day, according to the Oconee County Sheriff’s Office.\nThe boy, who was hunting with his father, was able to walk out of the woods after the early-morning incident and was initially transported by ambulance to Athens Regional Medical Center. He received some treatment at ARMC before being transferred to Children’s Healthcare of Atlanta at Egleston in Decatur, according to the sheriff’s office. A call to an ARMC official seeking any information available on the boy’s treatment was not returned as of late Saturday evening.\nThe initial report from the sheriff’s office indicated that the boy’s wound, located high on his upper right shoulder, was not a life-threatening injury, and that he was alert and able to respond to officials investigating the incident.\nNo foul play is suspected, according to the Oconee County Sheriff’s Office. The Georgia Department of Natural Resources was notified of the incident by local authorities and is conducting it own investigation, a post on the sheriff’s office’s Facebook page indicated late Saturday morning.\nThe sheriff’s office is not identifying the teen due to his age, except to say that he is an Oconee County resident. The DNR may be issuing a news release on its investigation at a later time, according to the Oconee sheriff’s office. Efforts to contact the DNR’s regional law-enforcement office late Saturday afternoon were unsuccessful."}