{"uri": "http://www.ajc.com/news/news/bartow-man-shot-at-a-dozen-people-killing-one-befo/ng3kJ/", "title": "Bartow man shot at a dozen people, killing one, before killing himself", "dct": "Fri, 15 Aug 2014 00:00:00 GMT", "id": "626a3710f462bb46647badcc0436e5b2", "content": "The Bartow County sheriff revealed new details Friday about Tuesday’s shooting spree that left one victim dead, several others wounded and the gunman dead from a self-inflicted gunshot wound.\nSheriff Clark Millsap said 20-year-old Austin Denzell Tyler of Cartersville fired a pistol at a total of 12 people and pointed his gun at several others during the 12- to 15-minute rampage.\nMillsap said the Bartow 911 Center began receiving calls just after 3:30 p.m. Tuesday about a man shooting at other people at a home on Brent Circle in Cartersville.\nRoyce Randy Hobgood, 63, of Euharlee, was killed and two others were shot and critically wounded at the Brent Circle location, Millsap said.\nTyler then drove to Milam Bridge Road in Euharlee, where he attempted to shoot two men, causing a minor graze wound to one, according to Millsap.\n“During his travels, he attempted to carjack two vehicles before ramming into a victim and his grandson on River Oaks Drive in Euharlee and taking their Ford Explorer,” Millsap said in a press release.\n“Responding units spotted Tyler in the Ford on Euharlee Road and Highway 113 in Cartersville,” the sheriff said.\n“When the units turned around to pursue Tyler, he traveled on the wrong side of the road and struck a landscape trailer on Highway 113 at Burnt Hickory Road,” Millsap said.\nHe said the Explorer then burst into flames.\n“Deputies approached with caution and seeing him injured, removed him from the vehicle to begin first aid,” Millsap said. “Tyler had shot himself once in the head with his pistol prior to or after the accident and was pronounced dead at Cartersville Medical Center.”\nMillsap said investigators believe the rampage started with an argument between Tyler and one of the shooting victims on Brent Circle."}