{"uri": "http://www.wsbtv.com/news/news/2-months-after-Bartow-County-shooting-victim-/nhXLL/", "title": "2 months after Bartow County shooting, victim still hospitalized", "dct": "Sat, 27 Sep 2014 23:32:00 GMT", "id": "e0969bd02d937411112c844d521e5d19", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nATLANTA, Ga. - A Cartersville family caught in the middle of a wild crime spree says they need the community's help.\nIn August, a 20-year-old man shot at twelve people before turning the gun on himself.\nOne victim is still in the hospital, nearly two months after the rampage.\nChannel 2’s Jessica Jaglois was at the scene that day and Saturday she spoke to one of the victim's family about the challenges they are still facing.\nThe man's family reached out to Channel 2 Action News on Facebook.\nThey said the grandfather of three has been confined to a hospital bed since the shooting took place.\nHe may be finally ready to go home soon, though it's unclear where that home will be.\nSteven Teitsort, 44, is forever changed after the Aug. 12 shooting.\nHis sister said he was helping a friend remodel his home, when the friend's cousin came outside yelling.\n“He remembered hearing the guy say \"f-this\" and remembers falling over the bannister,” Teitsort said of her brother’s recollection.\nBartow County sheriff’s officials identified “that guy” as 20-year-old Austin Tyler, who they said shot Tietsort in the neck.\nHe is now paralyzed from the shoulders down.\n“He’s never had to depend on anyone except now. He's got to depend on me and my mom,” his sister said.\nWith medical bills mounting, his family says when it's time for him to go home; they are not sure where that home will be.\nTietsort's sister says she and her brother have forgiven Tyler, who investigators say went on a fifteen-minute shooting rampage that killed one and injured three before shooting himself.\n“His grandparents are never going to see him again. Yes, my brother's paralyzed, but at least we have him, so we have forgave him,” his sister said.\nDonations for Steven Teitsort can be made at Northridge Bank by giving his name."}