{"uri": "http://www.roanoke.com/news/crime/roanoke/new-indictments-emerge-from-fatal-roanoke-shootings/article_3b5b9afc-7ee0-5d88-ab39-f1292ab2fdc1.html", "title": "New indictments emerge from 2 fatal Roanoke shootings", "dct": "Mon, 01 Jun 2015 20:30:00 GMT", "id": "af62632ca34434c94eb916d383f198ea", "content": "On Monday, a Roanoke grand jury indicted Joshua D’andre Brown on a first-degree murder charge stemming from the May 17 death of Andre Dequan Webb. Webb, 24, was found shot in the 500 block of 36th Street and later died at the hospital.\nBrown, also 24, turned himself in to police the next day and initially was charged with second-degree murder.\nSearch warrants have indicated that police believe that several people were present when Webb was shot and that multiple weapons were fired. Investigators searched a black Infiniti at the scene that had multiple bullet holes in it, and seized cellphones and bullet fragments, according to the warrants.\nBrown was also indicted on one count of using a weapon to commit murder. Because of his indictments, Brown’s case will now proceed into Circuit Court without a preliminary hearing.\nThe grand jury also brought first-degree murder indictments against William Cabbler and Demetrius Wade.\nCabbler, 36, and Wade, 39, were arrested separately after six men were shot early Jan. 4 during a large, late-night party in the 3600 block of Shenandoah Avenue. Four men were injured by gunfire and two others — Lenard Antonio Hamlett and Ronald Lee Ramey — died from gunshot wounds. Roanoke Police Chief Chris Perkins has said that based on the shell casings found at the scene, investigators believe more than one shooter was involved.\nImmediately after the incident Cabbler and Wade were charged with possessing firearms as felons, but in March they were indicted on offenses that included felony murder from discharging a firearm in a building. Felony murder is classified by state law as a killing that isn’t premeditated but results during the commission of a crime. The law does not require proof of intent to kill, merely that someone died as a result of a defendant committing a felony.\nA charge of first-degree murder, however, calls for prosecutors to prove premeditation. It carries a minimum of 20 years in prison and the possibility of a life sentence.\n“We’re tweaking our charges to make sure we’ve covered all the bases when we go to trial,” Roanoke Commonwealth’s Attorney Donald Caldwell said Monday. “Basically these are additional indictments in the respective cases to give us the opportunity to present legal arguments on different theories.”\nBoth men still remain charged with a variety of lesser of offenses, including felony murder, and additional weapons offenses.\nCabbler and Wade are slated to go to trial in July and November, respectively.\nWith regard to the Shenandoah Avenue shooting — a crowded scene that drew criticism from the police chief because of a lack of witness cooperation — Caldwell said additional information was still coming to light.\n“The circumstances about what happened were pretty confused at the time and continue to be developed,” he said. “People have been more forthcoming than they originally were.”"}