{"uri": "http://www.shorenewstoday.com/egg_harbor_township/five-arrested-for-highway-shoot-out-that-ended-in-eht/article_52d5249a-6e22-11e6-90ff-ab6988e8c415.html", "title": "Five arrested for highway shoot-out that ended in EHT and killed township man", "dct": "Mon, 29 Aug 2016 00:00:00 GMT", "id": "3e802afd39074ccf5c76b00c1f578ac6", "content": "EGG HARBOR TOWNSHIP – Five people have been arrested and police continue to search for a third vehicle involved in the highway shoot-out that killed an Egg Harbor Township man and injured four other Atlantic County men on Monday, Aug. 29.\nThe shooting, which New Jersey State Police said began on the Atlantic City Expressway near Exit 12 around 3 p.m., concluded in the parking lot of the airport Wawa at Tilton and Delilah roads and along the Garden State Parkway, leaving a crime scene that stretched for miles.\nAs of Tuesday, Aug. 30, five people were charged in the matter, but police are still searching for information on a third vehicle that may have been involved in the “rolling shoot-out.”\n“Witnesses who observed the shooting also reported a black Dodge Ram pick-up truck that may have been involved in the shooting incident. Troopers are still looking for that vehicle and its occupants. It continued eastbound on the Expressway and is believed to have exited in the Pleasantville area,” police said in a news release.\nThe man killed in the vehicle found on the Garden State Parkway was identified as Rosemund Octavius, 22, of Egg Harbor Township. He was a passenger the vehicle driven by Anthony Hicks, 24, of Mays Landing, who was arrested.\nArrested and charged from the vehicle found at the Wawa were Lenardo Caro, 24, of Little Egg Harbor Township, Yahshaun Stukes-Williams, 19, of Mays Landing (currently hospitalized), Shaun Stukes, 38, of Atlantic City (currently hospitalized), and a 16-year-old male whose name has not been released because he is a juvenile.\n“At this point it seems evident that the people involved in this shooting had some connection with each other and that the crime was not random,” the state police stated.\nJust before 3 p.m. Monday, police dispatch received multiple calls reporting shots fired between moving vehicles on the eastbound Expressway in the area of exit 12.\nShortly thereafter, troopers on the Garden State Parkway received a 911 call for a medical assist on the northbound side at milepost 39. They arrived to find a man in the passenger seat of a silver Nissan Maxima who had died of a gunshot wound. That man was later identified as Octavius. The driver of the vehicle, Hicks, was not injured and stated that Octavius had been shot as he was driving down the Expressway.\nMore 911 calls came in reporting that four males arrived in the parking lot of the Wawa store on Delilah Road in Egg Harbor Township, each with gunshot wounds. They were all taken to Atlantic City Medical Center for treatment. The white Ford Expedition they were traveling in had sustained an estimated 21 gunshots.\nThe SUV had its rear tire missing, two passenger side windows blown out and bullet holes in the cracked passenger side windshield. Blood was also observed in the front passenger compartment and right-side front door of the vehicle.\nAccording to eyewitness Erwin Ashworth of Pleasantville, three male occupants got out of the vehicle and asked to be taken to the hospital.\nInstead he called 911.\nOnce on the scene, New Jersey State Police detectives and Egg Harbor police canine officers traced the path of the Expedition back to a location near the Wawa where they found four weapons including three handguns and one AK-style assault rifle. Additional evidence was located in the Expedition, which was towed to a state police facility for a thorough forensic examination, as was the Nissan Maxima.\nWorking with the Atlantic County Prosecutor's Office, troopers charged five people with weapons offenses. It is not yet clear from which vehicles the shots were fired that killed Octavius or injured the people in the Expedition, so the current charges reflect the early phase of this case.\nPolice said the investigation is still very active and updates will be supplied as new information becomes available. Troopers are still searching areas for additional evidence, so motorists could expect further police activity in the vicinity.\nEach of the four Expedition occupants (Caro, Stukes-Williams, Stukes and the juvenile) were charged with unlawful possession of a weapon, four counts each; possession of a weapon for unlawful purpose; possession of an assault weapon; and possession of a defaced firearm.\nThree of the occupants were charged with employing a juvenile in a crime.\nThe driver of the Maxima, Hicks, was charged with the first two weapons charges from the above list and an additional charge of certain persons not to possess a firearm.\nEgg Harbor Township Municipal Court Judge H. Robert Switzer authorized the charges and set bail at $250,000 full cash on all subjects.\nPolice said the Expedition had four total occupants, all of whom were transported to the hospital for gunshot wounds and various other injuries.\nAround the same time, a silver Nissan was located by troopers on the northbound lane of Garden State Parkway near the intersection of the Expressway. The driver of that car was uninjured, but the passenger had sustained a fatal gunshot wound.\nThe New Jersey State Police is handling the investigation with assistance from the Egg Harbor Township Police Department.\nTraffic on local roads was not affected by the incident, but the Garden State Parkway near exit 38 and the eastbound lanes of the Atlantic City Expressway experienced backups for several miles due to lane closures during the investigation.\nThe Wawa convenience store and gas station stayed open, although police crime scene tape cordoned off the area around the suspect vehicle."}