{"uri": "http://www.kansascity.com/news/local/crime/article101478187.html", "title": "Westport’s weekend violence shouldn’t mar area’s image, merchants say", "dct": "Mon, 12 Sep 2016 19:59:00 GMT", "id": "6aeb88f71db2286869db0a03d7a0a971", "content": "After closing the Westport Saloon early Sunday, manager Stephen Collins heard rapping at the door.\nAn employee of a neighboring establishment wanted to make sure all was OK following a shooting down the road that authorities said left seven people injured.\n“All of Westport’s employees know each other ... sort of like a small town,” Collins said. “We’ve got each other’s backs.”\nBut community closeness is not apt to alter the perceptions of some people that the eating and entertainment district is a place to avoid after midnight.\n“The later, the scarier,” said Amanda Singharaj, 24, who strolled Monday afternoon with fellow nursing students of nearby St. Luke’s College of Health Sciences.\n“During the day I feel very safe,” said Singharaj, a patron of the night scene every couple of weeks. “At night, it’s just kind of scary.”\nEspecially around 3:30 a.m. on a weekend, when the Sunday shooting occurred.\nfacebook twitter email Share\nPolice investigate Westport shooting that injured at least six\nA gunman opened fire into a group of people early Sunday at one of Kansas City’s popular night spots, injuring at least six people. One person has critical injuries.\nSusan Pfannmuller and Chris Ochsner The Kansas City Star\nOne victim told police he hurried into a parking lot after seeing a group that gave him “weird vibes” but was hit by the suspect’s car and shot in the thigh when he stood to flee, according to court documents.\nProsecutors say video from an area business shows the car knocking into the man in the parking lot behind AC Hotel Westport. Two people then got out of the car and fired shots toward the man in the direction of a nearby crowd. By the end of the shooting spree, at least seven people were injured, according to officials.\nJackson County prosecutors announced Monday they charged Kelvin Clark, of Kansas City, Kan., with seven counts each of assault and armed criminal action. His bond was set at $250,000. The 29-year-old has been convicted in both Kansas and Missouri of crimes including battery on a law enforcement officer, tampering with a motor vehicle and interfering with an arrest for a felony.\nAuthorities say that after shots rang out, Clark and another man got back in the car and sped away before quickly becoming involved in a traffic accident at 39th Street and Southwest Trafficway. The two men fled. One of the suspects dropped a gun on the sidewalk. Police saw Clark running and were able to arrest him, documents say.\nKCK man charged with shooting into Westport crowd, injuring seven\n“I don’t know what’s going on,” he allegedly told police as they arrested him. “I was the passenger in a wreck and then I ran.”\nA woman who was inside the car that crashed also was arrested. She told police that she was in the car with two men, the driver and a man in the back seat. The men began talking to another person, she said. She was in the car when gunfire erupted and she ducked down, she told police, according to court documents.\nAt police headquarters, Clark told detectives that he was in Westport and was in the back seat of a car that got into a crash. He said he didn’t know whom he was with; he was too drunk to remember, according to court documents. He was not in any altercation, he told police.\n“We’re 100 percent certain he wasn’t a customer of Westport,” said Kim Kimbrough, executive director of the Westport Regional Business League. “It was a drive-by. Unfortunately it happens all over our city.\n‘Still alive ... got shot last night’: Westport gunfire injures at least six\n“Westport somehow gets painted as the wild, wild West, and it just isn’t true. ...This is not the same place it was 15, 20 years ago, when there was a problem.”\nKimbrough said that the number of felonies, misdemeanors and ordinance violations was down 14 percent in 2015 from the year before, and “we’re on pace this year to be even lower than that.”\nSaid Collins: “When you look at Westport now and when I came here six years ago, there’s more money. It’s upscaling. ... Honestly, I’ve never felt safer.”\nSpecific data on Westport crime were not available Monday. But, according to Kansas City Police Department data on crimereports.com, there has been an average of 7.6 reports of varying kinds of assault per month in the immediate area surrounding the Westport entertainment district — the blocks south of West 39th Street and north of West 43rd Street and between Main and Summit streets.\nJohnny Foster, who has lived near Washington and 30th streets for three years, credited Westport’s popularity for it getting more attention than other areas when trouble occurs.\nAnd trouble will occur anywhere crowds linger after nightclubs close, Foster said.\n“You shouldn’t be out walking alone at 4 a.m. no matter what part of town,” he said.\nRick Montgomery: 816-234-4410, @rmontgomery_r\nKaty Bergen: 816-234-4120, @KatyBergen"}