{"uri": "http://www.rgj.com/story/news/crime/2016/12/07/police-scanner-indicates-officer-involved-shooting-hug-high/95101402/", "title": "Knife-wielding student shot by police officer and in critical condition", "dct": "Wed, 07 Dec 2016 00:00:00 GMT", "id": "f0135ed9e2fc4127a8301ee2ffbe9af3", "content": "Marcella Corona/RGJ\nA student brandishing a knife at Hug High School was shot by a Washoe County School District police officer Wednesday morning, sending the campus into lockdown for the rest of the day as police went room to room accounting for all students and finding witnesses.\nJustin Clark, who identified his son Logan Clark, 14, as the student shot Wednesday by a police officer during school, said the family is being represented by Reno attorney David Houston.\nThe Washoe County School District and Reno Police Department, heading the investigation, wouldn’t identify the student shot by police but said he's in critical condition at a local hospital.\nReno police spokesman Tim Broadway said the officer who shot the student is on paid administrative leave. Police aren’t yet releasing the officer’s identity.\nIt is routine procedure to put officers involved in shootings on leave.\n“A student is in the hospital, and a thorough investigation is underway,” said the district in a statement, emphasizing that it immediately called Reno police, the Washoe County Sheriff’s Office and the FBI for assistance following the shooting.\nReno Police Chief Jason Soto said the incident began at 11:25 a.m. with an altercation between two students. One of those students drew a knife and tried to attack others. At that point, a school police officer told the student to drop the knife, Soto said. When the student didn't cooperate, the officer shot him and then provided medical attention, he said.\nWitness testimony and videos posted to social media on Wednesday also depict the incident.\nSiobhan McAndrew/RGJ\nOne video posted on Facebook about 1:30 p.m. showed the moments leading up to the shooting. The video starts with several students avoiding a boy in a blue shirt brandishing a knife. A male voice can be heard yelling to the crowd of students, “Back up, back up!”\nAt 22 seconds into the video, a single gunshot is heard and several students scream. The camera then shows the boy writhing in pain on the ground. A police officer can be seen approaching the boy with a pistol drawn, still pointed at him.\nSchool officials begin to yell, “Get out of here!”\nThe police officer approaches the boy and appears to move something away using his feet. The officer then kneels next to the boy and turns him over on his back. Before the video ends, the officer can be seen using his radio.\nIn a video posted on Twitter at 12:39 p.m., the same boy is seen waving his knife in attack. Another video posted at 12:40 p.m. depicts the moments immediately following the shooting as the police officer approaches the boy who is now on the ground.\nThe videos don’t show when or why the student pulled out a knife.\nJiselle Mandugano said she saw the incident. The 17-year-old Hug student said she was outside the cafeteria as students were leaving lunch when she saw a group of students gather around two other students who appeared to be fighting.\nOne student pulled out a knife and began swinging at the other, Mandugano told the Reno Gazette-Journal.\n“The other kid tried to avoid it,” she said. “I didn’t see him get shot. I just saw him fall to the floor.\n“I was scared. I don’t know what I was feeling.”\nHug freshman Robert Barragan also said he witnessed the shooting and provided the same details. He said the police officer shot the knife-wielding student in the shoulder area. The student fell to the ground and another officer arrived, Barragan said.\nMadison Davidson, 14, was already in her English class when she heard people screaming.\n“I was kind of scared, but I didn’t think it was real,” Davidson said. “Then people said it was real, and I just felt sick to my stomach.”\nJonathan Montelongo, 17, was standing by the school gym after lunch when he heard what sounded like a shot. He was hanging out with his cousin Ariana Montelongo, 18, and friend Jose Luna, 17.\n“They usually light firecrackers, and we didn’t think it was a gunshot,” Montelongo said. “Then we saw students running out, and we weren’t going to stay here. So we just started running.”\nMontelongo, his friend and cousin all ran across the football field and crawled through a hole in the fence to get off campus. As he was running, he said he heard a female voice announce a code red lockdown over the school intercom.\n“She sounded really scared,” Montelongo said.\nThe school was locked down immediately following the shooting, forcing students and staff to remain in their classrooms as police blocked all access to the campus in north Reno. Police also shut down Sutro Avenue and told all parents to wait at the school gate behind the Sonic restaurant on McCarran Boulevard until students were allowed to leave.\nAt about noon, the district sent an email to parents across the district. The message didn’t mention a police shooting or student injury, just that Hug was locked down following “an incident on campus.\"\n\"The campus is currently stable and secure with a heavy police presence at the school,\" the district said in its email to parents.\nDistrict spokeswoman Irene Payne said Hug parents were called notifying them of the incident and the lockdown. Students weren’t released until a couple of hours later after 2 p.m., but parents showed up immediately to learn what they could.\nDemick Laflamme was one of those parents, standing outside the schools’ gate for hours. Laflamme said his son is friends with the shot student. He told the Reno Gazette-Journal the boy had been “bullied for days.”\n“He is my son's best friend. He's a victim and he's only 15 years old,” said Laflamme, adding that the student \"is over at my house almost every day.\"\n\"He's a good kid,\" Laflamme said about the student. \"All of his friends like him. Hell, even I love him and I don't like kids.\"\nLaflamme said the student has talked about being bullied.\n\"The kids take bullying into their own hands, and he was shot for it,\" Laflamme said.\nLaflamme said he found videos online and was horrified to see his son standing next to the shot student, his friend.\n\"How could they shoot a kid in front of a bunch of other kids?\" he asked. \"My kid was right there. He could've been hurt. My son tried to go help (his friend) and the police told him to back off.\"\nLaflamme was reunited Wednesday afternoon with his son, Demick Laflamme Jr., 15. Laflamme's son said he was surprised by what happened on Wednesday.\n\"I wouldn't ever expect him to do this,\" Laflamme Jr. said about his friend. \"I don't even know what happened. It happened fast.\"\nElizabeth Foldi waited outside the school for hours, only to discover police took her son off campus for questioning because he witnessed the shooting. Her 15-year-old son told her as much in a text at about 2 p.m.\nShe was furious.\n“They don’t have permission to take my son away,” Foldi said. “How can they do that? He needs a parent. He needs a support system.”"}