{"uri": "http://www.wwltv.com/news/local/jefferson/jpso-deputy-shoots-kills-robbery-suspect-in-metairie/282405114", "title": "Sheriff: Deputy is one of 'luckiest men in America' when suspect's gun jams", "dct": "Thu, 28 Jul 2016 00:00:00 GMT", "id": "0992c4bc5d14bb4511ba9ec393f66b06", "content": "METAIRIE, La. -- A 17-year-old robbery suspect was shot and killed by a Jefferson Parish deputy late Tuesday night inside of the old Times-Picayune, currently NOLA.com warehouse in Metairie, according to Jefferson Parish Sheriff's Office.\nSurveillance video from inside of the warehouse seems to show the suspect going through the warehouse. A short time later a deputy appears and then the two face off from several feet. The suspect, identified as Devon Martes, appears to point his gun at the officer, who pulls his own weapon. The suspect then puts the weapon at his side, but brings it up again and points it at the officer before being shot.\nSheriff Newell Normand said that Martes tried to fire at the officer, but his gun jammed.\n\"My deputy is one of the luckiest men in America this morning.\"\nThe JPSO said Martes was shot six times.\nNormand got agitated during the press conference as he recalled some reports listing Martes as the victim in the shooting.\n\"Devon Martes is not the victim,\" he said loudly. \"The victim in this case is Deputy Dalton.\"\nNormand also said it was fortunate that the shooting occurred in a warehouse with a video that captured the entire incident. He used part of his press conference to talk about the dangers he said officers face on a daily basis, noting that they took 890 guns off the streets last year and almost 500 so far this year.\n\"Split-second decisions,\" Normand said. \"If that gun hadn't jammed, I could be planning the funeral of a deputy.\"\nAccording to the JPSO, deputies responded to a report of two suspects rolling shiny objects down the street shortly before midnight near the Veterans Ford new car storage lot, which is behind the warehouse.\nOfficers found tires had been stripped from a brand new, high-end, Ford F-150 Super Crew pickup.\n“When police responded, one of them (suspects) took off, the other jumped the fence and went into the warehouse,” said Ford inventory manager Hutch Hutchinson.\nJPSO officers who were patrolling the area responded to the call and began searching the area. Deputies said a man was seen running toward the garage area of a Times-Picayune warehouse, 4013 N I-10 Service Road.\nAccording to JPSO, one of the responding officers, Deputy David Dalton, said he saw a male wearing blue jeans and a black tee shirt enter the garage on the north end of the building.\nDalton followed the suspect into the garage and told authorities he turned around facing Dalton and pointed a handgun at the deputy, JPSO said.\nDalton drew his service weapon and fired six shots. Martes collapsed and was pronounced dead at the scene.\nJPSO said the suspect was carrying a 9mm handgun with an obliterated serial number. The second suspect remains at large.\nDuring a search of the vehicle parking lot, JPSO deputies said a new Ford pickup truck was found resting on blocks and was missing tires and wheels.\n(© 2017 WWL)"}