{"uri": "http://www.nola.com/crime/index.ssf/2016/07/jpso_shooting_metairie_newspap.html#incart_most_shared-crime", "title": "Watch video of fatal JPSO shooting at The Times-Picayune warehouse", "dct": "Wed, 27 Jul 2016 11:20:00 GMT", "id": "4c43a61675a7cf7f0bf5ba119b5ef278", "content": "Surveillance video from a newspaper warehouse in Metairie recorded a confrontation involving a Jefferson Parish Sheriff's Office deputy who shot and killed a man who authorities say pointed a gun at the officer Tuesday night (July 26).\nThe video was released by Advance Central Services-Southeast, a sister company of NOLA Media Group, which operates NOLA.com and publishes The Times-Picayune. The Jefferson Parish coroner's office identified the man killed as Devon Martes, 17, of Metairie. An autopsy is underway, according to Deputy Coroner Granville Morse.\nThe shooting occurred just before midnight at 4013 N. Interstate 10 Service Road, Metairie, inside the warehouse used to sort and distribute newspapers to dealers for delivery. The warehouse doors were open, but no one was inside at the time of the shooting, the company's office manager said.\nThe Sheriff's Office received a 911 call at 11:46 p.m. reporting two suspicious people who were \"rolling shiny objects down the street\" near Ford Street and Cleary Avenue, said spokesman Col. John Fortunato. The pair was seen jumping a fence near a car dealership's new vehicle storage lot, he said.\nAnother caller spotted them running towards the I-10 Service Road. Deputies who began searching the area spotted a man running towards the back of the newspaper warehouse.\nSecurity footage shows the man running into the warehouse through a roll-up door. The man, who was wearing a backpack, darts around a corner and appears to discard an object on a nearby table as he peers into a separate, rear warehouse.\nBut the man quickly turns around, appears to grab the object from the table and heads back the way he came. The man turns the corner as an officer, identified by JPSO as Deputy David Dalton, enters the warehouse.\nThe man can be seen raising a dark-colored object that the Sheriff's Office identified as a 9mm pistol and pointing at the deputy twice. Dalton fired a total of six shots, according to Fortunato.\nOnce hit, the man stumbles to his right, into a wall near restrooms and onto the ground. He was pronounced dead at the scene, Fortunato said.\nInvestigators determined the man had been holding a pistol with an obliterated serial number, JPSO said. Deputies who searched the car dealership's parking lot behind the newspaper property discovered a brand new Ford pick-up truck resting on blocks with two missing tires.\nNewspaper dealer Yolanda Treece was headed to the warehouse about 12:25 a.m. to pick up newspapers for delivery when she said she noticed patrol cars that appeared to be following her.\n\"We were trying to figure out what was going on when,\" Treece said. \"I was pulling into the parking lot, and I saw deputies in front of the building.\"\nShe noted at least one of the deputies was carrying what she called a machine gun.\n\"They stopped me and said I couldn't go in at that time,\" Treece said. She left and returned around 3 a.m. after the Sheriff's Office cleared the scene.\nSheriff Newell Normand is expected to release additional details about the shooting during a 3 p.m. news conference.\nStay with NOLA.com | The Times-Picayune for more on this developing story."}