{"uri": "http://wncn.com/2016/12/26/teen-who-was-1-of-7-injured-in-nc-moose-lodge-christmas-party-shooting-speaks-out/", "title": "Teen who was 1 of 7 injured in NC Moose Lodge Christmas party shooting speaks out", "dct": "Mon, 26 Dec 2016 06:41:00 GMT", "id": "9c2a18021721b03730a745b2c8445c95", "content": "MADISON, N.C. (CNN Newsource) – Deputies are looking for two suspects after a shooting at a Christmas party in North Carolina.\nSeven people were wounded at a private party in Rockingham County Saturday.\nPrevious coverage: Pair sought after 7 shot during NC Moose Lodge Christmas party\nA Mayodan mother is thankful her daughter is alive.\n“She could’ve been dead today on Christmas eve,” said Tammy Joins.\nHer 18-year-old daughter Daisy was one of the seven people shot during a Christmas party at the Moose Lodge in Madison.\n“I can’t believe somebody could do something like that with all those people’s lives at stake. Goes to show you there’s mean people everywhere,” Joins said.\nAccording to the Rockingham County Sheriff’s Office, more than 250 people were at the party when two masked men started shooting after 2 a.m.\nDaisy Joins was shot in the ankle.\nPrevious coverage: 7 shot at NC Moose Lodge during private party\n“People were arguing and then it calmed down and that’s when everybody was about to leave. It was calm and then randomly, people just started shooting,” she said.\nThe Rockingham sheriff says people were trying to get away from the shooters. That’s why many of the victims were picked up at different locations. Daisy and one other victim were found at s Checkers on Highway 311.\nTwo victims stayed at the Moose Lodge, one crossed the county line, another was found at a school parking lot and the seventh victim made it to a hospital in Reidsville.\nAll have non-life threatening injuries.\n“Scary. I’m very lucky. It could’ve been a lot worse,” said Daisy Joins.\nJoins said she did not see the shooters.\n“No one did anything. It was just because they were mad so I do hope police catch them.”\nShe said she doesn’t know who exactly threw the party but she said most of the people there were between the ages of 18 and 30.\nDeputies said there was alcohol available at the event.\nJoins’ mom wants the suspects caught.\n“There could be people dead today because of them going in there and being stupid and shooting. I hope they do catch them because I’m going to be there at every hearing they have,” she said.\nThe suspects had their faces covered with ski masks during the shooting.\nThe county sheriff said they were later seen leaving in a silver vehicle being driven by a woman.\nCary's mayor strongly hinted in a blog post that a \"blue and yellow\"…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}