{"uri": "http://www.greensboro.com/news/crime/six-shot-when-partygoers-open-fire-at-madison-moose-lodge/article_da8a6e7a-c9d2-11e6-b49c-ab5542574ca3.html", "title": "Seven shot when partygoers open fire at Madison Moose Lodge", "dct": "Sat, 24 Dec 2016 00:00:00 GMT", "id": "a2125b479a3f715f79c845f8fd057892", "content": "A seventh victim of the Madison Moose Lodge Christmas Eve shooting was located at Annie Penn Hospital, according to the Rockingham County Sheriff's Office. By 12:30 p.m., RCSO announced that none of the injuries are life-threatening.\nMADISON – Six people were shot following a fight during a Christmas party early this morning at the Moose Lodge, located at 490 K Fork Road on the western edge of Madison. They were transported to area hospitals, and there is no word yet on their conditions.\nThe Rockingham County 911 Center received a phone call at 2:19 a.m. “about multiple gunshot victims at three locations,” Sheriff Sam Page told The Messenger at 6:30 a.m.\nBetween 250 and 300 people were at the party at the lodge when a disturbance occurred inside, he said. Two black males left, and came back in wearing ski masks.\n“They pulled out two handguns and began shooting into the crowd,” Page said.\nThe gunmen fled in a silver vehicle driven by an unknown black female.\nAuthorities arrived at the Moose Lodge, where two gunshot victims were located. Additional victims had left the scene. Two were found around the corner at Checker’s Grill and Grocery on U.S. 311, less than a mile from the lodge. One was located four miles away in the parking lot of Western Rockingham Middle School on Ayersville Road. And the sixth victim was later found in the Stokes County portion of K Fork Road.\nPage described one of the suspects as having dreadlocks and wearing a brown Carhartt jacket and black pants. The other was wearing a light green jacket and black pants.\nInvestigators with several law enforcement agencies continue to work the crime scene.\nAnyone with information on this shooting is asked to call the Rockingham County Sheriff's Office at 336-634-3232 or Crime Stoppers at 336-349-9683."}