{"uri": "http://www.nbclosangeles.com/news/local/Two-Killed-in-Pasadena-Shooting-266894741.html", "title": "3 Killed, 2 Hurt in Pasadena Shooting", "dct": "Sun, 13 Jul 2014 00:21:00 GMT", "id": "c456e786b6e63c5e8e4715684398f1d5", "content": "An alleged gunman surrendered to police Saturday after killing three people and injuring two others, firing at officers and barricading himself inside a Pasadena home, police said.\nThe shooting was reported in the 1700 block of Summit Avenue about 4:20 p.m., Pasadena Police Lt. Calatayud said. Residents were told to shelter in place.\nGood Samaritan, 2 Others Killed in Pasadena Shooting\nThe suspect, identified as 44-year-old John Izeal Smith, of Pasadena, allegedly shot his victims with a semi-automatic rifle before barricading himself inside the house, police said. Earlier reports indicated that Smith was 35.\n\"Not only did the suspect shoot and kill an individual inside the home that started this horrific incident, but then he chased two female victims down armed with a semi-automatic rifle,\" Pasadena Police Chief Phillip Sanchez said.\nA man in his 70s was found dead inside the home, and a woman was found dead on the sidewalk, one with whom he may have had a landlord-tenant dispute. The third victim, a good Samaritan in his 20s, was shot and killed after running to help the man and woman, police said.\nThe woman was identified by authorities as 59-year-old Maria Teresa Aguiar. She was the first of the victims to be identified.\nTwo more people in their 40s were hurt in the incident, but it wasn't immediately clear whether they were both shot.\nPolice said Smith fired at patrol cars, but no officers were hurt.\n\"Apparently the suspect had retreated into the home and started firing from the home at the officer,\" Sanchez said.\nSmith called 911 and spent 25 minutes on the phone with a dispatcher who talked him into surrendering to police just before 6 p.m., police said.\nSmith was arrested and booked in connection with murder, police said."}