{"uri": "http://www.ksla.com/story/33674564/slain-teens-family-members-say-they-need-help-burying-him", "title": "Slain teen's family members say they need help burying him", "dct": "Thu, 10 Nov 2016 04:46:00 GMT", "id": "ca899f7fda5c3ad9f8265aadc269be9b", "content": "SHREVEPORT, LA (KSLA) -\nGrieving family members believe they know the motive for the slaying of their loved one.\nThey also say they need help memorializing the 16-year old.\n\"Right now, we're grieving, we're sorry for our loss and we're asking for donations,\" Kamala Jackson said.\nHer nephew Tremon Jackson was fatally shot Nov. 8 in Shreveport. Now family members say they need your help.\nAnd police are asking for assistance tracking down the 18-year-old suspected of fatally shooting Tremon Jackson.\nThey have a warrant to arrest 18-year-old Sirdetrick Samuels, of Shreveport, on a charge of second-degree murder.\nTremon Jackson's family says when Jackson walked out the back door the night of Nov. 8, a young man approached and asked for a cigarette. Tremon Jackson was shot when he responded that he didn't one, Tremon Jackson's family members said.\nRelatives of the teenager say he was one of the good kids.\n\"We're upset. We're hurt and we're just trying to make it one day at a time,\" Kamala Jackson said.\nAnd his family is trying to come up with $4,000 for his funeral. \"Putting jars out so we can collect donations at corner stores,\" Kamala Jackson said.\nWith no insurance and no donations, family members said can't give Tremon Jackson the funeral they think he deserves.\n\"He was a nice young man. He went to school. He stayed out of trouble. I just want them to stop the violence. Stop the killing and have everything better than what it is.\"\nJackson's family members told KSLA News 12 they are working on a GoFundMe page to help pay for his funeral. Meantime, they'll be setting up jars at nearby stores, including the Fina on Lakeshore Drive.\nAuthorities ask anyone with information that would lead to Samuels' arrest to call Shreveport-Caddo Crime Stoppers at (318) 673-7373.\nCopyright 2016 KSLA. All rights reserved."}