{"uri": "http://www.nola.com/crime/index.ssf/2017/01/man_shot_in_head_killed_in_low.html#incart_river_index", "title": "Man shot in head, killed in Lower 9th Ward, New Orleans police say", "dct": "Wed, 11 Jan 2017 15:52:00 GMT", "id": "89ec061d6ff7db5f5774f675cace765b", "content": "A man was found fatally shot in the head Wednesday (Jan. 11) afternoon in the Lower 9th Ward, New Orleans police said. It was the city's fourth killing in three days.\nOfficers responding to the scene around 3:25 p.m. found the man lying face-down inside of an abandoned house in the 1900 block of Choctaw Street. The victim was pronounced dead at the scene by EMS, police said.\nWednesday afternoon, officers, including detectives from NOPD's homicide unit, were investigating inside a house, peering in a side doorway entrance.\nNeighbors who gathered near the corner of North Johnson and Choctaw streets said they believed the house was vacant and abandoned. The house's windows and front door were boarded up, but an opening in the wall in the rear of the house and an opened side door provided entry points.\nNext to the house -- where the roof appeared on the verge of partial collapse -- was an overgrown, empty lot.\nA woman who lives across the street from the house said she did not hear gunfire all day or last night, and had not smelled anything coming from the nearby house. The woman, who declined to be named out of concern for her safety, said she had not seen anyone coming to or from the abandoned house in the year she's lived across the street.\n\"It's scary,\" said the woman from her front porch. Yellow crime tape was tied off to the railing of her her porch's front steps. \"I got children.\"\nAs police investigated, the marching band and dance team from Martin Luther King Jr. Charter School began practicing a block away from the scene.\nMarching band, dance team from nearby MLK Jr. school practicing block from homicide scene in Lower 9th @NOLAnews pic.twitter.com/pblT6VPovu\n-- Emily Lane (@emilymlane) January 11, 2017\nCelestine Anderson, who has lived in the neighborhood more than 40 years, said the house where the body was found has been vacant since before Hurricane Katrina, when levee breaches caused flooding in the area in 2005. The one-story house would have been covered by water, she said.\nWhile other abandoned lots in the area had shoulder-height overgrowth, the lawn surrounding the house where detectives focused their investigation appeared to be manicured. Another neighbor said she occasionally saw someone, who she presumed to be the owner, cutting the grass there.\nAn Orleans Parish Coroner's Office van arrived at the scene shortly after 5 p.m.\nHomicide Detective Tindell Murdoch is in charge of the ongoing investigation and can be reached at 504.658.5300 with any information regarding this killing.\nThose with information can also call Crimestoppers at 504.822.1111.\nThis story was updated Thursday (Jan. 12) with additional information from NOPD."}