{"uri": "http://q13fox.com/2016/10/07/teenager-killed-in-possible-gang-related-shooting/", "title": "Teenager killed in possible gang-related shooting in Auburn", "dct": "Fri, 07 Oct 2016 16:39:00 GMT", "id": "0b7c5421345c5af640540fd81eac1551", "content": "AUBURN, Wash. — Police spent hours searching for suspects after finding a 17-year-old teenager in a car suffering from multiple gunshot wounds Friday morning.\nThe shooting happened in the 2400 block of F Street SE; the victim was found sitting in his car.\nMedics tried to save him but he died at the scene.\nYou need to have the Adobe Flash Player to view this content. Please click here to continue.\nSome neighbors told Q13 News they were stunned to learn the victim was so young.\n“Our children are being murdered in the streets,” said Leticia Figueroa.\nThe calls to 911 came in around 8:30 Friday morning. Auburn Police arrived to find the victim in a white Acura, stopped in the middle of the street.\n“We don’t know at all any information at all as far as why this happened, what transpired before the shooting, really how many people are involved,” said Commander Steve Stocker with the Auburn Police Department.\n“It makes me want to have a neighborhood lookout, that’s for sure,” said neighbor Dianne Lopez.\nLopez said she told detectives she saw people running away from the crime scene; she worries about gun violence in her neighborhood.\n“I’m kind of concerned about the safety of the neighborhood right now because of the past shootings and the present shootings and what’s been happening with our younger generation hurting each other,” she said.\nA police K-9 officer searched for a suspect's trail but detectives said it ran cold. The ATF also helped search for clues.\nAuburn police said the suspect is described as a black male is his late teens or early 20s but added there could be others responsible for the shooting.\n“At this point we do not believe that we have someone running around with a gun just randomly shooting people,” said Stocker.\nNearby schools were placed into modified lockdown for several hours while police searched for clues.\nNeighbors worry about the possibility of several suspects running free in and around their homes.\n“You know it’s just really scary, it’s sad, it’s heartbreaking for the parents, it’s heart breaking for our community to know that this is happening in broad daylight,” said Figueroa.\nDetectives believe the shooting may be gang-related. Anyone with information in the case is asked to call 911."}