{"uri": "http://www.seattletimes.com/seattle-news/crime/man-shot-in-auburn-schools-on-lockdown-in-search-for-suspect-police-say/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_all", "title": "Teen shot to death in Auburn; police search for suspect", "dct": "Sat, 08 Oct 2016 00:40:00 GMT", "id": "3209b033e1d8b02c04589c0a70eb9f96", "content": "Police say a 17-year-old boy was killed in what appears to be a gang-related shooting in Auburn Friday morning.\nShortly after 8:30 a.m., police responded to a report of gunshots near 25th Street Southeast and F Street Southeast.\nWhen officers arrived, the teen was in the driver’s seat of his car, which was stopped in the middle of the road, Auburn police said in a news release. He suffered multiple gunshot wounds, police said.\nMedics tried helping him, but he was pronounced dead at the scene, police said.\nPlay VideoPlayMuteCurrent Time 0:00/Duration Time 0:00Loaded: 0%Progress: 0%Stream TypeLIVERemaining Time -0:00Playback Rate1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptionsAudio TrackFullscreen\nThis is a modal window.\nCaptions Settings Dialog Beginning of dialog window. Escape will cancel and close the window. Text Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps Defaults Done\nThe King County Medical Examiner will formally identify him.\nWitnesses told investigators several people ran from the area after the shooting, police said. Police are trying to identify them.\nThree nearby schools — Olympic Middle, Pioneer Elementary and Terminal Park Elementary — were ordered into a temporary lockdown as a precautionary measure, police said. The lockdown has been lifted.\nAuburn police ask anyone with information on the shooting to contact the department’s tip line at 253-288-7403 or call 911.\nNo other details were immediately available."}