{"uri": "http://komonews.com/news/local/3-dead-1-wounded-in-shooting-during-party-in-mukilteo", "title": "3 dead, 1 wounded as gunman opens fire at Mukilteo house party; suspect arrested", "dct": "Sat, 30 Jul 2016 00:00:00 GMT", "id": "1ee30427849b8d02d3a2604d5466e633", "content": "Neighbors gather near where a shooting took place in Mukilteo, Wash. (Photo: KOMO News)\nMUKILTEO, Wash. - Three people were killed and one was wounded when a gunman opened fire at a house party in Mukilteo early Saturday morning, police said. The shooter killed two people at a fire pit before firing more shots from the roof, the grandmother of one witness said.\nThe gunman fled the scene but a suspect was arrested about two hours later in Lewis County, according to Mukilteo police. He was later identified in jail booking documents as Allen Christopher Ivanov, 19.\nThe wounded victim, identified by friends as Will Kramer, was taken to Harborview Medical Center where he remains in serious condition.\nAt a vigil Saturday evening, friends gathered in support and shared memories of their lost classmates, Anna Bui, Jake Long and Jordan Ebner. The three teenagers, as well as Kramer, graduated from Kamiak High School in 2015.\nAbout 15-20 people were partying at a home in the Chennault Beach neighborhood when gunfire broke out around 12:30 a.m., according to Mukilteo Police. No other details about ages of the victims or what was happening in moments leading up to the shooting have been released.\n\"My granddaughter called us about 20 minutes after midnight that she was hiding; that there had been a shooting and that two of her friends were shot and she was shot at,\" said Susan Gemmer. \"We jumped out of bed, got dressed and got in the car as fast as we could.\" Gemmer said her granddaughter was OK, but in shock.\nPolice say the gunman was gone when officers arrived, but interviews from those at the scene led them to identify a suspect and a vehicle.\nA trooper with the Washington State Patrol spotted the suspect's car about two hours later on I-5 South near Chehalis, traveling about 18 mph over the speed limit.\n\"A high-risk stop procedure was used and a 19-year-old male driver, and only occupant, was taken into custody without incident by troopers,\" said William A. Finn of the State Patrol. \"Troopers were assisted with officers from the Chehalis and Centralia police departments during the stop.\"\nThe suspect, later identified as Ivanov, was questioned and later booked into the Snohomish County Jail for investigation of aggravated first-degree domestic violence murder and two counts of first-degree murder. He has not been charged.\nIt was not immediately known if Ivanov had obtained an attorney. He is expected to be arraigned Monday.\nVictor Balta, a spokesman for the University of Washington, said a student matching that name and age has been enrolled at the university's campus in nearby Bothell, where he was going into his sophomore year.\nGemmer says her granddaughter, 18-year-old Alexis Gemmer, was hanging out at the Mukilteo home with friends from Kamiak High School when a young man showed up with a rifle. Gemmer tells The Associated Press that according to her granddaughter, the gunman shot two people at a fire pit before going onto a roof and firing more shots from there.\nGemmer says the young man who lived at the home tried to lead her granddaughter to safety by running out a garage door, but as he exited the garage, the gunman shot at him. He made it across the street to safety, but Alexis Gemmer ran back inside and hid in a closet, from where she called and texted her grandmother.\nGemmer says the shooter and one of the victims had recently broken up.\nPolice have sealed off the neighborhood where the shooting took place.\n\"Tonight our community has been shaken to the core,\" said Mukilteo mayor Jennifer Gregerson. \"We grieve with the families who have lost those in this horrible event. ... Lives have been changed forever by a cruel act of violence.\"\nShe said a community vigil to remember the victims is planned for Sunday at 7 p.m. at the nearby Church of Jesus Christ on Harbour Pointe Blvd.\nSeveral police agencies from around Snohomish County are helping with the investigation, including officers from Brier, Edmonds, Lynnwood, Mountlake Terrace, as well as deputies from the Snohomish County Sheriff's Office and troopers with the Washington State Patrol."}