{"uri": "http://www.oregonlive.com/pacific-northwest-news/index.ssf/2016/08/seattle_gunman_accused_of_kill.html", "title": "Gunman had to read instruction manual for new rifle just before deadly attack at party, police say", "dct": "Tue, 02 Aug 2016 14:55:57 GMT", "id": "43f2244b504c08ea88be955a6479c5e0", "content": "SEATTLE -- A 19-year-old man who shot and killed three people Saturday at a party in suburban Seattle was so unfamiliar with his newly purchased AR-15 semi-automatic rifle that he parked his car across the street and read the firearm's instruction manual just before the attack, police wrote in a probable-cause statement made public Monday.\nAllen C. Ivanov was arrested by state troopers on Interstate 5 more than 100 miles from the bloody scene in Mukilteo, a north Seattle suburb, authorities said.\nThey said he confessed to the killings and that he did it because he was angry that his ex-girlfriend, Anna Bui, seemed to be moving on with her life after their recent breakup. She was one of the victims.\nThe document also indicates that Ivanov gave a few indications of his troubling intent: He texted someone last week in Tennessee \"regarding committing a mass shooting\"; he posted on Twitter, \"What's Ruger gonna think\" -- an apparent reference to the manufacturer of his rifle; and that he told his supervisor at an electronics store on Friday that the previous night he had put the rifle in the trunk of his car and gone to a quiet spot and just sat.\nIvanov was scheduled to make a court appearance later Monday. It was not immediately known if he had a lawyer.\nIvanov had bought the assault-style weapon about a week before the attack, saying he planned to use it for target practice and that he had signed up for a gun-safety class this month, Mukilteo Police Detective John Ernst wrote in the probable-cause statement.\n\"Ivanov stated that he showed up to the homicide scene at approximately 2200 hours, and parked across the street and watched,\" Ernst wrote. \"He said that he creeped up toward the house and saw A with another male and got angry. He said that he returned to his car, read the instruction manual for the rifle, loaded the magazine, placed the magazine in the rifle, and sent the rifle's selector switch to 'safe.' He then returned to the victim house property.\"\nIvanov told detectives he creeped around the back of the house and hid near the living room windows, where he was eventually discovered by one of the young men attending the party.\n\"The male said, 'No, no no,'\" Ernst wrote. \"Ivanov stated that he was 'scared,' he flipped the selector switch to fire and shot the male. He stated that at that point it was too late to turn back, and once he had pulled the trigger his adrenaline kicked in.\"\nIvanov said he entered the house through a side door, found Bui and shot her twice, then continued through the house, saw through the front door another man running toward the house and shot him, according to the probable-cause statement. From a balcony off the master bedroom, he said, he shot at two more men in the driveway before going onto the roof, realizing his magazine was empty and fleeing.\nIn addition to Bui, of Everett, Jordan Ebner, of Lake Stevens, and Jacob Long, of Everett, were killed. They were all 19 and recent graduates of Kamiak High School in Mukilteo, a waterfront city of 21,000 people.\nA fourth person, 18-year-old Will Kramer, was wounded and remained in serious condition Monday at Harborview Medical Center in Seattle.\nBui and Ivanov were students at the University of Washington.\n-- The Associated Press"}