{"uri": "http://www.cosmopolitan.com/politics/news/a62120/seattle-shooting-allen-ivanov/", "title": "Teen Gunman Kills 3, Allegedly Targeting Ex-Girlfriend", "dct": "Sun, 31 Jul 2016 00:00:00 GMT", "id": "b6556bbc2fb13608191661fac27fde0a", "content": "A gunman attacked a gathering of young adults at a suburban Seattle home, killing two people at a fire pit before firing more shots from the roof, the grandmother of one of the witnesses said.\nA total of three people were killed and another wounded at the property in Mukilteo early Saturday. State troopers pulled over and arrested the fleeing 19-year-old suspect on an interstate more than 100 miles away, authorities said.\nSusan Gemmer said of her 18-year-old granddaughter, Alexis, hid in a closet and called her during the shooting.\n\"We were texting back and forth, telling her to stay quiet, stay calm, we're on our way. She kept saying, 'They're dead, they're dead, I saw them, I was right there and I saw them,'\" Gemmer said.\nPolice did not immediately release the name of the suspect, but a man named Allen Christopher Ivanov (pictured above, right) was booked into the Snohomish County Jail on Saturday afternoon for investigation of three counts of murder, including one of aggravated murder, which can bring the death penalty.\nIt was unclear whether Ivanov had obtained an attorney. He was expected to face a court appearance Monday.\nAlthough officials have not publicly identified the victims, The Seattle Times lists them as Anna Bui (pictured above, left), Jake Long, and Jordan Ebner. Will Kramer, 18, is in serious condition at Harborview Medical Center in Seattle. The Daily Mail reports that Bui was Ivanov's ex-girlfriend and that friends said he was depressed after his split with her.\n\"We have no reason to believe there are other suspects and we're not actively looking for anyone else at this time,\" Mukilteo Police Department Officer Myron Travis said Sunday.\nHe declined to release more information, including the names of the victims. He said a news conference will likely be held Monday afternoon.\nGemmer said that according to her granddaughter, the gunman arrived with a rifle at the party of about 15 to 20 friends from Kamiak High School — mostly recent graduates aged 18 to 20. The gunman walked through the house to the fire pit out back, where he shot two people. Those present knew the gunman, she said, and he and one of those shot had broken up last week.\nThe shooter then made his way onto the roof, where some of the friends were hanging out, Gemmer said.\nThe young man who lived at the home tried to lead Alexis Gemmer to safety by escaping out the garage. As they rolled under the garage door and the boy bolted across the street, the gunman began shooting at him from the roof, her granddaughter told Gemmer.\n\"She panicked and ran back in the house and hid in the closet until police arrived,\" Gemmer said. The young man made it across the street.\n\"Our community has suffered a great loss tonight,\" Mukilteo Mayor Jennifer Gregerson said. \"There were many young people who saw and heard things that no one should ever experience.\"\nThe shooting happened in the upscale Chennault neighborhood of Mukilteo, a waterfront town of about 20,000 people, 25 miles north of Seattle.\nWashington State Patrol Trooper Will Finn said the male suspect was pulled over around 2 a.m. heading south on Interstate 5 near Chehalis, about 113 miles away. Finn declined to release information about his identity, but he said troopers returned him and the vehicle he was driving to the custody of Mukilteo police.\nVictor Balta, spokesman for the University of Washington, said a student matching Ivanov's name, age and hometown of Mukilteo has been enrolled at the university's campus in nearby Bothell, where he was going into his sophomore year.\n\"These victims were just starting the new chapter of their lives as young adults,\" Gov. Jay Inslee said in a written statement. \"Such a loss is difficult to comprehend, and we know the hearts of every Washingtonian go out to their grieving mothers and fathers.\""}