{"uri": "http://www.seattletimes.com/seattle-news/crime/document-mukilteo-shooting-suspect-was-jealous-over-ex-purchased-rifle-a-week-ago/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_crime", "title": "Mukilteo shooting suspect jealous over ex, bought rifle a week ago, police say", "dct": "Tue, 02 Aug 2016 14:32:00 GMT", "id": "d78744de267fd422ad39bbbc49f838f4", "content": "EVERETT — After spotting his ex-girlfriend with another guy through the window of a Mukilteo house where a party was under way, Allen Christopher Ivanov returned to his car Friday night to study the owner’s manual for his new AR-15 semi-automatic rifle, police wrote in court documents.\nTwo hours apparently passed before Ivanov walked back to the home around 12:07 a.m., Saturday, opened fire and killed three young people, including his ex, and wounded a fourth, according to the affidavit of probable cause outlining the police case against the 19-year-old.\nLike Ivanov, all of the victims were recent graduates of Kamiak High School.\nOn Monday, Snohomish County District Court Judge Anthony Howard affirmed a finding of probable cause to hold Ivanov on investigation of one count of aggravated first-degree-murder domestic violence, two counts of first-degree murder and one count of attempted first-degree murder. On Sunday, a court commissioner had also found probable cause to hold Ivanov on the same allegations.\nHoward ordered Ivanov — who appeared via video feed from the Snohomish County Jail — to be held without bail.\nProsecutors are expected to formally charge Ivanov on Tuesday or Wednesday, Deputy Prosecutor Adam Cornell said.\nKilled were Ivanov’s ex-girlfriend, Anna Bui, Jake Long and Jordan Ebner, all 19. Will Kramer, 18, was wounded and was in serious condition Monday in the intensive-care unit at Harborview Medical Center, a hospital spokesman said.\nAlso Monday, a vigil was held for Bui at the University of Washington’s Bothell campus, where she and Ivanov were students. Recently returned from a monthlong trip to Europe, Bui was remembered as a “bright light” who was considering a career in medicine.\nThe mass shooting has rocked a tight-knit group of friends who attended Mukilteo’s Kamiak High School.\nSultan Akbar, 18, had classes with Ivanov and the victims. He wasn’t at the party where the shootings happened, but showed up at court with three friends Monday to express support for the victims’ families.\n“I just feel shook up,” Akbar said. “I’m shocked … those guys aren’t here anymore.”\nHe was friends with Ivanov, who he said seemed to have an explosive temper, once threatening to get Akbar kicked out of school after Akbar reported to a teacher that Ivanov had copied his work.\n“He was always wanting to be in control of the situation” and at times displayed “illogical anger,” Akbar said.\nSeattle defense attorneys Tim Leary and Zach Wagnild were retained by Ivanov’s parents over the weekend and said the couple are devastated for the victims’ families as well as their own. Ivanov’s mother told them Bui “was essentially like a daughter to them,” Wagnild said.\nLeary said he was troubled that Ivanov was able to buy an assault-style rifle but was too young to buy a six-pack of beer. He underscored the police contention that Ivanov read the weapon’s instruction manual just before the shooting.\n“I think it speaks volumes to his youth and inexperience and highlights the lethality of the weapon involved,” Leary said.\nMukilteo police say Ivanov told detectives he broke up with Bui two months ago but then decided he wanted her back, according to the affidavit. He told police he began spending time with Bui last week.\nAfter his arrest, “Ivanov stated that everything that went on tonight was about a girl,” police wrote in the affidavit.\nIvanov became jealous after he said he saw photos of Bui on Snapchat with other young men — evidence “she was getting on with her life without him,” the document says. He told police he realized she was his “dream girl,” “and wanted to get back together,” the affidavit says.\nIvanov said he became angry when he heard from others that Bui “was seeing other guys while the two of them were talking and that made him angry,” police wrote.\nThe affidavit says Ivanov claimed he purchased the Ruger AR-15 rifle about a week ago, intent on using it for target practice. He signed up for a firearms-safety class, which was to begin early this month.\nHe told police he viewed “the rifle as a symbol of power,” the affidavit said.\nOn Friday night, Ivanov left work early because he “wasn’t feeling well,” then went to the Cabela’s store in Marysville to buy a second magazine for the rifle because he had been told he would need it for the firearms class, the affidavit says.\nIvanov told police he arrived at the party in the 10000 block of 64th Place West at 10 p.m. Friday but parked across the street and watched the house, the affidavit says. He crept up toward the house, looked inside and saw Bui “with another male and got angry,” it says.\nIvanov then returned to his car, where he read the owner’s manual for the rifle, loaded the magazine and inserted it into the AR-15, the affidavit says.\nAround midnight, he crept to the back of the house, hiding “along the west wall near the living room windows,” it says. He was discovered by a male partygoer, who said, “No, no, no,” before Ivanov opened fire, shooting the male, according to the affidavit.\nIvanov told police “it was too late to turn back, and once he had pulled the trigger, his adrenaline kicked in.” He entered the house through a side door, found Bui and shot her twice, it says. He continued through the house, then shot another male “running toward the house,” police wrote.\nIvanov went upstairs and onto the balcony off the master bedroom and fired at two more males in the driveway, police wrote. “He then went up on the roof and realized his magazine was empty,” so returned to his car and drove away. He was arrested about 90 minutes later on Interstate 5 near Chehalis.\nAs part of the investigation into the killings, a detective spoke by phone with a person described as a “witness from Kentucky,” who said that two or three days earlier, Ivanov had sent him text messages “regarding committing a mass shooting,” the affidavit says.\nDetectives say Ivanov’s recent social-media posts suggest he “was considering the murders … he later committed.”\nPlay VideoPlayMuteCurrent Time 0:00/Duration Time 0:00Loaded: 0%Progress: 0%Stream TypeLIVERemaining Time -0:00Playback Rate1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptionsAudio TrackFullscreen\nThis is a modal window.\nCaptions Settings Dialog Beginning of dialog window. Escape will cancel and close the window. Text Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps Defaults Done\nVicki Bratvold, whose teenage son hosted the house party where the shootings occurred, texted a Seattle Times reporter Monday, writing “there are no words to express our sorrow.”\n“We have always tried to make our house a loving, safe, happy place that the kids could always come. Our hearts are broken for the parents of Jake, Anna, and Jordan. We are praying for Will’s recovery,” she wrote."}