{"uri": "http://www.palestineherald.com/news/year-old-mother-dies-in-accidental-shooting/article_19fc8d50-efc6-11e5-b598-9fcdf6d034bd.html", "title": "23-year-old mother dies in accidental shooting", "dct": "Mon, 21 Mar 2016 00:00:00 GMT", "id": "e15bd1a36b974547f26519e02f84343d", "content": "An Elkhart woman who died Sunday in accidental shooting was described as a loving mother and wife.\nAn 8-year-old boy picked up a rifle while in a room with an adult relative who was cleaning weapons on Saturday afternoon, said Sheriff Greg Taylor.\nThe gun accidentally discharged in the child's hand with the bullet going through a closed door hitting Carmen Danielle Morris, 23, of Elkhart in the head.\nDeputies responded at 4:34 p.m. to the 300 block of Anderson County Road 1370, and the woman was transported to the Palestine Regional Medical Center. She was later flown to Mother Francis Hospital in Tyler. The 23-year-old Morris died Sunday in Tyler.\nCarmen is married to Josh Morris, who was cleaning his firearms; however, the child is not theirs, Taylor said. Child Protective Services was called to investigate because there were two other children inside the house at the time of the shooting. Deputies interviewed Morris, Taylor said.\nDeputies continue to investigate the incident but believe it's nothing more than a tragic accident at this time, Taylor said.\nThe sheriff is not releasing additional details about the child involved in the shooting; however, the boy was Morris' 8-year-old brother, according to his mother Tammie Johnson.\nJosh Morris kept guns locked away in a safe and taught his children about gun safety, Johnson said. The couple were very outgoing and loving to the community including the Morris' 2-year-old and 5-year-old boys.\nMorris was the “happiest person to be around and always giggling and laughing about anything, said Johnson and a close high school friend, Aerial Rios.\nRios and Morris were on cheer team in middle school and their friendship bond grew through high school. The ladies continued their friendship through social media where Morris made posts and shared photos of her two boys, Rios said.\n“It appeared she was an amazing mother and loved her husband and children very much,” Rios said.\nFriends are putting together a bake sale to help with funeral costs and benefit the family. Donations of money or baked goods can be dropped off between 10:30 a.m. and 7 p.m. Tuesday and Wednesday to Harcat and Lou's Diner in Elkhart. The bake sale will begin Wednesday at the diner, located at 102 W. Parker St."}