{"uri": "http://www.siftingsherald.com/article/ZZ/20151107/NEWS/311079991/-1/news", "title": "Louisiana police arrest 2 officers in boy's shooting death", "dct": "NODATE", "id": "1e994deed03afc461a24a4175e89c101", "content": "This Wednesday, Nov. 4, 2015 image shows orange paint marking the spot where a 6-year-old boy was shot and killed Tuesday night by Ward 2 city marshals in Marksville, La. The marshals had been chasing a vehicle driven by the boy's father, Chris Few. He was shot in the head, but survived. He later was taken to Rapides Regional Medical Center in Alexandria for surgery. The boy, Jeremy David Mardis, died at the scene after suffering multiple gunshot wounds to the head and torso. (Melissa Gregory/The Daily Town Talk via AP) This booking photo provided by the Louisiana State Police shows Marksville City Marshal Norris Greenhouse Jr. Marshal Derrick Stafford and Greenhouse Jr. were arrested on charges of second-degree murder and attempted second-degree murder in the fatal shooting of Jeremy Mardis, a six-year-old autistic boy, on Tuesday in Marksville, La. The shooting also wounded Mardis' father, Chris Few. (Louisiana State Police via AP) MANDATORY CREDIT This booking photo provided by the Louisiana State Police shows Marksville City Marshal Derrick Stafford. Marshal Norris Greenhouse Jr. and Stafford were arrested on charges of second-degree murder and attempted second-degree murder in the fatal shooting of Jeremy Mardis, a six-year-old autistic boy, on Tuesday in Marksville, La. The shooting also wounded Mardis' father, Chris Few. (Louisiana State Police via AP) MANDATORY CREDIT This Wednesday, Nov. 4, 2015 photo shows the intersection near the Marksville State Historical Site where Marksville Ward Marshals chased a man in his car Tuesday night and pinned him in before the man backed into one of their vehicles and Marshals opened fire. A six-year-old boy, allegedly the son of the driver, was hit and killed in the gunfire. The driver was wounded. (AP Photo/The Baton Rouge Advocate,Patrick Dennis)\nNEW ORLEANS (AP) \" Three days after a 6-year-old autistic boy was killed and his father wounded when marshals opened fire on their vehicle in a Louisiana town, authorities have arrested two of the four officers involved in the shooting, the head of the state police announced Friday.\nNEW ORLEANS (AP) \" Three days after a 6-year-old autistic boy was killed and his father wounded when marshals opened fire on their vehicle in a Louisiana town, authorities have arrested two of the four officers involved in the shooting, the head of the state police announced Friday.\nCol. Mike Edmonson, in a late-night press conference, gave few details of what exactly unfolded Tuesday night that led authorities to arrest the officers. But he made his disgust clear.\nSpeaking of the body camera footage that was recovered from the officers, he said: \"It is the most disturbing thing I've seen, and I will leave it at that.\"\nSix-year-old Jeremy Mardis was shot and killed and his father, Chris Few, was wounded when officers opened fire on their vehicle on Tuesday night in the central Louisiana town of Marksville.\nEdmonson said Friday that the two officers are being booked on charges of second-degree murder and attempted second-degree murder in the shooting. Edmonson identified the two officers as Norris Greenhouse Jr. and Derrick Stafford. Both were working secondary jobs in Marksville as marshals when the shooting happened, Edmonson said.\nState police have been investigating the Tuesday night shooting that raised questions almost from the start. Edmonson said earlier that no weapon was found in the vehicle.\nState police are combing through forensics evidence, 911 calls, conducting interviews and reviewing the body camera footage, Edmonson said, as the investigation continues.\nTwo other officers were involved in the incident. When Edmonson was asked whether he anticipated any more arrests, he said: \"We'll see where it takes us.\"\nIt's still unclear what led police to pursue Few and what triggered the shooting. The parish coroner said earlier this week that the officers were serving a warrant on Few when he fled, but Edmonson later said he had no information about a warrant.\nFew's 57-year-old stepfather, Morris German, has accused the marshals of indiscriminately opening fire on the vehicle. German said Few was heavily sedated, unable to talk and has bullet fragments lodged in his brain and lung. He described Few as a loving father and added the man's son \"was his whole life.\"\nGerman added that the 6-year-old had been diagnosed with autism, describing him as a delightful child who \"loved everything, everybody.\" German said the boy had no siblings and the family had recently moved to Marksville from Hattiesburg, Mississippi.\n\"I know a 6-year-old should not have been shot,\" German said."}