{"uri": "http://www.nola.com/crime/index.ssf/2016/10/marksville_boy_killed_deputies.html#incart_river_index", "title": "Family of 6-year-old Marksville boy fatally shot by marshals sues town", "dct": "Sun, 20 Nov 2016 22:16:32 GMT", "id": "c453508e233eb601d60483d197d514b3", "content": "(Cathy Mardis)\nBATON ROUGE, La. -- Relatives of a 6-year-old autistic boy who was shot and killed during a traffic stop filed a federal lawsuit Thursday against the central Louisiana town where two deputy city marshals opened fire on his father's car.\nThe 96-page suit claims Marksville city officials failed to properly train the deputies on the use of deadly force before the shooting that killed Jeremy Mardis and critically wounded his father, Christopher Few, last year.\nThe suit also says the officers involved in the shooting did nothing to stop the boy's bleeding or alleviate his suffering, even after one of them found a pulse on the child.\n\"Sadly, Jeremy was left to suffer - and die - while the officers casually searched for gloves,\" the suit adds.\nThe deputies, Derrick Stafford and Norris Greenhouse Jr., await separate trials on charges of second-degree murder and attempted second-degree murder.\nPolice body camera video that shows two deputy city marshals opening fire on a car, killing a 6-year-old boy and critically wounding his father in Louisiana.\nThe Nov. 3, 2015, shooting was captured on video by a police officer's body camera. Defense attorneys claim Stafford and Greenhouse acted in self-defense, but prosecutors say the video shows the deputies firing on Few's car from a safe distance while his hands were raised inside the vehicle.\nStafford, a Marksville police lieutenant, and Greenhouse, a former Marksville police officer, were moonlighting as deputy marshals on the night of the shooting.\nThe deputies' lawyers claim Few drove recklessly while leading officers on a 2-mile chase and then rammed into Greenhouse's vehicle as he was getting out of it, before he and Stafford opened fire.\nHowever, state District Court Judge William Bennett said the video from Marksville Police Sgt. Kenneth Parnell's body camera doesn't show Few's car posing a threat to the officers as they fired.\nThe family's lawsuit calls the shooting a \"barbaric and excessive use of deadly force\" that fit a pattern of behavior unpunished by town officials who supervised the two deputies.\n\"Proper use of deadly force training would have enabled Stafford and Greenhouse to recognize that neither Christopher nor Jeremy presented an imminent risk of death or great bodily harm to anyone at or near the scene,\" the suit says.\nDuring a news conference last year, Louisiana State Police Col. Mike Edmonson said the video was the most disturbing thing he has ever seen. It shows the bloody but eerily calm aftermath of the shooting, with Few collapsed and bleeding on the pavement while his son's lifeless body is strapped into the front seat.\nMarksville's deputy city marshals -- part-timers who normally serve court papers -- had been stopping cars and writing traffic tickets for months before the shooting. City Marshal Floyd Voinche Sr. began dispatching his deputies on patrols after the City Council slashed the city court's budget at the recommendation of Mayor John Lemoine.\nThe court, which presides over traffic citations, sued the city over the deep cuts in July 2015, saying Marksville had stopped paying the salaries of Voinche, Judge Angelo Piazza III and the court's clerks.\nThe mayor asked the attorney general to review the authority of the marshal's office to issue tickets. During an interview last year, Judge Piazza said his court only keeps a modest cut of ticket revenues and called it a \"misguided notion\" that his court had a financial incentive for deputy marshals to begin writing tickets.\nVoinche, Marksville's city court, Avoyelles Parish and the officers involved in the shooting also are named as defendants in the suit, which seeks unspecified damages.\nBefore the shooting, Stafford and Greenhouse both had been sued over claims that they had used excessive force or neglected their duties as police officers. In addition, Stafford was suspended from the Marksville Police Department after he was indicted on rape charges in 2011, but reinstated after prosecutors dismissed the charges in May 2012.\nStafford's murder trial is scheduled to start Nov. 28; Greenhouse has a March 13, 2017, trial date.\nProsecutors showed the video of the shooting during a hearing last month to support their claim that it was part of Stafford's pattern of hurting people he's arresting. Audio is lacking for the first 27 seconds of the video, then begins after deputies start shooting. Stafford's attorneys argue that the segment without audio makes it impossible to determine if he started shooting before or after Few raised his hands.\nDefense attorneys also have suggested that investigators rushed to judgment. George Higgins, one of Greenhouse's attorneys, said investigators have no evidence that any of the bullets fired by Greenhouse struck Few or his son.\nInvestigators traced 14 shell casings to Stafford's semi-automatic handgun and determined four other shell casings recovered at the scene came from Greenhouse's gun. Of the four bullet fragments recovered from the boy's body, three matched Stafford's weapon and another couldn't be matched to either deputy."}