{"uri": "http://www.ksla.com/story/30592753/officer-involved-in-shooting-death-of-6-year-old-set-for-motion-hearing", "title": "Officer involved in Marksville shooting that left 6-year-old dead makes bond", "dct": "Tue, 24 Nov 2015 11:09:00 GMT", "id": "c5d9f361d2cf87992a7833f7f064f8ce", "content": "MARKSVILLE, LA (WAFB) -\nA judge has allowed one of the police officers accused of killing a 6-year-old boy to post bond and be released from jail.\nJudge William Bennett granted a motion hearing requesting the immediate release of Norris Greenhouse Jr., 23. Greenhouse's family was allowed to post the $1 million bond. He was released just after 5 p.m. on November 24.\nGreenhouse Jr. and Derrick Stafford were both arrested more than two weeks ago after a pursuit in which they are accused of shooting and killing 6-year-old Jeremy Mardis and also shooting the boy's father who survived. Both of their bonds were set at $1 million each.\nAccording to Judge Bennett, this is first time there has been a $1 million bond set for anyone in Avoyelles Parish.\nThe hearing was pushed to 11:30 a.m. because Greenhouse was not initially transported and present for hearing when he should have been. He did not arrive until just before 11:40 a.m.\n\"They have the property,\" the lawyer for Norris Greenhouse Jr. argued. \"They simply want to bond their son out who is innocent until proven guilty.\"\n\"Is it an absurd consequence to tell a parent he can't bond his son out?\" Judge William Bennett asked the attorney for the Avoyelles Parish Sheriff's Office.\nThe sheriff's lawyer said the law should be taken literally as it's written. Greenhouse's lawyer said it was meant ethically, not for families.\nJudge William Bennett's reasoning:\nAlthough the court of public opinion has already tried and convicted both defendants, this court has not. This court is a court of justice and justice will be served. Every person accused of committing a crime is entitled to his day in court and is entitled to a fair trial and bail. There certainly are no ethical considerations applicable to Norris Greenhouse Sr. He is simply a father who desires his son to be released from jail pending trial.\nThe motion states:\nThe facts in the case at bar confirm that Norris Greenhouse, Sr., one of the persons attempting to post a property bond, is an Attorney at Law licensed to practice in the State of Louisiana and is also an Assistant District Attorney for Avoyelles Parish. Norris Greenhouse, Sr. is the father of Norris Greenhouse, Jr., the defendant in these proceedings. Although the Court of public opinion has already tried and convicted both defendants, this Court has not. This Court is a Court of Justice and Justice will be served.\nFurther, this Court is personally aware of attorneys posting bond for their children on prior occasions in Avoyelles Parish, and on each and every occasion this attorney/father did not represent his own son. This Court is also aware wherein an attorney himself in Avoyelles Parish was accused of a crime and allowed to post his own bond. Certainly any other result produces absurd and unreasonable results.\nHis family previously tried to post his $1 million bond, but it was denied because his father is an assistant district attorney. Greenhouse's mother then tried to bond him out, but according to court documents, Avoyelles Parish Sheriff Doug Anderson refused, again claiming Greenhouse's father owned certain property used to secure his release.\n\"The sheriff's reading of Article 320 defies common sense; furthermore, his interpretation of the law yields absurd and unreasonable results,\" the motion reads.\nA group of citizens took a stand outside the Avoyelles Parish Courthouse in honor of Mardis. Children held up signs with messages demanding justice for the little boy.\nThere is no word whether Derrick Stafford, 32, the other officer arrested after the shooting, is planning to post his bond. Both men are Marksville police officers and city marshal deputies.\nGreenhouse and Stafford both face charges of second-degree murder for the death of Mardis on November 3 and attempted second-degree murder in the shooting of Chris Few. The Louisiana Attorney General's office will handle the prosecution of the two officers in the Marksville shooting.\nBoth Greenhouse and Stafford are also ordered to house arrest with electronic monitoring, to surrender all service firearms, and to surrender all badges and/or police officer certifications.\nBoth officers were moved to the Rapides Parish Detention Center. Because they are officers, it was standard procedure that they be put in isolation while they are/were in custody.\nDuring the motion hearing, the judge also amended the gag order for the case.\nCopyright 2015 WAFB. All rights reserved."}