{"uri": "http://www.heralddemocrat.com/news/20161013/man-accused-of-shooting-wife-was-just-going-to-scare-her-affidavit-states", "title": "Man accused of shooting wife was 'just going to scare her,' affidavit states", "dct": "NODATE", "id": "074513b8a01eb174841b401517359caf", "content": "Hide caption Towne\nThe man accused of shooting his wife last weekend fired a shotgun out of the window of the home striking the victim in the right hip, the affidavit for the arrest warrant indicates.\nIn the probable cause section of the affidavit, which was obtained by the Herald Democrat Thursday, the document notes that Samuel Todd Towne, 55, said his wife, who was outside the house, broke the window on the front door and he stuck a 12-gauge shotgun out of that window to scare her. Towne told Grayson County Sheriff's Office investigators that his wife grabbed the barrel of the gun and it went off.\nThe 46-year-old victim was taken to Texoma Medical Center, and hospital officials said she was released Wednesday.\nThe affidavit, which was prepared by Investigator Dusty Wainscott of the Grayson County Sheriff's Office, notes that the incident occurred at about 12:30 a.m. Oct. 8 in the 400 block of Gun Club Road. Wainscott arrived to the scene of the white trailer home at about 1 a.m. He noted in the affidavit there was blood drops and shattered glass outside the door and a bolt action shotgun was located leaning against the wall outside the residence.\nAccording to the affidavit, the incident came about through arguments communicated through texting. Towne told investigators that he and his wife had been arguing through text messages about going out to celebrate her birthday at a bar. The two did not go out together and visited bars at separate times. Towne returned to his home at about 8 p.m. and texted his wife.\nTowne gave consent to investigators to search his phone and read the texts, the affidavit said. Part of the following texts Towne sent to his wife were noted in the report: \"Get out of my life! I've had all I can take from you! Don't bother coming home! Just get out of my life!\"\nAfter sending an explicit text a minute later, Towne later wrote \"House is locked down! Do your damage trying to get in! As always!\" Then two minutes later he sent: \"Hope you don't get shot trying to break in!\"\nAll the documented texts were sent before midnight and the affidavit said they were written without a response from the victim. The affidavit stated that at about 12:30 a.m. Towne spotted the victim pull into the driveway and attempt to enter the house. The shooting incident occurred and the affidavit noted that \"Towne advised that his finger had to be on the trigger due to it going off.\"\nTowne told investigators that after the victim was shot, he offered to take her to the emergency room. She refused and got into her car and drove off. He then called 911 and reported the incident, the affidavit stated. He told investigators that he knew it was his wife as the incident played out and that he was just trying to scare her with the shotgun.\nThe warrant for Towne's arrest was issued Monday and Towne turned himself over to the Grayson County Sheriff's Office on Tuesday. Towne was charged with aggravated assault with a deadly weapon, family violence and bond was set at $100,000. Towne posted bail the same day and was released by the Grayson County Jail.\nOnline court records do not list an attorney for Towne and there was no answer at his home Thursday afternoon."}