{"uri": "http://kdhnews.com/news/crime/shooting-in-north-killeen-leaves-teen-in-serious-condition/article_7cc4f51c-88c9-11e5-a478-6bd57a09e26c.html", "title": "Shooting in north Killeen leaves teen in serious condition", "dct": "Wed, 11 Nov 2015 17:11:00 GMT", "id": "a7e6fb0b189a0309cd13989b758059a4", "content": "Neighbors in the 600 block of Bishop Drive in Killeen said a 15-year-old male was shot Wednesday about 4 p.m.\nThe shooting occurred Wednesday afternoon in the 600 block of Bishop Drive.\nKilleen Police Department officials said Wednesday they were unsure whether the shooting took place at the Bishop Drive residence.\n“We don’t where it happened, why it happened or how it happened,” said Carroll Smith, a KPD spokeswoman.\nSmith said the 15-year-old boy was transported to McLane Children’s Hospital Scott & White in Temple in serious condition. The boy was unable to tell officers where the shooting occurred, a KPD release stated.\nMoments after the shooting was reported, just before 3:35 p.m., EMS personnel could be seen administering to the teen, who was conscious when EMS personnel loaded him into a waiting ambulance.\nAngie Hernandez, who lives across the street from the home where the shooting took place, said the alley behind the rental home is a hotbed of drug activity.\n“There’s so much going on here at night,” Hernandez said. “It’s unbelievable.”\nShe said the home was burglarized several times in the last year.\n“This house got broken into by some people about 15 times,” Hernandez said. “I was in there checking the house when there was somebody in the garage still. They stole everything out of that house.”\nAs she filled out a police statement, Brandie Coss, who rents the home where police responded to the shooting, said she was in her room when the victim’s friends entered and told her the 15-year-old living at her home had been shot.\n“We were in my room with the door shut and all three guys just rushed into our room saying he had been shot,” Coss said.\nWiping away tears, she said the victim is practically family.\n“He lives with us,” Coss said. “He’s basically my son.”\nCoss said she expected the teen to recover.\nSmith said the shooting is still under investigation."}