{"uri": "http://registerguard.com/rg/news/local/35161574-75/man-accidentally-shoots-self-in-leg-at-springfield-hotel.html.csp#", "title": "Man accidentally shoots himself in the leg at a Springfield hotel", "dct": "Tue, 10 Jan 2017 00:00:00 GMT", "id": "00624e5e752cfb757a8498b8dcc6f6df", "content": "So many angry posts from so many people carrying weapons.\nMy experience has been the following:\nA person carrying a loaded gun is a good guy, unless they commit a crime with it, then they are a bad guy.\nA person safely carrying a loaded gun is a responsible gun owner. Unless that weapon is mishandled and it kills someone, like their kid or themselves. They they are just stupid.\nI worked in a building with police officers. They had to pass a two-week training course before they could carry a weapon. And they had to be re-certified every two years with more hours of training.\nI am all for people carrying weapons if they receive the same training. Those with a 90 minute course who think they have trained enough on their own do not engender my trust.\nI'll trust your judgement on that one William. My wife also was a police dispatcher for a period in Iowa. Admittedly a low crime town. But she felt that most officers did not have a round in the chamber but that safeties are designed to be release with one hand and chambering a round was very swift for the officers.\nPolice firing their weapons in Pella was very, very, very rare. I remember only one such encounter in 30+ years and that was a forced entry drug bust in another city that ended up with a dead officer shot by a teenager who didn't know who was busting down the door.\nI've got no experience, but it seem to me the human brain function is more important than the design of the weapon. Really liked your comment William.\nI have spent so much time on ranges either as a shooter, a range instructor, or a safety officer, that I hesitate to judge a class I haven't personally taken. But I basically believe that as far as any training is concerned, more is better!\nUS Marine range officers do things that make US Army range officers cringe! I've shot and run both kinds; the last time I ran an Army group using USMC standards at Camp Pendleton, my Colonel almost had kittens on the spot!\nSince their officer was 'technically' in charge even though we were all Army, he had to sit down and shut up, of course.\nAnd sure enough, even doing a live fire, at night, attacking on and through the objective and withdrawing with M60 Machine Guns firing overhead for suppressive fire, not a single person even stubbed his toe!\nWere you ever in a live fire fight? I think you have but don't remember..... You were a real soldier, not a puffed up vigalante. Being a gun owner doesn't make you a bad person, or good.\nI ran around with toy guns, then bb guns, then air rifles, but stopped at that point. I just had other things to do at that age. I also got nauseous when Butch Cassidy and the Sundance kid had that first 'slow motion' shooting of Bandido's in Columbia. Violence at that time made me ill. But we get numb to the violence. I watched 3 season of Sons of Anarchy and only turned my eyes a couple of times.\nPeople need to not just see, but understand the very real consequences of great pain, horror, fear, grief that comes with a shooting. Practice is fun, killing is not.\nNot everybody is 'built' to handle violence. I would never glamorize it. But I accept violence as a part of human society and I support those that defend the lives of others."}