{"uri": "http://klfy.com/2016/12/09/st-mary-parish-deputy-killed-in-accidental-shooting-thursday-night/", "title": "St. Mary Parish deputy killed in accidental shooting Thursday night", "dct": "Fri, 09 Dec 2016 18:56:00 GMT", "id": "466c89c2371b0ba3822a851d5056c8f5", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nFRANKLIN, La. (KLFY) – An accidental shooting in Franklin has claimed the life of a St. Mary Parish sheriff’s deputy, according to the sheriff’s office.\nThe often quiet neighborhood on Franklin’s west side was disrupted last night by gunfire.\nThe shooting happened in the 600 block of Curtis Drive, near the intersection of Donna Drive.\nFranklin police responded to a shooting around 10 p.m. on December 8, 2016.\nAccording to the initial report, when police arrived, they were told 24-year-old Deputy Jason Hagen was shot in the face by accident.\nHagen worked as a corrections officer at the St. Mary Parish Law Enforcement Center in Centerville for about a year.\nSt. Mary Parish Sheriff Mark Hebert, said in a news release, “it is a sad day. our law enforcement family is mourning the loss of a young man who was just beginning his career in law enforcement.”\nAs a courtesy to both the Franklin police department and the St Mary Sheriff’s Office, Louisiana State Police will conduct the investigation.\nAt this time, the investigation is active, and state police are not looking for a suspect.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}