{"uri": "http://www.wctv.tv/home/headlines/4-Year-Old-Dies-Following-Accidental-Shooting-287108721.html#.VKLPeg8t-XM.facebook", "title": "Man Arrested in Toddler's Accidental Shooting", "dct": "Thu, 08 Jan 2015 00:00:00 GMT", "id": "bdbbcad64d0d54b83027f0c0ffbe0912", "content": "UPDATED\nBy Julie Montanaro\nJanuary 9, 2015\nA Tallahassee man is arrested and accused of leaving a gun within reach of his three-year-old nephew.\nThe toddler accidentally shot and killed himself while playing with the gun at his grandmother's house.\nThree year old RJ Gaines found a gun in the bedroom of his grandmother's house on Dover Street, court records say, and that gun went off. Gaines was shot in the face.\n\"The child, it seems, was playing with the gun unsupervised, and accidentally shot himself and ended up dying from that,\" Tallahassee Police Spokesman David Northway said. \"It's every parent's nightmare.\"\nNow, the boy's uncle, 20 year old Jaleel Taylor is facing a felony charge of culpable negligence for leaving that gun within the toddler's reach.\nCourt papers say the gun was a 380 Taurus semi-automatic. Police found it in a red Nike shoe box in the same room where the child was shot.\nWe talked to the child's aunt soon after his death as the family set up a go fund me page to help pay for his funeral.\n\"No one ever wants something like this to happen to their child,\" Tanisha Taylor said that day. \"You never think something like this, something this tragic, would happen to a baby.\"\nTaylor did not want comment on Jaleel Taylor's arrest today, saying \"Just let people know how much RJ's mother loved him, how much his father loved him, how much his uncle loved him. We all loved him and we miss him.\"\nTPD Spokesman David Northway advises anyone with a loaded gun at home to make sure it in a locked box out of reach of children and better yet, he said, keep the gun unloaded and the ammunition locked up separately.\nBy: WCTV Eyewitness News\nJanuary 8, 2015\nTALLAHASSEE, Fla. -- A Tallahassee man is under arrest - accused of leaving a loaded gun within reach of his three year old nephew.\nLittle RJ Gaines was playing with the gun at his grandmothers house on December 29, arrest papers say, and accidentally shot himself in the face. He died a few hours later.\nGaines's uncle, 20 year old Jaleel Taylor, is now facing felony culpable negligence charges for failing to keep the gun out of the toddler's reach. Arrest papers say the gun was a .380 semi automatic whose serial number had been removed.\nArrest papers say police found the gun in a red Nike shoe box and found a bag of marijuana and nearly one thousand dollars in cash in another shoe box in the attic.\nA Tallahassee family is grieving the death of a three year old boy.\nRJ Gaines died early Tuesday morning after family members say he accidentally shot himself.\nAlthough he didn't make it to his fourth birthday, family members say RJ made his mark.\n\"For somebody to be that small, he touched so many people. And everybody has a memory of him in some way,\" said Tanisha Taylor, RJ's aunt.\nRelatives say RJ was with family members at his grandmother's home on Dover Street Monday night.\nHis grandmother was at work.\nPart of a large family, his relatives say people came in and out of the home frequently.\nThey say RJ picked up a gun someone had left and fatally shot himself.\nThey tell Eyewitness News they don't know who owns the gun.\nTallahassee Police investigators have called the shooting accidental.\nThere's an ongoing investigation.\n\"You never think something like this, something this tragic will happen to a baby,\" Taylor said.\nTaylor also says her sister and brother-in-law didn't have life insurance for their son who was their only child.\nAs a result, the young couple faces not only the loss of their son, but the expense of his pending funeral.\nTo help out, Taylor has put together a website fundraiser.\n\"I did this campaign for my nephew because I know in my heart that it will reach someone,\" she said.\nTo donate to the fundraiser, visit this website:\nhttp://www.gofundme.com/JHIZ8S\nBy: WCTV Eyewitness News\nDecember 30, 2014\nTALLAHASSEE, Fla. -- A 4-year-old child has died following what police have determined to be an accidental shooting.\nTallahassee police say they responded to a home on the 800 block of Dover Street Monday night around 10:45 p.m.\nTPD say the child suffered a serious injury as a result of an accidental shooting and was transported to the hospital for further care.\nThe child passed away early Tuesday morning.\nPolice say that homicide investigators have interviewed witnesses and collected evidence from the scene.\nTPD is asking any community member who may have information about this case to please call TPD at (850) 891-4200 or CrimeStoppers at (850) 574-TIPS."}