{"uri": "http://www.wdrb.com/story/22826901/four-shot-two-fatalities-in-green-county-ky", "title": "Two dead, two injured in Green County, Ky murder/suicide", "dct": "Fri, 12 Jul 2013 17:51:00 GMT", "id": "b8108674c06c34d05ee81c7c53750c93", "content": "LOUISVILLE, Ky. (WDRB) -- Two people are dead and two others critically injured after a man opens fire.\nOfficials say it happened about 10:35 AM CST in a rural area west of Greensburg, Kentucky.\nThey believe it was a murder/suicide.\nWDRB interviewed the victim's sister.\nShe lives just a few feet away and says she isn't surprised this happened.\n\"I want to bring my sister back,\" an emotional Rita Sluder told WDRB.\nRita Sluder says she was inside her home when she heard the gun shots.\n\"I know it was a pistol or something because it kept shooting one right after another about 15 times,\" she said.\nThe shots were coming from Rita's sisters home.\nWhen WDRB was on scene, bullet holes were still visible in the window.\n\"I saw the glass broken on the door and I opened it up real quick and I walked in and when I walked in, there was my sister laying on the floor and I knew she was gone because she had turned colors and Barry Moore was laying there beside her with blood coming out his nose,\" said Rita.\nShe says that's when police showed up.\n\"I ran out screaming, I said please come and help us. Help them. I said they all shot in there. I said he shot them all,\" she said.\nKentucky State Police believe 40-year-old Barry Moore shot and killed his ex-wife, 43-year-old Pamela Moore.\nThey say the couple was divorced but still living together.\nRita says her sister Pamela would run across the yard to their other sister Barbara's house when Barry would get abusive.\n\"Her little fragile body was laying there dying,\" Rita told WDRB.\nDetectives believe Barry chased Pam to Barbara's house where he shot Pam along with Barbara Wright and Barbara's 22 year old granddaughter Ashley Wright before turning the weapon on himself.\n\"Units responded to the scene and upon our arrival, we found the four persons to be victims of gun shot wounds,\" said Trooper Billy Gregory with Kentucky State Police.\nOfficials say Barbara Wright is stable, her condition improving, but Ashley Wright is listed in critical condition.\n\"They don't think she's going to make it. I can't take another death,\" Rita said.\nRita says Barry had threatened to kill all of them multiple times before.\n\"We begged her, please Pam, please do something and she said I can't I'm scared.\"\nOfficials say Pam died at the scene and Barry died later at the hospital.\n\"He is right where he needs to be right now. Burning in Hell,\" said Rita.\nAn 11-year-old juvenile, the son of Barry and Pamela Moore, was also at the residence but left the scene and was not injured.\nA .22 caliber rifle was also recovered at the scene.\nAutopsies are scheduled for Saturday at the State Medical Examiner's office in Louisville.\nCopyright 2013 WDRB News. All Rights Reserved."}