{"uri": "http://www.pjstar.com/news/20160928/police-issue-warrant-in-u-of-illinois-shooting", "title": "Police issue warrant in University of Illinois shooting", "dct": "NODATE", "id": "8b4f10e23aaeb88ac7b402082d533346", "content": "Hide caption This undated photo provided by the Illinois Department of Corrections shows Robbie Patton. Champaign police said Wednesday, Sept. 28, 2016, that an arrest warrant for a first-degree murder charge has been issued for Patton in the deadly shooting at a party Sunday, Sept. 25 on the University of Illinois campus in Champaign, Ill. (Illinois Department of Corrections via AP)\nCHAMPAIGN, Ill. (AP) - An arrest warrant has been issued in the deadly weekend shooting at a party near the University of Illinois campus for an 18-year-old man who was released earlier this month from a state boot camp, authorities said Wednesday.\nProsecutors say Robbie Patton, of Champaign, will be charged with first-degree murder in the early Sunday shooting that killed a 22-year-old man and injured three other people.\nPatton was sentenced in April to eight months in prison after pleading guilty to shooting at an occupied vehicle but was instead sent to the Illinois Department of Corrections boot camp \"over our objections,\" Champaign County State's Attorney Julia Rietz said.\nShe said Patton is believed to be in the Champaign area and may be armed.\nAuthorities still are investigating the shooting, which stemmed from a disagreement at a large party at an apartment in what is known as Campustown, the campus' main commercial district, Rietz and police said. One woman spilled a drink on another, leading to a series of altercations that included one man being badly beaten by several other men, Rietz said. The man who was beaten has since been released from the hospital.\nThe shooting happened a short time later, and police were called at 12:38 a.m.\nNone of the four victims in the shooting were involved in the fight, police have said. George Korchev, a 22-year-old from Mundelein who had recently completed nursing school, though not at the University of Illinois, was killed.\nA second shooting about a half-hour later, several blocks west of campus, injured one person. Police initially thought it was linked to the earlier shooting, but now say that's not the case.\nPatton pleaded guilty in April to aggravated discharge of a firearm in a December 2015 shooting incident. The nature of that shooting and Patton's juvenile record led Rietz to object to his attorney's request that Patton be sentenced to boot camp, she said.\n\"It was a shooting in a parking lot of a restaurant in broad daylight on ... a busy retail area of our community,\" she said.\nBoot camp, she said, also was not part of the plea deal. Had she known Patton's attorney planned to ask for it, Rietz says she might not have agreed to the eight-year sentence - the maximum for which someone can instead be considered for boot camp.\nPatton's attorney in that case, Daniel Jackson of Champaign, did not return a call seeking comment.\nTo be sent to one of the state's two bootcamps , a judge and the Department of Corrections have to agree. The stays range from 120 to 180 days.\nThe department issued a statement Wednesday that said only that Patton \"met the legal criteria for participation\" and the department \"conducted additional screenings before deeming him eligible to participate. \""}