{"uri": "http://www.wsfa.com/story/33641285/officials-id-suspect-17-killed-in-columbus-officer-involved-shooting", "title": "Officials ID suspect, 17, killed in Columbus officer-involved shooting", "dct": "Sun, 06 Nov 2016 13:44:00 GMT", "id": "100c948ee31a03117aec63797ca7c259", "content": "PHENIX CITY, AL (WTVM) - Russell County Coroner Arthur Sumbry, Jr., has identified the suspect killed in an officer-involved shooting and vehicle chase that crossed the Georgia-Alabama state line early Sunday as 17-year-old Christian Redwine of Columbus.\nAccording to the ALEA, they and the State Bureau of Investigation (SBI) are investigating a Columbus police officer-involved shooting at the request of the Columbus Police Chief and Russell County District Attorney.\nThe Columbus Police Department also released more information on the incident.\nAround 4:25 a.m. Sunday, members of CPD's Patrol Services spotted a suspicious vehicle around the businesses near the intersection of Gentian Boulevard and Reese Road.\nThe vehicle was driving in and around several closed businesses and had just been reported as stolen by Columbus 911 Dispatch.\nThe officer attempted to stop the vehicle using blue lights and sirens but was ignored by the driver, who fled the scene. The driver traveled into Phenix City and turned onto Riverchase Drive off Highway 80, where they lost control of the vehicle.\nThe officer exited his vehicle, at which time he encountered three suspects from the stolen car. The officer fired several shots from his service-issued weapon.\nTwo suspects - another man and a woman - from the vehicle were hit and taken to the Midtown Medical Center. Both suspects are expected to be okay.\nThe third suspect, identified as Redwine, was pronounced dead at the scene. The names of the other two suspects have not been released at this time.\nTraffic was re-routed at 33rd Place in Phenix City due to the investigation.\nThis is a developing story; check back for more updates.\nCopyright 2016 WTVM. All rights reserved."}