{"uri": "http://www.charlotteobserver.com/news/local/crime/article30532512.html", "title": "2 killed in Gaston County shootings", "dct": "Sat, 08 Aug 2015 23:46:00 GMT", "id": "28942cb6de078556e6637ec4ee5cbd3b", "content": "Two men, including a retired Gaston County police officer, were killed Saturday, and two current officers were injured in a series of related shootings.\nIn all, five people were shot during the incidents, which took place in several locations in a residential neighborhood south of Gastonia.\nGaston County Police said the suspect was Jeffrey Clyde Wilkes, who was fatally shot by police. Officers believe Wilkes shot and killed Charles Dean Thompson, a former Gaston County police officer who retired in 1995 after five years of service.\nThe shooting took place at a home on Balsam Court. Wilkes lived nearby on Greenwood Drive.\nWilkes also shot Debra Maness Childress, who fled from the home on Balsam Court and took refuge in a neighbor’s house, police say.\nNeighbors in the quiet Gaston County community said they were settling in for the night when the gunfire began. Police said someone called police about 9:20 p.m., reporting a man in the home with a gun.\nThe caller said his father had been shot and that the suspect was still in the home. Several neighbors also called 911, saying there was a man walking around holding a shotgun and wearing a pistol.\nPolice, responding to a call of an active shooter, exchanged gunfire with Wilkes outside a house on Greenwood Drive. Two officers were shot, but neither had life-threatening injuries. The Gaston County Police Department had not released the officers’ names. Childress’ injuries also weren’t life-threatening.\nPolice have not said why they believe Wilkes shot Thompson and Childress at the split-level tan house or why he later opened fire on officers. Thompson’s daughter, Amy, said her father and Childress were friends and that Wilkes was an acquaintance.\nThompson “had never had problems with (Childress or Wilkes),” she said. “I have no idea what transpired here. I don’t know what happened. I don’t know what set this man off.”\nOfficers found Thompson’s body inside the home on Balsam Court. They located the injured Childress at the neighbor’s house.\nThe Gaston County police called in the SBI to investigate the officer-involved fatal shooting. Gaston County police will handle the other fatal shooting.\nThe officers involved have been placed on administrative leave with pay pending the results of the investigation. The Gaston County Police Professional Standard Unit is looking into whether all policies and procedures were followed.\nPolice ask that anyone with information about the case call them at 704-866-3320 or Crime Stoppers at 704-861-8000.\nUpdate: Police on officer involved shooting. @wsoctv pic.twitter.com/obeM937KlK\n&mdash; Alexa Ashwell (@AlexaWSOC9) August 9, 2015\nWootson: 704-358-5046"}