{"uri": "http://www.wsoctv.com/news/news/local/heavy-police-presence-gastonia/nnGJc/", "title": "2 officers, woman injured in Gaston Co. shootout; 2 other men dead", "dct": "Sat, 08 Aug 2015 21:57:00 GMT", "id": "7bab845d5b6a71e50f5711233a967948", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nGASTON COUNTY, N.C. - Police were investigating after they said five people, including two police officers, were shot in Gaston County Saturday night.\nTwo men were killed while two officers and a woman suffered non-life-threatening gunshot wounds after reports of an active shooter in a Gaston County neighborhood.\nThe State Bureau of Investigation is assisting Gaston County authorities following the deadly officer-involved shooting, which led to the discovery of a separate but related homicide.\nhttps://twitter.com/TinaTerryWSOC9/status/630427031285665792\nThe Gaston County Police Department’s 911 center received a call from a home on Balsam Court Saturday night and the caller said that a man had shot his dad and was still inside the home, according to police.\nFamily members told Channel 9 the 27-year-old son came home around 9 p.m. and heard gunshots and glass breaking.\nOfficers responded to Merrywood Lane and Greenwood Drive around 9:15 p.m. as more reports came in of an active shooter in the neighborhood.\nhttps://twitter.com/AlexaWSOC9/status/630204957447294976\nWhen law enforcement arrived , they were confronted outside by Jeffrey Clyde Wilkes holding a shotgun and wearing a pistol, according to investigators. Wilkes opened fire and wounded two police officers, Gaston County Assistant Police Chief Joseph Ramey said.\nAs many as seven officers returned fire and Wilkes was shot and killed, according to Ramey. Officials said Wilkes lived at Greenwood Drive, Gastonia.\n“The next thing we know, seven or eight cops pulled up over here and was getting guns out of their vehicles,\" said store clerk, Nikki Moore. “At that time about 10-15 rounds, shots went off.”\nhttps://twitter.com/AlexaWSOC9/status/630243888897355776\nA short time later, police found the 911 caller's father dead inside the home on Balsam Court and a woman shot and injured in another nearby house.\nPolice identified the man as Charles Dean Thompson, a retired Gaston County Police officer. He retired in 1995 after serving for five years.\nOfficials identified the injured woman as Debra Maness Childress. She lives in the same home as Wilkes on Greenwood Drive, according to officials.\nInvestigators believe Wilkes, the gunman killed by police, had shot and killed Thompson prior to the officers' arrival.\n“We have one homicide victim, and the individual who engaged our officers is the suspect in that homicide,” Ramey said.\nRamey said in a late Saturday night press conference that it’s too early to speculate what led up to the initial shooting.\nPRESS PLAY to watch Gaston County Assistant Police Chief Joseph Ramey brief the press:\n<script language=\"JavaScript\" type=\"text/javascript\" src=\"http://admin.brightcove.com/js/BrightcoveExperiences.js\"></script>\n<object id=\"myExperience4408915901001\" class=\"BrightcoveExperience\"> <param name=\"bgcolor\" value=\"#FFFFFF\" /> <param name=\"width\" value=\"300\" /> <param name=\"height\" value=\"169\" /> <param name=\"playerID\" value=\"1885717126001\" /> <param name=\"playerKey\" value=\"AQ~~,AAAAVzySnGE~,GJOLLPGiYiE4yJXtQU0a40DR9fKXyfCH\" /> <param name=\"isSlim\" value=\"true\" /> <param name=\"dynamicStreaming\" value=\"true\" /> <param name=\"@videoPlayer\" value=\"4408915901001\" /></object>\nThe woman who was hurt, Debra Childress, was shot at another home on Greenwood Drive, Ramey said. He would not confirm the relationships between the two men and woman, but did say the two men were not related to one another.\n“I know we have a couple witnesses and I know we have another individual (woman) that was injured through gunfire,” Ramey said.\nChildress and the two officers who were shot were taken to CaroMont Regional Medical Center.\n“They are conscious, alert and breathing,” Ramey said. “They’re doing fine.”\nhttps://twitter.com/AngelaWSOC9/status/630317128571338752\nThe names of the officers have not been released, but Ramey said one is a veteran of the department and the other man hasn’t been with the force for a very long time. They were both shot in the \"lower extremities,\" Ramey said.\n“I know for the past 18 months police have been under the microscope,” Ramey said. “The officer-involved shootings are a difficult thing to follow right at the moment, but our officers are professional. They acted professional in this incident here, and we’ll get to the bottom of this.”\nOne officer was released from the hospital Sunday. The other officer had surgery Sunday and remains in the hospital.\nMany neighbors were winding down for the night when that shooting spree started. Around 9 p.m. Chris Lee heard a neighbor yelling for help.\n“He just kept repeating, ‘You shot my mom, you shot my mom,’” Lee told Channel 9.\nHe said that neighbor was referring to his mother Debra Childress. Neighbors said she lives in a house on Greenwood Drive with her two kids and the shooter, Wilkes, a man neighbors called a good guy.\n\"He's a very good man I never thought he could do something like this,” said Linda Haney.\n\"They were just telling him please put down your gun, there's no need for this,” Lee said.\nBut neighbors said Wilkes refused to put down the weapon. Lee said minutes later Wilkes turned the gun toward officers and the shootout started.\n“All of a sudden I heard pow, pow, pow, pow pow and seen an officer go down and they was treating him in the middle of the road,” said Haney.\nThompson’s daughter told Channel she has no idea what caused Wilkes to kill her father, but made a statement Sunday night, saying in part, \"Our hearts goes out to all the officers and their families involved in this tragic accident.”\nGaston County Commission Chair Tracy Philbeck tweeted about the shooting on Saturday, saying \"Please keep our officers in your prayers.\"\nhttps://twitter.com/tracyphilbeck/status/630204929014009856\nThe road was closed for roughly 13 hours as police investigated.\nThe Gaston County Police Department is conducting the investigation concerning the murder of Thompson and the attempted murder of Childress.\nhttps://twitter.com/TinaTerryWSOC9/status/630530326431969280\nThe department requested that the North Carolina State Bureau of Investigation investigate the officer-involved shooting. The Gaston County Police Department professional standards unit is launching a parallel investigation to insure all policies and procedures were followed.\nAnyone with information concerning this incident is asked to contact the Gaston County Police Department at 704-866-3320 or Crime Stoppers at 704-861-8000.\nRead more top trending stories on wsoctv.com:"}