{"uri": "http://www.palestineherald.com/news/da-releases-cause-of-death/article_d7ead3a8-8fe0-11e5-a64b-7fe899299eab.html", "title": "DA releases cause of death", "dct": "Fri, 20 Nov 2015 00:00:00 GMT", "id": "4e1b1d7fa504dfc0c82e308023a3e779", "content": "Anderson County District Attorney's Office has reported that the cause of death in the campsite murder murders was by gunshot and blunt force trauma.\nDuring a press conference on Friday, DA Allyson Mitchell reported that the cause of death for Kade Johnson, Thomas Kamp, Austin Kamp, Nathan Kamp, and Carl Johnson were gunshot wounds and that Hannah Johnson died from blunt force trauma. She noted that Carl's autopsy showed that he also suffered from blunt force trauma, along with gunshot wounds.\nAs for the victim, Cynthia Johnson, Mitchell said she is “very grieved” and “an extraordinary strong individual.”\nThe probable cause affidavit states that William Mitchell Hudson went over to the Johnson-Camp property initially to help them move a vehicle that was stuck in the mud. Hudson later retuned to the property to visit around a campfire at which time the group consumed alcoholic beverages. At some point in the evening, Hudson went with Kade and the Kamps to gather fire wood. While the group was in the woods, the only survivor, Cynthia Johnson told authorities she heard multiple gunshots. She said, Hudson later returned to the campsite alone, shooting at Hannah and Carl, who retreated to the travel trailer. Cynthia said she hid from Hudson in the woods.\nDuring the initial investigation of the crime scene and the surrounding area, investigators found fresh blood on a tractor parked outside of Hudson's mother's house. According to the affidavit, dried blood stains were later observed on Hudson by Detective Lee Duran during an interview.\nLaw enforcement also found blood on the ground near the pond Monday afternoon, which led to their discovery of the Kamps and 6-year-old Kade.\nHudson, who was initially arrested on Thursday murder, is now facing six counts of capital murder with no bond recommended by 369th District Court Judge Bascom Bentley.\nIn her remarks about the case, Mitchell said the mass murder is the “single most horrific crime committed in Anderson County's modern history.” She explained that she grew up in Anderson County and grieves with the community. “Our hearts grieve for the Johnson and Kamp families,” Mitchell said. “We will use all resources available to prosecute Hudson to the fullest extend of the law.”\nThe case will be sent to the DA's office to be presented to the Anderson County Grand Jury. It has been announced that attorney Steve Evans will be representing Hudson.\nMitchell has reported that with all the publicity and the “high profile” nature of this case, she may have to consider moving the trial to another county, but stated, “I'll cross that bridge when I get there.” She said it is an Anderson County case and she'll be pushing for it to stay within the county"}