{"uri": "http://westseattleblog.com/2017/01/teen-turns-up-in-er-after-shooting-apparently-accidental-here/", "title": "UPDATE: Teen turns up in ER after shooting – apparently accidental – here", "dct": "Mon, 09 Jan 2017 16:14:00 GMT", "id": "853612721a6524d89b0e086a9511e1f5", "content": "4:14 PM MONDAY: Just found this while going through police reports looking for the newest ones published with narratives:\nA 17-year-old girl showed up in a hospital emergency room on Saturday afternoon with a gunshot wound. East Precinct police were dispatched. They talked to the victim’s boyfriend, who they found “pacing outside the emergency room.” The report says he told them it happened in his car at 27th SW and SW Cambridge [map]. He and his girlfriend were in the car with friends of his; one friend, he said, had a gun and while saying “something similar to ‘we’re going to be brothers for life’,” racked the slide on his pistol, and it fired, going through the front passenger seat and through the girl’s chest. They drove to the hospital. Police talked to the girl just before she was taken into surgery and reported that “she made statements consistent with the gunshot being accidental.” They found a bullet hole, bullet, and blood in the car, which was impounded. Police later met with the man whose gun fired; he was arrested and booked into the King County Jail for investigation of assault.\nADDED 9:54 AM TUESDAY: We now have the probable-cause document from the 18-year-old suspect’s bail hearing Monday afternoon. He is a Rainier Valley resident and was released on personal recognizance. The document says that he told police a different story about the gunshot – that he got into the car, noticed a gun on the floor, picked it up with the intent of throwing it out the window, and that, he said, was when it went off. He said he then gave it to his brother, who also was in the car, and told him to get rid of it, adding that he doesn’t know what happened to the gun. He has no criminal record in online statewide files."}