{"uri": "http://www.latimes.com/local/lanow/la-me-ln-shooting-boyle-heights-20160810-snap-story.html", "title": "Suspect shot dead by police in Boyle Heights was 14-year-old boy, coroner says", "dct": "Wed, 10 Aug 2016 15:45:00 GMT", "id": "9150c08e78fb8692c19dd976f076261a", "content": "A 14-year-old boy who was shot and killed by police in Boyle Heights was suspected of writing gang-style graffiti in the area before he bolted from officers and fired a gun at them, the Los Angeles Police Department said Wednesday.\nThe slain teenager was identified as Jesse Romero, who would have turned 15 on Aug. 24, according to Ed Winter, a spokesman for the Los Angles County coroner’s office.\nAs mourners prepared to hold a vigil for the youth Wednesday evening, LAPD officials met with reporters and presented an official account of events leading up to the shooting, as well as a photograph of a decades-old revolver recovered from the scene.\nAccording to LAPD Deputy Chief Robert Arcos, gang detail officers assigned to the Hollenbeck Division had received a call around 5:35 p.m. Tuesday of two vandalism suspects involved in possible “gang writings” and narcotics activity near Chicago Street and Cesar Chavez Avenue.\nThe suspects were described as being between 14 and 16 years old, and when officers arrived, one of the youths ran east on Cesar Chavez, and then south onto Breed Street, he said.\n“According to a witness, they saw the subject running from the officers. The witness saw the subject shoot a handgun in the direction of the pursuing officers,” Arcos told reporters.\nAs officers approached Breed Street and Cesar Chavez, they heard a gunshot, he said. When they arrived at the corner, one of the officers fired at the boy, killing him. Police recovered a loaded handgun, which will be processed for fingerprints and DNA, he said. Investigators are also looking into whether the revolver had been fired.\n“While the loss of life is particularly tragic, it is particularly so when the loss involves a youth,” Arcos said. “The tragedy of this event cannot be understated. In a community where violent crime continues to rise, particularly gang crime, this event underscores the need for youth programs and outreach, which could provide opportunities and alternatives for the youth of our community.”\nThe officers were wearing body cameras, he said. Investigators are still reviewing videos, which will be compared with other evidence, including witness and officer statements.\nPolice had initially identified the suspect as a man in his 20s. On Wednesday, Mario Sainz, an investigator with the coroner’s office, identified him as a 14-year-old.\nNo officers were injured in the pursuit or shooting, which happened in a commercial district in the Eastside neighborhood.\nAlthough Arcos declined to say whether Jesse was involved in gang activity because the investigation is ongoing, he said Hollenbeck officers keep tabs on 34 gangs, four of which are violent and active in the area of the shooting.\nThe second suspect, who was not armed, was later detained, Arcos said.\nThe teen was the 12th person shot and killed by on-duty LAPD officers this year. The department has seen 15 people shot by on-duty officers.\nAt the dead boy’s home, mother Teresa Dominguez, 36, sat inside a cramped one-bedroom apartment amid bouquets of flowers sent by mourners and burning candles.\nShe said she could not understand why the police would shoot someone so young.\n“It was not right for them to do what they did or kill him,” Dominguez said. “That’s why they are trained as police officers. Not to kill him.”\nBorn in Puebla, Mexico, Jesse was only a year old when he and his single mother came to the United States and settled in Boyle Heights. Dominguez said she works in the shipping and packing department at a produce manufacturer.\nThe boy’s mother said she didn’t think her son was involved in gangs and didn’t know where he would get a gun. She said he mostly hung out with two friends who would come over to their home and play video games.\n“He was a very good student,” she said. “He was a very good person.”\nDiane Covarrubias, a family friend who stopped by the family’s home on Wednesday, said Jesse was enrolled in Soledad Enrichment Action’s gang program that works with high-risk teens and was making a lot of progress. Earlier Tuesday, Jesse went the gym to work out. Later, friends and family found out that he was killed, she said.\nAs news of the shooting began to spread through the neighborhood, residents described a different series of events that led up to the shooting.\nA woman who said she witnessed the shooting and who would only identify herself by her first name, Norma, said she was in a car stopped at a traffic light at Cesar Chavez and Breed Street when she saw someone running from Chicago Street. He was pulling up his basketball shorts, which appeared to be falling down, she said.\nAs the runner turned onto Breed Street, he pulled a handgun from his waistband and threw it toward a fence, the witness said. The gun hit the fence and fell onto the ground, and she heard the weapon fire, she said.\nAt that moment, she said the runner turned around and appeared startled. She heard two more gunshots and the runner fell to the ground, she said. Moments later, officers placed handcuffs on him, she said.\n“He didn’t shoot,” the woman said of the runner.\nWord of Jesse’s death spread quickly Wednesday at Hollenbeck Middle School, where Jesse was a student.\n\"He was a bright, smart kid,\" campus aide Ramon Gomez said. “To see him go like this, I never expected this.\"\nGomez said he often saw Jesse hanging out with friends, and was surprised to hear that the boy was carrying a gun.\n\"It's hard,\" Gomez said. \"It's difficult, you know, these kids.\"\nOn Wednesday morning, the streets were still covered with evidence from Tuesday's violent scene. Chalk markings were laid out on Breed Street, near Cesar Chavez Avenue, and blood spots spattered the sidewalk just around the corner from El Rincon De Ross ice cream shop.\nA makeshift shrine had been arranged near a graffiti-covered power pole, which bore a small photograph of a smiling boy. Surrounding the photograph were several burning candles, three red roses, a Virgin Mary figurine and a potted cactus with a prayer card.\nMaria Ramirez, a longtime Boyle Heights resident, stood over the shrine.\n\"He doesn't even look like he is 13,\" Ramirez said.\nThe mother of 10 children has seen the aftermath of violence before, she said. As she looked over the shrine, she recalled a recent officer-involved shooting on Lorena Street, a shooting that involved three men at a neighborhood bar.\n\"The violence here in Boyle Heights is escalating,\" she said.\nThe community, she said, needs more programs for teens and fewer guns on the streets.\n\"I feel the loss. I have a 16-year-old,\" Ramirez said. \"But I feel for the officers too. They are overwhelmed.\"\nFollowing the LAPD news conference Wednesday, the ACLU of Southern California released a statement saying it was “particularly concerned” by the killing and argued that the department should change its body camera policy so that recordings are made public.\n“Under current policy, LAPD will show the body camera footage to the officers involved before they make an initial statement, allowing them to tailor accounts to the details they see on video,” wrote the group’s executive director, Hector Villagra. “At the same time, LAPD will keep the video secret from the public.”\nTimes staff writer Matt Hamilton contributed to this report.\nALSO:\nLAPD officer charged in assault quietly avoids jail time under plea deal with prosecutors\nEarthquake: 3.7 quake strikes near Rancho Tehama Reserve\nShe's fighting for the California coast from a tiny office in her kitchen nook\nUPDATES:\n3:45 p.m.: This article was updated with comments from the boy’s mother.\n1:52 p.m.: This article was updated with comments from the ACLU\n1:15 p.m.: This article was updated with additional details about the fatal shooting.\n11:55 a.m.: This article was updated with comments from Deputy Chief Robert Arcos and a witness.\n9:25 a.m.: This article was updated with comments from an interview at Hollenbeck Middle School.\n8:45 a.m.: This article was updated with details from the scene of the shooting.\n8:25 a.m.: This article was updated with the name of the boy who was fatally shot.\nThis article was originally published at 6:50 a.m."}