{"uri": "http://www.kansas.com/news/local/crime/article6238995.html", "title": "Gang member arrested in weekend shooting deaths, police say", "dct": "Tue, 13 Jan 2015 09:18:00 GMT", "id": "faf81917b4c872dbce198ad0d2baa934", "content": "A 29-year-old man has been arrested in connection with a weekend shooting incident that killed two people and wounded two others, records show.\nIshmael Bryant was arrested shortly after 2:30 p.m. on Monday at 844 N. Grove, arrest records show.\n“He was taken into custody without incident,” homicide Lt. Todd Ojile said.\nBryant was booked into the Sedgwick County Jail on suspicion of two counts of second-degree murder, two counts of aggravated battery and one count of criminal possession of a firearm.\nA Crime Stoppers tip received via text message led to Bryant’s arrest, said Gordon Bassham, executive director of the Wichita Crime Commission. Crime Stoppers is a division of the crime commission.\nBryant is accused of killing Andrew Smith, 28, and Quentin Brown, 32, in the parking lot of the Place bar and grill at 4859 E. Harry shortly after 1:30 a.m. on Saturday.\nBrown and a 36-year-old man got into an argument with Bryant inside the club, police have said, and the dispute continued outside. Bryant is accused of pulling out a gun and shooting Brown and the 36-year-old man.\nIt’s still not clear what prompted the argument, Ojile said. All three men involved in the argument are documented gang members, he said, with Bryant in a different gang than the other two.\nSmith, who was a bystander, was struck by three shots as he was leaving the bar, Ojile said. He was pronounced dead at 2:26 a.m. on Saturday at Wesley Medical Center. Brown was shot once in the chest and died at Wesley at 5:44 a.m.\nA 25-year-old bystander was hit in the leg by a stray bullet and was treated at Via Christi Hospital St. Francis before being released, police have said. The 36-year-old man was shot in the abdomen and was released Monday from a local hospital, Ojile said.\nPolice have said only one person fired shots, but they are still hoping to talk to more people.\n“We’re still looking for any witnesses,” Ojile said. “We know there’s people out there we want to talk to.”\nInvestigators have not recovered the gun used in the shooting incident.\nBassham said the tip gave police Bryant’s name and an address where he could be found. Officers arrested Bryant two hours after the the tip came in.\nOfficers were sent to a few potential addresses where Bryant could be found, Ojile said.\nBryant has a prior criminal history that includes pleading guilty to drug possession and criminal threat, Sedgwick County District Court records show.\nEvidence in the fatal shootings case will be presented Thursday morning to the Sedgwick County District Attorney’s Office, said Dan Dillon, a spokesman for the district attorney’s office.\nReach Stan Finger at 316-268-6437 or sfinger@wichitaeagle.com. Follow him on Twitter: @StanFinger."}