{"uri": "http://www.wistv.com/story/26636473/5-people-shot-in-darlington-co-apparently-after-drug-deal-goes-wrong", "title": "2 suspects surrender following Darlington fatal shooting", "dct": "Fri, 03 Oct 2014 09:09:00 GMT", "id": "dc440151af58a6e27e8f996c0cb887f2", "content": "DARLINGTON COUNTY, SC (WMBF) - Two suspects surrendered to Darlington County officials and have been charged following a September 26, 2014 fatal shooting.\nBianca A. Moore, 31, died Tuesday, October 7, 2014 in a local hospital from injuries stemming from being shot, according to Darlington County Coroner Todd Hardee.\nAlonzo T. Russell Jr., 30, of Florence, turned himself into Darlington County Sheriff's Office. He was wanted for the possession with the intent to distribute marijuana and possession of crack cocaine, according to Sheriff Wayne Byrd.\nBrice S. Russell, 28, of Florence, has been charged with the same crimes as those of Russell, Jr.\nA total of five suspects have been arrested and charged in the Darlington shooting. According to the Darlington County Sheriff's Office:\nAlonzo Russell Sr., 64, was charged with possession with intent to distribute marijuana and possession of crack cocaine.\nSylvester Lamont Jordan, 26, was charged with three counts of attempted murder and possession of a weapon during the commission of a violent crime.\nDamaino Nicholas Thomas, 30, was charged with the same crimes as Jordan.\nFive people were shot early Friday, September 26 after a drug deal apparently went bad, according to the DCSO.\nOfficials were notified of the shooting at about 1:39 a.m.; it took place in the 600 block of Turner Drive in the Palmetto area of Darlington County.\nThe injured victims were taken by a private vehicle to a local hospital before law enforcement arrived on scene. According to a news release from DCSO, one female victim was in critical condition with a gunshot wound to the head.\n\"The incident appears to be the result of a drug deal gone badly,\" Sheriff Wayne Byrd stated.\nDCSO is working with the State Law Enforcement Division to determine what happened. More information will be released as the investigation continues.\nAnyone with information on this case is asked to call DCSO at 843-398-4501.\nCopyright 2014 WMBF News. All rights reserved."}