{"uri": "http://pittsburgh.cbslocal.com/2014/07/23/at-least-2-shot-in-north-braddock/", "title": "Police: N. Braddock Shooting May Be In Retaliation To Rankin Shooting", "dct": "Wed, 23 Jul 2014 15:49:00 GMT", "id": "3d30f534cb6e9956f9bb8679e9e5ea44", "content": "NORTH BRADDOCK (KDKA) — Police are investigating a shooting that left multiple people wounded Wednesday afternoon in North Braddock.\nThe gunfire broke out just before 3:30 p.m. in the 700-block of Hickory Street.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nPolice say it appears the victims, four young men who have not yet been identified, were on the front porch of a white home when a car drove up, possibly two people got out and began firing before they jumped back in the car and drove away.\nInvestigators are hoping someone saw the vehicle and can give them a description.\nAccording to police, this shooting may be related to one earlier in the day in Rankin.\n“We believe this is directly related to an earlier shooting in Rankin this morning. This is probably going to be the retaliation shooting,” said Lt. Andrew Schurman, of Allegheny County Police. “Mid-morning on Patterson Avenue in Rankin, there was a young man shot. Again, he was taken to a local area hospital listed in stable condition.”\nAllegheny County emergency crews were called to the scene. Multiple police departments were also on scene into the evening collecting evidence, including North Braddock, East Pittsburgh and Allegheny County Police.\nOne neighbor reportedly heard screaming and as many as six gunshots.\n“I heard gunshots,” said Katherine Gee, a neighbor. “I heard about six of them. Not too long after I heard it, I heard people screaming and hollering. But I didn’t know exactly where it was coming from, but as soon as they came around the bend, everyone came out. After that, it’s been chaos ever since.”\nAnother neighbor reported hearing between 13 to 15 shots.\nThere’s no word of any arrests in the incident.\nAll four victims are listed in stable condition at various local hospitals.\nMeanwhile, Allegheny County Police believe a report of shots fired Wednesday evening in Rankin is connected to the North Braddock shooting as well.\nWitnesses saw a man leaning out of one car firing shots at another.\nIt happened near Hawkins Village.\nPolice inspected two vehicles, one of which had the windows shot out; however, there are no reports that anyone was injured.\nHousing Authority Police detained five people. It remains to be seen what charges they may face.\nAllegheny County Police are trying to sort it all out, but they believe it’s the latest in a day long back and forth of shots fired that are probably connected.\nThe investigation continues.\nStay with KDKA for the latest on this developing story."}