{"uri": "http://www.ksla.com/story/28965883/spd-4-year-old-was-fatally-shot-by-6-year-old", "title": "SPD: 4-year-old was fatally shot by 6-year-old", "dct": "Mon, 18 May 2015 17:50:00 GMT", "id": "8b150a9098204f0f0ae9c950f0602f0d", "content": "SHREVEPORT, LA (KSLA) -\nShreveport police say it was a 6-year-old child who shot a 4-year-old boy Sunday night at a Shreveport motel.\nPolice have identified the boy who died as Cameron Morris.\nIt happened just before 8:00 p.m. at the Levingston Motel in the 400 block of Pete Harris Drive.\nMorris was taken to University Health in Shreveport where he later died.\n\"You're dealing with a child whose life is over before it began in such a tragic way,\" explained Marcus Hines, with the Shreveport Police Department.\nPolice say they have interviewed the parents of the victim and the alleged shooter, and that information from witnesses suggests Morris was inside one of the motel rooms with the 6-year-old when the older child somehow got hold of an unsecured handgun that was also inside the room.\n\"What the tragic part is, you have a 6-year-old who will have to deal with that the rest of his life and then you also have negligence on the part of whoever owns this weapon, responsible gun ownership is paramount,\" said Hines.\nShreveport police say there were multiple adults in the room at the time of the shooting, but none of them were the parents of the victim.\nSome of them left the room following the shooting, and police are trying to identify and track them down in order to interview them about what happened.\n\"We don't want to rely just solely on the testimony of a 6-year-old, the 4-year-old obviously is deceased, so we would need that information to kind of further along, piece together what we're working on at this point,\" said Hines.\nPolice say they found a handgun and suspected narcotics inside the room.\nNo charges have been filed at this time, but the investigation continues.\nCopyright 2015 KSLA. All rights reserved."}