{"uri": "http://www.chicagotribune.com/news/local/breaking/chi-multiple-people-including-3yearold-shot-in-south-side-attack-20130919-story.html", "title": "Shooting of 13 at park puts Chicago back in the spotlight", "dct": "Fri, 20 Sep 2013 15:55:00 GMT", "id": "749fede7a82233c61a3b3e57e2b58439", "content": "A gunman with a military-grade assault rifle opened fire on a pickup basketball game in the Back of the Yards neighborhood late Thursday, injuring 13 people and dragging the city back into the international spotlight for its violent crime problem.\nAt least 16 bullets were fired into Cornell Square Park around 10:15 p.m. on Thursday, wounding a 3-year-old boy and a dozen other people. All are expected to survive, many with wounds to their arms and legs.\nShell casings found around the blood-soaked basketball courts were 7.62 mm rounds, which are traditionally used in AK-47 assault rifles and rarely found in gang attacks on Chicago’s South Side. Though gun violence has long plagued the city’s impoverished neighborhoods, offenders almost never use military-style weapons.\n“It's a miracle there has been no fatality,” Police Superintendent Garry McCarthy said at a news conference this morning. “Illegal guns, illegal guns, illegal guns drive violence....A military-grade weapon on the streets of Chicago is simply unacceptable.”\nThe park is in a heavily gang-infested area, but it is not in a so-called impact zone flooded by officers to deter crime, McCarthy said. The nearest zones are three blocks to the north and three blocks to the south, leaving the Cornell Square as a no man’s land protected only by occasional patrols and an 11 p.m. curfew.\nAbout 45 minutes before the park’s closing time, at least one gunman walked to the basketball court in the 1800 block of West 51st Street and opened fire, police said. The 13 people hit included both the pick-up game’s players and spectators such as 3-year-old Deonta Howard.\nDeonta, who was standing near the court, was shot near the ear and the bullet exited through his cheek, according to police and relatives. His family said the boy is expected to recover but will need plastic surgery.\nAfter visiting Deonta at Mount Sinai Hospital Friday, his grandmother Semehca Nunn called for an end to the violence that has terrorized her historically working-class neighborhood in recent years.\n“They need to stop, they need to stop,” Nunn said, before collapsing in tears.\nPolice believe the shooting stemmed from an ongoing dispute between the Black P. Stones and Gangster Disciples. It was not known if any of the victims were the intended targets, authorities said.\n“There were members of gangs on the scene and there were gang members among the victims,” McCarthy said.\nAuthorities do not have anyone in custody and are currently reviewing police cameras mounted nearby. There could be as many as three offenders, officials said.\nThe first paramedics on scene found more than a dozen people lying across the rust-colored court. One person lay near a bicycle that was on its side. A pair of white gym shoes were left near an out-of-bounds line.\nAmbulances continued to arrive a half hour after the shootings as wounded people – including a 15-year-old boy and a 17-year-old girl – were carried out on stretchers. About 60 police officers converged on the park and crime lab investigators combed the scene. Witnesses say Deonta was the first to be carried away.\nThe images again captured the world’s attention as international media organizations ran stories about the shooting and foreign reporters attended a Friday morning press conference at police headquarters.\nMcCarthy repeatedly refused to address the incident’s toll on the city’s reputation or his department’s effort to curb gun violence. “Every time somebody is shot in this city, it’s a setback,” McCarthy said. “But this is not just a Chicago problem.”\nThe incident appeared problematic enough for Mayor Rahm Emanuel to cancel a meeting with Obama administration cabinet secretaries today on city issues and return to Chicago, his spokeswoman Sarah Hamilton said.\nEmanuel flew to D.C. Thursday to raise money for his campaign fund. His East Coast swing also was supposed to include a political fundraiser for Democratic New Jersey U.S. Senate candidate Cory Booker.\nUpon his return, Emanuel spent 40 minutes at Mount Sinai Hospital, where he spoke with Deonta’s mother. The boy, who remains in critical condition, was sedated and being prepared for surgery during the visit.\nThe mayor did not speak with reporters, but released a statement asking the community to cooperate with the investigation.\n“Senseless and brazen acts of violence have no place in Chicago and betray all that we stand for,” Emanuel said in a statement. “The perpetrators of this crime will be brought to justice and prosecuted to the full extent of the law. I encourage everyone in the community to step forward with any information and everyone in Chicago to continue their individual efforts to build stronger communities where violence has no place.”\nThe shootings came just days after the FBI released crime data showing that Chicago had more murders than New York in 2012. McCarthy argued Friday that the statistics were old news and did not represent the progress made in the city, where the murder rate has dropped by 20 percent over the past year.\nAld. Willie Cochran, a retired police sergeant whose redrawn ward will include Cornell Square in 2015, acknowledged the shootings landed a damaging blow against the city’s crime-fighting efforts.\n“It’s a setback because we’ve been focusing so much attention on suppressing crime,” he said. “If you look at where we were last year and where we are this year, it shows that. But the perception of crime is greater than the crime itself. While law enforcement has been implementing programs, putting more officers on the street on overtime initiatives, it only takes one incident like this to change the whole perception of the reality.”\nFor neighborhood residents, the reality Thursday night included a burst of rapid fire and sight of a bleeding 3-year-old boy. Deonta’s older brother, Jamarrie Toney, was at his aunt’s home across the street from Cornell Square when he heard the shots. He ran to the park’s gate and saw his younger brother lying on the ground with a gunshot wound to the face.\nJamarrie, 9, had not seen Deonta – who goes by the nickname Tay Man – since paramedics rushed the little boy to the hospital. “I just miss him,” he said.\nAnother victim, a 37-year-old man who was shot in the leg, said he had been hanging around the park with friends when the gunfire began.\n“I turned around, I heard screaming,’’ he said. “I saw Tay Man.\"\nHe paused.\n“I just saw his face. Just tore off. . .they almost shot his whole face off,” he said.\nThe man, who asked that his name not be used, smoked a cigarette as he leaned on a cane after being released from the hospital. Medical tape held down a piece of cotton gauze on his left arm, and he was missing the shoe from the leg where he had also been shot.\nHe denied feeling anger toward the shooter. “I’m just grateful, grateful to be alive,” the man said.\nMayra Rodriguez, 23, who lives in the area with her 2-year-old daughter, heard rapid gunfire and then saw people on the ground. “Good thing most of them got hit in the legs,’’ she said.\n“That kid was playing, he didn’t even know nothing, it was out of nowhere,’’ she said of the 3-year-old.\nRelatives said the boy's uncle, Jerome Howard, was fatally shot in the Woodlawn neighborhood over the Labor Day weekend. The Rev. Corey Brooks, who presided over Howard's funeral, urged the shooter or shooters to surrender or face justice on the streets.\n“There are people who know exactly who the shooter is,” he said. “And I'm sure he will not be safe shooting 13 people.”\nAs dawn broke today, broken glass could be seen strewn across the basketball court, along with discarded medical supplies, syringes without needles, plastic packaging, orange gloves and a bloody T-shirt.\nBefore Thursday night's shooting, eight children under the age of 8 had been shot in Chicago over seven weeks.\nPolice listed the victims as:\n• A 3-year-old boy, shot in the ear, in critical condition at Mount Sinai\n• A 17-year-old girl, shot in the foot, condition stabilized at Holy Cross Hospital\n• A 15-year-old boy shot in the arm, stabilized at Holy Cross\n• A man, 27, shot in the leg and wrist, serious condition at Mount Sinai\n• A man, 24, shot twice in the stomach, serious condition at Mount Sinai\n• A man, 21, shot in the leg, serious condition at Mount Sinai\n• A man, 41, shot in the buttocks, serious condition at John H. Stroger Jr. Hospital\n• A woman, 33, shot in the shoulder, condition stabilized at Northwestern Memorial Hospital\n• A man, 31, shot in the buttocks, condition stabilized at Northwestern\n• A woman, 23, shot in the foot, condition stabilized at St. Anthony Hospital\n• A man, 37, shot in the leg, in good condition at Stroger\n• A man, 25, shot in the knee, in good condition at Northwestern\n• And a man, 33, who drove himself to Little Company of Mary Hospital in Evergreen Park with a gunshot wound to the leg and who was treated and released."}