{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-woman-describes-struggle-with-carjacker-who-later-wounded-cop-i-was-trying-to-stand-my-ground-20160818-story.html", "title": "Woman tells carjacker, 'Go ahead and just shoot me, I’m not moving'", "dct": "Fri, 19 Aug 2016 10:14:00 GMT", "id": "98301cf7c6883acaf1e911abc480fb8f", "content": "The woman parked after getting some frozen yogurt but kept the engine running while listening to a mystery novel on tape and cleaning a smudge off the window of the black SUV she uses for a ride-sharing service.\nShe saw a young man cross the street and thought nothing of it. Within minutes, the woman would be pulled out and knocked down, her Dodge Journey stolen at gunpoint and one of the carjackers arrested after a dramatic shootout with Chicago police caught on camera Tuesday night.\n\"This city, it's getting more and more violent every day,\" the 57-year-old woman said the next day, shaken and sobbing as she recounted the attack. \"I just don’t feel safe. It's horrible.\"\nThe woman said she decided to go out shortly before 10 p.m. Tuesday for a snack. She was listening to the book \"Creole Belle\" and decided to stay in the SUV after parking. She noticed the smudge and moved to the back seat to clean the glass.\n“I saw this young man crossing the street in front of my car,’’ she said.\nWhen she stepped out of the SUV, the man shoved a gun in her face. \"B----, give me your car,\" he yelled. \"He was right there — he had a gun on me. Then he grabbed me and said he’s going to kill me.\"\nThen the woman did something she now regrets. She fought back.\n\"I told him no and then I started screaming. I was trying to stand my ground,\" she said. \"I don’t know what I was thinking. I told him go ahead and just shoot me, I’m not moving, and then I started to scream.\"\nShe cried as she talked about the confrontation. \"I don’t know what I was thinking. It was so stupid.\n“I was so infuriated and so afraid,\" she said. \"Everything that I had was in that car. That's how I make my money. They were taking everything from me. My purse was in there, it's everything I have.\"\nShe tried to reach back into the SUV, but the man grabbed her dress, ripping it as he tried to pull her away. In the other hand he held a gun.\n\"He was trying to get me away from the car, and then another man slid into the driver's seat,\" she said. \"He took off while I was leaning up against the car. I fell on the pavement.\"\nThe gunman holding her finally let go and ran to another car parked nearby and sped off.\n\"It was pretty organized,\" she said.\nA good Samaritan called 911. Police got there almost immediately, and she gave them a description of the two.\nPolice caught up with the SUV about 2 1/2 miles away in the 600 block of East 100th Place and tried to stop it. But the man behind the wheel stuck a gun out the window and fired shots at a squad car, grazing an officer in the left cheek.\n\"Shots fired! Shots fired again!\" the officer screamed, according to video released by police from a dashboard camera. \"I'm f------ shot! I'm hit! I'm hit!\"\nThe man fired at a second squad car, and one of the officers fired back at the man, identified by police as Charles Lawson, 24.\nLawson crashed the car a short distance later. Officers converged on him as he raised his arms and dropped to the pavement on orders of police.\n\"Get the f--- on the ground! Get the f--- on the ground! On the ground now!\" an officer could be heard yelling.\n\"You f------ shoot at me, motherf------?\" another yelled as he ran toward Lawson.\nPolice said Lawson admitted he carjacked the SUV so he could use it in a drive-by shooting later in the night to retaliate against rival gang members for shooting a relative. A 30-round extended magazine was found on the driver's side floor of the SUV, police said.\nLawson was charged with attempted murder, aggravated battery, aggravated hijacking, aggravated fleeing and eluding, and possession of a stolen vehicle. He was denied bail.\nThe woman said she suffered a torn rotator cuff during the scuffle and faces surgery. She wonders how she will get by until she is better and her SUV is repaired. \"I don't know, it's going to be difficult.\"\nAnd she worries more than ever about her safety. \"I always worry about my sons when they’re out,\" said the woman, who has lived in Chicago for more than two decades. \"I just don’t understand how we could have all these laws, to have a gun, to carry a gun. … The answer is not more guns.\n“It’s only for the grace of God that they didn't kill me,\" she said, sobbing."}