{"uri": "http://bakersfieldnow.com/news/local/kcso-rosamond-teen-didnt-die-of-self-inflicted-gunshot-wound", "title": "KCSO: Rosamond teen didn't die of self-inflicted gunshot wound", "dct": "NODATE", "id": "1df6ef90e25e9eba432984a88378f83f", "content": "BAKERSFIELD, Calif. (KBAK/KBFX) —\nThe Kern County Sheriff's Office no longer believes a 14-year-old boy in Rosamond died of an unintentional, self-inflicted gunshot wound.\nSheriff's Office spokesman Ray Pruitt said they now believe a 19-year-old man accidentally shot Al McCraig in September.\nDeputies found the wounded teen, a freshman at Rosamond High School, in an apartment in the 2600 block of 25th Street West. McCraig later died at Antelope Valley Hospital.\nDetectives interviewed two other teens who were in the apartment during the shooting and determined at the time that McCraig accidentally shot himself while handling a shotgun.\n\"Detectives investigated further, and our investigation, which included detectives interviewing witnesses, crime scene investigators, investigating the scene and a pathologist conducting an autopsy, led us to the conclusion that it would have not been physically possible for the 14-year-old to have been handling the shotgun and shot himself in the manner it was described to us,\" Pruitt said.\nPruitt said based on the additional investigation the officials came to the conclusion that the teen was shot by 19-year-old named Deon Davidson.\n\"This is why we conduct investigations, because sometimes the way something is described to us, or what we initially think happened, isn't the way it actually occurred, and that's what happened in this case,\" Pruitt said.\nAl McCraig's mother, Denise McCraig, said her son was at Davidson's apartment when he was shot.\n\"When I left my son that morning, he was just fine,\" she said Thursday. \"And I went grocery shopping, and when I came back my son was dead.\"\n\"If I knew (Davidson) was playing with guns and stuff like that, my son would never have been over there,\" Denise McCraig said.\nThe Sheriff's Office said it submitted this case to the District Attorney's Office, and is asking that Davidson be charged with involuntary manslaughter.\n\"We do believe the shooting was accidental, but we believe (Davidson) was negligent in the way he was handling the firearm that discharged and unfortunately someone was killed,\" Pruitt said.\nFamily and friends called the Al McCraig \"Man Man.\" His mom told Eyewitness News that he got the nickname because he was her \"little man,\" being the youngest boy of six kids.\n\"He just wanted to go to school and go to college and play football,\" Denise McCraig said.\nWith her son's death, Denise McCraig said, \"You get an empty stop inside of you that never goes away.\"\nDenise McCraig said with this new information, she wants justice.\n\"I hope they do their justice. I don't think (Davidson) should be walking around the street with no probation. I think he should be locked up for what he did, because anybody that uses a gun I think should be in jail, because he took my baby's whole life away from him,\" she said."}