{"uri": "http://www.turnto23.com/news/local-news/teen-in-rosamond-accidentally-shoots-kills-self-with-shotgun", "title": "Rosamond teen and JV football player accidentally shoots, kills self with shotgun", "dct": "Fri, 09 Sep 2016 08:33:00 GMT", "id": "bc1f7825d4b711f93f730663636d83c2", "content": "The Kern County Sheriff's Office is calling a deadly shooting in Rosamond that killed a 14-year-old football player an accident.\nAccording to the KCSO, the teen was in a home just off Rosamond Boulevard on 25th Street West at about 12:45 Thursday afternoon when he was handling the shotgun and it accidentally discharged.\nDeputies performed CPR on the 14-year-old until medical aid showed up. The teen was then taken to Antelope Valley Hospital where he was pronounced dead.\nKCSO detectives interviewed two other teens, a 19-year-old and a 16-year-old, who helped KCSO determine that the shooting was an accident.\nThe boy is a junior varsity football player at the school, according to the Southern Kern Unified School District via a statement to 23ABC News:\nIt is with extreme sorrow that we inform you of the loss of one of our Rosamond High School 9th grade JV Football players. The student lost their life today in an event at the child’s home that is still being investigated by the Kern County Sheriffs department, so unfortunately we do not have very many details to give at this time.\nRosamond High School administration and grief therapists are currently with both football teams attempting to help our student athletes process this information and deal with their grief. We will continue to have grief therapists on staff tomorrow at the high school, middle school, and Alternative Education campuses.\nThe teams have elected to play their away games at Vasquez High School tomorrow in honor of their lost teammate. Our grief therapists will be attending the contests as well as additional Rosamond High School staff to support our student athletes in their time of loss.\nRosamond high school will be conducting some fundraising activities to support the family at the JV home football game on Thursday, September 15th at 7:00 pm which will include a memorial type of recognition for our player. Your attendance at this event would be greatly appreciated.\nThank you for your unwavering support of students of the Rosamond community."}