{"uri": "http://www.sltrib.com/news/4142502-155/man-accused-of-shooting-two-utah", "title": "Man accused of shooting two Utah teens — a brother and sister — charged with murder", "dct": "Thu, 21 Jul 2016 16:36:00 GMT", "id": "17a1e746bf66cc8bc4bae40dce01b93d", "content": "Cervantes-Angel is being held without bail at the Salt Lake County Jail. Prosecutors have asked a judge to set bail at $2 million, cash-only.\nAccording to charging documents, Cervantes-Angel arrived at Mill Creek II complex, 759 W. Center St. (7720 South) at about 10:45 p.m. on July 6 with a man and two women and the four confronted the Izazaga siblings and a 15-year-old boy.\nThe four males engaged in a verbal and physical altercation with one another, while the three females engaged in a verbal and physical altercation, charges state.\nThe dispute \"apparently involved a T-shirt, or shirt, money owed, or missing property,\" Unified Police Lt. Lex Bell has said.\nCervantes-Angel then assaulted Abril Izazaga, pulling her hair and slamming her against a brick wall, charges state.\nWhen Jose Izazaga pulled a knife and attempted to defend his sister, Cervantes-Angel pulled a handgun from his waistband and shot the two siblings multiple times, charges state.\n\"Witnesses stated that Abril was hugging Jose as they were shot,\" charges state.\nAfter the brother and sister fell to the ground, Cervantes-Angel walked over to them and attempted to fire the gun several more times.\n\"Witnesses observed Cervantes-Angel place the gun directly against Jose Izazaga's head while Jose was on the ground and pull the trigger, but the gun was jammed and did not fire,\" charges state.\nAbril Izazaga died at the scene; her brother was taken to the hospital, where he was declared dead a short time later.\nAs Cervantes-Angel and the three people who came with him left the scene, Cervantes-Angel told them \"that if any of them said anything, they would be next,\" charges state.\nCervantes-Angel, who was dropped off at the side of the road, was later found by police at his cousin's home and arrested. Investigators have been unable to locate the gun, charges state."}