{"uri": "http://chicago.suntimes.com/news/chicago-police-officer-shot-in-south-loop/", "title": "Chicago police officer shot, suspect killed in South Loop", "dct": "Thu, 21 Jul 2016 20:36:00 GMT", "id": "e06c086309b8afbbea298ef6f78c4c78", "content": "A Chicago Police officer on bicycle patrol was shot Thursday evening in the South Loop, and the suspect in the shooting was killed, police said.\nIt happened about 8:15 p.m. near Calumet Avenue and East 18th Street. The officer was taken by fellow officers to Northwestern Memorial Hospital, according to police and fire officials.\nSpeaking to reporters outside the hospital, CPD Supt. Eddie Johnson said someone walked up to the 44-year-old officer and his partners to tell them about a man acting erratically.\nThey found the man talking on a cellphone, and when they told him to get off the phone, he pulled a gun out of his backpack and shot one of the officers in the leg, Johnson said.\nThe officers fired back, fatally wounding the suspect, who was pronounced dead at Northwestern, Johnson said.\nThe man was identified as 50-year-old Derek Love of the 3300 block of South Giles Avenue in the Douglas neighborhood, according to the Cook County medical examiner’s office. An autopsy showed he died of multiple gunshot wounds and his death was ruled a homicide.\nThe officer who was shot was able to apply a tourniquet to his own leg while his partner applied pressure, Johnson said. Fellow officers took the 16-year veteran in a squad car to the hospital, and his injuries were not considered life-threatening, he said.\nThe officer was released from the hospital Friday afternoon, police said.\n“This is just another example of too many guns and too many people willing to use them,” Johnson said. “But it also illustrates how Chicago Police officers put their lives on the line every day to keep the city of Chicago safe.”\nA spokeswoman for the Independent Police Review Authority said the agency was on the scene Thursday night and will investigate the shooting.\nIn light of recent shootings against law enforcement in Dallas and Baton Rouge, Louisiana, police in Chicago have been patrolling in pairs.\n“We will continue the policy of officers pairing up…because it just gives them fresh set of eyes and ears to watch their backs at all times,” Johnson said. “Somehow we need to stop this madness. It’s difficult enough to be a police officer without these types of things going on. ”\nJohnson mentioned that Mayor Rahm Emanuel visited the officer in the hospital. The mayor later issued a statement:\n“Tonight the thoughts and prayers of Chicago are with our brave police officer who was shot answering a call as he worked to keep our streets safe. He is an example the courageous and selfless men and women in the Chicago Police Department who do difficult and dangerous work every day, often with little fanfare. Amy and I are hopeful for a full and speedy recovery, and our thoughts are with the officer’s family, friends, and his fellow brave men and women in uniform.”\nDozens of officers and Ald. Pat Dowell (3rd) were out on the scene.\nAmani Abou Harb, 25, said she had been walking her dog in the Battle of Fort Dearborn Park for about 90 minutes when she saw “a guy getting drunk” near some girls.\n“He was just standing there drinking beer and watching these little girls play volleyball. He was really creepy. I mean, he had no business being in that park, drinking and doing nothing but watching girls.”\nShe walked up to the girls and told them to leave, because “I didn’t think it was safe for them to be there.”\nThe girls left, and Harb and her friend left behind them.\nAfter she left the park, Harb ran into three officers on bicycles on Prairie Avenue and told them what she saw.\nAbout two minutes later, “I heard a lot of gunshots,” she said — eight or nine, she estimated.\n“I just keep wondering if I did the right thing,” Harb said. “If I hadn’t said anything, would he have just gone home?”\nContributing: Simone Alicea"}