{"uri": "http://www.dailymail.co.uk/news/article-3460182/Authorities-Shooting-reported-Phoenix-home-fire.html", "title": "Pictured: 'Drug addict son' who fatally shot his father, mother and two sisters in their suburban home, set it on fire and ambushed cops as they tried to rescue his family from the blaze", "dct": "Wed, 24 Feb 2016 01:36:00 GMT", "id": "e7cd6f6fca95ffa53cc3ac2ebeba55c7", "content": "This is the 26-year-old man who shot four of his family members and set their Phoenix, Arizona house on fire before he was killed by the police.\nGunman Alex Arthur Buckner, pictured in an unrelated mugshot from Owasso police department in Oklahoma, then shot at authorities when they arrived at the blazing house and ran inside with breathing gear and fire hoses.\nFather Vic Buckner, 50, mother Kimberly Buckner, 49, died at the scene.\nThe couple's two daughters, 18-year-old Kaitlin Buckner, and six-year-old Emma, were both rescued but later died in the hospital from gunshot wounds, police said.\nA tactical team stormed in after the gunfire died down and fatally shot Alex Arthur, police said.\nKaitlin Buckner called 911 shortly before 5am, pleading for help and saying that her brother had shot her, Crump said, according to KTVK.\nThe first officers on scene ran into the burning house because they felt they had to act quickly.\n'You have people that need you to come and rescue them, and you now have not only a fire, but somebody who's also firing a gun in there,' the police sergeant said.\nOfficers searched for the rest of the victims, but they had to leave because the fire reignited in the attic, sending flames through a ceiling.\nFamily members told investigators that Alex Buckner, who lived in the home, had been in rehab for drug abuse, but the shooting was out of character for him.\nScroll down for video\nQuick-thinking: Kaitlin Buckner, 18, pictured, called 911 shortly before 5am on Tuesday, saying her brother had shot her; the first officers on the scene ran into the house because they felt they had to act quickly\nPolice believe Alex used a gun belonging to his father, who ran a car lubrication business out of their home.\nAuthorities found the other victims after the fire was extinguished. They all suffered gunshot wounds, but a medical examiner will determine their causes of death, authorities said.\nInvestigators will continue gathering evidence at the house, Crump said.\nThe police have no record of ever having been called to the house before.\nNext-door neighbor James Graham said the family had lived in the home for about two years, and previously lived in Oklahoma. He said he chatted with them occasionally but they never mentioned any problems.\nSammie Evans, who lives across the street, said Emma Buckner was learning how to write and would show Evans notes she had written. They would chat a bit before the girl went back to her house.\n'I used to call her Miss America. She was so sweet,' Evans said.\nRelatives told ABC15 that Alex Buckner had a history of mental health problems, believing that he may have been diagnosed with schizophrenia.\nPolice in Owasso, Oklahoma, where the family had ties, told Newson6 that Buckner had been arrested for public intoxication and shoplifting in the city.\n'How does a family talk about a grandson who had mental problems, yet not be angry for the grief that he caused?', asked Diana Buckner, Alex's grandmother.\nPhoenix Mayor Greg Stanton was at the scene after crews tamped down the fire and praised the police and firefighters for their courage.\nHe said: 'This is what heroes look like. Their professionalism and their heroism under the worst possible conditions has truly blown me away.'\nThe chaos woke up residents in surrounding houses, forcing some to evacuate just before dawn.\nYolanda Strayhand, who lives behind the burned home, said her elderly mother woke her up after hearing gunfire.\nStrayhand went outside and said her front yard looked like a movie scene, with lights and noise from several fire engines, SWAT officers and a helicopter.\nShe said: 'We were approached by a lady firefighter who said: \"There's a live shooter.\"'\nShe got a glimpse of the back of the home engulfed in flames.\n'Every room on the top floor was lit, and they were pointing guns toward the basement,' she said.\nAn officer came by and told her to leave. Strayhand gathered clothes, medications and her mother's walker, and they both evacuated the scene.\nThree officers were treated for smoke inhalation."}