{"uri": "http://www.nj.com/essex/index.ssf/2013/05/five_shot_in_newark_after_mour.html", "title": "Five shot in Newark when mourner opens fire at vigil after argument", "dct": "Fri, 03 May 2013 17:08:16 GMT", "id": "987876ca19aa1ca03bda20cae6b8bb97", "content": "By James Queally and Tomas Dinges/The Star-Ledger\nNEWARK — A vigil in the city’s South Ward for a man who died in a car crash turned bloody Thursday night when one of the mourners opened fire, wounding five people — including a 10-year-old girl — two law enforcement sources said.\nThe sources, who were not at liberty to discuss the investigation publicly, said friends of the man who died in the early Thursday morning accident had gathered at South 16th Street for a vigil.\nSeveral people in the group began arguing and shots rang out a short lime later, the sources said. Police said the shots were fired just after 10 p.m.\nTo view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nNeighbors said the all-day gathering outside on the street involved alcohol — and kids were outside, too.\nIt was not clear early today whether the shooter was carrying the gun during the vigil or left and came back with the weapon. Police said the shooter apparently exited a dark-colored vehicle, fired several shots, got back in the car, and fled.\nThe five injured people were taken to area hospitals where they were all listed in stable condition - and four were released by noon today, police said. The 10-year-old girl was shot in the ankle, a 22-year-old woman was shot in the buttocks, a 46-year-old woman and 25-year-old man were shot in the arm, and a 48-year-old man was wounded in both legs.\nNo arrests have been made.\nPeople were drinking alcohol on the street all day, and there were kids around during that time, said one neighbor.\n\"They were out there drinking all day long — that's probably what heated the whole thing up,\" said Millie Rivera, a neighbor who moved to the street last August — and plans to move out in July.\nAnd check out our redesigned mobile site by visiting NJ.com from any mobile browser.\nThe vigil was for a man who had died in a single-vehicle crash some six blocks away on Clinton Place, the sources said.\nThe driver of the vehicle had apparently lost control of the car at 4 a.m. Thursday, and struck a residence at 19 Clinton Place, said city police spokesman Sgt. Ronald Glover. The unidentified man was rushed to University Hospital where he later died from his injuries.\nThe exact circumstances surrounding the accident were unclear, said Glover early Thursday.\nOn South 16th Street, a person this morning shouted out at reporters who had gathered.\n\"It was my family!\" he shouted. \"Get... up out my house. You only come out here when something happens.\n\"We're killing each other out here!\" he added.\nNeighbors on the street said there has been a run of local crime in recent years — robberies, thefts, shootings and a stabbing - which has changed the neighborhood. Several abandoned houses are scattered along the street.\n\"My family's been here 40 years,\" said Dwayne Morris. \"This used to be a beautiful block.\"\n\"This is a crazy block,\" Rivera said. \"That's why I'm moving off the street. In July.\"\nPolice said they're still in the very early stages of the investigation into the shooting, and have not identified a motive or a suspect. However, they are urging anyone with information to call (877) NWK-TIPS.\nStar-Ledger staff writer Seth Augenstein contributed to this report.\n• 6 people, including young girl, shot in Newark's South Ward"}