{"uri": "http://www.fox2detroit.com/news/local-news/175959411-story", "title": "Four people wounded after drag race shooting on Grand River", "dct": "Mon, 18 Jul 2016 22:27:00 GMT", "id": "163bb9a25ae904426bce60c2bad08e2f", "content": "DETROIT (WJBK) - Four people are shot in a Detroit neighborhood at Grand River and McGraw plagued by violent crime.\n\"Mama said nothing good ever happens after midnight and she was right,\" said Assistant Police Chief Steve Dolunt.\nWhen the sun goes down on one of Detroit's main drags, Grand River and McGraw, the intersection becomes loud and violent.\n\"It's obnoxious, you can't sleep at night,\" said Andre Flowers, who lives nearby.\nFour people wounded after drag race shooting on Grand River\nNeighbors report bottles breaking, crowds yelling and squealing tires. And on top of that - gunshots.\n\"We heard thousands of gunshots,\" said Lamando Brown who lives nearby. \"I'm scared because my window is right there and because I got shot three times in 2006.\"\nAfter a night of apparent drag racing Saturday four people are shot - and over what?\n\"An argument over a girl,\" Dolunt said. \"Some clown doesn't know what conflict resolution is. So he pulled out a gun and started shooting indiscriminately.\"\nRoughly 50 rounds were fired into a crowd. Everyone scattered while those four people were sent to the hospital. One man is still critical Monday, shot seven times.\n\"That's crazy, it doesn't make sense,\" said Flowers.\n\"Someone gets shot,\" Flowers said. \"Some car accident, someone gets hit by a car, and then they want to show up.\"\n\"It really scares me,\" Brown said. \"I don't know why the police don't stop it.\"\nTire tracks coat the entire intersection. Detroit police say this area is particularly bad because the businesses are closed and the area is large enough for hundreds and even thousands of people.\n\"The crowd got bigger and bigger and bigger,\" Dolunt said. \"By the time we got to Livernois and Warren, it was in excess of 2,000 people.\"\nKnowing this problem has been happening for years, police say it is only getting worse.\n\"It's almost become an epidemic, however, we have some plans,\" Dolunt said.\nThose plans to tow cars and to go after spectators and drivers and planning to work with the city. If they can't get speed bumps -- Dolunt says -- how about better lighting, street sweepers and in general, more police.\n\"So if you want to come down I would suggest you go to MIS or somewhere else to watch a drag race,\" Dolunt said. \"If I have my choice I am taking you and your car go to jail.\""}