{"uri": "http://www.battlecreekenquirer.com/story/news/local/michigan/2016/12/09/kalamazoo-shooting-suspect-file-motion-suppress/95200600/", "title": "Kalamazoo shooting suspect may ask judge to toss statements to police", "dct": "Fri, 09 Dec 2016 00:00:00 GMT", "id": "2cbccae69a4ffc89292b22d15fbf9383", "content": "A motion to suppress statements made to police by Jason Dalton, the man accused of killing six people and wounding two others in the Feb. 20 Kalamazoo shootings, is likely forthcoming, according to the county prosecutor's office.\nA status conference on the case was held Friday in Judge Alexander Lipsey's private chambers to discuss Dalton's claim of insanity and a possible request to suppress statements he made to the police.\nDalton is charged with six counts of open murder and two counts of assault with intent to murder and weapons violations. The shootings outside a Texas Township Cracker Barrel restaurant caused the deaths of three Battle Creek women — Mary Jo Nye, 60, Barbara Hawthorne, 68, and Judy Brown, 74. Mary Lou Nye, 62, of Baroda also was shot to death there, and Abigail Kopf, 14, of Battle Creek, was wounded. Richard Smith, 53, and his son Tyler, 17, of Mattawan were killed at a Stadium Drive auto dealership, and Tiana Carruthers was wounded at her Richland Township apartment complex.\nRelated: ​Shooting victim Abbie Kopf has Batman on her side with new helmet\nIn a series of interviews after he was arrested, Dalton blamed the killings on the Uber ride-sharing app, saying his iPhone directed him where to go and when to shoot people. Dalton said he would have shot at police when he was arrested but the app directed him not to engage in a shootout.\nHe described to police that he saw a symbol that resembled a devil's head, which he described as a horned cow head, that took over his body.\nDuring Dalton's preliminary hearing May 20 in Kalamazoo County District Court, two outbursts from Dalton left victim Carruthers sobbing on the witness stand as Dalton, in shackles, was hauled out of the courtroom by sheriff's deputies. The hearing continued with Dalton watching from the county jail. He was bound over for trial at the conclusion of testimony that day.\nDalton's lawyer, Eusebio Solis, filed a motion on June 13, saying he intended to mount an insanity defense for Dalton. According to a news release from Kalamazoo County Prosecutor Jeffrey Getting, the Center for Forensic Psychiatry has completed an evaluation of Dalton but his lawyer can request an independent forensic examination if he disagrees with the conclusion of the center's exam.\nJudge Lipsey ruled Friday that Solis has until Dec. 22 to advise the court of plans to find an independent forensic evaluator. Solis also has until Jan. 13 to to file a motion to suppress Dalton's statements. According to Getting, the prosecutor's office will have until Jan. 27 to respond to the motion to suppress.\nAn evidentiary hearing on the motion to suppress is scheduled for 9 a.m. Feb. 10, according to the news release. Getting said in the release he anticipates a trial date will be set in the case after the judge rules on the motion to suppress.\nContact Katrease Stafford: kstafford@freepress.com or 313-223-4759."}