{"uri": "http://www.mlive.com/news/kalamazoo/index.ssf/2016/02/she_acted_courageously_kalamaz.html", "title": "'She acted courageously' sheriff says of 1st person shot by Kalamazoo gunman", "dct": "Tue, 23 Feb 2016 18:55:00 GMT", "id": "6d8d243044b6d50cb3aee2b5821f5cfe", "content": "KALAMAZOO, MI - The first person shot in Saturday night's mass shootings knew something was wrong and acted courageously, police say.\n\"She acted courageously from what we're finding out,\" Kalamazoo County Sheriff Rick Fuller said of Tiana Carruthers, who was shot early Saturday evening while outside of her Richland Township apartment watching a group of children.\nFuller said Carruthers, whose age has been reported as 25, but whom Fuller would not confirm, was with three to five children in a play area of The Meadows townhomes in Richland Township when a man approached in a vehicle.\nFuller said he was unable to say what Carruthers heard from the man or whether she talked to him. But he said, \"What we're finding out is she recognized there was some sort of issue and she wanted the kids to go toward the house.\"\nFuller said, \"At some point she decided to ask the children to run. She stayed back and he opened fire. I think that was very courageous.\"\nHe said that when Carruthers apparently noticed something was wrong, she and the children were in the play area of the apartment complex, a residential area that has two-story townhomes. Police and emergency personnel found Carruthers wounded and lying near an apartment section when they arrived, he said.\nPolice say Tiana Carruthers was watching several children in the play area of The Meadows townhomes at about 5:40 p.m. Saturday, which can be seen at the right, and ushered them into an apartment before a gunman opened fire. Bullet holes can be seen in the section of an apartment wall to the left. A rescue team found Carruthers, who remains in serious condition at an area hospital, just outside an apartment there.Al Jones | MLive/Gazette\n\"She was on the ground outside the apartments,\" Fuller said. \"She had made it almost to the apartments.\"\nThe shooting occurred at about 5:40 p.m. Saturday.\nThe gunman reportedly pulled a gun and shot Carruthers once near her shoulder, and at least two more times in the hip and leg area before he fled, The Detroit Free Press reported, citing an interview with Carruthers' grandmother.\nThe children found their way safety into an apartment as the gunman started to shoot, WWMT-News 3 reported.\nPolice have said they recovered 10 spent shell casings at the scene. Several bullet holes can be seen in the section of an apartment wall not far from the playground area of The Meadows townhomes. Each is marked with a police evidence sticker.\nCarruthers was in the first of three locations at which the gunman opened fire on complete strangers while driving other people -- unharmed -- from place to place in Kalamazoo as a driver for Uber, the online taxi service.\nFollowing the shooting in Richland Township a total of seven other people were shot in Kalamazoo and Texas Township. Six have died. Two others, including Carruthers, are hospitalized and struggling to recover.\nPolice arrested Jason Dalton, 45, of Cooper Township, in connection to the incidents. He was charged Monday in Kalamazoo County District Court and faces multiple felony counts in relation to the incidents.\nIn a statement issued Tuesday, Carruthers' mother Iona Carruthers said: \"Our hearts reach out to all families touched by this senseless tragedy. We appreciate every prayer and tender thought extended to us. We also offer special thanks to our law enforcement teams, Emergency Medical Services professionals and the doctors and nurses who are providing us compassionate care.\"\nShe said Tiana Carruthers remained in serious condition.\n\"I believe she had some courageous actions,\" Fuller said of Carruthers. \"To what level, I don't know - other than she told the kids they should go because she recognized they should get out of there.\"\nFuller said he has been in regular contact with Carruther's mother and father and they have said they do not want to do interviews while their daughter recovers.\nMLive writer Al Jones may be contacted at ajones5@mlive.com. Follow him on Twitter at ajones5_al"}