{"uri": "http://woodtv.com/2016/02/20/multiple-fatally-shot-at-2-locations-in-kalamazoo-co/", "title": "6 killed, 2 injured after Kalamazoo-area shooting spree", "dct": "Sat, 20 Feb 2016 23:21:00 GMT", "id": "a9dd008590672c83f6b24c9d3f681a4a", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nTEXAS TOWNSHIP, Mich. (WOOD) — Six people are dead and two seriously wounded after a shooter opened fire at three different locations in the Kalamazoo area over the course of nearly five hours Saturday night.\nMichigan State Police on Sunday identified the four victims killed at one of the crime scenes, a Cracker Barrel restaurant, as:\nMary Lou Nye, 62, of Baroda, Mich.\nMary Jo Nye, 60, of Battle Creek\nDorothy “Judy” Brown, 74, of Battle Creek\nBarbara Hawthorne, 68, of Battle Creek\nThe Kalamazoo Department of Public Safety identified the two victims killed at another scene, a car dealership, as Richard Smith, 53, and his 17-year-old son, Tyler, both of Kalamazoo.\nSunday morning, police identified suspect they have in custody as 45-year-old Jason Dalton.\nDalton is suspected of shooting eight people at random at locations in Richland Township, Kalamazoo and finally Texas Township between about 5:45 p.m. and 10:30 p.m.\n“There is no connection between any of them (the victims). This all appears to be random,” Kalamazoo County Undersheriff Paul Matyas said early Sunday. “This is your worst-case scenario that any community can have.”\n“This tragedy is absolutely ridiculous,” MSP 1st Lt. Dale Hinz said early Sunday, who added that he had never seen anything like this situation.\nWhen asked if Dalton had indicated a possible motive, he replied, “I don’t think there is a why.”\nDalton, who MSP said is believed to have acted alone, was arrested more than two hours after the final shooting. He was an Uber driver, and police are investigating reports that he took fares in between the shootings.\nTHREE SCENES, FIVE HOURS, EIGHT VICTIMS\nThe investigation began around 5:45 p.m. Saturday at the Meadows Townhomes parking lot in Richland Township, where police said a woman was shot several times.\nMatyas said she was outside with her three children when she was wounded. She was severely injured but is expected to survive, authorities said Sunday.\nAt least 10 shots were fired at that scene, evidence markers showed. Four of bullets went into a nearby apartment, though no one in that apartment was shot.\nA witness at the scene told 24 Hour News 8 that he believed that the shooter “came to kill.”\nAround 10:08 p.m., police were called to Seelye Ford KIA dealership located at 3820 Stadium Dr. in Kalamazoo. That’s where Tyler Smith and his father, Richard Smith, were shot and killed.\nWitnesses told 24 Hour News 8 they drove by the dealership after police responded and saw two bodies on the ground. They initially though police were making an arrest.\nMattawan Consolidated Schools Superintendent Dr. Robin Buchler said on Sunday that Tyler Smith “always had a smile on his face.” She said everyone liked Tyler, whom she described as a “good kid” who was very involved. She said Tyler spent half the school day at the tech center studying marketing and the other half at the high school.\nAround 10:24 p.m., officers were called to the parking lot of the Cracker Barrel in the area of I-94 and S. 9th Street in Texas Township.\nMSP says Dalton approached an Oldsmobile Silhoutte minivan and Chevrolet Cruze sedan before firing into both vehicles.\nPolice said the four women were killed and a 14-year-old girl was gravely injured.\nMary Lou Nye was driving the minivan. Mary Jo Nye was driving the Cruze. Dorothy Brown, Barbara Hawthorne and the teen were passengers in the Cruze. The teen’s name was not released Sunday.\nAt one point in the early hours of Sunday, authorities were saying all five victims shot at the Cracker Barrel had died before changing the number of fatalities there back to four. MSP Lt. Hinz confirmed to 24 Hour News 8 later that the 14-year-old had been pronounced dead but then squeezed her mother’s hand.\nSunday morning, the prosecutor said that at his last check, the teen was headed into surgery. He was considering that good news.\nIn the afternoon, Gov. Rick Snyder met with the 14-year-old’s family. He told 24 Hour News 8 the girl was fighting for her life.\n“She’s working hard to stay alive. She’s got all our thoughts and prayers to have a chance to come back from this so it’s going to be quite a recovery period assuming that happens, ”Snyder said.\n“These folk from all three incidents, these folks were out to a show to go see a play for a great evening and someone comes up and shoots them,” he added. “That’s senseless violence at its worst.”\nThe red sedan towed from the scene had two rear windows shot out and a bullet hole through the windshield on the driver’s side. A white minivan also taken from the scene had the driver’s side window and middle window on the passenger’s side shot out.\nSUSPECT ARRESTED\nAround 12:40 a.m. Sunday, officers spotted the suspect vehicle — a black Chevrolet HHR — pulling out of Rugger’s Up & Under Bar on W. Michigan Avenue in Kalamazoo. Authorities said Dalton didn’t put up a fight when he was pulled over about a mile away from the bar in the area of Ransom and Porter streets and was then arrested.\nLt. Hinz, who is the commander of MSP’s Paw Paw Post, said Dalton and his vehicle matched the description of the suspect and getaway vehicle, a black Chevrolet HHR, in the shootings.\nMatyas said there was a weapon inside the HHR. Getting later said it was unclear if that weapon was registered to Dalton.\nGetting said authorities were not aware of Dalton having any history of mental illness. They said he was not believed to have been under the influence of drugs or alcohol.\nShortly before a 7 a.m. news conference, KDPS Chief Jeff Hadley said it was “extremely baffling” why Dalton allegedly committed the attacks.\n“We have no idea why this happened. We have not gotten any indication initially from our interview with Mr. Dalton as to the reasons behind his behavior,” he said. “That’s the million-dollar question right now.”\nHe said investigators intended to go through phone and computer records and talk to people Dalton knew in an attempt to determine what led up to the shootings.\nHadley fought back tears as he thought of the victim’s families.\n“Our deepest and profound sympathies go out to the families. … My heart truly goes out to them,” he said. “For the community, [I] just ask for prayers and that we put our arms around these families, we help them.”\nDalton was expected to be in court Monday, the prosecutor said, and will face multiple murder charges.\nGetting said Dalton was in contact with someone at times during the spree, but would not disclose who. He said Dalton is likely the only person who will face charges.\nSunday, a sign on the door of the Cracker Barrel said it would remain closed until Monday.\nRESPONSE FROM LAWMAKERS, COMMUNITY LEADERS\nGov. Snyder has ordered flags lowered to half-staff for six days starting Monday to honor the six victims killed in Kalamazoo.\n“Our hearts are broken for the victims’ families and friends, and I join in mourning their loss,” he said in a release.\nSnyder released this statement on the shooting Sunday morning:\n“The victims and their families — and the entire Kalamazoo area — should be in everyone’s thoughts today. Members of the community and law enforcement officers from the Kalamazoo Department of Public Safety, Kalamazoo County Sheriff’s Department, Kalamazoo Valley Community College and Michigan State Police who quickly came together are to be commended for their cooperation and swift response. Their actions resulted in the suspect being caught before he was able to harm anyone else through these senseless and apparently random acts of violence.”\nThe Catholic Diocese of Kalamazoo said a special mass will be held at St. Augustine Cathedral at 12:10 p.m. Monday for the victims.\nBishop Paul Bradley released this statement Sunday:\n“We are shocked and saddened by the horrific acts of violence in our beloved Kalamazoo last evening. Our thoughts and prayers go out to the families and loved ones of the six innocent people whose lives in this world were so mercilessly ended. May they live forever with God in the life of the world to come. We also pray for the perpetrator; may God show him mercy and change his heart. We commend the courage and dedication of our first responders for their commitment to keeping our community safe. Finally we pray for an end to all forms of violence. May this Lenten season be a time for all of us to turn away from sin and be freed from the strong hold of evil’s influence so that we can live together in security and peace.\n“We invite all people to join together tomorrow at 12:10 p.m. for a Mass at St. Augustine Cathedral to pray for the victims, the injured and traumatized, and for an end to violence. May all those impacted by this senseless tragedy be comforted by the love of our united prayers.”\nState Rep. Brandt Iden, R-Oshtemo, released this statement Sunday:\n“Our community has been rocked by the apparently random shootings that were perpetrated last night, stealing the lives of six people, critically injuring two others, and devastating countless family members and friends of these victims.\n“I encourage people to keep the victims, their families and friends in their thoughts and prayers during this difficult time. A prayer service will be held tonight at Centerpoint Church, 2345 N. 10th St., in Kalamazoo beginning at 7 p.m. Area residents are encouraged to attend this special service in support of the victims of this tragedy.\n“In addition, we should thank our first responders and law enforcement officials who worked diligently to find and detain the suspect, and who will continue to work countless hours to ensure justice is served for these heinous acts.”\nSenate Majority Leader Arlan Meekhof, R-West Olive, released this statement Sunday:\n“I am shocked and deeply saddened by the shootings in Kalamazoo. My thoughts and prayers are with the victims and their families. This is clearly a senseless act by a disturbed individual.”\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}