{"uri": "http://www.mlive.com/news/grand-rapids/index.ssf/2016/04/youngest_kalamazoo_mass_shooti.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+grpress+%28The+Grand+Rapids+Press+Latest+News+%7C+MLive.com%29", "title": "Youngest Kalamazoo shooting spree survivor improving with therapy", "dct": "Sat, 02 Apr 2016 17:25:59 GMT", "id": "e11d046556be8a1b32b9144c835c59bc", "content": "GRAND RAPIDS, MI -- Abigail Kopf continues to make progress in her physical therapy.\nThe family released a photo of the 14-year-old during one of her recent sessions at Mary Free Bed Rehabilitation Hospital, as a therapist helped the teen move her blue, Converse-clad foot.\nAbigail, wearing a white medical helmet over her ginger locks, appears to be waving at the camera.\nThe photo is accompanied by an update from the family on her GoFundMe page.\nEating is a difficult chore; chewing tires Abbie's mouth out. But she has to keep going so that she can get rid of her stomach feed.\nAbigail has been undergoing rehabilitation at Mary Free Bed in Grand Rapids since March 8, when she was released from Bronson Children's Hospital after three weeks of care that brought her back from near death.\nShe is the youngest survivor of the Feb. 20 mass shooting in Kalamazoo. The Battle Creek teen was critically injured when she was shot in the head after going to a show at Western Michigan University. The shooting occurred in the parking lot of the Cracker Barrel in Oshtemo Township.\nLast month, Abigail told her parents she remembered everything of that night.\nShe was shot allegedly by Jason Dalton, a gunman charged with killing six people during a shooting rampage. The four women Abigail was with in a Cracker Barrel restaurant parking lot were all killed.\nSo far, more 1,300 people have donated over $67,000 toward the Kopf family for Abigail's medical expenses through the GoFundMe page. There is also a United Way fund that is collecting funds for the victims of the shooting.\n\"I'm not out to ban guns but there is an epidemic of mass shootings across the country that needs to be addressed,\" Gene Kopf said. \"... That's an undeniable fact.\"\nShandra Martinez covers business and other topics for MLive. Email her or follow her on Twitter @shandramartinez."}