{"uri": "http://www.star-telegram.com/news/nation-world/national/article61718782.html", "title": "Man asked his Uber driver in Kalamazoo: 'You're not the shooter, are you?' He was.", "dct": "Mon, 22 Feb 2016 06:18:00 GMT", "id": "fcd1c50a11294cbfb46abbd6c5816d84", "content": "On Saturday night, an Indianapolis man named Derek and his wife took her parents to a show at the famous Bell's Brewery in Kalamazoo, Mich. As the craft beer flowed, a band called Andy Frasco and the U.N. belted out uplifting blues music. The group's new album title seemed to capture the mood: \"Happy Bastards.\"\nAs the night drew on, however, the crowd began to hear increasingly horrific news. A Kalamazoo woman had been shot outside her apartment complex. Then a father and son had been gunned down in front of an automobile dealership. Finally, a local Cracker Barrel had been turned into a bloodbath when a shooter opened fire, killing at least four.\nDerek and his family were staying only a mile and a half away from the brewery, but he decided it was safer not to walk with a killer was on the loose in the college town.\nSo he ordered an Uber.\nThat decision could have cost them their lives.\nA photo of a heavyset man with long, salt and pepper hair, glasses and a goatee popped up on the man's phone. Uber's app said his name was Jason and he would arrive shortly in a dark colored Chevy SUV.\nSure enough, the car pulled up and the family of four climbed in, with Derek in the front seat.\n\"My father mentioned from the back seat, you know, the situation with the shooter,\" Derek told NBC affiliate WOOD TV, using only his first name.\n\"I kind of jokingly said to the driver, 'You're not the shooter, are you?'\" Derek said. \"He gave me some sort of a 'no' response. . . shook his head. . ..\n\"I said, 'Are you sure?' And he said, 'No, I'm not, I'm just tired,'\" he continued. \"And we proceeded to have a pretty normal conversation after that.\"\nRoughly 20 minutes after the Uber driver dropped Derek and his family off at their hotel, a man matching the driver's description was arrested nearby in connection with the deadly shooting spree.\nPolice identified the suspect as Jason Brian Dalton, a 45-year-old who had only recently begun working for the ride-hailing service.\nWhen Derek saw photos of Dalton on Sunday morning, he called Kalamazoo Police detectives to report his brush with the suspect, he told WOOD TV.\nA police spokesman could not confirm or deny Derek's account when contacted by The Washington Post early Monday morning, although authorities have said they believe Dalton appeared to continue looking for passengers even after his alleged shooting spree.\nThere was no doubt in the Indianapolis man's mind, however, that he had received a ride from Dalton.\n\"It was the same guy,\" Derek told WOOD TV.\nHe also provided the television station with his Uber receipt, which showed a man named Jason - who bears a striking resemblance to Dalton - and a time-stamp from shortly before Dalton's arrest at 12:40 a.m. Sunday.\nUber has confirmed Dalton had been working with the company and said he had passed a background check.\n\"We are horrified and heartbroken at the senseless violence in Kalamazoo, Michigan,\" Joe Sullivan, Uber's chief security officer, said in a statement. \"We have reached out to the police to help with their investigation in any way that we can.\"\nKalamazoo Public Safety Chief Jeff Hadley said Sunday that the attacks appeared to be \"completely and totally random.\"\nDerek and his family weren't the only Uber customers to have close encounters with Dalton before or during the mass shooting.\nOn Saturday afternoon at around 4:30 p.m., Dalton picked up a customer for a short ride but the trip turned out to be so terrifying, his passenger practically leaped out and called 911.\nIn an interview with The Washington Post, Matthew Mellen said that Dalton drove erratically, blowing through a stop sign, sideswiping another car, swerving in and out of traffic and refusing to stop. All the while, however, the Uber driver acted like everything was normal.\n\"He was like asking me, 'Don't you want to get to your friend's house?'\" Mellen said.\nAs soon as Dalton slowed down, Mellen jumped out and dialed 911, he told The Post. It wasn't until two hours later, however, that police called him back.\nBy then, the alleged massacre had already begun.\nAccording to Kalamazoo County Prosecutor Jeffrey Getting, Dalton's first alleged victim was shot outside her apartment complex at around 6 p.m. She has not been named but is expected to survive.\nSix others were not so lucky. On Sunday, police identified the dead as Mary Lou Nye, 63, of Baroda, Mich.; Mary Jo Nye, 60, of Battle Creek; Dorothy Brown, 74, of Battle Creek; Barbara Hawthorne, 68, of Battle Creek; and father and son Richard Smith, 53, and Tyler Smith, 17, both of Kalamazoo.\nAuthorities in Kalamazoo plan to charge Dalton Monday with six counts of murder, two counts of assault with intent to commit murder, and six counts of felony with a firearm.\nA 14-year-old girl was \"gravely injured\" at Cracker Barrel, according to authorities. She was initially reported dead - the mass shooting's supposed seventh victim - and was being prepped for organ donation when she suddenly squeezed her mother's hand.\n\"Wow,\" said a Kalamazoo police officer who asked not to be named when contacted by the Post early Monday morning. \"It's miraculous.\""}