{"uri": "http://woodtv.com/2016/02/22/family-of-teen-kzoo-shooting-rampage-victim-breaks-silence/", "title": "Family of teen shooting victim: ‘She is fighting’", "dct": "Mon, 22 Feb 2016 12:40:00 GMT", "id": "ffcf0df58fe9ec2fa9a5598733691c60", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nTEXAS TOWNSHIP, Mich. (WOOD) — The 14-year-old girl who was wounded during Saturday’s shooting spree in and around Kalamazoo remained in critical condition Wednesday at Bronson Children’s Hospital.\nDoctors said on Monday Abigail Kopf was still on a ventilator fighting for her life.\nThe family previously asked that the teen not be identified, but rescinded that request Monday evening when addressing the media.\n“Abigail, her parents and our team continue to fight hard for her life,” Dr. Aaron Lane-Davies said. “In spite of the seriousness of her injuries, we are encouraged by her relative stability over the past couple of days and her responsiveness to her parents and our team.”\nFamily members said earlier Monday that her prognosis was uncertain. Vickie Kopf fought back tears Monday evening as the doctor described her daughter’s condition.\n“Everybody needs to get that straight. My daughter is not dead. She is alive and she is fighting for her life. I want everybody to understand that,” Vickie said.\nAbigail still “has a long road ahead,” said her father, Gene Kopf, but is “strong-willed and fighting.”\n“As of right now she is actually showing some progress. Which is great news,” said Vickie.\nAbigail was shot outside the Texas Township Cracker Barrel, the last of three shootings that made up Saturday’s spree.\nShe had joined four women for dinner at the Cracker Barrel, then went to see a show at Miller Auditorium. The group had returned to the restaurant to pick up a car when they were shot while sitting in their vehicles just before 10:30 p.m.\nAll four women, 60-year-old Mary Jo Nye of Battle Creek, her 62-year-old sister-in-law Mary Lou Nye of Baroda, 68-year-old Barbara Hawthorne of Battle Creek and 74-year-old Dorothy Brown of Battle Creek were killed.\n“Abigail is strong, and she is a vibrant beautiful young lady and she did not deserve this. And either did her grandmother or those other victims,” Vickie Kopf said.\nAbigail was rushed to the hospital. Her heart stopped beating at one point, Dr. Lane-Davies said Monday, but doctors were able to restart it.\n“Due to both the nature of her injuries and the efforts required to sustain her life, our team discussed the possibility that she could become brain dead,” Lane-Davies said. “At the request and with the permission of Abigail’s parents, our team contacted Gift of Life to begin the process that ensures the dignity and safety of the injured person. The active organ donation after a tragedy like this one can only occur after a person has died. Determining brain death requires a series of physical exams, sometimes in conjunction with other testing, over the course of multiple hours. This series of exams has not begun due to Abigail’s medical condition. Abigail was not declared medically brain dead. She has undergone a surgical procedure to address her injuries and remains on the ventilator and critically ill.”\nThe night of the shooting, Abigail squeezed her mother’s hand, giving them new hope.\n“Breathtaking,” Vickie Kopf described that moment. “A miracle on its own. You don’t expect and then all of a sudden, it’s there.”\nShe and her husband have been by Abigail’s bedside since the shooting. Vickie Kopf said Abigail has been wiggling her toes.\nAbigail called Hawthorne “Grandma Barb,” though the two are not related by blood. Abigail’s parents say she loves theater and that Hawthorne would often take her to see shows, like they did on Saturday.\n“Ever since she was a baby, they have done things together,” Vickie Kopf said. “She (Barbara) was a beautiful woman. She was a free spirit. Had an infectious laugh and she gave the most wonderful hugs. And she didn’t deserve this.”\nShe and her husband thanked the community, police and team of doctors treating their daughter.\nThe Kopfs have another 6-year-old daughter, who they say may not completely understand what happened.\nBarbara Hawthorne’s family released this statement on Monday:\n“We are devastated and bewildered that our ‘Auntie Barb’ was taken from us in such a horrible and senseless way.\n“Our ‘Auntie Barb’ was easy to laugh, a generous, giving person who loved her many friends and family. She was a true “hippie” who marched for civil rights in the deep south, recycled everything that came through the house, and believed in marching to your own drummer. She loved the theatre and live music and shared tickets to performances whenever possible. Her table was often surrounded by her Euchre or crochet group. She believed in authentic connection and built her own family among her many friends and loved ones.\n“She was deeply loved and respected and will be missed by everyone who knew her.”\nRich Smith, 53, and his 17-year-old son, Tyler were shot and killed at a Kalamazoo vehicle dealership about 15 minutes before the Cracker Barrel shooting. Kalamazoo Public Safety Chief Jeff Hadley told 24 Hour News 8 Monday Tyler’s girlfriend hid from the gunman and survived.\nThe shootings started around 5:45 p.m. Saturday when Tiana Carruthers was shot several times outside Meadows Townhomes. The Kalamazoo County prosecutor said Monday she is recovering.\nSt. Augustine Cathedral held a mass to pray for the victims early Monday afternoon. The Battle Creek Community Foundation also set up a Help Now fund to support the community as it grieves.\nThe shooting suspect, 45-year-old Jason Dalton of the Kalamazoo area, was was formally charged in the case Monday.\nThe Kopfs aid their thoughts are with the family of the man charged with shooting their daughter and killing six others.\n“We want his family to know that we don’t hold anything against the family members,” Gene Kopf said.\nInside woodtv.com:\nComplete coverage of the Kalamazoo shooting rampage\n**Correction: A previous version of this article misspelled Vickie Kopf’s first name. The error has been corrected.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}