{"uri": "http://www.kcrg.com/content/news/Man-Dies-After-Dropped-Gun-Fires-Hits-Him-in-Leg-370259851.html", "title": "Name Released in Black Hawk County Gun Discharge Death", "dct": "Fri, 26 Feb 2016 17:14:00 GMT", "id": "b389a9888323e2db80eb7582e0945fb2", "content": "html5: Unsupported video format. Try installing Adobe Flash.\nhttp://get.adobe.com/flashplayer/\nBLACK HAWK COUNTY, Iowa (KCRG-TV9) -- Authorities responded to Elk Run Heights, just east of Evansdale, around 12:35 a.m. Friday for a report of a man down.\nBlack Hawk County deputies arrived and found a man being administered CPR, according to a release from the Black Hawk County Sheriff's Office.\nInvestigators determined the man, identified as 45-year-old Martin Lawrence, had come home from work and was in possession of a handgun. He dropped the firearm while leaving his vehicle, causing it to fire and the bullet to hit him in the leg.\n\"Unfortunately the gun, when dropped ,hit the ground on the hammer which caused the weapon to fire and strike Mr. Lawrence,\" said Chief Deputy Rick Abben in an updated news release sent Friday afternoon.\nThe gun, a .38 caliber Derringer-style handgun, fired when Lawrence dropped it and it landed on the hammer.\n\"There is nothing to indicate that Mr. Lawrence was reckless in his handling of the weapon,\" Abben said.\nParamedics took Lawrence to UnityPoint - Allen Hospital, where he was pronounced dead, law enforcement said.\nLawrence, who worked as a probation officer with the Department of Corrections, was also involved in the local chapter of the NAACP.\n\"He was a very personable and outstanding person,\" said LaTanya Graves, head of the Waterloo chapter of the NAACP. \"I felt that he worked hard with the clients to help them re-enter society. He took his job as a calling.\"\nLeon Mosely, a former Black Hawk County Supervisor, recalled he was good friends with the victim's father. He remembered Martin Lawrence as a child growing up who used to play in his front yard.\n\"I knew him when he was growing up and trying to get a job. He was a good kid who just needed a break in life,\" Mosely said.\nSheriff's investigator said the Black Hawk County Medical Examiner ruled the death an accident. Services are pending."}