{"uri": "http://helenair.com/news/crime-and-courts/helena-man-charged-in-shooting-death/article_e0c89f2b-1b47-5491-8784-3993d1be155c.html", "title": "Helena man, 18, charged in shooting death", "dct": "Fri, 08 Jul 2016 00:00:00 GMT", "id": "4faaea614969fea59e93a03b224f15cf", "content": "An 18-year-old Helena man has been charged in Thursday's shooting death of Ryan William Eakin.\nAustin Lee Kroll-McLaughlin faces a felony charge of deliberate homicide. Prosecutors also have filed a charge of felony tampering with or fabricating physical evidence.\nKroll-McLaughlin is accused of shooting Eakin in the chest around 11 a.m. Thursday. The shooting occurred in a parking lot on Bozeman Street in Helena. Eakin, 20, died at the scene.\nKroll-McLaughlin is being held on $200,000 bond at the county jail.\nCharges were filed Friday afternoon. Kroll-McLaughlin was taken into custody shortly after the shooting on an unrelated bond revocation, police said.\nA witness at the scene reported seeing Kroll-McLaughlin running from the area and hiding behind a trailer. Investigators found two bloody pistols on the ground near the trailer, according to court documents, which note Kroll-McLaughlin was covered in blood when apprehended.\nAuthorities were alerted to the shooting at 11:09 a.m. by a call to 911. A 10-year-old boy at the nearby Stonetree Climbing Center told an older boy he saw a man with a gun.\nTwo teens from Stonetree attempted to render aid to Eakin, court documents say.\nAccording to charging paperwork, Eakin and another male, identified in the documents as \"J,\" were arguing earlier in the day. The two and Kroll-McLaughlin reportedly drove together in Eakin's car to the site of the shooting.\n\"J stated Eakin began to start things and he was struck by Kroll-McLaughlin with something in the left cheek. J stated he observed Eakin make a move as if he was ducking or something similar after he was struck. J stated when he was struck by Kroll-McLaughlin he heard a gun go off simultaneously. J stated Kroll-McLaughlin continued to pursue him and challenged him to fight and he observed a handgun in his hand,\" a detective wrote in court documents.\nThe documents say \"J\" later learned Eakin was shot and spoke with police.\nKroll-McLaughlin was out on bond for a pending burglary charge. In November, he was arrested for allegedly breaking into a vehicle located inside of a detached garage on the 1300 block of Lewis Street. He then reportedly tried to run from police."}