{"uri": "http://pittsburgh.cbslocal.com/2015/08/16/1-dead-2-injured-after-fairywood-shooting/", "title": "1 Dead, 3 Injured After Fairywood Shooting", "dct": "Sun, 16 Aug 2015 13:46:00 GMT", "id": "211821fdda5770224ab342b38be653c3", "content": "PITTSBURGH (KDKA/AP) – Authorities in western Pennsylvania say four men playing dice in a Pittsburgh neighborhood were shot and one was killed overnight.\nIt happened Saturday night around 10 p.m. on West Prospect Avenue in the Fairywood section of the city.\nPublic safety spokeswoman Sonya Police say they first responded to a call that a man had been shot in the head.\nToler said the victims were outside playing dice when a gold minivan and a silver car drove down the street heading north.\n“We went down the way and noticed there was a young man laying on the ground, face-down, two young other fellows running up the street trying to get away,” said neighbor Darryl Faulkner.\nThe Allegheny County medical examiner’s office said 19-year-old Kason Barnes was hit in the head and shoulder and died at the scene.\n“From my understanding, the person stood so many yards away and shot him three times maliciously, got out of the vehicle,” said Barnes’ mother Rhonda.\nRhonda Barnes says she doesn’t understand why it happened.\n“I’m troubled that they feel like they have to do something like this to another individual,” she said. “And it’s sad, it’s sad. And if anybody does know anything, I’d really hope they’d man up and say what they know. It’s not like you’re snitching — he was a victim and he was a good guy.”\nThe other three men, who ranged in age from 20 to 22, were listed in stable condition.\nNo word on a suspect or motive.\nAnyone with information is asked to call 911.\n(TM and © Copyright 2011 CBS Radio Inc. and its relevant subsidiaries. CBS RADIO and EYE Logo TM and Copyright 2011 CBS Broadcasting Inc. Used under license. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report.)"}