{"uri": "http://wreg.com/2017/01/23/five-people-shot-in-panola-county/", "title": "Five People Shot in Panola County", "dct": "Mon, 23 Jan 2017 22:23:00 GMT", "id": "15e517845ef2d85c2108ff17f062978a", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nCOMO, Miss. -- One person killed, four others injured and a house riddled with bullets in Panola County.\nPolice told WREG's Kristen Holloway the killers are still on the run.\nThe shooting happened on Smart Road near Como, Mississippi late Friday night.\n\"All I could do was cry because I could see the puddle of blood where people got shot,\" said LaTonya Eason.\nCrime tape, shattered glass and tons of bullet holes. That was the scene on Smart Road after the shooting\nOn the other side of the road, family and friend came together to pray.\n\"Lord, I thank you for protecting the kids. Lord, dear God protecting the one that didn't get hit by the stray bullets,\" said Eason.\nLeola Petty said both her sons, Ricky and Ronnie Petty, were shot. Ronnie died at the hospital.\n\"He was a good little boy. He didn't bother nobody,\" said Leola Petty.\nAccording to deputies, the suspects were using assault rifles and nine millimeter guns. Several bullets went into a house nearby. No one inside that home was hit but nine people were inside at the time.\nLaTonya Eason said her cousin, Rod Birge, was hit while standing outside and now he's in critical condition.\n\"He's a truck driver he was doing good for himself, he's the type that didn't bother anybody whatever you asked him for he gave it to you and I just hate he got caught in the cross fire,\" said Eason. \"I just pray that this community will really get themselves together and I hope this will be a wake up call for everybody.\"\nNo arrest have made for this crime. It's still unclear what led up to the shooting.\nPolice have not released the names of the other victims injured.\nA vigil is scheduled for Tuesday at 6:30 p.m. on Abrams Road."}