{"uri": "http://www.fox7austin.com/news/local-news/218036573-story", "title": "APD officer shoots dog to save 11-year-old girl", "dct": "Thu, 17 Nov 2016 03:47:00 GMT", "id": "0e0f463bc7f380e4bb19c304aa9c6afe", "content": "When the attack inside this house ended with gunshots, Paul Robichaux who lives just a few doors down told me his quiet neighbor became a chaotic scene.\n\"About 6 o'clock I was on the phone heard three or four maybe five loud quick bangs which later turned out to be sounds like gunshots,” said Robichaux.\nThe dog that Austin Police shot and killed was a pit bull mix and a family pet. The 11-year-old who was attacked was home with her brother, according to her uncle, playing a video game Tuesday evening when one of her three dogs suddenly charged. The brother flagged down a passing neighbor who called for help. When officers arrived at the home on Powell Circle investigators say the children ran outside.\nAPD officer shoots dog to save 11-year-old girl\n\"While the officer was treating the girl’s injuries the dog reappeared and it again attacked the little girl while the officer was attending her injuries. The officer tried to intervene between the dog and the girl himself getting bit during the process, then he shot the dog and the dog ran off of the location,” said APD Commander Ely Reyes.\nThe dog later died at the city animal control center. When the officers fired the shots a fragment from a bullet ricocheted back into the other officer. An internal review into the shooting is being done. The officer who fired the shots is on Administrative Leave.\n\"It's standard practice anytime we have an officer intentionally fired his weapon and it strikes another individual regardless if it was accidental striking and the other individual in this case would be the other officer it doesn't rise to the level of an officer involved shooting but the level investigation similar,” said Reyes.\nThe young girl was rushed to the hospital where family members say she underwent surgery to repair damage to her shoulder and a leg.\n\"We are very hopeful I hear that she still recovering so I want to wish her all the best,” said Robichaux.\nThere are no records of complaints being made against any of the dogs at the home. Because the children were home alone at the time the family is being interviewed by caseworkers with child protective services."}