{"uri": "http://stlouis.cbslocal.com/2013/05/03/illinois-state-police-release-report-on-manchester-mass-shooting/", "title": "Illinois State Police Release New Details of Manchester Mass Shooting", "dct": "Fri, 03 May 2013 15:09:00 GMT", "id": "1ca0c2506fe42526f05595ab3d646b5c", "content": "MANCHESTER, IL (KMOX) – Illinois State Police issued a report Friday afternoon with more information on the April 24 mass shooting in Manchester, Illinois which left five people dead.\nOn the morning of the 24th, officers from five police departments responded to a home on East Street in Manchester. The bodies of five victims – three adults, a boy, and an infant – were found at the home.\nAccording to the ISP report, Winchester Police and Illinois State Police then located Rick Odell Smith who they believed to be the shooter. A shootout took place and Smith was later pronounced dead.\nThe victims were identified as 66-year-old Jo Ann Sinclair, 23-year-old Brittney Lynn Luark, 29-year-old James Roy Ralston, 5-year-old Nolan James Ralston, and 1-year-old Brantley Jack Ralston.\nAmong the most important revelations in the new report is that Smith planned his attack.\n“Based on witness statements from family members and other known acquaintances, ISP investigators confirmed that Smith planned his attack and was seeking to resolve a domestic dispute between himself and the Sinclairs involving the custody of his 3 year old daughter,” the report states. “The Morgan County Sheriff’s Department also confirmed that on March 27, the office facilitated an exchange of custody between Smith’s 3 year old daughter and her mother, Rita Luark, which occurred without incident.”\nAccording to the report, Smith believed the relatives of Rita Luark were “interfering with their custody dispute.” Smith was not related to any of the victims.\nThe village of Manchester had a population of 354 as of the 2000 census and 292 by more recent estimates. It is about 85 miles from St. Louis. The last homicide reported in Scott County prior to April 24 was in 1993 and the Manchester mass shooting was the first mass shooting known to occur in Scott County."}