{"uri": "http://fox2now.com/2013/04/25/family-needs-help-to-bury-manchester-il-shooting-victims/", "title": "Family Needs Help To Bury Manchester, IL Shooting Victims", "dct": "Thu, 25 Apr 2013 16:01:00 GMT", "id": "3e805554296e4b9c7df6671ca6a80a5a", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nST. LOUIS, MO (KTVI) -The grandmother of the children injured and killed in the mass shooting Wednesday in Manchester, Illinois a message to the community. Rita Luark is the grandmother, her friend is Jill Osborne. Osborne served as a family spokesman. Osborne said of Luark, “She wants to thank everybody for their outpouring of concern for everybody to keep Kassidy in their prayers.”\n6-year-old Kassidy was the lone survivor in the murder inside a Manchester apartment. Rita Luark was her grandmother as well as a grandmother to five year old Nolan and 1 year old Brantley. They were killed. She was mother to Brittney and close to Brittney’s boyfriend Roy Ralston, the father of the children. The couple was also shot dead. And, Rita was the daughter of murder victim JoAnne Sinclair. Many funerals have yet to be planned. Osborne said, “She doesn’t have a lot of money.”\nA trust fund has been set up so Rita Luark can afford t bury her loved ones. The Luark family also wants folks to know six people died in the apartment not five, Brittney was five months pregnant. Osborne said, “(Brittney) talked a lot about this being her forth and going to be her last baby but was very excited about it.”\nPolice say the gunman was Rick Odell Smith; he was later shot and killed by officer. Thursday afternoon there was an eerie quiet in Manchester which was making national headlines only hours earlier. Two of the young shooting victims attended elementary school in nearby Winchester. Counselors helped the little ones cope with their sadness. School superintendent Dave Roberts said, “And we brought in the local ministers also came in our feeling was having people that were familiar faces to the kids was more important.” People who want to help with the funerals can got to our website and learn more about the fund.\nThe bank is located at:\n102 South Main\nPO Box 258\nWhite Hall, IL 62092\nPrevious Story: 5 Murdered In Manchester, IL; Suspect Dead, 6-Year-Old Hospitalized"}