{"uri": "http://fox2now.com/2013/04/24/possible-shooting-in-manchester-il-2-nearby-school-districts-closed/", "title": "5 Murdered In Manchester, IL; Suspect Dead, 6-Year-Old Hospitalized", "dct": "Wed, 24 Apr 2013 07:31:00 GMT", "id": "a1be1255365f573702e93e591c4739f2", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\n(KTVI) - The man who police believe shot and killed five people and wounded a six-year-old in Scott County, Illinois is dead.\nIn a news conference on Wednesday, the Illinois State Police said around 4:30 a.m. police responded to an apartment complex on East Street in Manchester, IL and found the shooting victims. Two victims were found in one bedroom, two in another bedroom, and one in a hallway. The suspect took a six-year-old girl to a neighbor. She was taken to an area hospital in critical condition. The suspect entered through a back door and used a shotgun at close range on all of the victims.\nWhile police did not identify the victims, The Chicago Tribune says family and friends identified them as Joanne Sinclaire, 64, her granddaughter Brittany Luark, 22, her Boyfriend Roy Ralston, Nolan Ralston, 5, and Brantley Ralston, 1. The hospitalized 6-year-old's name is Cassidy.\nPolice identified the suspect as Rick Smith.\nWitnesses told police Smith left the scene in a white Chevy Lumina.\nSeveral police agencies responded to the scene. Smith was seen around 7:13am fleeing in the Lumina. He was pursued by the Illinois State Police and Winchester police. After coming to a stop at Illinois Route 106 and Woodson Blacktop, shots were exchanged.\nSmith was taken into custody and transported to an area hospital where he was later pronounced dead.\nIllinois State Police investigators say Smith had a shotgun, scope rifle, and a large hunting knife with him when he was taken into custody.\nSmith had a criminal history of reckless homicide (likely from a DUI), drugs, and bad checks.\nAnyone with information about what happened is being asked to call the Illinois State Police at 217-786-6677.\nMany residents of these small communities turned to Twitter to voice their sympathy and concern about the shootings."}