{"uri": "http://www.mlive.com/news/jackson/index.ssf/2016/07/victims_in_summit_avenue_drive.html", "title": "Victims in Summit Avenue drive-by shooting identified by police", "dct": "Tue, 12 Jul 2016 17:56:00 GMT", "id": "2d221b2a6c58a3381f5c7de5daeba804", "content": "JACKSON, MI - Police have released the names of the four victims injured in a drive-by shooting on Summit Avenue Monday night, July 11.\nThey are Michael Fowler, 25, Miacha Tillman, 19, and London Truman-Arnold, 20. The name of the 16-year-old victim will not be released, police said.\nFowler and Tillman were released from the hospital earlier today, Tuesday, July 12, police said. The 16-year-old victim still is being treated.\nTruman-Arnold remains in critical condition with a gunshot wound to the head at the University of Michigan Medical Center, police said.\nPolice said there were six people in or around a car parked in the 500 block of Summit Avenue at about 9 p.m. Monday, when an unknown vehicle opened fire on the group, hitting four in the head.\nPolice are investigating a drive-by shooting on Summit Avenue that sent four individuals to the hospital with gunshot wounds to the head Monday evening.\nJackson Police Deputy Chief Elmer Hitt said the 16-year-old girl, who was the only shooting victim at the scene when police arrived, was shot in the back of her head and was conscious and talking at about 9:07 p.m.\nShortly after being dispatched to the shooting, police said they were called to Henry Ford Allegiance Health after being alerted that three males struck by gunfire were driven by one of the victims to the hospital.\nPolice had been called to the same area recently to investigate reports of shots fired. At 2:17 a.m. June 11, officers were dispatched to the 500 block of Summit Avenue for the report of shots fired.\nTheir investigation determined a residence was struck, as well as three vehicles. The people police believed to have been shot at in the incident were not forthcoming with information, police said.\nTillman was out on bond at the time of Monday's shooting, charged with carrying a concealed weapon and obstruction of justice, according to court records.\nHe is due to appear in court for a pretrial hearing before Jackson County Circuit Court Judge Susan Beebe on Aug. 23.\nA witness described what appeared to be a black GMC Envoy SUV drive northbound on Summit Avenue around the time of the shooting but police could not confirm if the vehicle was involved in the shooting, police said.\nPolice have since said this shooting and another one Tuesday afternoon, July 12, in which a man was shot in the leg at a Sunoco gas station in the 1400 block of Francis Street, appear to be related.\nA drive-by shooting that occurred on Summit Avenue Monday night and a shooting at a Francis Street gas station Tuesday afternoon are believed to be related, according to police.\nAnyone with information on either incident is asked to contact the Jackson Police Department Detective Bureau at (517) 768-8726 or Crime Stoppers of Mid-Michigan at (855) 840-7867."}