{"uri": "http://www.mlive.com/news/jackson/index.ssf/2016/08/man_involved_in_several_shooti.html", "title": "Man involved in several shootings in Jackson arraigned, bond set at $500,000", "dct": "Thu, 04 Aug 2016 10:18:00 GMT", "id": "aabe125493a6e50355a4d26d637462bb", "content": "JACKSON, MI - A Jackson man involved in several recent shootings and reports of shots fired in Jackson has been charged and arraigned.\nMiacha Tillman, 19, was arraigned Wednesday afternoon, Aug. 3, by Jackson County Magistrate Fred Bishop, charged with one count of felony possession of a firearm, one count of felony possession of ammunition and one count of felony firearms.\nTillman was found hiding in the attic of a home in the 600 block of McBride Street that had been shot at Monday afternoon, Aug. 1 and arrested for illegal possession of a handgun and ammunition, said Jackson Police Deputy Chief Elmer Hitt.\nMen found hiding in home after police respond to two reports of shots fired, one arrested\nOne man was arrested after police found him and another man hiding in a home that had just been shot at Monday afternoon.\nThe McBride Street shooting is believed to be directly related to the earlier shooting at Greenwood Avenue and First Street that same day, Hitt said.\nNo injuries were reported in both shootings, Hitt said.\nTillman was also one of four victims who were injured in a drive-by shooting in the 500 block of Summit Avenue on July 11.\nPolice have released the names of the victims injured in a drive-by shooting that occurred on Summit Avenue Monday night.\nThe following day, July 12, in what is believed to be a retaliatory attack for the Summit Avenue drive-by, Demarcus Smith was shot in the leg while pumping gas at a gas station on Francis Street, police said.\nBond was set at $1 million for the man who returned fire after being shot at a Jackson gas station Tuesday, July 12.\nTillman was out on bond at the time of June 11 shooting, charged with carrying a concealed weapon and obstruction of justice, according to court records.\nHis original bond was revoked Wednesday morning by Jackson County Circuit Court Judge Susan Beebe after being informed of the new charges.\nGiven Tillman's prior charges, Jackson County Assistant Prosecuting Attorney Kelsey McKinnie was granted a requested bond set at $500,000, cash or surety.\nHe is due to appear in court for a pretrial hearing in Beebe's courtroom on Aug. 23 for his previous concealed weapon and obstruction of justice charges.\nTillman is scheduled for a probable cause conference at 9:30 a.m., Aug. 12 and preliminary examination at 9:30 a.m., Aug. 17 in Jackson County District Court Judge Michael Klaeren's courtroom for his new charges.\nTillman stated he will be hiring his own attorney. He is currently lodged in the Jackson County Jail.\nTo read all of the stories related to the Summit Avenue drive-by shooting, click here."}