{"uri": "http://www.wmcactionnews5.com/story/25515307/judge-denies-bond-for-atlanta-teen-accused-of-shooting-5-near-a", "title": "Judge denies bond for Atlanta teen accused of shooting 5 near high school", "dct": "Wed, 14 May 2014 22:04:00 GMT", "id": "30b68fb6714db9905bbf44f9cdeb2097", "content": "ATLANTA (CBS46) -\nA teen accused of shooting five people near a southwest Atlanta high school was denied bond during a court appearance on Wednesday.\nThe public defender for Marcellus Brooks, 17, said the teen is in school and employed and asked the judge to put him on house arrest. The judge refused and sent Brooks back to jail.\nPolice said Brooks started shooting at an intersection near Therrell High School where a large group of students had gathered Tuesday afternoon.\nOne of those shot was in critical condition Wednesday afternoon. The other four are expected to recover.\nCBS46 talked with one of the teens injured, 17-year-old Trevion Morgan, who was just released from the hospital.\n\"I thought I was probably going to die,\" said Morgan, pointing to the bandages, where the bullet missed his heart by inches.\nMorgan said a group of students met near the school after classes let out to see two girls who were supposed to fight. The fight never happened and shots suddenly rang out.\n\"As soon as I heard the gunshot, I looked and I felt it and then I started running.\"\nMorgan's mother said she was at work when she got the call her son had been injured.\n\"Please don't let my baby die,\" Keshia Hurston recalled saying to herself as she raced to the hospital. \"I've been up all night, thanking God he's still here.\"\nAtlanta police said they continue to investigate the motive for the shooting. Sgt. Greg Lyon said they have reports there was some type of argument just prior to the shots being fired.\nThe Atlanta School District said the shooting did not occur on school property, but they have increased security as a precaution.\n\"We have been working with the Atlanta Police Department, with our security department to make sure that our students and our staff are safe,\" said Steve Smith, the district's associate superintendent. \"We want to have as close to a normal day as possible.\"\nRecords show MARTA police arrested Brooks in March on robbery charges. He posted bond and was released last month.\nThe teen remains locked up at the Fulton County Jail. He is due back in court on May 28.\nCopyright 2014 WGCL-TV (Meredith Corporation). All rights reserved."}