{"uri": "http://www.wafb.com/story/32463160/watch-live-baton-rouge-police-respond-to-report-of-officers-down", "title": "Law enforcement officer ambush: A comprehensive timeline of events", "dct": "Mon, 25 Jul 2016 16:18:00 GMT", "id": "1ce944c1aaf8d463372c4199161d1d4e", "content": "BATON ROUGE, LA (WAFB) -\nOn a mobile device? Click here for additional features.\nTwo Baton Rouge police officers and an East Baton Rouge Parish sheriff's deputy were killed in an ambush shooting on July 17 and three additional law enforcement officers were wounded.\nOfficer Matthew Gerald, 41, had only just begun his career with the Baton Rouge Police Department. He graduated from the Police Academy in March 2016 and had only just been released to work on his own on July 5. He leaves behind a wife and two daughters. His funeral service was held on Friday, July 23.\nDeputy Brad Garafola, 45, had worked with the East Baton Rouge Parish Sheriff's Office for 24 years. He was assigned to the Civil Processing-Foreclosures division. He was working an extra-duty detail at the B-Quik the day of the shooting. He leaves behind a wife and four children. His funeral service was held Saturday, July 24.\nOfficer Montrell Jackson, 32, worked for the Baton Rouge Police Department for 10 years. He leaves behind a wife and a 4-month old child. His funeral service was held Monday, July 25.\nOf the injured officers, two were released from the hospital and one remains in critical condition.\nBruce Simmons, 57, was released from Baton Rouge General Hospital on Thursday after undergoing at least two surgeries. Simmons has served as a police officer for 23 years.\nChad Montgomery, a Baton Rouge police officer, was also released from the hospital.\nDeputy Nicholas Tullier, 41, remains in critical condition at Our Lady of the Lake Regional Medical Center. He has 18 years of service with the office.\nOn the day of the attack, Sunday, July 17, officials announced that they shot and killed the suspect, who was later identified as Gavin Long, a 29-year-old man from Missouri. Long's body was released to his family on Monday, July 25.\nThe day of the attack, officials did fear two additional suspects were involved. Investigators detained and questioned two suspicious people who were located in the neighboring West Baton Rouge Parish after members of the public called 911 about two suspicious men who were seen entering the Walmart in Port Allen.\nThey say the men were dressed in all black, they changed clothes inside the store, then left in a silver Nissan with a Texas license plate. The men were released Sunday evening after being questioned by the FBI. Investigators said they had no connection to the shooting.\nIn the hours following the shooting, officials say there were reports of gunfire in several areas around the city, but so far those reports have all been unfounded. Law enforcement agencies throughout Baton Rouge remain on high alert.\nOn Monday, July 18, top officials were joined by Louisiana Gov. John Bel Edwards for a news conference to announce details of the investigation. They revealed that fingerprint analysis positively confirmed Long as the gunman and added they believe he acted alone. Col. Mike Edmonson, superintendent of Louisiana State Police, confirmed the timeline of events and used large pictures of the crime scene to walk reporters through the shooting. The images were obtained from surveillance footage.\nThe initial caller at roughly 8:40 a.m. reported a man holding a rifle, wearing all black, who was standing behind a beauty supply store on Airline Highway. The scene later shifted to the nearby B-Quik gas station, which is located less than a mile from BRPD Headquarters.\nDuring a call to dispatch, an officer said, \"unknown where the shots are coming from.\" Dispatch audio.\nA witness described hearing at least 25 to 30 gunshots when the shooting began.\nAccording to Edmonson, Long first shot and killed two police officers and a sheriff's deputy near the Beauty Supply store next to the B-Quik convenience store. Edmonson said Long then sprinted along the back of the buildings to the Fitness Expo where his car was parked. Edmonson added Long then started firing at a BRPD SWAT Team officer, who fired back with the fatal shot hitting Long from over 100 yards away.\nInvestigators recovered three guns that were analyzed to determine ownership. They include an IWI Tavor SAR, 5.56 caliber rifle, Springfield XD 9, 9mm caliber pistol, and Stag Arms M4 Variant, 5.56 caliber rifle was staged at the vehicle. The vehicle is a Chevy Malibu that was rented from Missouri. It was recovered at the scene.\nThe East Baton Rouge Parish coroner released autopsy results Wednesday, July 20 that confirm Long died from multiple gunshot wounds.\nOn the same day the VA confirmed that Long was a veteran who served in the Marines. They also confirmed that he sought medical attention over the course of several years after he was deployed overseas.\nDr. Boyce Watkins of the Black Business School received an email from Long on Monday, July 11 at 10:31 p.m., just one day before the Louisiana State Police says Long rented the car he drove from Kansas City, Missouri to Baton Rouge. In the letter he spoke specifically about the Alton Sterling investigation.\nAlton Sterling died Tuesday, July 5 after he was shot by a Baton Rouge police officer outside the Triple S Food Mart. Police were initially called to the store from a complaint that a man with a gun was outside the store selling CDs and had threatened someone.\nCell phone video was released that showed Sterling on the ground when he was shot multiple times. Police say he reached for a gun and the officer felt threatened. The FBI is charged with investigating the case.\nProtests were held throughout Baton Rouge the weekend following his death and continued on a smaller scale the following week.\nSterling's funeral was held Friday, July 15 at Southern University.\nADDITIONAL RELATED STORIES:\nCopyright 2016 WAFB. All rights reserved."}