{"uri": "http://www.wafb.com/story/32573678/deputy-critically-wounded-inambush-shooting-to-undergo-another-surgery", "title": "Deputy critically wounded in ambush shooting to undergo another surgery", "dct": "Fri, 29 Jul 2016 21:39:00 GMT", "id": "2423e6ab4caf058ae4d46ea2272775a3", "content": "One deputy continues to fight for his life following an ambush shooting that claimed the lives of three fellow law enforcement officers.\nRELATED: Family, friends, community show support for deputy who remains in critical condition\nDeputy Nick Tullier has remained in critical condition at Our Lady of the Lake Hospital since he was shot Sunday, July 17. According to a post by family members on the community Facebook page \"Nick Tullier Strong,\" he will undergo another surgery Friday afternoon for the wound to his abdominal area.\nTullier, 41, was shot by Missouri-resident Gavin Long when he responded to a call of shots fired at the B-Quik gas station on Airline Hwy. Fellow officers Cpl. Montrell Jackson, 32, and Officer Matthew Gerald, 41, and an East Baton Rouge Parish Sheriff's Deputy, Brad Garafola, 45, were killed during the attack.\nDeputy Bruce Simmons, 51, and Officer Chad Montgomery were wounded and released from the hospital within a few days of the incident.\nFundraisers have been held to benefit all of the officers who were struck by gunfire. A jambalaya fundraiser specifically for Tullier's medical expenses was held Monday, July 25. Nick's father, James Tullier, posted a message thanking everyone for their support.\nThat event was conceived, planned and promoted by friends of Nick and Danielle (Nick's fiance]. They came up with the idea and ran with it. I was able to attend for about 30 minutes. Over my whole life, I've been involved in all types and sizes of fundraisers,\" he continued. \"I've never seen any of that magnitude. Mega Event doesn't even do it justice. I just can't find words to describe our thanks and appreciation to United Rentals, other friends of Nick and Danielle involved, volunteers that have met and have never met Nick before, and the Public turnout that supported this fantastic event. Again, words just can't describe. Thank you to all for your support, thoughts and prayers. Please continue to pray for Nick. He's got a long rough road ahead of him. We all know it's in God's hands. Thank you all very much.\nThe support has poured in from around the country. From cards to donations, Nick's family has felt the hand of an entire nation.\nMany have asked for an address to send things to Nick. This is the PO Box that has been set up for him. Thank you for your continued prayers.\nCpl Nick Tullier\nPO Box 938\nDenham Springs LA 70727\nFor additional ways to help support fallen officers, click here.\nCopyright 2016 WAFB. All rights reserved."}