{"uri": "http://www.usatoday.com/story/news/nation/2016/07/18/3-officers-shot-and-killed-baton-rouge/87239118/", "title": "Police: 'Sheer brutality' as 3 officers slain in Baton Rouge ambush", "dct": "Mon, 18 Jul 2016 00:00:00 GMT", "id": "eaf6060a26959e514ffc1421ad909771", "content": "WWL\nThe chaotic shootout between Baton Rouge officers and a lone gunman ranged around a series of commercial buildings before a SWAT officer killed the suspect with a 100-yard shot, police said Monday.\nThe gunman, Gavin Eugene Long, 29, of Kansas City, Mo., had an IWA Tavor SAR 5.56-caliber rifle and Springfield XD 9.9mm pistol with him during the shootout Sunday morning, according to Col. Michael Edmonson, superintendent of state police. Another Stag Arms M4 Variant 5.56-caliber semi-automatic rifle was at his rented Chevrolet Malibu car, Edmonson said.\nThe guns are being analyzed for the chain of ownership, he said.\nBy watching videos from the area around a car wash and convenience store where the shooting occurred, police said Long ignored civilians and shot only at police, Edmonson said.\n“It is chilling in the sheer brutality,” Edmonson said. “They were intentionally targeted and assassinated.”\nLong had parked and looked inside an empty police car parked at a convenience store, and then walked around the building, where he was confronted by the three officers who were slain, Edmonson said.\n“It was chaotic,” he said. “When he engaged those police officers, it was deliberate and extremely accurate.”\nLong shot two Baton Rouge officers, Montrell Jackson, 32, and Matthew Gerald, 41, killing one and injuring one, Edmonson said. East Baton Rouge sheriff's deputy Brad Garafola, 45, retreated behind a dumpster for shelter, Edmonson said.\nBut when Garafola saw the wounded officer still moving, he came out to help and Long returned to shoot them both dead, Edmonson said.\n“Deputy Garafola died as a hero,” East Baton Rouge Sheriff Sid Gautreaux III said. “My deputy went down fighting.”\nThe gunman got back in his car and drove behind a series of buildings before stopping to shoot other officers. By then, a Baton Rouge SWAT team arrived and an officer shot Long from about 100 yards away, Edmonson said.\n“That shot that are SWAT team made was a hell of a shot,\" Baton Rouge Police Chief Carl Dabadie Jr. said.\nThe wounded deputy who is fighting for his life, Nicholas Tullier, 41, was shot in the head and stomach, and he remains in intensive care, Gautreaux said.\n“He’s in very, very critical condition,” he said. “He’s not in good shape at all.”\nA third deputy, Bruce Simmons, 51, suffered non-life-threatening injuries, Gautreaux said. The bone between his shoulder to elbow was shattered, and he has titanium rod in his arm, he said.\nA 41-year-old city officer also suffered non-life-threatening injuries.\nPresident Obama condemned the attack, which came just 10 days after a gunman killed five police officers in Dallas — and 12 days after police in Baton Rouge fatally shot 37-year-old Alton Sterling while he was pinned to the ground. Police have said the officers, who were white, thought Sterling, who was black, was reaching for a gun in the July 5 shooting. Sterling’s funeral was Friday.\nSpeaking from the White House, Obama said Sunday afternoon there was no justification for Sunday's \"cowardly and reprehensible\" violence against law enforcement.\n“Regardless of motive, the death of these three brave officers underscores the danger that police across the country confront every single day,\" Obama said Sunday afternoon.\nAbout the shooter\nAuthorities recovered a rifle and a handgun that Long is believed to have used in the attack. Investigators were looking at Long's possible links to black separatist groups.\nThe official said authorities believe that Long acted alone, despite initial reports from local law enforcement that as many as two others were being sought. The Pentagon late Sunday said Long was a decorated Marine who served in Iraq from June 2008 to January 2009 as a data network specialist. He was discharged in 2010.\nTwo persons of interest from Addis were questioned and released, but the investigation is ongoing, police spokesman Major Doug Cain said late Sunday. No charges were filed against them.\nIt was immediately unclear what precipitated the attack, though the official said investigators were reviewing 911 calls to determine whether the officers were lured to the location of the shooting.\nMissouri court records show Long filed for divorce from his wife on Valentine's Day, 2011 in a Kansas City court and that the divorce was finalized on May 24, 2011. The couple apparently had no children.\nLouisiana Gov. John Bel Edwards suggested hours after the attack that it may have involved more than one assailant, but there was only one gunman at the scene. The investigation is attempting to determine whether anyone helped Long with the attack.\n“It’s just pure, unadulterated evil,” Edwards said. “This investigation will leave no stone unturned.\"\nHow the shooting unfolded\nBaton Rouge police department officers at a convenience store said they spotted the gunman at 8:40 a.m. He was wearing all black standing behind a beauty supply store holding a rifle. Two minutes later, law enforcement officials heard reports of shots fired.\nAt 8:44 a.m., dispatch receives reports of officers down. More shots are reported at 8:45 a.m. More reports roll in a minute later about the suspect, dressed in black, standing near a car wash next to the store.\nBrady Vancel, 22, of Denham Springs, was working a flooring job at a home near the shooting scene when he heard dozens of popping sounds.\n\"I didn't think it was gunshots, because there was no pattern or anything,\" he said. \"But after about the 28th pop, I wanted to check it out.\"\nVancel walked outside the home and went toward a Party City store when he saw a man lying still in an empty parking lot. He couldn't tell if the man, who was wearing civilian clothes, was injured or staying out of the way of gunfire.\nAbout 40 yards away, Vancel said he saw a man running toward him carrying a rifle. Police were not on the scene yet, Vancel said, but sirens could be heard approaching the area.\nThe man was wearing all black and had a black mask over his face, like a ski mask, Vancel said. The man stopped and looked toward Vancel before running the opposite way toward Airline Highway. Vancel said he also turned and ran back to the house where he was working.\n\"The only thing my eyes kind of locked on was the rifle he was carrying,\" said Vancel, who couldn't determine the race of the gunman.\nFrom inside the home, Vancel said he heard dozens more gunshots.​\nAvery Hall, a 17-year-old worker at Benny’s Carwash directly behind the B-Quik convenience store on Airline Highway where the shooting began, said he was about to pull into work at about 8:45 a.m. when he was “caught in the crossfire.”\n“I thought it was a protest, that’s why I thought we could go around,” said Hall, a recent graduate from a Baton Rouge high school.\nGunshots continued as police ducked and aimed toward the fire. Hall scrambled to the Salbury’s Chrysler Dodge and hid behind his car.\nPolice told Hall and a coworker who was with him to take cover in the dealership, but the doors were locked. So they went to the Hammond Aire Auto Spa, which is directly across the highway from the shooting scene, where they stayed for hours with about 20 other people until police allowed them to leave.\nBy 8:48 a.m., emergency medical services personnel arrive at the scene.\n'The hatred just has to stop'\nObama urged politicians to temper their rhetoric and focus on unity as the Republican and Democratic conventions loomed.\n\"We don’t need inflammatory rhetoric,\" Obama said. “Someone once wrote: a bullet need happen only once, but for peace to work we have to be reminded of its existence again and again and again.\"\nEdwards called the attack \"unspeakable\" and \"unjustified.\"\n“The violence, the hatred just has to stop,\" Edwards said at his news conference flanked by law-enforcement officials.\nSterling's mother, Quinetta McMillon, said in a statement that her family were \"disgusted by the despicable act of violence today that resulted in the shooting deaths of members of the Baton Rouge law enforcement,\" adding, \"all we want is peace. We reject violence of any kind directed at members of law enforcement or citizens.\"\nThe shooting may already be affecting policing in nearby New Orleans, where Police Chief Michael Harrison said Sunday that officers will only respond to calls in pairs, WWL-TV reported.\nAnd in Milwaukee, police on Sunday said they would use two-person squads \"until further notice,\" after officer Brandon Baranowski was wounded early Sunday morningas he sat in his squad car. Police said the 20-year-old suspect was later found dead of a suspected self-inflicted gunshot wound, the Milwaukee Journal Sentinel reported.\nOn Monday, Cleveland Police Chief Calvin Williams said officers there had been riding in pairs since the shootings in Dallas.\nContributing: Chris Woodyard, Ryan Miller, Jack Richards, Brett Blackledge and Greg Toppo; Associated Press."}