{"uri": "http://www.mlive.com/news/grand-rapids/index.ssf/2016/07/as_teen_in_court_for_shooting.html#incart_river_home", "title": "As teen charged with shooting child, mom was on way to Myrtle Beach: prosecutor", "dct": "Sat, 02 Jul 2016 04:23:01 GMT", "id": "8fa5e91afac038cac83d40cef5af9bc3", "content": "GRAND RAPIDS, MI -- The mother of a 16-year-old accused in Thursday's shooting of a 4-year-old girl reportedly was taking a trip to Myrtle Beach when the shooting happened, prosecutors said.\nLouis Curry, 16, was arraigned in a Grand Rapids courtroom Friday, July 1 on two counts of attempted murder, felony firearm and accessory after the fact to a felony.\nAnother teen, 17-year-old Dereontae Foster, was expected to be arraigned Saturday on two counts of attempted murder and felony firearm, authorities said.\nPolice allege the two teens were involved in a drive-by shooting that inadvertently injured a 4-year-old girl, Naomi Fahim, as she walked with family members along a Leonard Street NE sidewalk. She was grazed in the knee by a bullet.\nA 17-year-old riding a bike and not associated with the Fahim family, Eugene Kamarri Williams, also was shot in the arm at Leonard Street and Houseman Avenue.\nAs Curry was in court for his arraignment Friday, Grand Rapids District Court Judge Christina Elmore asked if his parents or a guardian was in the courtroom.\nKent County Assistant Prosecutor Joseph Jackson said it was his understanding that Curry's mother, Lynnette Curry, was on a trip to Myrtle Beach.\nElmore set a $100,000 bond and ordered Curry to be held in the Kent County juvenile facility, even though his case is to be heard in adult court.\nProsecutors sought a higher bond, based in part on a social media photo of Curry showing him with cash and what appears to be a gun in his pocket.\nCurry's attorney, Freeman Haehnel, asked for the placement at the juvenile facility because Curry looks young.\nRelated: 4-year-old and teen injured in drive-by shooting\nHe said he's concerned that it \"probably wouldn't bear well for him\" if he's sent to the jail.\nCurry's criminal record as a juvenile includes 2015 charges for third-degree home invasion, larceny under $200, and retaining or stealing a financial transaction device.\nAnother charge is now pending for possession of a controlled substance.\nFoster has no juvenile record in Kent County.\nBoth Curry and Foster were arrested Thursday evening at a home in the 300 block of Pine Avenue NW. Another 16-year-old boy also was arrested, but he has not been charged in connection with the shooting.\nE-mail John Tunison: jtunison@mlive.com and follow him on Twitter at twitter.com/johntunison"}