{"uri": "http://www.nydailynews.com/news/national/wash-state-school-shooting-victim-zoe-galasso-nice-awesome-friends-article-1.1987539", "title": "Washington state school shooting victim Zoe Galasso remembered as 'nice and awesome' as second teen, Gia Soriano, dies", "dct": "Mon, 27 Oct 2014 01:35:00 GMT", "id": "759fcc074e5956ef489d553d21e2dc48", "content": "A teen girl killed in Friday’s shooting rampage at a Washington State high school was remembered Sunday as a “nice and awesome” friend by her peers — as a second teen died from wounds suffered in the attack.\nZoe Galasso was eating lunch in the cafeteria at Marysville-Pilchuck High School when she was gunned down by 14-year-old Jaylen Fryberg, who wounded four other people before turning the .40-caliber pistol on himself, friends told the Daily News on Sunday.\nGia Soriano, 14, who had been in critical condition after the gunfire, died late Sunday.\nGalasso was dating Fryberg’s cousin, 15-year-old Andrew Fryberg, who had also been critically injured in the shooting and remains hospitalized at Harborview Medical Center in Seattle, said Jordan Luton, a witness.\nAnother cousin, 14-year-old Nathan Hatch, was in serious condition, while Shaylee Chuckulnaskit, also 14, remained in critical condition at Providence Regional Medical Center in Everett, a hospital spokesman said.\nStudent witnesses said Jaylen targeted the group after he was spurned by a love interest, who chose one of his cousins over him. It’s unclear if Galasso was the love interest.\n“You would think there was some animosity that caused it, but they were the best of friends, they were like brothers,” Don Hatch, Nate’s grandfather, told Reuters. “All of us wonder why, but we are trying to pray together and heal and forge on.”\nGalasso was remembered as outgoing and vibrant by friends who took to social media to mourn her passing.\n“Workout clothes feel great to wear to school,” she tweeted that morning.\nAnd just last weekend, at a dance where Jaylen Fryberg was named homecoming prince, Galasso tweeted a photo of herself with Andrew, in formalwear with boutonnieres in place, smiling and holding hands.\n“My favorite,” she captioned the snap, beside a smiley face with hearts in place of the eyes.\nA family friend raised $15,000 in one day online to help with funeral costs.\n“Zoe was very outgoing,” 14-year-old Lukas Thorington told The Seattle Times. “She was into sports. She was nice and awesome. She was fun to hang out with.”\nWith News Wire Services"}