{"uri": "http://www.columbian.com/news/2015/mar/31/father-of-marysville-school-shooter-arrested-on-gu/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+the-columbian-headlines+%28The+Columbian%3A+Headlines%29", "title": "Father of Marysville school shooter arrested on gun charge", "dct": "Tue, 31 Mar 2015 00:00:00 GMT", "id": "aaed38898db0365997eaa312279bc613", "content": "Officials say teen used one of father's weapons to kill 4 classmates, self\nSEATTLE — The father of a high school student who killed four classmates and himself in the fall has been arrested on a federal charge that he was barred from possessing the gun his son used in the shooting.\nRaymond Lee Fryberg Jr. appeared Tuesday afternoon in U.S. District Court in Seattle. Prosecutors asked that he be kept in custody. A detention hearing was scheduled for Thursday. Fryberg said nothing during the brief hearing. He faces one count of unlawful possession of a firearm by a prohibited person.\nAn FBI agent alleged in a criminal complaint that although Fryberg was subject to a domestic violence protection order, he purchased five guns from a Cabela’s outdoor store, including the Beretta pistol his son used.\nJaylen Fryberg, 15, shot and fatally wounded four friends and seriously wounded another in October in the cafeteria at Marysville-Pilchuck High School.\nAnnette Hayes, the acting U.S. attorney in Seattle, said in a news release: “Our office has a long history of working with our federal, state, local and tribal law enforcement partners across Western Washington to prosecute those who illegally possess firearms. This case is part of that effort and a reminder that we are united in our commitment to get firearms out of the hands of those who pose the greatest risk to our communities.”\nAccording to the complaint, Fryberg’s then-girlfriend, the mother of one of his children, obtained a protection order against him in Tulalip Tribal Court in 2002, alleging that he had threatened her, slapped her and pulled her hair.\nNo-contest plea\nThe order became permanent, and in September 2012, Fryberg entered a no-contest plea to a charge that he violated it. He was given a suspended sentence of six months and ordered again to comply with the terms of the order.\nJust four months later, Fryberg went to a Cabela’s store on the Tulalip reservation and purchased the Beretta, the complaint said. He answered “no” on a federal form asking if he was subject to a court order restraining him from harassing, stalking or threatening a child or intimate partner, and he answered the same when he filled out forms for the purchase of four other weapons at the store between January 2013 and July 2014, the complaint said.\nIn a statement Tuesday, Cabela’s Inc. said it “strictly complies with federal, state and local laws regulating the sale of firearms. Cabela’s records indicate the transaction was processed in compliance with applicable regulations, including background checks.”\nState Sen. John McCoy, a member of the Tulalip Tribe, said he didn’t know Fryberg had been subject to a restraining order.\n“That’s exceptionally troublesome to me,” McCoy said. “It points me to the issue we’ve been arguing about in the state, that people are not going to tell the truth when they fill out the forms to buy a gun, so maybe we should have a registry of people who are subject to these orders. That’ll be more fodder for discussion.”\nTulalip Tribes Chairman Herman Williams said the tribal police department will continue to coordinate with federal authorities but would have no further comment on the ongoing investigation."}