{"uri": "http://www.kvue.com/news/local/sources-argument-led-to-fatal-north-austin-shooting/180198760", "title": "Police ID suspect, victim in North Austin shooting", "dct": "Mon, 09 May 2016 00:00:00 GMT", "id": "15813baf2e4d4fefae4a071c7f3bc03f", "content": "AUSTIN - UPDATE:\nPolice have identified the men involved in a fight that escalated to a shooting at a North Austin food truck early Sunday morning.\nAccording to Austin police, Osiel Benitez Benitez, 42, and Rigoberto Jose, 39, got into an argument in the 8600 block of North Lamar around 2:30 a.m. Sunday. Sources with APD tell KVUE the argument was over who was first in line at the food truck.\nBenitez Benitez allegedly shot and killed Jose before fleeing in a car. Police arrested him a short time later and booked him into the Travis County Jail.\nOnline records state Benitez Benitez is being held on $225,000 bond.\nORIGINAL STORY:\n\"There were other non life threatening injuries reported but again there's a lot of people involved so the detectives still investigating,\" said APD Officer Destiny Winston on Sunday.\n\"Today in the morning I come to work and see all the policemen out there,\" said Enrique Sevilla, a manager at Taquerias Las Chivas Jalisco next to the food truck.\nSevilla, 21, works seven days a week and said safety is not a concern for him.\n\"Crime happens anywhere. I'm not going to tell you this is the safest place in Austin but it is a pretty calm place. It's not something people should be worried about,\" said Sevilla.\nOther restaurant employees KVUE spoke with did not want to be on camera, but said its not uncommon to see men sitting and drinking in the parking lot next to their restaurant.\nSources are told KVUE News that the gunman may have been at a nightclub or bar before the shooting so alcohol may be a factor.\nPolice said the gunman took off in a car after the shooting but was captured a short time later. Police have not identified the man as of Sunday afternoon.\nSevilla told KVUE he's not letting an isolated incident affect his sense of security.\n\"Whatever happens outside in the parking lot right next to us is not under our control. What can we do?\" asked Sevilla.\nHe also wanted customers to know they have nothing to worry about.\n(© 2017 KVUE)"}