{"uri": "http://www.nydailynews.com/new-york/nyc-crime/killed-wounded-se-queens-shooting-article-1.1565754", "title": "Ski mask-wearing gunman kills man with ties to 50 Cent's G-Unit rap group in Queens", "dct": "Sat, 04 Jan 2014 06:54:00 GMT", "id": "c629b959ca45cc8d79b79e77544ea2d8", "content": "A rapper with close ties to 50 Cent was shot and killed Friday when a gunman in a black ski mask unloaded on an SUV full of people in Queens, police said.\nMazaradi Fox, 42, whose real name was Jamal Green, was killed at Farmers Blvd. and 134th Ave. in Jamaica about 4:10 p.m. when the shooter rolled up to his white SUV and opened fire.\nPolice sources said Fox, released from prison just two weeks ago, stumbled out of the Nissan SUV and collapsed in a driveway.\nThree other people in the SUV were wounded, including a 21-year-old man who was hit in the neck and shoulder and was in critical condition, police said. A second man, age 22, was wounded in the arm, and the fourth victim, a woman in her 20s — believed to be Fox’s daughter according to thisis50.com — suffered a graze wound to the neck, police said.\nParamedics rushed the survivors to Jamaica Hospital.\nFox, a native of Jamaica, Queens, got out of prison Dec. 20 after serving two years for an attempted assault. He was also convicted of attempted murder in 1998, according to court records.\nHe was a childhood friend of 50 Cent and was affiliated with the “In Da Club” rapper’s crew G-Unit. A spokesman for 50 Cent’s record company said Fox never signed with the label.\nHe ultimately parted company with 50 Cent and started his own rap label, Dumout, according to thisis50.com.\nFamily friends said Fox helped raise D’Aja Robinson, a 14-year-old girl shot dead while riding on a city bus through Jamaica in May. Relatives of the murdered girl said they considered Fox to be D’Aja’s stepfather.\nFox and 50 Cent hadn’t talked in some time, but 50 Cent attended D’Aja’s funeral and paid for the horse and carriage that carried the teen’s casket.\n50 Cent was in his New York studio when he heard Fox was murdered.\n“Saddened by the news of Mazaradi’s tragic passing,” he tweeted. “My thoughts and prayers go out to his family and friends.”\nSaddened by the news of Mazaradi's tragic passing my thoughts and prayers go out to his family and friends #smsaudio\n— 50cent (@50cent) January 4, 2014\nIn a jailhouse interview in August 2013, Fox said he and 50 Cent were still friends.\n“We going to be homeboys till we’re both buried I guess,” he told DJ Self. “That’s my man forever.”\nIt was unclear if the two rappers had reunited before Fox’s death.\nHe also told DJ Self he couldn’t wait to get back to rapping.\n“I’m ready to get the money and get the business,” he said. “I’m ready now. I was young in the game and now I’m ready.”\nThe Twitterverse was abuzz with news of Fox’s slaying.\n“#RIP Mazaradi Fox,” wrote @MikeBaggs. “And it seemed like homie was tryna leave the streets alone too. That’s the sad part.”\n“They say jail keeps some brothers alive,” added @Shamoneyxl. “He just came home 10 days ago and now he gone.”\nIt was unclear how many shots were fired before the gunman, described only as a black man dressed all in black, fled in a dark-colored Hyundai sedan, according to sources.\nCops were searching for the sedan Friday night.\nResidents were stunned by the bloodshed.\n“We’re not used to this,” said Tiffany Jackson, 19, who lives near the crime scene. “This is a safe area. We don’t have issues. I live next to a preacher and a post office.”\nThe fatal shooting marks the city’s fourth homicide of 2014.\nWith Kerry Burke, Rocco Parascandola and Brian Niemietz"}