{"uri": "http://foxct.com/2015/03/08/accidental-firearm-discharge-in-monroe-strikes-11-year-old-boy-in-the-cheek/", "title": "Accidental shooting in Monroe strikes 11 year-old boy in the cheek", "dct": "Sun, 08 Mar 2015 18:18:00 GMT", "id": "7155574bde33169c353e20eff05a5ee4", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nMONROE - Police responded to an accidental discharge of a firearm which shot an 11 year-old boy in the cheek.\nPolice say the incident happened around 3:30 p.m. at 76 Partridge Drive in Monroe after a 911 call was made by a resident inside the home.\nPolice say at least one other family member was home at the time.\nLt. Keith White of the Monroe Police Department says the homeowner was securing his 9mm handgun when it accidentally discharged and struck his son while both men were in the basement.\n\"The round had come through the wall from an adjacent area of the basement struck him while he was a family room couch,\" Lt. White said.\nThe child was transported to Bridgeport Hospital with non life threatening injuries and was later taken to Yale-New Haven Hospital.\nAccording to public records, the home at 76 Partridge Drive is owned by Vincent Pizzolato.\nThe incident is under investigation and the owner of the firearm is not currently being held in custody.\nSunday afternoon's events startled many living in the neighborhood, where the thought of owning a gun seems shocking to some people.\n\"Usually everyone's safe over here in the neighborhood. You wouldn't be expecting to carry a gun around,\" said Yuen Man Boronski, a woman who lives across the street from the home.\nPolice are still determining if the firearm is registered and if there were additional guns inside the home.\nPolice will also examine the 9 mm involved to determine if the misfire was caused by a mechanical or human error.\nLt. White says the incident re-enforces a gun holder's responsibility to operate a firearm safely.\n\"You always have to be aware of where that gun is pointing, and you always have to take the responsibility for what happens with that gun,\" said Lt. White.\nThe father is not facing any criminal charges but police say the case is still under investigation."}