{"uri": "https://www.rt.com/usa/360541-illinois-university-campus-shooting/", "title": "1 shot dead, 5 wounded on University of Illinois campus, shooter at large", "dct": "Mon, 26 Sep 2016 15:08:00 GMT", "id": "d5dd259dbdb60b7ba41ad3d3ab749044", "content": "Get short URL\nOne person was killed and five others injured on Sunday morning in two shootings near the University of Illinois at Urbana Champaign, which the police believe to be related.\nThe first shooting occurred 12:30 a.m. after an argument at a house party spilled into the street and caused a brawl, during which shots were fired, the police said.\n@ChampaignPD investigating two overnight shooting incidents. Total of 5 shooting victims. Investigation ongoing. More info to come.\n— City of Champaign (@champaigncity) 25 сентября 2016 г.\nFirearms were used on Green Street between Third and Fourth streets, about one block away from 'The Red Lion', a popular campus bar.\nThe scene at 4th and Green. An alert was sent to students about shots fired between 3rd and 4th streets in Champaign pic.twitter.com/zBJZAgTYWS\n— Masaki Sugimoto (@MasakiSugimoto) September 25, 2016\nFour people, who weren’t involved in the fight, received gunshot wounds in the incident.\nOne of them died of his wounds in hospital. The deceased was identified as a 22-year-old George Korchev from the Illinois suburb of Mudelein.\nIllini-Alert. It appears the shooter has left the area. Continue to avoid Green street from 2nd to 4th and 2nd street from Green to Healey.\n— Illini-Alert (@IlliniAlert) September 25, 2016\nThe rest of the victims were treated by doctors after being diagnosed with moderate injuries. One of the injured was confirmed to be a student at the Urbana-Champaign University.\nA fifth person was also hurt as he was hit by a vehicle as he attempted to flee the area and received non-life-threatening injuries.\nAbout half an hour after the first incident, the second shooting took place nearby and led to another person being hospitalized non-life-threatening gunshot wounds.\nKathryn Lawlor witnesses shots fired on Green Street in Champaign. She sent me this video. pic.twitter.com/Qv0x4YcpKf\n— Masaki Sugimoto (@MasakiSugimoto) September 25, 2016\nNo arrests have been made as the police are looking for suspect or suspects in both shootings as well as the driver of the car involved in hit and run.\nThe Red Lion kept patrons inside and allowed exit only from the beer garden going south, away from the crime scene, according to a manager\n— Angelica LaVito (@angelicalavito) September 25, 2016\nThe investigation believes that the two incidents at Illinois University campus are likely to be related."}