{"uri": "http://onlineathens.com/mobile/2016-07-30/seven-injured-athens-gang-shooting", "title": "Seven injured in Athens gang shooting", "dct": "Sat, 30 Jul 2016 15:43:00 GMT", "id": "062a3d5731afc0367b1272761c98e210", "content": "Seven people were injured late Friday night in what authorities are calling a gang-related shooting that occurred in front of a house in east Athens where some of the gang members were attending a party.\nNone of the injuries were life-threatening, according to Athens-Clarke County police Sgt. Mark Malueg, a supervisor in the Robbery Homicide Unit. Malueg said Saturday the shooting appeared to be a flare-up in a rivalry between two local street gangs that has already claimed two lives over the past couple of years.\nThree of the victims suffered gunshot wounds to the head.\n“How no one was killed I don’t know,” said Malueg. “That it wasn’t worse was just pure luck.”\nThe shooting happened at about midnight Friday, in the roadway outside of a house on Trail Creek Street, according to Malueg. Police are calling the shooting gang-related because the victims and others who were involved belonged to the NBA and 2 Tuff street gangs.\nAccording to the officer, some gang members were attending the party when rivals arrived in one or more vehicles and shooting erupted.\nPolice had not made any arrests as of late Saturday, though Malueg said investigators were busy following up on leads. He said the gang members who were shot were not being cooperative, and witnesses with whom police have spoken said they were too busy running for cover to see what happened.\nThe shooting occurred eight months after an innocent bystander was killed during a gun battle between NBA and 2 Tuff gang members.\nIn that incident, Breana Blackwell, 23, had just parked her car at Hawthorne Extension and Brooklyn Road on the night of Nov. 29 when the two gangs clashed near that intersection.\nWhen gunfire erupted, Blackwell was fatally struck in the head by a wayward bullet.\nJordorian “Jojo” Randolph, who authorities said was an NBA associate, was gunned down in May 2014 during a drive-by shooting that was believed orchestrated by the 2 Tuff gang.\nCapt. Jerry Saulters, commanding officer of the Athens-Clarke County Police Department’s D Criminal Investigation Division, said Saturday, “The gang violence in Athens-Clarke County is a high priority and will not be tolerated.\nEven prior to the weekend shooting, he said, “we have been working with the district dttorney’s Office, parole and probation to identify offenders and address this problem.”\nPolice urge anyone with information concerning Friday night’s shooting to call Sgt. Mark Malueg at (706) 613-3888, ext. 298\nFollow Criminal Justice reporter Joe Johnson at www.facebook.com/JoeJohnsonABH or www.twitter.com/JoeJohnsonABH."}