{"uri": "http://www.newschannel6now.com/story/33004362/update-possible-suspect-description-in-kingston-dr-shooting", "title": "UPDATE: Shooting victims identified", "dct": "Sat, 03 Sep 2016 05:26:00 GMT", "id": "c4735083615682ca8237dc17953ef9dd", "content": "WICHITA FALLS, TX (KAUZ) -\nOne McNeil Middle School student has been murdered and another has been seriously injured after a shooting on Friday afternoon. Wichita Falls police responded to a shooting in the 5100 block of Kingston Drive just after 3p.m. on Friday afternoon. When they arrived on scene they found two females victims with apparent gunshot wounds. The girls were rushed to the United Regional Hospital in Wichita Falls.\nThe victims were identified as 13-year-old Lauren Landavazo and 13-year-old Makayla Smith. Landavazo died from her injuries. Smith is currently in stable condition.\nShortly after at around 5p.m. police responded to what they believed was a second round of gunfire on Tower Dr., but were unable to find a secondary crime scene. Police do not yet know if these two incidents were related, and no new injuries were reported.\nWFPD said with the shooting taking place in broad daylight there were plenty of witnesses, and officials have gathered a lot of names.\nHowever, authorities are still looking for a suspect at this time and are asking anyone with information to contact Crimestoppers at 940-322-9888. Credible information can get you up to $2,500. However, officials have since said an anonymous donor has come forward and pledged to match the police reward for credible information in this investigation. Bringing the total to reward amount to $5,000.\nMeanwhile, just after 7p.m., a statement from the WFISD confirmed that one of the victims in the Kingston Street shooting in Wichita Falls died.\nGood evening, WFISD Parents and Staff. Today after school there was a tragic off-campus situation involving two girls from McNeil Middle School. I am saddened to report that one of those girls passed away and the other is in guarded condition. Please know that the district is coordinating efforts to provide grief counselors for students. As soon as we have more information about those resources, we will pass that along to you. As a district, we are saddened by this senseless act of violence and our thoughts and prayers are with all of those involved.\n-Michael Kuhrt, WFISD Superintendent\nWichita Falls police describe the possible suspect as a white male with curly brown hair in a black possibly a truck or SUV with chrome runners.\nWFISD sends parents email saying all children have been moved inside at McNeil Jr High. @Newschannel6Now\nWFISD sends parents email saying all children have been moved inside at McNeil Jr High. @Newschannel6Now\n— Chris Horgen (@ChrisKAUZ) September 2, 2016\nBREAKING: On scene of an apparent shooting on Kingston Dr. Will bring more when it's available. @Newschannel6Now pic.twitter.com/aP7ry0Ck1n\n— Alex Achten (@Alex_KAUZ) September 2, 2016\nAs the community morns the death of one of those young girls, a woman said she is also saddened and surprised this happened in her neighborhood.\nShe said she has lived there for 40 years, adding it is usually pretty calm there.\nCopyright 2016 KAUZ All Rights Reserved."}