{"uri": "http://www.shreveporttimes.com/story/news/crime/2016/05/05/two-killed-eight-injured-ambush-style-shooting/83966862/", "title": "Two killed, eight injured in ambush-style shooting", "dct": "Thu, 05 May 2016 00:00:00 GMT", "id": "d868e4556c22960127d537eb52267281", "content": "An early morning shooting in the Cherokee Park area of Shreveport left two men dead, eight others injured and residents of the neighborhood in a state of fear and confusion as details emerge on what happened.\nShreveport Police officers responded to the 300 block of North Thomas Drive just after 1 a.m. Thursday after receiving reports of a shooting at a local tire shop. Officers arriving on the scene discovered multiple victims suffering from gunshot wounds, who were later taken to area hospitals by ambulance and private vehicles and treated for injuries ranging from serious to non-life-threatening, SPD spokesman Cpl. Marcus Hines said..\nAuthorities have identified the two men killed in the shooting as Elton Wayne Madison and Leatrick Benjamin, both 37. Other victims included Henry Sherman, 44, and Randy Brown, 36, both listed in serious condition as of Thursday afternoon. Treated for non-life-threatening injuries and released from area hospitals were Tyrone Coley, 37, Joey Caldwell, 29, Robert Baulkman, 30, and Richard Baker, 29. Two more men, Kenneth Jones, 29, and Jeremy Madison, 28, only suffered minor cuts and scrapes.\nPreliminary investigation suggests a group of men were engaged in a card game after hours inside the tire shop when a group of three to four individuals entered with their faces covered. According to Hines, the suspects entering the business were armed with what appeared to be semi-automatic rifles and began firing on the individuals inside.\nLaGwen Hill, 63, has lived in the 500 block of Seneca Trail — around the corner from the scene of the ambush-style shooting — for more than thirty years. She had just gone to bed when she heard multiple shots from what she believed to be an automatic weapon nearby.\n\"It just kept going on,\" said Hill. \"I thought it was fireworks at first.\"\nHill said she has spent more time at home since retiring two years ago and has really seen her neighborhood change. When she first moved to the area, Hill said people took greater pride in the area but she has seen a recent increase in suspicious activity and a decrease in the feeling of safety.\nHill also was concerned about late night activity she has seen in and around the location of Thursday morning's shooting.\n\"I think it's a hangout,\" she said. \"Any time you get a bunch of young folks hanging out, there's no order to that. I've heard shots before, but never that close.\"\nShontel Grant, 41, a resident in the 400 block of Seneca Trail, said she has noticed increased, late-night activity at the tire business and has wondered what people were up to at what she considers odd hours for operation.\n\"I have no idea what they're doing in there,\" said Grant, who has lived in the neighborhood for three years.\nGrant said she woke up to a flurry of police cars early Thursday morning and checked the news to see what was happening. Although she normally allows her children to walk to Shreveport Super Store — a business located across the street from the scene of the shooting — Grant isn't sure she will continue allowing them to do so.\n\"It scares me — especially when you don't know what happened and who it involved,\" she said.\nApril Burley, 31, said she has never felt unsafe, but she does have a 14-year-old daughter that she is very protective of due to what she perceives to be an increase in area crime recently.\n\"You never know what can happen,\" Burley said. \"It's getting crazier and crazier.\"\nAl Russell operates Al's Auto Care, another business located across from the scene of Thursday morning's shooting. Russell said he has always worked on cars overnight at other locations he has operated but nearby activity — many people congregating at the business where the shooting occurred — caused him to change his normal routine.\n\"I can move past it,\" said Russell. \"But there's always concerns. That's why I go home early.\"\nRussell said he typically heads home around 8 or 9 p.m. every night due to concerns about the activities he has seen around the business where the shootings occurred.\nAs of Thursday afternoon, no suspects had been charged in the shooting, but detectives were pursuing leads and continuing to gather information and evidence.\nAuthorities urge anyone with any information to contact Crime Stoppers at (318) 673-7373 or to visit their website at www.lockemup.org.\nAnnual crime rates for District 2 (Cherokee Park is in District 2)\nTotal violent crime for 2015: 109\nTotal property crime for 2015: 61\nTotal crime for 2015: 439\nJanuary - March 2016 crime rates for District 2\nHomicide: 0\nRape: 3\nRobbery (Business and Person): 6\nAggravated battery: 3\nAggravated assault: 3\nBurglary (residence and business): 30\nShoplifting: 9\nTheft (business, residence, auto and general): 49\nTotal crime for January - March 2016: 103\n(Source: www.shreveportla.gov)"}