{"uri": "http://fox59.com/2016/05/27/9-year-old-boy-shot-in-the-head-killed-in-cumberland/", "title": "10-year-old boy shot in the head, killed in Cumberland", "dct": "Fri, 27 May 2016 15:59:00 GMT", "id": "e33a88657a73ae12752ffb000821cc16", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nUpdate (May 30, 2016) – Cumberland police released the following statement: We hope to conclude our investigation tomorrow (Tuesday) and then meet with the Marion County Prosecutor to determine if and what charges may or may not take place. We have not yet determined a time to meet with the Prosecutor’s Office.\nCUMBERLAND, Ind-- Police say a child was fatally shot in the head Friday afternoon in Cumberland.\nOfficers responded to Berkshire Square Apartments in the 500 block of Wickerwood Drive at 3:49 p.m. on a report of a person shot.\nA young boy was found suffering from a gunshot wound to the head in the kitchen of an apartment. Police confirm he was 10-years-old.\nThe boy was pronounced dead on the scene. Police identified him as Anthony Harmon Jr.\n\"It’s horrible,\" Crooke said. \"For us to start this holiday weekend off like this, we’ve been throwing things out about water safety all week, not thinking anything along these lines.\"\nThe boy lived at the apartment, according to Crooke. Only kids and young teens were there at the time, with no adults present.\nInvestigators took the kids to an offsite location as they attempted to contact parents and conduct interviews. It was unknown Friday where the gun came from, who it belonged to, or who pulled the trigger.\nNeighbor Clinton Farwell said the apartment complex is full of kids of all ages.\n\"When we first moved in, that whole back area (was) nothing but children and families,\" Farwell said.\nFarwell said, however, that the complex had recently seen more crime, including a murder last year.\n\"It’s right next to the playground area, to be honest it’s not even an area I let my child go to ... and I live right next to it,\" Farwell said.\nCumberland Police said they expected to provide another update to media on Saturday morning."}