{"uri": "http://www.denverpost.com/2016/09/17/girl-fatally-shot-in-thornton-street-during-house-party/", "title": "Girl fatally shot in Thornton street during house party", "dct": "Sat, 17 Sep 2016 11:02:00 GMT", "id": "d8cedc62d9a2c180e9f0642d18cf9789", "content": "Police are searching for a young gunman who shot and killed a 16-year-old girl outside a Thornton home during a house party early Saturday.\nThe name of the girl has not been released and no arrests have been made, according to Thornton police spokesman Matt Barnes.\nA suspect believed to be in his late teens or early 20s shot a girl in the middle of the 13000 block of Monaco Way at around 1:40 a.m., according to a news release sent out by the department.\n“I heard the shots. They were really loud. You could hear people screaming. People were running to their cars and driving away,” said Neddie Sandoval, 77, a neighbor.\nThere were two bursts of gunshots, with five or six shots fired each time, Sandoval said. She was first awakened by nearby voices in the normally quiet neighborhood a half block away from West Ridge Elementary School. It sounded like an argument, she said.\nMinutes later, police cars with lights flashing filled the block, Sandoval said. Police were talking to several witnesses, she said. It appeared that a lot of people had attended a party, she said. Police wrapped yellow crime-scene tape around several houses, including hers.\nWhen police arrived in the area of Monaco Way and Krameria Street, they found a juvenile girl lying in the street with a gunshot wound to the torso. She was taken to a hospital, where she was later pronounced dead.\nWitnesses told detectives that some type of disturbance broke out during a house party.\nOne girl said on social media that she watched her best friend die.\n“I saw it all. Watched u take your last breath. Saw u at your best and never any less than that. You fought but God decided he needed you back,” Julie Torres posted on Facebook.\nThe suspect fired his gun just as he was leaving the home, Barnes’ news release says.\nThe victim’s friends mourned her on social media.\n“My best friend was more than just a 16-year-old girl who was at a party.. She was an amazing person,” Alyssa Montoya wrote. “She deserves justice and I’m gonna get that for you I promise you. … I love you so much.”\nTorres also wrote about her loss.\n“She was my world. The realist one out there. Knew me better than anyone else I’d do anything to have her by my side again,” Torres wrote.\nOn Saturday afternoon, Barnes said detectives were still trying to track down people who had been at the party and perhaps seen the shooting.\n“They’re still following up on tips and trying to identify additional witnesses,” he said.\nBarnes said there is “no indication” at this time that the shooting was gang-related. He said the victim lived in unincorporated Adams County.\nThe dark-haired suspect was described as being “skinny” and about 5-feet-6. He wore eyeglasses and a gold hoop ring in one nostril. He was wearing a gray sweatshirt.\nWitnesses said he may have arrived in a red sedan.\nThe residential, normally uneventful neighborhood is a mix of retired couples and young families, Sandoval said.\n“It’s really nice and quiet here,” she said.\nSponsored Links\n.\nHome Solar QuotesHomeowners Are Furious With Their Power Company!Home Solar Quotes\nVital Reds SupplementHow To Fix Your Fatigue (Do This Every Day)Vital Reds Supplement\nWonderBuzzThis Dog's Life Changed Forever When These Hikers Stumbled Upon Him. This Amazing Story Will Melt Your Heart.WonderBuzz\nTruthFinder People Search SubscriptionIt's Scary What This Site Knows About You, Enter Your NameTruthFinder People Search Subscription\nForge Of Empires - Free Online GameThe Most Addictive Game Of The Year!Forge Of Empires - Free Online Game\nNowBuzz.MeForest Gump Producers Kept This Secret From FansNowBuzz.Me\nSponsored\nHomeowners Born Before 1985 Are Getting a Huge Reward\nIf you have not missed a mortgage payment in 3 years you need to see this. Learn More Sponsored by FetchaRate"}