{"uri": "http://www.9news.com/news/investigations/teen-charged-in-brothers-death-said-boy-shot-himself/281790417", "title": "Teen charged in brother's death said boy shot himself", "dct": "Tue, 26 Jul 2016 00:00:00 GMT", "id": "7a2412c393a8bfdd90fbf65bc6aacf00", "content": "KUSA - A now-18-year-old man charged with shooting and killing his younger brother initially told police that the 10-year-old boy shot himself, according to court documents unsealed Tuesday.\n“He shot himself – I am sorry,” Jalecc Taylor told the first officer at the scene, according to an arrest affidavit released after 9NEWS took legal action to make it public.\nTaylor was 17 when Anthony Hemmings was shot and killed, and he faces charges of negligent child abuse resulting in death and juvenile handgun possession.\nThe incident occurred around 9:30 p.m. on June 4 at an apartment in the 1500 block of Galena Street. The first officers on scene discovered Hemmings mortally wounded on the floor. A toy gun was discovered next to the boy, according to the affidavit, and officers quickly located a Glock pistol in a plastic bin in a bedroom closet.\nHemmings died a short time later.\nIn the meantime, officers questioned Taylor in the presence of the boys’ mother.\nInitially, according to the affidavit, Taylor said that Hemmings had discovered the gun and shot himself. Taylor told officers that after the shooting he “hid the gun out of fear.”\nAfter officers challenged that story, Taylor “then said that he obtained the gun from the plastic bin in the bedroom,” and that their sister, who was also present, did not know the boy had it, according to the affidavit. At that point, Taylor said “he went into the kitchen (and) was holding the gun in front of Anthony who was some four feet away on the mattress in the living room.”\nAccording to the affidavit, Taylor said he was using his sister’s phone to search for videos of a Glock model 40. Taylor said he then “set the gun on the table and Anthony came over and took the gun and pulled the slide one time while the barrel was pointed at Anthony’s chest and Anthony pulled the trigger,” according to the affidavit.\nAccording to the document, Taylor then “said he told Anthony to give the gun back but Anthony moved away from him and then pulled the trigger causing one bullet to enter his chest.”\nAt that point, according to the affidavit, the boys’ mother told officers to stop questioning Taylor, and he was arrested.\nThe affidavit was unsealed after 9NEWS requested a review of a court order that Taylor’s photo, which had been released by the Aurora Police Department, not be published.\nIn his ruling, District Judge John Popovich made it clear that Colorado law allows the publication of photos of juveniles charged with serious felonies, as Taylor was.\nIn the same ruling, Popovich unsealed the arrest affidavit.\nContact 9NEWS reporter Kevin Vaughan with tips about this or any story: kevin.vaughan@9news.com or 303-871-1862.\nCopyright 2016 KUSA"}