{"uri": "http://www.azcentral.com/story/news/local/glendale-breaking/2016/06/01/glendale-man-held-after-accidentally-shooting-friend/85245678/", "title": "Court records: Police arrest Glendale man who said he accidentally shot and killed friend", "dct": "Wed, 01 Jun 2016 00:00:00 GMT", "id": "03476b2b0e7313a20c179433399bf899", "content": "A 20-year-old Glendale man was arrested after he said he accidentally shot and killed his friend while driving to the store Sunday afternoon, according to Maricopa County Superior Court documents.\nBrent Dyllan Barron was booked into a Maricopa County jail on suspicion of manslaughter after fiddling with a .9 mm handgun and accidentally shooting his friend in the back, court documents said.\nAbout 1:47 p.m. Sunday, officers were called to Banner Estrella Medical Center, where a man who had been shot had been dropped off for treatment, documents show.\nAccording to court documents, the brother of the man who was shot, referred to as Willis, and Barron, who identified himself as B. Willis at the time, drove the man to the west Phoenix hospital.\nThe men explained to officers that they were all in the car together when the handgun became stuck and somehow fired, police said. Barron was in the rear passenger seat.\nPolice located the vehicle and found a bullet hole indicating a strike from the back of the driver’s seat to the front, where it may have landed in the steering wheel, documents stated.\nWillis stayed with his brother as he was taken into the emergency room, where they found a bullet wound in his back through the front of his abdomen, police said. The man, who has not yet been identified, later died at the hospital from his injuries.\nBarron left the area and requested to be picked up by his friend, according to court documents. While officers worked to secure the scene, Barron’s friend approached officers and asked to remove a wallet from the vehicle upon “his friend’s request.”\nOfficers advised the friend that he could not remove anything from the scene and followed him back to his red Pontiac where “B Willis,” or Barron, was changing into different clothes in the back seat, documents stated.\nBarron was taken into custody. During a search of the friend's car, police uncovered the gun that was used to shoot the man hidden underneath the shirt that Barron had been wearing during the initial hospital visit, officials said.\nAccording to documents, Barron explained to police that the gun’s upper receiver was locked and the safety on after his friend had manipulated it.\nHe went on to tell police that as he attempted to put the weapon’s receiver back into the right position, the safety moved to the fire position and the gun accidentally went off, officials said.\nBarron told police that the shooting was an accident and that he had no intent of killing his friend, according to documents.\nHis bond was set at $150,000 at an initial court appearance. His next court date is June 6 in Maricopa County Superior Court."}