{"uri": "http://www.wrcbtv.com/story/30345873/update-woman-talks-about-making-the-911-call-when-a-teen-was-shot", "title": "UPDATE: Police arrest man who shot a teen in face", "dct": "Fri, 20 Nov 2015 22:07:00 GMT", "id": "53252a20a869cd5089284ca817fe41a7", "content": "UPDATE: Detectives with the Hamilton County Sheriff's Office have arrested Thomas Q. Holder, 19, after the Hamilton County Grand Jury handed down indictments of Felony Reckless Endangerment, Contributing to the Delinquency of a Minor, Possession of a Prohibited Weapon, Unlawful Carrying or Possession of a Weapon, and Providing a Firearm to a Juvenile.\nHamilton County Sheriff's Office said the indictments came as a result of their investigation into the circumstances surrounded a 13-year old being shot in the face last month on Buck Trail in Harrison.\nPREVIOUS STORY: Investigators with the Hamilton County Sheriff's Office have determined that a 13-year-old was accidentally shot in the face by a family member while posing for pictures with guns.\nAccording to the Sheriff's Office, the firearms were illegally obtained. However, it's still unclear how the teens got their hands on the guns before the accident occurred.\n\"It's OK to take pictures with (guns), it's cool, it's society these days. But know what you're dealing with,\" said Kristi Manning, owner of Carter Shooting Supply. \"If you're gonna stand there and take a picture with it, don't stand there and take a picture with a loaded gun.\"\nManning spends a lot of time teaching adults and kids about gun safety here at the shooting range in Harrison.\nThe range is just a quarter-mile down the road from where a 13-year-old was shot in the face on Sunday. It happened at a home in the 6800 block of Buck Trail Drive.\nAccording to investigators, the teen was shot, on accident, by another family member before he was rushed to the hospital with non-life-threatening injuries.\nManning says it's wise to always treat a gun as if it's loaded.\n\"(Age) ten, 12, 13, 18, 20, 30. It's all the same. It's safety,\" she said. \"(Guns) are not toys. They are deadly weapons if they wanna be used that way, and they can hurt you.\"\nShe says parents should teach their kids to always check if a gun is loaded first, and clear it, before pointing it in a safe direction.\nIf parents don't feel comfortable, they should leave the teaching lesson to a professional. The range offers gun safety classes for kids of all ages.\n\"If you just hide one in your house, or don't think your kid's ever gonna touch it, or tell your kid don't touch it, it's a gun. That's just drawing attention to it to make them wanna do it more,\" she said. \"It's safety and education. Education is the key factor on anything.\"\nAs of Wednesday, no charges have been filed. But the Sheriff's Office says the investigation is still open.\nPREVIOUS: A teenage boy continues to recover after being accidentally shot by a family member while posing for pictures with weapons.\nNew information from the Hamilton County Sheriff's Office says the firearms were \"illegally obtained\" but did not elaborate on how they were obtained.\nSpokesman J. Matt Lea says the teen is expected to recover after Sunday's shooting.\nThe incident on Buck Trail in Harrison is still under investigation.\nPREVIOUS STORY: Channel 3 spoke to the woman by phone Monday, who called police after hearing screaming Buck Trail Drive.\n“I heard screaming and crying, and then I heard an older woman say: \"Where is he shot at? Where is he shot at?” said Kerry.\nBlue lights lit the street where deputies say a 13-year-old boy was shot in the face.\n“You never want someone else to feel any kind of pain, so I sympathize, it could be anyone's child,” said Kerry.\nOn scene, a spokesperson for the sheriff's office told Channel 3 the teen was alert and responsive when he was taken to a local hospital.\n“No arrest at this time, investigators are looking into it to see what might have happened,” said Max Templeton, Spokesperson, Hamilton County Sheriff’s Office.\nNearly 24 hours later, the sheriff's office is staying tight lipped, not saying who pulled the trigger, or what led to the shooting.\nSheriff Jim Hammond says it appears the shooting was an accident, but he says it's still early in the investigation.\n“I was concerned you know, especially with it happening next door,” said Karren Brown.\nKarren Brown lives next door to where the shooting took place. She’s praying the teen makes a full recovery.\n“I just hope that he's ok, you know, I’m just kind of worried about it,” said Brown.\nDeputies detained a few people on scene for questioning, but no charges have been filed.\nThe sheriff says it's still too early to know if they could be filed in the future.\nPREVIOUS STORY: Hamilton County Sheriff's Office PIO tells Channel 3 that the 13-year-old boy who was shot in the face remains responsive at the hospital.\nHe spent the night in the hospital after being transported in critical condition Sunday evening.\nLt. Max Templeton tells Channel 3 the investigation is ongoing and expect to pass along additional details later today.\nPREVIOUS STORY: Hamilton County investigators say a 13-year-old boy was shot in the face at a home on Buck Trail Drive Sunday night.\nThe Hamilton County Sheriff's Office says the boy was talking while being transported to a local hospital but the extent of his injuries is unknown.\nInvestigators say they are still looking into the circumstances surrounding the shooting but say they are questioning two potential witnesses.\nThe Hamilton County Sheriff's Office says this is an ongoing investigation.\nPREVIOUS STORY: The Hamilton County Sheriff's Office is on the scene of a shooting on Buck Trail Drive in Harrison. Investigators were called to a home just before 8 o'clock on reports someone had been shot.\nAuthorities on the scene say one person was transported to a local hospital. The extent of the victim's injuries is unknown."}