{"uri": "http://bpdnews.com/news/2016/4/10/one-less-gun-officers-arrest-two-recover-loaded-firearm-after-shots-fired-in-dorchester", "title": "One Less Gun: Officers Arrest Two, Recover Loaded Firearm After Shots Fired in Dorchester", "dct": "Mon, 11 Apr 2016 00:00:00 GMT", "id": "423e9c7659ccf9cb6e272be1a96093ae", "content": "At about 2:00 AM on Saturday April 9, 2016, officers assigned to District C-11 (Dorchester) arrested two suspects and recovered a loaded firearm after a call for shots fired in the area of Fernboro Street.\nDuring that incident, there were no reported injuries and no victims could be located. Officers were provided with a detailed description of a suspect vehicle which had been observed fleeing from the scene. A short time later, officers were on patrol in the area of Granite Avenue when they observed the suspect vehicle getting onto I 93 southbound at exit 11. The officers activated their lights and sirens and attempted to pull the car over but it continued and increased speed. The officers followed the vehicle until it crashed into a barrier while trying to get off the highway at exit 10 causing heavy damage to the car. Officers approached the crashed vehicle and observed three occupants suffering from non-life threatening injuries and immediately called for an ambulance. The officers were able to safely remove the rear seat passenger, a 16-year-old juvenile male from Taunton, and the driver, Tyshawn Sanders, 18, of Dorchester. Officers performed a pat frisk of the two individuals with negative results. The officers did not immediately remove the front seat passenger due to his placement within the vehicle and the nature of his injuries. After Boston EMS arrived on scene, the officers worked with them to remove the front seat passenger, a 17-year-old juvenile from Dorchester, and discovered a loaded 9mm Smith & Wesson handgun in his pants which was quickly recovered. All three suspects were then transported to a local hospital for further treatment and evaluation. Tyshawn Sanders was later released from the hospital and booked. The 16-year-old juvenile was released and has not been charged at this time. The 17-year-old juvenile suspect remains guarded at the hospital. Upon his release, he will appear in Dorchester Juvenile Court on charges of Delinquent to Wit: Unlawful Possession of a Firearm, Unlawful Possession of Ammunition and Possession of a Large Capacity Feeding Device. Tyshawn Sanders will appear in Dorchester District Court on charges of Failure to Stop for a Police Officer, Unlicensed Operation of a Motor Vehicle, Reckless Operation and Speeding.\nOfficers later determined that the firearm and the motor vehicle had been recently stolen during two separate incidents which continue to be investigated."}