{"uri": "http://heralddemocrat.com/news/texas/5-slayings-3-places-4-hours-stretch-dallas-police-s-homicide-unit", "title": "5 slayings in 3 places in 4 hours stretch Dallas police's homicide unit", "dct": "Sun, 29 Jan 2017 00:09:10 GMT", "id": "3a81413cfcede9d87c8d97fa645afe79", "content": "A spate of five homicides within four hours last weekend stretched the capabilities of Dallas homicide investigators who said Monday that one more death would have forced them to use a backup plan.\nA spate of five homicides within four hours last weekend stretched the capabilities of Dallas homicide investigators who said Monday that one more death would have forced them to use a backup plan.\nEight homicide detectives - one third of the unit's investigators - two sergeants and a lieutenant responded to the scenes of the Sunday slayings.\nWith many in the unit working cases and several others on vacation or sick, commanders had to come up with contingency plans in case homicide detectives received any other calls Sunday, said Maj. Jeff Cotner of the crimes against persons division. The homicide unit also investigates unexplained deaths, suicides and other incidents, such as the body found Monday at a DART bus stop that doesn't appear to be a murder.\nCotner said the five homicides in one day isn't a Dallas record, but it is unusual. The city also simply isn't home to as many murders anymore.\n\"How often has this come up where we have multiple deaths in multiple locations and rely on a third of our resources?\" Cotner said. \"That just doesn't come up very often. It just doesn't.\"\nThe first call came in after 1 a.m. Sunday. Trevon Brown, 17, was at a Deep Ellum venue in the 2800 block of Main Street that a private party had rented for the night. After an apparent disturbance, Brown was fatally shot near the doorway.\nCotner said police have interviewed witnesses at the club. It's still unclear if Brown was part of the disturbance or just in the wrong place at the wrong time.\nThen, around 2 a.m., police found Patricia Tinajero, 33, dead of gunshot wounds inside her rental home in the 7400 block of Hillstar Circle in southeast Dallas. Her boyfriend was also dead of an apparent suicide - a single gunshot wound in the head.\nAuthorities had not released the man's identity late Monday, while relatives were being notified. Cotner said Tinajero and the man hadn't been dating long and had no reported history of domestic violence between them.\nCotner said there were other adults in a different part of the house when the shooting happened.\n\"We believe they were possibly arguing beforehand,\" said Cotner of Tinajero and the man. \"We're still working through that. But we have no clear understanding as to why.\"\nThe final shooting call came in shortly after 4:30 a.m. in the 2000 block of Ben Hur Street in Rylie. There police found three people dead, and a fourth wounded.\nThe dead were identified Monday as Max Vester McEwen, 54; Deborah Lou Stanley, 57; and Jose Alfredo Lopez, 21. Stanley's and McEwen's causes of death were not released. But the Dallas County medical examiner's office ruled Lopez died from a shotgun blast.\nDetectives had not talked to the wounded victim late Monday, and Cotner said detectives don't have a clear motive. He said there were other people inside the 756-square-foot home who were not wounded. But they aren't pointing police straight to the killer.\n\"Because of the time frame - everyone was asleep - there was just not a lot of information,\" he said.\nThe attacker does not appear to have come from inside the house, he said.\nThe home's owner, who appears to live in Kemp, could not be reached for comment.\nThe five slayings came after the city flirted with a decades-low homicide pace for much of last year. Cotner said the department is still working on the final 2014 homicide figures because of a few unexplained deaths. Preliminary counts suggest the 2014 tally will be about half of the 248 murders the city tallied in 2004, when crime rate was higher.\nStill, Cotner acknowledged that Sunday's deadly day kept homicide investigators hopping more than usual because each new case takes a detective temporarily out of the rotation. And he said police had to handle numerous witnesses and officers at each scene, as well as physical evidence Sunday.\n\"The thing about homicide investigations - you have to work on it right then,\" Cotner said. \"It's not like you're phoning in and said, 'OK, I'll come in tomorrow and I'll work on it.' You pursue all active leads, and you have to work on it right then.\"\n(c)2015 The Dallas Morning News\nVisit The Dallas Morning News at www.dallasnews.com\nDistributed by Tribune Content Agency, LLC"}