{"uri": "http://www.wltx.com/story/news/2014/09/17/family-still-reeling-after-toddlers-shooting-death/15810785/", "title": "Family Still Reeling After Toddler's Shooting Death", "dct": "Wed, 17 Sep 2014 00:00:00 GMT", "id": "1a06363b4b16fba0385ed8815e9f2e6e", "content": "Denmark, SC (WLTX) -- There are more details surrounding the death of a 2-year-old boy who was shot and killed near his Denmark home Saturday.\nArrest warrants in this case shed some light on the details surrounding the 2-year-old Hayden Mayes' death.\nHayden was was shot and killed at his neighbors home. That neighbor, 44-year-old Sidney Davis, has not been charged in the child's death, but he was subsequently detained and booked on four charges.\nDavis is at the Bamberg County jail and stands accused of being a felon in possession of a weapon. That weapon, a black Smith and Wesson 40 caliber semi-automatic handgun was reported stolen in Augusta, Georgia, warrants allege.\nDavis is being charged with possessing a stolen weapon, as well as for having marijuana and drug paraphernalia at his home.\nThe toddlers family is still having a difficult time dealing with the whole situation. Wednesday, they held a wake for friends and family to say their final goodbyes, and also had a private family gathering.\nHayden's mother, Shana Prophet was simply too shook up to speak at the gathering at her mother's home, but had her son memorialized in a painting.\nFuneral services are being held tomorrow at the Central Baptist Church in Denmark. The Rev. Alex Jefferson has known Prophet her whole life and will be presiding over the service.\n\"I was shocked because, like i said, I know the little boy,\" Rev. Jefferson said outside the church. \"He was outstanding.\"\n\"I just give (Prophet) encouraging words and tell her it's hard but God's going to work through it. All she's got to do is keep the faith. She can weep now, but joy will come. All she's got to do is hold on.\"\nDavis is expected to have a bond hearing Friday morning at 10 a.m."}