{"uri": "http://www.live5news.com/story/26527426/2-year-old-boy-shot-and-killed", "title": "2-year-old boy shot and killed, investigation still underway", "dct": "NODATE", "id": "5ac8173ce1683984324a0ce740c2e1ba", "content": "DENMARK, SC (WIS) -\nA 2-year-old boy shot and killed near his home in Denmark has the small city trying to work through the tragedy.\nThe toddler was shot on Saturday afternoon on East Mill Street, according to the Bamberg County coroner.\nSLED is investigating exactly how this happened and who is responsible.\nThose who knew Hayden Mayes said he was a happy, lively boy who, even at 2 years old had an excited feeling toward life.\n\"Just couldn't believe it,\" said Rosa Samuel, a member of Central Baptist Church. \"[He was] up and down the aisle ways, laughing and smiling. He's a cute little handsome boy. He had a spirit about him.\"\nLinda Jamison also knew the Mayes family.\n\"He was my friend and he was everybody's friend that was in the church,\" Jamison said. \"Every time you see him he'd be doing something that a young boy would do. Reaching his hands out for love.\"\nChurch members remember Hayes as a sweet little boy. It's why for the small congregation, the recent hours have been hard to bear.\n\"I was so upset,\" Samuel said. \"When I heard about it I couldn't believe it.\"\nAuthorities said Hayden died after being shot near his home.\n\"It could have happened to anybody,\" Samuel said.\nYet why it happened to this child is still unclear while authorities continue to investigate.\n\"Just hope and pray that everything will work out for the family,\" Samuel said.\nFor now that's all members of Hayden's church say they can do.\nWhile they mourn, some are thankful for the time they got to spend watching a flower grow.\n\"We thank God for the time that he allowed him to be around all of us and I thank God for that,\" Samuel said.\nThe Bamberg County Sheriff's Office called SLED in to help with the investigation.\nIt's not clear how long it will take, if they have a suspect or if any charges will be filed.\nFuneral services for Hayden have not yet been announced.\nCopyright 2014 WIS. All rights reserved."}