{"uri": "http://www.delawareonline.com/story/news/crime/2016/06/14/five-people-shot-wilmington-police-say/85903204/", "title": "4 kids hospitalized after Wilmington shooting", "dct": "Tue, 14 Jun 2016 00:00:00 GMT", "id": "ff2956ca2024c889f856d7d4866c0b23", "content": "Damian Giletto/The News Journal\nWilmington police have released more details about Tuesday night's shooting that injured several teens.\nFour children were struck by gunfire just before 9:15 in the area of South Van Buren and Elm streets, said Sgt. Andrea Janvier, a spokeswoman with the Wilmington Police Department.\nA fifth person, a 37-year-old man, was initially believed to be grazed by a bullet. However, when evaluated by paramedics, no injuries were found and the man refused medical treatment, Janvier said.\nOne teenager, a 15-year-old boy, is in critical condition at Christiana Hospital. He was shot in his stomach, hand and left leg, Janvier said.\nParamedics also took a 16-year-old boy to Christiana Hospital. He's in stable condition after getting shot in the legs and right arm, Janvier said.\nTwo other victims were taken to the Nemours Alfred I. DuPont Hospital for treatment. A 13-year-old girl is in stable condition with a gunshot wound to her thigh, and a 12-year-old boy is in stable condition after being struck in the hip and feet, Janvier said.\nTwo other shootings have occurred in the Hedgeville neighborhood within the past week.\nA 24-year-old man was shot in the shoulder Monday, and a teen boy was shot in the abdomen last Friday, according to police. Both were described as stable.\nPolice closed several blocks of the neighborhood as they investigated the shootings.\nAt least nine evidence cones could be seen in front of a corner house at South Van Buren and Elm streets.\nRenee Wise said she was on South Harrison Street heading to her daughter's house when she ran into a number of police throughout the neighborhood.\n\"I didn't know any of this was out here,\" Wise said. \"I looked and I said, 'What is going on?'\"\nWise, who heard the victims were juveniles, was devastated.\n\"It is absolutely heartbreaking and it is sad, and now it is spilling over out here with these babies out here,\" she said.\nWilmington firefighters applied a soapy liquid up the block in front of a boarded building at South Harrison and Elm streets.\nThe investigation is in the preliminary stages and ongoing. Anyone with information relative to this investigation is asked to call Detective Lindsay Hageman at (302) 576-3630 or Detective A. Reddick at (302) 576-3649.\nSTORY: Man falls asleep, fatally crashes into 84-year-old woman, police say"}