{"uri": "http://www.abajournal.com/news/article/women_gunned_down_at_del._courthouse_were_slain_by_father_of_man_involved/", "title": "Women gunned down at Delaware courthouse were there for child-support hearing", "dct": "Tue, 12 Feb 2013 18:11:00 GMT", "id": "68a2dad658e48785ba86a2f1a72b74aa", "content": "Christine Belford reportedly was fearful of her ex-husband, who had served time in federal prison for kidnapping the couple’s three children in 2007, as well as for bank fraud.\nBut it was his father, Thomas F. Matusiewicz, 68, who gunned down Belford, 39, and a female friend at the New Castle County courthouse in Wilimington on Monday morning, as she and her ex-husband were arriving for a child-support hearing, according to the News Journal and other media reports. Earlier news accounts on the day of the shootings incorrectly indicated that Belford’s ex-husband might have been responsible for the two slayings and was dead.\nThomas Matusiewicz also was dead at the scene and two police officers, who were wearing bulletproof vests, were treated and released after taking bullets to the chest. The newspaper says it isn’t clear whether Matusiewicz took his own life or was killed by courthouse police returning his fire.\nBelford’s ex-husband, David Matusiewicz, was released from federal prison last year. He was found inside the courthouse, as police from multiple jurisdictions searched it after the shootings to insure there were no other incidents, and was being questioned by authorities Monday night as they sought more details about the 8 a.m. shootings, according to the newspaper article. It relies on unidentified law enforcement and legal sources for some of the information it provides, including the identity of the gunman and the four victims.\nAttorney General Beau Biden said at a Monday news conference that relatives were still being notified and some details also were being withheld to protect the investigation. He confirmed that a long-running custody dispute was the motive for the shootings.\nAlthough David Matusiewicz had had his parental rights terminated, according to information Belford provided to the News Journal in December, a court case was still ongoing over allegedly unpaid child support. An earlier News Journal article about the shootings provides some additional details.\nHis mother, Lenore Matusiewicz, had been convicted in a Delaware state court of three counts of child endangerment for helping her son kidnap the three girls and was sentenced to 18 months.\nChick Chinski, 62, who was reporting to the courthouse for jury duty on Monday, told the newspaper he rode the elevator from the garage to the courthouse with Thomas Matusiewicz, who authorities said opened fire with a handgun at the two women as soon as he entered the courthouse.\nChinski said he turned around after entering the courthouse himself and saw Matusiewicz with the gun.\n“I just saw him walk in, point the gun and I heard the shots. The women went down,” he told the News Journal. “I saw the cop hit the floor, then I hit the floor, then everybody else was going down. There was maybe 50, 60 people in the lobby.”\nThomas Matusiewicz never said a word before “instantly” going for the women, who were clearly his intended target, said Chinski.\nThe courthouse will be closed Tuesday.\nSupreme Court Chief Justice Myron T. Steele thanked police for their work and said the violence at the courthouse “has saddened and horrified all of us.”\nEarlier coverage:\nABAJournal.com: “3 dead, 2 wounded in Delaware courthouse shooting”"}