{"uri": "http://articles.latimes.com/2013/feb/13/nation/la-na-nn-delaware-courthouse-shooting-matusiewicz-20130212", "title": "In Delaware courthouse shooting, a complicated family history", "dct": "Wed, 13 Feb 2013 00:00:00 GMT", "id": "76e55aeff5bc8adfdd085ddd2e29cdf5", "content": "As the New Castle County Courthouse in Delaware remained partially closed Wednesday, two days after a gunman killed two people and then himself inside its lobby, the gunman's daughter told a local paper she thinks his deteriorating health played a role in the shooting.\nThomas Matusiewicz, 68, knew his ex-daughter-in-law Christine Belford would be in court Monday for a child support hearing and had staked out a spot in the lobby, police said. When she walked in, he shot her at close range using a .45-caliber handgun. Matusiewicz’s spray of bullets also killed Laura Mulford -- a neighbor who had accompanied Belford -- and injured two capitol police officers. He then turned the gun on himself.\nBut Matusiewicz's daughter, Amy Gonzalez, told the (Wilmington, Del.) News Journal that her father had a brain tumor \"for at least 15 years” and that she thinks knowing he was sick played a role in the shooting.\n“I know he was trying to do what was best for the family,” she said Wednesday. “Unfortunately, it wasn’t the right way.”\nAccording to court documents and an FBI statement, the Matusiewicz family had a years-long, tumultuous relationship with Belford.\nIn August 2007, Matusiewicz’s wife, Lenore, and son, David, who was married to Belford for almost five years, loaded David's three young daughters into a motor home, telling Belford the girls were going on a two-week trip to Walt Disney World. Instead, they embarked on a 19-month journey through Mexico, Panama, Costa Rica and Nicaragua.\nAs the international search entered its 11th month, “America’s Most Wanted” featured the family’s saga. Then, in March 2009, a deputy U.S. marshal arrested David Matusiewicz in Nicaragua, where they also found a cache of fake Social Security cards and passports for him and his daughters.\nSix months later he pleaded guilty to bank fraud and international parental kidnapping and was eventually sentenced to four years in prison and five years of probation, court documents show.\n“He robbed the children of 19 months of a normal, healthy childhood and exposed them to continuing psychological harm,” David Weiss, U.S attorney for the District of Delaware, said at the time.\nLenore Matusiewicz pleaded guilty to endangering the girls' welfare and was sentenced to 18 months in prison and ordered to pay for family counseling, the Associated Press reported.\nDavid Matusiewicz, who was released from federal prison in Texas in September, violated parole by not paying child support and court fees, according to a document filed in federal court on Tuesday.\nMatusiewicz, who is back in federal custody, made an initial court appearance Tuesday, Kimberlynn Reeves, a spokeswoman for the U.S. attorney's office in Wilmington, told The Los Angeles Times. He is scheduled to appear at a hearing in federal court on Friday.\nALSO:\nmarisa.gerber@latimes.com"}