{"uri": "http://www.cleveland.com/metro/index.ssf/2016/12/lakewood_man_accused_of_shooti_1.html", "title": "Lakewood man accused of shooting Muslim teen is charged with ethnic intimidation", "dct": "Fri, 09 Dec 2016 14:41:00 GMT", "id": "f99687e6f319c7c3f1b688325c2dbc46", "content": "CLEVELAND, Ohio -- A grand jury returned felonious assault, aggravated menacing and ethnic intimidation charges against a man accused of making anti-Islamic comments before he shot a 16-year-old boy in Lakewood.\nDenzal Johnson, 26, is scheduled for a Dec. 21 arraignment on the charges in Cuyahoga County Common Pleas Court.\nJohnson shot the boy after an argument about 11 p.m. Nov. 26 on West Clifton Boulevard between Detroit and Sloan avenues, police said.\nJohnson's roommate, 20-year-old Khadijah Muhammad, was also charged with obstructing official business after police said she picked up Johnson's keys from the ground at the shooting scene.\nThe Cleveland chapter of the Council on American-Islamic Relations said that Johnson called the teen a \"terrorist\" and made reference to the Taliban before the shooting.\nThe Lakewood High School student was wearing a kufi, a traditional Islamic head covering, as he walked home from his part-time job, according to a press release from CAIR-Cleveland. The boy was shot in the arm, and he was treated and released from MetroHealth.\nCAIR-Cleveland, a local Muslim civil rights group, says the Saturday night shooting of a 16-year-old Muslim boy in Lakewood may have been targeted. Police say they are not investigating the case as such.\nLakewood police said in the days after the incident that they were not investigating the case as a hate crime.\nThe boy told police that Johnson made comments referencing the boy being Middle Eastern during the argument, Sprague said.\nPolice arrested Johnson a few hours later. He was very cooperative with investigators and admitted to getting into an argument with the boy and firing a shot from his .38-caliber handgun, Sprague said.\nBut Johnson denied making any ethnically charged comments, Sprague said, and claimed the shooting was in self-defense.\nDetectives found no witnesses to the confrontation who could corroborate whether Johnson made the statements, Sprague said.\nCAIR Executive Director Julia Shearson welcomed the ethnic intimidation charge against Johnson, and hoped it would send a message.\n\"Not only do we want to protect people from crime, but we want to protect people from crimes that are an assault on the diversity and tolerance in our community,\" Shearson said.\nJohnson is being held on $100,000 bond.\nTo comment on this story please visit Friday's crime and courts comments section."}