{"uri": "http://www.adn.com/article/20150603/kenai-police-missing-family-died-murder-suicide", "title": "Missing family likely died in murder-suicide, Kenai police say", "dct": "Wed, 28 Sep 2016 00:00:00 GMT", "id": "6bb9f75ee7e0df6ee4f3b37dd7f2df62", "content": "Findings from the State Medical Examiner Office suggest a family of four, missing on the Kenai Peninsula for nearly a year before their remains were discovered in March, were the victims of a murder-suicide, Kenai police said Wednesday.\nIn a release, the Kenai Police Department said the findings are consistent with findings from their own investigation and that of the FBI, which indicate that \"Brandon Jividen shot and killed Rebecca Adams, Michelle Hundley, Jaracca Hundley, the dog Sparks and then committed suicide by shooting himself.\"\nThe mystery surrounding the family's disappearance may have come to a close, but family members said Wednesday they're far from finding closure.\n\"We thought there would be closure when we buried them,\" Rebecca Adams' uncle Dennis Gifford said. \"But no. I don't even know what closure is.\"\nFamily, friends, volunteers and law enforcement searched for months for signs of their whereabouts but came up empty-handed -- until March, when remains were discovered in a low, grassy area about 15 yards off a trail packed down for vehicles and four-wheelers.\nRebecca Adams' aunt Kim Gifford said when the family went missing, a conclusion like this was \"the furthest thing\" from her mind.\n\"As we learned more information, this path was one we saw, but we prayed it wouldn't be it,\" Dennis Gifford said. \"Brandon's mom and sister have become a part of our family and we love them dearly. We hoped none of this would happen.\"\nThe Kenai Police Department said any theory about a motive at this point would only be \"speculative.\"\nIn a statement, the family of Jividen expressed condolences to the families of Adams and the Hundleys and said the result of the investigation \"was not what our family had anticipated.\"\n\"These acts are unthinkable, unimaginable, and not consistent with the father, son, brother, and friend that so many of us knew and loved,\" the statement said."}