{"uri": "http://www.wfaa.com/story/news/crime/2015/11/16/one-arrested-after-six-found-dead-in-east-texas/75892704/", "title": "Midlothian couple killed in mass murder near Palestine", "dct": "Mon, 16 Nov 2015 00:00:00 GMT", "id": "8196f9ea7c0bf120f9831dcdd36b1154", "content": "ANDERSON COUNTY – Sheriff's deputies said they have not pinpointed a motive in the deaths of six people — the largest mass murder anyone here can remember.\nA neighbor is suspected of killing the six individuals, including a young child, who were on a weekend campout on their own land nearby.\nAt least three of the victims — Thomas Kamp, Hannah Johnson, and her young son Kade — lived in Midlothian, southwest of Dallas. But Kamp recently purchased a rural parcel of land off County Road 2217 between Tennessee Colony and Palestine.\n(Photo: Facebook)\n\"They bought land probably to camp – come to the piney woods to camp,\" said Anderson County Sheriff Greg Taylor.\nBut Sunday morning at 7:02 a.m. the sheriff got a 911 call from the property. Arriving deputies found the bodies of a man and a woman in a travel trailer.\nThen — Monday afternoon about 1:15 p.m. — investigators pulled four more bodies out of a nearby pond. There were the remains of three men along with Hannah's son, Kade.\nCarl Johnson, 77, Hannah's father, was one of the victims, according to KYTX-TV, WFAA's sister station in East Texas.\nNames of the other deceased have not been released.\nThe only survivor is Hannah's mother, Cynthia Johnson, according to the Franklin (Maine) Sun Journal. Sheriff Taylor said she made the call for help and hid in the woods until deputies arrived.\nMrs. Johnson and physical evidence, the sheriff said, led them to suspect a neighbor, William Hudson, 33, for the crime.\nInvestigators said they found him at his mother's house not far from his own home nearby.\n\"He was passive [and] resisted at first,\" Sheriff Taylor explained. \"He wouldn't come out. But then I believe he got a call from his mother or sister and he came out peacefully.\"\nThe district attorney said Hudson currently faces one count of murder and is jailed in lieu of $2.5 million bond. The DA said prosecutors are preparing additional charges.\nSheriff Taylor said it's uncertain how the victims died... or why. Neither the victims nor the suspect knew each other, he explained.\nThe motive for the murders remains a mystery.\nKamp and Johnson had been in a relationship for five years, according to his Facebook page. She worked at Compass Adjusting Services, an insurance adjuster, off South Hulen Street and Bellaire Drive in southwest Fort Worth, according to her Facebook account.\nKamp is originally from California. Johnson grew up in Maine.\nHer parents retired in Anderson County, according to the Sun Journal. Public records show they lived for a decade in Hillsboro in Hill County.\nHudson is not talking to investigators, and has not made any admission, the sheriff said. Taylor said Hudson was investigated for assault in the last few weeks, but did not deliberate.\nThe six bodies were sent to Tyler. A preliminary autopsy report on them will not be ready until Tuesday evening or Wednesday morning, the sheriff said."}