{"uri": "http://www.palestineherald.com/news/hudson-named-as-alleged-murderer-in-tennessee-colony/article_5ee40888-8cbd-11e5-a74b-ef19223b70de.html", "title": "Hudson named as alleged murderer in Tennessee Colony", "dct": "Mon, 16 Nov 2015 00:00:00 GMT", "id": "9804f804857520c4a7b7db8bf200c92e", "content": "The Anderson County Sheriff announced William Mitchell Hudson, 33, of Tennessee Colony has been charged with murder in an incident near Tennessee Colony on Sunday. Sheriff Greg Taylor said this incident has the most body count he has ever seen.\nBetween 4-5 a.m. Nov. 15, shots were heard in the area between Harmony and Tennessee Colony. The sheriff's office was contacted by a female victim of the shooting at 7:02 a.m. The incident occurred on the 800 block of ACR 2217.\nWhen deputies arrived two bodies, one male and one female, were found in a travel trailer. Family members told the Herald-Press that members of two families were visiting the newly bought land, to be used for camping and hunting.\nThe investigation began with the ACSO, Anderson County District Attorney's office, Texas Rangers and Palestine Police detectives, according to Taylor. The initial body count was two until evidence led the investigators to a nearby pond where four more bodies were found early Monday afternoon.\nThe injured adult female who called in the incident, after a period of hiding in the woods, is the only survivor. She was found by the road, according to the sheriff. The names and ages of the individuals are not being released at this time. All victims are accounted for, said Taylor.\nThe survivor spent Sunday with the Anderson County Women's Crisis Center and visited Monday with the Anderson County District Attorney. She has since been released to family.\nThe land with the travel trailer is undeveloped and adjoins to Hudson's property. The four bodies found at 1:15 p.m. Monday were allegedly placed in the pond behind Hudson's house. All bodies were males and one was a child, according to the sheriff. The cause of death of the four bodies in the pond is unknown, Taylor said.\nTaylor said he believes all of the victims were related between two families. None of the victims were local. Sheriff said some were from Midlothian, Texas and Maine, but family members were also calling from California, New York and Florida.\n“The area of the crime is quite large,” Taylor said at the press conference. “It includes the area with the travel trailer to the land with the house and pond and another residence west of there.”\nTaylor said all deaths are unknown at this time. Rain is making working the crime scene extremely difficult, Taylor said.\nSheriff reported no relationship between the victims and Hudson. Taylor said the incident is not drug related.\nHudson was located at his mother's house, next door to his house, and was taken in for questioning on Sunday morning. By late Sunday afternoon, he was arrested. For the moment, Hudson is being charged with one count of murder. He is being held for $2.5 million bond.\nSheriff said Hudson had a recent assault incident with the Anderson County Sheriff's Office.\nNo other suspects are being considered by the sheriff's office. Hudson could be charged with more counts of murder in the future, according to Taylor.\nAll bodies are being sent to Medical Examiners Office in Tyler and the sheriff is expecting preliminary autopsy reports by Wednesday. The lead investigator of the case is ASCO Capt. Ronnie Foster assisted by Texas Rangers Michael Adcox and Rudy Flores.\n“This is a large case and we need all the help we can get,” Taylor said. “We greatly appreciate the help of the Texas Rangers Adcox and Flores.”\nSheriff said the investigators are continuing to gather evidence from the area and the road remains closed during the investigation. He expects to be at the scene for at least two more days. The bodies have been removed from the area. Impending weather of strong storms are expected tonight with more rain on Tuesday throughout the day.\n“The weather is not helping us at all,” Taylor said in a later interview."}