{"uri": "http://www.mlive.com/news/detroit/index.ssf/2016/04/neighbors_fear_for_own_childre.html#incart_river_home", "title": "Neighbors fear for own children after baby killed in suspected gang shooting", "dct": "Tue, 19 Apr 2016 07:37:00 GMT", "id": "bad256fec6279ba7f1137632f70c38db", "content": "REST IN HEAVEN BABE MIRACLE MURRAY, WE ARE STANDING UP FOR JUSTICE DETROIT STREET WATCHERS pic.twitter.com/nEYfurVp1i\n— WALTER GILDERSLEEVE (@Walterg817UTube) April 18, 2016\nDETROIT, MI -- On Monday afternoon, children in shorts ran and smiled in the yard across from where 6-month-old Miracle Murray died after being shot in the back Saturday.\nTwo bikes, one gray with training wheels, were propped on the sidewalk near chalk drawings.\nDetroit police believe the shooting is gang-related, possibly retaliation for the Easter morning killing of 3-year-old A'Naiya Montgomery. Three men were indicted on murder charges in that case.\nMultiple parents and grandparents living along Winthrop say they now fear for their own children on the otherwise usually peaceful street in west Detroit.\n\"It's pretty scary,\" said Tonie Perkins, the mother of Darren, 4, and Darelle, 6, who live at the end of the block. \"It's pretty scary.\"\nTonie Perkins, whose mother, 61-year-old Valerie Perkins, also lives in the home, said she heard people shouting in the street followed by gunshots, and soon after heard police and ambulances arriving to the scene.\n\"It has me scared to even let my grandchildren to come out here and play because of what happen down the street,\" said the grandmother.\nSeveral neighbors said they didn't know or often speak the people who lived in the home near the corner of Winthrop and Clarita. Multiple adults and children, it appeared, lived there, but hadn't been seen since the day of the shooting.\nAccording to online records, the house is owned U.S. Department of Housing and Urban Development and listed as \"subject to foreclosure.\"\nSome of the windows had bars. So did the front door. Chalk drawings, doodles and a lopsided green star, were drawn on the exterior on either side of the front door.\nPolice said they arrested two people in connection with the fatal shooting, but no charges had been publicly announced as of Monday afternoon.\nA third person believed to have been in the vehicle that opened fire is still being sought.\n\"It's a quiet spot, nice and peaceful; there's usually a few kids out playing,\" said a neighbor lounging on his porch Monday.\nThe man, who lives a couples houses away the shooting scene, asked that his name not be used.\n\"I heard the gunshots and I came out,\" he said. \"I saw them taking the baby away and taking the guy out ... They had the baby in their arms. They rushed the baby away in the car.\n\"We asked the police and they said the baby was find and then come to find out the baby had died.\"\nDetroit crime statistics identify the area where the shooting occurred as the Greenfield neighborhood, where nearly 12,000 crimes and 35 homicides were logged last year.\nThe area spans from the Lodge Freeway (M 10) west to the Southfield Freeway (M 39); and from Eight Mile south to Seven Mile."}