{"uri": "http://foxsanantonio.com/news/local/7-year-old-flown-to-trauma-center-after-being-shot-in-the-head", "title": "7-year-old girl recovering from surgery after overnight shooting", "dct": "Sun, 02 Oct 2016 00:00:00 GMT", "id": "5c16f0a92a29faa8b053d696e2d30b70", "content": "According to her mother, seven-year-old Mariah Gilkey is recovering from surgery after being shot in the head in Kerrville on Saturday night. (Courtesy: Mariah's GoFundMe page)\nUPDATE on Monday, October 3 at 12 p.m.: Maria Gebara's mother says the 7-year-old girl is awake. Her mother, Isabel, says Mariah continues to recover following a weekend shooting that left her with a gunshot wound to the head. See previous story below...\nSAN ANTONIO – A seven-year-old girl was shot after an alleged dispute in Kerrville Saturday evening.\nThe Kerrville Police Department responded to a shooting that occurred at the intersection of West Schreiner Street and Paschal Street around 9:30 p.m.\nUpon arrival, the victim’s father told police that his seven-year-old daughter Mariah had been shot after he had been arguing with another male just moments before the shooting.\nAfter the argument, other unknown subjects opened fire toward the victim’s vehicle hitting the child. After surgery at University Hospital, Mariah's prognosis looks good as she is in the recovery room.\nMariah was struck in the head and was flown to University Trauma Center in San Antonio in critical condition.\nMariah's mother, Isabel Gebara is happy that she's on the road to reovery.\n“She’s got a lot of personality, she’s really energetic, she’s really loving,” said Gebara.\n“There was two wounds one was an entrance one was an exit,” Gebara. “This is a 7 year old girl who doesn’t deserve this.\"\nShe says the shooter was the same person who shot her husband two years ago.\n“If we would have got justice for this two years ago this would have never happened,” said Gebara.\nIsabel and her husband Michael are just waiting for little Mariah to wake up.\n“I don’t know if she is going to be scared if she’s going to be happy to see me,” said Gebara.\nIsabel has set up this GoFundMe account asking the community for financial support.\n“I do work but I’m going to going on a loan so we are out of town as well just to help out with anything we may need,” said Gebara.\nThe family is also asking for prayers that Mariah wakes up soon.\n“I can’t wait I want to see her I would to see her wake up and give her a big old kiss let her know we are all here for her,” said Gebara.\nThe shooting suspects are still at large and the incident is being investigated by the Kerrville Police Department’s Criminal Investigation Unit.\nKPD is asking the public for assistance in identifying the suspects. Anyone with information on this investigation or knows the identity and location of the suspects are being asked to call C.I.U at 830-257-8181 or Kerr County Crime Stoppers at 830-896-8477."}