{"uri": "http://www.nydailynews.com/new-york/club-shooting-leaves-multiple-people-shot-dead-article-1.2923449", "title": "Mount Vernon nightclub shooting leaves owner dead, five wounded", "dct": "Sun, 25 Dec 2016 13:17:00 GMT", "id": "879e4b40e9e04eb08b44892d7f801e68", "content": "A popular nightclub owner was killed and five other people were wounded in an early morning Christmas shooting outside of a Westchester County dance hall.\nA volley of shots erupted on the sidewalk in front of The Mansion nightclub on North Third Ave. in Mount Vernon just after 4 a.m. Sunday as owner O’Neil Bandoo was booting a group of rowdy revelers from a late night party, police and witnesses said.\nBandoo, 36, was killed in a tight lobby leading into the club from the street, police said.\nOne suspect is in custody following the Yuletide tragedy.\nBandoo’s father-in-law, Patrick Merchant, said a fight inside the club led to the fatal shooting.\n“The guy was getting rough inside of the club, so they let him out,” Merchant, of the Bronx, told the Daily News. “The guy retaliated and came back and just started shooting on them in the front, just shooting on all of them.”\n“This is the worst Christmas ever,” he said.\nMount Vernon police officers, whose headquarters are less than two blocks from the club, heard the shots and ran toward the chaos, Adinaro said.\nSecurity guards at the club helped cops tackle the gunman as he tried to run from the bloody scene.\nThe suspect, Errol Hillary, 39, of the Bronx, was angry after the club tossed him from a party, the Journal News reported. He was free on $200,000 bail after his arrest on attempted murder charges in the Bronx in June, public records show.\nA handgun was recovered near the club and most of the victims were trapped between the gunfire and the hallway leading into the club, Adinaro said.\nThe wounded victims, who were shot in the legs, arms, chest and back, were treated at Westchester Medical Center.\n“I’ve never seen anything like this on Christmas Day,” said police Capt. Edward Adinaro.\nThe man could face murder and five attempted murder charges, police said.\nThe late-night Christmas party was wrapping up when the gunfire pierced the air, witnesses said.\nMansion employee Cleveland Douse heard the shots from the second floor of the venue.\n“I just heard shots fired and I run back upstairs,” Douse said. “When I come downstairs I see three men lying on the floor there.”\n“It’s sad. It’s a terrible thing,” he added. “After the party is said and done, everybody enjoying themselves.”\nMount Vernon Mayor Richard Thomas and Bandoo’s wife, Natasha Tender Bandoo, were outside the club Sunday morning as a crowd of mourners, some donning Santa hats, stood nearby.\n“It’s a dark day in our city,” Thomas said. “Today is a day we're supposed to spend with our family, not extend condolences. No person and no family should ever spend Christmas like this.”\nBandoo left behind two young children, Thomas said.\nNatasha Tender Bandoo’s grandfather, who did not give his name, said the Bandoos were recently involved in a lawsuit with the building’s property owner.\n\"The case finalized early last week,\" the grandfather said. \"The club has done very well. He tried to buy the building from the owner and they didn't want to sell it to him.\"\nThe property price was jacked up to $2 million and that's when the Bandoos went to court to take on the building's owner.\nBut his granddaughter, Natasha, hadn’t mentioned it to him because the case \"was a lot of stress.\"\nThe couple opened the club in 2014.\nAccording to the Mansion Instagram page, the venue, which doubles as a catering hall, hosts birthday parties, baby showers and weddings — as well as alcohol-fueled dance parties.\nBandoo’s relatives were stunned by the holiday violence.\n“He was a loving and devoted husband and one of the best dads to his children, He was a loving Individual with the Biggest heart, Cuz you will definitely be missed” Michelle Bandoo, a cousin, wrote in a touching Facebook post Sunday.\n“My heart is piercing for his poor wife and how she’s gonna explain to my little cuz that Daddy is not coming back.”"}