{"uri": "http://www.lohud.com/story/news/crime/2016/12/25/mount-vernon-shooting/95837746/", "title": "1 dead in Christmas killing at Mount Vernon club", "dct": "Mon, 26 Dec 2016 00:00:00 GMT", "id": "ad42e44bca006f6f5fe82e2c8b228efe", "content": "MOUNT VERNON - The man suspected of opening fire outside a Mount Vernon nightclub Christmas morning, killing an owner and injuring five other people, was freed on $200,000 bond six months ago after being charged with attempted murder in the Bronx.\nSecurity officers were removing Errol Hillary from The Mansion at 4 N. Third Ave. just before 4:30 a.m. when he removed a gun from his waistband and began firing, authorities said. Co-owner O'Neil Bandoo was struck and died at the scene.\n\"He died on the spot,\" witness Cleveland Douse said, referring to Bandoo. \"I just heard shots fired, I heard lots of shots.\"\nHillary, 39, was charged with second-degree murder and is expected to be arraigned in Mount Vernon City Court on Monday.\nUPDATE: Suspect arraigned in Mount Vernon club shooting; candle shrine\nAfter the shooting, he was tackled by security and scuffled to get away before police who were nearby arrived and subdued him.\nAuthorities said Hillary was angry about getting thrown out of the club's late-night Christmas party and it did not appear he was targeting anyone in particular.\nDouse said he was working at the front of the club for most of the night but was on the second floor when he heard the shots fired.\nDouse estimated that there were 200 people in the club at the time of the shooting. According to Douse, Bandoo was on the second floor of the club when he heard gunshots, went downstairs to investigate and was shot in the lobby.\n\"It's a dark day in our city,\" said Mayor Richard Thomas, who went to the scene later in the morning. \"While our police maintain a vigilant presence, this random yet retaliatory act rises to the level of domestic terror. The city will take all necessary steps to review public safety at late-night locations.\"\nThe other victims were transported to area hospitals. None of the injuries appear to be life-threatening.\nThe mayor's office issued a press release at about 5 p.m. reporting that a second victim had died. But law enforcement authorities said later that was not the case.\nThe six victims were found in the lobby and on the street outside the club, police said.\n“I’ve never seen anything like this on Christmas Day,” police Capt. Edward Adinaro said.\nHillary was arrested in mid June and charged with attempted murder for a May 5 altercation in which he allegedly shot a 38-year-old man in the shoulder on Boston Road in the Bronx. He was freed on $200,000 bond and following his indictment in July pleaded not guilty. He made one other court appearance in October and is due back in court in the Bronx on Jan. 4.\nAmong other numerous prior arrests in the Bronx, Hillary had been charged with attempted murder once before and had a 2010 arrest for burglary and assault. The outcomes of those cases were not immediately available Sunday night."}