{"uri": "http://www.rrdailyherald.com/news/rrpd-chief-urges-gun-safety-after-juvenile-shot/article_864f9150-5f0b-11e6-9d56-ab8f14d8147b.html", "title": "RRPD chief urges gun safety after juvenile shot", "dct": "Wed, 10 Aug 2016 00:00:00 GMT", "id": "9ccdd90af8dfef9e788590b2dd30b86e", "content": "Editor’s note: Roanoke Rapids Police Chief Chuck Hasty announced Tuesday afternoon that a juvenile was shot Monday night. The Herald broke the story online. This is an updated story.\nAfter an alleged accidental discharge of a firearm left a minor injured on Monday night in Roanoke Rapids, Police Chief Chuck Hasty said these types of incidents are unfortunate, but preventable.\nRRPD received a call about a juvenile being shot about 11 p.m. Monday in the 1800 block of Roanoke Avenue. Initial witness statements collected by officers said the gun went off unintentionally after it was struck and fell to the floor. Once it hit the floor, the gun fired and a child was shot in the leg, Hasty said, adding the weapon was most likely improperly stored.\nThe child was treated and released from the hospital following the incident, according to a police report.\n“Children can get into a lot of things that you think they can’t. You may think you have it high enough or hidden enough … no matter how small, they can still pull that trigger,” he said.\nRRPD, along with Project Child Safe, recommend storing weapons unloaded in a locked cabinet, safe or storage case. If either or both of those recommendations cannot be followed, Hasty said an alternative is gun locks that render the firearm inoperable unless removed.\nFree gun locks are available at the front desk of the police station, courtesy of Project Child Safe, which is a nationwide program that promotes safe firearms handling and storage practices.\nHasty said proper storage is just part of avoiding a negligent discharge of a firearm.\n“It’s about keeping it in a safe place … you need to treat guns, all guns, like they’re loaded,” he said.\nThe weapon’s muzzle should be pointed in a safe direction at all times and the trigger should remain untouched, Hasty said, unless acquiring a target to shoot and ultimately kill.\nOften, children do not understand the significance of and danger surrounding pistols, rifles and others, he said.\nThe potential of accidents involving young children is high, according to the N.C. Department of Insurance, which estimates 82,000 children in the state live in homes with an unlocked and loaded gun.\nEducation plays a large part in preventing accidents, the police chief noted. He said as soon as a parent thinks a child will understand, they should teach them how to properly handle a firearm in order to avoid a situation like what happened on Monday night.\n“Just teach them. Start them out early. These are dangerous; they will hurt you or somebody else,” he said.\nThe Roanoke Rapids Graded School District runs the Hunter Safety Skills team, which teaches high and middle school students about gun safety and proper handling of a firearm.\nNorth Carolina General Statue 14-315.1 states it is a Class One misdemeanor if a minor gains access to a firearm without their parents’ permission and causes personal injury or death with it not in self-defense."}