{"uri": "http://www.cbs5az.com/story/32370831/2-adults-killed-after-gunman-opens-fire-on-gathering-in-laveen", "title": "2 adults who died in shooting during Laveen gathering identified", "dct": "Tue, 05 Jul 2016 06:02:00 GMT", "id": "b66c7487686fce811e9bf6bbe2ab775a", "content": "MESA, AZ (3TV/CBS 5) -\nThe Maricopa County Sheriff's Office identified the two people killed in a shooting in Laveen late Monday night that also left others hurt, including a 2-year-old child and several teenagers.\nMCSO said Armando Cardona, 45, and Naome Innis, 35, were the victims who died.\nEmergency crews were called out to the Southern Meadows trailer park near Southern and 41st avenues just after 10:30 p.m.\n\"Eight people were in front of the trailer park,\" Sheriff Joe Arpaio said at a news briefing. \"Two adults were killed by a suspect or suspects that walked by and shot a semi-automatic weapon at the group of people.\"\nThe man and woman were identified on Tuesday evening.\n\"We need help from the public to solve this attack,\" Arpaio said.\nPeople with any information are asked to call the sheriff's office at 602-876-1011.\n\"It was difficult for neighbors to pick up on what happened because fireworks were going off. We need help to solve this vicious incident.” Arpaio said.\nA 2-year-old child was shot in the arm and transported to the hospital in stable condition, Subervi said. A 13-year-old and a 15-year-old were shot in the leg. Another juvenile was also wounded. The teens are expected to be OK.\nThe teens' father said they told him it was gang-related, but that has not been confirmed by police.\n“I saw a baby being pulled out and they ran it to the ambulance, all full of blood,\" the man said. \"And then I saw a big, heavy-set guy rolled out at the same time. He was full of blood.”\nAnother person was having trouble breathing and complained of chest pain and was taken to the hospital, too.\nPolice do not have any suspect descriptions but are looking for an older model white Lexus.\nArpaio said his investigators have not yet identified a suspect or suspects.\nAuthorities were stopping every vehicle entering the trailer park and questioning the occupants.\nSheriff Joe Arpaio will hold a media briefing 11am at MCSO Headquarters to give details reference multiple victim shooting from last night.\n— Deputy Enriquez (@DeputyEnriquez) July 5, 2016\nMCSO Homicide Detectives are investigating a shooting 40th Ave Southern multiple victims, Sheriff Arpaio will have update in the morning.\n— Deputy Enriquez (@DeputyEnriquez) July 5, 2016\nPolice are still looking for suspects but say they may have been driving a white older model Lexus. pic.twitter.com/6ngw9IiVT3\n— Marc Liverman (@MarcLiverman) July 5, 2016\n#BREAKING : 2 dead, 4 injured including a 1-year-old after a shooting near 43rd Ave and Southern. pic.twitter.com/fPbDpns9S4\n— Marc Liverman (@MarcLiverman) July 5, 2016\nCopyright 2016 KPHO/KTVK (KPHO Broadcasting Corporation). All rights reserved."}