{"uri": "http://www.santacruzsentinel.com/general-news/20150207/police-5-dead-including-gunman-in-georgia-shooting", "title": "Police: 5 dead, including gunman, in Georgia shooting", "dct": "Sat, 07 Feb 2015 20:08:00 GMT", "id": "cc1a090ab0817e18ed96e5ad9619630a", "content": "DOUGLASVILLE, Ga. (AP) — A man shot six people Saturday afternoon, killing four of them, including his ex-wife and several children before turning the gun on himself on a quiet, suburban street outside Atlanta, police and neighbors said.\nHorrified neighbors called 911 and tended to the severely injured victims as best they could before rescuers arrived.\nThe shooting happened around 3 p.m. in a subdivision about 20 miles west of Atlanta, Douglas County Sheriff's Lt. Glenn Daniel said.\nThe shooter, whose name was not immediately released, appeared to have targeted his ex-wife and her household, including several children who tried to flee, Daniel said. Authorities did not release the names of the victims because they were still trying to contact the next of kin Saturday. Investigators believe the gunman killed himself at the end of the shooting spree.\nAdvertisement\nInvestigators were still trying to determine the shooter's motive and piece together what happened.\n\"I've been in law enforcement out here 20 years and this is the worst I've ever seen,\" Daniel said. He did not know when the couple divorced or if they had prior contact with police.\nTeresa Carter, 59, said she heard the gunfire from inside her home but did not see what happened. Police said victims were shot inside and outside the home.\nCarter said she often saw the children playing in the driveway and around the neighborhood. They enjoyed petting her dog.\n\"I heard shots, and I heard the girl scream,\" Carter said. \"And then I heard four more shots.\"\nBrandon Hallman was working on a car a few houses down when the shooting started.\n\"I heard a couple quick shots, you know, back to back to back. Went out there and, you know, looked and it was already over,\" Hallman said. \"We just grabbed some towels and kind of went down there to try and help before the paramedics got here.\"\nAnother neighbor, Angela Ansah, struggled to explain to her own children what happened to their slain friends a few houses down. Ansah said some of the children targeted Saturday often came over to her house to play with her own children.\n\"These are children I see every day, every blessed day,\" Ansah said.\n___\nAssociated Press photographer David Goldman contributed to this report. Follow Ray Henry on Twitter: http://twitter.com/rhenryAP."}