{"uri": "http://wate.com/2016/08/25/child7-fatally-shot-in-cocke-county-grandfather-dies-in-crash/", "title": "Child, 7, fatally shot in Cocke County; grandfather dies in crash", "dct": "Thu, 25 Aug 2016 12:44:00 GMT", "id": "8f673b6babc4d50cf64947dbb4542c8b", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nNEWPORT (WATE) – A 7-year-old was fatally shot in Cocke County early Thursday morning.\nJayden Norton was shot around 12:48 a.m., according to the Cocke County Sheriff’s Department. Deputies said a handgun was found at the scene.\nThe child’s grandfather, Christopher Allen Russell, 54, died during a car crash shortly after the shooting, according to deputies. The crash involved one vehicle on North Highway 340 in Parrottsville.\nTennessee Highway Patrol is helping the Cocke County Sheriff’s Office with the investigation of the crash.\nThe tragedy is not only hitting the family, but also the entire community.\n“There’s a mom who is hurting. In a short time span, losing your only child and your father,” said Dr. Robert Vick, principal of Parrotsville Elementary School.\nJayden Norton was a second grader at Parrotsville Elementary. He played football for the community’s recreational team. Since Friday, children at his school have been writing cards to show their support for the family.\n“There is no set way on how you handle something as tragic as the loss of a child,” said Dr. Vick.\nA vigil was held for Jayden Norton at Parrotsville football field. More than 100 people showed up.\n“Our thoughts go out to her. I know this community… our thoughts and prayers are with her and her family,” said Dr. Vick.\nFor the latest news, weather and video, download the WATE 6 On Your Side app. The smartphone and tablet apps will keep you updated with Knoxville and East Tennessee news.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}