{"uri": "http://www.oregonlive.com/pacific-northwest-news/index.ssf/2016/09/chilling_details_emerge_in_her.html", "title": "Chilling details emerge in Hermiston shootings that left 3 dead", "dct": "Thu, 08 Sep 2016 14:52:49 GMT", "id": "4051b978f21ccbd8eb66f0061b7af317", "content": "Jason Huston called his mom after killing a teenage boy, a fellow wrestling coach and injuring his ex-girlfriend, Hermiston police say.\nHe also dialed 911 to report a shooting, then turned the gun on himself.\nHermiston Police Chief Jason Edmiston released new details Wednesday of Huston's movements on Aug. 18 and the sequence of events that ended with the deaths of 14-year-old James \"JJ\" Hurtado, 45-year-old Kenneth Valdez and Huston, and left Andria Bye, 35, with serious injuries.\nEdmiston said Huston, 45, had picked the teenager up from a grandparent's house in Umatilla around 10 a.m., drove him to a spot near the Umatilla River and killed him with a single gunshot.\nHe then drove to Valdez's home in Hermiston, kicked in the front door and went into a bedroom where Valdez and Bye had been sleeping. Valdez was shot at least three times, Edmiston said, and Bye was hit once in the back.\nBye was expected to make a full recovery, the East Oregonian reported.\nHuston had been a \"father-like figure\" to Hurtado, the police chief said, and had volunteered alongside Valdez as a high school wrestling coach. Neighbors told KVEW-TV after the shootings that Huston had gotten upset after Bye, whom he'd dated for several years, became romantically involved with Valdez.\nEdmiston said Huston made at least a pair of phone calls after shooting the couple, dialing his mother and 911. He then sat on the bed and shot himself once.\nHuston's mother also called the emergency line, police said, without specifying what she told 911 dispatchers. Police showed up at Valdez's home around 11:20 a.m.\n\"As I have said before, inasmuch as we want to learn the \"Why,\" we may never get to a point where that is known,\" Edmiston said.\nHuston used a Glock 9mm handgun at Valdez's home, Edmiston said. A crime lab analysis will determine whether it also was used to kill Hurtado.\n\"We have no reason to believe otherwise,\" Edmiston said.\nHurtado was a cross-country runner and a wrestler, according to a Hermiston School District spokeswoman. He would have been a freshman this year at Hermiston High School.\nValdez and Huston had served as volunteer coaches since 2013 and 2014, respectively. They men graduated from Hermiston High School in 1989 and wrestled for the school, according to The East Oregonian.\nHuston was arrested in December 2009 on accusations of menacing and unlawful possession of a firearm, according to the East Oregonian. After pleading no contest to the weapons charge, he was sentenced to probation and 20 hours of community service. The menacing charge was dropped.\nInvestigators found \"an incredible amount of pills\" for \"things like depression and anxiety\" at Huston's home, Edmiston said Wednesday.\nThe police chief told the Tri-City Herald that Huston is a veteran. He said U.S. Department of Veterans Affairs practitioners appear to have prescribed the pills and that investigators are trying to get more information about Huston from the VA.\n-- Jim Ryan\njryan@oregonian.com\n503-221-8005; @Jimryan015\nThe Associated Press contributed to this report"}