{"uri": "http://www.eastoregonian.com/eo/local-news/20160818/two-dead-one-injured-in-hermiston-shooting-teen-missing", "title": "Coach, teen dead in Hermiston; woman shot", "dct": "Thu, 18 Aug 2016 11:33:00 GMT", "id": "48218bdb749ccb45d42f3a5efffb73ea", "content": "A man was killed and a woman was shot Thursday in a Hermiston home by a man who then turned the gun on himself. And a teenager related to one of the victims was also found dead Thursday night in a remote, rugged area outside of town.\nKenneth E. Valdez was killed at his home at 130 Northwest 11th Street. A 35-year-old woman, not yet identified by police, was also found at the scene with a gunshot wound and taken to the hospital after giving a “detailed statement” to police.\nJason E. Huston, who volunteered alongside Valdez as an assistant wrestling coach at Hermiston High School, was found dead at the home from an apparent self-inflicted gunshot. Hermiston Police Chief Jason Edmiston said the department is not searching for other suspects.\nPolice searched throughout the day for James “JJ” Hurtado, 14, who police said was “related to one of the parties involved.” Hurtado’s body was found around 8 p.m. in a “remote, rugged area outside of Hermiston,” according to a release from Edmiston. Hurtado was last seen at 10 a.m. when Huston picked him up in Umatilla and said they were going to play disc golf at McNary Park.\nPolice first responded to the house on 11th Street after an 11:18 a.m. report of a shooting. They entered the home and found Valdez and Huston dead and the injured woman in the same bedroom.\nShortly after responding to the crime scene, police also entered Huston’s home on Morgan Lane, north of Hermiston near East Punkin Center. They located his car on Bridge Road and obtained a search warrant for that location as well.\nValdez and Huston were both volunteer wrestling coaches at Hermiston High School. A statement by the school district said it will provide “support for staff, athletes and students during this difficult time” starting at 10 a.m. Friday at the high school.\nHuston, 45, was arrested in 2009 for menacing and unlawful possession of a firearm. The state dropped the menacing charge and he was sentenced to a year of probation and 20 hours of community service after pleading no contest to the gun charge.\nThursday’s shooting was the third in a four-block stretch of Northwest 11th Street in the last two years, although all three shootings appear to be unrelated.\nOn March 4, 2015, Alonso Madrigal, 23, of Umatilla was killed in the parking lot of 11th Street Market and on January 22 of that same year Giovanni Avila, 21, of Umatilla, was injured in a shooting outside Foxwood Apartments. No arrests have been made in either case.\nSponsored\nHomeowners Born Before 1985 Are Getting a Huge Reward\nIf you have not missed a mortgage payment in 3 years you need to see this. Learn More Sponsored by FetchaRate"}