{"uri": "http://www.nbcmiami.com/news/local/1-Dead-3-Injured-in-Pompano-Beach-Armed-Robbery-Attempt-Deputies-214527091.html", "title": "1 Dead, 3 Injured in Pompano Beach Armed Robbery Attempt: Deputies", "dct": "Sun, 07 Jul 2013 16:20:00 GMT", "id": "787a598ff390ede42ac111e5922ad108", "content": "One man died and three others were injured in a Pompano Beach shooting early Sunday morning.\nThe four men were playing dominoes outside a home on the 1600 block of Northwest 7th Lane just before 1 a.m. when a group of men attempted to rob them at gunpoint, according to a Broward Sheriff's Office press release.\n1 Dead, 3 Injured in Pompano Beach Armed Robbery Attempt: Deputies\nBullets flew through an SUV, pierced the domino table and ricocheted off the garage of the home.\nJoshua Childs, 23, was pronounced dead on the scene and the other victims were transported to Broward Health North.\n\"I was spending time with my brother yesterday and to find out he's dead a couple of hours later is heartbreaking, it's hard to take,\" brother James Childs Jr., said.\nOne of the men, 25-year-old Christopher Singleton, survived three gunshot wounds. He said the men ambushed the friends for the wrong reasons.\n\"I guess because they saw no money, they started shooting, but there was no money to give, there was no gambling going on,\" Singleton said. \"I don't see why it's always the good people that have to go.\"\nNeighbors said the shots rang out like firecrackers.\n\"My dogs went crazy and they weren't going crazy when it was Fourth of July, so I knew they weren't fireworks,\" Matthew Moton said.\nWhen Moton realized it was gunfire, he and neighbor Samuel Jennings ran out to help the men.\n\"This was nothing short of a brazen attempt by four people with no regard for human life,\" said Broward Sheriff Fire Rescue spokesman Mike Jachles. \"They opened fire on a group of men playing dominoes, they weren't bothering anybody.\"\nDeputies believe there were four armed suspects who fled the scene. Anyone with information is urged to call Broward CrimeStoppers at 954-493-TIPS(8477).\n\"Josh, he was a nice person, so whoever did this, turn yourself in,\" aunt Belinda Childs said. \"You hurt people that you don't even know, for no reason. Please turn yourself in, it's all we're asking. \"\nStay with NBC6.com and NBC 6 South Florida for updates.\nMore Stories:"}