{"uri": "http://www.semissourian.com/story/2368141.html", "title": "Report: Accidental shooting suspect thought shotgun was BB gun", "dct": "Tue, 13 Dec 2016 00:00:00 GMT", "id": "52d8dcb4f1442057aae74929ef540e15", "content": "A Sikeston, Missouri, man said he was playing around with a gun he thought was a BB gun when he accidentally shot his friend Cole Kirkpatrick, police said.\nScott County sheriff's deputies arrested Sean L. Thomas, 18, on Thursday. The Scott County prosecuting attorney charged Thomas with involuntary manslaughter and armed criminal action. His bond was set at $5,000 cash or surety.\nThomas called 911 after Kirkpatrick, 19 of Vanduser, Missouri, was shot about 5 p.m. Thursday, according to a probable-cause statement filed in the case by Missouri State Highway Patrol Cpl. J.A. Lacey.\nDeputies went to Kirkpatrick's house in the 1000 block of Myers Street and found Kirkpatrick on a bed, dead from a shotgun wound to his head, Lacey wrote.\nA 20-gauge shotgun was found next to the bed, complete with a spent shell casing inside the chamber, according to the statement.\nMajor Case Squad investigators spoke with Thomas' brother and mother, who said Thomas and Kirkpatrick planned to go to a Christmas program that night, Lacey wrote.\nThomas' mother and brother also said Thomas said the shooting was an accident, according to the statement.\nSikeston Department of Public Safety detective John Nelson and Lacey interviewed Thomas. Thomas said he was home on leave from the Army after completing basic training, according to the statement.\nHe went to Kirkpatrick's house Thursday to pick him up but declined to say anything further before asking to speak with an attorney, Lacey wrote.\nKirkpatrick was set to graduate from Scott County Central High School in May, according to principal John-Mark Jones.\nThomas graduated after the 2015-2016 school year, Jones said.\nThe school had a half-day off Friday, and students decorated Kirkpatrick's locker and made T-shirts in his honor, Jones said.\nScott County Central will not have school Tuesday because of Kirkpatrick's visitation and funeral that will take place in the Scott County Central gymnasium, Jones said.\n\"Cole was a good student. It's always tough when you lose a student, especially when you understand it's something that could have been prevented,\" Jones said. \"He'll be missed. He was somebody everybody knew. ... It affects our family big time.\"\nPertinent address: 1000 block of Myers Street, Vanduser, MO"}