{"uri": "http://www.recordonline.com/news/20161101/newburgh-teen-wanted-for-murder-had-warrants-for-gun-drug-possession", "title": "You won't want to miss the story of Dior Johnson", "dct": "Sat, 28 Jan 2017 13:52:00 GMT", "id": "7345ae6ecc7f5d731cb743ff4026bb06", "content": "Saugerties guard Dior Johnson leads the team in scoring at 21.7 points per game. And here's the kicker: He's a seventh-grader who turns 13 on Saturday. Check out Sal Interdonato's story on the remarkably talented Johnson in Sunday's Times Herald-Record and recordonline.com.\nRead more\nRead more\nKnicks' Lee comes up big in win\nNEW YORK - The New York Knicks know there isn't much time left to make a playoff push. There may be less time for Carmelo Anthony and his teammates to convince management to keep them together. Anthony shook off some boos and a rough shooting night to score 18 points, Courtney Lee added 16 against his former team and the Knicks beat the Charlotte Hornets 110-107 on Friday night. Anthony finished 8 for 26 from the field and had just one basket in the fourth, but it was a big one, a jumper with 13 seconds left and the Knicks clinging to a two-point lead...\nRead more\nRead more\nM-W edges Minisink Valley to win 'Brawl for the Belt'\nSLATE HILL - Marco Vespa's teammates lifted him in the air as the Monroe-Woodbury sophomore clutched a metal belt. The inaugural \"Brawl for the Belt\" between Minisink Valley and Monroe-Woodbury fittingly came down to the final bout and the night's most anticipated matchup. Vespa and Minisink Valley's Tyler Lynch continued their rivalry on the mat Friday night. Their fourth match over the last two seasons didn't disappoint. Vespa and Lynch were locked in a 1-1 tie after three periods. Vespa pulled out his third victory over Lynch on a takedown with 25 seconds left in the one-minute, sudden-victory period...\nRead more\nFor the 44th year since the Supreme Court's landmark Roe v. Wade decision, abortion opponents marched in Washington Friday. And people like Bill Banuchi of Newburgh are sensing that, with the election of Donald Trump as president, they might finally see that decision - which made abortion legal in the United States - overturned. \"I'm elated that we have a president who is on the side of life,\" Banuchi said. \"He has a sense of decency.\" And, Banuchi said, \"He's actually doing what he said he was going to do in his campaign...\nRead more\nAlberto Martinez, the National Guardsman from Schaghticoke whose acquittal of murdering two superior officers on an Army base in Iraq outraged the victims' families and spurred them to activism, died Sunday in Florida at 49. An obituary published by a Tallahassee-area funeral home revealed the death of Martinez, who relocated to Crawfordville, Fla. The widows of the slain soldiers also confirmed the death. The cause was not immediately known. Martinez, born in Puerto Rico, graduated from Lansingburgh High School and joined the Troy-based 42nd Infantry Division...\nRead more\nWARWICK - A 126-year-old Rockland County ice cream flavoring business that was working up plans to build a 100,000-square-foot plant at the Warwick Valley Office & Technology Corporate Park won't be coming to Warwick, the company president said Friday. Ben Katzenstein, president of Star Kay White, said he originally thought he could build the Warwick plant for $20 million, but after investing about a quarter-million dollars in engineering studies, he realized it would cost twice that much, and that squelched the project...\nRead more"}