{"uri": "http://www.capitalbay.news/news/630178-logan-hinrichs-14-shot-himself-dead-while-hunting.html", "title": "Logan Hinrichs, 14, 'shot himself dead while hunting'", "dct": "Tue, 16 Dec 2014 19:01:00 GMT", "id": "1eb1b3eebf3ca9f359141162bbab8ba2", "content": "Logan Hinrichs took his life on Saturday and his body was discovered by relatives, authorities said\nBy MailOnline Reporter\nPublished: 15:41 GMT, 16 December 2014 | Updated: 16:01 GMT, 16 December 2014\nView\ncomments\nAn eighth-grade student has shot himself dead in what initially appeared to be a hunting accident, authorities have said.\nFourteen-year-old Logan Hinrichs, from Red Wing, Minnesota, was in Maiden Rock, Wisconsin, which is about 18 miles from his home, when he died from the gunshot wound, authorities said.\nA sheriff's deputy with Pierce County told MailOnline that it was initially believed that Logan had died in a hunting accident but they now believe he took his own life.\nThe teenager was found by relatives, who contacted the department.\nAuthorities said they are not releasing any further information due to the nature of his death and that they are still investigating.\nLoss: 14-year-old Logan Hinrichs, pictured, died from a gunshot wound on Saturday\nStudents at Logan's school, Red Wing High School, learned about the tragedy when Superintendent Karsten Anderson sent out an alert Monday morning.\n'The school district is implementing its crisis management plan to provide as much support as possible during this difficult time,' the message said, the Red Wing Republican Eagle reported.\n'High school students and staff members were notified this morning, and we are providing counselors and other support.'\nA gofundme page has been set up for the Hinrich family to help with the boy's funeral expenses.\nThe page explained that his parents, Luke and Emmy, are on a single income due to health issues. By Tuesday morning, the page had raised nearly $7,000 of their $10,000 goal.\nOn Logan's Facebook page friends paid tribute to the teen.\n'Logan you were a great kid,' one wrote. 'Everyone is gonna miss ya dude.'\nA Memorial service will be held for Logan on Thursday morning at the First Covenant Church before his burial will be at Maiden Rock Cemetery.\nDisclaimer: Opinions expressed here are those of the writers and do not reflect those of Capitalbay. Capitalbay accepts no responsibility legal or otherwise for their accuracy of content. Please report any inappropriate content to us, and we will evaluate it as a matter of priority.\nSponsored Links\n.\nDermal Repair Complex Skincare SupplementWatch: How to Fix Aging SkinDermal Repair Complex Skincare Supplement\nVikings: Free Online GameThis game kills boredom once and for all!Vikings: Free Online Game\nMajortenMelania Trump's IQ Is Pretty UnnervingMajorten\nSovereign Investor SubscriptionWall Street Poster Boy Makes A Big Prediction For 2017Sovereign Investor Subscription\nBeverly Hills MD Skincare SupplementHow To: Remove Dead Skin On Your FaceBeverly Hills MD Skincare Supplement\nMoney MorningNew \"Retirement Law\": Did you win or lose?Money Morning"}