{"uri": "http://www.detroitnews.com/story/news/local/wayne-county/2016/05/25/worthy-charges-child-shootings/84901650/", "title": "Grandparents charged in 5-year-old's shooting death", "dct": "Wed, 25 May 2016 00:00:00 GMT", "id": "de7e73e748be32add6f2e1e746c49bcc", "content": "Wayne County Prosecutor Kym Worthy pleaded Wednesday with gun owners to keep firearms secure and unloaded around children as she announced criminal charges against four adults in two incidents in which youngsters accessed guns and shot themselves.\nWorthy charged the grandparents of 5-year-old Mariah Davis, who shot herself to death May 11 with a gun she found under a pillow in their home, and the great-grandfather and mother of a 4-year-old who shot himself in the hand Nov. 2.\nIn the incident this month, Frederick Davis and Patricia McNeal, both 65 and of Detroit, are to be arraigned Thursday on single counts of charges of involuntary manslaughter and felony firearm and three counts of second-degree child abuse. Davis also is charged with felon in possession of a firearm.\nThe couple were babysitting Mariah when she shot herself in the neck at the couple’s home in the 19700 block of Oakfield.\nWorthy also announced charges against 80-year-old Joseph Williams, whose great-grandson shot himself after finding Williams’ handgun, and the boy’s mother, Andrea Drewery, 30. Both Detroit residents face arraignment Thursday on charges of second-degree child abuse and felony firearm.\nAuthorities allege Williams and Drewery knew the handgun was unsecured in the home and that the child and his younger brother could have access to it.\nWorthy said the shootings of children after finding weapons in their home are “totally ... absolutely preventable.” She called for legislation to add additional criminal penalties to cases where “negligible” gun ownership is at fault in shootings of children.\nWorthy also called for safety classes for people that have guns inside their homes and for meetings with local hospital officials to reach out to pediatricians about possible programs to educate parents about responsible gun ownership.\nThe number of children killed or injured by gunfire locally has steadily increased in the past five months. Worthy said eight children have been shot in the past 17 months as a result of irresponsible gun ownership.\nThe Wayne County Prosecutor’s office has handled close to a dozen cases involving incidents in which children were shot after finding a loaded weapon in a home in the past 11/2 years.\nbwilliams@detroitnews.com\n(313) 222-2027"}