{"uri": "http://koin.com/2016/08/08/deputies-officer-involved-shooting-suspect-takes-hostage/", "title": "Police: Man shot officer, held Subway employee hostage", "dct": "Mon, 08 Aug 2016 19:35:00 GMT", "id": "06c979dce61085720ae0faae25048877", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nGLADSTONE, Ore. (KOIN) — A suspect in an officer-involved shooting barricaded himself inside a Subway restaurant with a hostage Monday night, deputies said.\nOfficers initially tried pulling Jeffrey Carl Giddings, 45, over for a traffic-related violation around 6:20 p.m., police said during a press conference. He fled and was found by another officer a short time later in the Subway parking lot on SE McLoughlin Boulevard.\nGiddings turned and opened fire at Sgt. Lee Jundt several times, police said. Jundt, who took a round in his ballistic vest, is said to be in “excellent” condition.\n“I heard 6 gunshots and I saw a cop in the car shooting,” one witness told KOIN 6 News. “After that he got out and started running.”\nAuthorities said Giddings then went into the Subway restaurant where 2 employees were working. He reportedly barricaded himself inside and took one of them hostage.\n“There were only 2 employees that were inside the restaurant at the time and one employee managed to get out,” Gladstone Police Chief Jeff Jolley said.\nSWAT team members and snipers from multiple agencies were called in. They shot Giddings and were able to go into Subway and take the hostage out to safety.\nThe hostage situation ended shortly after 8 p.m. The woman who was held inside the restaurant was shaken up, but otherwise unharmed, deputies said.\n“The hostage was in fear for her life,” Sgt. Brian Jensen said.\n“The suspect was down. The SWAT team then made entry into the Subway, where they were able to safely secure the hostage,” Jensen said. “She was unharmed, obviously shaken up.”\nGiddings was treated for his non-life-threatening injuries at Emanuel Hospital and was released Tuesday afternoon and taken into custody, officials said.\nOn Tuesday, the Subway location remained a very active crime scene. Piles of shattered glass were visible on the floor and chairs, a roll of sticker tape strewn across the floor, bread left on the counter.\nBill Woolman, who witnessed the incident, said it was a very scary situation.\n“All these cops show up one after another and they’re continuing to show up,” Woolman told KOIN 6 News.\nJeffrey Giddings ‘armed, career criminal’\nJeffrey Giddings has a very long rap sheet that includes local, state and federal charges. Prosecutors call him an “armed, career criminal.”\nGiddings had an active warrant for his arrest out of Klamath County for possession of heroin at the time police attempted to stop him for a traffic violation, according to police.\nA criminal background check shows that prosecutors in Klamath County have filed nearly 30 separate cases against Giddings between 1994 and 2012.\nA very brief overview finds:\nHe was indicted by a federal grand jury in February 2012 on one count of unlawful transportation of firearms. Two months later he took a plea deal to being a felon with a firearm, and was sentenced in June 2012 to 15 years in prison, with a scheduled release date of June 29, 2025.\nBut he appealed being sentenced as an “armed career criminal” and in February 2016, a panel of federal judges ruled Giddings was “not subject to the ACCA mandatory minimum sentence.” He was ordered to be resentenced.\nIn May 2016, the US Attorney’s Office wanted a 63-month sentence imposed for the April 2012 deal, and ultimately he was given 57-months with 3 years of supervised release.\nKOIN 6 News reporters Andrew Dymburt, Brent Weisberg and Tim Becker contributed to this report.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}