{"uri": "http://www.oregonlive.com/clackamascounty/index.ssf/2016/10/man_accused_of_shooting_cop_ta_2.html", "title": "Man accused of shooting cop, taking hostage, got high during police standoff, documents say", "dct": "Tue, 04 Oct 2016 12:35:43 GMT", "id": "54cf5c06d51a2c486b6b5cb8996a7be5", "content": "A convicted felon accused of shooting a Gladstone police sergeant and holding an employee hostage inside a Subway in August fired more than a dozen times at authorities and took drugs during the nearly two-hour standoff, court documents say.\nAs he holed up in the sandwich shop, he forced his way into a back room where two employees were hiding, allowed one to go but kept the other at gunpoint, saying she would be his \"insurance.\"\nJeffrey Giddings, 45, remains at the Clackamas County Jail on allegations of attempted murder, attempted first-degree assault, first-degree kidnapping, unlawful possession of methamphetamine and several other charges.\nGiddings has about two-dozen criminal convictions dating to 1991, court records show, including robbery, identity theft and drug and gun possession. He was sentenced to a 15-year federal prison term in June 2014 as a felon in possession of a firearm and a career criminal. He later won an appeal of the career criminal designation and was resentenced in May to four years and nine months.\nAccording to a search warrant affidavit, Giddings arrived at the Northwest Regional Re-entry Center, a halfway house in Northeast Portland, on July 22 and was allowed to go out on his own five days later for appointments. He returned 30 minutes late Aug. 2 and tested positive for methamphetamine after a urine test.\nGiddings walked out the front door a few hours later on the same day and didn't return, the court papers said.\nGladstone Police Officer Mark Herkamp reported trying to stop Giddings on Aug. 8 for failing to use a bike lane as he was riding a bike against oncoming traffic along Southeast McLoughlin Boulevard. Giddings rode away, the affidavit said.\nGladstone Police Sgt. Lee Jundt told investigators that he saw Giddings near the intersection of Southeast Gloucester Street and McLoughlin Boulevard, hit his patrol car's emergency lights, did a U-turn and pulled into a parking lot near the Subway at the intersection.\nJundt heard something hitting his patrol car after pulling into the lot and knew Giddings was shooting at him, the affidavit said. As he leaned forward to draw his gun, Giddings continued to fire, shattering the driver's side window.\n\"Sergeant Jundt said he felt an intense heat on his left upper arm,\" the affidavit said, \"he knew he had been shot.\"\nJundt drove his car away from Gidding's line of fire and was soon joined by Clackamas County deputies, who trained their guns toward the Subway.\nJundt was treated at the scene, wasn't seriously injured and wasn't taken to a hospital, the Clackamas County Sheriff's Office said at the time. The Gladstone Police Department didn't immediately respond to a request for comment Monday if Jundt has returned to active duty.\nGiddings shot at deputies, the affidavit said. Clackamas County Deputy Ben Frazier said Giddings at one point aimed his gun at him.\nGiddings ran into the Subway. The two employees inside at the time, Danielle Starkey and Elizabeth Mincer, locked themselves in a back office and called 911, the affidavit said.\nGiddings tried to force his way in the office and the women pushed against the door. He put the gun between the door and the frame, overpowered them and got into the office, the affidavit said. Starkey said she was able to talk Giddings into letting her leave the business, but he said one of them had to stay \"as insurance because the police wanted to kill him.\"\nMincer said Giddings held her hostage for an hour and used drugs. He allowed her to use the restroom, but guarded the door. At that point, SWAT officers got Giddings in their sights and shot him in the left hand and right chest, the affidavit said. Mincer was able to get away.\nNeither Subway employee was injured.\nInvestigators found 15 bullet casings outside the Subway entrance and a .40-caliber Smith & Wesson M&P pistol on the floor inside the business. They found syringes and other drug paraphernalia in the food prep area.\nGiddings was taken to Williamette Falls Hospital for treatment and later transferred to Legacy Emanuel Medical Center. An investigator noted that he appeared to be twitching while restrained and lying in a hospital bed. He requested a lawyer when detectives tried to speak to him and wasn't questioned further.\n-- Everton Bailey Jr.\nebailey@oregonian.com\n503-221-8343; @EvertonBailey"}