{"uri": "http://www.mlive.com/news/grand-rapids/index.ssf/2013/03/whos_to_blame_for_new_roosevel.html", "title": "Grand Rapids bar may lose liquor license after shootings that left 1 dead, 4 hurt", "dct": "Sun, 10 Mar 2013 08:30:00 GMT", "id": "97ee4a8291945b4c7f2ec17e311cc142", "content": "GRAND RAPIDS, MI -- Police at a hearing this week will try to make a case that recent violence at New Roosevelt Bar stems from poor management.\nThe Grand Rapids City Commission at 1 p.m. Tuesday, March 12, will be asked to recommend non-renewal of the Class C liquor license for the bar where a man was killed last year and where four people were shot last month. The recommendation would go to the Michigan Liquor Control Commission.\n“After the most recent shooting, the community really stepped up what their concerns were,” said Lt. Richard Nawrocki, who commands the police departments vice unit. “Based upon the immediate community’s concerns, we believe it fits the criteria for the City Commission’s review for non-renewal.\n“We’re going to have to prove that the activities have some correlation to the bar here, and that’s what we will try to show.”\nRELATED: Grand Rapids police want to revoke liquor license for New Roosevelt Bar, where 4 were shot last month\nPolice say they have had to respond to incidents at 1447 Grandville Ave. SW more often since the bar got its liquor license in March 2012. The license should not be renewed because the bar has disturbed peace and order in the neighborhood and housed illegal drugs, according to a city memo.\nThe memo shows that many incidents involving police response occurred outside the bar. Bar owner Rosalia Rivera said through an interpreter that closing the bar will not end violence in the neighborhood.\n“We can’t be responsible for what happens outside, even if it’s the parking lot,” she said. “It’s unfair because the city is after us, but not after the real criminals. We want crime to stop in the Southwest Side, and I hope that once we close the violence will stop, but they haven’t arrested people in connection to any of the shootings.\n“They are cutting the tree, but not the root (of the problem).”\nRELATED: Closing New Roosevelt Bar won't eliminate police calls to the area\nJulie Niemchick, director of the Roosevelt Park Neighborhood Association, said she sympathizes with Rivera. Still, the neighborhood is tired of the violence and wants the bar to close, she said.\n“We can’t keep affording to have someone injured or murdered in our neighborhood,” Niemchick said. “We just can’t have that. We can’t tolerate it.\n“It’s the element that keeps showing up at their door that is the problem. If the bar isn’t open, then obviously there won’t be any violence there.”\nMLive reporter Sandra Chang contributed to this report."}