{"uri": "http://www.mlive.com/news/grand-rapids/index.ssf/2014/12/grand_rapids_man_guilty_of_att.html", "title": "Grand Rapids man guilty of attempted murder for shooting outside New Roosevelt Bar", "dct": "Thu, 11 Dec 2014 16:11:00 GMT", "id": "c9442a40a7bafc08131317604ec408ee", "content": "GRAND RAPIDS, MI – In what was likely the last shooting near the New Roosevelt Bar, a 28-year-old man is looking at decades in prison after he was convicted of shooting five people outside the now-closed tavern in February 2013.\nA Kent County Circuit Court jury found Marcus Antoine Smith guilty of attempted murder and four counts of assault with intent to go great bodily harm onThursday, Dec. 11, after a three-day trial.\nThe shootings took place outside the former bar at 1447 Grandville Ave. SW in just after 2 a.m. on Feb. 22, 2013.\nA security guard who was shot and other witnesses told the jury that Smith fired shots at a group of people gathered outside the back door of the bar.\nEric Jones testified that Smith looked right at him as he fired the shots that ended up forcing the security guard to undergo numerous surgeries and use a brace in order to walk.\nJones is the victim in the attempted murder charge. The other victims suffered injuries that were not life-threatening.\nRelated: Grand Rapids police identify suspect in shooting outside New Roosevelt bar\nThe bar earned its reputation over the years as a regular destination for police investigating illegal acts including the fatal shooting of 27-year-old Wellington Guevera in November 2012. No one has been arrested in that homicide.\nThe bar shut down in March of 2013, one month after Smith’s crime.\nSmith was on the run for nearly a year before he was finally arrested in Grand Rapids.\nSmith turned down a plea offer from the Kent County Prosecutor’s Office that would have dismissed two of the assault with intent to do great bodily harm less than murder charges. It also would not have called for Smith to be sentenced as a repeat offender.\nSmith has a massive criminal record that includes numerous minor drug offenses, lying to police and driving infractions. He was in jail a week before the shooting occurred on charges of use of marijuana and lying to police in Wyoming, according to Kent County Jail records.\nAs a result of his record, Smith faces a minimum sentence of 19 to 47 years and a maximum of life in prison when he is sentenced before Kent County Circuit Court Judge Dennis Leiber on Jan. 28.\nSmith seemed unaffected by the jury’s decision Thursday as he was taken from the courtroom to the Kent County Jail, where he will await sentencing.\nE-mail Barton Deiters: bdeiters@mlive.com and follow him on Twitter at twitter.com/GRPBarton or Facebook at facebook.com/bartondeiters.5"}