{"uri": "http://www.tulsaworld.com/news/two-jailed-in-tulsa-hmong-shooting/article_865e04e9-1b34-5cc3-b09e-65e59c9f7ff9.html", "title": "Two jailed in Tulsa Hmong shooting", "dct": "Mon, 14 Oct 2013 00:00:00 GMT", "id": "f638af2e547391fcf2a32bac2ba1d89c", "content": "Boonmlee Lee (left) and Meng Lee: They are suspected in the shooting Saturday at a Hmong celebration.\nHmong leaders urged their community, and the Tulsa community as a whole, to \"not be panicked\" following a shooting that wounded five people at a clan New Year's celebration.\nStephen Vang, public liaison with the Hmong American Association of Oklahoma, said three of the victims of Saturday's shooting at the Xiong clan New Year's celebration at the Green Country Event Center had been released from the hospital Sunday. The other two victims, one shot in the torso and one shot in the leg, remained hospitalized. None of the shooting victims' identities have been released.\nA sixth person, 75-year-old Nhia Vang, reported that a bullet passed through his shirt, but he was not struck, Stephen Vang said.\nTwo Hmong men, Boonmlee Lee, 21, and Meng Lee, 19, were arrested at 10:59 p.m. Saturday, about three hours after the shooting. They were jailed early Sunday on five counts of each of shooting with intent to kill and possession of a firearm during commission of a felony. Boonmlee Lee, held on $390,000 bond, has an additional count of possession of a firearm. Meng Lee is jailed on $385,000 bond.\nAbout 40 to 50 Hmong community leaders met Sunday to discuss \"what happened and how to prevent it from happening again,\" Vang said.\n\"At first the community was shocked and in disbelief that this happened in an open, public gathering,\" Vang said. \"We ask that the Hmong community and the mainstream community not be panicked. Our community leaders will work hard to contain the violence, and the police and the authorities are working on their side.\"\nVang said elected clan leaders, who serve as wise men and solve family and social conflicts, will speak to the families involved in the shooting. Clan leaders are typically chosen every two to four years, Vang said.\n\"The consensus idea is to have a clan leader go back to the family and calm them down,\" Vang said. \"And to tell them that the people who were involved will be taken care of by authorities.\"\nPolice called the shooting a \"grudge\" Saturday, and Vang stressed that he did not believe the incident was gang-related, but a disagreement between two families that spilled over into violence.\nSaturday's New Year's festivities were hosted by the Xiong clan, Vang said, one of 12 or 13 Hmong clans represented in the Tulsa area. Each clan, as well as the Hmong Association, hosts an individual New Year's event for the entire Hmong community every Saturday leading up to the Hmong Traditional New Year in mid-November. The Lee clan event is set for this Saturday.\nAccording to arrest reports, Tulsa police stopped a suspicious vehicle in which Meng Lee was the driver and Boonmlee Lee was a passenger a few blocks away from the event center. Officers in the Tulsa police helicopter detected a heat signature from a handgun that had apparently been thrown into the grass near the vehicle, the report said.\nThe vehicle was described by witnesses as leaving the scene moments after the shooting, according to the reports.\nWhen asked if it was possible there could have been more than two shooters Saturday, Tulsa Police Sgt. Dave Walker would only say the investigation was \"ongoing.\"\nLeonard Busch, pastor of Good Shepherd Lutheran Church, which has a Hmong congregation of 50 to 60 people, said there may be as many as 5,000 Hmong in Tulsa.\n\"The Census for 2010 showed 3,000 Hmong in the state of Oklahoma,\" Busch said. \"But realistically there are probably about 5,000 just in the Tulsa area. I would imagine that happened because many Hmong didn't identify themselves as 'Asian' or as 'Hmong' in the Census.\"\nMost live in the Tulsa area, but some have spread out into smaller areas such as Tahlequah, Sallisaw and Inola, Vang said.\nBusch said many of the Hmong who attended Sunday's service were shocked by Saturday's shooting. He was told by church members that the two targets of the shooting were members of the Lee clan, which would seem to dispel the \"gang shooting\" rumor some had heard, since the two alleged shooters were also members of the Lee clan.\nHowever, Busch said, gang membership is a problem in the Hmong community, particularly in California and in portions of the upper Midwest, where many Hmong had emigrated.\n\"I think the Hmong community has been pretty good at heading that off here in Tulsa,\" Busch said. \"I think they have worked hard and have been very effective compared to elsewhere.\"\nHowever, alleged gang affiliation among Hmong has shown up in Tulsa. Court documents state that Bee Vue, charged with manslaughter in the shooting death of Jone Vang, 21, in August, told police he and Vang were in rival gangs, and that Vang was \"his enemy from California.\" Fue Xiong, 22, is referred to in court documents as Vue's cousin, and was charged with assault and battery with a deadly weapon for allegedly beating a man with a gun during the fight that led to Jone Vang's death. Xiong told police he then transported Vue to the hospital. At the time, police said they believed the shooting had been between two rival Asian gangs."}