{"uri": "http://www.baltimoresun.com/news/maryland/crime/bs-md-co-courtney-charges-20160805-story.html", "title": "Korryn Gaines' boyfriend facing charges after gun, heroin found in apartment, police say", "dct": "Fri, 05 Aug 2016 22:25:00 GMT", "id": "24dc81c67b256dcf8261a1e564ecb672", "content": "The boyfriend of Korryn Gaines, the woman who Baltimore County Police fatally shot in her Randallstown apartment earlier this week, is now facing gun and drug charges stemming from a police search of the apartment after the shooting.\nKareem Kiean Courtney, 39, who lived in the apartment with Gaines and was present when police first arrived to arrest them on warrants on Monday, was charged with nine criminal counts on Friday, police confirmed to The Baltimore Sun. The charges include drug possession and distribution of heroin, possession of drug paraphernalia, operating the apartment as a \"common nuisance\" for the illegal distribution of drugs, and at least five charges related to a 12-gauge shotgun and ammunition found in the apartment.\nPolice obtained a warrant to search the apartment hours after a tactical officer fatally shot Gaines at the location, police said. Inside, they found the shotgun, ammunition scattered around, and three bags containing 75 capsules of a substance that a forensic analysis determined was heroin, police said.\nIn total, there were 26.7 grams of the drug recovered, police said.\nThe gun that Courtney is charged with possessing is the same one Gaines allegedly used in an exchange of gunfire with police, in which she was killed and her son was wounded by police fire.\nCourtney is being held without bail.\nCourtney was convicted of attempted murder in Baltimore City in 1996, and sentenced to eight years in prison. That conviction made it illegal for him to possess or have access to a firearm in the state.\nPolice first went to the Carriage Hill Apartments on Sulky Court about 9:10 a.m. Monday to arrest the couple on outstanding warrants.\nGaines, 23, was wanted for failing to appear in court on a March traffic violation and other misdemeanor charges, police said. Courtney was wanted for second-degree assault in connection with an alleged altercation with Gaines on June 28.\nAccording to police and court records, two officers knocked on the door of the apartment for 10 minutes, but no one answered. Hearing people inside, including a small child crying, officers went to the apartment building's rental office and obtained a key to the apartment.\nOfficers then unlocked the door with the key but were still unable to enter because of an interior chain lock. One officer then \"kicked the door forcing the door open\" and another entered the apartment, according to court records.\nPolice said Gaines pointed a shotgun at the officer and ordered the police to leave. They did leave the apartment, but remained outside — calling for backup and beginning the process of securing a new warrant for Gaines' arrest on first- and second-degree assault, obstructing and hindering, and resisting or interfering with arrest.\nWhat followed was an hours-long standoff, some of which was captured in videos Gaines posted to her social media accounts.\nNot long into the barricade situation, Courtney ran out of the apartment with a 1-year-old in his arms, police said. He was arrested, but released on his own recognizance. Family members said he was also involved in trying to coax Gaines out the apartment, to no avail.\nAt some point, according to police, Gaines pointed the gun at officers and threatened to kill them. An officer then fired one shot at Gaines and missed, prompting Gaines to fire back twice, also missing, police said. Police then shot three more times, killing Gaines, police said.\nHer son Kodi was also wounded in the police gunfire, police said Friday.\nPolice Chief James Johnson has defended the department's actions. He said the officers spent hours pleading with Gaines to surrender peacefully.\ntwitter.com/rectorsun"}