{"uri": "http://www.wptv.com/news/region-c-palm-beach-county/west-palm-beach/more-than-1-victim-in-west-palm-beach-shooting", "title": "2 dead, 2 teens injured in West Palm shooting", "dct": "Wed, 26 Aug 2015 14:25:00 GMT", "id": "8c4e084b197560b42b66de0be6811de8", "content": "Autoplay:X2 dead after 4 shot in West Palm Beach\nWEST PALM BEACH, Fla. - West Palm Beach police have identified one of the two people who died in a shooting Wednesday afternoon.\nPolice said Johnny Davis, 19, was one of the young men gunned down in the 800 block of 19th St. Another young man under 18-years-old also died after the shooting.\nTwo others who were shot were taken to St. Mary's Medical Center and are expected to be OK.\nDavis was one of the teens who attended a community meeting hosted by City Commissioners Keith James and Corey Neering two weeks ago. The teen talked to the commissioners about how to stop gun violence in the city.\n\"That man was full of potential. When I think of myself at that age, I think of Johnny and now he’s dead,\" said Ricky Aiken who was a mentor to Johnny.\nAiken says Johnny was a part of his Inner City Innovators group which mentors children and young teens in the Tamarind community.\n\"He was just with us last week. He's not even involved with the system of violence. He's another me, one foot in, one foot out, he's trying to find himself in this community and the fact that he can be gunned down like this is terrible. It doesn't make any sense to me,\" added Aiken.\nAiken said he heard that the victims were just walking down the street and may have been shot in a drive-by shooting. Police have not confirmed that information. They have not released any suspect information.\n\"We can’t continue to sit around hoping things will get better. It’s going to take people from the community standing up and saying enough is enough,\" said Aiken.\nUpdated to clarify that the original story which mentioned two other people fleeing from the scene as a result of drug activity was reported in error."}