{"uri": "http://www.santacruzsentinel.com/copsandcourts/ci_26709559/man-4-year-old-girl-killed-watsonville-shooting", "title": "Watsonville police: Double homicide likely gang related", "dct": "Sat, 11 Oct 2014 07:01:00 GMT", "id": "44f4f64ab921f1a20cb3b44afd34da26", "content": "WATSONVILLE >> Watsonville Police Chief Manny Solano said Friday night's double homicide, which included a 4-year-old girl, was the worst case he could remember in years.\n\"It's never easy,\" Solano said Saturday. \"No murder is. But this one especially is extremely, extremely difficult.\"\nA confrontation that ended in a shooting outside the Fish House Bar and Grill at 972 Main St. left the girl and a 34-year-old Watsonville man dead. The deaths marked the fourth and fifth homicides for the year in Watsonville and brings the total to seven in Santa Cruz County.\nAbout 11:55 p.m. Friday, Watsonville police received multiple calls from the restaurant and a nearby hotel about the confrontation, Solano said. As officers arrived, they heard multiple gunshots.\nSolano described the scene as chaotic, with several people running away. Amid the scene, officers found three shooting victims.\nThe 34-year-old victim was found with multiple gunshot wounds in the parking lot shared by the restaurant and hotel, just outside an office in the back of the restaurant. Officers and others carried the man from the parking lot to a nearby ambulance but the victim died at the scene, Solano said.\nInvestigators said they believe the 34-year-old was the target of the shooting.\nThe two other victims \"appear to have been caught in the crossfire\" when they were shot while inside the office, Solano said. The 4-year-old girl, was rushed to Watsonville Community Hospital but was pronounced dead on arrival.\nThe third victim, a 26-year-old Watsonville man, suffered a nonlife-threatening gunshot wound to his upper body.\n\"When the 34-year-old we believe was the intended target was shot, the overspray struck the window of the restaurant office and those bullets we believe went to strike the 4-year-old and 26-year-old next to her,\" Solano said.\nSolano said there was a short distance between where the 34-year-old man was shot and the office.\nThe girl was a member of the family who owns the restaurant and the 26-year-old man, who is not related to the girl, worked at the restaurant.\nThere is no familial relation between any of the shooting victims, Solano said.\nMoments after the shooting, a Watsonville sergeant arrived on scene. He saw two men running away and started to chase them on foot, Solano said.\nEventually, the sergeant caught up with 31-year-old Michael Escobar and, after a scuffle, arrested him.\nOfficers found a gun on Escobar that they believe he used in the shooting. Escobar was arrested on suspicion of the two murders and gang crimes. He was booked into Santa Cruz County Jail, though his bail was not available.\nSolano said there is a strong likelihood there are other suspects, though he could not comment further.\n\"It's really key that not only do we want to arrest those responsible, but we also want to point out our very important prevention programs we have that try to prevent this type of tragedy,\" he said.\nChief Deputy District Attorney Jeff Rosell, speaking at the news conference late Saturday afternoon, said formal charges are expected to be filed against Escobar on Tuesday.\nA 20-year-old man originally thought to be involved in the shooting, and arrested on suspicion of murder, was released after investigation showed he was not directly involved, Rosell said.\nAt the same media briefing, Watsonville Mayor Karina Cervantez expressed the city's condolences.\n\"On behalf of the city and community at large, I want to offer our deepest condolences to the families of the victims,\" she said. \"Our hearts are heavy and broken also knowing that among the victims was a 4-year-old girl.\"\nA vigil, organized by the Peace and Unity Coalition, was held at Watsonville Plaza on Saturday night to remember the victims. Cervantez said a community forum was scheduled at 6 p.m. Wednesday at E.A. Hall Middle School to talk about how the community could deal with the tragedy.\nAt the restaurant Saturday morning, crime scene investigators blocked off the parking lot shared by the hotel and the restaurant as they collected evidence. The restaurant, which advertised Saturday brunch, was closed with chairs on the patio stacked up against a railing. About 100 yards away, an officer guarded a smaller crime scene on the bike path on Main Street.\nOfficers said the site was where the 34-year-old victim was eventually carried when medical personnel treated him.\nBecause the restaurant was open at the time of the shooting, police have found several witnesses. Watsonville police ask anyone with information to call investigations at 831-768-3352 or leave an anonymous tip on the tipline at 831-728-3544 or by texting WATSPD to 888777.\nAdvertisement"}