{"uri": "http://www.dispatch.com/content/stories/local/2015/11/24/Hilltop-shooting-witness.html", "title": "Family, neighbors wait for answers after Hilltop fatal shootings", "dct": "NODATE", "id": "8257671e28eb17a29dbca623a8ee5cc7", "content": "Christina Chaffin Anderson was frantic during the 911 phone call. A neighbor had shot her husband, and was still in their Hilltop home, she told a dispatcher. \"Please come,\" she cried. \"Come now!\" In the call from early Monday evening, the dispatcher assured her that help was on the way, then said he needed a description of the gunman. \"It's Barry Kirk,\" Anderson said. But she soon stopped talking to the dispatcher. In the background there are screams and someone yelling, \"Barry, please! Please!\" There are more gunshots and more screams, then silence on her end of the line.\nChristina Chaffin Anderson was frantic during the 911 phone call. A neighbor had shot her husband, and was still in their Hilltop home, she told a dispatcher.\n\"Please come,\" she cried. \"Come now!\"\nIn the call from early Monday evening, the dispatcher assured her that help was on the way, then said he needed a description of the gunman.\n\"It's Barry Kirk,\" Anderson said.\nBut she soon stopped talking to the dispatcher. In the background there are screams and someone yelling, \"Barry, please! Please!\" There are more gunshots and more screams, then silence on her end of the line.\n\"Hello? Hello?\" the dispatcher asks. But there's no response.\nVideo: Police, friend describe shootings\nColumbus police officers soon arrived and found John E. Anderson II, 31, Christina Chaffin Anderson, 30, and their 7-year-old son, Landon Anderson, shot to death inside their home at S. Terrace Avenue. Their daughter, Makyleigh Anderson, 12, was in Nationwide Children's Hospital on Tuesday evening, still recovering from gunshot wounds.\nShow more...\nOfficers arriving at the scene confronted Kirk as he ran from the home, shooting him. He died a short time later at Mount Carmel West hospital.\nPolice said they didn't know why Kirk, who lived across the street from the Andersons, shot the family members. Detectives expected to work late into Tuesday night gathering evidence and conducting more interviews.\n\"The guy went across the street and just snapped,\" Alphonso Carreker said. He lives two houses from Kirk and had heard the gunshots when he stepped out on his front porch for a smoke.\n\"It was like, bam, bam bam. Bam, bam, bam. Bam, bam, bam,\" Carreker said. \"It was like 15 or 20 shots.\"\nOfficers arrived in time to confront Kirk running across Terrace toward his own house.\n\"He was running with his hands up,\" Carreker said, but ignoring police commands to stop. He said Kirk yelled, \"It wasn't me, it wasn't me.\"\nA couple of steps from his own stoop, Kirk turned to face the officers, backpedaled and reached for his waist, Carreker said. After he was shot by police, a handgun was found next to him, police said.\n\"I guess they had to do what they had to do,\" Carreker said of officers who opened fire.\nPolice said three officers fired at Kirk, 50, who was struck multiple times. None of the officers was wounded. They were identified as Eric Clouse, a 12-year member of the Police Division; Lincoln Green, who has been with the Division four years; and Jack Snyder, who has been an officer for three years.\nOfficers were patrolling the Hilltop and had heard the gunshots. They began to track down the shooting suspect at the same time the 911 call came in.\nMoments after Kirk was shot, Makyleigh Anderson came out from the side of the house, Carreker said.\n\"She had blood all over her,\" he said. \"Her hands were cherry red.\"\nA second 911 call was made by a family friend who was staying in the basement of the Andersons' house.\n\"He was terrified,\" Jason Lozier, Mr. Anderson's brother, said of the man, whom he identified only as \"Dale.\"\nCarreker said Kirk never spoke ill of Anderson and his family. \"He even told me they were friends,\" he said.\nCarreker and Lozier stood outside near the scene on Tuesday morning. Lozier had been in the house on Monday after his brother had been shot and saw his brother lying on the kitchen floor.\nLozier said he had called him about a half-hour before the shootings.\n\"I needed to borrow his truck to haul some furniture,\" he said. His brother had given him no indication that anything was wrong.\nHe said his brother had a gun and a permit, but police said there was no evidence that Anderson had fired a weapon.\nLozier said he knew that Kirk had lost his job and that his wife had left him. Franklin County court records show the Kirks had been hit with a foreclosure action on their S. Terrace Avenue home last year. It was unclear whether they faced the loss of the home.\nJohn and Christina had dated for 13 years before marrying late last year, Lozier said. \"He was a good father,\" he said of his brother, who worked for a stucco company.\nLandon Anderson was a second-grader at Burroughs Elementary.\nMakyleigh went to Burroughs last year for fifth grade, but transferred to a charter school this year. Counselors were available for students at Burroughs.\nA Pinterest page attributed to Makyleigh includes boards devoted to clothes, shoes, hairstyles, wedding dresses and Duck Dynasty.\nAsked what would happen to his niece, Lozier said, \"She'll be taken care of. She's got grandparents, and uncles.\"\nDispatch Reporter Mary Mogan Edwards contributed to this story."}