{"uri": "http://www.deseretnews.com/article/865637162/Salt-Lake-homeowner-arrested-in-triple-homicide.html", "title": "Homeowner killed man, woman and her baby granddaughter, police say", "dct": "Sat, 19 Sep 2015 12:30:00 GMT", "id": "423f4c027c4d5be4625e73512b6f1c08", "content": "SALT LAKE CITY — Close friends held a candlelight vigil Saturday night for a woman and her 2-month-old baby granddaughter who were both shot to death in their Salt Lake home Friday.\nA third person, a 28-year-old man, was also killed in the melee. The three victims were identified as Heike Poike, 50, Lyrik Poike, age 2 months, and Dakota Smith, 28. Police said they unsure about Smith's relationship with the other victims.\n\"We're looking into his connection into either the family or the suspect at this point,\" Salt Lake police detective Richard Chipping said Saturday.\n\"Nobody's perfect, but she was perfect,\" Camille Speaker said of baby Lyrik. She described herself as a close friend of Poike and said she helped her baby-sit.\n\"She didn’t do anything to anyone. She didn’t ask to be brought into this world, to be taken out like that. It’s not fair. It’s not.\"\nPolice say the homeowner, who lives in a basement apartment of the house, is the gunman who murdered all three. Alexander Hung Tran, 32, was booked into the Salt Lake County Jail for investigation of three counts of aggravated murder.\nPolice discovered the trio of victims about 5 p.m. Friday inside a home at 639 N. Sir Phillip Drive (1990 West) while looking for the family of an 8-year-old boy who had not been picked up from Escalante Elementary School that afternoon.\nSchool officials tried contacting multiple family members before calling police and informing them the boy's family was unreachable. The boy said his grandmother was supposed to pick him up from school.\nAs a police officer checked the boy's home, the officer looked through a window and spotted what looked like a body underneath a tarp, Chipping said. Officers then discovered that the back door was wide open.\n\"They went into the house and were calling out to anyone inside and they found a male with a gun, so they took him into custody and then searched the house and found three bodies inside,\" he said.\nThe woman was the 8-year-old's grandmother and the baby his younger sister.\nSeveral dozen gathered for the candlelight vigil Saturday night. Those who attended were quiet and somber. They left stuffed animals and candles on the home's front steps next to pictures of the grandmother and the baby.\nConsuelo Garcia said the baby's mother, Poike's daughter Ashley Poike, was unable to attend the vigil because she was booked into the Salt Lake County Jail last month.\nGarcia said she grew up with Ashley Poike and considers her a sister.\n\"Lyrik was pretty much my niece,\" Garcia said. \"Ashley needs to know that she has family and friends out here to support her, and even though she's not here right now, we all are.\"\nGarcia said Heike Poike was like a mother to her.\n\"She was kind and thoughtful. If you needed someone to talk to, she was there,\" she said. \"Ashley needed her and she was more than happy to jump up and take care of the baby for her.\"\nAbove all, Garcia said she hopes justice will be served.\n\"Nobody deserves to die like this,\" she said.\nDetectives interviewed Tran and \"determined that he shot and killed all three individuals,\" Chipping said. All three suffered gunshot wounds. Police have not indicated any kind of motive for the slayings.\nNeighbors said the man was wearing only a sweatshirt and boxer shorts when he was arrested Friday. One neighbor said Tran drove a car into his mailbox three weeks ago.\nOn Aug. 29, Tran was charged in Salt Lake City Justice Court with reckless driving and an insurance violation, both class B misdemeanors, stemming from an unspecified Aug. 27 incident. A warrant was issued for his arrest when he failed to appear in court on Sept. 10, according to court records."}