{"uri": "http://www.ksl.com/?sid=36596650&nid=148&s_cid=rss-extlink", "title": "Neighbor killed man, grandmother, 2-month-old baby, police say", "dct": "Sat, 19 Sep 2015 00:00:00 GMT", "id": "ce924acad3d361e8d7a589717efb80d9", "content": "SALT LAKE CITY — Neighbors held a vigil Saturday evening for three victims who were shot and killed Friday in their Salt Lake City home.\nHeike Poike, 50, Dakota Smith, 28, and 2-month-old Lyrik Poike were identified as the victims by Salt Lake City Police detective Richard Chipping Saturday morning. Poike was the grandmother of the baby, but police are unsure of Smiths' relationship with them.\n\"We're looking into his connection into either the family or the suspect at this point,\" Salt Lake police detective Richard Chipping said Saturday.\nPolice arrested Alexander Tran, 32, who lives in the basement of the house where the bodies were discovered, according to Chipping. Tran had been renting the upstairs portion of the home to the victims. He had a gun in his possession at the time of the arrest, but was taken into custody without incident, Chipping said.\nInvestigators questioned Tran and \"determined that he shot and killed all three individuals,\" Chipping said. Tran was arrested and booked into Salt Lake County Jail on suspicion of three counts of aggravated murder. Neighbors said the man was wearing only a sweatshirt and boxer shorts when he was arrested.\n\"I can't even explain how sad it is,\" said Kristen Morales, a close friend of Poike. \"The baby was only 2 months old. It's a movie that plays in my head and I can't get it out.\"\nComsuelo Garcia said the baby's mother, Poike's daughter Ashley Poike, was unable to attend the vigil because she was booked into the Salt Lake County Jail last month.\nGarcia said she grew up with Ashley Poike and considers her a sister.\n\"Lyric was pretty much my niece,\" Garcia said. \"Ashley needs to know that she has family and friends out here to support her, and even though she's not here right now, we all are.\"\nGarcia said Heike Poike was like a mother to her.\n\"She was kind and thoughtful. If you needed someone to talk to, she was there,\" she said. \"Ashley needed her and she was more than happy to jump up and take care of the baby for her.\"\nAbove all, Garcia said she hopes justice will be served.\n\"Nobody deserves to die like this,\" she said.\nThe bodies were discovered Friday after police officers looking for the family of a boy who hadn't been picked up from school located the crime scene, according to police. The 8-year-old boy had not been picked up from Escalante Elementary School at the expected time, causing school officials to notify police after being unable to reach family members. The boy is the sibling of the 2-month-old victim and the grandson of Poike, Chipping said.\nOfficers accompanied the boy to three separate locations at which he reportedly had relatives living, eventually arriving at the home at 639 N. Sir Philip Dr. around 5 p.m. Friday. Officers knocked on the front door with no answer, then looked through windows and identified a body underneath a tarp. An officer found the back door ajar, and upon entering the residence discovered the three bodies as well as Tran in possession of the gun, Chipping said.\n\"They went into the house and were calling out to anyone inside and they found a male with a gun, so they took him into custody and then searched the house and found three bodies inside,\" he said.\nNeighbor Robert Fullmer said he didn't know Tran well, but that Tran's parents bought the home less than a year ago.\n\"They kept saying they bought it for him to give it to him,\" Fullmer said.\nHe said Tran's parents had also told him they were afraid of their son.\n\"He'd be beating on the doors, beating on the walls, things of that nature,\" Fullmer said. \"We kind of expected something, but we didn't expect it to be this horrific.\"\nOn Aug. 29, Tran was charged in Salt Lake City Justice Court with reckless driving and an insurance violation, both class B misdemeanors, stemming from an unspecified Aug. 27 incident. A warrant was issued for his arrest when he failed to appear in court on Sept. 10, according to court records.\nThe 8-year-old boy was placed in the custody of an adult family in the neighborhood as of Friday evening. Police were unsure Saturday whether the family was related to the boy or the victims.\nA GoFundMe account* was set up to help the family with funeral costs.\n*KSL.com does not assure that the monies deposited to the account will be applied for the benefit of the persons named as beneficiaries. If you are considering a deposit to the account, you should consult your own advisors and otherwise proceed at your own risk.\nContributing: Amy Joi O'Donoghue and Sandra Yi\nPhotos"}