{"uri": "http://www.themonitor.com/news/local/victim-in-strip-club-shooting-id-d-police-seek-two/article_e27f202c-0578-11e6-bcb3-af6b5e4aa211.html", "title": "Victim in strip club shooting ID'd; police seek two men", "dct": "Mon, 18 Apr 2016 00:00:00 GMT", "id": "d9c9322610c08077ece5a92638176309", "content": "EDINBURG — Dry blood caked the stone tiled steps just outside the front door of an afterhours strip club that was the scene of a violent shooting that left one man dead and six others injured early Sunday morning.\nPolice said the shooting, near the McAllen/Edinburg line on State Highway 107, left one man dead and six others injured, and may have been caused by an altercation between rival gang members.\nMonday night outside the club’s doors, a man who refused to give his name but claimed to represent Jaguars’ management said the club was closed and that he had no comment. He would not provide a date for when Jaguars would reopen.\n“As long as people know it was because of gangs, we’re OK. We’re not going to comment,” the man said.\nEdinburg Assistant Police Chief Oscar Treviño said two men who were kicked out of Jaguars Club early Sunday morning returned to the front of the club after one of the men retrieved a gun from his car and shot indiscriminately at patrons inside, killing one man and injuring six others.\nJaxmany Jazan Montes, 29, of McAllen, died as a result of an unknown number of gunshot wounds, Treviño said.\nMessages left with Montes’ family seeking comment went unreturned as of late Monday evening.\nOfficers responded to a call of shots fired at about 4:40 a.m. Sunday at Jaguars Gold Club in the 5000 block of Highway 107 and encountered seven men with gunshot wounds, Treviño said.\nMontes, who was inside the club when he was shot, died at the scene, while the six other men were transported to local hospitals. Three men remain hospitalized with non-life threatening injuries, while another three men were treated and released, Treviño said. Police did not release specifics on the current condition of the three men, as it was not immediately available.\nThrough interviews with witnesses and club personnel, investigators determined that a scuffle inside the club between men in rival gangs resulted in two men being ejected from the club. Those men went to their car, retrieved an unknown firearm, walked back to the entrance and fired an unknown number shots into the inside of the club, Treviño said.\nTreviño declined to name the gangs they believed to be at the heart of the altercation and ultimately the shooting; and could not confirm whether or not any of the shooting victims were affiliated with any gangs.\nTreviño said it wasn’t the first time officers had been called to the location for reports of violence, but it had been several years since any substantial arrests had been made at the club — before new ownership took over.\n“We were aware of some violence taken place there and several years ago we conducted some covert enforcement operations. We arrested employees for selling drugs from the establishment,” Treviño said. “We started getting complaints, reports of violence, and of drugs and prostitution, so we tried to shut this place down but before we could, they changed ownership and corrected some of the problem issues. They upgraded their surveillance system, security.”\nTreviño did not know if the security guard working the door that morning was an employee of the club or if it was a hired peace officer, but that staff and management have been cooperative with investigators. Investigators continue to review surveillance video of inside the club to help them in their investigation, which as of Monday evening was still ongoing.\nPolice said the men, described only as Hispanic males, immediately fled the scene in an unknown light-colored sedan.\nThe shooting has also put the establishment on the radar of another state agency, the Texas Alcoholic Beverage Commission, an agency primarily responsible for places which are licensed to sell alcohol, something Jaguars and many other establishments like it are not.\n“We are aware of the shooting at that location and are available to law enforcement for any help or assistance they may need,” TABC Sgt. Gabriel Ramos said.\nRamos said they typically don’t investigate places that do not carry a license because they have thousands of locations that are licensed for alcohol that they need to focus on.\nBut Ramos said they do investigate when they receive complaints about a place selling alcohol without a license. He said most of these afterhours clubs opt not to pay for license to sell alcohol purely as a business decision; choosing instead to charge a fee at the door.\nRamos said they will investigate if it turns out people were consuming alcohol after 2:15 a.m. — which is still illegal regardless of license or not.\n“The consumption law is applicable to all public places. There cannot be any public consumption after 2:15 a.m. If they’re licensed extended hours, a person can consume alcohol up until 2:15 a.m. — after that it becomes illegal,” Ramos said. “It’s not until we get a complaint (that we investigate) like consuming during prohibited hours but usually those types of complaints are handled by local police.”\nRamos said he’s aware of past complaints on Jaguars, but said those dated back at least three years.\nUltimately the assistant police chief thinks the shooting and similar types of incidents can be avoided if and when ownership tightens its own rules on who they allow into their establishment.\n“The thing is (BYOB) places are legal — I wouldn’t know what to tell you on that. What happens inside the establishment, the manager is responsible for that. They need to get strict on the type of clientele they let in. From what we’re hearing and through this investigation is that the majority of the patrons they have are somehow affiliated with gang activity — prison and street gangs,” Treviño said. “You’re just setting yourself up for trouble at these places.”\nMaking things more difficult for investigators is the unspoken rule among these gang members and their victims not to speak.\n“By the time officers arrive the suspects are gone and witnesses and victims refuse to cooperate with police,” Treviño said. “The reason witnesses are refusing to speak is because they’d rather let it go for fear things could get worse.”\nTreviño said he and the rest of the command staff, including the chief, will meet soon to discuss this incident and what options they have as law enforcement to look into shutting the club down.\n“Our department is going to do its best to police this location and see what other measures we can take to shut this place down,” Treviño said.\nAnyone with information can call Edinburg Crime Stoppers at (956) 383-8477."}