{"uri": "http://www.shreveporttimes.com/story/news/crime/2016/11/09/teenager-killed-queensborough-shooting/93539150/", "title": "Update: Suspect arrested in connection with death of local teen", "dct": "Sat, 12 Nov 2016 10:30:00 GMT", "id": "12a90a4253deee23868f770d51d132ff", "content": "A man wanted in connection with Tuesday’s shooting death of a local teenager has been arrested.\nSirdetrick Samuels, 18, surrendered to authorities just after 1 p.m. Friday at Shreveport Police headquarters.\nSamuels was wanted in connection with the Nov. 8 shooting death of Tremon Jackson, 16. Jackson was shot to death following a verbal exchange with Samuels in the 3000 block of Boss Avenue.\nBond in this matter has been set at $500,000.\nUpdate, 4:15 p.m., Nov. 9:\nAn area teenager is dead and a Shreveport man is being sought following a Tuesday night shooting in Shreveport’s Queensborough neighborhood.\nPolice say they responded to a report around 10:30 p.m. in the 2400 block of Texas Avenue, where family members were attempting to transport a shooting victim to a hospital.\nFirst responders later learned the crime scene was at a residence in the 3000 block of Boss Avenue, near the intersection of Penick Street. A witness there reported hearing several shots after the victim walked outside the residence.\nThe Caddo Parish Coroner’s office identified the victim as Tremon Jackson, 16. Jackson was reportedly struck by several shots and was later pronounced dead at University Health.\nThe coroner’s office said an autopsy will be performed.\nAn investigation by Shreveport Police Department linked Sirdetrick Samuels, 18, of Shreveport, to the shooting. Police have obtained a warrant for Samuels’ arrest. He is wanted for second-degree murder.\nPolice are asking anyone with information regarding Samuels’ whereabouts to contact Crime Stoppers at (318) 673-7373, or via their website at www.lockemup.org.\nOriginal story:\nAn area teenager is dead after being shot in a Tuesday night incident in Shreveport’s Queensborough neighborhood.\nPolice say they responded to the report of the shooting at 10:56 p.m. at a residence in the 3000 block of Boss Avenue, near the intersection of Penick Street. A witness reported hearing several shots after the victim walked outside the residence.\nThe Caddo Parish Coroner’s office identified the victim as Tremon Jackson, 16. Jackson was reportedly struck by several shots, which were fired by an unknown suspect or suspects. He collapsed after running a short distance and was found by family members, who tried to drive him to a local hospital. An ambulance was called while they were en route and Jackson was taken to University Health where he died as the result of his injuries.\nThe coroner’s office said an autopsy will be performed.\nDetectives with the Shreveport Police Department are investigating Jackson’s death.\nIN OTHER NEWS:"}