{"uri": "http://www.cleveland.com/metro/index.ssf/2015/07/cleveland_man_charged_in_payba.html#incart_river", "title": "Cleveland man charged in payback shooting that left one dead, four wounded", "dct": "Tue, 21 Jul 2015 11:29:00 GMT", "id": "bfc553a3c0b7f445e2da330582fde048", "content": "CLEVELAND, Ohio -- A judge set a $1 million bond for a Cleveland man accused in a shooting that killed one man and injured four others, including a pregnant woman.\nErik Vicario, 25, fired into a crowd of people outside a Bosworth Road apartment building May 10 after his girlfriend got into a fight with several women in the group earlier that night, according to court documents.\nPolice said that the shooting was an act of revenge.\nVicario's girlfriend, who is not named in court documents, and her sister fought with the women about 9:30 p.m. on West 105th Street and Thrush Avenue.\nVicario cased the apartment building where some of the women in the group went after the fight for about an hour and a half, Cleveland police homicide detectives said in an affidavit. Vicario went to his nearby home to change into dark clothing, then returned about 11:10 p.m. He walked up to the crowd and opened fire, court records say.\nTwo shots hit 47-year-old Michael Matthews in the back. He was rushed to MetroHealth Medical Center, where he later died, the Cuyahoga County Medical Examiner's Office said.\nBullets also struck a 22-year-old pregnant woman in the chest, a 41-year-old man in the head, a 24-year-old man in the neck and a 53-year-old woman in the elbow, police said. All the victims recovered from their injuries.\nOfficers arrested Vicario Friday on unrelated drug trafficking and tampering with evidence charges after detectives searched his Thrush Avenue home. Vicario is accused of selling drugs from the home while children were present and flushing drugs down the toilet during the raid, according to court records.\nPolice said Vicario admitted that he intended to shoot other people in the group, and Matthews was not his target.\nVicario appeared in court Monday morning, where he waived his right to a preliminary hearing. His case has been sent to a Cuyahoga County grand jury."}