{"uri": "http://www.sacbee.com/news/local/crime/article116920273.html", "title": "Armed suspect dies after officer-involved shooting at Carmichael 7-Eleven", "dct": "Thu, 24 Nov 2016 16:14:00 GMT", "id": "b0df38bad6d93cc27295f4292a0266c6", "content": "An armed suspect died Thursday after an officer-involved shooting that occurred around 2 p.m. in Carmichael, authorities said.\nSgt. Tony Turnbull, spokesman for Sacramento County Sheriff’s Department, said the shooting took place at a 7-Eleven near Marconi and Walnut avenues. No officers were injured.\nTurnbull said that around 1:50 p.m. the sheriff’s department received a 911 call from a person who they believe to be the suspect. “He was being belligerent,” Turnbull said, “talking about things going on in the nation” as well as his hatred for police.\n“The suspect stated he wanted to talk to cops, but that they should dispatch a really big cop,” Turnbull said in a statement released by the sheriff’s department Thursday evening.\nOfficers received additional calls about a suspect behaving erratically at a 7-Eleven, Turnbull said.\nWhen they entered the store, officers saw the suspect run down an aisle. He told officers he had a gun, and then appeared “with a knife in his hand,” Turnbull said.\nThe suspect, described as a white male in his late teens, began “to stab himself in the neck,” Turnbull said. “It was clear to the officers that he hit an artery because of the way he was bleeding profusely.”\nPolice fired “a less lethal rubber bullet to incapacitate” at the suspect, Turnbull said, but it was ineffective.\n“The suspect remained armed and became more agitated,” Turnbull said. “An officer, fearing for his safety and (the) safety of the other officers discharged his firearm once toward the suspect.”\nIt is unclear if the bullet hit the suspect, Turnbull said.\nBleeding heavily, the suspect fell to the ground and was taken into custody, Turnbull said. Officers immediately attempted to provide aid to the suspect. He later was pronounced dead at the scene.\nThe official cause of death remains unknown pending an autopsy report from the Sacramento County Coroner’s Office. The identity of the man will be released by the coroner after next of kin are notified.\nThe officer who fired his weapon is a 27 year veteran, Turnbull said.\nAuthorities said they found a knife and a handgun at the scene."}