{"uri": "http://www.frontiersman.com/news/additional-charges-filed-in-grunwald-murder-case/article_4c88dfbc-ca3b-11e6-8e56-9703e1bf441c.html", "title": "Additional charges filed in Grunwald murder case", "dct": "Sun, 25 Dec 2016 00:00:00 GMT", "id": "5039ea1bd5ae0a96729ec9b85c56df5b", "content": "WASILLA — Four of the five Mat-Su teens charged with involvement in the Nov. 13 murder of 16-year-old David Grunwald of Palmer face additional charges.\nAccording court documents filed Dec. 22 in Palmer Superior Court, additional charges of first-degree assault, first-degree theft and third-degree arson were filed against 17-year-old Erick Almandinger, 16-year-old Bradley Renfro and 16-year-old Dominic Johnson. Additional charges of first-degree assault and first-degree vehicle theft were filed against 19-year-old Austin Barrett. The four already faced multiple counts of first-degree murder, kidnapping and evidence tampering.\nThe four Mat-Su teens, along with 18-year-old Devin Peterson, are currently jailed for their alleged involvement in the kidnapping, pistol-whipping and eventual fatal shooting of Grunwald, who was reported missing Nov. 13 after not returning home that evening. Grunwald and his girlfriend had spent that Sunday at the Grunwald home. When David failed to arrive back that evening after dropping her off at her father’s home in Butte, police were notified.\nAlaska State Troopers and private investigators took over the case, and several searches by hundreds of people in the Mat-Su community were initiated. Troopers were led to Grunwald’s body in a remote area of Knik River Road Dec. 2 after interviewing Almandinger. Court reports allege all but Peterson were involved in or were an accomplice to recklessly causing serious physical injury to Grunwald as well as his murder.\nAccording to police affidavits, Grunwald was still alive when he was taken out to a remote area near the Knik River. His Ford Bronco was found hours later completely burned on a trail outside Wasilla. According to the State Medical Examiner’s Office, Grunwald died of from a single gunshot wound. It also reported he had been badly beaten.\nPeterson’s charges involve evidence tampering and hindering prosecution. The other four are charged with Grunwald’s actual murder. Peterson’s bail was set at $100,000 while the other four remain jailed without bail. Trials on all five are scheduled for February 2017."}