{"uri": "http://wfla.com/2016/02/20/one-dead-3-injured-after-shooting-at-tampa-bar/", "title": "Man killed in Tampa bar shooting identified", "dct": "Sat, 20 Feb 2016 09:43:00 GMT", "id": "daf2c8503f5f026314df86d50f5bd41e", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nTAMPA, FL (WFLA) – Authorities identified the man who was shot and killed near a Tampa bar early Saturday morning.\nManuel Otiz, 28, died, three more people are at a hospital with gunshot wounds after a man opened fire at a crowd of people at the Tampa bar, according to the Hillsborough County Sheriff’s Office.\nIt happened at about 4 a.m. near the Smokin Bull Hooka Bar on Bearss Avenue in Tampa. According to HCSO, it started with a verbal fight, after which a man went to his car, grabbed a gun and opened fire at a crowd of about 50 people near the bar.\nHe fired about 10 rounds, deputies said. When HCSO crews arrived, they found four victims with gunshot wounds. Otiz died, three others, two men, ages 20 and 22, and a woman, 33, are being treated for their injuries.\nHal Robinson who lives near the area, said he heard the shots early in the morning.”So I heard six shots and then a pause and then additional shots were fired…. ”\n“So I heard six shots and then a pause and then additional shots were fired,” he said. “This bar has been specifically problematic. There’s a whole lot of other restaurants and bars in here and we’ve never had any issues. I’ve lived here for ten years.”\nHe said this is the third shooting they’ve had at this bar in a year.\nDetectives are investigating the shooting. No arrests have been made so far.\nCrime Stoppers of Tampa Bay offered a $3,000 reward for any information that would lead to the identification and the arrest of the suspect or suspects in this case.\nStay with WFLA for more on this developing story.\nMORE STORIES:\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}