{"uri": "http://wfla.com/2016/11/29/14-year-old-accidentally-shot-at-polk-county-motel/", "title": "Deputies: 14-year-old accidentally shot, killed at Polk motel", "dct": "Tue, 29 Nov 2016 10:14:00 GMT", "id": "614a15fae87e4fe8f1cab17270dc9e60", "content": "WINTER HAVEN, FL (WFLA) — Polk County Sheriff’s deputies are investigating what appears to be the accidental shooting death of a 14-year-old boy in Winter Haven.\nDeputies say the shooting happened around 4 p.m. on Monday at the LakMar Resort Motel, located at 2520 US Hwy 92 West. Deputies say that is where they found 14-year-old Kyler Daughtry, who lives in room number 8, deceased from a single gunshot wound.\nInvestigators say Kyler and two other teens, 19-year-old Donovan Hoover, who lives in room number 9, and 16-year-old Dylan Prosser, who lives in room number 7, went into a bedroom where Donovan showed a 12-gauge shotgun to them and then left the room.\nA short time later, deputies say Donovan heard Dylan say, “This is how you load a shotgun,” and then heard a gunshot. He ran back into the room to find Kyler had been shot. Nobody else was home at the time.\nKyler lived at the motel with his mother, and attended Lake Alfred-Addair Middle School.\nThe investigation is ongoing, however it does not appear to be an intentional shooting at this time.\nA mother and father were caught on camera, passed out, in…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}