{"uri": "http://www.pressdemocrat.com/news/6179569-181/petaluma-baby-doing-well-after", "title": "Petaluma baby 'doing well' after being shot in accidental gunfire", "dct": "Mon, 10 Oct 2016 00:00:00 GMT", "id": "523cf7bed6e5d2da6ba70f99940c9ac8", "content": "A Petaluma baby accidentally shot by her father was in stable condition and “doing well” at Children’s Hospital Oakland, Petaluma police officials said Monday.\nThe child was struck by a bullet from a .45-caliber handgun Saturday at a Reynolds Drive residence while her 53-year-old father was handling the weapon in a bedroom, Sgt. Ed Crosby said. The 11-month-old girl was wounded in the shoulder. She was expected to recover.\n“I would characterize it as a major miracle,” Crosby said. “It’s still a traumatic injury but it wouldn’t have taken but a few millimeters to be something far more serious.”\nThe shooting, reported about 6:15 p.m., appeared accidental. Police did not arrest the father, who was not identified. Crosby said the father was “beside himself” over the shooting and cooperating with the investigation. Officers were still conducting interviews and finalizing their findings for Sonoma County District Attorney’s prosecutors, who would make the final determination about whether there was any criminal negligence.\n“The question is whether that accident could have been avoided and, if so, whether that rises to the level of a criminal case,” Crosby said. “There are a whole lot of factors that need to be weighed.”\nThe child’s parents were in the master bedroom preparing to go out that night, with a babysitter in another room, when the incident occurred. The child was with her mother on the bed and crawling around when the father retrieved the gun from a nightstand to ensure “it didn’t have a round in the chamber and was safe to leave at home,” Crosby said.\n“He was handling it with the intention of making it safe and then it went off,” Crosby said.\nThe bullet hit the child’s left shoulder from behind and exited through the top of the chest. It passed through the top of the mattress, according to police. Officers found the bullet, intact with a full metal jacket, in the closet, Crosby said.\nThe girl was rushed to Santa Rosa Memorial Hospital then airlifted to Children’s Hospital.\nCrosby said the father had experience with firearms but did not currently or previously work in law enforcement.\nCrosby said he would not yet release the father’s name because police were still conducting interviews in the case.\nYou can reach Staff Writer Julie Johnson at 707-521-5220 or julie.johnson@pressdemocrat.com. On Twitter @jjpressdem."}