{"uri": "http://detroit.cbslocal.com/2016/12/14/grandmother-13-year-old-charged-with-manslaughter-in-snow-day-shooting/", "title": "Grandmother, 13-Year-Old Charged With Manslaughter In Snow Day Shooting", "dct": "Wed, 14 Dec 2016 09:56:00 GMT", "id": "3d4336f9d69129471ddaa85165d6b816", "content": "DETROIT (WWJ) – A grandmother and her teenage grandson are facing several charges, including manslaughter, after a 13-year-old was shot to death in their west side Detroit home.\nThe Wayne County Prosecutor’s Office says 58-year old Lise Cox kept a handgun underneath a dresser in her bedroom and was aware that her grandsons knew where the gun was. Thirteen-year old Emarje “EJ” Watkins was shot and killed as he and three other teens played with the gun.\nCox’s 13-year old grandson, the alleged shooter, has been charged as a juvenile with manslaughter – death by weapon aimed with intent but without malice, felony firearm, and careless discharge of a firearm causing injury or death. A preliminary hearing was held and bond was set at $7,500/10 percent. A pretrial hearing is scheduled for December 16.\nCox is expected to be arraigned Wednesday morning on one count of involuntary manslaughter (grossly negligent storage/maintenance of the handgun, resulting in Watkins’s death); two counts of second-degree child abuse (knowingly committing an act likely to cause serious physical harm; one count for each grandson); and felony firearm.\nThe shooting happened Monday afternoon at Cox’s home in the 4300 block of Tireman, near I-96. Her two grandsons stayed home from school on a snow day, and she left them unsupervised while she went for work, according to police. The boys invited over two of their friends, including Watkins, to play video games, according to police.\nAfter Cox had left, her 13-year-old grandson allegedly broke into her locked bedroom and found her handgun and the ammunition.\n“The firearm was hidden and unloaded in a locked bedroom,” Detroit Police Officer Jennifer Moreno told WWJ’s Laura Bonnell. “The 13-year-old sought out the firearm. … The grandmother didn’t properly secure it. ”\nIt is alleged that while the 13-year-old was playing with the gun, it discharged and fatally struck Watkins in the back. He was taken to a local hospital where he was pronounce dead on arrival.\nStay with WWJ Newsradio 950 and CBSDetroit.com for the latest."}