{"uri": "http://www.delawareonline.com/story/news/crime/2017/01/03/harrington-school-parking-lot-shooting-injures-teen/96102644/", "title": "Harrington school parking lot shooting injures teen", "dct": "Tue, 03 Jan 2017 00:00:00 GMT", "id": "6aee21cb76805647381f459af249b600", "content": "Daniel Sato/The News Journal\nOne Dover man has been arrested, and another remains on the run after a shooting Sunday afternoon in a Harrington school parking lot.\nHarrington Police spokesman Lt. Earl K. Brode says a 17-year-old was shot in both legs at about 4 p.m. Sunday at Lake Forest South Elementary School. He was transported to Milford Memorial Hospital and was later airlifted to Christiana Hospital for further treatment, according to police.\nThe injuries were not believed to be life-threatening.\nBrode says the teen was playing football with a group at nearby W.T. Chipman Middle School when another group confronted them. A fight ensued, and someone fired a handgun multiple times at the group of people before fleeing in a vehicle.\nAfter firing the gun, the man gave it to someone else who got rid of the weapon for him, according to police.\nPolice believe 19-year-old Trequon Seth fired the handgun and 20-year-old David Brown discarded it.\nState police were able to locate the vehicle in which the shooter fled and attempted to stop the vehicle, but Seth and Brown ran, according to police.\nPolice found Brown hiding in the bushes of a residence on Old Airport Road. He was arrested and charged with first-degree assault, possession of a deadly weapon during the commission of a felony, reckless endangering, tampering with physical evidence, resisting arrest and conspiracy.\nHe was taken to Sussex Correctional Institution near Georgetown on $70,000 secured bail.\nSeth hasn't been located but has warrants for his arrest on charges, including first-degree assault.\nThe Associated Press reported that it's unknown whether Brown has an attorney.\nAnyone with information is asked to contact police at (302) 398-4493 or Crime Stoppers at (800) TIP-3333.\nContact Brittany Horn at (302) 324-2771 or bhorn@delawareonline.com. Follow her on Twitter at @brittanyhorn."}