{"uri": "http://www.wrcbtv.com/story/29563843/officer-involved-shooting-at-us-naval-reserve", "title": "UPDATE: No motive known for gunman opening fire on Marines", "dct": "Thu, 16 Jul 2015 15:21:00 GMT", "id": "0f0bbcf177e0a5736efb4a6748c8dd55", "content": "CHATTANOOGA, TN (WRCB) -\nUPDATE: Federal authorities say it remains unclear what led 24-year-old Muhammad Youssuf Abdulazeez, a naturalized U.S. citizen from Kuwait, to open fire on two military locations in Chattanooga.\n\"We will be here several days processing crime scenes,\" said Agent in Charge Ed Reinhold, a spokesperson for the FBI.\nThe lone gunman, who was a 2012 UTC grad, was killed. An autopsy will take place over the weekend. He had no known ties to any international terrorism organization, Reinhold said.\nFour U.S. Marines were killed Thursday by the gunman in Chattanooga.\nA Chattanooga police officer, identified as Dennis Pedigo was wounded, and is said to be in stable condition.\nErlanger hospital treated at total of three shooting victims, including Pedigo, as well as two members of the military. One patient was discharged Thursday afternoon and two others continue to receive treatment.\n\"[Pedigo is] doing as well as can be expected after being shot by a brazen criminal like this,\" said Chattanooga Police Chief Fred Fletcher.\nBerke called the shooting a \"nightmare for Chattanooga.\"\n\"There are no safety concerns for the general public,\" said U.S. Attorney Bill Killian for the Eastern District in Tennessee in a press conference late Thursday night.\nThe shooting started at 10:45 a.m. and ended within 30 minutes.\nKillian called the shooting an \"act of domestic terrorism\" and pledged the resources of the FBI and Department of Homeland Security for the investigation.\nOther military installations in the state have been notified and are on alert.\nThe FBI has not yet determined a motive for the shooting, saying that they will use any and all means to investigate the shooter. His family home was searched in Hixson subdivision, Colonial Shores.\nGov. Bill Haslam spoke to reporters Thursday night saying, \"Chattanooga is a great city with a broken heart tonight. ... I think all of our hearts go out to families of the four Marines who lost their lives.\" He said he was impressed with commitment of federal and local authorities to investigate.\nU.S. Senator Bob Corker, who served as mayor of Chattanooga from 2001 to 2005, commended federal and local authorities for their response.\n\"This is a great city. I know that our city, as well as our nation, come around the families who will need support who had the sudden shock of loss of a loved one who came to work today carrying out their duties in a normal way,\" he said.\nThe gunman fired 25 to 30 rounds at a military recruitment facility, a U.S.military official said. The gunman then drove about six miles to a Navy and Marines reserve center and opened fire there, officials said.\nOfficials will have a news conference about 3 p.m, today where we expect to learn more details about the shooting.\nPresident Barack Obama was briefed Thursday about the shooting.\nThe shooting incident began on the U.S. Naval Recruiting offices on Lee Highway in Chattanooga ended at the U.S. Naval Reserve Center on Amnicola Highway Thursday morning about 11 a.m.\nBoth Mayor Andy Berke and Police Chief Fletcher visited the shooting scene and went to the hospital to check on the officer.\n\"Our hearts aches for them. We understand as community what it takes to heal. We're thankful for those who are home safely and we will certainly give a prayer in all of hearts for those who aren't,\" Berke said at a press conference.\nBlood Assurance has send multiple units of blood to Erlanger; requesting donations to add those who've been injured, shot. Blood Assurance is opening at 8 a.m. this morning and remaining open until 6:30 p.m. this evening.\nThe Department of Homeland Security has activated their Chattanooga Strike Team, other district strike teams have been put on standby.\nTennessee Gov. Bill Haslam's residence was shutdown temporarily, but has since re-opened. Additional security is in place at the Tennessee Capitol, and THP troopers are in place around the complex.\nA reported shooting at Bradley Square Mall has been ruled as to be false. Police are still on hand as they continue to investigate.\nBerke left another news conference early Thursday when he received the news of the shooting.\nU.S. Senator Lamar Alexander said in an email:\n“I am deeply disturbed by reports of a violent attack in Chattanooga. I have been in touch with federal, state and local officials and will monitor the situation closely. My thoughts and prayers are with everyone involved.”\nAnyone with information is asked to call the FBI at 865-602-7582.\nStay with Channel 3 and WRCBtv.com for updates on this developing story."}