{"uri": "http://www.wrcbtv.com/story/29573967/shooting-survivor-recovering", "title": "RANDALL SMITH: Close friends rally around the family of U.S. Navy sailor", "dct": "Fri, 17 Jul 2015 18:26:00 GMT", "id": "2debfbb1e99c07799710230e9faaa077", "content": "HAMILTON COUNTY, TN (WRCB) -\nUPDATE: U.S. Navy Petty Officer 2nd Class Randall Smith, 26 likely saved many lives before his was taken. Family members say the 2nd class logistics specialist saw the shooter and warned people around him before being shot. Smith died from his injuries Saturday July 18, bringing the military death toll after the shooting rampage in Chattanooga, Tennessee to 5. Smith is survived by his wife and 3 young daughters.\n\"He and Angie were just you know .. she says he was her everything, that he was everything to her and their family,\" said family friend Tracy Hames, \"They did everything together.\"\nTracy Hames works with Smith's wife at Sports Clips off Gunbarrel Road, where friends are taking up donations for the family.\n\"It grows like our hearts... it keeps growing and everyday it's like we can do more,\" said Hames. \"That's what we want for Angie. Randall and Angie loved Chattanooga and they supported this community.\"\nThe Ohio native moved to Chattanooga when he re-enlisted in the Navy. Smith first enlisted back in November of 2010. U.S. Navy officials confirm he was on active duty at the time of the shooting.\n\"She said he loved the mountains here.... when they moved here all he could talk about was how beautiful our area was, it's just heartbreaking,\" said Hames.\nAbove all, Smith loved his family. A video posted by Smith's wife on Facebook shows the playful dad singing with his three girls in the car. Smith was described by everyone as a loving husband and father who always wore a smile. It's how many say they want him to be remembered.\n\"We just want them to know we are here for her and we love her,\" said Hames.\n100 % of the proceeds and donations given at the Sports Clips location off of Gunbarrel Road directly benefit the Smith family. Store managers say you can also make a cash donation at any Sports Clips location. Police are protecting the Smith's home, at this time funeral arrangements have not been announced.\nPREVIOUS STORY: In light of U.S. Navy Petty Officer 2nd Class Randall Smith's passing, a memorial continues to grow outside of of the Armed Forces Recruiting Center, where Thursday's shooting rampage started. His body was transported from Erlanger to the Chattanooga airport on Sunday afternoon with a police escort.\nThe entire community was hoping to hear good news. Smith was fighting since Thursday, unfortunately he passed away Saturday morning. But his neighbors got together to offer their support to Smith's family during this very difficult time.\nAs soon as neighbors heard about the passing of Randall Smith, they got together and delivered water, sodas and fruit to Smith's family.\n\"Right now my heart is heavy,\" said Priscilla Shartle, a neighbor.\nSaturday the U.S. Navy was at the home of Smith to deliver the unfortunate news. Neighbors comforted one another hoping to hear that Smith was coming home.\n\"I have spent the last few days waiting to hear good news, and this morning we learned there was bad news,\" said Shartle.\nPriscilla Shartle is one of Smith's neighbors. The community describes Smith as someone who loved his family and country.\n\"I've seen the Facebook picture and as a grandmother, with four grandchildren, I can't picture those little children's lives, and how it's changing,\" said Shartle.\nAs the nation mourns the loss of another American hero, neighbors who had seen Smith around say they are going to offer any help to his family.\n\"We're all just one great big family,\" said Shartle.\nSmith grew up in Paulding County, Ohio and he was serving in Chattanooga as a Logistics Specialist in the U.S. Navy at the time of the shooting.\nSmith went through several surgeries after he was shot Thursday. His family and friends have created a GoFundMe account.\nPREVIOUS STORY: Another victim from Thursday's shooting has passed away. The U.S. Navy confirms that 26-year-old Logistics Specialist 2nd Class / LS2 Randall Smith passed away early this morning bringing the military death toll to five plus the gunman.\nSmith had reportedly gone through several surgeries. He was serving in Chattanooga as a logistics specialist in the U.S. Navy at the time of the shooting.\nSmith grew up in Paulding County, Ohio, and joined the service after attending college in the state, his grandmother, Linda Wallace, told The Associated Press. Residents in the county of less than 20,000 were urged Thursday and Friday to pray for Smith, according to NBC affiliate WCMH.\nHe enlisted Nov. 8, 2010.\n\"It is with great sadness that a graduate of Paulding passed away due to injuries sustained in Chattanooga,\" Paulding County Sheriff Jason Landers said Saturday after news of Smith's early morning death.\nSmith was married and had three daughters, the AP reported.\nOhio Gov. John Kasich also tweeted his condolences.\nThe Chattanooga police officer who was wounded does not have life-threatening injuries. Police killed the gunman.\nSmith's family and friends had been raising money for him on a GoFundMe page, saying he's \"fighting for his life\"\nFunds will be used to support the family and their needs throughout this journey.\nRandall's family posted on the GoFundMe account: \"We don't know what He has planned for Randall and strength is needed as His will unfolds.Your thoughts and prayers are greatly appreciated at this time.\""}