{"uri": "http://www.ibtimes.com/chattanooga-shooting-victims-names-revealed-after-attacks-tennessee-military-2014008", "title": "Chattanooga Shooting Victims’ Names Revealed After Attacks On Tennessee Military Buildings", "dct": "Fri, 17 Jul 2015 13:39:00 GMT", "id": "34ec2ee9ffc70192e85dd84ccbd13f8f", "content": "Family and friends have confirmed the names of the four U.S. Marines killed Thursday after Mohammod Youssuf Abdulazeez opened fire at two U.S. military buildings in Chattanooga, Tennessee. At least one other person remained hospitalized Friday with wounds suffered in the attack.\nAuthorities have yet to determine the motive behind Abdulazeez’s attack. The 24-year-old, who grew up in Chattanooga and had no known ties to foreign terrorist groups, was killed in a gun battle with police shortly after he used an automatic weapon to attack a U.S. Naval Reserve center and a recruitment office. Federal officials announced an investigation into a trip Abdulazeez took to the Middle East in 2014 and have examined a pair of Islam-themed blog posts he purportedly wrote in the days prior to the Chattanooga shooting.\nGunnery Sgt. Thomas J. Sullivan was the first confirmed victim in the Chattanooga shooting. Sullivan, 40, was a Springfield, Massachusetts native and Iraq War veteran who received a Purple Heart after he was wounded in combat. His family confirmed his death early Friday to MassLive.com.\nOne of #Chattanooga shooting victims 2 tour #USMC #Iraq veteran. Thomas Sullivan earned Purple Heart. #SemperFidelis pic.twitter.com/k7dpN1iP6i\n— Jon Williams (@WilliamsJon) July 17, 2015\n“There’s no Marine you would want that was better in combat than him,” Sullivan’s friend, Josh Parnell told the Oak Lawn Patch in Illinois. “He’d been shot at so many times over the years and then for this to happen at home in the United States.”\nSkip Wells, a Marine from Marietta, Georgia, was also a victim of the shooting, according to a spokesman for Wells' family, WSB-TV reported. Wells briefly attended Georgia Southern University, but he left the school to join the Marine Corps. Friends and acquaintances left their condolences on Wells’ Facebook page Thursday.\n“We don’t understand the whys. Senseless is a word used too often but this you can’t even hang our hat on,” Wells family spokesman Andy Kingery told WSB-TV.\nIn Chattanooga, David Wyatt’s neighbors named him as another victim of Abdulazeez’s attack. Local police guarded Wyatt’s home Thursday night, the Tennessean reported.\nBREAKING: Third victim in Thursday's shooting identified as 37-year-old David Wyatt of Hixson http://t.co/2qmt6FtC6j pic.twitter.com/Bg7O5OM7sT\n— WRCB-TV Channel 3 (@WRCB) July 17, 2015\nSgt. Carson Holmquist, who grew up in Wisconsin and lived in Flintsone, Georgia, was the last of the victims to be identified Friday. He was 27 years old, WRCB-TV in Chattanooga reported.\nWisconsin native Sgt. Carson Holmquist killed in #Chattanooga shooting: http://t.co/p3nTPWLU74 pic.twitter.com/wSDEPBOsLQ\n— WBAY-TV 2 (@WBAY) July 17, 2015\nAt least three other individuals, including a Navy sailor and a police officer, were wounded in the shooting, CNN reported. Family members said Randall Smith, a 26-year-old U.S. Navy logistics specialist, underwent surgery for three gunshot wounds suffered in the attack, the Salina Journal in Kansas reported.\n100%PAUSEDN/AN/AN/AN/A 100%PAUSEDN/AN/AN/AN/A"}