{"uri": "http://www.rrstar.com/news/20160712/police-identify-16-year-old-killed-after-rockford-shooting-at-party", "title": "Police identify 16-year-old killed after Rockford shooting at a party", "dct": "NODATE", "id": "3905134e5b1cabdefc58fa5bf02d3598", "content": "ROCKFORD - Police have identified a 16-year-old male who died early Monday after being shot at what authorities say was an apparent late-night party at an apartment complex on Creek View Road.\nPolice and fire personnel were dispatched to an apartment complex at 4878 Creek View Road shortly after 1 a.m. Monday. The victim, Izaiah Sanders of Rockford, was taken to a OSF Saint Anthony Medical Center where he died from a gunshot wound to the torso.\nSanders was enrolled at Guilford High School. Arrangements are pending at Honquest Family Funeral Homes with Crematory in Loves Park.\nA preliminary investigation has revealed that Sanders was shot after a disagreement escalated had at the apartment. Detectives have been interviewing witnesses all morning and the investigation is ongoing.\nSanders is the city's 11th homicide victim this year and second over last weekend. He was also the fourth teenager killed in Rockford this year. The killing of one of those other teenagers took place just blocks away. The neighborhood and surrounding areas have been the site of several other violent crimes and incidents recent.\nThere are roughly 100 apartments spread among a dozen buildings on Creek View. Those are in addition to several other larger apartment buildings in the area. There have been 123 police calls for service from those dozen buildings, generating 32 police reports so far this year.\nLast week, Rockford police worked with Winnebago County Sheriff's Department, adult probation and Rockford code enforcement to sweep the area, perform inspections, serve one arrest warrant and check in on four probationers.\nAnyone with information regarding the Sanders homicide is urged to contact the Rockford Police Department at 779-500-6555 or Crime Stoppers at 815-963-7867.\nIsaac Guerrero: 815-987-1361; iguerrero@rrstar.com; @isaac_rrs"}