{"uri": "http://www.tulsaworld.com/news/crimewatch/year-old-freedomfest-shooting-victim-is-recuperating-never-wants-to/article_ee251d00-bcf5-5d62-bc96-ed47829057d9.html", "title": "9-year-old FreedomFest shooting victim is recuperating, never wants to see fireworks again", "dct": "Fri, 08 Jul 2016 00:00:00 GMT", "id": "6015e46c8efda0ffd911722c7f686971", "content": "Mark and Annette Pinkstaff stay at The Children’s Hospital at St. Francis Hospital with their 9-year-old son, Grant, who was hit in the head by a bullet at FreedomFest on Monday. Doctors have decided not to remove the bullet due to fear of additional damage. JESSIE WARDARSKI/Tulsa World\nVIDEO: Parent's of 9-Year-Old Gun Shot Victim Speak Out\nA 9-year-old baseball player doesn’t ever want to see a fireworks show again.\nGrant Pinkstaff was one of two people who were struck in the head by a bullet while they were in the crowd of 80,000 people at Tulsa’s FreedomFest on Independence Day. The bullet entered near the top of his head and traveled under the skin around his skull. It is now resting permanently near the back of his head.\nThough unsure at first, doctors are now telling the boy’s parents he will make a full recovery despite ongoing pain and loss of some peripheral vision in his right eye.\nThe bullet’s location is not life-threatening, and doctors said the risk of surgery wasn’t worth its removal, his parents said Thursday evening.\nGrant’s father, Mark Pinkstaff, said he hopes the peripheral vision loss won’t affect Grant’s ability as a left-handed first baseman.\n“Now that we know he’s alive, we find out that other people had this happen, as well,” Pinkstaff said.\nBranon Vaughan, an adult who was walking to his car after the fireworks show, was struck by a bullet that embedded in his right cheek about the same time Grant was hit.\nMark Pinkstaff said he’s been in different stages of trauma since his son first told him “something hit him hard.”\nPinkstaff took off his shirt after realizing how much his son was bleeding, but it wasn’t until hours later that a scan revealed that he’d been hit by a bullet.\n“He told me twice, ‘Daddy, I don’t want to die,’ ” Pinkstaff said.\nNow that Grant’s prognosis — despite astronomical odds, according to his doctor — is mostly clear, his father is focusing on getting the word out that someone should be held accountable.\n“Someone’s got to be accountable for this. It’s just not acceptable,” Pinkstaff said. “The Fourth of July is about fireworks — not guns.”\nHe continued: “Something needs to be done. Somebody saw something. If you did, call the police.”\nPinkstaff added that he could forgive a teenager who made a mistake with a gun he wasn’t supposed to have. Regardless of the scenario, though, he said someone should answer for it.\n“Now that I’m kind of assured that my child will survive, … I can forgive,” he said. But “whatever the reason, someone has to be held accountable for this.”\nAnnette Pinkstaff, Grant’s mother and Mark Pinkstaff’s ex-wife, drove Grant to the hospital and was there when they learned that he’d been hit by a bullet.\n“I was losing it,” Annette Pinkstaff said. “He said, ‘Mama, I’m going to be OK.’ ”\n“You feel helpless because you want the swelling to go down and the blood to go away,” his mother said.\nThe family is hoping to have Grant home for his 10th birthday on Sunday but are planning to postpone his party to throw him a much larger one than they had planned.\n“Grant said he never wants to see another fireworks show ever,” his father said. “He’ll have that bullet to remind him that he’s a miracle.”"}