{"uri": "http://www.wbbjtv.com/2016/10/21/sheriff-8th-grade-boy-father-killed-inside-home/", "title": "TBI identifies father, son killed in Toone shooting", "dct": "Fri, 21 Oct 2016 00:00:00 GMT", "id": "2e4a5a303524586647a10dde18352cba", "content": "TOONE, Tenn. — The search for a killer continues in Hardeman County after a father and son are found shot to death Friday inside their home.\nFriday morning, the mother of Javarrie “Jojo” Robertson, 13, dropped him off before school at the home of his father, Joe “Joe Duke” Robertson, 38, on Naylor Road in Toone before school.\nInvestigators say around 7:30 a.m. Friday, Jojo and his father Joe were shot and killed inside the home.\n“Just one of those senseless things that we don’t expect to happen in our community and being so close to the family,” Antioch Baptist Church Undershepherd Willie Spencer said.\nDozens of friends and family gathered behind the police tape once the news spread.\nAccording to the Tennessee Bureau of Investigation, Joe Robertson’s newborn and 5-year-old daughters were also home at the time of the shooting but were unharmed.\n“It’s going to be a tough road for them as you can well understand,” Tennessee Bureau of Investigation Public Information Officer Josh DeVine said. “But our agency stands equipped and prepared to do anything and everything we can to assist them in the process and to work for justice on their behalf.”\nFamily members say they are praying for JoJo’s mother after this tragedy.\n“The community is a very tight-knit community. People know each other,” Spencer said. “We’re just praying that she can get through this. That was her only child.”\nHardeman County deputies and TBI agents have hours of work ahead of them to determine what happened and who may be responsible. They need the public’s help to assist in the investigation.\n“So at this point there is an individual or perhaps individuals out there responsible for this,” DeVine said. “That’s why we would urge anyone with specific information about this to give us a call at 1-800-TBI-FIND.”"}