{"uri": "http://wavy.com/2016/06/19/four-people-shot-in-northampton-county/", "title": "1 dead after 4 people shot in Northampton County", "dct": "Sun, 19 Jun 2016 13:27:00 GMT", "id": "4e5e505039cc86cf6cc558134067d218", "content": "EXMORE, Va. (WAVY) — The Exmore Police Department and the Northampton County Sheriff’s Office are investigating after four people were shot in Northampton County, Saturday evening.\nDispatch received the emergency call around 7:30 p.m. When officers arrived on the scene on Frederick Douglas Road in Exmore, police found two men who had been shot.\nBoth victims were taken to Riverside Shore Memorial Hospital in critical condition. The suspect left the scene before officers arrived.\n“Once he saw that guy (the suspect) jumped out of that truck and started shooting at him like he was just nothing,” Courtney Doughty, who witnessed the first shootings, said.\nShortly after 8 p.m., the Sheriff’s Office received a tip that the suspect might be at a home on Arlington Road near Kiptopeke State Park. Dispatch then received another call about 10 minutes later for a gunshot victim in the 29100 block of Arlington Road.\nWhen deputies arrived at the Arlington Road scene, they found a man and woman with gunshot wounds. Police say the woman was also shot at the Exmore location, left before police arrived, and somehow got to the home on Arlington Road.\nDeputies say they know how she arrived from the first shooting to the second scene, but are not releasing that information at this time. They do not believe she is a suspect.\nThe woman was taken to Riverside Shore Memorial Hospital where she was treated and released. The man was transported to Sentara Norfolk General Hospital where he was pronounced dead on arrival. He has been identified as 30-year-old Ronald Graves of Portsmouth.\nThe suspect has been identified as 22-year-old Alexander Hunter Picott-Cleveland, of Capeville, Virginia.\nOfficers from the Northampton County Sheriff’s Office, Exmore Police Department, Cape Charles Police Department, Virginia State Police and aircraft from the Virginia Beach Police Department and Maryland State Police searched the surrounding areas for Picott-Cleveland until around 3:30 a.m. Sunday.\nPicott-Cleveland was taken into custody without incident by deputies around 6:42 a.m.\nPicott-Cleveland has been charged with murder, one count of use of a firearm while committing murder, three counts of malicious wounding, three counts of use of a firearm while committing malicious wounding, reckless handling of a firearm and brandishing a firearm. He is being held at the Eastern Shore Regional Jail with bond denied. He was arraigned on Tuesday and is expected in court again on August 11.\nOne of the victims from the Exmore shooting is still hospitalized and listed in stable but critical condition. The other two victims from the Exmore shooting have been treated and released.\nIf anyone has any information they are asked to contact the Northampton County Sheriff’s Office or Exmore Police Department at 757-678-0458.\nStay with WAVY.com for developments on this story."}