{"uri": "http://fox61.com/2016/10/24/bristol-man-admits-to-heavy-drinking-accidental-deadly-shooting-of-friend/", "title": "Bristol man admits to heavy drinking and accidentally shooting his friend dead", "dct": "Mon, 24 Oct 2016 22:09:00 GMT", "id": "004236b346f84944d7a2b4e3e28827a3", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nBRISTOL - Standing silently before a judge on Monday afternoon, 35-year old Chad Couture of Bristol was arraigned after police say he shot and killed his friend, 63-year-old Daniel Caron, in the driveway of his parents' home on Woodland Street in Bristol.\nOn Friday evening, police responded to the home and found Caron lying in the driveway with a single gunshot wound to his chest.\nCouture is now charged with first-degree manslaughter and criminal possession of a firearm.\nAccording to court documents, Couture was hysterical and agitated. Inside his parents' home, police found a .45-caliber handgun, which was confiscated. Police say Couture had a revoked pistol permit, but had six weapons registered under his name.\nCourt records show Couture admitted to police to accidentally shooting Caron, as well as drinking half a pint of vodka prior to the incident.\nTestimony inside the courtroom revealed Couture suffers from serious substance abuse issues. His criminal record includes prior arrests for threatening, as well as multiple DUIs. Couture's lawyer said his client is a lifelong Connecticut resident who held a full-time job as a machine operator.\nFriends of both Couture and Caron remain in shock.\n\"I lost two very good friends, one to the court system and one to death\" said Kevin Grady.\n\"It's a total shock,\" said Brian Bellefeur. \"They hung out everyday. We all hung out, stuff like that. It was like a big family.\"\nCouture is being held on $750,000 bond and is under a self-harm watch. He is due in New Britain Judicial District Court on November 8. Police are continuing to investigate."}