{"uri": "http://www.somerset-kentucky.com/news/pulaski-icon-dead-at-age-of/article_b0362494-08ca-11e6-89b3-cfb5a0e36612.html", "title": "Pulaski icon dead at age of 88", "dct": "Sat, 23 Apr 2016 00:00:00 GMT", "id": "83af4df5a8234e54644565cef5e9ea6d", "content": "The public face of a family that triggered the explosive business and economic growth of Somerset and Pulaski County has died.\nWard Correll succumbed late Thursday evening at the University of Kentucky Hospital to injuries from an accidental gunshot wound sustained at his home during the early morning hours of March 9. He was 88.\nMr. Correll, from humble beginnings, amassed a huge fortune; he was a millionaire many times over. A philanthropist, generous to a fault, he gave thousands to charities and youth organizations. The Correll family donated land to Somerset Christian School and is a noted benefactor of University of the Cumberlands (UC) in Williamsburg.\nBut, before all that, Mr. Correll and his family turned the key that opened business and commercial growth in Somerset and Pulaski County.\nMr. Correll built Tradewind shopping center in the mid-1960s, triggering a migration of downtown businesses to the Truck Route, local name for the recently four-laned U.S. 27. At the time, there were about four businesses –– Standard Armature, Cornett’s Machine Shop, Family Drive-In Theater and the popular Finley’s Drive-In Restaurant –– along an eight-mile stretch of U.S. 27 between Somerset and Burnside. Now, U.S. 27 is “restaurant row,” the eateries sporadically spaced among innumerable business and commercial outlets.\nTradewind, anchored by Rose’s 50,000-square-foot shopping experience, was a “wow!” Its glittering shopping aisles were something out of this world for tiny little Somerset with its mostly Mom and Pop type retail outlets.\nMr. Correll loved to tell the story about his shy trip to Rose’s corporate headquarters; how he convinced them to move and expand their downtown Somerset Rose’s to the Tradewind.\nTradewind was a magnet. Businesses began moving to U.S. 27 to take advantage of traffic generated by Rose’s and adjacent stores in the strip shopping center.\nA new advertising base created by Mr. Correll’s Tradewind was a dream come true for George Joplin III and Mrs. Murray K. Rogers, publishers of The Commonwealth and the Somerset Journal. On January 3, 1966, the two weekly newspapers merged into the Commonwealth Journal and began publishing daily. It wouldn’t have happened then, maybe never, had it not been for Mr. Correll’s Tradewind shopping center.\nA few years later, Blaine Correll, the quiet but influential brother of Ward Correll, built Grand Central Place, a big-city-like shopping complex on the south side of U.S. 27. Somerset was on its way to “the growingest city” in Southeastern Kentucky.\nThe late Mr. Correll, with a Bible verse on the tip of his tongue, had a sense of humor. He was a member of “The $250,000 Club” that met daily for coffee at Somerset Lodge, one of Somerset’s first nice motel and restaurant. Fellow members were the late W.O. “Bill” Newell, Clelland Prewitt, Linville Tarter (Mr. Correll’s brother-in-law) and others. Qualifications for a member of “The $250,000 Club:” Have $250,000 or owe $250,000.\nMr. Correll was on black side of the ledger. He had $250,000 and more, due to fantastic success of his Cumberland Lake Shell oil distributorship and other business ventures.\nOften, in his familiar hat, Mr. Correll would greet friends with a dance and wave. A country ham was his favorite way of saying thank-you.\nWard Correll is a household name across Southcentral Kentucky. He has been a financial benefactor to scores of churches, charities, sports teams and organizations including Somerset Christian School — a monument on the school campus memorializes his family’s contribution of land for the school — and the University of the Cumberlands in Williamsburg where the Ward and Regina Correll Science Complex is named in honor of him and his late wife who died June 7, 2008. In 2014, Correll was recipient of the Somerset-Pulaski County’s Distinguished Community Service Award.\nA native Kentuckian, Correll, one of 13 children, was born in nearby Wayne County.\n“Basic living necessities – food, clothing and shoes – were meager,” Correll wrote of his biographical account of his life.\nAfter graduating from high school, with $2.67 in his pocket, he hitch-hiked to Detroit to “make a living.” Mowing lawns to pay for room and board, he swept a warehouse to buy necessities while looking for a permanent job.\nAfter serving his country with the U.S. Army in an intelligence unit during the Korean War, he returned home to Somerset where he married his late wife, the former Regina Tarter. As a couple, their first business was selling bananas in Pittsburgh, Pa. From those humble beginnings he built his business empire.\nOne of Mr. Correll’s favorite philanthropic gifts is the Ward Correll Sports Complex, located in Somerset, where replicas of the Liberty Bell, an iconic symbol of American independence, are placed in testimony to Correll’s love of country.\nMr. Correll has received many accolades, including the 2002 Kentuckian Award presented by the A.B. Chandler Foundation. He was named Outstanding Philanthropist by the Association of Fundraising Professionals Bluegrass Chapter in 2003. Also, in 2003, Correll was presented the Business of the Year Award as the Entrepreneurial Success by Somerset-Pulaski County Chamber of Commerce. He was recipient of the Hal Rogers Leadership Award in 2006.\nAnother building on the University of the Cumberlands campus has been named after the Corrells because of another contribution. In 2010, Correll pledged $1 million toward a $6.5 million facility to promote better health maintenance and improve quality of life not just for students but the community as well.\nThe 5,000-square-feet Ward Correll Health and Wellness Center opened last fall and was officially dedicated on Thursday.\nDr. Larry Cockrum, president of UC, told the Commonwealth Journal that Correll’s son Kirk attended the ceremony in his father’s stead.\n“We really wish he [Ward Correll] could have been there but we know his heart was there,” Dr. Cockrum said. “The friendship he’s had with the University has been tremendous. He really cared for young people and children…What he did was not for his own glory but to help students help themselves.”\nLake Cumberland Funeral Home is handling the arrangements for Mr. Correll, whose visitation will be from 5 p.m. to 9 p.m. Monday evening and 11 a.m. to 2 p.m. Tuesday at the First Baptist Church of Somerset.\nHis funeral will begin at 2 p.m. Tuesday at the church."}