{"uri": "http://www.kctv5.com/story/21807435/2-men-charged-in-umkc-students-murder", "title": "Two men charged in UMKC student's murder", "dct": "Wed, 27 Mar 2013 16:06:00 GMT", "id": "d0c8fcaedfcb4e3bb3979384a57f09b6", "content": "KANSAS CITY, MO (KCTV) -\nProsecutors say two suspects got away with $400, a few cell phones and a small amount of marijuana after killing a UMKC student and left three others wounded.\nAnthony J. Williams, 21, and Alonzo D. Ruff, 20, each face 10 felony charges, including second-degree murder, armed criminal action and assault.\nThe two men are accused of killing 23-year-old Aaron Markarian and injuring three others. The two face 10 years to life in prison if convicted of second-degree murder.\nArmed with a handgun and machete, the two men burst into the home and terrified the eight residents inside, according to prosecutors. One of the victims told police that he knew Ruff from high school.\nThat victim apparently had the small amount of marijuana, according to court documents. He was not shot.\nAccording to police, the two men entered the house near 49th Street and Brookside Boulevard in the South Plaza neighborhood about 11 p.m. last Thursday.\nAccording to court records, Ruff was holding a gun and Williams wore a red mask and carried a machete. Williams held the machete to the neck of the victim that Ruff knew.\nThe suspects ordered seven of those inside the home to sit on the couch. The eighth person inside the home hid in a bedroom, police said. The two suspects said, \"They were going to take everything,\" according to documents.\nThe victims turned over their wallets and smart phones. That is when Williams allegedly put the machete to the one victim's neck and asked for \"the rest of the stuff.\" The victim told police he handed over a baggie containing a gram of marijuana.\nThe suspects appeared to be leaving when Ruff began shooting, prosecutors said. Ruff fired at least five shots as he walked past the couch and out the door into the night, according to court documents.\nMarkarian, of Warrensburg, MO, died at the scene. He was a senior at the University of Missouri-Kansas City's Conservatory of Music and Dance. He had a promising career and had been featured in various publications.\nWilliams told police he and Ruff were driving around talking about finding a place to rob, according to court documents.\nWilliams allegedly confessed to participating in the crime. He told police that he wore a ski mask because he knew some of those inside the residence, according to court records.\nWilliams said he and Ruff split the $400.\nThe seven people who saw Ruff picked him out of a photo lineup, according to court documents.\nProsecutors requested a $500,000 cash bond for each defendant.\nUMKC issued a statement about the charges.\n\"We are grateful for the quick action by the Kansas City Police Department on this shocking crime. Our thoughts are with the family and friends of Aaron Markarian, who we continue to mourn, and with the other members of the community affected by this tragedy,\" the statement says.\nThose who knew Markarian remain devastated that he was killed, especially in such a senseless fashion.\n\"He was really sweet and nice,\" said classmate Savannah Etter. \"It's awful.\"\nThat arrests have been made gave some relief.\n\"That's the scary part, they didn't even take that much from what I've heard. That's so sad they would shoot them,\" neighbor Taylor Hirlinger said.\nAnother neighbor, Spencer White, concurred.\n\"It baffles me to think people could do that to other people,\" White said.\nCopyright 2013 KCTV (Meredith Corp.) All rights reserved."}