{"uri": "http://www.usatoday.com/story/news/nation/2013/06/14/mother-daughters-shot-nashville/2425615/", "title": "Woman, 3 teenage daughters shot in Nashville", "dct": "Fri, 14 Jun 2013 00:00:00 GMT", "id": "9b46c5eb26c1778e918e9370391d20aa", "content": "NASHVILLE, Tenn. (AP) — Nashville police were searching Friday night for a man they said shot his girlfriend and her three teenage daughters at an apartment complex and then fled the scene barefoot.\nPolice said in a news release that 39-year-old Earnest Woodley, who also goes by Earnest Moore, is wanted in the shooting of his girlfriend, 34-year-old Nicole Luke, and her 14-year-old twin daughters inside an apartment. Police said he then shot Luke's 15-year-old daughter as she sat outside in an SUV.\nAll four victims were transported to Vanderbilt University Medical Center and were in stable condition Friday night. Woodley has a previous conviction for second-degree murder in the 1990s in Shelby County, police said.\nArrest warrants were issued charging Woodley with four counts each of attempted homicide and aggravated assault.\nPolice said Woodley is considered armed and dangerous and asked for the public's help for information on his whereabouts.\nAccording to a police news release, the shooting happened Friday afternoon in an apartment complex in the city's Madison neighborhood.\nPolice said \"Woodley and Nicole Luke were reportedly moving to Memphis when they stopped by Woodley's cousin's apartment...to say goodbye.\" They parked two vehicles outside, a U-Haul full of their belongings and a Chevrolet Traverse.\nWoodley, Luke and twins Deona and Keona Luke went inside while Luke's 15-year-old daughter, Kierra Smith, stayed inside the SUV.\nWoodley's cousin told police that the couple argued inside the apartment and Woodley shot Luke and the twins before going outside and firing into the SUV, wounding Smith, the news release said.\nThree other children inside the apartment, including the couple's 3-year-old daughter, were not harmed.\nPolice said Woodley ran into the woods after the shooting, wearing blue shorts and a gray t-shirt.\nThe police department's domestic violence division said it has no prior history on the family.\nThe news release said Woodley's parole expired in 2010. In addition to his murder conviction, he has a long arrest record in Nashville and felony convictions in Shelby County for aggravated assault and cocaine possession, police said,\nCopyright 2013 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}