{"uri": "http://www.charlotteobserver.com/2014/04/14/4841497/grandfather-3-year-old-in-northwest.html", "title": "3-year-old shot himself Sunday, grandfather says", "dct": "Mon, 14 Apr 2014 13:05:00 GMT", "id": "edee669feb9512df10aaa61e0a38a7d1", "content": "The grandfather of a 3-year-old boy found dead in what appeared to be an accidental shooting said Monday the boy shot himself.\nKevin McDuffie, 49, said he was sleeping in his bedroom Sunday afternoon when he heard a gunshot. When he went to investigate, he found his 3-year-old grandson, shot in the head.\n“We had a bad tragedy. He shot himself,” McDuffie said Monday. “When I went in the room, there was the little boy.”\nThe shooting was reported about 1:20 p.m. in the 700 block of Glasgow Road, near Moores Chapel Road in northwest Charlotte. The boy was taken to Carolinas Medical Center and pronounced dead, police said. Officials did not give his name, but McDuffie identified him as Anthony. Police do not believe foul play was involved.\nAnthony’s father, who is also named Anthony, said Monday that shortly before the shooting, he had left to run an errand.\n“I was only gone 20 minutes,” the father said through tears. “He said, ‘Where are you going?’ I said, ‘I’ll be right back, son.’ ”\nIn a frantic three-minute 911 call released by police Monday, an unidentified female begs for paramedics to come to the house as soon as possible.\nWhen the dispatcher asks what happened, she says repeatedly, “I have no idea.”\nMcDuffie said Anthony visited every other Sunday. McDuffie said he looked forward to the visits and enjoyed cooking for 3-year-old Anthony and his other grandchildren.\nMcDuffie said that he has a concealed weapon permit but that he keeps his gun hidden. As of Monday afternoon, police had not said whose gun was used in the shooting.\nAt the time of the shooting, McDuffie said several other family members were also in the house, including one of his sons and another grandchild. His wife was at work, he said.\n“It’s hard for me to even talk on the phone to anybody,” McDuffie said. “I’m feeling really bad.”"}