{"uri": "http://www.whio.com/news/news/crime-law/shooting-reported-near-new-paris-preble-county/njYyK/", "title": "Vigil held in honor of slain 10-year-old girl", "dct": "Tue, 23 Dec 2014 00:00:00 GMT", "id": "e5ebb341e37201d1f1f894bd0951d61f", "content": "KEY POINTS:\nTwo people, including a child, were killed in a shooting in Preble County.\nDeputies said Brian Harleman shot and killed Samantha Carpenter before killing himself.\nCarpenter’s mother, Catherine L. Gessman, was injured in the shooting\nUPDATE @ 5:45 a.m.:\nCatherine Gessman is in stable condition, according to the hospital.\nUPDATE @ midnight:\nSamantha’s friend Charlie Mitchell and Charlie’s mother Angel Lawson made a phone call and a whole community responded.\nDozens turned out for the candlelight vigil at the school where children, parents and others comforted each other.\nFlowers, stuffed animals, written words and several lit candles made up a makeshift memorial in Samantha’s honor.\n“She likes to make people smile all the time and she likes … she likes to fit in all the time and I wanted to do something to make her happy more,” Charlie said during an interview at the vigil. “She made me laugh all the time. And nobody else could.”\nCharlie’s mother said she knows first hand how strong the National Trail Schools and New Paris community can be.\n“This is a very strong and supporting community. I’ve been through tough times. They’ve been there for me,” Lawson said.\nSamantha’s friends described her as a kind and funny friend who will be dearly missed.\nClassmate Jazlin Wallace: “I thought me and Sam would be best friends forever.”\nSamantha’s mother Catherine Gessman was transferred from Reid Memorial Hospital in Richmond to the IU Health Methodist Hospital in Indianapolis.\nHer condition was not available Tuesday night, but her injuries were not believed to be life-threatening.\nUPDATE @ 4:05 p.m.\nSamantha Carpenter attended National Trail School, according to deputies. A candlelight vigil is planned at the school at 7:30 p.m.\nUPDATE @ 2:35 p.m.\nThe Preble County Sheriff’s Office has released the names of two victims in the overnight shooting that left two people dead.\nSamantha Carpenter, 10, was pronounced dead on the scene. Her mother, Catherine L. Gessman, 45, remains hospitalized at an Indiana hospital.\nThe suspect, Brian Harleman, 43, was also pronounced dead in the driveway.\nHarleman was arrested last Wednesday and charged with domestic violence after punching Gessman several times, according to an incident report released by the sheriff’s office. Gessman asked to pursue charges and told the officer she was “scared for her life,” the report states.\nGessman also told the officer on the scene that Harleman had a handgun inside the residence, the report states.\nJustin Ginter, a friend of Gessman, said he believed Harleman had an “emotional snap” after the restraining order was issued last week.\nUPDATE @ 7 a.m.: Preble County Sheriff Mike Simpson released details about the overnight shooting that killed a 10-year-old girl, seriously injured her mother and left the suspect dead.\nThe suspect was identified as Brian Harleman, 43.\nInitial investigation shows that Harleman forced his way into the home, chased the girl and her mother outside and then started shooting at them, according to a news release.\nThe child was pronounced dead at the scene. The girl’s mother was able to call 911 and said Harleman had shot himself in the driveway. He was also pronounced dead in the driveway, the release says.\nHarleman was the mother’s boyfriend and had recently been living at the home, Simpson said.\nDeputies had responded to the home last Wednesday on the report of domestic violence, Simpson said. Harleman was arrested, and posted bond to get out of jail one day later. He was charged with domestic violence and a protection order was issued against him, according to the news release.\nThe girl and her mother have not been identified, pending notification of their family.\nThe mother is now being treated at an Indianapolis hospital because of the seriousness of her injuries. She is expected to survive, Simpson said.\nFIRST REPORT: A 10-year-old girl was killed outside her Preble County home overnight in a shooting that also left the suspect dead, according to Sheriff Mike Simpson.\nThe girl’s 45-year-old mother was also shot, and is expected to survive, Simpson said.\nNeighbors heard the gunshots around 11:50 p.m. in the 7800 block of New Paris Gettysburg Road and called 911.\nSimpson said the child and a man, described as the suspect, were found in the driveway.\nHe did not release any identities.\nHe said there is a history of domestic violence at the house and the suspect is apparently a former boyfriend of the mother, or possibly lived at the house in the past.\nThe woman may have had a protection order against the man, he added."}