{"uri": "http://www.wfaa.com/news/local/dallas-county/breaking-shots-fired-and-officers-down-at-downtown-dallas-protest/266881573", "title": "Five officers killed in downtown Dallas ambush", "dct": "Tue, 24 Jan 2017 00:00:00 GMT", "id": "19438e1dcd0bc2a41a2541618c6c6e7c", "content": "DALLAS -- The sniper who police say targeted officers during a peaceful justice rally Thursday in downtown Dallas has been identified.\nPolice say 25-year-old Micah Johnson, of Mesquite, fired shots that killed five officers and injured seven others. Two civilians were also injured in the shooting.\nAt one point a reservist at the Seagoville Reserve Base, Johnson was described by many as a \"loner,\" police reported in a statement.\n\"We've got a criminal investigation going on and our number one job is to make sure the citizens of Dallas are safe,\" said Mayor Rawlings the day after the shooting.\nThe Thursday rally was organized after two deadly officer-involved shootings. The first involved Alton Sterling, a 37-year-old black male who was shot several times at close range on July 5 in Baton Rouge, La. The second shooting took place the next day in St. Anthony, Minn. On that day, Philando Castile was fatally wounded during a traffic stop and the aftermath was posted live on Facebook by his girlfriend, who was behind the wheel of the car.\nThe night after the Castile shooting, protesters gathered at a park in downtown Dallas. Officers attended the event, where they posted video of demonstrators chanting \"enough is enough.\" Another image posted to their Twitter feed showed an officer holding the hand of Sen. Royce West.\nThe protest then went mobile. It was just before 9 p.m. when shots were first fired from above on Lamar Street near Griffin. In the end, five officers were fatally wounded. Johnson was later killed during a standoff after police were able to track him down inside a parking garage.\nDominique Alexander, with Next Generation Action Network, helped organize the rally. He said the group was devastated and that the event was meant to be peaceful.\nPrior to his death, Johnson told police he was mad at white people after the officer-involved shootings, said Chief David Brown. He wanted to kill white people, especially white officers, Brown said.\nSUSPECT WANTED TO KILL WHITE OFFICERS\nHe also mentioned \"the end was coming\" and that he was \"going to hurt and kill more\" officers. He said bombs were planted all over the garage and downtown.\nAfter negotiations went sour and gunfire was exchanged, officers used a robot to detonate a bomb that killed the suspect, Brown said.\nPolice believe Johnson acted alone.\nAuthorities said they determined through interviews with about 200 officers that at least 12 discharged their weapons during the attack.\nFIVE OFFICERS KILLED\nThe Dallas Police Association announced the fifth officer had died at about 1:45 a.m. Friday. One DART officer and four Dallas police officers were killed.\nThe ambush was one of the deadliest events for police officers in the United States since Sept. 11, 2001.\nThe first DPD officer to be identified was Patrick Zamarripa, of Fort Worth. He was a young father and war veteran.\nWFAA sister station WXYZ in Detroit confirmed the identity of another fatally wounded DPD officer, 40-year-old Michael Krol, who had worked for DPD for nine years after moving to Texas from Michigan.\nOur sister station KBMT in Beaumont says a family member identified the second DPD officer as Michael Smith, 55.\nSources confirmed later Friday that the fourth DPD officer killed has been identified as Senior Corporal Lorne Ahrens.\n\"Our profession is hurting. Dallas officers are hurting. We are heartbroken,\" Chief Brown said in a Friday morning press conference.\n\"Please pray for our strength during this trying time,\" Chief Brown said.\nHe also applauded the \"brave men and women who do this job under great scrutiny.\"\nOne bystander who is not a police officer, Shetamia Taylor, was also shot. She is expected to recover. Details about the other bystander have not been released.\nDART OFFICERS IDENTIFIED\nBrent Thompson, 43, has been identified by DART as its first officer killed in the line of duty. He had worked for DART since 2009.\nDART says the three other officers injured are expected to recover. They have been identified as Officer Omar Cannon, 44, Officer Misty McBride, 39, and Officer Jesus Retana, 32.\nRetana was released from the hospital as of Friday evening.\nFamily says this is DART Ofc. Misty McBride, shot in shoulder tonight but survived and doing ok. @wfaachannel8 pic.twitter.com/xCVsrIf31l\n— Bradley Blackburn (@BLBlackburn) July 8, 2016\n\"As you can imagine, our hearts are broken. This is something that touches every part of our organization. We have received countless expressions of support and sympathy from around the world through the evening. We are grateful for every message,\" Lyons said in a statement.\nA GoFundMe page was set up to help Officer Thompson's family.\nDART said trains are running downtown, but not through the West End station.\nRUMORS OF MORE SUSPECTS\nPolice have since reported they believe Micah X. Johnson acted alone, but that wasn't always the case.\nBrandon Waller, 25, was arrested for unrelated weapons charges at the scene.\nMayor Rawlings said Friday morning that a second suspect, a female, was arrested at about 11:30 p.m. after being involved in a shootout with Dallas police. There is no word yet on whether she is still in custody or how she was related to the ambush.\nTWO ARRESTED AFTER FALSE LEAD\nMeanwhile an officer saw a man wearing camouflage and carrying a bag when he got into a Mercedes and sped off. He went up Interstate 35 before he was pulled over and surrounded by police.\nPolice questioned both occupants of the vehicle before releasing them. The driver told News 8's Demond Fernandez he was just picking up his brother from the bus station and the bag was his brother's luggage.\nEarlier Thursday, Dallas police circulated a photo of what Chief Brown called a \"person of interest\" in the crime. They say that man, Mark Hughes, has since turned himself in and been released. Hughes and his attorney may speak about the situation later on Friday or in the coming days.\nWITNESS ACCOUNTS\nSome of the shooting was captured live on Facebook, as you can see below or at this link (WARNING: Graphic content).\nAn officer at the scene told News 8's Marie Saavedra the shooter had a rifle. She described several volleys of quick bursts of gunfire.\nAnother bystander, Richard Adams, said the protest was \"a lovely, peaceful march,\" until they were walking down Commerce Street near the Bank of America building parking garage when he heard what sounded like \"a bunch of firecrackers going off.\"\nROADS CLOSED AND CLASSES CANCELED\nEl Centro College announced classes would be canceled Friday, and several buildings and roads were closed in the area.\nPortions will still be closed to the public through Wednesday, police said.\nPRAYER SERVICES HELD FRIDAY\nHundreds gathered in Dallas, Fort Worth and other North Texas communities Friday to hold prayer vigils for those affected by the attack.\nMeanwhile a fund to assist the families of the killed officers has been set up. Go here to donate.\nCopyright 2016 WFAA"}