{"uri": "http://thepolicenews.net/default.aspx?act=Newsletter.aspx&category=News+1-2&newsletterid=62087&menugroup=Home", "title": "Dallas Gunman Amassed Arsenal in Home", "dct": "NODATE", "id": "3a457fd549ef46507fa4179670d00e63", "content": "An Army veteran killed by Dallas police after the sniper slayings of five officers amassed a personal arsenal at his suburban home, including bomb-making materials, bulletproof vests, rifles, ammunition and a journal of combat tactics, authorities said Friday.\nThe man identified as 25-year-old Micah Johnson told authorities he was upset about the police shootings of two black men earlier this week and wanted to exterminate whites, \"especially white officers,\" officials said.\nHe was killed by a robot-delivered bomb after the shootings, which marked the deadliest day for U.S. law enforcement since the Sept. 11, 2001, terrorist attacks. In all, 12 officers were shot.\nIn Georgia, Missouri and Tennessee, authorities said gun-wielding civilians also shot officers in individual attacks that came after the two black men died at the hands of police in Louisiana and Minnesota. Two officers were wounded, one critically.\nPresident Barack Obama and Texas Gov. Greg Abbott asked for the public's prayers. In a letter posted online Friday, Abbott said \"every life matters\" and urged Texans to come together.\n\"In the end,\" he wrote, \"evil always fails.\"\nJohnson was a private first class from the Dallas suburb of Mesquite with a specialty in carpentry and masonry. He served in the Army Reserve for six years starting in 2009 and did one tour in Afghanistan from November 2013 to July 2014, the military said.\nAfter the attack, he tried to take refuge in a parking garage and exchanged gunfire with police, Police Chief David Brown said.\nThe suspect described his motive during negotiations and said he acted alone and was not affiliated with any groups, Brown said.\nJohnson was black. Law enforcement officials did not disclose the race of the dead officers.\nThe bloodshed unfolded just a few blocks from where President John F. Kennedy was slain in 1963.\nThe shooting began Thursday evening while hundreds of people were gathered to protest the killings in Baton Rouge, Louisiana, and suburban St. Paul, Minnesota. Brown told reporters that snipers fired \"ambush-style\" on the officers. Two civilians also were wounded.\nAuthorities initially blamed multiple \"snipers\" for Thursday's attack, and at one point said three suspects were in custody. But by Thursday afternoon, all attention focused on Johnson, and Homeland Security Secretary Jeh Johnson said the entire attack appeared to be the work of a single gunman.\nA Texas law enforcement official identified the man killed in the parking garage as Johnson. The official spoke on the condition of anonymity because he said he was not authorized to release the information.\nAround midday, investigators were seen walking in and out of a home believed to be Johnson's in Mesquite.\nIn Washington, the nation's top law enforcement official, Attorney General Loretta Lynch, called for calm, saying the recent violence can't be allowed to \"precipitate a new normal.\"\nLynch said protesters concerned about killings by police should not be discouraged \"by those who use your lawful actions as a cover for their heinous violence.\"\nThe other attacks on police included a Georgia man who authorities said called 911 to report a break-in, then ambushed the officer who came to investigate. That sparked a shootout in which both the officer and suspect were wounded but expected to survive.\nIn suburban St. Louis, a motorist shot an officer at least once as the officer walked back to his car during a traffic stop, police said. The officer was hospitalized in critical condition.\nAnd in Tennessee, a man accused of shooting indiscriminately at passing cars and police on a highway told investigators he was angry about police violence against African-Americans, authorities said.\nVideo from the Dallas scene showed protesters marching along a downtown street about half a mile from City Hall when shots erupted and the crowd scattered, seeking cover. Officers crouched beside vehicles, armored SWAT team vehicles arrived and a helicopter hovered overhead.\nDemonstrations were held in several other U.S. cities Thursday night to protest the police killings of two more black men: A Minnesota officer on Wednesday fatally shot Philando Castile while he was in a car with a woman and a child, and the shooting's aftermath was live streamed in a widely shared Facebook video. A day earlier, Alton Sterling was shot in Louisiana after being pinned to the pavement by two white officers. That, too, was captured on a cellphone video.\nThe Dallas shootings occurred in an area of hotels, restaurants, businesses and some residential apartments only a few blocks from Dealey Plaza, the landmark made famous by the Kennedy assassination.\nThe scene was chaotic, with officers with automatic rifles on the street corners.\n\"Everyone just started running,\" Devante Odom, 21, told The Dallas Morning News. \"We lost touch with two of our friends just trying to get out of there.\"\nCarlos Harris, who lives downtown, told the newspaper that the shooters \"were strategic. It was tap, tap, pause. Tap, tap, pause,\" he said.\nVideo posted on social media appeared to show a gunman at ground level exchanging fire with a police officer who was then felled.\nMayor Mike Rawlings said one of the wounded officers had a bullet go through his leg as three members of his squad were fatally shot around him.\n\"He felt that people don't understand the danger of dealing with a protest,\" said Rawlings, who spoke to the surviving officer. \"And that's what I learned from this. We care so much about people protesting, and I think it's their rights. But how we handle it can do a lot of things. One of the things it can do is put our police officers in harm's way, and we have to be very careful about doing that.\"\nFew details about the slain officers were immediately available.\nFour of the dead were with the Dallas Police Department, a spokesman said. One was a Dallas Area Rapid Transit officer. The agency said in a statement that 43-year-old officer Brent Thompson, a newlywed whose bride also works for the police force, was the first officer killed in the line of duty since the agency formed a police department in 1989.\n\"Our hearts are broken,\" the statement said.\nTheresa Williams said one of the wounded civilians was her sister, 37-year-old Shetamia Taylor, who was shot in the right calf. She threw herself over her four sons, ages 12 to 17, when the shooting began.\nOther protests across the U.S. on Thursday were peaceful, including in New York, Atlanta, Chicago and Philadelphia. In Minnesota, where Castile was shot, hundreds of protesters marched in the rain from a vigil to the governor's official residence.\n___\nAssociated Press writers Terry Wallace, Jamie Stengle, Paul Weber and Emily Schmall in Dallas; Amy Shafer, Sarah Rankin and Benjamin Dashley in Chicago; and Kathleen Hennessey in Warsaw, Poland, contributed to this report.\nCopyright 2016 The Associated Press. All rights reserved.\nPhoto caption:\nThis undated photo posted on Facebook on April 30, 2016, shows Micah Johnson, who was a suspect in the sniper slayings of five law enforcement officers in Dallas Thursday night, July 7, 2016, during a protest over two recent fatal police shootings of black men. (Facebook via AP)\nPost a comment\nName/Nickname:\n(required)\nEmail Address: (must be a valid address)\n(will not be published or shared)\nComments: (plain text only)"}