{"uri": "http://www.shreveporttimes.com/story/news/nation/2016/07/11/dallas-focused-healing-after-deadly-rampage/86942116/", "title": "Police study 170 hours of body cam footage in Dallas shooting", "dct": "Mon, 11 Jul 2016 00:00:00 GMT", "id": "411447bdcf849ea35fc84e44172559ad", "content": "Eleven police officers fired their weapons and two officers used an explosive device trying to stop an Army veteran's deadly shooting rampage during a protest in Dallas last week, Police Chief David Brown said Monday.\n\"We're going to turn over every rock\" to make certain Micah Xavier Johnson, 25, was the lone gunman who killed five police officers and wounded nine others Thursday in downtown Dallas.\n\"I want to make sure there isn't somebody else out there that has something to do with this,\" Brown said.\nJohnson was cornered in a parking garage and killed by a remote-controlled robot's bomb following a two-hour standoff with police.\nBrown said investigators are still downloading more than 170 hours of body camera footage from officers and were collecting dashcam videos and video from surrounding businesses.\nBrown said a large stockpile of bomb-making material was found in Johnson apartment, adding that a bomb tech said Johnson clearly was not a novice. Brown said he believes Johnson learned about explosive online, but he said that was also being investigated.\nInvestigators were still going through Johnson's laptop, journals, cellphones and other effects to learn more about his motive and plans. Investigators believe he had been planning a much larger attack targeting officers.\nBrown and Dallas County Judge Clay Jenkins say Thursday's protest, prompted by recent shootings of African-American men by police in Minnesota and Louisiana, may have motivated Johnson to act sooner than he had planned.\nJohnson had scrawled the initials \"RB\" in blood in two locations after he was trapped in the garage. Brown said authorities are still trying to determine the meaning of the letters.\nBrown stressed that the murder and violent crime rates in Dallas have been down sharply in recent years. He said the city remains committed to community policing. But he said the department has been hamstrung by low pay that had led to officers leaving for departments that pay better.\n\"Don't be a part of the problem. We're hiring,\" Brown said. \"Get out of the protest line and put an application in. We'll put you in your neighborhood.\"\nHe warned that it can be thankless job. But for many officers, the rewards are worth the difficulties, he said.\n\"I love serving,\" Brown said. \"Out of all the crap we have to take as police officers, the satisfaction you get from serving is ... gratifying.\"\nPhysicians at Parkland Memorial Hospital, which treated victims from the rampage, discussed the emotional pain of that night.\nTrauma surgeon Brian Williams, who is black, said he understood the anger many blacks feel for police officers. He said he was deeply affected by the shootings in Louisiana and Minnesota. But he said he also felt deeply for the families of the officers shot by Johnson.\n\"That I was unable to save those cops when they came here that night, it weighs on my mind constantly,\" Williams said. \"This killing has to stop.\"\nJohnson's parents broke their silence in an interview released by The Blaze. His father, James, said Micah Johnson had been disappointed with his time in the military. His son then began studying black history and expressing interest in his heritage.\nMicah Johnson never expressed hatred for white people or any other race, Johnson said.\n“I don’t know what to say to anybody to make anything better. I didn’t see it coming,” Johnson said. “I love my son with all my heart. I hate what he did.”\nDallas slowly began trying to regain normalcy Monday. The George L. Allen Sr. Civil Courts Building and the Dallas County Administration Building, along with a nearby museum and records building, reopened for the first time since Thursday's tragedy. Some streets remained closed, however, as the investigation was continuing.\nPresident Obama cut short a visit to Spain and will visit Dallas on Tuesday to attend an interfaith memorial service.\nSeveral Black Lives Matter protests held over the weekend focused on shutting down interstates to draw attention to the plight of African-Americans being unjustifiably arrested and killed by authorities. Hundreds of people were arrested and dozens of officers were injured."}