{"uri": "http://www.nbcbayarea.com/news/local/SFPD-Investigate-Shooting-Near-San-Francisco-School-1-Hurt-397519091.html", "title": "Police Search for 4 Suspects After 4 Students Shot Outside San Francisco School", "dct": "Tue, 18 Oct 2016 00:00:00 GMT", "id": "0e74aed9eaf4a79a17520c07799fb61d", "content": "Classes at a San Francisco high school are set to resume Wednesday after four students were shot just outside the campus, prompting a lockdown and sending waves of panic through local parents and students.\nPolice continue to search for four suspects tied to the shooting reported Tuesday afternoon at the parking lot of June Jordan School for Equity, which is located in the city's Excelsior District.\nPolice said at least three students were shot outside as school was dismissed for the day at around 3:15 p.m. A fourth victim, a male student, walked into the Bayview Police Station in San Francisco hours later with a gunshot wound. All four were students at the school. All four students are 15 years old.\nFour male suspects, unaffiliated with the school, approached the campus on foot targeting a student for reasons that are currently unclear, police said. One of the suspects pulled out a gun and began shooting at two male students and a female student, who suffered a life-threatening injury. All three students ran back into the school after they were shot. They were transported to San Francisco General Hospital.\nThe four suspects, who were all wearing black hoodies, were last seen running away on Brazil Avenue, police said.\nSan Francisco Unified School District officials said the school immediately went on lockdown after the gunshots were fired because of fears of an active shooter. The lockdown was lifted after the scene was declared safe by police shortly after 4 p.m.\nParents and grandparents came rushing to the school looking for their students after the scene was cleared.\nDuring the initial response, a swarm of police squad cars responded to reports of shots fired at Brazil and La Grande avenues.\nStudents were too shaken to speak on camera to NBC Bay Area, but said they heard what sounded like fireworks right when school was letting out. Dozens of students came running back into the school.\nPolice said classes at June Jordan High School will resume Wednesday and counselors will be available for students. Extra security will also be on campus Wednesday, school officials said.\nThe scene where the shooting took place, 325 La Grande Ave., is the address for the June Jordan High School as well as City Arts And Tech High School.\n#SFPD investigating shots fired @ Brazil & La Grande. 1 Confirmed victim. Shelter in place. SFPD searching for suspect. pic.twitter.com/8gYb9Vi3q7\n— San Francisco Police (@SFPD) October 18, 2016\nSFPD says three students shot at June Jordan School for Equity as school let out. pic.twitter.com/ML4lmUQ2Va\nIncident @ June Jordan HS & schl on lockout @ 3pm. SFPD declared school safe & lifted lockout @ 4pm. Investigation ongoing. Updates to come\n— SF public schools (@SFUnified) October 18, 2016"}