{"uri": "http://www.nola.com/crime/index.ssf/2015/05/bourbon_street_shooting_appeal.html#incart_river", "title": "Bourbon Street shooting suspect wants access to witnesses for self-defense claim", "dct": "Tue, 26 May 2015 17:51:32 GMT", "id": "fc6504cc61f024c4f7e79d7115f0a6fd", "content": "The lawyer for Trung Le, the man accused of starting a 2014 Bourbon Street gunfight that left one bystander dead and nine injured, says that his client opened fire only after another man pointed a .40-caliber pistol at him and his friends.\nThe problem with building Le's case for self-defense is finding witnesses to back up his story, because prosecutors have blacked out the names of bystanders on police reports, Le's lawyer told a state appeals court panel Tuesday (May 26).\n\"I believe I will find people who saw the unknown terrorist,\" said attorney Martin Regan, who referred to the second shooter as \"the Bourbon Street terrorist\" throughout the hearing before a three-judge panel of the 4th Circuit Court of Appeal in New Orleans.\nLe's friends have testified to Le's version of the story in hearings in Orleans Parish, where Le faces charges of manslaughter and attempted second-degree murder, but Regan said there were likely others on the crowded stretch of Bourbon Street who would confirm his version of the prelude to the shootout.\n\"I am looking for witnesses that corroborate (Le's story),\" Regan said, \"or else what you're going to hear in closing argument is 'you can't trust these people, they're all Trung Le's friends.'\"\nOrleans Parish Assistant District Attorney Kyle Daly said the prosecution is familiar with Le's version of the events of June 29, 2014, when Le exchanged gunfire with the unknown second man. But, Daly said prosecutors fear for the safety of witnesses and state law allows them to shield their names until they are called at trial.\n\"They agree that Mr. Le shot first,\" Daly said, noting that the defense characterizes Le's quick trigger as self-defense.\n\"We do not believe ... that is what happened. We believe Mr. Le started this.\"\nJudges Roland Belsome and Paul Bonin seemed troubled by the prospect of balancing Le's right to fair trial against state law that sets a low bar for prosecutors to withhold the names of witnesses they think are at-risk. Belsome asked if there had ever been a constitutional challenge to the way the state has handled similar cases.\n\"The description of this particular incident sounded like something out of the OK Corral, it's very disturbing,\" Belsome said. \"But what do we do? The circumstances you're describing lead us into a Star Chamber sort of prosecution.\"\nAssistant District Attorney Laura Rodrigue said that Le's friends had testified several times during hearings in the trial court, and that their testimony seemed menacing.\n\"The testimony of several witnesses became very aggressive ... they said they would seek out justice for their friend ... and would seek out witnesses,\" Rodrigue said.\nJudge Max Tobias asked Regan why the DA's office shouldn't assume Le and his friends are dangerous, even given the version of the shootout Regan repeated throughout the hearing.\n\"Why is it not appropriate to think that a person who goes into the French Quarter at that time of night, carrying a pistol ... is not dangerous?\" Tobias asked.\nRegan responded with another recounting of the surveillance video that captured events leading to the shootout. The tape, Regan said, showed the unknown second shooter walking down Bourbon Street past Le and his friends, and then drawing his weapon.\nLe's friends have said the unknown shooter said \"I got a .40 for you\" as he cocked the gun and raised it toward them, Regan said.\nLe, who had no prior criminal record, was allowed to carry a gun and was on \"equal footing with a police officer\" to draw his weapon \"when somebody points a gun in your face and cocks it.\"\n\"Surely we wouldn't be here if this had been a police officer\" who had been in Le's situation, Regan said.\nRegan said that if the judges share prosecutors' concerns about witness safety, they could release the names of witnesses to him under seal.\nJudge Tobias seemed concerned about setting that precedent.\n\"I think we all know there are certain attorneys who might be inclined to release that information,\" Tobias said.\nWhen the panel may issue their ruling was unclear. Le's trial, which had been set for February, has been delayed while his appeal is pending."}