{"uri": "http://www.dailypress.com/news/crime/dp-6-dead-in-chesapeake-murder-suicide-20160128-story.html", "title": "Fifth victim in deadly Chesapeake shooting identified as gunman's 74-year-old grandmother, police say", "dct": "Thu, 28 Jan 2016 14:31:00 GMT", "id": "b7d92556d4d5f9be600a715c2880134f", "content": "Police have identified the fifth person believed to have been shot and killed by a 26-year-old Chesapeake man as the gunman's paternal grandmother.\nThe woman was positively identified as Doris Dooley, 74, of the 1400 block of George Washington Hwy, police said in a news release Friday.\nNo further information has been released.\nPreviously, Jan. 28, 2:30 p.m.\nPolice believe a 26-year-old Chesapeake man killed five members of his family and then shot and killed himself.\nThe gunman was identified as Cameron Dooley, of the 1400 block of N. George Washington Highway in Chesapeake. Dooley is the son of retired Chesapeake Police Officer Steven \"Todd\" Dooley, who was one of five killed Wednesday night or Thursday morning, police spokeswoman Kelly O'Sullivan said in a news release.\nSteven \"Todd\" Dooley, 50; Lori Dooley, 54; Landon Dooley, 22; and Brooke Dooley, 17; of the 2300 block of Wildwood Road were identified as victims of the deadly shooting. A fifth victim, an adult female, has not yet been positively identified, O'Sullivan said.\nAll six people suffered gunshot wounds, she said.\nLandon Dooley was found dead by police at his residence shortly after 3:30 Wednesday. While investigating the death, police were led to a residence in the 1400 block of N. George Washington Highway about 7 p.m., O'Sullivan said.\nThere, police found his brother, Cameron Dooley, who was armed inside the residence. Officers negotiated with him for several hours before they were able to enter the home, O'Sullivan said. They found the others dead inside the home just after 2 a.m. Thursday, she said.\nNo additional information about the incident has been released.\nPreviously: Jan. 28, 11 a.m.\nChesapeake police said six people have died following a murder-suicide Wednesday.\nAbout 3:35 p.m., officers were dispatched to the 2300 block of Wildwood Road in order to check on the welfare of an individual, said Master Police Officer Kelly O'Sullivan.\nUpon arrival, police found one person dead inside.\nFurther investigation led officers to a home near the intersection of George Washington Highway and Wintergreen Drive, where they encountered an armed person barricaded inside, O'Sullivan's said.\nAfter negotiating for several hours, officers entered the home and found the person dead along with four others.\nEveryone who died appeared to be related and killed by the person police negotiated with, police said.\nPolice have not released additional information at this time."}