{"uri": "http://www.usatoday.com/story/news/nation-now/2016/01/28/virginia-murder-suicide/79449192/", "title": "Police: 6 dead in domestic murder-suicide in Virginia", "dct": "Thu, 28 Jan 2016 00:00:00 GMT", "id": "bc798e8484a44b1294bafd31e4e961ff", "content": "CHESAPEAKE, Va. — Police in Virginia found six people dead in what they believe to be a domestic murder-suicide case. The discovery came after officers tried negotiating with an armed suspect, officials said Thursday.\nPolice have identified five of six family members killed in the incident.\nThe deaths were found in two locations in Chesapeake, a community in the southeastern part of Virginia about 24 miles west of Virginia Beach.\nPolice say they were first called to a home Wednesday around 3:35 p.m. to perform a welfare check. Upon arrival, they discovered the body of 22-year-old Landon Dooley, who lived in the home with his parents and sister.\nA block away at the home of Dooley’s grandmother, an armed person later identified as 26-year-old Cameron Dooley was barricaded inside. Cameron and Landon are brothers.\nA police spokeswoman says officers negotiated with the suspect for hours before they made their way inside early Thursday morning. There officers found five more bodies, including Cameron Dooley's.\nPolice identified the other victims as the Dooleys’ parents, Steven Todd Dooley, 50, and Lori Dooley, 54, as well as their sister, Brooke Dooley, 17. The name of the sixth family member, a woman, was not immediately released. Their deaths were ruled homicides.\nInvestigators believe the five victims were dead before police arrived and began negotiating with Cameron Dooley.\nFriends and neighbors say the Dooley family was prominent in the community and members of the Temple Baptist Church of Chesapeake.\n“They were just really good Christian people,” neighbor Desiree Darst said in a telephone interview. “I knew them my whole life. We’re all in shock.”\nNeighbors say the father, Steven Todd Dooley, was a Chesapeake police officer with the Marine Dive Unit who recently retired. He went to work at Lynnhaven Dive Center in Virginia Beach as a repair technician.\n“Todd was a good man and a hard worker — a family man and a very religious man,” said Blake Hughes, the dive shop’s service manager. “It’s sort of hard to wrap our brains around what happened.”\nHughes said his wife is a nurse, so Dooley talked to him about daughter Brooke’s participation in the nursing education program at Deep Creek High School. Dooley never mentioned any problems with any of his children, Hughes said.\nNeighbors also said they never had any hint of trouble in the Dooley family.\n“The family had a wonderful reputation,” said Judith Styron, who has lived in the neighborhood for 21 years.\nContributing: The Associated Press"}