{"uri": "http://www.newsherald.com/article/20150708/news/307089950", "title": "State Attorney: No charges for father in child's shooting death", "dct": "Sat, 28 Jan 2017 14:32:01 GMT", "id": "9231b4b122918683aab4d7d14985d48e", "content": "PANAMA CITY -- A man who was arrested in connection with the accidental shooting death of his 6-year-old daughter will not face criminal charges, officials announced Wednesday.\nPANAMA CITY -- A man who was arrested in connection with the accidental shooting death of his 6-year-old daughter will not face criminal charges, officials announced Wednesday.\nProsecutors said they will not pursue criminal charges against 29-year-old Evan Hernandez of Panama City for the shooting death of his daughter, Izabella Votta.\nHernandez was in his apartment \"practicing form in front of a mirror\" with a loaded handgun on May 3 when it accidentally discharged. The bullet went through the mirror and a wall and struck his daughter in another room.\n--- MORE: MOM DECRIES DECISION»»\n--- DOCUMENT: READ THE FINDINGS AND EXPLANATION OF NO CHARGES»»\nHowever, the circumstances of the incident did not meet the legal threshold for the state to pursue charges, prosecutor Bob Sombathy wrote in his review of the case.\n\"I am of the opinion that these facts do not meet the legal threshold necessary to sustain a manslaughter charge,\" Sombathy wrote. \"The facts show that this was an accidental shooting which led to the tragic death of Izabella. Although accidental, the father of a young child will have to live with the tragic results of his actions forever.\"\nSombathy said in his report that culpable negligence also was ruled out. Hernandez had no animosity toward his daughter, had no criminal history, was extremely remorseful following the incident and, most importantly, he attempted to ensure the handgun was not loaded, according to Sombathy.\n\"Hernandez unloaded the magazine on the weapon believing the weapon was made safe, forgetting there was a single bullet in the chamber,\" he wrote. \"If there was evidence he intentionally fired the weapon, the result of this review would likely be very different.\"\nThe shooting occurred about 10:30 a.m. at Andrews Place Apartments at 1914 Frankford Ave.\nPCPD officers arrived after they received a 911 call that a child had been shot.\nNeighbors said they heard the scuffling of what sounded like children's feet overhead from their apartment moments before they heard a single gunshot. A short time later, they said they heard Hernandez wailing from his third-floor balcony as emergency crews were called.\nVotta was taken to Bay Medical Center Sacred Heart Health System, where she died, police said.\n\"It appears the shooting was accidental,\" PCPD said in a news release after the incident.\nIn a court document filed after the shooting pertaining to emergency custody of Votta's surviving brother, Hernandez said he was \"practicing form\" when the gun discharged.\nThe bullet went through the mirror and into another room before fatally injuring the 6-year-old, court documents indicated.\nHernandez and Cynthia Votta, Izabella's mother, had been engaged in a heated custody battle for her and her brother since 2011.\n--- MORE: MOM DECRIES DECISION»»\n--- DOCUMENT: READ THE FINDINGS AND EXPLANATION OF NO CHARGES»»\nIn a court document filed after the shooting regarding emergency custody of their son, Cynthia Votta said that she believed Hernandez was extremely careless with the life of their daughter. She told investigators, however, she did not believe the shooting was on purpose, Sombathy reported.\nThe court found that since Hernandez was not being charged in a criminal investigation, the younger son would remain in his custody, according to court documents.\n\"The facts of the case are tragic,\" he wrote. \"All the evidence in this case suggests the firing of the gun was accidental. Izabella was not even in the same room when her father trigger tested the gun. Mr. Hernandez immediately sought help after he checked on his daughter, and he showed extreme remorse and guilt that one would expect from such a tragic event.\""}