{"uri": "http://www.stltoday.com/news/local/crime-and-courts/st-louis-police-seek-white-suv-in-shootings/article_2b4dcbcb-f885-5c96-b41f-bdf5a9674c98.html", "title": "St. Louis police seek white SUV in shootings", "dct": "Fri, 25 Jan 2013 00:00:00 GMT", "id": "9c42cf00ca6ca75c03c2d7740e1b198e", "content": "ST. LOUIS • Four men coming from a repast to honor a slain friend were shot, one fatally, when their car was raked by gunfire late Friday afternoon from another vehicle, near Riverview Boulevard and West Florissant Avenue.\nRelatives who gathered at police headquarters said Terry Robinson Jr., 28, of St. Louis, was killed in the attack. Police said the others were expected to survive.\nRobinson had been recovering after being shot in the back at Broadway and Riverview just last weekend, according to his father, Terry Robinson, 56.\nHe said his son and the others had been at a post-funeral meal. He said the younger Robinson was on disability with a job injury. Friends said the dead man had two young sons.\nPolice said the funeral had been for Deangelo Blackmon, 19, found shot in the chest and torso Jan. 12 in an alley behind the 5000 block of Sherry Avenue. Blackmon lived in the 4100 block of Dressel Avenue. It was unclear how or whether the attacks might be related.\nOfficers were put on alert Friday evening for potential gang retaliation.\nTerry Robinson Jr. had been among four men in a gold Chevrolet Malibu, with an Illinois temporary license plate and a funeral procession tag, when someone opened fire from a white SUV, perhaps a Chevrolet Tahoe or Cadillac Escalade, about 4:50 p.m. Four men were believed to be in the SUV; one may have had an AK-47 rifle.\nOne of the victims, wounded in the hand, was found near the shooting scene, at Riverview and West Florissant. Another was found in the area of Bircher Boulevard and Geraldine Avenue, hit in the head but conscious and breathing. The Malibu, carrying Robinson and the remaining man, pulled into a Phillips 66 service station at Lillian Avenue and Goodfellow Boulevard, where help was summoned. Robinson was pronounced dead in an ambulance there.\nAnother fatal shooting followed about 8:30 p.m. in the 2000 block of East De Soto Avenue, where a man’s body was found in a vacant lot. Police said that, at least initially, the shooting did not appear to be linked to Friday’s earlier attack. A man with a rifle was seen fleeing the De Soto scene in a bright red car that may have been a Pontiac Grand Prix."}