{"uri": "http://abc30.com/news/police-investigating-2-separate-shootings-in-the-same-area-in-northwest-fresno/1513145/", "title": "Police investigating 2 separate shootings in the same area in Northwest Fresno", "dct": "Fri, 16 Sep 2016 00:00:00 GMT", "id": "31dc3c8ad757540c9de0affbe6d85183", "content": "FRESNO, Calif. (KFSN) --\nSome people who live in a Northwest Fresno neighborhood are fed up with recent gun violence. On Thursday the area of Fairmont and Marks avenues had two shootings within eight hours.\nOne resident of the neighborhood said, \"I'm thinking about packing up and moving off of this block because there's nothing good that comes from here.\"\nNext to the mother of four son's Batman poster in his bedroom is a bullet hole. It-- along with this one over her bed-- was not there when she left for work Thursday.\n\"Now I've got to be in fear of my kids' life on top of my own.\"\nFresno Police said a group of young men next door to the woman's apartment accidentally fired a handgun while smoking marijuana. A 16-year-old man was shot in the back and taken to the hospital.\nThe shooting, though, was the second of the day on the street.\nAt 5:30 a.m. police found a 30-year-old man in a nearby alley who had been shot as well.\n\"This is not something to be concerned. This is not an issue of violence running ramped-- residents feel safe in their neighborhood,\" said Lt. Joe Alvarez, Fresno Police Department.\nIn a neighborhood where kids are often spotted waiting on the ice cream truck and riding scooters down the street-- crime scene tape and bullet casings on the ground are big concerns for families.\n\"In the seven months I've been here we've had five shootings,\" said a neighbor.\nEvidence of that is marked on the apartment buildings' windows and garages.\n\"And we need help we need somebody to help us clean up this neighborhood.\"\nWe spotted police out patrolling both in cars and on foot. Residents are just hoping this will become a permanent thing.\n\"The only reason the police is here today is because we had two shootings and that's the only reason. Other than that you don't see them unless somebody calls,\" said a neighbor.\nThe victim in the first shooting is said to have serious injuries. The victim in the second shooting-- the one that was accidental-- is expected to recover."}