{"uri": "http://www.stargazette.com/story/news/local/2016/07/28/reported-shooting-elmira-tavern-man-sought/87649530/", "title": "Police ID person of interest in Elmira shooting", "dct": "Thu, 28 Jul 2016 00:00:00 GMT", "id": "1b3e07076c2bec4db4dab6d0beff8365", "content": "Elmira police are asking the public to help them locate a person of interest in connection with a shooting that injured five people at Patrick's bar in the city early Thursday.\nPolice are looking for Zecary L. Banks, 27, of Elmira. Banks is a black male, 6-feet-1-inch tall and about 220 pounds. He was last seen wearing a black shirt, light-colored shorts and a baseball cap.\nThe shooting occurred at 12:47 a.m. in the popular bar at 303 College Ave.\nOne of the victims was discharged from a hospital Thursday morning. Four others remained hospitalized late Thursday afternoon.\nTwo were at Arnot Ogden Medical Center and two were at St. Joseph's Hospital, according to Elmira police spokesman Sgt. William Solt, who didn't know their conditions as of Thursday afternoon.\nPolice are still piecing together what happened, but the investigation led them to identify Banks as someone they wanted to question.\n\"As far as a motive, we're unsure at this point. When officers responded to the scene, it was chaotic at first,\" Solt said. \"People scattered. We're still trying to figure out what transpired. We've identified Banks as a person of interest at this point. We believe he was with other individuals. Our investigation so far leads us to believe this was not random.\"\nSolt said the weapon used was a handgun but couldn't offer any more information about it.\nA witness, Shawn Drum, of Elmira, said he saw two people taken away, one by a police car and another in an ambulance. He said one of the wounded victims was a friend of his.\n“Someone in a dark shirt with a red hat on and they shot, I would say, six shots right inside the door,” Drum said. “I wasn’t paying attention when he came in, I just heard bang, bang, bang, bang, bang, bang and then he was gone. I didn’t see anyone get hit but I know people did.”\nDrum, who was inside the bar near the front window to the left of the entrance door, said he got a clear view of the shooter.\n“He was shooting in towards the bar,” Drum said. “I was tucked in the corner and he was more just like (shooting) straight through the bar.\nDrum estimated that more than 40 people were in the bar at the time.\n“I jumped in the back corner and laid down and a couple other people did too,\" Drum said. \"I saw him flee and someone else said he jumped in a Jeep.”\nShortly after 1 a.m., police broadcast Banks' name on police radio as a person of interest in connection with the shooting. Police released his name to the public late Thursday afternoon.\nA sign on the front door of Patrick's said the bar would be closed Thursday and would reopen at 3 p.m. Friday.\nPolice are asking anyone with information about the incident or Banks' whereabouts to call the Elmira Police Department at 607-737-5626, or the anonymous tip line at 607-271-HALT."}