{"uri": "http://wate.com/2016/02/04/11-year-old-found-guilty-of-murdering-white-pine-elementary-student/", "title": "11-year-old found guilty of murdering White Pine elementary student", "dct": "Thu, 04 Feb 2016 14:41:00 GMT", "id": "f0b3643632d6d3e5262e9ff69c380cce", "content": "WHITE PINE (WATE) – An 11-year-old boy has been sentenced to spend the rest of his childhood in custody after he was found guilty of the murder of an 8-year-old girl.\nA Jefferson County Juvenile Court judge found Benjamin Nicolas Tiller guilty of the murder of MaKayla Dyer, according to court documents. He was placed into custody by the Department of Children’s Services until he reaches his 19th birthday.\nMaKayla Dyer, a student at White Pine Elementary, was killed October 3, 2015, outside her home. Juvenile Judge Dennis “Will” Roach II, who presided over Tiller’s case, wrote in a court order that he was playing with MaKayla Dyer, her 11-year-old sister and her friend when he asked her to retrieve her puppies. After she said no, he went inside and came back with a 12 gauge shotgun and a bb gun, telling the girls he had guns.\nMore online: Read the court order [PDF]\n“The victim then laughed at Mr. Tiller, and stated that she believed they were not real,” read the court documents. “Tiller then made certain the gun was loaded, cocked the hammer of the gun, and shot the victim just above the heart” from inside the window.\nDyer fell backwards and was later confirmed dead.\nPrevious story: 8-year-old White Pine girl’s puppies search for her after she’s shot, killed\n“The mother of the child knelt on the ground and picked her child up, placing her child in her arms as she passed away,” wrote Judge Roach in the order. After the shooting, Tiller’s great grandparents claimed another child shot MaKayla Dyer, but according to the court order the boy actually threw the gun out the window to another child who picked up the gun, attempted to hand it back to him and then set it down on the ground. Tiller then reportedly laughed at the girls.\nPrevious story: Family says 11-year-old didn’t shoot and kill 8-year-old White Pine girl\nJudge Roach said Tiller had been trained in firearm safety and had been taken hunting by both his father and grandfather.\nJudge Roach concluded his order by stating that Tiller is in “desperate need of help,” and our society has a great need for him to receive it. “A child who commits first-degree murder cannot be willy-nilly turned loose into society,” read the order.\nTiller’s great grandmother’s told WATE 6 On Your Side they plan on appealing the ruling.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}