{"uri": "http://wdtn.com/2014/09/03/apparent-double-murder-suicide-in-springfield/", "title": "Police: Mom kills sons, turns gun on herself", "dct": "Wed, 03 Sep 2014 09:04:00 GMT", "id": "6753373d2262c4ca21ecc2fc0681eee7", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nSPRINGFIELD, Ohio (WDTN) – Springfield police say all evidence leads investigators to believe that a woman shot her two sons then turned the gun on herself Wednesday morning in Springfield.\n“It’s a tragedy for this community and certainly a tragedy for the family,” said Springfield Police Chief Steve Moody. “Family members are clearly distraught.”\nChief Moody says police were called to 727 Burt Street just before 8:00 a.m. Wednesday morning. He says the children’s father arrived at the home to take his sons to school. The father went into the house and found the two boys and their mother shot.\nPolice arrived at the scene three minutes after Arthur Johnson called 911.\nThe mother, 32-year-old Rachel Johnson, and 7-year-old Daylan Johnson were pronounced dead at the scene. 10-year-old Ayden Johnson was flown to Dayton Children’s Hospital where he died a short time later.\nMoody says the investigation is in its early stages, but he says it appears this is a case of murder, suicide. The coroner must make a final ruling.\n“When children are involved, it’s always close to all of our hearts,” said Chief Moody. “We need to put that aside and help the family.”\nChief Moody updates media on murder-suicide\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nFriends tell 2 NEWS they are shocked.\n“Don’t let the devil make you walk away from that. You keep your eye on The Lord and you pray and remember that God loves you,” said Vicki Harkins, family friend. “The family is devastated, just devastated.”\nVicki remembers Aiden because of the smile that was always on his face.\n“(He was) Smart. Friendly. Talked.” she added, “When I seen that child he has a smile on his face and he’d always tell across the street–Hi Vicki!”\nA neighbor of the Johnson’s, Dedra Spurgeon says she has children, and doesn’t understand why a mother would kill her sons.\n“I can’t imagine. I can’t imagine any mother taking her life, and her child’s. If you’re going to take your life, take yours not anybody else’s,” she said.\nAccording to court documents, Arthur and Rachel Johnson were married for nearly one year. Family members say the two were together for more than 11 years. During the 911 call, Arthur mentioned the two were separated, but were hoping to work things out.\nSchool district launches crisis team\nThe boys attended Warder Park Elementary. The school released a statement that reads:\n“The Warder Park Wayne Family, the Springfield City School District, and our entire community has been struck by tragedy this morning. We are deeply saddened, and frankly, shocked by the terrible news we received from the police this morning.”\nThe district says a full district crisis team is at the school providing counseling to students, family and staff. A therapy dog was also at the school to offer comfort. Superintendent Dr. David Estrop says substitute teachers were made available so that any teacher who needed to get grief counselling could.\n2 NEWS spoke with Superintendent Estrop today.\n“We have had a number of tragic events and it’s require much work on the part of our team an community to help everyone cope with these tragedies,” Estrop said.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}