{"uri": "http://www.whio.com/news/news/crime-law/police-respond-report-possible-murder-suicide/nhFBy/", "title": "Coroner reveals preliminary Johnson autopsy results", "dct": "Tue, 09 Sep 2014 00:00:00 GMT", "id": "6c340bd3da6d36226afc255349d2d534", "content": "— KEY POINTS:\nThe preliminary death certificates for Rachel and Daylan Johnson were completed this week.\nArthur Johnson discovered his two sons and estranged wife shot in her Springfield home Wednesday morning\nRachel Johnson shot her sons and turned the gun on herself, police said.\nJohnson told a 911 dispatcher his wife was lying on a bed between the boys with their \"wedding pictures all over the floor.\"\nThe couple, married for one of the 11 years they were together, reportedly were separated but trying to \"work things out.\"\n9/9 UPDATE @ 4:45 p.m.-\nThe preliminary death certificates are complete for Rachel and Daylan Johnson, according to the Clark County coroner.\nDr. Richard Marsh said Rachel Johnson's death was ruled a suicide by gunshot wound and Daylan's death a homicide by gunshot wound.\nMarsh said toxicology reports are being conducted on both Rachel and Daylan to detect any sort of drugs or alcohol in their systems. These tests are ongoing and could take up to eight weeks to complete, Marsh said.\nThe Montgomery County coroner's office was completing Ayden's autopsy.\nFIRST LOOK-\nA Springfield father went to a Burt Street home to pick up his two sons for school Wednesday morning and found a horrific scene, discovering his wife and the boys shot on a bed surrounded by wedding photos on the floor.\nInvestigators believe preliminary evidence shows Rachel Johnson, 32, killed her sons Ayden, 10, and Daylan, 7, then apparently took her own life, Springfield Police Division Chief Stephen P. Moody said.\nThe Clark County coroner's office will make the final determination on the cause of their deaths, Moody said.\n\"You have to understand this is a fluid investigation,\" he said. \"We still have a lot of follow-up to do.\"\nThe father, Arthur Johnson, 39, made a distraught call for help to 9-1-1 and told the dispatcher that he discovered the scene when he arrived Wednesday morning to take the boys to school. He said he found the mother and the younger boy, Daylan, already dead in the home and his older son, Ayden, may have had a pulse.\nAyden was transported to Springfield Regional Medical Center, and then to Children's Hospital in Dayton, where he died.\n\"When there are children involved, it's always close to all of our hearts,\" Moody said.\nSpringfield police worked with Springfield City School District officials to get a crisis team to the boys' school, Warder Park-Wayne Elementary School.\nAlthough there's some sense of \"finality\" to the incident because it appears to be a murder-suicide, Moody said police will continue to gather facts by talking to witnesses and family members, as well as analyze forensic evidence.\n\"It's a tragedy for the community this morning and for a family,\" he said.\nHe declined to discuss the type of gun used. Investigators didn't say when or how she obtained the gun.\nNeither she nor Arthur Johnson have registered for a concealed carry permit from Clark County.\nArthur Johnson and his wife went through a separation, he told 9-1-1 dispatchers, but they were trying to \"work things out.\" His wife's truck had broken down the day before.\n\"I was supposed to pick up the boys for school in the morning,\" Johnson said. \"I'm going into the house, and she killed the boys and killed herself ... I can't believe this.\"\nJohnson told the dispatcher his wife was lying on a bed between the boys with their \"wedding pictures all over the floor.\"\nJoyce Kinnear, Arthur Johnson's mother, said her family and her son are devastated by the event. Arthur has older children, she said, but the two younger boys were his \"babies.\"\nShe said her son and his wife were trying to work out their problems. The couple had been together 11 years but had been married for nearly one year, she said.\nArthur Johnson graduated from South High School and works as a chef at a Springfield restaurant. He listed his profession as a mechanic on his marriage license last year.\nRachel Johnson worked as a waitress at a different Springfield restaurant with family members. They declined comment on Wednesday afternoon.\nThe family is having a rough time dealing with what has happened, Kinnear said, and they are looking for answers. Rachel Johnson left a note, Kinnear said, but the family hasn't been told what it says.\n\"How can you cope through this?\" she said. \"Why would you take a baby just because you don't want to be here?\"\nThe boys were very active and loved to play, their grandmother said. Daylan was signing up for baseball.\n\"This is a shock,\" said Vicki Green, who lived near the Johnsons on Columbus Avenue before the Johnsons moved to Burt Street. \"Because you never see any kind of depression out of her. She's always smiling, always smiling. So I don't know. I have no idea why this would happen or why she would do anything like this.\"\nThe boys were everything to her, Green said, and neighbors never saw the boys without their mother.\n\"She was very active. She did everything with them ... Every time you looked outside she was outside with her kids playing,\" Green said.\nRachel Johnson had no criminal charges in Springfield, according to police records, and Clark County Job and Family Services officials said the agency has no history with this family. This is the first murder-suicide in where a mother killed herself and her children in recent history, Springfield police said.\nIn 1987 Jane Demyan drowned her two daughters in Buck Creek. She was found not guilty by reason of insanity. In 1996 Lester Payne shot his wife and two children in their North Florence Street home, then killed himself. One of the children survived that shooting.\nThere is no way for observers to explain why a mother would kill her children and take her own life, said Sue Fralick, senior vice president of operations at Mental Health Services for Clark and Madison Counties.\n\"Nobody is going to understand the why of what happened in complete fullness,\" Fralick said. \"But you have to be able to talk about your feelings, express your feelings and get support from people.\"\nAnd while she emphasized that she doesn't know why Johnson did what she did, Fralick said there are warning signs of possible problems. Depression and a general feeling of hopelessness are among the general worrying factors, she said, as is a refusal to get counseling.\n\"Another reason is somebody has never learned to talk about her feelings,\" Fralick said. \"So they hold them in and hold them in and hold them in ... They hold all these things in over time, and all that comes out is anger.\"\nThe national hotline for suicide prevention is 800-273-8255.\nThey can also visit a local hospital emergency room, where on-call mental health employees can be called, she said."}