{"uri": "http://www.usatoday.com/story/news/nation/2013/02/11/delaware-courthouse-shooting/1909075/", "title": "3 dead, 2 wounded in Del. courthouse shooting", "dct": "Mon, 11 Feb 2013 00:00:00 GMT", "id": "6457460b746e9b805ae7ab7288d40a91", "content": "The (Wilmington, Del.) News Journal\nPolice say Thomas F. Matusiewicz, 68, opened fire in the courthouse, killing his former daughter-in-law and her friend.\nWILMINGTON, Del. — The father of a man who kidnapped his three young daughters in 2007 opened fire with a handgun at the New Castle County courthouse this morning, killing his former daughter-in-law and her friend and wounding two police officers, law enforcement and legal sources said.\nThe gunman, identified as Thomas F. Matusiewicz, 68, was fatally shot and died outside the revolving doors of the courthouse, where his body lay covered with a blanket all day while police investigated. It was unclear if he took his own life or was killed by courthouse police, who returned fire.\nKilled was Christine Belford, 39, of Pike Creek, Del. She once was married to the shooter's son, David, who at one time was a well known Newark, Del., optometrist. Belford and David Matusiewicz battled for custody after their 2006 divorce, and David absconded with the girls and his mother to Central America for 18 months.\nBoth were at the courthouse for a child support hearing.\n\"It's a terrible tragedy,\" said Carolyn Belford, who is married to the slain woman's father, Jim Belford. She spoke by telephone while leaving the hospital.\nThe other victim, gunned down in the lobby, was identified by law enforcement sources as Laura Elizabeth \"Beth\" Mulford, a friend of Belford's who was accompanying her for moral support.\nTwo Capitol police officers, both wearing bulletproof vests, took bullets to the chest, but were treated and released from Christiana Hospital by midday, police said. \"Both of them are doing well,\" Lt. Gov. Matt Denn said.\nPolice identified one officer as Steven Rinehart, a retired New Castle County police officer, and sources identified the other officer as Michael Manley.\nThe background\nDavid Matusiewicz, 45, who was released from federal prison in Texas last year after being convicted in Delaware of kidnapping and bank fraud, was at the courthouse Monday for a child support hearing involving his ex-wife and their three daughters, ages 11, 10 and 7, law enforcement sources said. He went inside the courthouse, where he was taken into custody, said the sources, who added that he was being questioned Monday night.\nChristine Belford, who had worked as a contact lens technician, told The News Journal in December that she and David Matusiciewiz, whose parental rights were terminated, were still battling in court about overdue child support. \"Kids are doing OK,\" she wrote to the newspaper. \"Some lingering issues, as expected, for all of us.\"\nBesides her three daughters with Matusiewicz, Belford also had a teenage daughter from a previous marriage. Neighbors said Belford feared the Matusiewicz family and also had installed security and surveillance for protection.\nThe elder Matusiewicz once owned a home near Smyrna, Del., with his wife, Lenore, but records show they had moved to Texas.\nThe couple, who have property in Hidalgo County, Texas, declared bankruptcy there in 2011. In their bankruptcy petition, they claimed to own at least one 9 mm pistol and 100 rounds of ammunition.\nLenore Matusiewicz, 68, was convicted in Delaware Superior Court of helping their son kidnap the girls and take them on an 18-month odyssey to Panama, Costa Rica, Mexico and Nicaragua. In March, after an international manhunt, authorities found David and Lenore Matusiewicz and the children, one of whom is autistic, living in a dirty and cramped trailer.\nLenore Matusiewicz, 67, was sentenced to 18 months in prison for three counts of child endangerment. At her sentencing, her son sat in the back of courtroom, where he said nothing but was visibly angry.\nShe and her son left with the girls in an $80,000 motor home after telling Christine Belford they were taking the kids to Florida for a vacation at Disney World. They never returned, and the kidnapping drew national media attention. The case was featured on the television series \"America's Most Wanted,\" and the National Center for Missing and Exploited Children's website.\nThomas Matusiewicz had contacted The News Journal twice in 2009, while his son's case was winding through the courts, to complain about the one-sided account being portrayed in the media.\nHe said his son, who was then being held in the Salem County, N.J., jail, wanted to be interviewed about the case. David Matusiewicz, however, later denied a reporter's request for an interview.\nHe defended his son as a good father and optometrist who treated \"his patients very well.\" Taking the children out of the country, he said, was done to \"protect his children.\"\nThe shootings\nThomas Matusiewicz opened fire shortly before 8 a.m. as employees, attorneys, prospective jurors and people with court hearings were streaming into the New Castle County Courthouse, authorities said.\nHe entered from the side door, adjacent to the parking garage, and began firing a handgun after passing through the revolving doors that open to the lobby, killing Belford and her friend.\nMatusiewicz exchanged fire with Capitol police, striking two unidentified officers before he reached the security checkpoint or metal detectors. Although authorities would not say who shot him, they said Matusiewicz died inside the lobby.\nMoments before the shooting, Chick Chinski, 62, who was reporting for jury duty, said he had ridden the garage elevator to the ground level with the gunman, who wore a Timberline jacket and carried a satchel. Upon going through the revolving doors, he turned around and saw the man holding a gun.\n\"I just saw him walk in, point the gun and I heard the shots. The women went down,\" he said. \"I saw the cop hit the floor, then I hit the floor, then everybody else was going down. There was maybe 50, 60 people in the lobby.\"\nChinski said he saw an exchange between Capitol police and the gunman and watched the glass on the lobby door shatter. Chinski said he was standing about 50 feet from the women who were killed, adding it was clear they were the intended target.\n\"He just seemed like he came right after them,\" Chinski said. \"When he come in the door that's exactly what he did. Instantly.\"\nThomas Warren of New Castle, Del., who also was reporting for jury duty, saw a body on the ground outside the entrance. Police arrived in droves, Warren said, and one ordered him and several others back into the garage.\nHe watched as police threw a sheet over the body and emergency responders took four people out on stretchers. He said they were \"desperately performing CPR\" on a woman and a police officer.\n\"We didn't know if the gunman was still on the loose,\" he said. \"People didn't know what was going on. They just wanted to get the hell out of there.\"\nCounty, city and state police rushed to the courthouse, along with Mayor Dennis Williams, as employees were ushered out of the building. Police Chief Christine Dunning remained in Philadelphia, where she was participating in an anti-violence roundtable with Vice President Joe Biden.\nAt Belford's home Monday in Meadowdale, neighbors were stunned to learn that she had been killed, but noted that she had installed security and surveillance cameras because she feared retaliation from the Matusiewicz family. Neighbors also said she had hired a private detective who told Belford someone might have been rummaging through her mail.\n\"Many people have a little bit of security, but not as much as she had,\" neighbor Bob Thomas said.\nAdded neighbor Lois Dawson: \"She had all the windows changed with special locks. She had cameras around the house. She had two huge dogs. She didn't know whether she should get a gun. … Her house is like Fort Knox, so I thought she was safe.\"\nPraise for the officers\nAs authorities began piecing together what happened, Attorney General Beau Biden urged anyone who witnessed the gunfire and needs counseling or other services to call state police at 1-800 VICTIM1.\nBiden also applauded the police officers, saying that because of their bravery, \"a greater tragedy was averted.\" He also said the courthouse would be closed Tuesday.\nGov. Jack Markell, who was traveling in Bangalore, India when he learned of the shooting, will cut off his trip early, arriving back in Delaware on Thursday instead of Saturday.\nIn an interview from India, at nearly 2:30 a.m. local time, Markell said he made the decision to return home early after speaking by phone with the two officers wounded in Monday's shooting.\n\"Obviously I want to express my deepest condolences to the victims,\" Markell said. \"Thank God they're both doing OK.\"\nContributing: Esteban Parra, Sean O'Sullivan, Adam Taylor, Mike Chalmers, Wade Malcolm, Nichole Dobo, Robin Brown and Jonathan Starkey, The (Wilmington, Del.) News Journal"}