{"uri": "http://www.philly.com/philly/news/Police_ID_victims_in_Wilmington_courthouse_shooting.html", "title": "Del. courthouse murderer killed himself during gun battle", "dct": "Tue, 12 Feb 2013 00:00:00 GMT", "id": "94620cc2d8ba2146c8582a0aa226a761", "content": "Christine Belford had endured a bitter divorce and custody dispute, and she was living in fear that her relationship with her ex-husband would take a violent turn.\nSlideshow Video\nThat fear became a shocking reality Monday, when her ex-father-in-law, Thomas Matusiewicz, 68, opened fire in the New Castle County Courthouse in Wilmington, killing her and another woman, and wounding two law enforcement officers before killing himself, state police said.\nIt was the tragic fallout of the deeply troubled relationship between Belford, 39, and David Matusiewicz, 45, officials said.\nIn 2007, David Matusiewicz kidnapped their three young daughters from Newark, Del., and fled to Central America, where they were found 19 months later, living in a cramped and filthy trailer.\nDavid Matusiewicz was sentenced to four years in prison on charges of kidnapping and bank fraud, but was released on probation in September.\nBelford had told neighbors to watch her house for suspicious activity. She had a security camera installed after she suspected someone had been going through her mail and looking in the windows, neighbor Lois Dawson said.\n“It’s Fort Knox over there,” said Dawson, 66.\nBelford recently told Dawson that Matusiewicz was coming up from Texas, where he was living with his parents about 20 miles from the Mexican border.\n“I know she was afraid of him and his family,” Dawson said.\nMatusiewicz and Belford were due in court Monday for a child-support hearing.\nWhen Belford walked into the courthouse lobby, Thomas Matusiewicz walked up to her and shot her in the chest with a .45-caliber handgun, according to Delaware state police. Laura “Beth” Mulford, a friend who was with Belford, turned to run but was gunned down as well.\nThomas Matusiewicz then exchanged gunfire with Capitol Police, eventually falling dead near the revolving doors with a gunshot in the upper body and a self-inflicted shot to the head, state police said.\nTwo Capitol Police officers were shot in the chest but were saved by their bulletproof vests.\nAll the while, David Matusiewicz was inside the courthouse, past the security checkpoint. He and his father had entered the courthouse together, state police said, but his father had waited in the lobby about 35 minutes for Belford to arrive.\nPolice questioned David Matusiewicz and arrested him for alleged probation violations.\nAccording to the probation officer’s filing in federal court Tuesday, Matusiewicz had obtained permission to travel from Texas to Delaware for the hearing, and said he would stay with his uncle in Bayville, N.J. But the night before the shooting, he stayed in Elkton, Md., without permission, according to the filing.\nMatusiewicz had defaulted on his $2,200 monthly child support payments and owed $9,674 in restitution, according to the filing.\nBernard August, 61, said the shooting was a blow to the Newark community of Meadowdale, where Belford and Mulford lived.\nAugust said the women were longtime friends whose daughters played together. He described Mulford, a nurse and mother of two, as a “caring and loving person.”\n“It is hard to put into words what has happened here,” August said. “We all suffer the losses of the people in our communities.”\nBelford’s disputes ere not only with her ex-husband, but with his parents and sister as well.\nThe Matusiewicz family has accused Belford of molesting her oldest daughter — charges that she denied and which courts determined to be unfounded.\nDavid Matusiewicz spent more than a year planning the abduction of the girls, prosecutors said. He forged his wife’s name on a loan modification, sent the money to an overseas bank account, and cashed out his successful Newark optometry practice.\nHe and his mother, Lenore, rented a motor home and told Belford they were taking the girls — Laura, 5, Leigh, 4, and Karen, 2 — to Walt Disney World.\nWhile on the lam in Costa Rica, Panama, and Nicaragua, David and Lenore told the children that Belford had killed herself, according to records from David Matusiewicz’s criminal trial.\nThe kidnappings sparked national media attention, including a segment on the TV show “America’s Most Wanted.”\nWhen the children were found and returned to their mother, Laura was suffering from post-traumatic stress and Leigh — who is autistic and has difficulty communicating — “was in great pain from abscessed teeth,” according to court records.\nLenore Matusiewicz was sentenced to 18 months in prison.\nIn 2009, Belford filed a personal injury lawsuit against her ex-husband, his parents, and his sister Amy.\nLenore and Thomas Matusiewicz filed for bankruptcy in 2011, naming Belford as a creditor.\nOn the day he was sentenced, David Matusiewicz apologized to his ex-wife and his daughters “for the trauma they have been put through.” He vowed to “rededicate myself to helping people” and supporting his daughters.\nIf the judge would grant leniency, Matusiewicz said, “you will never have an opportunity to see me back in a courtroom.”\nMatusiewicz’s probation hearing is scheduled for Friday.\nContact Jessica Parks at 610-313-8117; jparks@philly.com, or @JS_Parks on Twitter."}