{"uri": "http://heavy.com/news/2013/02/thomas-matusiewicz-courthouse-shooting-delaware/", "title": "Thomas Matusiewicz: Top 10 Facts You Need to Know", "dct": "Tue, 12 Feb 2013 18:14:00 GMT", "id": "ff5a0fe23e223e942b716c0f60cd8635", "content": "Police sources now say that Thomas F. Matusiewicz, 68, is the alleged gunman who stormed the New Castle County Courthouse in Wilmington, Delaware, on Monday, February 11, and opened fire. After an intense shootout, three people were found dead including his son’s estranged wife and the gunman himself. Another woman was found killed, while two cops were wounded.\nHere’s what you should know about Thomas Matusiewicz and the courthouse bloodbath.\n1. The Shooter Was Originally Believed to Be Thomas’ Son\nA law enforcement official who was briefed on the situation identified the shooter as Thomas Matusiewicz on Tuesday. But David Matusiewicz was believed to be behind the incident on Monday, and his name was widely reported in the media after an anonymous police source leaked the wrong name, without authorization. There’s been no further explanation of the mixup. 2. This Mistaken Identity is Reminiscent of the Sandy Hook School Shooting\nThe misidentification and related misreporting of David Matusiewicz as the shooter, versus Thomas Matusiwicz, is eerily similar to the chaos that followed the Sandy Hook Massacre in Newtown Connecticut. At first, it was believed that the man behind the massacre was Ryan Lanza. Acting quickly to break the news, countless media outlets released his name and spread his photo across the Internet. But it was then revealed that the real shooter was Adam Lanza, Ryan’s brother. Adam Lanza caused this mix-up since he was found with his sibling’s I.D. at the time of the incident, and again, and anonymous police source leaked the erroneous information. 3. Thomas is the Ex-Father-In-Law of One of His Victims\nOne of the deceased victims in the courthouse shooting was the estranged wife of Thomas’ son, David Matusiewicz. Christine Belford, 39, and David Matusiewicz, 45, were scheduled for an 8:30 a.m. child support modification hearing at the New Castle County Courthouse. A video report on Belford and the shooting incident can be seen above. 4. He Used A Handgun During The Shooting\nNews One reported that Thomas wielded a .45 caliber semiautomatic handgun during the shooting. 5. He Declared Bankruptcy in 2011\nThomas Matusiewicz and his wife, Lenore Matusiewicz, 67, reportedly owned a property in Hidalgo County, Texas. They declared bankruptcy there in 2011. In their bankruptcy petition, they claimed to own a 9 mm pistol and 100 rounds of ammunition. 6. Three People Are Dead and Two Police Officers Were Shot\nTwo women were killed during the courthouse shooting. One of the fatal victims was his son’s estranged wife, Christine Belford, and another woman was murdered. Belford was shot in the chest. The shooter was shot and killed by police officers. Two Capital Police officers were shot, suffering non-life-threatening injuries. Capital Police Chief William Jopp told NBC Philadelphia that one officer took a shot to the chest while the other was shot in the leg, but their bulletproof vests kept things from being worse. 7. The Other Fatal Victim Was Christine Belford’s Neighbor\nThe second woman killed during the shooting has been identified as Christine Belford’s 47-year-old neighbor, Laura Elizabeth Mulford. Both women hail from Newark, Delaware. Mulford’s family released a statement on the incident:\nOur hearts are full of sorrow today with the loss of our wife and mother, Beth Mulford. Beth was a tragically taken from us in this senseless crime at the New Castle Courthouse yesterday. Beth was a loving wife to John and beloved mother of Christina and Katlyn. A registered nurse, Beth worked locally as an emergency room nurse, in the pharmaceutical industry and as a school nurse. Beth was a friend to many. Her kind heart and generous spirit were evident in her support for her friend Christine. Beth was a blessing to those who knew her. She will be deeply missed by her family and many friends. The family requests privacy at this time as they deal with their loss. Funeral arrangements are incomplete at this time.\n8. He Fired Several Shots Before Going Down\nThomas allegedly fired 20 shots before being shot and killed by police. Above is the police radio chatter captured during the shooting. 9. Thomas’ Son Served Jail Time For Kidnapping His Own Children\nIn 2007, David Matusiewicz forged his wife’s signature to obtain a $249,000 loan. David used the loan to take his three daughters with him to Panama, Mexico, Costa Rica and Nicaragua. David lied to the mother of his children and told her that he taking his kids to Disneyworld. He and his children were eventually discovered in Nicaragua in 2009, where they were found living in a tiny, filthy trailer. The girls — one of whom is autistic — were ages 4, 6 and 7. Police officials transported them back to the U.S. David’s three children were soon returned to their mother. Lenore Matusiewicz, David’s mother and Thomas’ wife, reportedly aided David in his kidnapping scheme.\nREAD MORE HERE:\n10. He Hails From Texas\nView Larger Map\nThomas Matusiewicz is reported to be a resident of Edcouch, Texas. He once owned a home near Smyrna, Texas, with his wife."}