{"uri": "http://www.beaumontenterprise.com/news/article/Child-suffers-gunshot-wound-taken-to-Houston-for-7531061.php", "title": "Questions mount after 3-year-old boy suffers gunshot wound", "dct": "Wed, 18 May 2016 00:00:00 GMT", "id": "0574277ea39964b8b695e25bb5ab45de", "content": "Outside a baby blue house situated on a narrow street in Beaumont's South End on Tuesday afternoon, neighbors were visibly distraught and confused by news that a 3-year-old boy had been shot on the left side of his forehead.\nThey had more questions than answers as the toddler was rushed to Beaumont's Baptist Hospital and then flown by helicopter to Houston Memorial Hermann Hospital.\nHow could this happen? they asked one another.\nThe boy's loved ones scampered past reporters posted outside the home, declining to answer questions about the shooting.\n\"Obviously the people here are upset because it's unclear how this happened. But a child has been shot,\" said Beaumont Police Officer Tony Harding. \"We're going to look into everything.\"\nThe child's grandmother owns the home, Harding said.\nPolice and officials with Child Protective Services were working to sort out exactly what happened to the boy, who was not identified by authorities.\nHarding said investigators, as of Tuesday evening, had not ruled out any possibilities.\nThe boy could have been shot accidentally, or it could have been an intentional act, he said.\nSeparate 911 calls were made around 1:05 p.m., the first from Baptist Hospital reporting a child gunshot victim and then another shortly after from an unknown person, Harding said.\nA neighbor, who asked not to be identified, said a woman inside the home didn't think there was enough time to wait for emergency responders and drove the boy to the nearest hospital, which is Baptist.\nHe was then flown to Memorial Hermann in Houston.\nThe boy, according to the neighbor, was alert when he was rushed from the Pipkin Street property.\nEverytown for Gun Safety, an advocacy group that tracks unintentional child shootings, found at least 265 children accidentally shot themselves or someone else in 2015.\nThis year, there have been at least 92 unintentional child shootings, according to Everytown data, which relies on media and police reports.\nThe shootings usually take place in a home or vehicle owned by the victim's family, with guns most often legally owned, but not properly secured or stored, according to the Everytown."}