{"uri": "http://www.wral.com/four-injured-in-shooting-at-smithfield-sports-bar/12411515/", "title": "Woman, 29, charged in shooting at Smithfield sports bar", "dct": "Sat, 04 May 2013 00:00:00 GMT", "id": "cb70c815e44d5410c75350c52532645b", "content": "Video Playback Not Supported\nPlay Video\nPlay\nMute\nCurrent Time 0:00\n/\nDuration Time 0:00\nLoaded: 0%\nProgress: 0%\nStream TypeLIVE\nRemaining Time -0:00\nPlayback Rate\n1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptions\nFullscreen\nAutoplay:\nOn / Off\nThis is a modal window.\nThis video is not supported on your platform. Please make sure flash is installed.\nCaptions Settings Dialog\nBeginning of dialog window. Escape will cancel and close the window.\nText Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps\nDefaults Done\nFour people injured following bar shooting\nAre you still watching?\nYes, ContinueNo\nSmithfield, N.C. — A 29-year-old Smithfield woman was arrested and charged early Saturday in connection with an overnight shooting that injured four people at N&N Sports Bar & Grill, police said.\nKrystal Olymica David, of Smithfield, is charged with four counts of assault with a deadly weapon with intent to kill inflicting serious injury.\nAccording to investigators, the shooting took place after David and another woman at the restaurant began arguing over a man about 1:30 a.m. David got a weapon from her car following the argument and opened fire inside the bar, police said.\n\"She really should think twice before she puts other lives in danger like that,\" said Angela Bloyer, a patron of the N & N Sports Bar.\nN&N Sports Bar & Grill, at 150 South Equity Drive, is located near the Carolina Premium Outlets in Smithfield.\n\"Normally it's a pretty quiet area, no trouble or anything,\" Bloyer said.\nFour Smithfield residents – Elias Sanders, Charnise Jones, Cedric Mcerchrin and Felicia Jones – were being treated at a local hospital Saturday for serious but non-life-threatening injuries. It wasn't clear if any of the victims were involved in the argument.\nDavid was in the Johnston County jail Saturday under a $500,000 secured bond. Her first court appearance is scheduled for Monday.\nAnyone who witnessed the shooting or has additional information is asked to call the Smithfield Police Department at 919-934-2121."}