{"uri": "http://baltimore.cbslocal.com/2015/02/28/multiple-injured-in-baltimore-shooting/", "title": "1 Dead, 3 Injured In Baltimore Quadruple Shooting", "dct": "Sat, 28 Feb 2015 22:00:00 GMT", "id": "5be4af4fe155fc70a7ac22104e38e23c", "content": "BALTIMORE (WJZ)—A violent end to February in Baltimore, with a quadruple shooting that left one dead on Saturday afternoon.\nAlex DeMetrick has the details.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nMost of a block was taped off, as Baltimore Police sealed off a mass shooting scene on the 4300 block of Welbourne Road in the northeastern part of the city.\nWhen officers arrived just before 4 o’clock one person was found dead in the street, which was littered with shell casings. That victim was identified by authorities on Sunday as 40-year-old Dwayne Reid.\n“They found four individuals that were met by gunshot. At this point, it looks like one person has passed. The other three victims have been taken to area hospitals where they are being treated for their wounds,” said Darryl Desousa, Baltimore Police Department.\nCollecting physical evidence is the easy part, determining what sparked the violence will take digging.\n“We have no indication what it may be about. We know the one victim that is deceased is not from this area,” said Rich Worley, Northeast Commander, Baltimore City Police Dept.\nConnecting the four victims to each other, and then to a motive and possible suspects, is still complicated by more questions than answers:\n“We’re trying to fit the pieces to the puzzle together at this time. It’s way too early for any descriptions of persons or vehicles,” Desousa said.\nWhen police cleared the crime scene, one patrol car was left, just in case someone might know something. But Welbourne Road sat mostly deserted, and neighbors kept to themselves.\nThe identity and condition of the three victims’ hospitalized remains unknown at this time.\nAlex DeMetrick has been a general assignment reporter with WJZ Eyewitness News since September 1984. Alex began his journalism career in California. Alex has received many awards from United Press International and The Associated Press. He...\nMore from Alex DeMetrick"}