{"uri": "http://www.daily-journal.com/news/crime/th-non-fatal-shooting-in-kankakee-this-year/article_a3a01ba2-ca98-5610-a2ae-849445683bb5.html", "title": "24th non-fatal shooting in Kankakee this year", "dct": "Tue, 26 Jul 2016 00:00:00 GMT", "id": "f3fa088395f19598c1c20235983ad43e", "content": "The three shootings in Kankakee that injured eight during the weekend has brought the number of nonfatal shootings in the city this year to 24.\nThe latest shooting occurred at about 3:30 a.m. Sunday in the 1100 block of North Chicago Place. Two men were shot.\nAccording to a police report, a caller told dispatchers they heard 10 to 20 shots.\nSeveral cars were seen fleeing when officers arrived. There were many people in the street and sidewalk but \"no one was willing to talk,\" according to the report.\nA 23-year-old man from Indianapolis was treated at Riverside Medical Center for a gunshot wound to his left thigh. He told police he was visiting and unsure of the address he was at when shot.\nThe other victim, 30-year-old Angelo D. Lewis, of North Aurora, was arrested upon his release from Presence St. Mary's Hospital after treatment for a wound to his right leg. He was charged with two counts of possession of a controlled substance. The drugs were discovered when they fell out the pocket of his pants. A judge set his bond at $25,000 on Monday.\nOne shell casing and a bullet fragment were found in the street.\nOn Saturday, one man was reportedly shot and another pistol whipped during an home invasion in the 900 block of East Mulberry Street.\nFive people suffered nonlife-threatening wounds after two men opened fire on a group of people in the 300 block of North Wildwood Avenue at about 10 p.m. Friday.\nAccording to a report, police were called to North Wildwood and East Locust Street for a report of a gunshot victim.\nA 22-year-old man was shot in the right leg. He told police he was shot in the 300 block of North Wildwood Avenue. He proved unhelpful to investigators.\nTwo men, ages 26 and 22, were found shot near a home on 300 North Wildwood. A fourth victim, an 18-year-old man, was found in the alley.\nPolice learned later of a fifth victim, an 19-year-old man, who was taken by others to St. Mary's.\nSeveral shell casings and bullet fragments were found at the scene and at North Wildwood and East Locust."}