{"uri": "http://miami.cbslocal.com/2016/11/05/club-shooting-in-lauderhill-leaves-3-hurt-1-dead/", "title": "Club Shooting In Lauderhill Leaves 3 Hurt, 1 Dead", "dct": "Sat, 05 Nov 2016 17:01:00 GMT", "id": "f3a6dc8abdafb4578414dd5ece53e947", "content": "LAUDERHILL (CBSMiami) — Investigators are trying to determine what led to a shooting at a Lauderhill nightclub that left three people wounded and one dead.\nLauderhill Police said it happened around 5 a.m. Saturday at Club 54, located at 3135 W. Broward Blvd.\nOfficers revealed little information about what happened as the investigation began its preliminary stages, including whether or not any suspects are in custody.\nOne of the victims is believed to be a security guard.\n“He got shot trying to provide for his family,” said another security guard. “But it doesn’t justify the fact that there are people out there who shoot people. He never did anything to anybody.”\nThe gunshots were loud enough to wake residents nearby.\n“I was in my bed and we hear outside nothing but a whole barrage of shots. A whole lot,” said George Davis. “A lot of shots, man. A lot of shots. Like you’re in the army.”\nHe said the shooting came in several bursts minutes apart.\n“Bam-bam-bam, a couple of minutes you hear, slowed down again, then a couple more minutes you hear shots again, shots again,” he said. “I got up and look outside and see all the cops.”\nThere was also a second crime scene at Broward Blvd and 27th Avenue, where a white Audi that was taking one of the shooting victims to the hospital stopped after making a U-turn. The driver saw an officer on a traffic stop and sought help.\nSequoia Chipp, who works at a restaurant near that scene, said, “It’s crazy. This is amazing. I am not from here. This is the first time I have ever seen something like this in Broward County.”\nThree of the victims were transported to the hospital in unknown condition.\nAnyone with information should call Lauderhill Police or Broward Crime Stoppers at (954) 493-TIPS (8477). There is a reward of up to $3,000."}