{"uri": "http://www.abc15.com/news/region-phoenix-metro/west-phoenix/phoenix-police-id-young-girls-dad-dead-after-murder-suicide-in-west-phoenix", "title": "Phoenix police ID young girls, dad dead after murder-suicide in West Phoenix", "dct": "Tue, 18 Oct 2016 08:13:00 GMT", "id": "01b79c4dcf13389c6c6582ace7ba452a", "content": "Autoplay:Young girls killed by own father in TollesonCONNECTING...XPhoenix police ID young girls, dad dead after murder-suicide in West Phoenix\nPHOENIX - Phoenix police on Tuesday released the identities of a man and two daughters who died in what police believe was a murder-suicide, and court records indicate the man's ex-wife had obtained an order of protection against him.\nPolice identified the father as 36-year-old Jerad Joseph Arismendez and the girls as 5-year-old Audrey Arismendez and 4-year-old Ariah Arismendez.\nThe father and the 5-year-old daughter were pronounced dead at Arismendez's home late Sunday, and the 4-year-old girl later died at a hospital.\nPolice believe the father took the lives of his daughters and then killed himself, Sgt. Mercedes Fortune said.\nCourt records indicate that the father's ex-wife, Carmen Arismendez, requested and obtained a court order of protection against him in June.\nOther court records list two 2006 convictions for disorderly conduct for Jerad Arismendez and a 2013 case in which assault and criminal charges against him were dismissed. The online court records don't provide details on the incidents.\nCourt records available online also don't provide details on Carmen Arismendez's request for a protective order or specify its terms, but The Arizona Republic reported that she feared for her safety because Jerad Arismendez had \"violent tendencies\" and had harassed her.\nShe said Jerad Arismendez in one incident held her in a chokehold and took away her phones to prevent her from calling police, the Republic reported.\n\"He lives 1 minute away from me and can come over to `take care of me' whenever,\" she wrote, adding that he calls her up to 50 times a day. \"I fear for my safety as he has violent tendencies.\""}