{"uri": "http://thepolicenews.net/default.aspx", "title": "The Premiere Website For Police News In Texas", "dct": "Tue, 24 Jan 2017 00:00:00 GMT", "id": "26d647e225d09ca33f7f0fe29fd9899c", "content": "Police News Links\nNH bill would require body cams for cops with complaint history\nAssociated Press CONCORD, N.H. — The debate over whether the police should wear body cameras is back before New Hampshire lawmakers. A bill up Tuesday for a hearing would require any officer who is ...\nChicago police chief discloses he needs kidney transplant\nBy Caryn Rousseau and Herbert G. McCann Associated Press CHICAGO — Chicago Police Superintendent Eddie Johnson disclosed after a public dizzy spell on Friday that he has battled a kidney condition ...\nFerguson missed deadlines in consent decree with DOJ\nBy Jim Salter and Eric Tucker Associated Press FERGUSON, Mo. — Ferguson officials have missed critical deadlines in the early stages of an agreement with the Justice Department, but the manager of ...\nFashion police: Cops ease rules on tattoos, turbans, beards\nBy Colleen Long Associated Press NEW YORK — The Joe Friday look is out. Tattoos, turbans and beards are in. Police departments, compelled by a hiring crisis and eager for a more diverse applicant ...\nHow the fundamentals of tracking can benefit your police department\nMany of us have heard of tracking, more accurately described as “man-tracking” though it pertains to both sexes. Sometimes the perceptions we have about tracking come to us from books, or Hollywood ...\nWhy cops should focus on the lone-actor domestic terrorist\nThe FBI defines terrorism as “the unlawful use of force or violence against persons or property to intimidate or coerce a government, the civilian population, or any segment thereof, in furtherance ...\nPolicing Matters Podcast: Technology and social media in 21st century policing\n<!--cke_bookmark_146S--><!--cke_bookmark_146E--> Download this week's episode on iTunes, SoundCloud or via RSS feed In December 2014, President Barack Obama signed an executive order establishing ...\nNYC challenges lawsuit targeting NYPD use of 'sound weapon'\nBy John Riley Newsday NEW YORK — In one of the first legal challenges over police use of a so-called “sound weapon” against protesters, a New York City lawyer argued on Thursday that deploying ...\nNY cops rescue 103 puppies after delivery van crashes\nAssociated Press AVOCA, N.Y. — An animal welfare group is caring for the scores of puppies that were being transported in a box van when it crashed and overturned on an upstate New York highway. State ...\nThin Blue Line Reporting White Paper: Guidelines for Evaluating and Implementing eCitation Systems\nBy Thin Blue Line Reporting Over the past two decades, the emergence of electronic citation (eCitations) technology has represented a breakthrough in law enforcement technology. By transforming traditional ..."}