{"uri": "http://www.wral.com/durham-boy-kills-little-brother-in-accidental-shooting/13601896/", "title": "Durham boy kills little brother in accidental shooting", "dct": "Tue, 29 Apr 2014 00:00:00 GMT", "id": "039350e96ecd85169e3fcfc5deacf867", "content": "Video Playback Not Supported\nPlay Video\nPlay\nMute\nCurrent Time 0:00\n/\nDuration Time 0:00\nLoaded: 0%\nProgress: 0%\nStream TypeLIVE\nRemaining Time -0:00\nPlayback Rate\n1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptions\nFullscreen\nAutoplay:\nOn / Off\nThis is a modal window.\nThis video is not supported on your platform. Please make sure flash is installed.\nCaptions Settings Dialog\nBeginning of dialog window. Escape will cancel and close the window.\nText Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps\nDefaults Done\nBoy killed in shooting at home in Durham\nAre you still watching?\nYes, ContinueNo\nFind News Near Me\nDurham, N.C. — A 9-year-old boy died late Monday after an accidental shooting inside a home at the intersection of Macon and Washington streets, Durham police said.\nChristian Pittman's 12-year-old brother fired the fatal shot when the boys were playing with a gun in the house shortly before 9:30 p.m., Durham Police Chief Jose Lopez said Tuesday. The older boy, whose name hasn't been released, was injured but wasn't shot, the chief said.\nPolice were notified of the shooting after a child contacted emergency operators.\n\"I don't know if he's dead,\" said the child, who dialed 911 from a nearby home and was crying during the call. \"He's bleeding really bad. He's been shot. I don't know if he's breathing.\"\nLopez called the shooting an accident but noted that it highlights the need for better gun safety. The handgun was left unsecured in the home, he said.\n\"It is the responsibility of adults to make sure that kids don't have firearms in their possession,\" he said. \"We are going to continue investigating and see who is responsible for securing that firearm and take the appropriate actions in response to it.\"\nDeeshawn Magwood, an older brother of the two boys, said relatives believe the gun belonged to an ex-boyfriend of their mother.\n\"I don't know if I want to break down and cry or give up,\" a distraught Magwood said Tuesday. \"I just wish it could have been prevented.\"\nLopez said it could have been. He urged families to store firearms in a secure location where children can't access it and to use gun locks to prevent weapons from being fired accidentally.\nDurham Public Schools administrators said counselors would be at Glenn Elementary School on Wednesday to help students and staff cope with Christian's death.\nMonday night's shooting was the second on Macon Street this year.\nA 5-month-old girl was accidentally shot in the hand and leg in February while her parents argued on a front porch. Her father, Arin Futrell, was charged with felony negligent child abuse after police ruled the shooting an accident."}