{"uri": "http://fox40.com/2016/04/17/accidental-gunfire-sends-lodi-girl-to-hospital/", "title": "Accidental Gunfire Sends Lodi Girl to Hospital", "dct": "Sun, 17 Apr 2016 22:46:00 GMT", "id": "b5ab093c4f21c0c22c45eeebfa6f4f3c", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nLODI --\nAn 8-year-old Lodi girl was transported to an area hospital after she was accidentally shot near a relative's apartment complex Sunday afternoon.\nA man inside a nearby apartment says he was cleaning his gun when it went off, according to the assistant manager at the complex. The bullet went through a wall before eventually striking the girl.\nThe girl is expected to be OK, according to her mother, who did not want to be identified Sunday night. The bullet lost momentum after going through the wall, and didn't pierce the girl's leg.\nThe courtyard of the Lodi apartment complex, on the 400 block of North Church street, is normally a haven for young kids who live and play there.\nSunday it was surrounded by Lodi police officers investigating the accidental shooting.\n\"I just wish out neighborhood would get cleaned up because there's too many kids, apartment complexes, kids running around here. You never know if a stray bullet will hit them,\" said Linda Lopez, who has lived on the same block as the apartment complex for almost 20 years. She says she saw police arrest one man after the shooting.\n\"Yeah. A lot of times,\" Lopez said when asked if she has seen incidents like this near her home in the past.\nPeople inside the apartment where the girl was refused to talk to FOX40. Neighbors say the girl's family went with her to Lodi Memorial Hospital.\n\"I came out and I just saw cops everywhere,\" said James Epler, who lives right above the apartment where the gun went off. He says he didn't hear it but saw the aftermath.\n\"Accidents can happen anywhere if you're not practicing responsible firearm safety,\" said Epler.\nFor others the incident left a more unsettling feeling.\n\"I have grandkids, and a granddaughter and a grandson that's 14 years old, and I just get scared because we don't know what's happening,\" said Lopez."}