{"uri": "http://www.mcall.com/news/breaking/mc-9th-street-shooting-20161004-story.html", "title": "Teen driver shot to death in Allentown; his passenger is wounded", "dct": "Wed, 05 Oct 2016 18:23:00 GMT", "id": "83a6b7b181861332d38a95fcb61a2354", "content": "A 17-year-old Allentown man was killed Tuesday night when someone fired shots into his car on North Ninth Street in the city, authorities said. An 18-year-old woman with him was wounded.\nThree shots were fired at Ninth and Liberty streets at 8:55 p.m. as Johnny A. Lopez drove south on Ninth, witnesses said. Lopez' car backed up north into a stop sign and trash can, but then it drove forward half-way down the block, finally crashing into a parked car.\nAllentown police Chief Keith Morris said police rushed to the scene and found the young man dead in his car.\nThe Lehigh County coroner's office Wednesday identified the driver as Lopez, of the 1300 block of Turner Street. Coroner Scott Grim said Lopez died of a gunshot wound and an autopsy is scheduled for Wednesday morning.\nThree neighbors said they believe the shooter was on foot, but they did not see who had the gun.\n\"There also was a female in the vehicle who was transported to the hospital with non-life-threatening injuries,\" Morris said. The woman had wounds to a leg, according to emergency radio reports.\nMorris said Tuesday night that he could not describe the incident because police have a lot to check out first.\n\"The investigation is in the initial stages,\" he said. No arrest had been made.\nAllentown police strung crime-scene tape to close off Ninth Street between Liberty and Gordon streets. A blanket covered several windows of the crashed car for hours until the body was removed.\nRelatives of Lopez were on the scene within a half hour. Young women sobbed on Liberty Street as they learned what happened. Other relatives arrived hours later. No one was allowed near the car.\nAt the intersection police set down markers, numbered 1, 2 and 3, indicating the officers had found bullet casings or other evidence there.\nAcross Liberty Street, a stop sign and public trash can lay on the sidewalk where neighbors said the driver tried to back away from the shooter.\nMorris said the city police Criminal Investigations Division, the coroner's office, the district attorney's office and the county Homicide Task Force are involved in the inquiry.\n— Frank Warner"}