{"uri": "http://chicago.cbslocal.com/2016/11/19/police-11-shot-2-fatally-in-first-8-hours-of-weekend/", "title": "Police: 7 Dead, 16 Wounded In Chicago Weekend Shootings", "dct": "Sat, 19 Nov 2016 11:04:00 GMT", "id": "23829869ac96d855134a87b739491454", "content": "CHICAGO (CBS) — Seven people were killed, including the teenage grandson of U.S. Rep. Danny Davis, and at least 16 others have been wounded in shootings across the city since Friday evening, according to Chicago Police.\nThe congressman’s grandson was shot about 6:45 p.m. Friday in the 5600 block of South Princeton, authorities said. Javon Wilson, 14, was inside his Englewood neighborhood home when two people broke in, started arguing with the boy and then shot him in the head. Wilson was pronounced dead at the scene at 7:32 p.m., according to the Cook County medical examiner’s office.\nIn a tweet Saturday night, police spokesman Anthony Guglielmi said two juveniles were in custody and were being classified as suspects in the homicide. Charges of first-degree murder were expected and more information would be released once they were charged.\nThe shooting was not random and was not the result of a home invasion, but stemmed from a dispute between teenagers about gym shoes, Guglielmi said.\nThe most recent fatal shooting happened about 3:20 a.m. Sunday in the Chatham neighborhood on the South Side. A 40-year-old man was arguing with an acquaintance who pulled out a gun and opened fire in the 7800 block of South Michigan police said. The man was shot in the abdomen and taken to Storger Hospital, where he was pronounced dead.\nLess than 30 minutes earlier, a 24-year-old man was gunned down in the Wicker Park neighborhood on the North Side. He was walking about 3 a.m. north in the 1300 block of North Moorman when someone in a red Nissan Pathfinder fired shots, striking the man multiple times, police said. The man was taken to Stroger Hospital, where he was pronounced dead.\nAbout 12:50 a.m. Sunday, a 22-year-old man was shot to death in the West Englewood neighborhood on the South Side. Officers responding to a call of shots fired found Odell Jones lying face down on the sidewalk in the 6400 block of South Oakley, police and the medical examiner’s office said. Jones, of the 6400 block of South Claremont Avenue, had been shot in the back and was pronounced dead at the scene.\nSaturday morning, an 18-year-old man was killed and a 13-year-old boy was wounded in a West Side Austin neighborhood shooting. The pair were walking at 11:15 a.m. in the 1400 block of North Latrobe when someone fired shots in their direction. The man was shot in the head and pronounced dead at the scene, police and the medical examiner’s office said. said. His identity has not yet been released. The boy was shot in the face and taken to Mount Sinai Hospital in serious condition.\nAnother fatal shooting happened about two hours earlier in Englewood, when a 22-year-old man was found shot in the head at 9:12 a.m. in the 6700 block of South Morgan, police said. He was pronounced dead at the scene. His name has not been released.\nA man was fatally wounded in a shooting shortly after midnight Saturday in the Gage Park neighborhood on the Southwest Side. Officers found the 27-year-old about 12:15 a.m. with gunshot wounds to the head and body in the backyard of a home in the 3500 block of West 57th Street, police said. He died at Mount Sinai Hospital. The medical examiner’s office has not released his name.\nThe most recent nonfatal shooting happened early Sunday in the West Rogers Park neighborhood on the Northwest Side. Officers called about 4:30 a.m. to the 2400 block of West Devon discovered a 28-year-old man lying in an alley, police said. He was shot multiple times in the back and taken to St. Francis Hospital in Evanston in critical condition.\nAbout 11:50 p.m. Friday, CPD officers fatally shot a 26-year-old man in West Englewood when he refused to drop his gun after they saw him shoot a 26-year-old man during a fight in the 2000 block of West 69th Street, according to police.\nBoth men were taken to Christ Medical Center in Oak Lawn, where the alleged gunman died and the initial victim was in critical “but stable” condition, officials said. The Independent Police Review Authority is investigating the officers’ use of force, but has not released a statement.\nAt least 13 more people were shot in other attacks across Chicago between 4 p.m. Friday and 4:30 a.m. Sunday.\n(Source: Sun-Times Media Wire © Chicago Sun-Times 2016. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)"}