{"uri": "http://www.startribune.com/police-searching-for-suspects-who-fired-into-crowd-at-blm-protest-outside-4th-precinct/353154811/", "title": "3 men in custody, 1 released in Minneapolis 4th Precinct protest shooting", "dct": "Wed, 25 Nov 2015 00:00:00 GMT", "id": "eb6f5ae93de35d032f6160e7a1417412", "content": "Nearly 1,000 people marched to City Hall on Tuesday, less than a day after five protesters were shot near a Black Lives Matter demonstration, an apparently racially motivated attack that pushed Minneapolis into the national spotlight.\nMinneapolis police said Tuesday that they have arrested three men in connection with the shooting. Allen Lawrence “Lance” Scarsella III, 23, was arrested in Bloomington. Sources said Nathan Gustavsson, 21, of Hermantown, and Daniel Macey, 26, of Pine City, were taken into custody after they turned themselves in. All three suspects are white. Earlier Tuesday, police arrested a 32-year-old Hispanic man in south Minneapolis, but he was later released because, police said, he was not at the scene of the shooting.\nAuthorities are weighing whether to treat Monday’s shooting as a hate crime, according to sources familiar with the investigation.\nIn a video message posted on Facebook, Mayor Betsy Hodges said she “abhors” Monday night’s violence and that “those attacks have no place in our city.”\nMinneapolis Police Chief Janeé Harteau on Twitter called the officers “true professionals” and noted that “MPD worked nonstop through the night to bring justice in last night’s shooting.” She did not comment further on the shooting Tuesday.\nThe gunfire erupted around 10:45 p.m. Monday on Morgan Avenue N. about a block north of the precinct station where protesters have staged demonstrations and camped out since Nov. 15, when police fatally shot Jamar Clark, an unarmed 24-year-old black man.\nMiski Noor, a media contact for Black Lives Matter, said “a group of white supremacists showed up at the protest, as they have done most nights.”\nWhen about a dozen protesters attempted to herd the group away from the area, Noor said, they “opened fire on about six protesters,” hitting five of them. The victims — all black men ages 19 through 43 — were taken to local hospitals. Their injuries were not life threatening.\nIn Minneapolis, protesters gathered Tuesday afternoon outside the Fourth Precinct to reiterate demands for justice in Clark’s death and commit to staying at their encampment.\nOne of the Monday shooting victims returned to the scene, leaning heavily on a cane. Wesley Martin said he was shot after he and a group of others chased the suspected gunmen toward an alley off Morgan Avenue.\n“I’ve been out here every night since it started, and you know when people look suspicious,” Martin said.\nThe bullet ripped through his right knee, Martin said. He said his 19-year-old friend Teven King was also shot, in the stomach.\nAs Martin spoke, his cousin Leroy Williams nodded in agreement. Williams said one of Clark’s nephews, Cameron Clark, 24, was among the shooting victims.\nBy 3 p.m., a crowd of about 1,000 marchers with banners headed to City Hall, pausing at Clark’s makeshift memorial on Plymouth Avenue along the way.\nThe shooting appeared to draw new supporters to the cause.\nFelicia Washington Sy, a psychotherapist, said she left work early Tuesday afternoon, telling her boss, “I need to be there.”\nIt was the first time Sy had seen the encampment with her own eyes.\n“[I came out] because of the overwhelming feeling of injustice, sadness and my responsibility to take part and say ‘that’s not OK,’ ” she said.\nTwo Minneapolis squad cars guided the group over interstate overpasses and through downtown streets.\nWhen protesters reached City Hall, they continued to N. 4th St., blocking the road in front of the federal courthouse.\nA few protesters attempted to enter the courthouse, but doors were locked.\nCity officials did not come out to meet the crowd, and protesters were told that City Hall was on lockdown.\nAfter rallying in the street for about an hour, the group turned to walk back to the Fourth Precinct station via Washington Avenue.\nMeanwhile, protesters in Chicago also took to the streets after a white police officer was indicted on murder charges in the 2014 shooting death of a 17-year-old black teen. A graphic video released Tuesday shows the officer shooting the teen repeatedly.\nThe FBI, one of the outside agencies investigating Clark’s death, is “aware of the incident and is coordinating with the Minneapolis Police Department to assess the facts and determine if further federal action” is warranted, spokesman Kyle Loven said.\nBen Petok, a spokesman for U.S. Attorney Andrew Luger’s office, said the attorney’s office and the Department of Justice civil rights division are also taking a look.\nProtesters have raised questions about Minneapolis police officers’ knowledge of and response to the Monday shooting. Asked about those questions Tuesday, Scott Seroka, a police department spokesman, said, “At this point in the investigation, we know that the people that have been arrested have no connection to the MPD.”\nCouncil President Barb Johnson said the shooting Monday evening was a “continuation of a stressful time for the neighbors that live in the area surrounding the Fourth Precinct,” adding that “they deserve some peace and some rest.”\nJohnson disputed comments that police had taken too long to react to the shooting, and said officers responded in three minutes. She said she believes it’s time for the demonstrations to end, in part because they are attracting attention from outside groups.\nAfter the shooting, Jamar Clark’s brother, Eddie Sutton, urged an end to the encampment, expressing concern for the safety of the protesters. Clark’s funeral is scheduled for Wednesday.\nLt. Bob Kroll, president of the police union, said he is frustrated that the chief allowed protesters to pitch any tents at the North Side precinct building. Instead of patrolling the streets, officers from the precinct have to guard and manually open the gate to a parking lot where the squads and their vehicles are stored.\nThey monitor the encampment from the precinct’s windows and security cameras while several SWAT units are on standby, he said.\nTo backfill, officers from other precincts have to patrol the North Side communities. This takes them away from their own areas and potentially leads to longer response times to 911 calls, he said.\n“This can only get worse,” he said. “Our officers feel helpless, like they are sitting ducks.”\nAdditional security is in place for City Hall on Wednesday, including additional security guards at entrances and staff being asked to show identification to enter, said Casper Hill, a spokesman for the city. They were also advised that the federal building across the street imposed additional security measures.\nStaff writers Liz Sawyer, Karen Zamora, Natalie Daher and Erin Golden contributed to this report.\nlibor.jany@startribune.com 612-673-4064\ndavid.chanen@startribune.com 612-673-4465"}