{"uri": "http://www.thenewstribune.com/news/local/crime/article89437137.html", "title": "Second suspect arrested in deadly Lacey-area shooting", "dct": "Wed, 13 Jul 2016 14:49:00 GMT", "id": "2d7ceb4cac8b3a289e80af18619d0c64", "content": "The Thurston County Sheriff’s Office has arrested a second suspect on suspicion of murder in connection to a June 22 deadly shooting on Dutterow Road.\n“We think the people who were the agressors in this are in custody,” said Sgt. Carla Carter. “There is no threat to public safety.”\nEnrique “Ricky” Lamere, 23, had previously been identified by the Sheriff’s Office as a material witness in the case. He was booked into the Thurston County jail on June 29, and charged with unlawful possession of a controlled substance with intent to deliver.\nBut on Wednesday afternoon, the Sheriff’s Office announced that Lamere had been re-booked into the jail on suspicion of first-degree murder, second-degree murder, attempted murder and first-degree burglary. According to the Thurston County Prosecutor’s Office, Lamere is scheduled to appear in court on Thursday afternoon.\nAnother suspect, 24-year-old Dugan Lawton, was also arrested June 29. He is charged in Thurston County Superior Court with three counts of aggravated first-degree murder, one count of first-degree attempted murder and one count of first-degree burglary while armed with a firearm. He pleaded not guilty to the charges on July 12.\nTwo men and one woman were shot to death early June 22 in a travel trailer on Dutterow Road: 31-year-old Terron R. McGrath of Olympia, 28-year-old Jackson L. Edens of Olympia and 36-year-old Gerald M. Berkey of Elma. A third man also was shot, but is recovering.\nSgt. Carla Carter declined to comment on Lamere’s alleged role in the shooting, and said the investigation is still ongoing. He has been in jail since his June 29 arrest.\nShe said that because the investigation hasn’t concluded, more suspects could still be arrested.\nWashington State Patrol records show that Lamere has four prior felony convictions. He was convicted in 2009, at the age of 17, of first-degree robbery and sentenced to 12 to 36 weeks in a juvenile detention facility. He was convicted in March of this year of unlawful possession of a firearm, unlawful possession of a controlled substance and bail jumping. He was sentenced to nine months in custody, with credit for time served.\nDeputies found a half-pound of methamphetamine and a baseball-sized lump of black tar heroin in the trailer on Dutterow Road, along with several thousand dollars in cash, a handgun and five rifles, according to the Sheriff’s Office.\nMcGrath and Edens lived in the trailer.\nAccording to court documents released following Lawton’s arrest, much of the evidence against Lawton came from Lamere. The Sheriff’s Office had sent out a notice Monday asking for information about Lamere’s whereabouts and located him June 28 at a home on Shelby Lane Southeast in Thurston County.\nAbout the same time, a silver Honda Accord left the home. A detective pulled the car over after noticing that it had no license plates, according to court documents. The driver identified himself as Lawton, and he was arrested on an outstanding state Department of Corrections warrant. He was taken to the Nisqually Jail.\nWhen detectives interviewed Lamere, he told them that he had been present at the time of the shooting, and gave an account similar to that of the surviving shooting victim. He said at that time that Lawton was the only shooter, and that he had come to the trailer with the intent of robbing Jackson, according to court documents.\nAmelia Dickson: 360-754-5445, @Amelia_Oly"}