{"uri": "http://www.king5.com/news/crime/3-dead-in-shooting-near-olympia/252302880", "title": "Weapons, meth found at scene of Lacey triple homicide", "dct": "Wed, 22 Jun 2016 00:00:00 GMT", "id": "51069496458440cd94d5d7d5b2a6e072", "content": "OLYMPIA, Wash. -- Detectives have not been able to find the gun used in a Thurston County quadruple shooting, but they did find other weapons and drugs on the property Wednesday.\nAccording to detectives, early Wednesday morning a 30-year-old man called 911 saying he had been shot and three people inside a trailer had been killed.\nWhen deputies arrived at the property, in the 500 block of Dutterow Road near Lacey, the man said he did not know where he was. He was taken to St. Peter Hospital in Olympia, where he underwent surgery and was listed in stable condition.\nDetectives have spoken with the man who survived the shooting and called 911, but they say he's too \"incoherent\" to be of much help. They don't consider him a suspect, but say until they interview him more thoroughly, he won't be ruled out as a suspect.\nAfter receiving search warrants, detectives said they found a half-pound of methamphetamine in the trailer along with six guns and cash from a trailer.\nInvestigators also were seen removing what appeared to be an Army Kevlar vest, a shotgun and a crossbow from a vehicle parked in the property’s backyard.\nAuthorities have not released the identities of the people found dead on the property, but they said the victims were a 31-year-old woman from the Olympia area, a 28-year-old man from the Olympia-area and a 34-year-old from Elma.\nNeighbors said they heard what they thought were fireworks coming from the property Tuesday and again Wednesday morning. Neighbors said people were seen coming and going from the property at all hours.\nThe residents were thought to be drug dealers, said one neighbor.\nInvestigators said it was too early in the investigation to say if the killings were drug-related.\nCopyright 2016 KING"}