{"uri": "http://www.nydailynews.com/new-york/nyc-crime/suspect-shot-men-east-side-identified-ex-con-article-1.2852447", "title": "Suspect who shot four men on Lower East Side identified as ex-con on parole", "dct": "Mon, 31 Oct 2016 14:22:00 GMT", "id": "3a4c98e53617e119f51799c37194ced6", "content": "Police on Monday identified the suspect in the shooting of four men on the Lower East Side as an ex-con on parole for another shooting.\nCops say Miguel Maldonado, 42, blasted the four victims Sunday for revenge after they beat him and his cousin up hours earlier. Police released a photo of Maldonado Monday and are asking the public’s help tracking him down.\nSunday’s violence began when Maldonado and his cousin got in a brawl with a group of men while hanging out on Pitt St. near Stanton St. about 2:10 a.m., police said.\nTheir adversaries fled after pummeling Maldonado and his cousin, who were intoxicated and uncooperative when police later arrived. Maldonado or his cousin shouted, “This isn’t over” and “I’ll be back,” sources said.\nIt was a promise kept.\nMaldonado allegedly returned to the area and fired about six shots at a group of men standing on Ridge St. near Stanton St., a block away from where the assault occurred, around 6:10 a.m., police said.\nThe gunfire left Oscar Delgado, 23, who lives in the area, with gunshot wounds to his abdomen and leg. Anthony Estevez, 25, was shot in the left shoulder and Jose Marte, 34, was hit in the left leg, sources said.\nEmergency personnel brought the three victims to Bellevue Hospital with non-life threatening wounds.\nA fourth man who may have been grazed when a bullet pierced his pocket, wallet and the cash inside later arrived at the hospital and spoke with police about the shooting, sources said.\nPlease help us find this individual who shot 4 people @ #les. If you have any info please call #crimestoppers 800-577-TIPS. pic.twitter.com/nxmT27DMED\n— NYPD 7th Precinct (@NYPD7Pct) October 31, 2016\nMaldonado is no stranger to violence. He has a dozen prior arrests, including one in 2007 for a non-fatal shooting in Coney Island.\nHe served four years at Queensboro Correctional Facility for assault and was released in January 2014. He is on parole through April 28, 2019.\nAnyone with information on Maldonado is asked to call CrimeStoppers at (800) 577-TIPS. All calls will be kept confidential."}