{"uri": "http://www.usatoday.com/story/news/nation/2013/05/13/new-orleans-parade-mothers-day-shooting-suspect-video/2154823/", "title": "Police ID suspect in New Orleans parade shooting", "dct": "Mon, 13 May 2013 00:00:00 GMT", "id": "91b46cbd03234fd329ac5b7b61dffb7a", "content": "Authorities have identified a 19-year-old man as a suspect in a Mother's Day parade shooting in New Orleans that left 19 people injured.\nPolice Superintendent Ronal Serpas said they are looking for Akein Scott, whom multiple people identified as the shooter.\n\"The important thing for Akein Scott now is to turn himself in,\" Serpas said, standing outside of police headquarters on Monday evening.\nSerpas said it was too early to say whether Scott was the only shooter. Earlier, police had said that three gunmen were involved and that at least two different weapons were used.\nSurveillance video of Sunday's mass shooting shows the crowd dispersing and some falling to the ground before one person in a white T-shirt and dark pants flees.\nOf the 10 men, seven women and two 10-year-olds who were wounded, 11 were admitted to Interim LSU Public Hospital. Three remained in critical condition Monday and one was stable, a hospital spokeswoman said. Seven were discharged.\nThe two children, a boy and a girl, were reported in good condition with graze wounds to the body, police said.\nThe remaining victims were treated at other hospitals.\nRemi Braden, director of public affairs for the New Orleans Police Department, said that many victims suffered graze wounds from ricocheting bullets and that \"most of the wounds are not life-threatening.\"\nEarlier, police announced a $10,000 reward for information leading to arrests and indictments in the case.\nNew Orleans Mayor Mitch Landrieu urged anyone with information on the \"very tragic\" shooting in the 7th Ward to contact authorities, The Times-Picayune newspaper reported.\n\"These kinds of incidents are not going to go unanswered,\" the mayor said Sunday evening. \"We're going to be very, very aggressive. There were hundreds of people out there today. So somebody knows who did this and the way we're going to stop the violence together in this city is everybody come together. We really need help. ... We will find them.\"\nLandrieu called for \"a community response\" at 6 p.m. at the corner of Frenchmen and North Villere streets, where the shooting occurred. \"Please come out to show solidarity in protecting our culture and delivering a message to stop the shootings,\" he said in an email.\nThe shots were fired at 1:47 p.m. Sunday during what is locally referred to as \"a second-line parade.\".\nThe Times-Picayune said there were about 200 people at the event when gunfire erupted.\nSecond-line parades are loose processions in which people dance down the street, often following a brass band. They can be impromptu or planned and are sometimes described as moving block parties.\nThe parade included police officers and was about two blocks long, police said.\n\"When the end of the parade reached North Villere and Frenchmen ... shots were fired from different guns,'' Flot said in a statement. \"Immediately after the shooting our officers saw three suspects running from the scene.''\nShermaine Tyler, 32, who lives nearby, told The Times-Picayune that a man collapsed onto her after being shot.\n\"Me and mom were going to the second line. I told her I didn't want to go because there are always shots at a second line,\" Tyler said. \"And the second I heard shots, I heard shots fired, we ran outside and one man fell in my lap who had been shot.\"\nA social club called The Original Big 7 organized Sunday's event. The group was founded in 1996 at a housing project, according to its MySpace page.\nThe neighborhood where the shooting happened was a mix of low-income and middle-class row houses, some boarded up. As of last year, the neighborhood's population was about 60% of its level before Hurricane Katrina devastated New Orleans in 2005.\nContributing: Alia E. Dastagir in Mclean; The Associated Press"}