{"uri": "http://m.wcvb.com/news/ag-autopsies-complete-on-3-found-dead-in-bedford/32083418", "title": "AG: Bedford, New Hampshire, mother killed 2 children, herself", "dct": "Tue, 31 Mar 2015 00:29:00 GMT", "id": "a539e9861c8c533984f211580a7db44f", "content": "Nina Obukhov killed 2 daughters, police say\nBEDFORD, N.H. —\nInvestigators said a Bedford woman appears to have shot and killed her two daughters before killing herself.\nThe Attorney General's Office said Nina Obukhov, 34; Katherine Obukhov, 8; and Elizabeth Obukhov, 6, were all shot in the head at 17 McAfee Farm Road.\nPolice spent the past two days at the home on McAfee Farm Road gathering evidence as the community waited to hear how the three people inside died.\n\"The manner of death of the children has been determined to be a homicide,\" Assistant Attorney General Jay McCormack said.\nThe Attorney General's Office said police got a 911 call Saturday morning from Nina Obukhov's husband, Alexey Obukhov.\n\"I can't make any statements regarding his whereabouts or where he is,\" McCormack said.\nWhen police arrived at the home, they found the bodies of the two girls and Nina Obukhov.\n\"That's one of the focuses of our investigation going forward, is to help determine why this might have happened,\" McCormack said.\nOn Monday, a disaster response crew went through the house and cleaned.\n\"I don't know how to process it either,\" Bedford school superintendent Chip McGee said. \"It's incredibly sad and something that doesn't make sense.\"\nMcGee said Elizabeth Obukhov went to a private kindergarten, but Katherine Obukhov was in third grade at Riddle Brook Elementary School. He said grief counselors will be at the school all week while teachers try to keep a normal routine.\n\"So that on top of their having to process this loss, they don't also have to figure out why they didn't get to go to gym today or missed art class,\" he said.\nMcGee said it's important for parents to listen to their children.\n\"You don't know what they're thinking and to give your kids a chance to talk,\" he said. \"Another is to recognize that they're going to hear things and know things.\"\nInvestigators wouldn't say exactly when the shootings happened.\nThey said they're waiting to hear more from the medical examiner before releasing more information."}