{"uri": "http://www.newson6.com/story/21303635/man-in-custody-after-fatal-shooting-at-tulsa-apartments-near-spartan-college", "title": "Man In Custody After Fatal Shooting At Tulsa Apartments Near Spartan College", "dct": "Fri, 22 Feb 2013 15:20:00 GMT", "id": "66641c9bddd8750265ec77e44003d979", "content": "TULSA, Oklahoma -\nPolice have a 41-year-old man in custody after a fatal shooting at Spartan Landing Apartments in North Tulsa.\nTulsa Police, Fire and EMSA responded just after 9 p.m. Thursday, February 21, 2013, to the apartments in the 1200 block of North 89th East Avenue.\nPolice say four Spartan College students were shot, both inside an apartment and in the parking lot.\nEMSA says one victim, Chaz Fain, 18, was pronounced dead at the scene. Police say he is Tulsa's 15th homicide of the year.\nThree other men, two 18-year-olds and one 19-year-old, are in serious condition at area hospitals, EMSA says.\nThe majority of the residents at Spartan Landing Apartments, just behind Spartan College of Aeronautics, near Pine and Memorial, are Spartan students.\nPolice arrested 41-year-old Mark Hopkins at a nearby business complex at around 10:30 p.m. They said the weapon was not recovered.\nPolice say Hopkins' hands were injured from climbing fences.\nTulsa Police Sergeant Dave Walker credits Hopkins' apprehension to the patrol officer's quick response. He also said several citizens called in to report suspicious activity in the area of the murder which led to officers observing Hopkins in the parking lot at 9900 East Admiral less than an hour and a half after the shooting.\nA News On 6 crew was there as police and EMSA loaded Hopkins into an ambulance to receive medical treatment before being brought downtown.\nPolice think Hopkins is acquainted with the victims and may also be a student.\nHopkins was booked into the Tulsa County jail on one complaint of first degree murder and three complaints of shooting with intent to kill.\nSome of the information in this news story may have been provided by law enforcement with the request News On 6 inform the public of, and/or assist in locating a person in connection with, a police investigation. News On 6 can make no independent verification of the accuracy of the information, photographs and/or video provided to it by police or other law enforcement agencies."}