{"uri": "http://www.philly.com/philly/news/20160920_Bouncer_shot_in_rampage_has_3_jobs__2_kids__and_is_married_to_a_cop.html", "title": "Bouncer shot in rampage has 3 jobs, 2 kids, and is married to a cop", "dct": "Tue, 20 Sep 2016 00:00:00 GMT", "id": "57473aa390caa8cf21dc03fa0e7c0f4f", "content": "Nicole Washington was working at her second job, delivering pizzas in West Philadelphia on Friday night, when she heard the helicopters overhead and saw dozens of police cars speeding through the area.\n\"I was like, 'Oh, my God, where are all these cops running to?' \" she said Monday. \"I didn't know somebody was going on a rampage and shooting everybody.\"\nWashington, 33, also didn't know that her older brother, Martice \"Marty\" Washington, was among the shooter's six victims.\n\"My mother called me asking where I was at. She said, 'You have to come take me to the hospital, Marty just got shot,' \" Washington recalled. \"We didn't know exactly where he got shot or how severe he was shot.\"\nMartice Washington, 42, was working one of his three jobs - as a manager and security guard at the Maximum Level Lounge, 5118 Sansom St. - when Nicholas Glenn opened fire on the bar shortly after 11:20 p.m., striking him in both legs, police said. Glenn, 25, also shot a bartender in a leg at the establishment before running away.\nGlenn then shot two more people in a parked car and a University of Pennsylvania police officer who tried to stop him, police said. Responding officers then fatally shot Glenn. Police said Glenn had on him a note with the heading \"Doomed People,\" in which he wrote of his disdain for police and probation officers. He also wrote about his belief that the world and the people in it, including himself, were doomed.\nGlenn's rampage began when he opened fire on Philadelphia Police Sgt. Sylvia Young as she sat in her patrol car at 52nd and Sansom Streets. Police said Glenn fired 18 times into Young's cruiser, hitting her six times in the shoulder, an arm, and the chest.\nWashington and the bartender - whose identity had not been released as of Monday afternoon - survived the rampage. Both remained hospitalized in stable condition Monday. University of Pennsylvania Police Officer Ed Miller, 56, was released from the hospital Sunday, and Young, 46, remained hospitalized in stable condition Monday.\nThe couple in the car - 25-year-old Sara Salih and her 36-year-old companion - were not as fortunate. Salih was pronounced dead two hours after the shooting. Her companion - whose identity had not been released - remained hospitalized in critical condition with gunshot wounds to an arm and his chest.\n\"He was really out there to kill everybody,\" Nicole Washington said of her brother's shooter. \"My heart goes out to the girl that was just sitting in her car.\"\nWashington said she and her brother were born and raised in West Philly. They are each other's only surviving siblings. Their brother Kevin died of a heart attack in 2008, she said.\nMartice Washington is married to a Philadelphia police officer, and they have a son in high school and a daughter, his sister said.\nWashington is a \"hard-working man,\" according to his sister. He works for the city's Water Department as a laborer, for the Maximum Level as a manager and security guard, and at a shoe store, she said.\n\"He's always been a hard worker like that,\" Nicole Washington said. \"We get it from my mom. She's worked a lot of jobs as well.\"\nOn Friday, after receiving word of her brother's shooting, Nicole Washington dropped everything, picked up her mother, and drove to Penn Presbyterian Medical Center.\nShe said her brother's wife had just returned home with their son from a football game when she heard the commotion, called a colleague on the force, and learned that her husband had been shot.\nWashington said her brother remained hospitalized Monday and had to undergo a few more tests, but he was otherwise \"doing great,\" she said.\nShe despaired at the violence that one seemingly unhinged gunman was able to inflict on her neighborhood - and her big brother.\n\"That night was crazy,\" she said. \"It was unbelievable.\"\nIn a post on Maximum Level Lounge's Instagram page, a bar manager named Awwalah Muhammad wrote that the incident had nothing to do with the business or with any employee or patron.\nAccording to posts on Maximum Level's Twitter and Instagram pages, the business reopened the day after the shooting.\n215-854-4225@FarFarrAway"}