{"uri": "http://6abc.com/news/1-officer-1-civilian-injured-in-west-philadelphia-shooting/1515297/", "title": "Surveillance video captures part of West Philadelphia shooting rampage", "dct": "Mon, 19 Sep 2016 00:00:00 GMT", "id": "6ad67c9c72f70871097b5fe8ee2fe50e", "content": "WEST PHILADELPHIA (WPVI) --\nSurveillance video captured part of a shooting rampage in West Philadelphia that left one woman dead and five others injured, including two police officers.\nThe suspect, identified by investigators as Nicholas Glenn, was eventually cornered in an alley and fatally shot by police.\nIn a press conference on Saturday, Commissioner Richard Ross said Glenn had \"a pretty significant past\" and \"was well known to the police department.\" The suspect is believed to have acted alone and there's no indication so far that he had been radicalized.\n\"He was hell-bent on hurting a lot of people,\" Ross told reporters. \"We still aren't absolutely clear as to why.\"\nGlenn was found to be in possession of a note with the heading, \"Doomed People,\" which police say indicated his hatred toward his probation and parole officers and police, among other unclear statements.\n\"Clearly, there's some issues that were going on there,\" Ross told reporters.\nIt all started around 11:18 p.m. Friday on the 5200 block of Sansom Street.\nPolice say 46-year-old Sgt. Sylvia Young, assigned to the 22nd District and a 19-year veteran with the Philadelphia Police Department, was working a patrol detail in the 18th District.\nSgt. Young was sitting in her patrol car, police say, when she was ambushed by Glenn.\nThe suspect fired at Sgt. Young at close range 18 times with a 9mm Ruger, striking her in the left shoulder, arm and torso area of her body, according to police.\nOne or two bullets were lodged in her bullet-proof vest, and her service weapon was struck twice, disabling it.\nShe was taken to Penn Presbyterian Medical Center in stable condition.\nGlenn fled eastbound with arriving officers giving chase.\nThe suspect then passed Maximum Level Lounge, located on the 5100 block of Sansom Street, where he fired about five shots into the bar.\nA 42-year-old male manager was hit in both legs, and a 41-year-old female bartender was hit in her right ankle.\nBoth victims were taken to Penn Presbyterian Medical Center in stable condition.\nGlenn continued to flee eastbound on Sansom when he approached a 2011 Nissan Altima, occupied by a 36-year-old man and a 25-year-old woman.\nThe suspect fired multiple shots into the vehicle, police say, striking the man in his arm and chest and the woman multiple times in her chest.\nBoth victims were taken to Penn Presbyterian Medical Center where the woman was pronounced dead at 1:56 a.m. Her identity has not yet been released.\n\"Our hearts and our prayers go out to her family in particular as well as all the other victims,\" said Commissioner Ross.\nGlenn then continued eastbound on Sansom. Two responding officers, assigned to the 16th District, were traveling westbound on the 4800 block of Sansom Street when the suspect fired at the officers, striking their vehicle. The officers were uninjured.\nHe continued to flee police when he was confronted in the 100 block of South 48th Street by University of Pennsylvania police Officer Ed Miller.\nMiller, 56, was shot in the hip and leg area.\nHe was taken to Penn Presbyterian Medical Center where he was treated and released on Sunday.\nA shootout ensued between Glenn and police officers. The suspect was shot multiple times and pronounced dead at 11:45 p.m.\nYoung and the three civilians hit by gunfire are all in stable condition and \"good spirits,\" the commissioner said.\nPhiladelphia Mayor Jim Kenney spoke to Action News on his meeting Saturday with the police officers:\n\"I had the opportunity to be with both police officers this evening, and their families. One officer was cracking jokes with his kids and wife. The other officer was talking with her family. So we are happy, very blessed that that's the way it turned out. I think we have to keep them in our prayers. The civilians, there are some seriously hurt, and still in various degrees of being treated. And I think all in all it was really a terrible scary night. But our officers turned out okay, and hopefully the civilians will turn out okay.\"\n\"I cannot say enough about the response of the police officers last night. Absolutely remarkable,\" Ross said. \"The restraint that they used is nothing short of miraculous.\"\nRoss said the gunman was carrying at least three magazines and multiple live rounds. A relative of the suspect aided police in finding a location where investigators believe Glenn had been staying most recently. Inside, Ross said, police found more ammunition.\nIt was later determined Glenn discharged his firearm at least 51 times during this incident.\n\"This was a horrific night,\" the commissioner said. \"He carried out one of the most violent acts in Philadelphia we've seen in a long time.\"\nPolice say officers will be riding two to a car until further notice."}