{"uri": "http://wkrn.com/2017/01/14/police-2-killed-in-antioch-shooting/", "title": "2 teens charged in shooting death of 2 other teens in Antioch", "dct": "Sat, 14 Jan 2017 18:30:00 GMT", "id": "61e986c35937efa9787fcbbe8c29fa5f", "content": "There are two videos in this story. Click here to view them on your mobile app.\nNASHVILLE, Tenn. (WKRN) – Two 16-year-olds were charged with criminal homicide for the deaths of two other teenagers in Antioch Saturday night.\nThe teens were shot and killed at a home in the 700 block of Piccadilly Row around 4:30 p.m.\nMetro police identified one victim as 16-year-old Eduardo Trejo, who lived nearby. The other victim has been identified as 15-year-old Jonathan Martinez.\nMetro police reported Anthony Sinor and Mitchell Mann, both 16, were charged with two counts of criminal homicide each.\nThe homicide investigation indicates Sinor suspected Trejo of burglarizing his home recently and reportedly conspired with Mann to lure Trejo to his residence Saturday afternoon, according to police.\nWhen officers arrived to the scene, they found the two teenage victims with fatal gunshot wounds on the home’s back deck, which is located next to Sinor’s bedroom.\nMetro police said Sinor called 911 and said a shooting took place at the home during an attempted burglary. Sinor was detained and the suspected murder weapon, a semi-automatic pistol, was recovered.\nSinor later admitted to police there was no burglary attempt at the home.\nMitchell had fled the scene by the time officers arrived. He came to the South Precinct Saturday night and met with detectives.\nBoth Sinor and Mitchell are being held in juvenile detention.\nBonnie Belle Lopez says she and Trejo were close friends.\n“I just hate that he’s gone, he was like my best friend. It feels like a dream but it’s really not, because it really happened,” she told News 2.\nLopes says she is neighbors and classmates at Antioch High School with both Trejo and accused shooter, Anthony Sinor Jr.\n“We are going to place flowers for Eduardo to tell him that we love him and miss him,” she cried.\nA GoFundMe account has been set up for Eduardo Trejo. To make a donation, click here."}