{"uri": "http://www.trentonian.com/general-news/20161214/shooting-arrest-in-burlington-and-trenton-robber-nabbed-in-the-dec-14-2016-police-blotter", "title": "Shooting arrest in Burlington, and Trenton robber nabbed in the Dec. 14, 2016 Police blotter", "dct": "Wed, 14 Dec 2016 18:23:00 GMT", "id": "86e3b3a795648950a586505eb2aa0376", "content": "The following information was provided by police, unless otherwise noted:\nRobbery arrest: Police arrested Michael D. Powell, 22, of Trenton in Hamilton on and active warrant for a robbery that occurred at 10 p.m. on September 24 in the area of Randall Avenue and Elm Street. Trenton Police Lt. Stephen Varn said that the 18-year-old male victim was struck in the back of the head and knocked to the ground in that incident. Powell then took the victim’s wallet. The robbery left the victim with contusions to his head, face and neck. Based on information developed by Det. Tara Dzurkoc, a warrant was issued for Powell’s arrest. He was charged with strong-arm robbery, his bail information was not immediately available.\nUnwanted exposure: Police arrested Jamie A. Pineda, 28, of Trenton on Dec. 12 after Det. Gregory Hollo conducted an investigation into a report given by a 39-year-old woman. Trenton Police Lt. Stephen Varn said the woman reported that Pineda exposed himself to her on several occasions in the 100 block of Grand Street. The victim and Pineda live together, Varn said. He was charged with lewdness and his bail set at $2,500 with a 10 percent option.\nPackage pirate: Police arrested Juan Maldonado-Perez, 33, of Trenton after he allegedly stole packages from a porch in the 500 block of Emmett Avenue in the city’s Villa Park section. Trenton Police Lt. Stephen Varn said that the incident occurred around 4:48 p.m. Inside the box were lotions and perfumes from Victoria’s Secret. Police were given a description of the alleged suspect and later located him around 1:40 a.m. on Wednesday in the area of Mott Street and Whittaker Avenue and stopped him. Police found him in possession of some of the items taken in the theft. Additionally he was found in possession of two hypodermic needles and a burnt glass pipe. He also had two active warrants for his arrest, Varn said.\nAdvertisement\nShooting: Police arrested a 17-year-old suspect in connection with a shooting that sent a 17-year-old Moorestown boy to the hospital. Police said they arrested the teen around 4:53 p.m. on Tuesday near the corner of York Street and Jones Avenue where the shooting occurred last Thursday. Police said that last Thursday around 6:53 p.m., a Reserve Officer monitoring city security cameras observed what appeared to be an altercation on the 500 Block of York Street involving several subjects. During the same time officers conducting a motor vehicle stop in the 300 Block of York Street along with officers responding from the area of East Federal Street officers heard gunshots. Upon their arrival to the area the officers observed several people running from the area. Police said that the 17-year-old suspect was charged with attempted murder and weapons offenses. He was lodged in the Burlington County Juvenile Detention Center in Pemberton Township. City police said the investigation is ongoing and more arrests are likely. Any person with information regarding this investigation is urged to call Detective Anna Czajka at (609) 386-0262, Ext. 221, or leave a confidential “etip” at burlingtonpolicenj.com, or message us on Facebook. All messages will remain confidential, police said.\nNewports heisted: Police said that they found the front glass door to the Gulf Mart/Gas Station to be smashed in around 1:37 a.m. on Dec. 13. A subsequent check of the interior yielded no suspects. Police said approximately $110 cash was stolen along with 19 packs of Newport cigarettes valued at $153.90. The case is being investigated by the Westampton Township Detective Division."}