{"uri": "http://www.theindychannel.com/news/local-news/impd-child-fatally-shot-by-child-inside-apt-on-citys-north-side", "title": "IMPD: 6-year-old child fatally shot by another child inside apt. on city's north side", "dct": "Sun, 09 Nov 2014 03:59:00 GMT", "id": "085ced836fe2ad5001fab2ae297fd975", "content": "Autoplay:\nINDIANAPOLIS - A 5-year-old child died after being shot by another child inside of an apartment on the city's north side early Sunday, Indianapolis Metro Police said.\nThe shooting was reported just after midnight in the 1700 block of Century Circle where IMPD found a child with an apparent gunshot wound to the head.\nMore: 4-year-old girl shot in apartment\nWhen police arrived, the boy was unconscious and rushed to Riley Hospital for Children in critical condition, where he died a short time later.\nOn Monday, the Marion County Coroner's Office identified the boy as Damoni Troutman, of Indianapolis.\nDetectives said they believe the 9-year-old child suspected in the shooting found the gun inside the apartment. Police did not release the identity of the 9-year-old.\n\"I can't fathom what the parents are going through. I don't understand the gun violence because in the contract for leasing, there shouldn't be any guns on the premises. Two, why wasn't the gun locked up? Three, where were the parents at, and four, why would a child give another child a gun,\" neighbor Bree Tucker said.\nAttorney Guy Relford is an expert in gun law and a certified firearms instructor.\n\"Locking up our guns isn't just about the safety of children, although that's paramount. It's for our safety too. Because the bad guy breaks into your house, you have an unsecured firearm, you've just empowered a burglar, you potentially have changed a burglar into a murderer by providing them with a weapon,\" Relford said.\nThe shooting is under investigation as a homicide by the Marion County Coroner’s Office.\nThe victim's parents could face criminal charges.\nDetectives asked anyone with information about this incident to call Crime Stoppers at 317|262.TIPS (8477). Callers may also text “INDYCS” plus tip information to 274627 (CRIMES)."}