{"uri": "http://www.idahostatesman.com/news/local/crime/article98189267.html", "title": "Boy in Kuna standoff rushed to hospital after reportedly shooting himself", "dct": "Fri, 26 Aug 2016 16:52:00 GMT", "id": "b96db9f914f9861e03bfa7ec8ad8bbcc", "content": "A standoff with an armed 14-year-old at a Kuna house took a traumatic turn when the boy shot himself and was rushed to the hospital Friday evening, the Ada County Sheriff's Office reports.\nThe injury appears to be life-threatening, Ada County Sheriff’s Office spokesman Patrick Orr said, but no information was available on the boy’s condition late Friday\nThe standoff started nearly five hours earlier when the Kuna teen, suspected in an arson fire behind an LDS church in July, refused to come out of a friend’s house in the 1400 block of Kerf Street.\nKuna officers had been looking for the boy out of concern for his safety after he reportedly took two guns and a knife from a family member Thursday and left home, the sheriff’s office reports. After getting a tip that the boy was at his friend’s house, officers went to the scene and called in crisis negotiators.\n“He’s obviously a kid in crisis. He’s making bad decisions, he’s got two guns, and he’s 14,” Orr said. “All we want to do is to keep him and the community safe.”\nAll of the residents left the house at officers’ request, and officers and crisis negotiators talked and texted with the boy for hours, Orr said. Neighbors were alerted to stay away from the home because an armed person was inside.\nWhen the teen’s friend came out, he told police the teen had a handgun and had fired one round inside the house but hadn’t aimed at anyone, Orr said. At that point, police backed off, set up officers around the house to protect the people in the neighborhood, and brought in crisis negotiators to talk to the boy, the sheriff’s office reports. Kuna police found the boys parents and were working with them, ACSO reports.\n“Police continued to talk to the boy for another hour or so,” an ACSO news release said. “He told them he didn’t want to come out, that he didn’t want to go to the hospital or go to jail. Other times, he seemed like he wanted to come out.”\n“Then he stopped answering the phone or texting. Officers heard the sound of a single gunshot from inside around 5:45 p.m.”\nPolice entered the house immediately and found the boy, who had suffered a single gunshot wound, Orr said. Paramedics, already at the scene, treated him and rushed him to Saint Alphonsus Regional Medical Center in Boise, he said.\nThe teen had been identified as a suspect in a reported arson behind an LDS building at 315 East Deer Flat Road early in the morning of July 10. The blaze destroyed two storage units holding donations for Deseret Industries, ACSO said at the time. Two 18-year-olds playing Pokemon Go in the church's parking lot called dispatchers around 4 a.m. and reported seeing two teens running away from the burning building."}