{"uri": "http://www.news-journal.com/news/2015/sep/15/officials-longview-gang-members-interest-smith-cou/", "title": "Longview gang members of interest in Smith County shooting", "dct": "Tue, 15 Sep 2015 15:57:00 GMT", "id": "1145cc4ad9a27f457f7bdabb75e1ec56", "content": "Officials on Tuesday identified five men said to have ties to Longview street gangs as persons of interest in a rural Tyler shootout that left one person dead and three more injured.\nSmith County Sheriff Larry Smith said his office was seeking the public’s help to locate those involved in the melee, which occurred just before 2 a.m. Aug. 29 outside a convenience store in Smith County.\nAt a news conference Tuesday in Tyler, Smith said the investigation had determined two separate groups — with affiliations with Tyler and Longview gangs — were involved in the confrontation in a parking lot outside Bunny’s convenience store just north of Tyler. Based on witness interviews, closed circuit video and other evidence, investigators estimated more than 300 people were involved in the incident and at least four guns of different caliber were fired.\n“John Tyler was playing Longview. That’s where each gang is from,” Smith said. “We did get good information that they were going to do something there (at the game) and hopefully our presence there stopped that.”\nThe people Smith named as people of interest played football either at the middle school, junior varsity or varsity level in Longview ISD.\n“Many of these individuals we’re looking for will wind up being suspects as far as being the shooters,” Smith said.\nThey are:\nD’Mio “Duck” Ingram, 24, Longview.\nDeKaylen Kaine Daniels, 20, Longview.\nLamond Demarcus “TuTu” Martin, 21, Longview.\nAaron “Fifty” Blankenship, 21, Longview.\nTyson Dixon, 21, Tyler or Longview.\nLobos fans might recall Ingram, a running back who suffered a spinal cord injury during spring practice before his senior year in 2008. Though temporarily paralyzed and unable to breathe, the team captain later regained mobility.\nAt Tuesday’s news conference, Smith said the confrontation began among a large group of people before midnight at the Flamingo Event Center on north FM 14 in Smith County. Private security personnel at the event center broke up the fight, he said, which is when the groups moved to Bunny’s at Loop 323 and FM 14.\n“There began to be other altercations there, fist fights, which quickly escalated into shots being fired,” Smith said.\nThe shootout resulted in the death of Laprida Shears, 25, of Tyler.\nThe videos, which were from cameras at various locations outside the store, show people running and taking cover as shots are fired. Some shooters can be seen. A video from inside the store includes audio. At least two volleys of rapid gunfire can be heard outside as patrons are seen reacting. Investigators said as many as 70 rounds could have been fired.\nSmith asked anyone involved or with knowledge of the shooting to come forward.\n“We assure you if you call in these individuals, we’ll do everything we can to keep your anonymity,” Smith said. “We don’t want any further retaliation in this investigation, which we have heard threats of retaliation, and we don’t need that here in Smith County, Tyler or even in Longview. I think Longview’s been hammered enough with homicides and shootings.”\nAt Tuesday’s news conference, the sheriff’s office made available video and still images Smith said he hoped could help locate participants investigators want to question.\n“Just imagine if your family would have been going to Bunny’s that night, what they would have been hit with,” he said. “We’re not going to let that get entrenched here in Smith County.”\nSmith said investigators so far had executed 44 search warrants in Tyler and Longview, and interviewed as many as 90 people in Longview, Tyler and Jacksonville. He said he believed officers could make an arrest in the next few days.\nAnyone with information is asked to contact the Smith County Crime Stoppers at 903-597-CUFF, the sheriff’s office at (903) 566-6600, or lead Detective Ron Rathburn at (903) 590-2686."}