{"uri": "http://www.kltv.com/story/30210274/sheriff-2-arrests-made-in-bunnys-truck-stop-shooting", "title": "Sheriff: 2 arrests made in Bunny's Truck Stop shooting", "dct": "Wed, 07 Oct 2015 21:08:00 GMT", "id": "785268d25e76146c6364b3f8bc60080d", "content": "SMITH COUNTY, TX (KLTV) -\nArrests have been made in the Bunny's Truck Stop shooting which occurred in Smith County on August 29 and ended with the death of a 25-year-old.\nAccording to Sheriff Larry Smith, two arrests have been made in the case. Phillip Potts, 32, has been charged with aggravated assault with a deadly weapon. D.K. Daniels, 20, has also been charged with aggravated assault with a deadly weapon. Potts is in the Smith County jail, while Daniels is in the Gregg County jail and will be transported to Smith County. Both have a bond of $300,000, Smith said.\nSmith said that LaPrida Shears died at the scene from a gunshot wound; three others were injured. Later, Smith would say that the violence was gang-related.\nSmith said the incident began as an argument between a large group of people at the Flamingo Event Center on North Highway 14 in Smith County. Security detail at the event broke up the fight, which is when the group moved to Bunny's.\nInvestigators later determined two groups, who have ties to Tyler and Longview gangs, were involved in the dispute. Smith said shots were fired by at least 4 different people.\n\"Down here by the diesel pumps were individuals from the Longview area. The ones in front of the store and up by the store were ones from the Tyler area,\" Smith said.\nRelated: Multiple counties working to solve fatal truck stop shooting\nSmith said the shooting at Bunny's is what led to heightened security measures at Tyler football games.\n\"John Tyler was playing Longview. That's where each gang was from. We did get good information that they were going to do something there and hopefully our presence there stopped that,\" Smith said.\nOn September 15, Smith identified D.K. Daniels, D'Mio Ingram, Tyson Dixon, Lamond Martin, and Aaron Blankenship as persons of interest in the case. Smith said he believed all of the men live in the Longview area.\nCopyright 2015 KLTV. All rights reserved."}