{"uri": "http://www.ksla.com/story/30049099/multiple-counties-working-to-solve-fatal-truck-stop-shooting", "title": "Multiple counties working to solve fatal truck stop shooting", "dct": "Wed, 16 Sep 2015 22:53:00 GMT", "id": "a4bff576dc31d8b10bf67d574d2d085c", "content": "SMITH COUNTY, TX (KLTV) -\nSmith County investigators say it's not just the help of the public they are depending on for information into a fatal truck stop shooting last month.\n25-year old Laprida Shears was fatally shot August 29 at Bunny's Truck Stop in Smith County.\nOfficials say there were two gangs involved in the shooting, one group from Tyler and another from Longview.\nOfficials believe it's going to take multiple agencies to identify possible suspects.\n\"It was a violent crime that we had over here in Smith County, and a lot of it is because of people who came over here from Longview,\" said Smith County Sheriff, Larry Smith.\nSmith says the shooting started as an argument between gangs from Tyler and Longview. 70 shots were fired by at least four people.\n\"So we'll just need to get a handle on it. Try to get all these people identified and prosecuted as needed, and move on to the next case,\" Smith said.\nSmith says his office has been working closely with Jacksonville PD, Longview PD and the Gregg County Sheriff’s Office.\n\"You can have one-on-one with an investigator or detective, for instance, from Longview PD, but if we can't go get those records from Gregg County, we're at a stalemate,\" Smith said.\nSheriff Maxey Cerliano says since they run the jail, they keep information that could be vital in solving this case.\n\"You know, contact information, addresses, things such as that, that could be utilized to assist in locating suspects or persons of interest,\" Cerliano said.\nSmith says when you're outside your jurisdiction, if you don't know who you're working with, investigations are more challenging.\n\"It's almost next to impossible if you don't have a relationship,\" Smith said.\nBut Smith is hoping the relationships they've established will bring them one step closer to closing this case.\nSheriff Smith says that since their press conference Tuesday, three new witnesses have come forward.\nAnyone with information related to the shooting is urged to contact the sheriff's office at: 903-597-CUFF. Officials say informants can be anonymous."}