{"uri": "http://www.kltv.com/story/30036983/sheriff-gangs-involved-in-fatal-tyler-truck-stop-shooting-arrests-expected-soon", "title": "Sheriff: Gangs involved in fatal Tyler truck stop shooting, arrests expected soon", "dct": "Tue, 15 Sep 2015 18:49:00 GMT", "id": "ab4aef4bd9308896ee9acaa1717b3818", "content": "TYLER, TX (KLTV) -\nThe Smith County Sheriff's Office is asking for the public's help identifying possible suspects in a deadly truck stop shooting in Tyler last month.\nSheriff Larry Smith held a news conference Tuesday afternoon, saying his office needs help identifying possible suspects in the shooting at Bunny's Truck Stop on Aug. 29. One person, later identified as Laprida Shears, 25, of Tyler, was pronounced dead at the scene from gunshot wound; three others were injured.\nREAD MORE: Identity released in Smith County truck stop homicide\nSmith says the incident began as an argument between a large group of people at the Flamingo Event Center on North Highway 14 in Smith County. Security detail at the event broke up the fight, which is when the group moved to Bunny's.\nInvestigators later determined two groups, who have ties to Tyler and Longview gangs, were involved in the dispute. Smith says shots were fired by at least 4 different people.\n\"Down here by the diesel pumps were individuals from the Longview area. The ones in front of the store and up by the store we're ones from the Tyler area,\" Smith said.\nSmith says the shooting at Bunny's is what led to heighted security measures at Tyler football games.\n\"John Tyler was playing Longview. That's where each gang was from. We did get good information that they were going to do something there and hopefully our presence there stopped that,\" Smith said.\nSmith identified D.K. Daniels, D'Mio Ingram, Tyson Dixon, Lamond Martin, and Aaron Blankenship as persons of interest in the case. Smith believes all of the men live in the Longview area.\nSmith is urging anyone involved in the incident to come forward and tell \"their story\", and not have someone else do it for them. Authorities have interviewed as many as 90 witnesses, and believe they are close to making an arrest in the next few days.\n“Just imagine if your family would have been going to Bunny’s that night, what they would have been hit with. We’re not going to let that get entrenched here in Smith County,” Smith said.\nAnyone with information related to the shooting is urged to contact the sheriff's office at: 903-597-CUFF. Officials say informants can be anonymous."}