{"uri": "http://www.nola.com/crime/index.ssf/2015/05/new_orleans_teen_who_shot_his.html", "title": "New Orleans teen who shot his 16-year-old friend sentenced to 5 years", "dct": "Fri, 15 May 2015 16:56:00 GMT", "id": "419678f869cda8f516904f5f87255a56", "content": "A New Orleans teenager who shot and killed his 16-year-old friend while handling a pistol last year was sentenced Friday (May 15) to five years in prison, a term his attorney sought during an emotional plea for leniency.\nDonte Veals, 17, pleaded guilty as charged in October to manslaughter. He admitted he shot Deion Robair while handling the pistol inside another teen's home in the 3600 block of Kimi O'Gray Avenue on March 19, 2014. Veals, too, was 16 at the time and has been jailed since days after the shooting.\nOn Friday, Veals appeared before Criminal District Court Judge Karen Herman to receive the punishment. His arms shackled to the chain around his waist Veals, a soft-spoken teen, read aloud a letter he had written, in which he expressed remorse for killing his best friend.\nHe said he and his friends were hanging out when he saw the pistol on a bed. Authorities have said that Robair brought the pistol to the house that day,\n\"I picked the gun up,\" Veals said. \"I pulled the trigger. I didn't know it had bullets. It went off.\"\nThe bullet struck Robair in the shoulder and traveled through his torso, piercing his heart and killing him. District Attorney Leon Cannizzaro's office presented the case to a grand jury, which handed up the manslaughter charge last June.\nVeal could have received up to 40 years in prison, the maximum for manslaughter.\nHowever, suggesting that Veals was over charged, Herman said she found no evidence that the teenager acted with criminal intent when he shot Robair.\n\"I don't know what was going on in your head that day,\" Herman told him. Citing the investigative reports and Veals' statement to police, she said, \"no one indicated that this event took place as a result of anger on your part, retaliation on your part.\"\n\"Whatever took place to me it fits the legal definition of a negligent homicide and not a manslaughter,\" she said in announcing the 5-year sentence.\nNegligent homicide, one in which the perpetrator acts with criminal negligence, carries a sentence of up to five years in prison. After the indictment was filed in court last year, Cannizzaro said his office sought the manslaughter charge rather than prosecuting the case as a second-degree murder.\nThe question of whether Veals acted with criminal intent played into the charging decision. In this case, manslaughter was applied, because Veal killed Robair while committing another crime, such as illegal discharge of a firearm.\nRobair's grandfather Oliver Ducre, who raised the teenager, told a reporter last year he thought Veals should have been charged with murder. Assistant District Attorney Inga Petrovich acknowledged Ducre's viewpoint in court Friday. \"I explained to them the reasons for the charges,\" she said, adding that the Ducres accepted the reasons.\nDucre and his wife, Shirley Ducre did not attend the sentencing hearing. Petrovich said Oliver Ducre now has medical \"travesties\" that don't allow him to come to court. As for Shirley Ducre, \"the thought of being here is too painful,\" Petrovich said.\n\"At this time they're suffering too much to come to court,\" she said. Speaking for the state, she said \"this is a case that is disturbing as it is tragic.\"\nThe district attorney's office was making no comments on a sentencing recommendation, Petrovich said. But she asked Herman to take into account the severity of the crime, and to consider \"a young man that can be added to the tally of the young African-American men who have lost their lives in this city senselessly.\"\nHe is still grieving the death of his very best friend in the world.\" - Carrie Ellis, defense attorney\nVeals' attorney Carrie Ellis, at times appearing to hold back tears, asked Herman for a 5-year sentence. She also asked the judge to send Veals to a youth offender program run by the state Department of Corrections. Herman granted both requests. She said Veals already wants to speak with youth about the dangers of gunplay.\n\"He is still grieving the death of his very best friend in the world,\" Ellis told the judge. \"He is so sorry. He knows he can't take it back. He knows he can't go back in time.\""}