{"uri": "http://wsav.com/2016/09/27/mother-and-child-shot-community-leader-reacts/", "title": "Mother and child shot in domestic shooting in Yamacraw", "dct": "Tue, 27 Sep 2016 22:43:00 GMT", "id": "87303fd333fb35d7d6ecded99b0cd23d", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nUPDATE: SCMPD has obtained a warrant for Iyontai Tovarise Walker, 22, who is considered armed and dangerous. He is described as a black male, approximately 6-feet, 3-inches and weight 190 pounds. He also has a distinctive tattoo on his neck, which reads “BO$”, according to officials.\nThe victims were a 28-year-old female and her 8-year-old daughter. Although they have serious injuries it appears to be non-life threatening. They are listed in stable condition at Memorial University Medical Campus.\nWalker is wanted for two counts of aggravated assault, cruelty to children in the first degree, possession of a firearm during the commission of a crime and possession of a firearm by a convicted felon.\nThis case remains under investigation. Anyone with any information should contact the SCMPD tip line by dialing (912) 525-3124.\nInformation may also be forwarded to CrimeStoppers at (912) 234-2020. Tipsters remain anonymous and may qualify for a cash reward.\n—–\nSAVANNAH, Ga. (WSAV) – A heavy amount of police scattered across Yamacraw Village after a mother and daughter were shot around 4:30 p.m. September 27 near the intersection of Fahm and Zubley Street. It’s a concern for community leaders near the area.\n“I thought it was sad and anybody getting shot, and then a child too, I’m just wondering what’s going on,” Ronald Williams, West Savannah Community President, said.\nJust last week metro police upped the force in this area. They asked for assistance from Georgia State Patrol and they made their presence clear at Tuesday’s shooting. But having the increase of officers is not what Williams says is needed.\n“You can get twice as many police as you have now,” Williams said. “Until people start speaking out it’s going to continue.”\nNews 3 reached out to neighbors in the area who didn’t want to speak out. Even police were trying to find answers.\n“Investigators are asking anyone who has seen anything please come forward,” Darnisha Green, a metro public information officer, said.\n“It’s just about cooperation with the police,” Williams added. “You’ve got to help them help us.”\nHelp Williams says wouldn’t be needed if the community focused more in the positivity in the community.\n“We focus on the positive things. If you can get people to focus on the positive things you won’t get things like this to occur.”\nHere’s a conversation we can all sink our teeth into! Are…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}