{"uri": "http://www.kgw.com/story/local/2014/10/25/12599690/", "title": "Mystic strip club shooting suspect identified", "dct": "Wed, 15 Jan 2014 00:00:00 GMT", "id": "15d4c5dd4ade776c269dd18687bfd2d8", "content": "PORTLAND Police identified the suspect who shot three people before getting shot by a security guard at the Mystic Gentleman s Club in Portland last weekend.\nInvestigators believe Thomas Elliott Hjelmeland, 43 (pictured), opened fire in the club at Southeast Stark Street and Southeast 99th Avenue just before 9 p.m. Saturday. He remains in critical condition at a Portland hospital and has not yet been charged in this case.\nBrian Rizzo, a 26-year-old security guard from the club, was hit by the gunfire at the front door and was also listed in critical condition at a local hospital. Patron Gonzalo Zamora-Hernandez, 31, and waitress Nichole Procter, 27, were treated and released with less serious injuries.\nOwners of the strip club said Hjelmeland was denied entry because of belligerent behavior and racist comments. He then returned half an hour later armed with a gun and wearing a scary Halloween mask.\nThe shooter came in and just started shooting without any kind of warning, victim Gonzalo Zamora-Hernandeza told KGW Monday.\nZamora-Hernandez said he was playing video poker when he was shot in the foot.\nThey started screaming, 'Call 911, call 911,' and then I sit down and I start looking at my foot, so paramedics show up and they checked my foot and said, 'Yeah, you got shot,' Zamora-Hernandez said.\nRizzo returned fire and hit the suspect was not arrested and was cooperating with police.\nPortland is a safe city; however, gun violence is pervasive. As we've seen elsewhere, it's really easy for someone with a gun to hurt a lot of people, said Sgt. Greg Stewart with the Portland Police Bureau.\nIn July of 2012, a man was shot and killed in the parking lot of the same strip club. Three people were arrested in the death.\nThe Mystic Gentleman's Club shares a building and address with Falco's Pub, a nightclub where a woman met her suspected killers in October.Tiffany Jenks, 35, was found murdered at Fairview's Blue Lake Park and three people were arrested in connection with her death.\nThe Oregon Liquor Control Commission said they would be renewing the Mystic Gentleman s Club's license.\nView Larger Map"}