{"uri": "http://www.oregonlive.com/portland/index.ssf/2014/01/portland_police_identify_maske.html#incart_river", "title": "Portland police identify masked gunman at Portland strip club", "dct": "Tue, 14 Jan 2014 13:31:00 GMT", "id": "46ee0fe25b850542e512ab3f89ae0875", "content": "Portland police Tuesday identified the masked gunman who entered a Southeast Portland strip club Saturday night and fired shots at a bouncer as Thomas Eliott Hjelmeland, 43.\nHjelmeland, who has a Beaverton address, is currently on probation stemming from a Multnomah County misdemeanor conviction in October for unlawful use of mace against a stranger.\nOn Feb. 3, he had gotten into an argument with a downtown Portland parking garage attendant who had asked him to move his car from the reserved Avis parking space, according to court records.\nHjelmeland's friend had called him to the garage at Southwest Fourth Avenue and Alder Street to help him with his broken-down vehicle. Hjelmeland became \"mouthy'' with the attendant and eventually drove out of the garage, but returned wearing a bandana or some cloth that concealed his face and sprayed the attendant in the face with the chemical substance, according to police and court records. He was convicted in October and ordered to be on probation for 18 months, complete a two-day, anger-control program and at least 20 hours of community service, according to court records.\nHjelmeland notified the court he intends to appeal the conviction.\nHjelmeland remains hospitalized in critical but stable condition from Saturday night's incident at the Mystic Gentlemen's Club, police said. No charges have been filed against him yet, but the case will be presented to a grand jury.\nInvestigators responded to the Southeast Portland strip club about 8:40 p.m. on Saturday, and found a bouncer, 26-year-old Brian Rizzo, critically wounded with a gunshot wound to the head, and Hjelmeland wounded from multiple gunshots at the club's entrance.\nThe bar's owner, Connie R. Barnes, said Rizzo had turned Hjelmeland away from the club about 8 p.m. because he was acting rudely and made racist slurs to others waiting to get in. Barnes said Hjelmeland returned to the club wearing a Halloween mask about 30 minutes later, walked in and fired at least two shots at Rizzo, and then walked out.\nAs Hjelmeland walked out of the club, another bouncer, Jonathan Baer, 31, followed him and pulled his own handgun and fired multiple shots at Hjelmeland by the club's front door.\nBarnes and other staff said they did not recognize Hjelmeland as a regular customer.\nCourt records indicate that an ex-girlfriend had obtained a restraining order against Hjelmeland in March 2007, and he sought one against her a day later. She wrote in court papers that Hjelmeland \"can be very short-tempered, physically aggressive,'' and when she tried to kick him out of the apartment they shared in Southeast Portland, he threatened her and her family.\nIn his request for a restraining order against his ex-girlfriend, Hjelmeland wrote that she had illegally locked him out of their apartment, and was smoking in their bedroom, which aggravated his asthma.\nIn 2007, Hjelmeland listed the Dolphin Inc. strip club in Milwaukie as his employer, and said he attended Team Quest gym. Hjelmeland had competed in mixed martial arts in 2009, according to a mixed martial arts website.\nSince the shootings at the Mystic Club Saturday, the club has reopened with additional security measures, Barnes said.\nBarnes said there's now a buzzer that goes off in the club every time someone comes through the club's front door.\n\"That gives our security warning that someone is coming,'' Barnes said. \"There was nothing to warn Brian, but at least, now they'll know to look, to react.''\n--Maxine Bernstein"}