{"uri": "http://www.wsbtv.com/news/news/local/double-shooting-investigated-nw-atlanta/nmzQt/", "title": "5 people shot after children's football game", "dct": "Wed, 15 Jul 2015 15:54:00 GMT", "id": "408de9959c4a3424e8b13133522abfcf", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nATLANTA - Five people were shot in northwest Atlanta neighborhood Wednesday afternoon.\nWitnesses say a fight about a children’s football game led the gunfire on Center Hill Avenue at about 3:30 p.m.\nChannel 2 Action News watched as police worked to sort out the chaotic scene caused by gunfire in the neighborhood packed with people.\n\"If I'm not mistaken, I think it hit my house, because I think I heard a loud pop. That's what made me jump up the first time and check,\" neighbor Stephanie Thomas said.\nPolice say a fight between people in two neighboring homes escalated to gunfire. When officers arrived the found three people shot.\nA fourth shooting victim had already driven himself to the hospital. Investigators said there was at least one other victim involved as well.\nFrom NewsChopper 2, we saw police arresting several people. As many as 20 people may have been involved.\n\"A scene such as this with multiple individuals involved, several individuals involved in this incident. Multiple individuals inside of the first residence as well as the second, and witnesses that observed the incidents as well,\" Atlanta police Officer Ralph Woolfolk said.\n\"We have to speak to each one of those individuals and try to determine (and) corroborate information, verify the accuracy of the information that we're receiving, just several moving parts,\" Woolfolk said.\nPolice say there were more than a dozen children inside both homes. None of them were hurt, but for one neighbor with a child of her own.\n“There was a lot of kids around when they was fighting, but when they went to go get the guns and stuff the kids ran in the house,” said a neighbor who asked not to be identified. “A bullet literally landed in my lap.”\nPolice say none of the children were injured, but they did take a few of the children out of their homes.\n“We have removed the children from the home at this time. They're in process of determining what exactly is going to happen with the kids,” Woolfolk said.\n\"It's time to go. It's time to go. I've got a baby to raise. I've got a little and this is no,” Thomas said.\nPolice said three men and a woman were taken into custody at the scene. So far, no one has been charged in the shooting.\nInvestigators have not released any information on the victims’ conditions."}