{"uri": "http://www.nydailynews.com/new-york/nyc-crime/bronx-man-fatally-shot-wounded-six-hour-span-article-1.2612048", "title": "Man, 30, fatally shot in Bronx; five others wounded in NYC over bloody six-hour span", "dct": "Wed, 27 Apr 2016 12:17:25 GMT", "id": "7669de4183f2ed1da3a2fd4fdd824797", "content": "A 30-year-old man attending a Bronx house party was fatally shot early Saturday — one of a half dozen people hit by gunfire during a bloody stretch of six hours, officials said.\nRahmel Johnson’s horrified family raced to Bronx Lebanon Hospital after he was blasted in the chest outside a home on Clay Ave. in Morrisania.\nHis inconsolable cousin Tamika Johnson, 31, who attended the house party, fought with police and had to be removed from the hospital after she and another relative tried to push through a line of cops blocking the emergency room entrance.\nShe was charged with disorderly conduct, criminal mischief and disorderly conduct after she kicked out the rear window of the police van she was placed into, cops said.\n“She was with him,” Johnson’s shell-shocked mother Sandra Johnson, 49, told the Daily News Saturday. “She was very upset.”\n“I don’t understand why they would target my son,” Johnson’s heartbroken mom told the Daily News. “Why would they do that? I can’t believe they killed my son.”\nThe second relative, a 28-year-old woman, also received a summons for disorderly conduct, officials said.\nMAN, 32, ARRESTED FOR 2015 FORT GREENE SHOOTING THAT LEFT THREE DEAD: 'I DON'T GIVE A F---, I'M HERE AND THEY'RE NOT'\nRelatives believe their beloved self-employed T-shirt hawker was “set up” to be killed.\nHe was standing near a DJ booth inside the house near E. 169th St. about 6:45 a.m. when he was called outside and fatally shot, relatives were told.\n“Some of his friends and family went outside,” his uncle Donald Johnson said. “They heard three shots and ran inside. He died on the operating table.”\nThe gunman remained on the loose Saturday. A motive was not immediately disclosed by detectives.\nThe music at the celebration was so loud that very few heard the gunshots, witnesses said.\n“I just heard music playing and people socializing,” neighbor Tyree Riggins said.\nBut the music was quickly drowned out by blood-curdling shrieks.\n“People started screaming and running out of the building every which way. It was like roaches when you cut the light on,” said Riggins, 30. “I heard a woman screaming, ‘They killed my brother! They killed my brother!’ ”\n“It went from a fun super happy cool vibe to chaos,” he said.\nThe slaying was one of three shootings in the city between 1 a.m. and 7 a.m. Saturday, cops said.\nFour men between ages 19 and 34 were wounded as gunshots rang out on W. 141st St. near Edgecombe Ave. in Hamilton Heights just after 1 a.m., cops said.\nThree of the men were hit in the legs when witnesses said a lone gunman walked up and opened fire into the group. The fourth victim was hit in the arm.\nTwo hours later, a 29-year-old man shot in the gut stumbled into New York-Presbyterian Columbia University Medical Center looking for help. He said he had been shot on W. 173rd St. and Amsterdam Ave., officials said.\nNo arrests have been made.\nAs of April 17, there have been 230 shootings citywide this year, down from 260 during the same period last year, an 11.5% drop.\nMurders are also down citywide — by 18%, officials said."}