{"uri": "http://www.mlive.com/news/detroit/index.ssf/2016/09/suspected_killer_of_family_spe.html#incart_river_home", "title": "Suspected killer of family did time for killing pregnant previous wife", "dct": "Thu, 22 Sep 2016 11:26:08 GMT", "id": "2e8af25e1ef0a106476e9e7f23154ae8", "content": "A Dearborn Heights father who told police he killed four people Wednesday morning, including two of his own daughters and two stepchildren, previously served 16 years in the killing of a prior wife.\n\"He pleaded no contest to killing his then-wife, who was six months pregnant, by stabbing her to death,\" Michigan Department of Corrections spokesman Chris Gautz says of the July 1991 crime in Detroit.\n\"After he did so, he called police, told them what he had done and waited for them to arrive and let them in.\"\nA no contest plea means a defendant accepts the penalty for a crime but doesn't admit guilt.\nThe same man, Gregory V. Green, 49, is now suspected of killing his two daughters, 4-year-old Kaleigh Green, and 5-year-old Koi Green; and two stepchildren, ages 17 and 19.\nHe's also suspected of nearly killing a woman neighbors identified as Green's wife and the mother all four children about 1:15 a.m. Wednesday.\nThe mother was upgraded from critical to stable condition Monday morning, police said.\nThe Dearborn Heights Assessor's office confirms the house where the killings occurred is owned by Green, who purchased it in September of 2012.\nNeighbor Ronnie Jones, after viewing a Michigan Department of Corrections mugshot of Green, identified him as the father who lived in the home on Hipp Street where the killings occurred.\n\"You'd see (the children) outside playing in the yard and stuff,\" said Jones, who's lived across the street his entire life. \"They had a trampoline and stuff over there. They were having birthday parties for them and picnics over here and stuff and it seemed like they were all getting along.\"\nGreen served 16 years in prison, from March 1992 until April 2008, for the murder of his previous wife, Tonya Green, Gautz confirmed.\n\"He was denied parole four time for various reasons, but they all centered around the main idea that he had not shown remorse for his crime, had not gained adequate insight, and had a lack of empathy,\" Gautz said. \"After being denied four times, he completed several cognitive based programs and was paroled in 2008.\"\nHe was released from state supervision in April 2010.\nWayne County circuit Court online records show Green received a sentence between 15 and 25 years in prison for after pleading no contest to the murder of his wife in February 1992.\nThe second count for the murder of the unborn child was dismissed.\nDearborn Heights police said the father called 911 Wednesday morning and admitted to killing the victims when officers arrived at the home. He is now jailed and criminal charges are pending.\nPolice said two of the victims were fatally shot, but would not confirm how the others died, or how the mother was attacked.\nThe Wayne County Medical Examiner's office hasn't released the causes of death.\nPetri described the family's home on Hipp Street, just north of Annapolis Street on the city's south end, as \"a very nice,\" \"very well-kept\" residence.\n\"This is a very rare occurrence and it's just difficult to understand and the motivation,\" Dearborn Heights Mayor Daniel S. Paletko said. \"I don't understand what happened in this house, but it's a super tragedy ... As a father ... I think we can all appreciate how important one's kids are.\n\"I just can't fathom it.\"\nMultiple neighbors said the family has lived in the home at least two years. The mother and children left the home for about a year during that time, but moved back in, they said.\nJones said he saw the eldest son mowing the lawn Tuesday.\nThe father kept to himself, according to Jones.\n\"He never would really talk to anyone,\" Jones said. \"Most of the neighbors around here, they'll wave or something. He never did that.\n\"I don't know if he talked to anybody around here.\"\nDearborn Heights Police Lt. Michael Krause tells CBS Detroit it appears the youngest girls were asphyxiated by carbon monoxide; a hose was routed from the exhaust of a Toyota parked backwards in the driveway to the inside of the vehicle where the children were kept until they died. Krause told CBS Detroit Green then moved the bodies inside and tucked the dead girls into their beds."}