{"uri": "http://www.detroitnews.com/story/news/local/wayne-county/2016/09/22/dad-charges/90830386/", "title": "Prosecutors: Mom forced to watch slaying of 2 kids", "dct": "Thu, 22 Sep 2016 00:00:00 GMT", "id": "866f64a439bbe2e361adeee62e6eabd9", "content": "Dearborn Heights — A Dearborn Heights man suspected in the quadruple homicide of his family Wednesday allegedly bound and assaulted his wife before making her watch him fatally shoot her two older children, according to the Wayne County Prosecutor’s Office.\nGregory Vincente Green, 49, also is suspected of killing his two young daughters with carbon-monoxide poisoning, officials said.\nGreen was arraigned Thursday in 20th District Court where he told Judge David Turfe he understood the charges against him and said “I don’t need bond.” Bond was denied.\nHe was brought into court barefoot and shackled at the feet and handcuffed. A muscular man, Green was arraigned in the courtroom under heavy security. He mostly kept his head bowed during the brief court hearing.\nGreen is charged with four counts of first-degree murder and one count each of assault with intent to do great bodily harm, torture, unlawful imprisonment, felonious assault as a felon in possession and felony firearm.\n“The alleged evidence in this case will show an appalling level of domestic violence that was cataclysmic,” Wayne County Prosecutor Kym Worthy said in a statement announcing the charges Thursday.\nGreen allegedly called 911 around 1:15 a.m. Wednesday and waited for police in the driveway of his home on the 4400 block of Hipp in Dearborn Heights. Inside the home, investigators discovered 39-year-old Faith Green in the basement, bound with duct tape and zip ties.\n“It is alleged that Green bound his wife, cut her face with a box cutter and shot her foot and then shot the two older children in front of her,” prosecuting officials said. “Mrs. Green was taken to a local hospital for treatment.”\nDearborn Heights Police Captain Michael Petri said there is no record of previous domestic runs to the Green home or “any knowledge” about the wife filing a personal protection order against her husband.\nFaith Green had filed a PPO in Wayne County Circuit Court against her husband in February 2013, but it was rejected by Judge Deborah Ross Adams on the basis that there was “insufficient allegations for a PPO at this time.” Efforts to reach the judge, who was removed from office in June 2013 for judicial misconduct involving her own divorce case, were unsuccessful Thursday.\nFaith Green said in her filing that she had not filed a complaint with the Dearborn Heights Police Department but “I plan to file a report after work.” She also wrote: “I didn’t want to leave my house and not be able to get back in.”\nThere is no indication in the protection order request that Green had been imprisoned for killing his first wife.\nLocal attorney Arnold Reed said it is the responsibility of the individual seeking a PPO to provide the evidence against the person from whom they are seeking protection. Judges do not order an investigation of the person who the PPO is filed against.\nReed also suggested that if the judge had known Green’s past criminal record it would have had an impact on her decision.\nPetri said after the court hearing Thursday that what Green is accused of doing defies logic.\n“As a father of three children ... the thought that you could do something like that to your own children has no correlation to any reason in my mind,” Petri said. “You’re angry. ... You’re just in disbelief but that has no relevance in our investigation.”\nThe suspect’s stepchildren, identified by prosecutors as Chadney Allen, 19, and Kara Allen, 17, each had multiple gunshot wounds and were pronounced dead at the scene. Their deaths have been ruled homicides by the Wayne County Medical Examiner.\nDuct tape was found on the muffler of a car in the garage with a tube attached to a car in the garage, according to officials. Police later found Green’s younger daughters, Koi Green, 5, and Kaliegh Green, 4, in an “upper portion of the home.”\n“It is alleged that Green poisoned the two younger children with carbon monoxide,” officials said. “The children were taken to a local hospital and pronounced dead.”\nA GoFundMe page was set up Thursday to raise $50,000 to help the family bury the children. A message attributed to the family read: “Words cannot describe the horrific tragedy our family is experiencing over the untimely deaths of Chadney, Kara, Koi, and Kaleigh. There is no way that a mother could fathom laying to rest one child, let alone all four of her children at once without life insurance.”\nMeanwhile, the string of charges came more than two decades after Green was imprisoned for killing his previous, then-pregnant wife, according to the Michigan Department of Corrections.\nIn that case, Green also called police after he fatally stabbed Tonya Green, who was six months pregnant. The attack also killed the unborn child.\nGreen pleaded no contest to second-degree murder and was sentenced to 15-25 years in prison. He was released in 2008 after 16 years in prison and after his fifth attempt at parole.\nNo letters of opposition to his parole were filed before Green was released from prison, Gautz told The Associated Press. Had Green not won parole in 2008, he likely would have been releases from prison in 2012 because of credits for good behavior, he said.\nGreen married Faith Green about two years after his prison release in 2010, records show. The two were embroiled in a divorce, filed by Faith Green on Oct. 11, 2013, and again this past Aug. 11.\nThursday, a memorial of candles, stuffed animals and balloons graced the one-story home in the 4400 block of Hipp near Pelham and Annapolis in Dearborn Heights. Neighbors looked sadly as passersby drove past the house.\nJim Goudie, a longtime resident of the area, left a small stuffed animal as he expressed his sadness: “This is the worst thing that has ever happened here.”\nHFournier@detroitnews.com\n(313) 223-4616\nTwitter: @HollyPFournier"}