{"uri": "http://www.arkansasmatters.com/news/local-news/police-benton-child-dead-after-being-shot", "title": "Police: Benton Child Dead after Being Shot", "dct": "NODATE", "id": "d3abeddd8289f22db219f333b1cd6091", "content": "Benton, AR, USA - LITTLE ROCK, Ark. - A two-year-old boy has died after being shot on Tuesday afternoon, police say.\nAt 1:35 p.m., the Benton Police Department said it was called about the child being shot at a home on Nelson Court.\nThe child was taken to a local hospital where local law enforcement responded.\nAfter that, the child was taken to a Little Rock hospital for additional treatment but died as a result of his injuries.\nThe investigation is ongoing, but no charges were filed on Tuesday.\nTuesday evening, a family member told us the boy shot himself in the head with a handgun.\n\"If you're shot in the head with a .45 [pistol], you're not going to make it,\" said Doyle David Ashley, the boy's uncle. \"Nobody likes to hear of a kid getting killed by a gun. It's not right.\"\nAshley said he does not understand how his two-year-old nephew got his hands on such a lethal weapon.\n\"It's hard to believe a child playing with a gun that big and that heavy,\" Ashley said. \"I'm for guns. I'm not against them. It's not the gun that pulls the trigger. It's the person behind it. But when you're dealing with a child, they don't know if that gun is loaded or not loaded. That creates a problem. All responsibility falls on the parents to keep those guns put up that are loaded.\"\nThe Benton Police Department will continue its investigation to find that answer.\nIn the meantime, Ashley said he will remember the joy his nephew brought the family.\n\"He was such a fun little two-year-old,\" he said. \"He liked being around his daddy and doing things with his daddy and he liked being outside. It's a bad thing. It's not good.\"\nThe two-year-old's father told us he and his family are just asking for everyone's prayers during this difficult time.\n\"He was proud of his little boy,\" Ashley said. \"It tore him up. Nobody that loses a child over something like that is going to be easy to live with. You're going to have a problem because that could have been avoided.\"\nAnyone with information on the case is encouraged to contact the Benton Police Department at (501) 778-1171."}