{"uri": "http://wate.com/2016/08/08/11-year-old-shot-in-middle-tennessee-search-underway-for-suspect/", "title": "Police: Middle Tennessee dad says daughter startled him before he fired deadly shot", "dct": "Mon, 08 Aug 2016 17:14:00 GMT", "id": "410c06198084ed7704632e30f41d0e7e", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nHENDERSONVILLE, Tenn. (WKRN) – A father charged with reckless homicide after his 11-year-old daughter was shot and killed at their Hendersonville home Monday afternoon reportedly admitted to police he fired the weapon after being startled by the girl.\nPolice were initially told Timea Batts got off the school bus at her home on Shady View Drive before 4 p.m. and went inside where she told her father she had been shot.\nTimothy Batts initially told police his daughter Timea woke him up just before 4 p.m. and said she had been shot after getting off the school bus at their home on Shady View Drive.\nBatts reportedly drove his daughter to TriStar Hendersonville Medical Center before she was flown to Vanderbilt University Medical Center in Nashville.\nTimea, a sixth grader at Knox Doss Middle School, died less than two hours later.\nDuring the course of their investigation, police determined that the girl was actually shot inside the Hendersonville home.\nAccording to affidavits obtained by News 2, her father later went to the police station and said he wanted to “tell the truth” about what happened.\nThe report states that Batts told officers he accidentally shot Timea after he was awoken to a sound in the home. He, according to the report, got a gun from under the dresser and fired a shot at the girl when she yelled and scared him.\nPolice said Batts told them he removed the gun from the scene and that it was now in Nashville.\nHe was ultimately charged with reckless homicide late Monday night. He also faces charges of tampering with evidence, false reporting and felon in possession of a firearm.\nThe 29-year-old is being held at the Sumner County jail on a $1 million bond and he is scheduled to appear in court Aug. 24.\nHe has previous drug convictions, according to police.\nSchool District and neighbors respond to student’s death\nSumner County Schools said Timea was “a bright and kind girl who was well loved by her classmates and teachers.” The district’s statement continued:\nIt is our understanding from communicating with authorities that today’s tragic event in Hendersonville was not school related. The incident did not occur on the bus or at the bus stop. We have no reason to believe that there is any threat to student safety on any of our school campuses due to this tragic event.\nGrief counselors will be available for students and staff at the school on Wednesday.\nThe Knox Doss Middle School at Drakes Creek campus will be closed to media for the remainder of the week out of respect for our students, faculty and staff as they go through the grieving process.”\nNeighbors in the community were also left shaken and the scene left Nicole Carpenter wondering how something so horrible can happen just a few houses away.\n“I’ve seen her before. She’s played, and she’s very sweet, very well-mannered, sweet girl,” she told News 2. “It’s hard.”\nCarpenter says her children were coming home right before the shooting happened around 3 p.m.\n“They are shocked,” the mother noted.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}