{"uri": "http://www.wsmv.com/story/32711647/dad-charge-in-connection-with-shooting-death-of-hendersonville-girl", "title": "Dad charged in connection with shooting death of Hendersonville girl", "dct": "Mon, 08 Aug 2016 20:47:00 GMT", "id": "4bd652b534b7c5da50ce40edadc53a83", "content": "HENDERSONVILLE, TN (WSMV) -\nHendersonville police have arrested the father of an 11-year-old girl who was shot at her home and later died from her injuries.\nPolice arrested Timothy Batts, 29, on charges of reckless homicide, tampering with evidence, false reporting and felon in possession of a firearm in connection with the shooting death of Timea Lashay Batts.\nBatts' bond has been set at $1 million. He is scheduled to appear in court on Aug. 24.\nDetectives initially said Batts told police Timea was shot sometime in between getting off the bus and going inside her home on Shady View Drive on Monday afternoon. He said Timea told him that she had been shot, which is when he brought her to the hospital.\nTimea died around 4:30 p.m. at the Monroe Carell Jr. Children's Hospital at Vanderbilt.\nDetectives did not go inside the home until several hours later when they were able to obtain a search warrant. Once investigators were able to get inside, they said they found evidence the young girl had been shot inside the home.\nTimea had just returned home from her first day in sixth grade at Knox Doss Middle School at Drakes Creek when the shooting occurred.\nBoth students and parents in the community are heartbroken.\n\"She's only 11. She hasn't even gotten her first car, hasn't even gone to high school, hasn't even experienced life yet, so that's kind of sad,\" said parent Leanna McKee.\nNeighbors have laid teddy bears, flowers and candles outside of the house.\n\"Hendersonville is such a good town and it is a safe place to be and just all of us to rallying around each other and loving on one another is about the only thing you can do with something like this,\" McKee said.\nNeighbors told Channel 4 the family had not lived there very long, maybe only a year or so.\nDetectives said there were other children living at the home, but they are being cared for by other family members.\nSumner County Schools released this statement about the shooting:\nOur entire school district is grieved to learn of the tragic loss of one of our sixth grade students, Timea Lashay Batts. Timea was a bright and kind girl who was well loved by her classmates and teachers. She will be greatly missed at Knox Doss Middle School at Drakes Creek.\nIt is our understanding from communicating with authorities that today’s tragic event in Hendersonville was not school related. The incident did not occur on the bus or at the bus stop. We have no reason to believe that there is any threat to student safety on any of our school campuses due to this tragic event.\nGrief counselors will be available for students and staff at Knox Doss Middle School on Tuesday.\nFacebook Live: Police give first update on shooting:\nFacebook Live: Police give another update on the shooting:\nCopyright 2016 WSMV (Meredith Corporation). All rights reserved."}