{"uri": "http://www.dispatch.com/content/stories/local/2016/09/14/Police-involved-shooting.html", "title": "Boy, 13, dies after he was shot by Columbus police on Near East Side", "dct": "NODATE", "id": "daf96bf23ff23166ba23b3e61e79eb0d", "content": "Hide caption The scene of Wednesday's shooting in the Olde Towne East area of Columbus. Jim Woods | Dispatch\nCity and police officials are planning to discuss this morning the 13-year-old boy who died Wednesday night after he was shot by Columbus police in the Olde Towne East neighborhood. Tyre King died at Nationwide Children's Hospital around 8:22 p.m., roughly half an hour after he had been shot multiple times by an officer in an alley near East Capitol Street, police said.\nCity and police officials are planning to discuss this morning the 13-year-old boy who died Wednesday night after he was shot by Columbus police in the Olde Towne East neighborhood.\nTyre King died at Nationwide Children's Hospital around 8:22 p.m., roughly half an hour after he had been shot multiple times by an officer in an alley near East Capitol Street, police said.\nOfficers had initially been called to the area ofEast Broad and 18th streets on an armed robbery call, according to Sgt. Rich Weiner, spokesman for the Columbus Division of Police.\nThe robbery victim told officers several young men approached him, one with a gun, demanding money, police said.\nOfficers approached three males on nearby Hoffman Street, two of whom fled on foot to the alley off East Capitol Street, police said.\nKing, who was one of those fleeing, pulled what police later determined to be a BB gun with an attached laser sight from his waistband. An officer then shot King, police said.\nThe officer and the other young male with King were not injured.\nAt City Hall at 11, Mayor Andrew J. Ginther, Police Chief Kim Jacobs and Public Safety Director Ned Pettus are scheduled to speak about the shooting.\nA man who lives in the area, Chris Naderer of Hoffman Avenue, said he was in his home when he heard someone knock down a gate in his backyard. He looked outside to see a police officer chasing two youngmen into an alley behind his home. He said he then heard three to five gunshots from the alley.\nPolice said the young male who was with King was interviewed and released pending further investigation. This person's identity was not released by police early Thursday, nor was the name of the officer who shot King.\njwoods@dispatch.com"}