{"uri": "http://kron4.com/2017/01/03/girl-shot-in-head-by-3-year-old-brother/", "title": "Girl shot in head by 3-year-old brother", "dct": "Tue, 03 Jan 2017 05:25:00 GMT", "id": "fea6f79f2041398dd81cf67ac511410b", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nINDIANAPOLIS (WISH) — Prosecutors will determine if a mother will face charges after her 3-year old son used a gun and accidentally shot his 5-year old sister, according to sources at IMPD.\nIt happened Saturday afternoon at the Carriage House East Apartments off of 42nd Street near Mitthoefer Road on the city’s east side.\nThe community was quiet on Monday. Most neighbors chose to stay inside on the rainy day, which seemed to match the mood.\n“It’s been dreary and people have been protecting their kids and keeping them closer,” said Vel Re Morgan, who lives in the area.\nBut it was a much different scene just days ago when police cars lined the street.\n“They was here for like five or six hours. They was in and out,” Morgan continued, “People went into cars and kids were taken. It wasn’t nice. It wasn’t a pretty scene at all.”\nRonae Briscoe lives in the same building and witnessed the aftermath as well, “I looked out the window just to see what was going on and I saw them bring her out on a stretcher. It was scary. It was very scary.”\nAccording to sources with IMPD, a 3-year old got into his mom’s purse while she slept and grabbed a gun. The boy then shot his 5-year old sister in the head, sources tell WISH. Crews rushed her to Riley Hospital for Children at IU Health where she is still fighting for her life in critical condition.\nThe investigation turns to their mother. Prosecutors will have to decide whether she was negligent in anyway. Morgan tearfully came to her defense.\n“She was a nice kid and her mom was an awesome mom. I don’t understand what caused this or what happened, but she was an awesome mom. She was really protective,” she said.\nAuthorities handed the case over to the Marion County Prosecutor’s Office for review. We could learn as early as this week, what, if any, charges the mother will face.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}