{"uri": "http://www.nydailynews.com/new-york/nyc-crime/suspected-ouvert-killer-intoxicated-time-shooting-article-1.2780035", "title": "Suspect arrested for J'Ouvert shooting that killed St. John's grad student was drunk, high when busted", "dct": "Tue, 06 Sep 2016 20:20:31 GMT", "id": "0e4acd76c737fc8b87fec6d36d4ab783", "content": "The accused killer of a gifted St. John’s University grad student raged on with his night of J’Ouvert mayhem after drunkenly blasting her in the face, cops said Tuesday.\nSuspect Reginald Moise, 20, was so wasted and high when firing the fatal shot near the end of the annual celebration that he didn’t know the dying woman was even wounded, cops said.\nMoise then barely missed killing a 1-year-old boy sleeping in his crib when he shot up a relative’s Brooklyn apartment while hiding the murder weapon, said cops and the child’s mother. The bullet went through the relative’s wall and into a neighbor’s apartment.\nBallistics evidence from the two scenes implicated Moise, who was first arrested for drunken driving around 8 a.m. Monday while behind the wheel of a 2002 Ford Explorer with a missing wheel and a broken axle, cops said.\nMoise fired his 9-mm. Glock around four hours earlier at the tail end of the annual celebration, striking Tiarah Poyau above her right eye from close range on a Crown Heights street, police said.\n“I think I shot somebody on the parade route,” cops quoted Moise as telling a friend after squeezing off the shot that ended Poyau’s promising young life. “I didn’t know the gun was loaded.”\nThe globe-trotting 22-year-old victim, who had just finished a summer internship at PricewaterhouseCoopers, died a short time later at Kings County Hospital.\nBut cops said Moise’s wild night of random gunfire wasn’t done yet.\nThe boozed-up Brooklyn man called his cousin, looking to ditch the murder weapon in her Montgomery St. apartment, police sources said.\n“It’s too hot,” he reportedly said of the 9-mm. handgun.\nNeighbor Nadia Bryan was awake to check on her baby in their fourth-floor apartment when she heard two gunshots coming from next door.\nOne bullet then tore through the wall of her apartment, directly above her child’s crib.\n“It was by the grace of God that I wasn’t hurt or my son wasn’t hurt,” said Bryan, 30.\nMoise was charged with second-degree murder, criminal possession of a weapon and reckless endangerment. He had five previous sealed arrests on his rap sheet, police sources said.\nWalberto Perez, 23, a high school friend of the dead woman, said the fatal shooting was senseless.\n“She was a really great girl,” said Perez. “She didn’t deserve this.”\nThe casings found in the apartment on Montgomery St. resembled those found on the street at the murder scene, and were later matched at the NYPD crime lab.\n“The aluminum jacket we recovered at that scene was the same as the crime scene on Empire Blvd.,” confirmed NYPD Chief of Detectives Robert Boyce.\nThe gunman left his pistol behind at the apartment before bolting. And he couldn’t keep his mouth shut.\n“He makes statements to two people that implicate himself, and he makes statements to my detectives as well that he did not know the gun was loaded,” the chief added.\nMoise also smashed a mirror with his hand while in the apartment, and had a flag from a Caribbean nation wrapped around his bleeding hand when arrested.\nCops said the suspect slammed the Explorer into several parked cars, and was slurring his speech and struggling to stay upright when arrested.\nA woman in the apartment where Moise had dumped the weapon called police around 11 a.m., and the pieces soon fell into place. Moise was in custody for about three hours before investigators realized their DWI suspect was also a possible murderer.\n“He’s a good boy. This surprised our whole family,” a woman claiming to be a relative of the suspected shooter said as she waited outside the 70th Precinct Tuesday. “We believe this is a case of mistaken identity or maybe one of his friends did it and he took the blame.\n“This will get resolved, and I truly, truly know it was not him,” she added.\nA neighbor of the Poyau family hailed the police for the arrest, and wondered what was going through the suspect’s mind.\n“Why would you bring a gun to a parade?” asked Anna Jackson, 57. “You’re supposed to have fun, not shoot people.”\nCops remained stumped Tuesday in the second J’Ouvert murder, the shooting of a 17-year-old boy who walked over to a bench and sat down — unaware that he was shot near the intersection of Flatbush Ave. and Empire Blvd. Tyreke Borel died at 5:11 a.m. at Kings County Hospital."}