{"uri": "http://chicago.suntimes.com/news/twin-brothers-17-killed-in-old-town-drive-by-shooting/", "title": "Twin brothers, 17, among 17 killed in deadliest weekend of year", "dct": "Sun, 30 Oct 2016 22:05:00 GMT", "id": "775d4deabb2945cc9053b04f80c9509b", "content": "Twin 17-year-old brothers were killed in a drive-by shooting early Sunday in Old Town — among 17 people shot and killed in Chicago between Friday evening and Monday morning.\nIt was the deadliest gun-violence weekend so far this year, according to homicide totals tracked by the Chicago Sun-Times. Besides those shot and killed, 41 other people were wounded in gun violence citywide.\nRELATED: Wrigley focus did not neglect other neighborhoods, top cop says\nEdwin and Edward Bryant were standing outside about 3:15 a.m. in the 1300 block of North Hudson when a dark-colored vehicle drove by and someone inside opened fire, according to Chicago Police.\nThe brothers were two of four teenagers shot dead in Chicago since early Saturday.\nThe spike in violence over the weekend was on the mind of Chicago Police Supt. Eddie Johnson when he addressed the media at Navy Pier Monday morning, after a graduation ceremony for the department’s newest officers.\n“It was a tough weekend,” Johnson said.\n“Clearly there were a lot more people outside, but you would think people would be in a better frame of mind given the fact that the Cubs are playing in the World Series,” he added. “The majority of these shootings this weekend were gang-related, we know that.”\nThis year’s highest total for fatal shootings on a weekend had been 13; that number was reached on both Father’s Day and Labor Day weekends.\nIn another particularly violent stretch, nine people were killed in city shootings and 13 others were wounded on Monday, Aug. 9.\n“Until we start holding repeat gun offenders accountable for these crimes, they’re going to keep seeing cycles of gun violence like this. The majority of these shootings this weekend were gang-related, we know that. But they just have no fear of the consequences of their actions,” Johnson said Monday. “These violent gun offenders are clearly giving us the message that they just don’t care about the rest of the city of Chicago. To be quite frank, I’m sick of it and I know the people in the communities are tired of it. That’s why we have to do a better job of holding those individuals accountable.”\nJohnson said that in the case of the Bryant twins, “we do have video footage of that incident. We’re making progress on it. The two brothers, as far as we could tell, they didn’t have any documented gang affiliation. But the individuals they were with did. So it’s possibly gang-related.”\nHe added: “We are making substantial progress on a number of those cases over the weekend. We just have to ensure that we keep working hard and I know the detectives will.”\nEdwin Bryant was shot in the chest and back and was taken to Northwestern Memorial Hospital, where he was pronounced dead at 3:45 a.m., according to the Cook County medical examiner’s office and police. Edward suffered gunshot wounds to the chest and head and was also taken to Northwestern, where he was pronounced dead about an hour later.\nThe fraternal twins were juniors at Marshall High School in the East Garfield Park neighborhood on the West Side after transferring from Lincoln Park High School as freshmen, according to Edward’s youth basketball coach.\nEdward played basketball for the Marshall and for the Chicago Demons, a youth basketball program in Old Town, according to Chicago Demons Coach Vince Carter. Edwin also played basketball until middle school.\nCarter said Edward played on the Demons’ traveling team since 6th grade. Earlier this year, the Demons won the Bigfoot Classic in Houston and the Las Vegas Live tournament. About 30 teams competed in the tournament in Houston and about 75 teams in Las Vegas. “He was a big part of [those wins],” Carter said.\nStanding 6-foot-5, Edward played forward and could dunk, Carter said. He “had a Kevin Durant look…and had been coming into his own in the last few years.” He probably would have played college basketball, and Division I college teams “were looking at him.”\n“He played hard,” Carter said. “He loved basketball … but you had to push him to realize his potential.”\nEdward can be seen dunking at the end of the video below that was Tweeted by a teammate.\nMy boy could fly #restuped pic.twitter.com/xVPd1gK4NS\n//platform.twitter.com/widgets.js\nOther friends and teammates took to Twitter to pay their respects Sunday."}