{"uri": "http://www.pe.com/articles/shooting-823246-jan-corona.html", "title": "Man killed in accidental shooting at Raahauge range is identified", "dct": "Mon, 16 Jan 2017 20:10:00 GMT", "id": "3bc7dfbaf628739a6f3f5acdb04a44b9", "content": "At least two dozen shooting enthusiasts waited patiently to check in at Raahauge Shooting Enterprises near Corona at mid-morning Sunday, Jan. 15, a day after the range was closed because of a fatal shooting.\nThe man was identified Sunday night by the Riverside County Coroner's Office as Lionel Tan, 36, of Hawaiian Gardens.\nThe Riverside County Sheriff's Department, which is investigating the fatality, has deemed the shooting accidental.\n\"We don't know exactly what happened,\" said Cindy Raahauge Shenberger, the range manager, who declined further comment on the incident.\nIt was the first such incident in more than three decades at the outdoor range, she said. Regarding safety: \"Our record speaks for itself.\"\nThe victim was taken to a local hospital just before noon and pronounced dead, Deputy Mike Vasquez said Saturday. On Sunday, Vasquez released no additional information about the circumstances of the death and said the investigation is ongoing.\nShenberger said customers \"get a safety briefing every time.\" Rotating range masters are present on site and in the shooting bays monitoring use.\nStanding in line Sunday, Rose Chadwick of Corona, who has been to Raahauge's several times before, said, \"I feel very safe\" at the range.\nShe estimated it would take about 20 minutes to check in. She said she knows that the range staff take time with each customer to make sure \"they understand all the rules.\" The staff members are out keeping an eye on users for any violations of rules, she also said.\nOther customers, many of whom knew nothing about the fatal shooting Saturday, declined to comment.\nThe range is transitioning from paper to electronic waivers before patrons may use the facility, according to its website. A pop-up shelter had computer tablets set up near the office entrance to accommodate those who had not filled out a waiver in advance.\nThe Raahauge range, described by the owners as the largest shooting facility in California, offers shooting instruction, pheasant and duck hunting, dog training, a sporting clay range and more on a 1,200-acre site off River Road near Prado Regional Park, according to its website. The Raahauge family has operated a range at that site since 1971.\nThe popular range closed for several days in November after a fire burned several buildings and caused $2 million in damage. An electrical malfunction caused the fire, according to the Cal Fire/Riverside County Fire Department."}