{"uri": "http://www.wwltv.com/story/news/2016/01/15/jury-finds-trung-le-guilty-bourbon-street-shooting/78873168/", "title": "Jury finds Trung Le guilty in Bourbon Street shooting", "dct": "Fri, 15 Jan 2016 00:00:00 GMT", "id": "3bbe70529e52d37c7dda8fd9d4dca6c2", "content": "NEW ORLEANS -- A jury found 22-year-old Trung Le guilty of manslaughter in connection with a 2014 shooting on Bourbon Street that left one person dead and nine others injured.\nThe jury deliberated for fewer than two hours Friday night before returning the verdict. Le was also found guilty of attempted second-degree murder.\nThe July 29, 2014, shooting took the life of Brittany Thomas and left several others with wounds they still cope with today.\nBrittany Thomas' mother was present at the courtroom and was teary-eyed when she spoke to WWL-TV reporter Tania Dall. She said she's glad to \"see justice for Brittany.\"\nAmy Mathews, a tourist visiting from Australia who was shot in the face, said she was also grateful.\nIn a statement, New Orleans Mayor Mitch Landrieu said that he was satisfied with the verdict.\n\"\"Justice has been served,\" read the statement. \"Trung Le's callous and careless actions left 21-year old Brittany Thomas brutally murdered and nine others seriously injured. This is a terrible tragedy, and it is unacceptable. Today's verdict sends a clear and resounding message about accountability to the community – if you engage in violence, you will be prosecuted, sentenced and punished. \"\nThe defense for Le, the lone man facing charges for the shooting, rested without calling a single witness. However, Le's attorney, Martin Regan, offered a closing argument that lasted nearly 2 hours and 45 minutes.\nProsecutors said Le fired the first four shots at an unknown second gunman. But Le's defense attorney said that flight alone does not prove guilt, and that Le fled to Mississippi, where he was arrested, to get money from relatives for a lawyer.\nProsecutor Tiffany Tucker said, \"You are responsible for every bullet that leaves your gun.\" She also said Le had \"taken no responsibility, has offered no apologies\" for his actions that day.\nLe's sentencing is set for Feb. 18."}