{"uri": "http://www.nola.com/crime/index.ssf/2015/12/accused_bourbon_street_shooter_2.html#incart_river_index", "title": "Accused Bourbon Street shooter Trung Le's trial to start in 3 weeks after judge denies stay", "dct": "Tue, 22 Dec 2015 14:32:00 GMT", "id": "e0d64c7c2ad9b11e018fe01774bc8516", "content": "Accused Bourbon Street shooter Trung Le remains set for trial Jan. 11, after an Orleans Parish judge Tuesday (Dec. 22) swatted aside a defense attorney's efforts to further delay the case.\nLawyer Martin Regan made several overtures for more time, telling Criminal District Court Judge Byron C. Williams that it was unfair to expect him to be prepared for trial in 20 days. Not, Regan said, when prosecutors were still turning over discovery evidence and had not given him a complete list of witnesses to the June 2014 mass shooting in the French Quarter, a list the state Supreme Court already said he is not entitled to have.\n\"When the court of appeal reviews this case, it will find the video camera shows hundreds of people there,\" Regan said. \"Not just the witnesses the state wants to call, but witnesses to the events.\n\"There is a police report where someone said the shooter was a light-skinned black male with tattoos and black clothing, and the man fled down Bourbon Street. At the very least, I should be able to get (that witness') name and address to be able to interview him. It would be extremely valuable to me as a defense attorney.\"\n\"Mr. Regan, you're not persuading me at all,\" Judge Williams said. \"The law notes that nothing shall obligate the state to provide a witness list for any pretrial matter. You will only get what, under the law, this court deems you should receive. The Supreme Court has already ruled for the state. You litigated that and the state prevailed, the court finding that you're not entitled to a list, under the state's concern about witness protection.\n\"Now you want everybody in the neighborhood? ... Do your writs and whatever you want to do, but it's not going far.\"\nLe, 22, has pleaded not guilty to one count of manslaughter and one count of attempted second-degree murder in connection with the 2:45 a.m. gunfight that erupted in the 700 block of Bourbon Street on June 29, 2014. New Orleans police said gunfire between Le and an unidentified second man resulted in the death of 21-year-old nursing student Brittany Thomas and left nine others injured.\nRegan long ago acknowledged his client's role in the gunfight. But Regan said Le only acted in self-defense after the other man - \"the Bourbon Street terrorist,\" Regan has labeled him - pointed a gun at Le's friends and said, \"I've got a .40 for you.\" So far, only Le's friends have testified to this version of events. And Regan has not explained why Le fled to Mississippi, where he was arrested five days after the shootings.\nAssistant District Attorney Laura Rodrigue told the judge that Regan this week was given two discs of cellphone data seized from three of Le's associates, the final discovery evidence the state expected to have before trial. Williams, noting \"the gravity of the situation and the publicity raised by this case,\" ordered that a list of state witness be turned over to Regan five days prior to trial instead of the standard 48 hours.\nBut Regan was not satisfied, and pressed for more favorable rulings on a seven-point list of other motions. Williams went through the list, finding on each that the state already had satisfied or understood its obligations, higher courts already had ruled against Regan, or that some points were simply moot.\nRegan attempted to argue his written motions again, but the judge's patience was exhausted.\n\"I note your objection, but I've made my ruling,\" Williams said.\n\"But you didn't listen to the defense,\" Regan complained.\n\"I didn't listen to the defense because I didn't need to listen to the defense,\" the judge said. \"You've made your record. I've made my ruling. Why are you repeating? The record is clear. Cut it and move on.\"\nRegan, who in July 2014 was complaining that court proceedings against Le were not moving fast enough, then asked the judge to clarify the trial's start date.\n\"So am I to understand there will be no continuance?\" Regan asked.\n\"Bingo,\" Judge Williams replied. \"No continuance. Denied.\"\nRegan said he would file a new writ in federal court, seeking a stay on the trial and new review of the witness ID issue, and another asking that Williams be recused from presiding over the case."}