{"uri": "http://www.dailymail.co.uk/health/article-4024168/Man-28-right-arm-head-16-HOURS-day-accidentally-shooting-himself.html", "title": "Man, 28, has to keep his right arm above his head for 16 HOURS a day after accidentally shooting himself", "dct": "Mon, 12 Dec 2016 09:42:00 GMT", "id": "c2fdaed55b7ee75deb0f5586876e6cc2", "content": "A man has been told by medics to keep his right arm raised above his head for 16 hours a day after accidentally shooting himself with a hunting rifle.\nDavid Blount Jr, 28, blasted himself with his high-powered weapon just before a deer shoot in Montgomery, Texas on November 19 this year.\nAfter undergoing three 30 minute operations - one every 48 hours for a week to monitor and clean the wound - he has been told to keep his arm elevated for 40 minutes every hour.\nA foam block with a hole that he puts his arm inside keeps the limb raised, and when he sleeps he uses three pillows to keep it high up. The aim is to stop the blood accumulating in his hand.\nTold to continue with this intensive therapy for at least two weeks, it is unlikely the plumber will ever fully regain feeling in his right arm.\nHis fiancée, Kourtnee Harvey-Williams, 28, recalled how he phoned her while she was home, saying he had shot himself.\n'I was in complete shock,' she said. 'He told me he was on the way to hospital, dripping with blood.'\nThe couple, who have a 20-month-old daughter, Jordynn, live together in Montgomery, Texas.\nMs Harvey-Williams continued: 'Our lives have been turned upside down and his career has been put on hold, as he's right-handed and relies on his hands for work.\n'He was in such shock he couldn't feel any pain at first. Now he only has a bit of feeling in two of his fingers.'\nMr Blount, parked on his aunt Barbara Kroll's driveway a street away from his home, had picked up his rifle - a family heirloom passed down for generations – from the back of his pickup truck, when he shot himself.\nAs he touched the loaded gun's barrel, a bullet fired into his lower right forearm.\n'It was a freak accident, I had barely touched the gun, but the bullet went through my arm and flew out, skimming my head by five inches,' Mr Blount said. 'One of the tools in the truck must have caught on the lever.\n'There was a loud bang and a flash and the bone in my wrist was blown off. My wrist was hanging down and I'd torn all my ligaments.\n'I can't blame anybody but myself. I should have been more careful and shouldn't have left it loaded.'\nMs Harvey-Williams, a customer services representative, heard the gunshot at 5.30am, but, because of regular hunting in the area, she thought nothing of it.\nMeanwhile, Mr Blount walked into his aunt's home and said: 'I shot myself. The gun went off. I have shot my arm.'\nShe immediately wrapped his bleeding, limp, arm in a blanket and drove him to the Conroe Regional Medical Center, Texas.\nPhoning Ms Harvey-Williams on the way, Mr Blount spoke quietly and calmly, still in utter shock.\n'I was so stunned I didn't know what to expect,' Ms Harvey-Williams said.\n'I got in the car to follow him to hospital, dropping Jordynn off at my mum's on the way.'\nWhen she saw Mr Blount's wound, she was horrified.\n'The skin was completely gone. It was gross,' she said. 'The wound was mangled with bits of skin inside.'\nMedics gave Mr Blount antibiotics, cleaned his injury and bandaged his arm up.\nAlthough he was bleeding badly, he didn't require any blood transfusions, but was told he'd need surgery.\nWithin a couple of hours, he was transferred to the Memorial Hermann-Texas Medical Center, in Houston, Texas.\nThere, he had a half-hour exploratory operation, to ensure there were no bullet fragments in his arm, to clean his wound and put antibiotic beads inside.\nThis surgery was repeated every 48 hours for a week, to ensure his arm didn't get infected.\nAt the end of November, surgeons took skin from his left thigh and muscle from his left underarm, to graft his arm back together, as well as putting a temporary metal rod inside to join up the bones, in a five-hour procedure.\nNow, in six weeks' time, surgeons will replace the rod with bones from David's pelvis, in another operation, and it's possible he will need further skin grafts.\n'We are trying to maintain a normal life, as much as we can.\n'Jordynn is a daddy's girl and it's hard for her to understand what's going on.'\nDoctors are unable to forecast how long it will be before David gets movement back in his hand, but he will never get the full use again.\nHe will start physiotherapy in a couple of weeks and his family remain hopeful.\nMs Harvey-Williams said: 'A lot is up in the air at the moment, but he is strong willed and we are hoping for improvement by our wedding next year.'\nThe family are aiming to raise $10,000 for David's medical costs."}