{"uri": "http://www.tulsaworld.com/news/courts/two-alleged-gang-members-bound-for-murder-trial-in-tulsa/article_b1280d3d-2616-51c5-a21c-623c062ead53.html", "title": "Two alleged gang members bound for murder trial in Tulsa barber shop shootings", "dct": "Thu, 16 Jul 2015 00:00:00 GMT", "id": "81be574986c3e0042690f330e549d815", "content": "Chadrick Colbert (left) and Dezmen Smith: The two alleged gang members were bound over for trial in the death of Keith Liggins, a barber and an innocent bystander in the Feb. 7 shooting at the Gifted Hands and Beauty Shop, 1219 N. Sheridan Road. They are also charged with three counts of assault and battery with a deadly weapon in the wounding of four other people at the shop.\nRelated story: Rash of shootings in north Tulsa result of years of fighting among gangs, police say\nRelated story: Two men Chadrick Colbert and Dezmen “Dash” Smith charged with murder in Tulsa barber shop shootings\nTwo men charged with first-degree murder in a gang-related shooting at a Tulsa barber shop were bound over for trial Wednesday.\nChadrick Colbert and Dezmen “Dash” Smith, both 24, are charged in the death of Keith Liggins, a barber at the Gifted Hands Barber & Beauty Shop. He was shot as the business was closing around 9 p.m. Feb. 6.\nThe defendants are also charged with three counts of assault and battery with a deadly weapon in the wounding of four others at the shop, located at 1219 N. Sheridan Road.\nColbert and Smith were named in an affidavit for a search warrant filed in early July in Tulsa County District Court listing recent shootings that have resulted from a gang feud between the Hoover Crips — Tulsa’s largest street gang — and the “Squeeze Team,” which includes members of several gangs.\nThree homicides have been linked to the feud, which has resulted in countless documented shootings with many more going undocumented, police say.\nThe affidavit states that Colbert and Smith are certified Hoover Crips members, and that two members of the 5Trey Crips and the Neighborhood Crips — two gangs involved with the Squeeze Team — were shot at in the barber shop when Liggins, a barber innocently standing by, was shot and killed. A toddler was also receiving a haircut at the barber shop at the time, according to the affidavit.\nIn court Wednesday, District Judge William LaFortune read the evidence that he found sufficient to take the case to a jury trial.\nHe said Colbert had gone into the barber shop earlier that day, where he was threatened by the Neighborhood Crips member. Colbert then left and returned with a .40-caliber pistol and Smith, who was carrying an AK-47 assault rifle.\nColbert entered the shop with Smith following him, and then shots were fired, LaFortune said.\nCourt records allege that Smith intended to shoot a man whose hair was being cut by Liggins. Tulsa police homicide Sgt. Dave Walker has said the intended target fired back and that Colbert was struck in the buttocks.\nColbert’s attorney, M.J. Denman, filed a motion Wednesday claiming that the state had not provided enough evidence to go to trial because no one who testified at the preliminary hearing could clarify who fired the first shot.\nLaFortune ruled against the motion, saying that regardless of who fired the first shot, Colbert and Smith chose to return, armed, to the shop where Colbert had been threatened and where they knew there would be an altercation.\nColbert was previously arrested Aug. 19 after being named in the federal Operation Battlefield indictment, which addressed the Hoover Crips’ drug business in Tulsa. Fifty-one people were charged in the indictment, which alleges that the gang brought $10 million worth of cocaine and marijuana into Tulsa during a three-year period.\nLaFortune set the trial for Colbert and Smith on Feb 29 and a status conference Jan. 11."}