{"uri": "http://www.wsbtv.com/news/news/local/family-4-year-old-hit-stray-bullet-asks-prayers/npdzf/", "title": "Family of 4-year-old hit by stray bullet asks for prayers", "dct": "Mon, 07 Dec 2015 18:17:00 GMT", "id": "63e2f8898d106456fe0f35b990567be0", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nDEKALB COUNTY, Ga. - A DeKalb County family is asking for prayers for their 4-year-old who is recovering from a gunshot wound.\nJaQuavious Landers was caught in the crossfire at the Highland East Atlanta apartments on Flat Shoals Road.\nRalph Carter, the boy’s father, was watching the children Saturday afternoon when it happened.\n“I had just sent them to the ice cream truck while I was waiting on my brother to come out,” said Carter. “As he was coming out, we getting ready to go and it erupted.”\nCarter initially thought his son had tripped and quickly realized JaQuavious was hit.\n“He got shot in his chest,” Jasmine Landers, the boy’s mother said. She was at work at the time of the incident.\nCarter explained what he did next.\n“I just laid down with him and gave him one finger and told him to squeeze and just stay with us. Just keep looking at me,” he said.\nJaQuavious remains in critical condition at Children’s Healthcare of Atlanta at Egelston. He had surgery to repair his bladder, a kidney, liver and lungs and had his spleen removed.\n“He’s not out the red yet,” explained Lisa Benton, the boy’s grandmother. “So we just praying that whoever did this, they turn themself in.”\nLanders’s four children were visiting family when they were outside playing. Now they don’t want to leave her side.\n“They don't even want to go outside and play with the other kids anymore because you just don't know what's gonna happen,” Benton said. “You send your child outside to play and they were being attended, but this is just reality in the world we live in today.”"}