{"uri": "http://abc30.com/news/fresno-county-sheriffs-deputy-identified-killed-in-accidental-shooting/1584165/", "title": "Fresno County Sheriff's deputy identified killed in accidental shooting", "dct": "Tue, 01 Nov 2016 00:00:00 GMT", "id": "ed050d94a749ae8c113aba397ee881d1", "content": "FRESNO, Calif. (KFSN) --\nThe Fresno County law enforcement community is in mourning as they remember Sergeant Rod Lucas who was killed in the line of duty.\nTo understand Lucas' life one only needs to look to those around him.\n\"Everywhere he went he participated in his community. He was a law enforcement officer and always gave of himself,\" said Noel Bernal, friend.\nRELATED: SMALL TOWN MOURNS AFTER ACCIDENTAL DEATH OF FRESNO COUNTY SHERIFF'S DEPUTY\nEven in death his colleagues were beside him. In line as his body was moved to a funeral home.\n\"He was the sergeant people wanted to work for he was that kind of guy,\" said Fresno County Sheriff Margaret Mims.\nLucas died Monday at the Special Investigations Unit. Sheriff Mims said his co-worker's gun accidentally fired and shot him in the chest.\nSheriff Mims does not know how or why the gun went off and still needs to interview the detective who owns the gun. Right now she said he's just too distraught to speak.\n\"That particular group, as you can imagine in an office offsite from downtown, is very tightly knit group. They're close. They'll help each other through this.\"\nThe 46-year-old leaves behind a wife and four children. He also leaves behind the community of Tranquillity. It's where he grew up then went back to serve as a coach and school board member.\n\"I know we have several students, former students now in law enforcement and a lot of those were because of Rod. They followed him into that profession. And, we lost a good one,\" said Nick Bowles, former teacher and coach.\nA man who exemplified the role of a mentor, friend, and protector of the community.\nTuesday night Governor Jerry Brown released a statement saying in part, \"Anne and I extend our deepest sympathies to Sergeant Lucas' family, friends and colleagues as they mourn this tragic loss. We join all Californians in honoring his dedication and service to the people of Fresno.\"\nAt this point, no funeral arrangements have been released.\nBut deputies can take comfort in knowing the legacy Lucas left behind, including a medal of honor under valor he won in 2010.\nLucas was back in his hometown of Tranquillity responding to an armed robbery when he chased the suspect on foot for a mile. When he and two other deputies closed in, the robber pulled a gun.\nLucas shot first, though, and saved himself and the other two deputies. His award writeup said Lucas' actions on that day showed his true character-- qualities his team will always remember."}