{"uri": "http://www.nola.com/crime/index.ssf/2015/07/algiers_man_arrested_after_son.html#incart_river", "title": "Algiers man arrested after 5-year-old son finds gun, shoots himself in hand", "dct": "Tue, 28 Jul 2015 10:45:00 GMT", "id": "8e9b36a79fc7ccc3be20b36f88f13274", "content": "An Algiers man has been arrested after his 5-year-old son shot himself with an unsecured handgun found in his father's bedroom last weekend.\nNew Orleans police booked 36-year-old Mohammad Esmail on Sunday (July 26) with second-degree cruelty to a juvenile after an investigation into the Saturday afternoon shooting at his home in the 3100 block of General Meyer Avenue.\nAccording to police, Esmail left his fully loaded .38-caliber weapon on a window sill behind a reclining chair, hidden under the blade of a fan. The boy found the gun, pulled the trigger, and shot himself in the left hand. The bullet also passed through the bedroom door and a wall before landing on the living room sofa, according to NOPD Child Abuse Detective Mathew White's arrest warrant affidavit.\nThe report said the child was taken to Ochsner Hospital for treatment of his hand injury, but his condition was not disclosed.\nAccording to state law, second-degree cruelty to a juvenile involves \"the intentional or criminally negligent mistreatment or neglect by anyone over the age of 17 to any child under the age of 17 which causes serious bodily injury or neurological impairment to that child. ... 'Serious bodily injury' means bodily injury involving protracted and obvious disfigurement or protracted loss or impairment of the function of a bodily member, organ or mental faculty, or substantial risk of death.\"\nCourt records show Esmail already is free after posting a $7,500 bond that was pre-set for him by Orleans Parish Magistrate Commissioner Juana Lombard. The next hearing in his case was set for Sept. 24, but a progress report on Aug. 21 may reveal whether the district attorney's office agrees with the charge brought by police.\nIf charged and convicted of second-degree juvenile cruelty, Esmail would face up to 40 years in prison."}