{"uri": "http://www.nydailynews.com/new-york/nyc-crime/dead-wounded-overnight-nyc-shootings-article-1.2851203", "title": "One dead, four wounded in overnight New York City shootings", "dct": "Sun, 30 Oct 2016 10:47:00 GMT", "id": "5d5a4afaad9b8135387f309d7f236ac7", "content": "A rash of shootings across the city early Sunday left one man dead and seven other victims – including two teens — wounded, police said.\nIn Queens, a gunman shot a 36-year-old man to death around 2:15 a.m., cops said.\nThe suspect fired one shot into Niheen Donigan’s head on the corner of 109th Ave. and 171st St. in Jamaica, according to officials.\nParamedics rushed Donigan to Jamaica Hospital, where he died from his wounds.\nDonigan had a long history with crime and violence, police said.\nOn April 14, 2001, Donigan fatally shot Aswald Walker, 28, in Jamaica — about a mile from where he was killed.\nPolice arrested Donigan about five weeks later after tracking him down at his cousin’s Massapequa home on May 23. He barricaded himself inside and held a five-hour-long standoff with cops, but was ultimately arrested and charged with murder.\nDonigan served nearly 10 years at Wallkill Correctional Facility before being paroled in July 6, 2012 with five years of post-release supervision.\nSunday’s mayhem began in Harlem, where an unidentified suspect shot a 20-year-old woman in the buttocks inside the lobby of the Drew Hamilton Houses on W. 143rd St. around 1:15 a.m., cops said.\nEmergency responders took her to New York-Presbyterian Columbia Hospital. She is in stable condition.\nLater, a gunman blasted three men outside an apartment building in the Bronx, authorities said.\nThe shooter fired at the people — two teenage boys and a 20-year-old man — on W. 165th St. near Woodycrest Ave. in Highbridge around 2:45 a.m., cops said.\nThe youngest victim, just 15 years old, was struck in the right leg. A 17-year-old was hit in the chest and the oldest victim was shot in the back, police said.\nThe trio was taken to Lincoln Hospital, where officials said they are expected to survive.\nOn the Lower East Side, a shooter wounded another three men when an argument turned violent just after 6 a.m., authorities said.\nThe suspect sprayed bullets on Ridge St. near Stanton St., hitting a 25- and 35-year-old in the leg, and a 23-year-old in the leg and stomach.\n“I heard five shots, really loud,” said Johnny, who witnessed the shooting and declined to give his last name. “It looked like three guys got hit, and taken away in an ambulance.”\nThe three men were taken to Bellevue Hospital, and are in stable condition.\n“I was out here about five hours ago, and the same guys were fighting down the street,” the witness said. “One guy got punched in the face pretty hard.”\n“I see them around all the time. They’re all kids from the neighborhood,” he added.\nThere were no arrests in any of the shootings, police said Sunday morning."}