{"uri": "http://www.orlandosentinel.com/news/breaking-news/os-victor-hernandez-shot-eye-orlando-20150803-story.html", "title": "Orlando police: 10-year-old boy may lose left eye in stray-bullet shooting", "dct": "Mon, 03 Aug 2015 15:47:00 GMT", "id": "40cfd65232d0c1dd62d33e5bcb865f81", "content": "The vehicles in the photos were present during the shooting which wounded a 10-year-old boy at Pacifico Place Apartments on Saturday and are of interest, Orlando Police said. (Orlando Sentinel / Orlando Police Department)\nWhen Gloria Perez returned home from doing laundry Saturday night, she saw her 10-year-old grandson running toward her car while screaming and covering his bleeding left eye.\nThe boy, Victor Hernandez, had been hit by a stray bullet about 7:30 p.m. while looking out of his bedroom window at a fight outside his residence at Pacifico Place Apartments on Shenandoah Way in east Orlando.\nHe was rushed to Arnold Palmer Hospital for Children with likely permanent damage to his left eye.\nMeanwhile, three others showed up at a local hospital with gunshot wounds about 15 minutes later.\nThe three were identified as a 17-year-old boy, Louis Suarez, 21, and Diego Hernandez, whose age wasn't released by police.\nA police update Monday included surveillance photos \"of interest\" of the vehicles in the parking lot at the time of the shooting.\nOne of the wounded victims didn't cooperate with detectives. While another said he heard a verbal altercation and gunfire before realizing he was shot.\nThe 17-year-old boy was arrested Sunday on a warrant, a police spokeswoman said, but the charges weren't immediately available.\nAdditional details emerged Monday in the police report.\nPerez declined comment Monday. But her account, along with other witnesses, were included in the report. The incident happened about 7:30 p.m., according to police, when a fight broke out in the parking lot of Pacifico Place Apartments — near Semoran Boulevard and Lake Underhill Road.\nWitnesses said they heard between seven and 15 gunshots.\nOne witness looked out of her window and saw a man hop the fence in front of her home on nearby Diego Street to get to an apartment complex beside hers. She eventually lost sight of him but later saw two vehicles speed away from the area.\nAnother witness was sitting in a vehicle on nearby Pablo Lane — waiting for her mother to come downstairs — when she heard shots.\nShe then heard a man say, \"Let's go! Let's go! I got it!\" The man, who was limping, jumped inside a vehicle and sped away. Police found several vehicles with bulletholes. There was one gunshot through the window of the 10-year-old boy's bedroom.\n\"I could see blood trails all along the hallways and in the parking lots,\" an officer said in the report."}