{"uri": "http://wate.com/2016/07/08/tbi-bristol-shooting-suspect-may-have-targeted-police-officers-african-americans/", "title": "TBI: Highway gunman in Bristol motivated by police shootings", "dct": "Fri, 08 Jul 2016 14:59:00 GMT", "id": "5ba92e55e40bea57288dd2e9bbdbb175", "content": "BRISTOL (WATE/AP) – A man accused of shooting indiscriminately at passing cars and police on a Tennessee highway told investigators he was angry about police violence against African-Americans, The Tennessee Bureau of Investigation said Friday.\nOne woman died and three others, including one police officer, were injured in the rampage. TBI said a preliminary investigation revealed that Lakeem Keon Scott, 37, who is black, was troubled by several incidents across the United States.\nScott was injured in the shooting and remains in serious, but stable condition at Bristol Regional Medical Center. He has no been charged.\nJennifer Rooney was killed in the shooting. Deorah Watts, David Whitman Davis and Officer Matthew Cousins were injured. Police confirmed all those shot were white.\nThe announcement comes just hours after 12 officers were shot at a Black Lives Matter protest in Dallas by a man who police say declared he was angry about police shootings of black men and wanted to exterminate whites. Five of the officers died.\nThe shooting spree in Bristol began around 2:20 a.m. Thursday. TBI said Scott, armed with at least two weapons and a large amount of ammunition, fired shots through the window of a Days Inn, striking the clerk.\nThe front desk clerk, Deborah Watts, was struck and injured. Days Inn owner Kiran Patel said he awoke to the sound of gunfire. His wife called the front desk to see what happened, Watts answered and said she’d been shot. She remains in the hospital in serious but stable condition.\nScott also fired at several vehicles that were driving on Volunteer Parkway, according to TBI. Newspaper carrier Jennifer Rooney, a 44-year-old mother of two, was on her way to pick up papers for the morning delivery when a bullet struck her. The Bristol Herald-Courier reported that her car careened over a median and crashed through a chain link fence.\nDavid Whitman Davis was also injured by flying glass from the gunfire, the TBI said.\nThree officers with the Bristol Tennessee Police Department arrived and confronted Scott, who fired on them.\nOffice Matthew Cousins was hit in the leg. He was treated for superficial injuries and released.\nScott was stuck by the officers returning fire. He remains in the hospital in serious but stable condition.\nThe Tennessee Bureau of Investigation said the investigation is ongoing as they work to understand the shooter’s motive.\nThe Associated Press contributed to this report."}