{"uri": "http://wkrn.com/2016/07/07/newspaper-carrier-dead-4-others-injured-in-random-shooting-in-bristol/", "title": "Newspaper carrier dead, 4 others injured in random shooting in Bristol", "dct": "Thu, 07 Jul 2016 11:09:00 GMT", "id": "80dd3ffcc206988dfc341ccca9fa90f4", "content": "BRISTOL, Tenn. (WJHL) – The Tennessee Bureau of Investigation revealed in a press conference Thursday morning that one person is dead and four others were injured, including a police officer, in a random shooting in Bristol.\nNews Channel 11 learned the woman who was killed in the random violence is a local newspaper carrier.\nThe shooting happened around 2 a.m. Thursday on Volunteer Parkway, near the Days Inn and O’Reilly Auto Parts.\nThe TBI revealed the shooter was armed with two guns and was firing shots at the Days Inn and vehicles along the roadway.\nAs the officers arrived on the scene, the suspect began to shoot at law enforcement, forcing them to return fire.\nThe victims, including the suspect, were all taken to Bristol Regional Medical Center.\nThe TBI says it will not release the name of the suspect or the names of the victims until the investigation is complete.\nThe Bristol Herald Courier told News Channel 11 its newspaper carrier, 44-year-old Jennifer Brewer Rooney, was killed in the shooting.\nFour others were injured including a police officer.\nBristol Police Chief Blain Wade told News Channel 11 his officer’s injuries are minor.\nThe extent of the injuries of the others who were shot are not known at this time.\nInvestigators are trying to determine what provoked the shooter to randomly shoot at motorists along the Volunteer Parkway.\nA motive has not been determined. Multiple agencies are assisting in the investigation.\nTBI agents are protecting evidence at various crimes scenes with tents. Agents are also using a drone to capture images and video of the crime scenes.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}