{"uri": "http://www.wrcbtv.com/story/30586948/17-year-old-in-serious-condition-after-shooting-in-sequatchie-county", "title": "UPDATE: 17 year-old in serious condition after shooting in Sequatchie County", "dct": "Wed, 25 Nov 2015 12:00:00 GMT", "id": "a26201b905a35ce8bc5b87e25d696737", "content": "UPDATE: Investigators in Sequatchie County are one step closer in piecing together a mystery - after a teenager was shot Saturday.\nA closer look at the Jeep the 17-year-old was in, revealed a bullet hole that was not easily detected. Channel 3 was there as investigators collected evidence. Investigators say the teen is lucky to be alive, the bullet missed his vital organs by millimeters.\nRemoving it could be life threatening. Deputies are now asking for the public's help in solving this case. They want to know who fired the shot and why.\nOfficials say two 17 year-old's cousins were in the Jeep, when one of them was shot. The pair was off-roading down a dirt road near Blue Sewanee and Smith Mountain Road, when a single gunshot changed everything.\n\"He almost died, the young man almost died,\" said Sheriff Ronnie Hitchcock, Sequatchie County Sheriff's Dept. \"He had a fight for his life.\"\nThe driver told authorities he heard the gunfire, then noticed his cousin slouched over in the passenger seat. The teen in the passenger seat was shot in the back.\nThe victim's cousin rushed him to a nearby hospital, where he was airlifted to Erlanger in Chattanooga. After several surgeries, he's in serious but stable condition.\nSheriff Hitchcock says the bullet traveled through the back seat at an angle, striking the teen and traveling through his liver.\n\"We still have no clue of who did the shooting or where the shot came from,\" said Sheriff Hitchcock. \"We don't know what caliber it was, because the bullet is still in the young man and doctors did not want to take out the bullet fragment.\"\nChannel 3 was there as deputies used trajectory tools to map out the bullet's path. Finding the bullet's entry wasn't as easy.\n\"We looked over, searched it ,we searched it and we searched,\" said Sheriff Hitchcock. \"It was really puzzling, it had us all puzzled.\"\nInvestigators found the entry point near the back windshield on Monday, it was the size of a pen mark. The hot bullet went through a thin rubber strip beside the back window, partially melting the hole behind it. A fresh dent on the back side of the jeep, gave it away. Deputies know how, they're still investigating why. With Saturday being the first day of open rifle season, officials say it's possible this was a hunting accident.\n\"People need to take precautions when they are out hunting in the woods and make sure,\" said Sheriff Hitchcock. \"Bullets don't have eyes.... they need to make sure which way they are shooting and don't shoot towards the road. if it was a true accident they won't be in trouble because that is something that is a freak accident. They need to come forward if they know anything.\"\nSheriff Hitchcock is warning residents to be careful in the woods during hunting season. He is also asking hunters to be careful and never shoot toward a road or house.\nThe teen is still in ICU, in serious condition. If you have any information that can help investigators call Sequatchie County Sheriffs Dept at (423) 949-7750\nPREVIOUS STORY: The Sequatchie County Sheriffs Office is investigating a weekend shooting that seriously injured a teen on Smith Mountain Saturday.\nThe 17-year-old was sitting in a Jeep Grand Cherokee parked in the woods near Blue Sewanee and Smith Mountain Road when he was shot in the back. The spot is said to be a popular hang-out spot for teens.\nSequatchie County Sheriff Ronnie Hitchcock says the teen is in intensive care at Erlanger.\nInvestigators are trying to find out where the bullet came from, but one possible answer is it could be a stray bullet that may be hunting-related or even an accidental shooting.\nhe shooting happened around noon in broad daylight. Tonight deputies want to know who pulled the trigger and why.\nSequatchie County Deputies have few leads.\n\"Well that's kind of concerning for me very concerning,\" said neighbor Thomas Miller.\nNeighbors tell Channel 3, this place is a popular hang out spot among teens.\n\"Over the years they've come up here in 4 wheelers...there is a lot of 4 wheelers up there and a lot of traffic during hunting season,\" said Miller.\nThe boy is in a Chattanooga ICU, detectives hope he can give them the missing piece of information.\n\"You just can't get out here and shoot anywhere you want, there are quite a few people that live here,\" said Miller.\nThis small town does what small towns do-- they help each other.\n\"I have 2 sons and 1 daughter and my son got injured in the Marine Corps he is 100 percent disabled now. I know how I would feel if it was one of my sons laying up there in ICU right now, not knowing what is going to happen,\" said Miller. \"We'll pray for them.\"\nIf you have any information that can help investigators call Sequatchie County Sheriffs Office at 423-949-7750."}