{"uri": "http://www.wwltv.com/news/local/orleans/man-killed-in-bourbon-street-shooting-identified-as-25-year-old-tattoo-artist/356262531", "title": "Young man killed in Bourbon St. shooting was NOCCA art student", "dct": "Tue, 29 Nov 2016 00:00:00 GMT", "id": "087f1f2dcfd72b65842a624d8d3943cd", "content": "The man killed in Sunday's Bourbon Street mass shooting has been identified as Demontris Toliver, a 25-year-old tattoo artist who lived and worked in Baton Rouge.\nFriends said Toliver was in town to celebrate his birthday and the Bayou Classic.\nDuring a press conference, Mayor Mitch Landrieu said Toliver was a New Orleans native. According to Toliver's Facebook page, he attended NOCCA and O. Perry Walker High School.\n\"Demontris Toliver did what any other 25 year old from New Orleans does on Thanksgiving, or their birthday--or on Mardi Gras or Jazzfest or for a family event--he came home. It was during this most banal and simple of acts that Demontris was shot and killed on Bourbon Street early Sunday morning, guilty of nothing besides wanting to come home to celebrate,\" said a statement from NOCCA CEO, Kyle Wedberg.\n\"My thoughts and prayers, and those of the NOCCA Community, go out to the family of Demontris Toliver. Those thoughts and prayers are also for all of us in this community as there is one less artistic voice, one less difference-maker in our midst.\"\nPhotos on Toliver's public Instagram page showed drawings and paintings the young man created.\nA photo posted by 💡DEMONT (@_demontt82) on\nMar 20, 2016 at 4:31am PDT\nToliver is the lone fatality as of Sunday afternoon in the mass shooting that wounded nine other people. The extent of their injuries is unknown.\nThe shooting occurred around 1:30 a.m. on Nov. 27 near the corner of Bourbon and Iberville.\nTwo arrests were made at the scene of the shooting for illegal carrying of a firearm according to NOPD. One of the suspects arrested was wounded in the shooting, the other was illegally carrying a weapon at the scene, but was not involved in the shooting according to police.\nIn total, eight men and two women were shot. Their ages range from 20-to-37 years old.\nNOPD Superintendent Michael Harrison said their were \"30 or more\" officers in the area as well as EMS when the shooting occurred.\n(© 2017 WWL)"}