{"uri": "http://www.nola.com/crime/index.ssf/2016/11/2_bourbon_street_shooting_vict.html", "title": "2 Bourbon Street shooting victims told family they saw argument before gunfire", "dct": "Sun, 27 Nov 2016 14:09:00 GMT", "id": "c13b120ade73f1c0d07e8534a0b5588c", "content": "Two Bourbon Street shooting victims told relatives they saw two men arguing with each other moments before the gunfire erupted early Sunday (Nov. 27). One man started to walk away, family members recounted, then turned back and opened fire.\nTwelve hours later after the mass shooting, Jessie Ben of Lafayette was preparing to take her daughter, Brittany Ben, 20, to a hospital to check on the two bullets that remain inside her body. Brittany Ben was struck by five bullets, and her nephew suffered a broken pelvic bone from a gunshot.\n\"She's in a lot of pain right now,\" Jessie Ben said of her daughter. \"She's in and out of it.\"\nJessie Ben said her grandson, Deion Ben, 21, remains in a New Orleans hospital being treated for a gunshot wound to his groin area, she said. \"He's in a lot of pain also,\" she said.\nOne relative who was in New Orleans with Brittany and Deion Ben said she was down the street from them at the time of the shooting. She didn't hear gunshots but saw people running. Then, she got a phone call telling her that Brittany and Deion had been shot.\nThis relative, who asked that her name be withheld for her safety, said she ran toward Iberville Street. Brittany Ben was already in an ambulance, but Deion was still on the sidewalk -- bloody and barely able to talk. \"I was devastated,\" the relative said.\nJessie Ben said she got the call after 1 a.m. to hurry to New Orleans as her daughter and grandson, both Lafayette residents who were in New Orleans for the Bayou Classic, had been shot on Bourbon Street. Brittany Ben, who studies nursing at Southern University in Baton Rouge, had been shot five times, including three times in the chest and twice in the arm, Jessie Ben said. Deion Ben, who works at a Lafayette car lot and is Brittany's nephew, was shot in the groin area, a hit that broke his pelvic bone, Jessie said.\nLater Sunday, hospital staff were about to send Deion Ben home. But when he got up and began to get dressed, he started bleeding, requiring the attention of a trauma doctor, Jessie Ben said.\nBrittany Ben was treated at a New Orleans hospital and released with two bullets still inside her body, Jessie said. \"They let me take her home,\" Jessie said.\nShe planned to take Brittany to another hospital out of concern that the bullets could cause further damage. \"We don't know what those bullets are going to do,\" she said.\n. . . . . . .\nJonathan Bullington contributed to this report."}