{"uri": "http://www.theadvocate.com/new_orleans/news/crime_police/article_787af20a-b482-11e6-9523-27a01d744e17.html?sr_source=lift_amplify", "title": "Bourbon Street shooting: 2 shooters on loose; 10 victims innocent; 'unconscionable,' 'unacceptable' act, mayor says", "dct": "Sun, 27 Nov 2016 18:30:00 GMT", "id": "c8f9a9bdf1f0904491dbe04135af3d77", "content": "An argument between two visitors to New Orleans sparked a gunfight early Sunday on Bourbon Street, police said, leaving a young Baton Rouge artist dead and nine others injured in a spray of bullets that sent hundreds of early morning partiers running in terror.\nThe bloodshed in the 100 block of Bourbon, near Iberville Street, eerily echoed the carnage from a two-man gun battle six blocks away on the same street in June 2014.\nThe return of a mass gun attack on the city's most famous entertainment corridor left Mayor Mitch Landrieu, Gov. John Bel Edwards and others groping for calming words as a national spotlight returned to a city already reeling from a recent swell of shooting sprees and murders.\nNew Orleans police had yet to identify either perpetrator by late Sunday. Police Superintendent Michael Harrison said both fled on foot, apparently unharmed. Pleading for the public's help, Harrison described the mass shooting as an \"act of brazen cowards.\"\nNone of the victims — including slain 25-year-old tattoo artist Demontris Toliver — appeared to have been targets, Harrison added. He said agents with the FBI, the ATF and other law enforcement organizations had joined in the manhunt.\nHarrison described it as an argument that began elsewhere, migrated to Bourbon Street and \"turned to a shootout.\"\n\"They made a choice to endanger the lives of thousands of visitors and residents who were in the area,\" Harrison said of the shooters. \"I'm confident we will track down those responsible for the crimes. We will hold them accountable for their actions.\"\nToliver was with friends, joining the crowds in town for festivities surrounding the Bayou Classic football game that took place Saturday inside the Mercedes-Benz Superdome, when he was struck down, a friend, Aaron Washington, told The New Orleans Advocate.\nThe young artist was shot in the chest and shoulder blade area and died at the hospital, police said. His slaying marked the 162nd homicide this year in New Orleans — a figure the city reached last year on Dec. 29, according to Jeff Asher, a former city crime analyst.\nLandrieu described Toliver's killing as \"a tragic death for what would otherwise have been a very promising life.\"\nThe mayor also credited the NOPD and State Police with a \"heroic\" response, saying there were 35 officers within a block at the time of the shooting and Emergency Medical Services personnel at the corner. He called the response \"immediate,\" \"aggressive\" and \"robust.\"\nThe victims, including Toliver, were eight men and two women ranging in age from 20 to 37, Harrison told reporters before daybreak Sunday.\nBy late afternoon, five had been released from the hospital. The four other surviving victims were being treated and were expected to recover, police said.\nOnly one of the shooting victims, a 21-year-old Mississippi man, is from outside Louisiana. Two — both 22-year-old men who were released with minor injuries — are from New Orleans, police said.\nCan't see video below? Click here.\n\"To say the least it was an unconscionable act and it was unacceptable and it continues to put an exclamation point on the death and destruction gun violence has played out on the streets of New Orleans,\" Landrieu said. \"And like I've said many, many times, it's almost impossible to understand.\"\nJessie Ben of Lafayette said her 20-year-old daughter Brittany Ben and her 21-year-old grandson Deion Ben were among the nine injured.\nBrittany Ben was struck by five bullets and is due to undergo surgery at a hospital in Lafayette, where she lives, on Monday morning, Jessie Ben said.\n\"She's in a lot of pain right now,\" she said about her daughter. \"She feels nervous. But she's hanging in there.\"\nHer grandson was shot in the pelvis, and his injuries were so severe and painful that he had to stay in a hospital in New Orleans, she said.\nJessie Ben recalled rushing to New Orleans after getting the early morning call that the two had been injured while attending festivities related to the Bayou Classic. Her daughter, she said, was studying nursing at Southern University in Baton Rouge.\n\"It was terrible,\" Jessie Ben said. \"I couldn't think. I just said, 'Please, let my daughter be alive.' \"\nIf it all sounds familiar, that's because so much of what happened about 1:30 a.m. Sunday mirrored the bloody events of about 2:45 a.m. June 29, 2014, in the 700 block of Bourbon Street.\nThat two-man gunfight also left nine victims with bullet wounds, while claiming the life of a young bystander, 21-year-old Hammond nursing student Brittany Thomas, in a mass shooting that shook the city.\nSome 15 bullets were fired on that occasion, prompting Landrieu to plead for State Police to help secure the Crescent City's historic tourist district.\nA contingent of state troopers, bankrolled by a new French Quarter sales tax, is now part of a patchwork of measures meant to beef up law enforcement presence in the seven-by-13-block neighborhood, to compensate for a steep manpower shortfall in the NOPD.\nYet the shooting Sunday morning was committed in spite of a highly visible police presence, with extra officers added to work the thick Bayou Classic crowds on Thanksgiving weekend.\n\"As always the city of New Orleans was an open and a happy host to have all these individuals with us, and the police were deployed for the entire four or five days, and until the middle of last night it was a glorious vacation and a wonderful holiday by all measures,\" Landrieu said.\nHarrison said at least 30 law enforcement officers were close by when the gunfire rang out in what a parking attendant nearby described as a rapid succession of shots.\nSurveillance video obtained by The Advocate shows numerous officers swarming the first block of Bourbon Street on horseback and foot beginning just 20 seconds after the crowd broke out running down the promenade, away from the gunfire near Iberville Street.\nCan't see video below? Click here.\nAlan Morey, a New Orleans resident who witnessed the shooting, said he saw numerous police and at least four ambulances arrive quickly.\n\"Pretty much the whole cavalry,\" he said, noting that he also saw plainclothes officers on the scene.\nIn a statement, Gov. Edwards pledged his help and sent prayers to the victims and the city, \"as we try to make sense of this awful incident.\"\nIt was only the latest among many such incidents in New Orleans, which has seen mass shootings over and over again in the past several years.\nJust on Friday, four people were shot on a street corner in Central City. Two months ago on another street corner in the same area, six people were shot in what is believed to have been an act of gang violence. One of the victims, an innocent bystander who had gone out for a pack of cigarettes, was killed.\nA year ago this month, rival gang members fired wildly into a crowd in Bunny Friend Park in the Upper 9th Ward, wounding 17 people but killing none. Almost all of the victims were there to enjoy a DJ set, according to police.\nAnd a year before the earlier Bourbon Street shooting spree, two brothers unleashed a hail of gunfire into a crowd enjoying a second-line parade on Mother's Day in 2013. Nineteen people were shot, and one person was trampled in a stampede for cover.\nAsher, the former city crime analyst who tracks shootings in New Orleans, tweeted Sunday that 42 people had been shot in the city over the past 10 days.\nThe number of shooting incidents — single events in which one or more people are shot — stands at 427 for the year, Asher said, well above the tally for all of 2015.\n\"The recent rise in gun violence here is real and very terrifying,\" Asher wrote. \"The story today may be about gun violence on Bourbon Street, and that's a horrific tragedy, but the real problem here runs way deeper.\"\nBut the return of fatal gunfire to Bourbon Street, one of the nation's most famous party promenades, prompted a call for drastic action from Sidney Torres IV, the former French Quarter trash magnate who last year launched a private off-duty police security force in the neighborhood.\nTorres, a vocal critic of Landrieu's approach to public safety in the city's tourism heart, called for setting up nearly two dozen security checkpoints on streets leading into the Quarter for special events.\nThere, he said, private security officers would subject visitors to metal detectors and wands, checking for guns and running the information through a database of licensed guns and permitted owners.\n\"When you have national news out there that's showing one dead, somebody blazing guns in the middle of a crowded promenade, I think it's important for someone to call for action,\" Torres said in an interview Sunday.\nTorres said he recognized \"manpower is not the issue in this situation,\" focusing instead on the prevalence of illegal guns in similar shooting sprees.\n\"It's a very simple problem to fix, just like they have in the Superdome. Just like they do on Beale Street\" in Memphis,\" he said.\nMemphis officials began a program in June requiring visitors to pay admission to the Beale Street entertainment district after 10 p.m. on Saturday nights, with beefed-up security and ID checks.\nThat plan has met with resistance among Memphis business owners, but Torres urged a similar approach to protect New Orleans' worldwide tourism draw.\n\"This is not a Third World country. We're not in Iraq. This is Bourbon Street, the No. 1 generator for the city of New Orleans,\" Torres said.\nPolice announced Sunday that officers working a proactive patrol in the French Quarter had arrested 11 people, before and after the fatal shooting spree, related to illegal possession of firearms. None of them was a suspect in Sunday morning's carnage, NOPD spokesman Tyler Gamble said.\nBelow is a list of the victims' ages and injuries, per NOPD: Updated, 4:49 p.m., Nov. 28, 2016:\nMen\n• Demontris Toliver, 25, (Shot to chest and shoulder blade area. Died at hospital)\n• Age: 21, from Lafayette (Shot to hip)\n• 22, from New Orleans (Graze wound to buttocks)\n• 21, from Mississippi (Shot to outer ankle)*\n• 24, from Baton Rouge (Shot to chest area and hand)*\n• 22, from Eunice (Shot to knee)*\n• 22, from New Orleans (Shot to hand)\n• 37, from Zachary (Shot to back of knee)\n* = remains hospitalized\nWomen\n• 25, from Lafayette (Shot to thigh)\n• 20, from Scott (Shot to wrist, shoulder and chest area)\nStaff writers Matt Sledge and Bryn Stole contributed to this report."}