{"uri": "http://www.nola.com/crime/index.ssf/2014/09/5_shot_in_eastern_new_orleans.html", "title": "5 men shot on 'Million Dollar Corner' in eastern New Orleans", "dct": "Tue, 16 Sep 2014 18:04:13 GMT", "id": "d08886fbc35fe6c5677b4b9110fb4f03", "content": "Five men where shot Monday night (Sept. 15) at an eastern New Orleans intersection called \"Million Dollar Corner\" by locals for the prolific drug deals conducted in plain view.\nThe five men -- ages 20, 27, 35, 54 and 60 -- were shot a little before 8 p.m. near a gas station and convenience store at the intersection of Chef Menteur Highway and Dale Street, said NOPD spokesman Officer Frank Robertson.\nThe 27-year-old was struck multiple times, while the remaining men were each shot once, said Robertson, citing preliminary information. Two of the men were taken to an area hospital by ambulance while three arrived by private vehicle, Robertson said.\nTheir conditions were not immediately available, but all five remained hospitalized Monday night.\nInitial evidence suggested that one of the men may have been the target of the gunfire, Robertson said, adding that detectives do not believe the five men were together at the time of the shooting.\nNearly a dozen evidence markers could be seen on the street and sidewalk on Dale Street. It's an intersection that some locals said was plagued by drug trafficking and violence.\nLast month, two men ages 65 and 23 were shot multiple times near that intersection. The next block over on Chef Menteur, 43-year-old Clarence Wilson was shot in the head back in May following an argument near the intersection of Chef Menteur and America Street.\n\"I tell my kids not to walk by there,\" said nearby resident Nell Clark, who stood near the crime scene with her three children -- 14, 13 and 10. \"S--- always happens up there, and I don't want them getting shot. This is no place to raise kids.\"\nEvidence of past violence could be easily seen at the intersection. A silver traffic signal control box at the corner was covered in the words \"RIP Al,\" scrawled in black along with \"Goose Boy\" and \"East Beast ENT.\"\nSome at the scene said the shooting was likely the result of retaliation.\n\"The word went out: Anybody hang out around that tree going to get shot -- every time,\" said one man, who did not want to give his name.\nAnother resident predicted Monday's shooting would be met with even more violence.\n\"The gunman is still out there riding around,\" said Angela Hartford. \"There's going to be more shooting around here.\"\nNOLA.com | The Times-Picayune photographer David Grunfeld contributed to this report."}