{"uri": "http://abc27.com/2016/11/04/man-21-recovering-from-self-inflicted-gunshot/", "title": "Man, 21, recovering from self-inflicted gunshot", "dct": "Fri, 04 Nov 2016 11:33:00 GMT", "id": "9bd07548cd038162a919b9466c71710b", "content": "LANCASTER, Pa. (WHTM) – A 21-year-old man is recovering in the hospital after he suffered a self-inflicted gunshot wound in a Lancaster parking lot, police said.\nOfficers were dispatched Friday morning to Lancaster General Hospital for a report of a shooting victim that walked into the emergency room.\nEmergency dispatchers advised police that the shooting may have occurred at McCaskey High School. Once they were notified that everything was okay at the school, officers responded to the 600 block of N. Franklin Street.\nAfter review of surveillance footage of the area, investigators learned that the shooting victim was at a nearby parking lot when a handgun he was carrying accidentally discharged, striking his lower leg.\nThe victim’s injuries are not considered life-threatening. He is cooperating with police.\nAnyone with information is asked to call Lancaster City Police at 717-735-3300 or Lancaster City-County Crime Stoppers at 1-800-322-1913.\nThe victim is cooperating with police.\nGet breaking news, weather and traffic on the go. Download our News App and our Weather App for your phone and tablet.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}