{"uri": "http://www.reviewjournal.com/crime/homicides/separate-shootings-within-minutes-each-other-thursday-night-leave-2-dead", "title": "Separate shootings within minutes of each other Thursday night leave 2 dead", "dct": "Thu, 01 Sep 2016 20:29:00 GMT", "id": "24356a39c87b1b6dd8dd59c8690b5361", "content": "Las Vegas police investigated two separate, fatal shootings Thursday night that happened about 8 miles from each other and just minutes apart.\nThe first shooting happened just before 8 p.m. at 497 North Circle, near Twain Avenue and Paradise Road, Metropolitan Police Department Lt. Corey Moon said.\nThe second shooting happened about 8 p.m. at Palacio Park, 947 W. Lake Mead Blvd., near Martin Luther King Boulevard, Moon said.\nBy about 10 p.m., both shootings were being investigated as homicides.\nThe North Circle shooting happened in an alleyway, though as of Thursday night, no information on circumstances were available. A suspect was not in custody.\nThe second shooting happened near the park’s basketball courts, just east of the West Las Vegas Library. At least one person was shot in the chest, and that person was taken to University Medical Center’s trauma unit, where he later died.\nPolice said he was a young black male but could not confirm his age.\nAfter the second shooting, officers worked to clear the park of bystanders. Witnesses were separated and interviewed by the basketball bleachers as detective marked spots in the parking lot where shell casings were found.\nAs of Thursday night, police did not know what may have led to the shooting; detectives were still interviewing witnesses. It was also unclear whether anyone had been detained or arrested in connection.\nAbout 10:45 p.m. at the park, three women walked up to the police tape near the basketball courts, pleading to be let in. They knew the person shot and their relative was at the park when it happened, they told police.\nAs officers worked to get them united with their relative, who was talking to officers, one woman in the group got a call, then answered her phone.\nSeconds later, she said, “He’s dead.”\nOne of the women with her immediately broke down. Another puffed her cigarette, her hand shaking. The woman who answered the call cried out, “That boy stayed at my house! That boy stayed at my house!”\nAn officer on scene nodded his head, lifted the police tape and let them in.\nThe coroner’s office will name both people killed once their families have been notified.\nContact Rachel Crosby at rcrosby@reviewjournal.com or 702-387-5290. Find @rachelacrosby on Twitter."}