{"uri": "http://www.rrstar.com/news/20161228/mom-says-ex-boyfriend-killed-her-16-year-old-daughter-shot-her-mother-in-face-in-machesney-park", "title": "Mom says ex-boyfriend killed her 16-year-old daughter, shot her mother in face in Machesney Park", "dct": "NODATE", "id": "78236d9f4a2e2bfcfe9e507df5b75822", "content": "MACHESNEY PARK - Rebecca Finkenhofer died while trying to protect her 6-year-old sister and her grandmother from an intruder who had broken down the door to their apartment, her mother told the Register Star.\nFinkenhofer, 16, was fatally shot early today at an apartment in the 1000 block of Minns Drive. Her grandmother also was shot. The suspect, Michael Mernack, 36, was a former boyfriend of Finkenhofer's mother, Megan Cabay.\nCabay said her daughter initially \"got him out of the house\" and they were fighting near the mailboxes. Mernack then shot Finkenhofer in a walkway to their apartment. She was dead when emergency personnel arrived. Cabay said she was unsure where on her body her daughter was shot.\n\"She was defending Mom and (her 6-year-old sister),\" Cabay said. The 6-year-old was \"hiding in her room under the blankets.\"\nMernack pointed a gun at two Winnebago County Sheriff's Department deputies and was shot shortly after the 12:08 a.m. call to police, according to authorities. He was in intensive care at a local hospital with life-threatening injuries and is being guarded by sheriff's deputies.\nA warrant has been issued for Mernack for aggravated assault, and his bond has been set at $200,000. Any further charges are pending the conclusion of the investigation and review by the state's attorney.\nCabay, 33, a certified nursing assistant, told the Register Star she was at work at a local hospital when Mernack, who is under a court order of protection to stay away from Cabay, broke down the door into her apartment.\nCabay's mother, Cheryl Puckett, 63, was shot in the face while she was watching TV in the living room. Puckett was in critical condition in a Madison, Wisconsin, hospital. She lives with Cabay and cares for Cabay's children while Cabay works. Cabay said she has been unable to speak with her mother, who is breathing with help of a ventilator.\nFinkenhofer, a sophomore at Harlem High School, where her mother said she earns top-notch grades, was in her bedroom and heard the noise, Cabay said police told her.\nFinkenhofer liked to listen to music and dance, and she and her mother would choreograph dances. She also would play video games with three of her brothers. She was an active big sister, her mother said. She'd do her sister's hair, make-up and play dress-up with her.\n\"Momma loves you so much you are such an angel,\" Cabay wrote on her Facebook page informing friends about her daughter's death.\nHer death is the first homicide in Machesney Park since 2008, according to sheriff's Sgt. Doug Bushman.\nThe teen's father, Timothy Finkenhofer, did not live with his daughter but had sought an order of protection against Mernack. Timothy Finkenhofer said in a text message that his daughter liked to color and get her hands dirty working on cars. She also had a \"great love for Jesus,\" he said.\nNeither the coroner's office nor sheriff's police have identified Finkenhofer as the fatal shooting victim.\nThe Winnebago-Boone County Integrity Task Force has been called in to investigate the shooting of the suspect, and both deputies involved are on paid administrative leave. Sheriff Gary Caruana would not identify the deputies.\nCierra White, who works with youth and communications at Rockford First Church, said Rebecca Finkenhofer initially was an \"observer\" at the Bible study classes White led. But after a bit, \"when you listen to her, she was quirky and funny.\"\nWhite said she'd given Finkenhofer a ride to one of the group's meetings and Finkenhofer told White about a \"violent\" man in her mother's life who was no longer in the picture. \"She was handling it in a way that I would not expect a sophomore to handle it,\" White said.\nCabay said she met Mernack a few months ago through friends. \"I don't know why he would kill my baby,\" she said. \"I am thinking to get back at me.\"\nOn his Facebook page, Mernack posted less than an hour before the shooting that \"I'm f----- up so if your on the sh-- list watch out.\"\nStaff writer Kevin Haas contributed to this report.\nGeorgette Braun: 815-987-1331; gbraun@rrstar.com; @GeorgetteBraun"}