{"uri": "http://www.waaytv.com/appnews/update--year-old-identified-in-colbert-county-accidental-shooting/article_5b706fda-4a12-11e6-a750-d386f38f207c.html", "title": "UPDATE: 2-year-old identified in Colbert County accidental shooting", "dct": "Fri, 15 Jul 2016 00:00:00 GMT", "id": "21f12cf5394d1e58d9b0918ae72b2086", "content": "A 2-year-old who died in an accidental shooting Thursday afternoon has been identified.\nThe Colbert County Sheriff says the accidental shooting happened at a home on Highway 157 in Leighton around 5 p.m.\nThe child was taken to Helen Keller Hospital where he later passed away.\nFrank Williamson, the Colbert County Sheriff, said this is a tragedy. Williamson says they are not releasing any information about the death investigation at this time.\nThe Colbert County Coroner took himself off the case because he knows the family.\nThe Franklin County Coroner took over the case and said the child's body was sent to Huntsville for an autopsy.\nColbert County Association of Volunteer Fire Departments President, Chief Kelly Aday, said the child's name is Robert Michael Reaves.\nThe boy's father is the Spring Valley Volunteer Fire Department Chief, according to Aday.\nAday says the family is devastated at the loss of their child.\nAday says the volunteer fire departments are giving their love and support to the Reaves family during this time.\nAday says he has known the Reaves family for at least seven years and has worked with the child's father, Keith Reaves.\nAday says Robert was always at the Spring Valley Volunteer Fire Department and loved the fire trucks.\n\"To this little boy Keith was his hero and he wanted to be just like his daddy,\" said Aday.\nFire departments across the Shoals mourning with the family.\n\"The community is kinda numb, the fire department is numb, surrounding fire departments are numb. The responders who went to the call are having a tough time,\" said Aday.\nAday says these departments are like family to each other, and when the call came over the scanners it was devastating.\n\"It was an emotional call. It hit home,\" said Aday.\nA white ribbon was hanging at the Spring Valley Volunteer Fire Department Friday in memory of Robert.\nAday says the Reaves family needs the community to lift them up.\n\"Mainly they just need your love and prayers,\" said Aday. \"It truly means the world to the family.\"\nFriends of the Reaves family have set up an account to help with funeral expenses."}