{"uri": "http://www.news-press.com/story/news/2015/10/29/2-year-old-accidentally-shot-survive/74806012/", "title": "Dad leaves gun on couch, 2-year-old son shoots thumb", "dct": "Thu, 29 Oct 2015 00:00:00 GMT", "id": "bbd747689209c74716fe8aea1338c957", "content": "Police arrested a 22-year-old father who left a gun on a couch that his 2-year-old son used to shoot himself.\nMichael Rashunn Hill Jr. was arrested about 2:45 p.m. Thursday on charges of culpable negligence and allowing a minor access to a weapon resulting in injury, according to the Fort Myers Police Department. Police said Hill left the gun on the couch where he sleeps and went to work. The child shot himself in the thumb.\nPolice said that the mother was inside the apartment at the time of the accident. The apartment is part of the Cypress Court Apartments, in the 3600 block of Seminole Avenue, which was the scene of a fatal shooting less than a day earlier that left 22-year-old Tresjuan Irvin dead.\nThe 2-year-old boy was taken to Gulf Coast Medical Center on Thursday morning, and the hospital called FMPD about 9:40 a.m. to report a boy with a gunshot wound.\nThe Department of Children and Families is also looking into the shooting.\n\"We have opened a child protection investigation and the two children in the home have been placed in the care of family members,\" said Natalie Harrell, a DCF spokeswoman.\nA window cling on the glass slider at the apartment warns people on the outside: “Caution baby inside.”\nNeighbors were surprised to hear the toddler shot himself. They called Hill a good father, but said its a result of him getting mixed up with the wrong people.\nMeanwhile, the Lee County Sheriff's Office continues to investigate a shooting involving a 2-year-old girl on Oct. 20 at 554 Alabama Road in Lehigh Acres.\nArmiya Robinson, who accidentally shot herself, was transported to Tampa Regional Hospital, where she remains in critical condition, according to the sheriff’s office.\nOn the Facebook page of her mother, Resha Robinson, said her daughter is doing fine.\nNo one has been arrested in Robinson's case."}