{"uri": "http://www.indystar.com/story/news/2015/02/10/paoli-man-shoots-2-children-injures-wife-kills-self/23206389/?utm_campaign=%5B%27FeedBlitzRss%27%5D&utm_content=%5B%27Paoli+dad+kills+daughter%2C+3%2C+self%3B+wounds+others%27%5D&utm_source=%5B%27feedblitz%27%", "title": "Second child dies after Paoli shooting", "dct": "Tue, 10 Feb 2015 00:00:00 GMT", "id": "7085bcee5863450bf768d31b7774b5d8", "content": "Feb. 12 update: Second child dies after Paoli shooting\nA 6-year-old southern Indiana boy has died two days after a shooting that also killed his younger sister, state police say.\nSgt. Phillip Hensley said Leon Gehl died at Kosair Children's Hospital in Louisville, Kentucky, on Thursday.\nPolice said Leon and his 3-year-old sister, Addison, were shot by their father, 37-year-old Jeremy Gehl, during a domestic disturbance at their Paoli home on Tuesday. Police reports show Jeremy Gehl attacked estranged wife Melissa Randolph with a knife during an altercation and shot the children when they entered the room. He then took his own life.\nRandolph's wounds weren't life-threatening. A third child in the home wasn't harmed.\nThe Times-Mail in Bedford reported Thursday that Gehl was living with the family in violation of a protective order that was filed in 2013. It was set to expire next week.\nThe protective order, filed in Orange Superior Court, prohibited Gehl from having direct or indirect contact with Randolph except as it related to their children. It also ordered Gehl to stay away from Randolph's residence and place of employment\nFeb. 11, 2015, story:\nPaoli dad kills daughter, 3, self; wounds others\nPAOLI, Ind. — State Police have released the names of two southern Indiana children they say were shot by their father, one of them fatally, after he stabbed his estranged wife.\nPolice say 3-year-old Addison Gehl and her 6-year-old brother, Leon Gehl, were shot inside their home in Paoli Tuesday evening.\nAddison Gehl was pronounced dead at a Louisville, Kentucky, hospital, where her brother was listed Wednesday in critical condition.\nSgt. Phillip Hensley says 37-year-old Jeremy Gehl stabbed his 33-year-old wife, Melissa Randolph, inflicting non-life-threatening injuries.\nHensley says Gehl shot the two children when they came downstairs after hearing their parents fighting. Gehl then took his own life.\nHensley says the couple was estranged but still living in the same house.\nA toddler in the home was unharmed during the attacks."}