{"uri": "http://www.philly.com/philly/news/20160701_Police_still_seeking_mom_s_boyfriend_in_4-year-old_s_death.html", "title": "Mom's boyfriend in 4-year-old's death surrenders", "dct": "Thu, 30 Jun 2016 00:00:00 GMT", "id": "0767388bea6ee5b66f010df2b72fdb3b", "content": "Close icon\nShopping Cart icon\nA man sought by police surrendered Thursday night in connection with the 4-year-old girl who fatally shot herself in a North Philadelphia home June 23.\nDemetrius Williams, 26, is the boyfriend of Shakeya Holmes, whose daughter Sani Holmes shot herself above the one eye with a .40-caliber semiautomatic gun in a bedroom of their home on 20th Street near Berks.\nThe girl was pronounced dead at Hahnemann University Hospital shortly afterward.\nInside the home at the time were the girl's mother and her 3-year-old sister.\nWilliams was wanted because he allegedly had the gun in his possession at some point and because he allegedly had placed it in a closet in the bedroom before the shooting, police said. Sources have said the closet had no door and had a cubby on which children could climb to reach a shelf.\nWilliams is not Sani's father, but is the father of her 3-year-old sister, police said.\nWilliams stayed at the home, but lists his residence as being on the 2000 block of North 7th Street, in North Philadelphia, police said.\nPolice on Thursday also said the gun's ownership has been traced, but they were not identifying the owner because that is part of the ongoing investigation. They said the gun was not reported stolen.\nMeanwhile, friends and family plan to mourn Sani's death at a community vigil Friday and at her funeral service Saturday.\nRomaine Gibbs, owner of the R.S. Gibbs Life Celebrations Funeral Home in North Philadelphia, said a community prayer vigil will take place from 6 p.m. to 8 p.m. Friday on the block where Sani lived.\n\"In our eyes, she is a little princess,\" said Gibbs, who said he knows the Holmes family and is arranging her funeral service.\nOn Saturday, a public viewing will be held from 9 to 11 a.m. at the United Missionary Baptist Church, at 2500 W. Thompson Street in North Philadelphia, followed by a life tribute from 11 a.m. to 1 p.m. at the church.\nThe little girl will be buried about 1:30 p.m. Saturday at the White Chapel Memorial Park, 140 W. Street Road, in Feasterville, Bucks County.\nThe girl's mother is still in custody and will not be at the vigil and funeral service.\nHolmes, 25, was charged last Friday with third-degree murder, involuntary manslaughter, concealing evidence, possession of an instrument of crime, and related offenses in her daughter's death.\nSources have said Holmes was charged with third-degree murder because she didn't immediately call for help and was instead attempting to conceal the circumstances of the shooting, and because there was a gun in the house in an unsafe place that was accessible to children.\nShe faces a July 13 preliminary hearing.\n215-854-2592\n@julieshawphilly\nStaff writer Robert Moran contributed to this article."}