{"uri": "http://www.news10.net/story/news/crime/2014/02/20/indian-rancheria-mass-shooting/5660823/", "title": "4 dead, 2 injured in a shooting at Northern Calif. tribal meeting", "dct": "Fri, 21 Feb 2014 00:00:00 GMT", "id": "0e3f077d34a05502dbc45a8260d9ad19", "content": "CORRECTION Feb. 20: The four people who were killed in this incident are believed to be part of the Cedarville Rancheria tribe. A sentence in an earlier version of this story misidentified a victim's affiliation.\nFour people are dead and two are injured in a shooting during a tribal hearing in Alturas, Calif., just south of the Oregon border, on Thursday afternoon.\nAlturas Police Chief Ken Barnes said that 44-year-old Sherie Lash, a.k.a. Sherie Rhoades, is in custody at Modoc County Jail after allegedly opening fire around 3:30 p.m. at the Cedarville Rancheria Tribal Office and Community Center.\nAlturas police said Lash shot and killed four people believed to be with the Cedarville Rancheria tribe. Another person was shot and wounded while running out of the building. When she ran out of ammunition, Lash grabbed a butcher knife and stabbed a sixth person, KRCR-TV reported.\nPolice said the shooting victims include a 19-year-old woman, a 30-year-old man, a 45-year-old woman and a 50-year-old man. Barnes said one of the victims is the tribe's leader.\nWhen police arrived at the scene, Lash was running from the building with a knife in her hands and was quickly subdued.\n\"Everybody's been really good,\" Barnes said. \"We had huge cooperation from the sheriff's department and the Highway Patrol and everybody's working together\"\nThe two wounded people were air lifted to outside hospitals in critical condition. No other information was released about the people who were injured in the incident.\nAccording to Barnes, members were holding a meeting on evicting Lash and her son from the Rancheria, which, according to its website, is a federally recognized tribe with 35 members.\n\"We're trying to get this thing resolved as quick as possible,\" Barnes said. \"So it's, it's a huge impact on our community.\"\nAutopsies on the victims will be conducted on Friday."}