{"uri": "http://thesouthern.com/news/local/communities/carbondale/two-cape-girardeau-men-wanted-in-connection-to-sunday-shooting/article_4f795515-d1e4-57eb-a9d5-17e6cd35b5d4.html", "title": "Two Cape Girardeau men wanted in connection to Sunday shooting in Carbondale", "dct": "Wed, 30 Mar 2016 00:00:00 GMT", "id": "0b120e9b3a0d80e7db60c4c039d55ef2", "content": "CARBONDALE — The Jackson County state’s attorney issued warrants for the arrests of two men suspected to be involved in the Sunday morning shooting in Carbondale.\nAccording to Jackson County State’s Attorney Michael Carr, the warrants charge both Travis Tyler, 21, of Cape Girardeau, and John F. Ingram, 21, also of Cape Girardeau, with aggravated battery with a firearm, a Class X felony. The warrant states that both men acted together in committing a battery by knowingly discharging their firearms Sunday, which caused injury to a male named Nehemiah Greenlee.\nA second charge in the warrant for both men is aggravated discharge of a firearm, a Class 1 felony. The warrant says each defendant knowingly discharged a firearm in the direction of another person — Greenlee.\nThe Class X felony carries a minimum sentence of six years, but a maximum of 30 years. The Class 1 felony carries a potential 4- to 15-year sentence. The Class X felony is not eligible for probation.\nCarr says the investigation into the incident and the death of Carbondale musician Timothy Beaty is ongoing and is being pursued by the Carbondale Police and the Illinois State Police Crime Lab. Carr said additional charges will be considered based on the ongoing investigation.\nThe police are asking anyone with any information regarding the incident or the whereabouts of Tyler or Ingram to contact the police at 618-457-3200.\nOn Monday, Dwayne Dunn, 21, of St. Louis was charged with aggravated discharge of a firearm and is incarcerated in the Jackson County jail on a $500,000 bond.\nDunn is scheduled for a preliminary hearing at 1 p.m. on April 21 in Jackson County court.\nPolice said they responded to 402 W. Walnut St. at about 2 a.m. Sunday after a report of shots fired. Officers arrived on the scene of a large party with multiple people leaving the scene. Police said shots had been fired inside the house after a physical altercation; the altercation then moved outside where more shots were fired.\nThe property at 402 W. Walnut St. is listed as being owned by “Trust 75-25,” according to Jackson County Property Tax records. Trust 75-25 has an address of 503 S. University Ave., which property records say is owned by P.K. Land TR Agreement with an address of 206 W. College Suite 11."}