{"uri": "http://www.cleveland.com/metro/index.ssf/2016/11/cleveland_home_invasion_suspec_1.html", "title": "Cleveland home invasion suspect charged with murder after homeowner fatally shoots teen accomplice", "dct": "Tue, 29 Nov 2016 13:53:00 GMT", "id": "6014587781ce156f8ace728e802b93d1", "content": "CLEVELAND, Ohio -- A 19-year-old man is charged in a home invasion where his 16-year-old suspected accomplice was shot and killed by the homeowner.\nAntwaun Williams Jr. of Cleveland is charged with murder. He was booked Sunday night in the city jail and is awaiting a court date on the charge.\nThe incident happened about 8:30 p.m. Sunday at a home in the 2200 block of East 38th Street in the city's Central neighborhood.\nWilliams and Matthew Kimmie kicked in the backdoor to a 68-year-old man's home, police said. The homeowner told police he heard two loud noises that sounded like someone forced their way into his house.\nHe went downstairs with a handgun and saw the duo standing in his kitchen-dining room, according to police and court records.\nThe two charged at him and the man screamed, fired two gunshots and ran upstairs, where he called 911, according to police reports.\nOfficers found Kimmie dead with a gunshot wound to his head in the backyard of the home, near the steps leading to the backdoor, according to police reports. He was pronounced dead at the scene about 9 p.m.\nWilliams was shot in the face and ran from the home with a third person, who police have not yet identified, court records say.\nAn ambulance later picked Williams up and took him to MetroHealth Medical Center, where he was treated and released. He was arrested by police at the hospital, police reports say.\nWilliams can be charged under Ohio law with murder if prosecutors determine Kimmie's death was caused as a proximate result of Williams committing a felony, in this case a burglary.\nThe 68-year-old man was not injured during the incident, according to police. Police said his home had been burglarized several times before.\nNo charges have been filed against the homeowner but police are still investigating the incident.\nTo comment on this story, please visit our crime and courts comments section."}