{"uri": "http://www.nola.com/crime/index.ssf/2016/08/in_laplace_teens_killing_1_sus.html#incart_2box_nola_river_orleans_news", "title": "In LaPlace teen's killing, 1 suspect arrested, 1 at large", "dct": "Mon, 08 Aug 2016 14:13:00 GMT", "id": "0a8524b917384b8e96e954c02c11bf14", "content": "Authorities have arrested one suspect and were seeking another Monday (Aug. 8) in the killing of 16-year-old Tory Horton, who was fatally shot outside a LaPlace convenience store. The fugitive was identified as Frederick Seymore Jr., 22, of LaPlace.\nSeymore and his alleged accomplice, Bruce Butler Jr., 22, of LaPlace, fled the crime scene in a 2013 red Toyota Corolla bearing Louisiana license ZNY406, the St. John the Baptist Parish Sheriff's Office said. The car had a damaged mirror on the passenger's side and a bullet hole, from a prior shooting, in the right rear fender, the Sheriff's Office said.\nTory Horton, 16, would have begun 10th grade on Monday, was on cross country team\nHorton, a rising sophomore and aspiring cross-country runner at East St. John High in Reserve, was waiting for his back-to-school haircut Friday afternoon when he decided to buy some candy at LaPlace Discount, 820 W. Airline Highway, his mother said. He was fatally shot after leaving the store.\nHis mother, Trameka Brown, said a vigil for her son was planned Monday at 7 p.m. It was set at 944 Cambridge Drive in LaPlace, about two blocks from the crime scene.\nDeputies said they arrested Butler on Friday and booked him with being a principal to second-degree murder, a charge that suggests they do not consider him the gunman. He was being held Monday under $750,000 bond.\nSeymore remained at large. He is accused of second-degree murder.\nThe Sheriff's Office did not provide any evidence linking either suspect to the crime.\nAnyone knowing the whereabouts of Seymore or the car is encouraged by authorities to call the Sheriff's Office at 985.359.8477 or Crimestoppers Inc. at 504.822-1111. Crimestoppers callers need not testify in court to qualify for a cash reward. Online tips may be submitted on the Sheriff's Office website."}