{"uri": "http://www.waow.com/story/33713291/2016/11/15/4-year-old-boy-shot-in-the-head-in-antigo", "title": "UPDATE: 4-year-old Antigo boy in stable condition after gunshot to head", "dct": "Tue, 15 Nov 2016 14:56:00 GMT", "id": "b2e8ffb5134c6a4b6501d83320092759", "content": "ANTIGO, Wis. (WAOW) -\nUPDATE: A 4-year-old boy is in stable condition after shooting himself with a handgun, according to a statement on a Go Fund Me page.\nA statement released on a Go Fund Me page said Micah Zahringer found a gun and shot himself on November 10.\nThe statement said he suffered major head trauma and was taken to the hospital. A release from Antigo Police Chief Eric Roller said Zahringer was airlifted to a hospital in Marshfield and is in the Intensive Care Unit.\nThe full family statement from Go Fund Me is below:\nOn Thursday November 10th, despite his parents' best intentions, 4-year-old Micah Zahringer found a firearm, presumed to be unloaded and shot himself in their home. He suffered major head trauma and was taken by ambulance to Aspirus Langlade Hospital. From there he was air lifted to St. Joseph's Children's Hospital in Marshfield and was immediately taken into surgery. The doctors told the family that he may not make it through the surgery but by God's grace he did. After surgery they were told he had lost a lot of blood and has extensive damage to the right side of his brain, and he would likely need at least 2 more surgeries.\nHe is in the Pediatric ICU and is sedated to keep him from moving, so as not to further his injuries. Micah's vitals have been recently steady, which is really good news. The doctor is planning to do a CT scan, but is waiting to let Micah rest unless they see something that they cannot explain.\nAntigo Police said crews were called to the scene on November 10 at 6:20 p.m.\nAuthorities said they are treating the incident as an accidental shooting.\nDonations for the family can be made on a Go Fund Me page here.\n-----------------------------------------------------------------\nA 4-year-old is in the hospital after receiving a gunshot wound to the head from a handgun, according to the Antigo Police Department.\nChief Eric Roller said crews were called to the scene on November 10 at 6:20 p.m.\nThe 4-year-old boy was airlifted to a hospital in Marshfield and is in the Intensive Care Unit.\nAuthorities said they are treating the incident as an accidental shooting.\nNo other details have been released. Stay with Newsline 9 for updates."}