{"uri": "http://wjbf.com/2016/11/18/breaking-two-shot-two-arrested-in-early-morning-shooting/", "title": "Suspects named in Aiken County shooting, home invasion", "dct": "Fri, 18 Nov 2016 04:29:00 GMT", "id": "9f4bc6bcf852622208531ac4b070b5b9", "content": "CLEARWATER, S.C. (WJBF) – Two suspects in custody have been named in connection with a Friday morning shooting in Aiken County.\n17-year-old Undraize Antonio Dixon and 17-year-old Deonte Raequan Schultz are named as suspects in the case.\nInvestigators are obtaining warrants for three counts Attempted Murder, one count Armed Robbery and one count Burglary 1st Degree for both suspects.\nA third suspect has not been detained and is described as an unknown black male 5’08’ in height 120 pounds with black hair wearing a black hoodie black pants and dark shoes.\nIf you have any information, you’re asked to call the Aiken County Sheriffs Office at 803-648-6811 or Crimestoppers at 888-CRIME-SC (888-274-6372).\nThe investigation is still ongoing and information will be released as it becomes available.\nCLEARWATER, S.C. (WJBF) – Aiken County investigators are searching for a suspect after an early morning home invasion that led to a shooting.\nIt happened around 1:30 am on Friday at the Villa K Townhouses on Fairview Road in Clearwater.\nTwo people were injured and taken to the hospital. One of them is listed in ‘extreme’ critical condition.\nAfter the shooting, three suspects led police on a chase to Blackstone Camp Road. Two have been arrested but the third is still wanted and considered armed and dangerous.\nThe names of the victims and suspects have not yet been released.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}