{"uri": "http://www.live5news.com/story/33743494/breaking-news-overnight-police-manhunt-for-gunman-suspect-armed-and-dangerous", "title": "UPDATE: Victim who suffered gunshot wound in Clearwater home invasion has died", "dct": "Fri, 18 Nov 2016 12:44:00 GMT", "id": "f4d002c791929b56ca38dc3bca60a0a4", "content": "AIKEN COUNTY, SC (WFXG) -\nUPDATE: According to the Aiken County Coroner, the victim who suffered the gunshot wound in the early home invasion in Clearwater on November 18 has died.\n15 year-old Jordan Shores of North Augusta was pronounced dead at 9:15 am at Augusta University on November 19. The Coroner says Shores suffered a non survivable gunshot wound. The autopsy is scheduled in Newberry, South Carolina.\nCopyright 2016 WFXG. All rights reserved.\nThe Aiken County Sheriff's Office has identified the suspects in last night's home invasion and shooting.\nAfter further investigation, authorities have confirmed more details to the shooting incident. When deputies arrived on the scene of the shooting, the 1st victim was immediately found lying on the living room floor suffering from a gunshot wound. The 2nd victim, who suffered injuries from a physical assault told deputies that he was playing video games when the 3 suspects entered into the home wearing masks and armed with handguns. According to the 2nd victim, one suspect began firing several shots while another pistol-whipped him in the face. The suspects quickly searched the home, took a playstation and fled while continuing to fire their weapons. A 3rd victim was asleep upstairs when she awoke to the noises of a firearm. She was not injured in the robbery.\nAuthorities have identified 17-year-old Undraize Antonio Dixon of Beech Island and 17-year-old Deonte Raequan Schultz also of Beech Island. Warrants are currently being obtained for 3 counts of attempted murder, 1 count of armed robbery and 1 count burglary...1st degree for each subject. The 3rd suspect has still not been captured. He remains to be described as ARMED AND DANGEROUS. If anyone has any information on the whereabouts or identity of this suspect, please call Aiken County Sheriffs Office or contact Crimestoppers of the Midlands. This investigation is on-going.\nThe Aiken County Sheriff's Office is looking for a suspect involved in an overnight shooting.\nA Uniform Patrol Sgt who was in the shopping center located at 4435 Jefferson Davis Hwy heard a gunshot around 1:28 a.m. When he went to investigate, he saw a red sedan speeding away. When the Sgt attempted to stop the sedan, it fled. Shortly after this, deputies received a call to report to 1034 Fairview Rd. in reference to a shooting incident. When deputies arrived, they discovered one victim with a gunshot injury and a 2nd victim with injuries from a physical assault. Upon initial investigation, deputies received a description of the suspect's vehicle which matched the description of the red sedan that fled from the Sgt in the earlier incident.\nAiken County EMS arrived on the scene to transport both victims to the hospital. The gunshot victim was said to be in critical condition at the time of transport. Deputies pursued the suspect's vehicle in the area of Blackstone Camp Rd. near Storm Branch Rd. Two suspects fled the vehicle on foot and a 3rd suspect was arrested as he exited the car.\nAt this point, only one of the two fleeing suspects have been captured. The other is still on the run. He is described as a thin black male, \"5’8\" in height, 120 pounds with black hair. He was said to be wearing a black hoodie, black pants and dark shoes. The Aiken Bloodhound Tracking Team is searching for this suspect. He is considered ARMED AND DANGEROUS. This is an on-going investigation. If you have any information, you are asked to immediately contact the Aiken County Sheriff's Office.\nCopyright 2016 WFXG. All rights reserved."}