{"uri": "http://www.wral.com/sheriff-11-year-old-injured-in-wake-county-shooting/15366510/", "title": "Sheriff: 11-year-old injured in Wake County shooting", "dct": "Sun, 14 Feb 2016 00:00:00 GMT", "id": "a23849871e8ec1144e77b30f339746f8", "content": "Video Playback Not Supported\nPlay Video\nPlay\nMute\nCurrent Time 0:00\n/\nDuration Time 0:00\nLoaded: 0%\nProgress: 0%\nStream TypeLIVE\nRemaining Time -0:00\nPlayback Rate\n1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptions\nFullscreen\nAutoplay:\nOn / Off\nThis is a modal window.\nThis video is not supported on your platform. Please make sure flash is installed.\nCaptions Settings Dialog\nBeginning of dialog window. Escape will cancel and close the window.\nText Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps\nDefaults Done\nSheriff: 11-year-old injured in Wake County shooting\nAre you still watching?\nYes, ContinueNo\nKnightdale, N.C. — An 11-year-old girl was injured in a shooting Sunday afternoon on Colchester Drive in Knightdale, according to Sheriff Donnie Harrison.\nAccording to authorities, the girl was shot at about 1:30 p.m. and was taken to WakeMed, where she was taken into surgery Sunday afternoon.\nThe extent of her injuries was not immediately available.\nHarrison said that the girl did not live at the home where the shooting occurred, but was there visiting family. The incident was under investigation but Harrison said it did not appear as though any laws were violated in the shooting."}