{"uri": "http://www.wsbtv.com/news/local/henry-county/4th-victim-of-henry-county-shooting-dies-after-several-days-in-hospital/462180716", "title": "4th victim of Henry County shooting dies after several days in hospital", "dct": "Mon, 31 Oct 2016 14:21:00 GMT", "id": "b2869d6018011e27a259db08db27db56", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nHENRY COUNTY, Ga. - A woman shot at a Henry County home last week died Sunday afternoon at Grady Memorial Hospital.\nDestiny Olinger had been in critical condition since the shooting at the home on Moccasin Gap Road early Thursday.\nPolice say a home invasion call came in around 2 a.m. When officers responded to the house, they found three people shot to death in the living and kitchen areas. Olinger was airlifted to the hospital.\nLater that night, five people were arrested in connection with the shooting.\nTRENDING STORIES:\nOfficers said the victims all knew each other, although they have yet to detail the connections between them and the suspected killers.\nMatthew Baker Jr., 19, and Jacob Kosky, 22, are each charged with three counts of murder.\nBaker was arrested during a felony traffic stop at his home, and Kosky was arrested after he called 911 to turn himself in, police said.\nThree others, Jacob Williams 18, of McDonough, Kayla Head 21, of McDonough, and Brooke Knight, 19, of Locust Grove, were also arrested and charged with obstruction of a police investigation in the case.\nThe Henry County coroner identified the other three victims as Matthew Hicks, 18, of McDonough, Keith Gibson, 29, of Covington, and Sophia Bullard, 20, of Thomason.\nOne man said he escaped the house unharmed after hiding under a bed when the gunman starting shooting at around 1:30 a.m.\n“Everything flashed in front of me. I thought about everything,\" the man told Channel 2’s Matt Johnson, asking not to be identified.\nThat man said Kosky was at a bonfire at the house earlier and he left and came back with a gun.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\n© 2017 Cox Media Group."}