{"uri": "http://www.wtoc.com/story/33493920/multiple-people-shot-inside-henry-county-home", "title": "Fourth person dies after Henry County shooting; charges pending", "dct": "Mon, 28 Nov 2016 16:12:00 GMT", "id": "e0a70c147e4d5a5cb59ed5b1b9c3bdbd", "content": "HENRY COUNTY, GA (CBS46) -\nCharges are pending after a fourth person has died resulting from a a Henry County shooting.\nThe fourth victim has been identified as Destiny Olinger, according to the Henry County Coroner's Office.\nShots rang out just past 2 a.m. on Oct. 27 inside a home on Moccasin Gap Road. Investigators believe there was a bonfire celebration at the home late Wednesday. Police believe the shooter returned early the next morning and shot four people inside the home.\nIt is believed the shooter knew all the victims. The other three victims were identified as 18-year-old Matthew Hicks of McDonough, 29-year-old Keith Gibson of Covington and 20-year-old Sophia Bullard of Thomason.\n\"It was devastating,\" Josh Milam said. \"It was like, 'Wow!' It's a good neighborhood. It's not really a neighborhood, it's just a street. Everybody's got five acres or better.\"\nA woman who survived the attack called 911. It was initially reported as a home invasion.\nSuspects, like victims, in late teens, early 20s\nFive people were arrested in connection to the shooting.\nPolice say 19-year-old Mathew Baker and 22-year-old Jacob Kosky were arrested and charged with three counts of murder, along with other felonies already. A fourth charge could come after Olinger's death.\nAdditionally, 18-year-old Jacob Williams, 21-year-old Kayla Head and 19-year-old Brooke Knight were also arrested and charged with obstruction of a police investigation.\nWilliams and Head posted bond Thursday night and were released.\nKosky, Baker and Knight all appeared in a Henry County courtroom Friday for their first appearance. Kosky appeared emotionless as he walked into the courtroom. Baker broke down in tears when his family came into the courtroom.\nCopyright 2016 WGCL-TV (Meredith Corporation). All rights reserved."}