{"uri": "http://www.wbaltv.com/news/5-reported-shot-in-west-baltimore/35686678", "title": "5 shot in west Baltimore", "dct": "Wed, 07 Oct 2015 11:46:00 GMT", "id": "f91c23861162fe017436ef5c2ccc04fa", "content": "BALTIMORE —\nCity police are searching for a lone gunman in a quintuple shooting in west Baltimore.\nPolice said the shooting was reported around 3:40 p.m. in the 300 block of North Payson Street at West Saratoga Street.\nPolice said the victims' injuries appear to be non-life-threatening. Some of the victims were taken to Shock Trauma.\nPolice said the ages of the victims are 17, 23, 24, 26, and 55. All are males and all were shot in the lower extremities.\nOne of the victims was treated at the scene. Three others were taken to hospitals for treatment. A fifth victim was found at an area hospital.\nInvestigators said they are searching for a lone gunman.\n\"It appears a lone gunman came around the corner and fired a number of shots at the individuals and then took off on foot,\" Baltimore police Director T.J. Smith said.\n\"We don't have much of a description of that person, so we're again asking for the community's assistance. This was 3:45 in the afternoon in broad daylight and there were a number of people out in the community right now and we need to know who this person is.\"\nTuesday's incident marks the third city shooting in five days where there were multiple targets.\nFive people were shot, one of whom died, Friday in a shooting at a shopping center on Reisterstown Road. On Sunday, a 9-year-old girl was shot on Old York Road in an incident where, police said four other people were the intended targets.\nViolent crimes like these inspired this summer's BFED partnership where 10 federal agents became embedded in the city's homicide unit.\nIt was touted as a new national model for urban crime-fighting. Police initially said it would last 60 days. Now it appears those agents are here to stay\n\"It will continue to evolve and grow,\" said Baltimore Deputy Police Commissioner Dean Palmere. \"The progess BFED has provided has paid dividends so far. We are getting back to a sense of normalcy within the city as a whole.\"\nYet, the city's homicide rate is on pace to be one of the worst on record with 258 recorded through Oct. 5, which five weeks ahead of 1999. That year the city recorded 305 homicides.\nAnyone with information about Tuesday's investigation is asked to call Metro Crime Stoppers at 866-7LOCKUP.\nRefresh wbaltv.com and our app, and watch 11 News for late-breaking updates."}