{"uri": "http://www.dispatch.com/content/stories/local/2016/03/04/Triple-shooting-critically-hurts-boy.html", "title": "Suspect held in killing of 7-year-old in court, ordered held without bond", "dct": "NODATE", "id": "bd9ddea24a2a4f802be076dd3860a05f", "content": "The man accused of shooting into a vehicle in the parking lot of a corner market Friday afternoon and killing a 7-year-old boy was in court this morning, and a judge ordered him held in jail with no bond. Marctarius K. Grace, 18, of Atcheson Street is charged with one count of murder for the death of Deonte M. Fisher, who was a back seat passenger in his parents' car when he was shot in the parking lot of the Express Market, 900 E. 5th Ave., according to an affidavit filed with the charge in Franklin County Municipal Court.\nThe man accused of shooting into a vehicle in the parking lot of a corner market Friday afternoon and killing a 7-year-old boy was in court this morning, and a judge ordered him held in jail with no bond.\nMarctarius K. Grace, 18, of Atcheson Street is charged with one count of murder for the death of Deonte M. Fisher, who was a back seat passenger in his parents' car when he was shot in the parking lot of the Express Market, 900 E. 5th Ave., according to an affidavit filed with the charge in Franklin County Municipal Court.\nDeonte's 5-year-old brother was also shot, Columbus Police said. Authorities did not identify him, but birth records show that he is Da'Kolta Fisher. Police said he was in stable condition Saturday at Nationwide Childrens Hospital.\nA man in the car, 19-year-old Rayquan Holloway, also was shot. Police said he is in stable condition at OhioHealth Grant Medical Center.\nColumbus Police Sgt. Christ Holzhauser, of the Columbus Police homicide squad, said Grace fired into the vehicle in the market's parking lot, in the Milo-Grogan neighborhood just east of I-71 and north of I-670.\nShow more...\nPolice haven't named a motive, but the Fisher children's mother, Judith Huntley, told a reporter from WSYX (Channel 6) that she knows Grace, and that he was aiming for Holloway in the shooting. The police affidavit filed in court indicates that Holloway has known Grace for about a year and a half and positively identified him as the shooter.\nBusiness at the Express Market, which has a long history of trouble, didn't seem to be affected by Friday's violence. This morning, the parking lot was so full that no more cars could even squeeze in.\nA woman sitting in an SUV at the edge of the lot, who would not give her name, said, \"Everybody's here to find out the truth about what happened to those babies. It's crazy.\"\nMeanwhile, the site of a second and separate shooting late Friday in South Linden that critically injured a 5-year-old boy remains an active scene today. The 900 block of Duxberry Avenue is still cordoned off, and crime-scene investigators remain there.\nPolice say the 5-year-old, who they did not identify, was shot just after 10:30 p.m.\nResponding officers found him in a back bedroom. Initial reports were that it may have been a drive-by, but police said today that the shots came from someone across the street.\nThe boy was taken to Nationwide Childrens Hospital and rushed into surgery. Police said he remains in serious condition.\nAnyone with information in that shooting is asked to call the homicide unit at 614-645-4730.\nIt was enough violence for one night to prompt Columbus Mayor Andrew J. Ginther to issue a statement today:\n\"I grieve the loss of Deonte Fisher and pray for all the children wounded in shootings on Friday night in Columbus. As a father, I cannot imagine a greater heartbreak than losing a child, especially to senseless violence. We cannot tolerate children being killed in our city or allow ourselves to become numb to neighborhood violence\"\nThe mayor went on to say that while the city is working hard to make the neighborhoods safer, this should be a call to action: \"...collectively we need to do more to end violence in our city. I call on all our parents, educators, and neighborhood, civic and faith leaders to redouble our efforts to end violence in our community.\"\nIn the earlier fatal shooting at the market, police were questioning other people on Friday night but so far, Grace is the only one charged.\nWitnesses told police that Grace ran up to the parked car, which had several children in it, and started firing. The windows of a gray Chevy Impala were shattered, and two of the doors flung open as the investigation continued well into this morning.\nJay Keen, who co-owns Keen's Body Shop, across the street from the market, said he heard about 15 gunshots and looked outside to see \"a bunch of little kids\" trying to get out of the car.\nHuntley, whom the Dispatch could not reach for comment today, told other reporters that her 4-year-old daughter was hit by bullet fragments and was expected to have surgery today. Police have not confirmed that, nor have they said what Holloway's relationship is to the children or Huntley.\nKeen said it seems that criminal activity around his body shop has gotten worse within the past year.\n\"We don't have problems on this side of the street, but it sure isn't good on the other side,\" he said. \"The last year, it's total chaos.\"\nThe Express Market, in fact, has been the backdrop to a number of high-profile crimes and police incidents in the past 10 years.\nThis year, on Jan. 7, two men were shot and wounded on the market lot.\nIn 2010, Demetrius Hargrove was killed and another man wounded when two other men shot at each other. Hargrove's family said at the time that he was a regular at the store and a bystander unexpectedly caught up in the violence.\nIn 2008, two Columbus police officers pulled up on the market lot and spotted a 16-year-old girl holding what appeared to be a semiautomatic rifle. She was shot by one of the officers when she refused to drop the weapon, which turned out to be a BB gun. The girl survived, and police said they suspected that her boyfriend, who had been inside the store, had been casing it to rob when the officers unexpectedly intervened.\nAnd in 2006, an after-hours intruder was shot and killed by an employee who was still inside the store.\nCameron Thurman, who has lived a couple of streets away for about a year, said the crime at the market hasn't stopped him or others in the neighborhood from going there.\n\"It's the only store in the neighborhood,\" he said.\ntdecker@dispatch.com\n@Theodore_Decker"}