{"uri": "http://kdhnews.com/military/shooting-report-could-spark-change-to-fort-hood-s-gun/article_1531a40c-a456-11e4-89ca-875214898bf3.html", "title": "Shooting report could spark change to Fort Hood’s gun policy", "dct": "Sun, 25 Jan 2015 04:30:00 GMT", "id": "104f087871e0d310ade284956c4be7b8", "content": "The report, released Friday, makes a number of recommendations about so-called privately owned weapons based on the findings of an investigation into the shooting by 34-year-old Spc. Ivan A. Lopez.\nOn April 2, Lopez opened fire on his fellow soldiers, killing three and wounding 16 before taking his own life.\nIn the aftermath of Lopez’s rampage, investigators discovered the .45-caliber handgun he used was purchased at Guns Galore, an off-post retailer. Before purchasing that weapon, Lopez bought a similar model firearm at an AAFES on-post store. He later reported that gun stolen to the Killeen Police Department.\nThe April shooting is far from the only deadly incident at Fort Hood to involve a weapon purchased privately off-post. Nidal M. Hasan also used a weapon purchased from Gun Galore in the Nov. 5, 2009, Fort Hood shooting that killed 13 people and injured more than 30 others.\nFour months before Lopez’s rampage, Army spouse Rouhad Ahamd Ezzeddine used a weapon and ammo purchased at Action Pawn #1 on Fort Hood Street to kill his two young daughters, and then himself, in their on-post home in January 2014.\nIn all three cases, the weapons purchased off post were not registered when they were brought onto Fort Hood.\nMeet majority of requirements\nAccording to Friday’s report, Fort Hood meets the majority of Army requirements for privately owned weapons. Currently, all service members and their dependents living, residing or staying temporarily on-post must register any personal firearms kept on the installation with the Directorate of Emergency Services. Registration requirements do not apply to soldiers or their families if they live off-post.\n“Commanders are limited in collecting a soldier’s (privately owned weapons) information if the soldier resides or stores (the weapon) off the installation,” the report states. “This impacts a commander’s ability to maintain situational awareness over a service member and their actions involving a firearm that could be concealed and brought onto the installation for unauthorized purposes.”\nThe report stated there were about 9,800 weapons on post, though it noted the registration system is not always updated when a soldier or family member with a personal firearm leaves post.\nThe report recommends broad changes to the National Defense Authorization Act that would require commanders to collect information about soldiers’ privately owned firearms, and require them to register the weapons regardless of residence.\nChanges at Fort Hood\nThat change, however, would require legislative action.\nFriday’s report also recommended changes to the personal weapons policy at Fort Hood specifically. The installation was not completely in compliance with an Army policy that mandates all soldiers and family members obtain the approval of a unit commander to register a private weapon. Instead, soldiers with the rank of sergeant first class and above are exempt from getting approval before registering a personal weapon.\nThe report recommended the local regulation be changed to get rid of the exemption, though it also notes this policy did not have an effect on the April 2 shooting. In fact, the report concluded there were no “clear warning signs” Lopez was going to commit a mass shooting.\nOther recommendations included developing a de-registration policy for private weapons, and creating policy and guidance for purchasing firearms on post.\nOn Friday, Fort Hood spokesman Col. Christopher Garver said the installation was working with Army in assessing recommendations in all the areas covered by the report.\n“The Army’s investigation report release Jan. 23 included several recommendations,” Garver said. “The Army, including Fort Hood, are currently in the process of evaluating and implementing those recommendations.”\nContact Chris McGuinness at chrism@kdhnews.com or (254) 501-7568. Follow him on Twitter at ChrismKDH."}