{"uri": "http://wtkr.com/2015/06/27/one-year-old-killed-in-attempted-robbery/", "title": "Third person arrested in death of one-year-old boy in attempted robbery", "dct": "Sat, 27 Jun 2015 22:32:00 GMT", "id": "ea20e2c6335bbd91b6064e00863da0da", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nPortsmouth, Va. - A one-year-old boy has died following a shooting that occurred during an attempted robbery Saturday night in Portsmouth, according to Portsmouth Police.\nThree people have since been arrested in connection.\nPolice received a call at 9:28 PM that a male and female had been shot in the 1500 block of Maple Avenue.\n\"My daughter called me and said that my grandson had gotten shot in the face, so I immediately came here, and they didn't know who it was,\" says Tonia Hayes. \"It was unwarranted they just burst into the house.\"\nOfficers arrived and found the one-year-old child, Dion Loften, Jr., suffering from a gunshot wound to the head and the adult female suffering from a gunshot wound to the lower back. Both were taken to the hospital where Loften later died. The female victim suffered serious injuries, but is expected to survive.\n\"We sat outside on the corner all night long waiting to get back in. I had to go clean my grandson's blood up,\" says Hayes. \"It's like, did this really happen?\"\nPortsmouth Detectives first said they had charged 18 year-old Anthony D. Holley and 18 year-old Jerry Atkinson, both of Portsmouth, with first degree murder, aggravated malicious wounding, attempted robbery and use of a firearm in the commission of a felony for their involvement with the case.\nA third person was later arrested in this case.\nMarquis D. Hinton, 18, turned himself in after he found out detectives were looking for him. He has also been charged with 1st degree murder, aggravated assault, attempted robbery, and use of a firearm in the commission of a felony.\nHayes says her daughter, who was at the home when her son and friend got shot, does not know the suspects.\n“They just started shooting and the bullet went through the door through my grandson and out the back wall,” said Hayes.\nHolley and Atkinson went in front of a judge Monday and the victim's family members were also in court.\n\"Just to see the people who did that to my grandson, that was very painful because I'm never going to get my baby back,” said Hayes.\nAn arrest warrant gave insight into what happened Saturday night on Maple Avenue. It states there was a knock at the door and a man wanted to buy marijuana. That's when the men entered the house asking where the money was according to the documents.\nIt states a woman ran to a back bedroom and shut the door which is when the warrant states the suspects starting firing shots.\nPolice said a 25-year-old woman was also shot and expected to be okay. The baby died at the hospital later that night.\nSarah Sutton was shot in the lower back during the shooting and was rushed to Sentara Norfolk.\nNow this family mourns. There is a memorial set up in front of the house.\nThe family wants justice for the little boy who they say was just learning to talk.\nPolice would not say if they are looking for additional suspects in the shooting, but they do say the investigation is ongoing.\n\"I don't know why they did it, there was no reason, there was no explanation for it, I don't know why but there needs to be justice for my one-year-old grandson,\" says Hayes. \" He was so energetic, he was a happy baby, he was a beautiful baby.\""}