{"uri": "http://www.pennlive.com/news/2016/08/15-year-old_boy_killed_by_teen.html", "title": "15-year-old boy killed by friend in accidental shooting ID'd", "dct": "Mon, 15 Aug 2016 12:51:48 GMT", "id": "4d2a43a595280930c769c4b46b734d44", "content": "The Lancaster County district attorney's office has identified the 15-year-old boy who was killed by his 17-year-old friend Friday morning in an accidental shooting.\nIbram Hanna died of a single gunshot wound at the unidentified 17-year-old shooter's home on West Main Street in Mountville. Police responded to the scene at around 10:45 a.m. Aug. 12 to find Hanna suffering from the gunshot wound, which investigators believe was the result of an accidental shooting, district attorney spokesman Brett Hambright said in an email.\nThe two boys were looking at the gun that the 17-year-old boy had stolen from a vehicle in the township before it fired, officials said. Hambright described the death as a result of \"criminal reckless behavior rather than a premeditated killing.\"\nHanna's family has launched a gofundme campaign for funeral costs. So far $4,430 of the $5,000 goal has been raised. The following is a statement on the website:\nOn August 12th our family shared the final memories with our beloved friend, brother and son, Ibram Hanna. He left us with many wonderful memories that will always fill our hearts forever. Ibram was with a friend when he was accidentally shot and killed at the age of 15.\nHis mother is saddened to explain how excited he was to start a new school year. Ibram's number one priority was to score for his football team. Although, he had recently had knee surgery, this did not stop him from doing all the things he loved to do. He will always be remembered as the kind, strong and loving person he was.\nAll the donations will be used to help Ibram's family with funeral costs and fees. Thank you all for your support and keep Ibram and his family in your prayers. Help spread the word!\nThe 17-year-old was charged with misdemeanor counts of involuntary manslaughter, theft from a vehicle, possession of drug paraphernalia and felony theft of a firearm. The boy will be prosecuted in juvenile court.\nA person charged with involuntary manslaughter cannot be charged and prosecuted as an adult under the Juvenile Act."}