{"uri": "http://www.greenvilleonline.com/story/news/crime/2016/09/28/shooting-reported-townville-elementary/91227346/", "title": "Townville Elementary shootings linked to nearby slaying", "dct": "NODATE", "id": "88889297bee806cf39675fa24bb2003f", "content": "A 14-year-old armed with a handgun killed his father as he sat on the couch in their home on Wednesday before he got behind the wheel of a black pickup, pulled onto a rutted dirt road and headed to Townville Elementary about three miles away, according to authorities.\nThere, as children were led outside for recess, the teenager rammed the truck into a chainlink fence surrounding the playground, stepped out and opened fire, authorities said.\nA bullet struck student Jacob Hall in the leg and a second boy was shot in the foot. First-grade teacher Meghan Hollingsworth managed to herd the children to safety inside the building even as she was shot in the shoulder.\nAmong those heading out to the playground was Katrina Jones' 6-year-old niece. She said her niece told her that she heard the gunman say, \"I hate my life,\" moments before the shooting.\n“I didn’t know what was happening. I was just trying to figure out what was going on and if my son was OK. I just wanted to be with my son again.”\nThe shooter, who authorities said never entered the school, was subdued by the first emergency responder on the scene — an unarmed 30-year veteran of the Townville Volunteer Fire Department named Jamie Brock.\nHall was airlifted to the Pediatric Trauma Center at Greenville Health System where he was listed in critical condition Wednesday night.\nHollingsworth was treated and released from AnMed, as was the student shot in the foot.\nBy day's end, Brock and Hollingsworth along with Anderson County emergency responders and others at the school were hailed as heroes whose quick action may have saved countless lives.\nAnd the questions began over what motivated the teen — too young to get a driver's license — to unleash unspeakable violence on an elementary school playground and kill his father.\nWhether the gunman intentionally targeted any of his victims at the school, authorities couldn't say Wednesday afternoon. Nor could they say whether he had any connection to the three.\nBut authorities said he did have a connection to his first alleged victim — Jeffrey D. Osborne, 47, of 150 Osborne Road, was his father.\nAnderson County Coroner Greg Shore said the teenager was alone at home with his father when he shot him multiple times in the den. Osborne's wife was at work at the time, he said.\nHe said the teen was homeschooled and had taken online classes earlier in the day.\nA neighbor who was sitting on his front porch said the Osbornes had lived there for at least 10 years and kept a chicken farm for most of that time. He said he saw Osborne Wednesday morning and waved. His son, the neighbor said, “seemed like the nicest kid.”\nThe only odd thing he remembers is hearing gunshots from the farm two nights ago. The neighbor said he thought the shots were for target practice.\n“Dunno what makes kids just snap like that,” said the neighbor, who asked not to be identified.\nThe initial call about 1:45 p.m. came from a teacher at the school reporting that an armed male was on the school grounds and a student had been shot, said Taylor Jones, Anderson County emergency services director.\nAuthorities said that shortly after receiving the report of the school shooting, they received a 911 call from Osborne's parents, who live nearby on Fair Play Road. Shore said the couple reported that they had received a call from their “crying and distraught” grandson about 1:44 p.m. and discovered their son's body when they went to the home on Osborne Road looking for their grandson.\nEMS and LifeFlight responded to the scene at the school along with units from the Highway Patrol, Anderson City Police, and the sheriff's offices in Anderson and Oconee counties.\nWitnesses on social media reported seeing dozens of emergency vehicles speeding up State 24 toward the school.\nAt almost precisely that same time, Hannah Ginn arrived at the front of school with her mother and 9-month-old daughter to pick up her 4-year-old son for a 2:30 p.m. doctor's appointment.\nUnable to get anyone in the front office to buzz her in or answer the office phone, Ginn said drove to the back of the school. There, she said she saw a truck “parked to the side all weird and crazy looking” with the door open and no one inside.\n“Then this teacher just opens the door and says “get back, get back, get back!”\n“Next thing I know, there’s police officers pulling up everywhere, emergency vehicles pulling up everywhere,” Ginn said. “These officers get out of the car, they have their guns and their full body gear on, going up to the school.”\nAuthorities swept through the school to secure the scene. Children were bused to nearby Oakdale Baptist Church to be reunited with their parents.\nThe line of parents in cars waiting to pick up their children at the church stretched for more than a half-mile.\n“It was just a really scary experience,” said Ginn, who described seeing one child carried out of the school bleeding from his leg.\n\"I didn’t know what was happening. I was just trying to figure out what was going on and if my son was OK,\" she said. \"I just wanted to be with my son again.”\nGinn waited about an hour and a half before she was reunited with her son. His class, which was near the playground, was one of the last to be released from the school, she said.\nOther parents fought back tears as they waited for their kids.\nMichelle Bush was picking up her two children, a second-grader and a third-grader. \"I don't really know how you can explain why crazy people do crazy things,\" she said after talking with her daughter. \"I'm just glad the teachers did the right thing to keep the kids safe.\"\nTownville Elementary is in Anderson County District 4. It has 286 students in pre-kindergarten through 6th grade, according to the state Department of Education. The school is at 105 Townville School Road, off State 24 near Lake Hartwell and the Georgia state line.\nGinn said the shootings have rocked the close-knit community. Anderson County is not among the sites of recent school shootings in South Carolina.\n“It just breaks my heart because Townville’s a very, very small community. Everybody knows everybody. And if you don’t know their names, you know their faces from somewhere.”\nThe school does not have a resource officer but has had extensive active-shooter training, said Anderson District 4 Superintendent Joanne Avery.\nAnyone entering the building has to be admitted through the schools \"airlock\" system that requires staff to unlock the inner door, she said.\nThe school will be closed the rest of the week, Avery said, and the district will provide counseling services for students and staff.\n\"There were some heroes here today,\" said the Rev. Kyle Caudell, pastor of Double Springs Baptist Church and chaplain for the local fire department.\nThe teachers, school staff and law-enforcement handled the situation professionally, after having just gone through a drill recently, Caudell said.\n\"Everything went off just like clockwork,\" he said. \"It could have been a ton worse.\"\nLate Wednesday afternoon, a woman was escorted to the house on Osborne Road in a black Sheriff’s Office SUV. Her cries carried down to the driveway. Officials kept her out of sight as more family members arrived and left the house in tears.\nAn ambulance pulled away from the home at dusk. After dark, authorities brought in floodlights to light the scene.\nAcross the street sat three chicken houses with its doors flung open. A dark green sign hanging from a white post read: “Osborne Poultry Farm.” The farm was deserted; machinery sat in the dirt where two new chicken houses had been planned.\nReporters Frances Parrish, Mike Ellis, Nikie Mayo and Kirk Brown from the Independent Mail contributed to this report.\nGovernor Nikki Haley released the following statement in response to the shooting:\n\"As we work together with law enforcement to make sure they have the support they need to investigate what happened in Townville, Michael and I ask that everyone across South Carolina join us in praying for the entire Townville Elementary School family and those touched by today's tragedy.\""}