{"uri": "http://www.wistv.com/story/33271132/school-district-emergency-situation-reported-at-townville-elementary-school", "title": "Solicitor files petition to charge Townville Elementary shooting suspect as adult", "dct": "Thu, 03 Nov 2016 21:11:00 GMT", "id": "e44411642a94c84611d8d0b0203ec8e9", "content": "TOWNVILLE, SC (FOX Carolina) -\nThe Solicitor's Office announced new charges in the case against a teenager accused of opening fire on the campus of an Upstate elementary school.\nSchool has been canceled until Thursday, Oct. 6 at Townville Elementary School after deputies said a 14-year-old suspect opened fire on the school playground, wounding three people on Wednesday.\nOne of the victims, Jacob Hall, passed away on Saturday.\nVICTIMS WOUNDED, CHILD KILLED\nDeputies said two boys, both first grade students at the school, and an adult teacher were shot on the playground behind the school, located on Townville School Road.\nJacob, one of the students, was airlifted to the Greenville Hospital System pediatric trauma unit after being shot in the leg. During a press conference on Thursday, relatives said Jacob suffered massive blood loss and was on life support, too weak currently for additional surgeries.\n\"As long as his heart's beating, we've got hope,\" his great-aunt Rebecca Hunnicutt said.\nHis parents, Rodger and Renae Hall, said, \"We appreciate the community’s support, especially the Townville Rescue Squad who treated Jacob onsite and brought him to the hospital. We appreciate everyone’s thoughts and prayers and ask for privacy during this difficult time.”\nOn Saturday afternoon, Jacob passed away. Anderson County Coroner Greg Shore said the boy passes away just before 1 p.m. at Greenville Memorial Hospital.\nThe other student, who was shot in the foot, and the teacher, shot in the shoulder, were taken to AnMed Health System for treatment. As of 6 p.m. officials at AnMed said both were released from the hospital.\nThe teacher was later identified as first-grade teacher Meghan Hollingsworth. According to Townville Elementary School, she has been teaching for 13 years. She joined the school in 2007.\nOn Monday, Solicitor Chrissy Adams said a third child victim was identified.\nAnderson County deputies released a statement about the newly identified victim on Tuesday.\nREAD MORE: Kindergarten student in critical condition after Townville Elementary shooting | LIST: How to support Townville school shooting victims | INFO: Plans announced for Jacob Hall's superhero funeral\nTHE TEEN SUSPECT\nThe Tenth Circuit Solicitor's Office identified the teen suspect as 14-year-old Jesse Osborne.\nJesse's mother and aunt released statements on the shooting, saying they wished they could \"turn back time\" and the entire family was \"shocked and saddened by [his] senseless actions.\"\nThe spokesman for the family, who asked to remain anonymous, said Jesse was a good student, had a good relationship with his parents and the family is in shock by what happened. (Note: The spokesperson confirmed the teenager's identity prior to Friday's court hearing, in which the teenager's charges and status as a juvenile were announced.)\n\"The Jesse I know is a 14-year-old country boy, farm boy, straight-A student,\" he said. \"This is completely out of character.\"\nJesse is currently being held at the Greenville County Detention Center. He appeared in court on Friday and was charged as a juvenile.\nOn Monday, solicitor Adams said one of the attempted murder counts was official upgraded to a murder charge after the death of Jacob Hall. Additional petitions were filed for five counts of possession of a weapon during a violent crime.\nOsborne is facing a total of two counts of murder, three counts of attempted murder and five counts of the weapons charge.\nOn Oct. 6, the Solicitor's Office filed a motion petitioning the court to try Jesse Osborne as an adult. A hearing will be set by a Family Court judge.\nMORE: Mother, aunt of teen school shooting suspect release statements | READ: Family spokesperson reacts to Townville shooting suspect's arrest | READ: Teen charged with murder, 3 counts of attempted murder in connection with Townville shooting\nTHE 'OPPORTUNISTIC' ATTACK\nDr. Tom Dobbins, chairman of District 4, said it doesn't appear Jesse was related to the shooting victims at the school. He described it as what he believes to be an \"opportunistic\" attack since the victims were all outside.\nJesse reportedly drove a Dodge Ram onto the school property and jumped a fence to access the playground. He never entered the school, according to officials.\nTaylor Jones, Anderson County Emergency Services Director, said the shooting was reported by a teacher who called 911 from a classroom at 1:45 p.m. Eli Stephens, a Townville Elementary student, said they could hear shots in his classroom.\n\"We went to our desk and started hearing gunshots outside,\" Stephens said. \"We were all... trying to go to the window and look.\"\nA parent of one Townville Elementary student said her son has been having nightmares and is afraid to go back to school. She said he will likely get counseling as he copes with the events.\nIt was an emotional scene on Wednesday as parents were reunited with their children after the school evacuation.\nSLIDESHOW: Townville school shooting | INFO: Counseling resources offered in wake of Townville school shooting\nFIRST RESPONDERS SAVE LIVES\nFirefighters were first to arrive and deputies were on scene within 7 minutes, school officials said.\nJones said a Townville volunteer firefighter engaged the armed teenager, \"took him down,\" and held him until deputies arrived. The firefighter was identified as Jamie Brock, who has served the community for 30 years.\nBrock released a statement via the Townville fire chief on Thursday, saying his reaction to put his life on the line was no different than any other fire or law enforcement personnel.\nHe said the true heroes are the teachers and principal who protected Townville Elementary's students.\n\"They deserved to be called heroes and I tip my hat to them,\" Brock said.\nDr. Joanne Avery, Anderson County District 4 Superintendent, said staff had undergone active shooter training and, along with first responders, put that training into action.\n\"We are heartbroken by this senseless act of violence but are so thankful for the quick response from law enforcement and staff,\" Avery said. “The quick response saved lives.\"\nStudents and staff were evacuated from the school as deputies and SWAT team members were evacuated from the school and the students were transported by bus to Oakdale Baptist Church on nearby Highway 24. Parents picked up their children at the church, which was protected by armed deputies.\nREAD: Townville volunteer firefighter stopped school gunman | WATCH: Firefighter, chief release statements after school shooting\nRELATED HOMICIDE INVESTIGATION\nAnderson County sheriff's deputies said Jesse's father was also found dead in his home on Osborne Road Wednesday afternoon, less than three miles from the school.\nCoroner Greg Shore confirmed during a press conference 47-year-old Jeffrey Osborne was found with gunshot wounds and his death has been ruled a homicide.\nJesse is charged with murder in connection with his father's death. According to deputies. Jesse called his paternal grandparents crying and when they went to check on him at the home, they found Jeffrey Osborne's body.\nDeputies said the investigation into the incident would likely take several weeks.\nLEADERS REACT\nOfficials said Governor Nikki Haley landed in the Upstate on Wednesday night. She released the following statement after the shooting:\n\"As we work together with law enforcement to make sure they have the support they need to investigate what happened in Townville, Michael and I ask that everyone across South Carolina join us in praying for the entire Townville Elementary School family and those touched by today's tragedy.\"\nSouth Carolina senators and representatives also spoke out on Wednesday, sharing their condolences and support for the Upstate. Upstate schools and law enforcement agencies showed solidarity with Townville in the aftermath of the tragedy.\nSen. Tim Scott made a trip to Townville Elementary on Thursday to lay flowers at the school. Sen. Graham, who flew to Greenville on Thursday morning, said he sat beside the son of the Townville Elementary principal on his flight.\nREAD MORE: SC senators, representatives release statements on school shooting | Upstate schools, law enforcement react to Townville shooting | Sen. Tim Scott lays flowers at Townville Elementary in show of support\nCONTINUING COVERAGE: Latest headlines, video updates on Townville Elementary shooting investigation\nCopyright 2016 FOX Carolina (Meredith Corporation). All rights reserved."}