{"uri": "http://hawaiitribune-herald.com/news/local-news/woman-2-children-dead-triple-homicide", "title": "Woman, 2 children dead in triple homicide", "dct": "Fri, 06 May 2016 15:24:00 GMT", "id": "55917982766523d3d17592ba36f9325a", "content": "A man who lives next door to the Leilani Estates home where a triple homicide occurred early Friday morning said he occasionally heard arguments coming from the home.\n“I do know they were not a happy couple over there,” Tim Mullins said. “They would argue and fight and I would hear it from time to time. But before it got too bad, it would quiet out.”\nPolice arrested 49-year-old John Ali Hoffman as police responded to a disturbance call at the Moku Street home where Hoffman lives, not far from the subdivision’s community center. He was arrested on suspicion of three counts of second-degree murder, one count of first-degree murder and a firearms offense.\nHoffman is being held at the Hilo police cellblock while detectives investigate.\nPolice Capt. Robert Wagner of the Hilo Criminal Investigation Division said Hoffman was driving away from the house in a car with no lights on when responding officers arrived and police stopped the vehicle. They found the woman’s body in the trunk and a firearm on the front seat of the car, he said.\nInside the house, officers discovered the bodies of a boy and a girl, Wagner said. Police were trying to identify the victims.\n“It does appear that the lady in the car, the suspect that was arrested, John Hoffman, and the two juveniles were living together in the house,” Wagner said.\nOther media reports cited sources as saying the victims were Hoffman’s wife and two small children.\nMullins said he did hear a disturbance but didn’t hear gunshots.\n“It was pretty rainy and the coqui were loud but in between the shower bursts it did sound like a woman’s voice was piercing through the night, and then it would go away. And I was trying to sleep so I tried to tune that out and I didn’t think anything of it at that time,” he said.\n“We didn’t know anything had actually happened until the police accidentally came to our place first. And then they came back over to ask us did we hear any popping noises or any commotion last night. And we told them we really didn’t hear any because of the rain.”\nMullins said he didn’t know the neighbors and described them as “very reclusive people.”\n“The only interactions I had with them was hearing them because my office window is about 15 feet away from their building, and it’s always open,” he said.\n“A lot of times in the mornings, I would hear him outside, ranting and venting. And sometimes, he would have a friend over there, you could hear another male voice. He’d be going on and on about something but I would tune that out because I’m working.\n“You would definitely get the feeling, living next door to them, that they were not a happy household.”\nMullins said the incident is a rarity in the quiet subdivision just outside Pahoa.\n“Leilani is such a nice little neighborhood and people are very friendly. You see (people) and you wave when you walk down the street and they drive by. And I really like that about here,” he said.\nA triple homicide is rare, not only for the area, but for the entire island, the captain said.\n“I can’t remember having one before,” he said. “It’s definitely unique.”\nThe Associated Press contributed to this story.\nEmail John Burnett at jburnett@hawaiitribune-herald.com."}