{"uri": "http://www.cleveland.com/metro/index.ssf/2016/12/cleveland_boy_shot_in_the_city.html", "title": "Cleveland boy says robber shot him, but doctor says injuries appear self-inflicted", "dct": "Wed, 14 Dec 2016 11:41:00 GMT", "id": "e1ea9819aaa6d11b8dfcebf88c24257a", "content": "(File photo)\nCLEVELAND, Ohio -- Police are investigating after a 17-year-old boy was shot Wednesday during what he said was an armed robbery on Cleveland's East Side.\nThe boy suffered two gunshot wounds to his lower body, according to a police report.\nUniversity Hospitals medical staff said his wounds appeared to be self-inflicted, but the boy maintained to police that he was shot by a robber in the city's Lee-Miles neighborhood, the report says.\nThe shooting happened about 12:15 a.m. at Lee Road and Deforest Avenue, shortly after the boy bought some snacks from a nearby gas station, according to the boy's statements contained in a police report.\nA gas station clerk said he spotted the boy's friend run to his aid, but didn't see what happened otherwise.\nThe boy said he left the gas station and walked through a shortcut when he was approached by a young man carrying a gun, the report says.\nThe boy told police that the robber demanded that he hand over everything he was carrying. He fired a round into the air and told the boy \"I'm not playing around, give me everything,\" the report says.\nThe boy said the robber held the gun to his stomach, then shot him at point-blank range. He reacted by yelling for help and tackling the robber to the ground, the report says.\nThe boy's friend, who was still at the gas station, said that he ran over to help, the report says.\nThe two boys told police that they briefly held the robber down, but the victim said he eventually ran off after feeling himself bleeding and spotting the bullet hole in his jacket, the report says.\nThe friend said the robber sped off in a silver Chevrolet Trailblazer after the struggle.\nDetectives are still investigating the incident and no suspects were identified. Police did not say if they believe the injuries were self-inflicted or the result of a robbery.\nTo comment on this story please visit Wednesday's crime and courts comments page."}