{"uri": "http://www.fox16.com/news/local-news/child-shot-investigation-continuing", "title": "Update: Child Shot in Lonoke Released from Hospital", "dct": "NODATE", "id": "76ca238a2b8e3c7bd547ea1853fbe98c", "content": "UPDATE:\nLonoke, Ark. - Arkansas Children's Hospital confirmed the nine-year-old boy who was shot in the chest was discharged Thursday evening.\nThe Lonoke Police Department said the shooting at a house on High Ridge Road was accidental.\nAssistant Chief Randy Mauk said two children were at home with a babysitter when the boy was shot.\nMauk still could not say if the victim accidentally shot himself or if another person was responsible.\nThe prosecutor will ultimately decide what charges, if any, will be filed.\nORIGINAL STORY:\nLONOKE, Ark. - Police responded to a call in the 100 block of Highridge Dr. in Lonoke Wednesday, where they found a child who had been shot in the chest.\nThe child was Med Flighted to Children's hospital where we are told the child has non-life threatening injuries and is expected to be okay.\nThere are still a lot of questions about what actually happened.\nSeveral neighbors who spoke to KARK say one of the children in the house may have gotten ahold of a gun that belonged to the parents.\nPolice have not confirmed if the child inflicted the gunshot on their own or was shot by someone else.\nCrystal Lewis lives in the neighborhood. She says it's a tragedy. \"It's very scary to think that children that age don't know the difference between a toy gun and a real gun and they know how to actually use it.\"\nLewis has a six year old son. She says they have a gun in their house, but it's not accessible to her child, and he's been taught about the dangers.\n\"It breaks my heart,\" says Lewis. \"I read these stories about kids doing this. It honestly makes me tear up every time I read the stories. Too many kids these days are getting hurt for stupid reasons.\"\nPolice didn't confirm any other details about the shooting or if anyone had been arrested.\nThe investigation is ongoing."}