{"uri": "http://www.recordnet.com/article/20130919/A_NEWS/309190322", "title": "Shooting details emerge", "dct": "NODATE", "id": "8c230849b7d0c1414c94606b9444d2ca", "content": "STOCKTON - Witnesses were sharing chilling details of a deadly shooting outside Danny's Market in central Stockton on Wednesday when friends and family members of the victims arrived to grieve for their loved ones.\nSTOCKTON - Witnesses were sharing chilling details of a deadly shooting outside Danny's Market in central Stockton on Wednesday when friends and family members of the victims arrived to grieve for their loved ones.\nFive people were wounded when gunfire erupted outside the store about 9:40 p.m. Tuesday, police said. Antoine Martis Kelly, 26, of Stockton was pronounced dead at the scene, authorities said. His death marks the 20th homicide the Stockton Police Department has investigated this year.\nA 22-year-old man from Oakland was taken to a hospital in critical condition. A 23-year-old Sacramento man, a 30-year-old Stockton man and a 34-year-old man from Oakland were listed in stable condition, police said.\nThe man who was critically injured was still alive Wednesday, said Officer Joe Silva, a spokesman for the Police Department, but a woman grieving at the scene Wednesday afternoon said he had died.\n\"Two real people died,\" she said. \"They were good people. They were dads. One of them had a baby who isn't even a year old. They didn't deserve to die.\"\nAccording to police, three to four gunmen wearing dark, hooded sweatshirts approached the victims and opened fire. A man who spoke on condition of anonymity because he feared for his safety said the shooting stemmed from a verbal dispute in a parking lot just north of the market in the 700 block of North Airport Way.\n\"All day yesterday, (the victims) were out here being obnoxious with people's wives and girlfriends and the other working girls, like, 'Hey, baby, come here and make some real money with me,' \" he said, referring to prostitutes who frequent the area. \"When I went outside, they were arguing. I heard one of them say, 'Oh, you gonna shoot me now?' Then the shots went off.\"\nTwo witnesses said they heard 13 to 14 gunshots fired from multiple weapons. On Wednesday, there were bullet holes in a wooden fence and 14 small chalk circles in the parking lot, marking locations where shell casings were found.\nOne of the witnesses said he observed two vehicles fleeing the scene, saying he saw a white Pontiac Grand Prix going south on North Airport Way and a white Lexus going west on East Park Street.\nA woman who left the store moments after the shooting saw four of the victims, including two who had been shot in the head.\n\"There was yelling. There was screaming. They were yelling, 'Help! Help! Help!' \" the woman said, speaking on condition of anonymity because she feared for her safety. \"I saw the dead body and the other one that got shot up real bad.\"\nWhen the woman returned to her residence following the shooting, she found that one of the victims had entered her home, which was occupied by her three children and other relatives. The man was seeking help after sustaining gunshot wounds to his right arm and left foot, and the woman's children saw him covered in blood, she said.\n\"I'm not from Stockton,\" she said. \"My kids and I are not used to this at all. I'm afraid for our lives. I'm in fear for me and my children. We hardly got any sleep all night. My kids can't even close their eyes without seeing him.\"\nPolice located a fifth victim who was being taken to a hospital in a white Ford Taurus when occupants of the vehicle waved down officers near North Hunter and East Poplar streets, several blocks from the shooting, authorities said.\nHomicide detectives are still trying to determine a motive, but the neighborhood where the shooting occurred is a hot spot for prostitution, drug sales, gang activity and violent crime, police said.\n\"The area around Danny's Market is a high-crime area,\" Silva said. \"This area encompasses the Wilson Way corridor, which has historically been known for prostitution, street robberies and shootings.\"\nAnyone with information about this case is encouraged to call the Stockton Police Department at (209) 937-8377, the Investigations Unit at (209) 937-8323 or Crime Stoppers at (209) 946-0600. Crime Stoppers pays cash rewards up to $10,000. Callers can remain anonymous.\nCellphone users can text information to 274637 (CRIMES) by entering the keyword \"TIPSPD\" followed by their tip. Internet users can visit the Police Department's Facebook page and click \"Submit a Tip.\"\n\"We really need the community's help on this one,\" Silva said. \"We know there are people who were in that area during the time of the shooting, and we need to reach out to those people and encourage them to report what they saw to police.\"\nContact reporter Jason Anderson at (209) 546-8279 or janderson@recordnet.com. Visit his blog at recordnet.com/crimeblog."}