{"uri": "http://www.kctv5.com/story/29200287/kcpd-toddler-shot-in-east-kansas-city", "title": "Search is on for for gunman who killed 3-year-old boy", "dct": "Sun, 31 May 2015 15:51:00 GMT", "id": "56d24c48b075bce508e5ebc6027a8f30", "content": "KANSAS CITY, MO (KCTV) -\nA 3-year-old was gunned down in his east Kansas City neighborhood, and now the search is on for the innocent little boy's killer.\nKansas City police were called shortly after 10 a.m. Sunday to the area of East 67th Street and Walrond Avenue in regard to a shooting.\nWhen officers arrived on the scene, they found a house riddled with as many 20 bullet holes. One of those bullets took the life of Amorian Hale. He was inside the home when the house was shot at from outside. He died at the scene.\n\"So many kids are getting killed in our community, and it has to stop. That was my grandson, and I miss him and I love him, and I know we can't bring him back, but I want justice,\" Amorian's grandmother, Lynne Hale, said.\nKansas City Mayor Sly James arrived on the scene Sunday to speak with investigators.\n\"The fact that it seems to be a recurring theme just makes it that much worse. From a parents' standpoint, there could not be anything worse than losing a child,\" he said. \"There's no way that we have been able to come up with to prevent idiots from riding around in cars with high-powered weapons shooting indiscriminately into homes and not caring where the bullets go.\"\nFamily members will remember Amorian as an energetic, polite and very bright child. They have set-up a GoFundMe account to help with funeral expenses. Click here to donate.\nDerrick Hale is overwhelmed with sadness and still in shock after the sudden and tragic death of his grandson. Hale said his son and four grandchildren were asleep when gunshots poured through the family home Sunday morning.\n\"He jumped up, went to check on the twins and his other son and said there was nothing he could do for him,\" Hale said. \"So he ran out of the house and started chasing after what he seen, just started chasing after a car.\"\nPolice have not released any suspect information or a car possibly involved.\n\"I just hope they find him,\" Hale said. \"It was senseless number one, somebody just to come by and shoot up somebody's home. It is ridiculous.\"\nSeveral children have lost their lives to gun violence in Kansas City.\nWithin the last year, three children - 7-month-old Jaquail Mansaw, 6-year-old Angel Hooper and 10-year-old Machole Stewart - all died from errant gunfire. Many others have been wounded.\nKansas City's mayor says he wants the entire community to fight back against the violence.\n\"We need anger about this kind of activity. We need the entire city and citizens to rise up and say this is unacceptable,\" James said.\nAnyone with information in the city's latest killing is urged to call the TIPS Hotline at 816-474-TIPS.\nCopyright 2015 KCTV (Meredith Corp.) All rights reserved."}