{"uri": "http://www.kmbc.com/news/toddler-killed-in-kc-shooting/33316006", "title": "Mayor: 'Armed idiots' blamed for boy's death in shooting", "dct": "Sun, 31 May 2015 22:55:00 GMT", "id": "e23d31bccf367c843cd62a266b9c16d0", "content": "KANSAS CITY, Mo. —\nPolice said a 3-year-old boy has been killed in a shooting late Sunday morning in Kansas City.\nOfficers said the boy, who family members said they called Amorie, was shot in a home in the 6700 block of Walrond Avenue about 10:15 a.m. Witnesses said more than 20 shots were fired into the house.\nOther people, including children, were inside and asleep at the time, but were not hurt.\nPolice said there are shell casings in the street and the shots might have been fired into the house from a passing car. Police are processing the evidence at the scene and talking with witnesses.\nA woman named Kelly, who identified herself as a cousin of the victim, said how much he'll be missed.\n\"He was always happy. He made everybody smile. Every time he saw his cousins, he would always say, 'Hi cousin,'\" she said. \"He would always play with my cousin. They were close. He lit up the whole room, and somebody took him from everybody who loved him, everybody that was close to him, and they don't understand.\"\nKansas City Mayor Sly James spent the morning at the crime scene, talking with family members and police.\n\"Truly saddened by senseless death of 3 yr old by armed idiots drive-by shooting into a house this morning,\" he said in a tweet.\nHe said the boy wasn't the first child in Kansas City killed by a drive-by shooting and it's becoming a recurring theme. He said it's a type of crime that is especially frustrating to police and city leaders.\n\"There's no way that we've been able to come up with to prevent idiots from riding around in cars with high powered weapons shooting indiscriminately into homes and not caring where the bullets go,\" James said. \"This is crazy.\"\nHe called on the community to come together and for anyone who knows who fired the shots to come forward.\nAnyone with information has been asked to call the Crime Stoppers TIPS Hotline at 816-474-8477.\n11833402"}