{"uri": "http://www.nbc29.com/story/33628247/augusta-co-sheriffs-office-investigating-reported-shooting", "title": "Update: Man Under Influence of Meth Charged in Augusta County Shooting", "dct": "Fri, 04 Nov 2016 00:34:00 GMT", "id": "b2b95f03d3a6bbec4cffd52351e2879a", "content": "AUGUSTA COUNTY, Va. (WVIR) -\nThe Augusta County Sheriff's Office is now investigating a reported shooting in the 100 block of Strickley Road.\nInitial reports stated one person was dead and another injured, but after arriving on scene police say no shooting had taken place.\nSheriff Donald Smith says that Shannon Douglas Wine, who was under the influence of methamphetamine, was injured when a revolver discharged while he was trying to take it apart.\nWine wasn't hurt by the bullet but did have several cuts on his hand. He was transported to Augusta Health for treatment.\nWine has been charged with possession of a firearm by a non-violent convicted felon and possession of a controlled substance while possessing a firearm.\nHe is being held without bond at the Middle River Regional Jail.\nAugusta County Sheriff's Office Press Release 11/04/2016:\nShannon Douglas Wine was arrested last night in connection with the incident on Strickley Road on 11/3/16.\nWine, while under the influence of methamphetamine, was attempting to disassemble a loaded revolver. Wine was removing the screws with a screwdriver when the firearm discharged. He was not injured by the bullet when the gun went off, but the explosion from the gun caused several lacerations on Wine’s hand.\nDeputies arrested Wine after he was released from the hospital and he has been charged with the following:\n1) 18.2-308.2 Possession of a firearm by a non-violent convicted felon.\n2) 18.2-308.4 Possession of a controlled substance while simultaneously possessing a firearm.\nWine was held without bond and is being held at the Middle River Regional Jail.\nAugusta County Sheriff’s Office Press Release 11/03/2016:\nThe Augusta County Sheriff’s Office responded to the 100 block of Strickley Road for a reported shooting. It was reported that one person was dead and another had a gunshot wound, but was moving around and talking.\nThe call for service was received at the Emergency Communication Center at 16:00 hours. Deputies were on location at 16:19.\nOnce on location, it was determined that no shooting had taken place.\nThe investigation is still ongoing at this time, but I can confirm, “That a male was injured at the scene by the firearm when it discharged while he was trying to take it apart,” said Sheriff Donald Smith\nThe male was transported to Augusta Health to have his injuries evaluated.\nCharges are pending and methamphetamine use was a contributing factor to this incident.\nAdditional information will be released tomorrow when the investigation is concluded."}