{"uri": "http://www.tulsaworld.com/news/crimewatch/barber-killed-in-quadruple-shooting-alleged-gunman-arrested/article_f78ef513-90d4-584b-8c04-6e334d00dd59.html", "title": "Barber killed in quadruple shooting; alleged gunman arrested", "dct": "Sun, 08 Feb 2015 00:00:00 GMT", "id": "f21ff12c27af043d2533f6393bd0bbec", "content": "Police have arrested a man who allegedly opened fire with a long gun Friday night inside a north Tulsa barber shop, killing one man and wounding three others.\nTulsa Police homicide Sgt. Dave Walker identified the suspected shooter as Chadrick Colbert, 24. He was arrested Saturday night and was to be booked into the Tulsa Jail on a first-degree murder complaint and three complaints of shooting with intent to kill.\nThe dead man was identified Saturday as Keith Liggins, 41, one of the shop’s barbers.\n“We can say that Mr. Liggins was not the intended target of the murder and was an innocent victim making a living at the time of his death,” Walker said in a statement.\nOfficers were summoned just after 9 p.m. Friday to Gifted Hands Barber & Beauty Shop, 1219 N. Sheridan Road, on a report of a shooting involving multiple gunshot victims.\n“Evidence at the scene indicates that the shooter approached the front door and shot from the door before someone inside the shop returned fire,” Walker said. “The return fire hit the suspect’s car in the radiator causing the radiator to leak.”\nOfficers followed the leak’s trail and recovered the getaway vehicle at an abandoned house four blocks from the barber shop, Walker said.\nRobbery didn’t appear to be a motive in the shooting, with no items taken nor any apparent demands made by the shooter, police said.\nIn announcing Colbert’s arrest, Walker said there were no further details to report on the quadruple shooting, which turned into Tulsa’s 10th homicide of 2015. He noted the investigation was still in its early stages.\nEarlier in the day, Walker said detectives weren’t sure if any of the three surviving gunshot victims were the target or targets. He said those three and all others present with whom investigators spoke denied shooting back at the gunman.\nTulsa Police Capt. Laurel Ledbetter, speaking from the scene Friday night, said the shooter used a long gun. Police weren’t sure if it was a rifle or a shotgun.\nSeveral people were in the shop at the time, and three of the four wounded were on the scene when emergency crews arrived. All three were transported in ambulances with lights and sirens activated.\nWalker said a fourth victim who had been inside the barber shop arrived later Friday at Oklahoma State University Medical Center after he had received a ride from the scene to another location before being driven to the hospital.\nTwo of the three victims at the barber shop were shot in their legs, Ledbetter said. Liggins was shot in the torso, she said.\nDale Scott, whose wife is one of the shop’s owners, said two barbers and a customer were the gunshot victims who medical personnel encountered on scene. Scott and his wife, Lynn, had left about 15 minutes before the shooting happened.\nHe said the shop was to close at 9 p.m. but was taking care of its last customers.\nInvestigators said they have identified everyone who was inside the barber shop at the time of the shooting but have yet to interview them all. They ask those who were inside the barber shop to contact Tulsa police to arrange an interview.\nAnyone with information may contact Crime Stoppers by phone at 918-596-COPS (2677), online at bit.ly/crimestopperstips or via text message at CRIMES (274637). Text tips should begin with “Tip918.” The homicide tip line may also be reached at 918-798-8477 or emails sent to homicide@cityoftulsa.org."}