{"uri": "http://www.houmatimes.com/news/article_317363fe-f195-11e3-883c-001a4bcf887a.html", "title": "LPSO: Teen's shooting was not intentional", "dct": "Wed, 11 Jun 2014 00:00:00 GMT", "id": "b5dae76ede935e007359672b0d507540", "content": "A single bullet unintentionally fired from a foreign handgun killed 15-year-old Braxton Bourda, a star swimmer slain in the infancy of summer vacation while he rode a bicycle alongside friends.\nThat’s the narrative presented to and thus far accepted by Lafourche Sheriff’s deputies as they continue to unspool the circumstances pre-empting a mid-afternoon homicide last week in the middle of East 23rd Street in Larose.\nNeely Gardner, 19, of 176 Orange St., Galliano, was arrested on a negligent homicide charge. Gardner surrendered just after 1 a.m. Friday morning, about 11 hours after the shooting. He walked alone into an LPSO substation with the knowledge he was a “person of interest” in Braxton’s death, sheriff’s office spokesman Brennan Matherne said.\nGardner answered questions without legal representation. He told detectives the bullet fired as he tried to unload a 9mm pistol he discovered lying forsaken near a house, Matherne said. Gardner relayed that he and Braxton were friends.\nAfter the shooting, Gardner and others in the group moved Braxton’s body to the side of the road, Matherne said. They asked bystanders to call 9-1-1, and they fled the area. At some point, Gardner discarded the gun.\nDetails of Gardner’s confession meshed with the accounts of bystanders, Matherne said.\nBraxton was shot one time in the face and was pronounced dead at the scene.\nGardner, who is being held in lieu of a $250,000 bond, saw District Judge Jerome Barbera for a magistrate hearing on Monday. Gardner told Barbera he would provide his own attorney and is scheduled for arraignment on July 10 before Judge Ashly Bruce Simpson, said Leslie Richard, investigator with the district attorney’s office.\nAs of Monday afternoon, the sheriff’s office had not submitted a formal arrest report to the district attorney’s office. Ultimately, prosecutors will determine what charge, if any, is to be filed against Gardner.\nLouisiana law defines negligent homicide as the killing of a human by criminal negligence, which occurs when “there is such disregard of the interest of others that the offender’s conduct amounts to a gross deviation below the standard of care expected to be maintained by a reasonably careful man under like circumstances,” according to a separate statute.\nA conviction of negligent homicide carries a maximum sentence of five years in prison.\nAs of Monday, the gun had not been recovered. Deputies’ search for the firearm remained a priority in the ongoing investigation, Matherne said.\nThose who helped Gardner move Braxton’s body out of the road also answered detectives’ questions. Matherne declined to say how many people were in the group with Braxton and Gardner, and as of Monday, no charges were filed against anyone else. “We don’t anticipate bringing any charges (against other people) at this time,” Matherne said.\nBraxton, according to a swim coach, was a raw athlete guided by a want to be independent.\n“His future was up to him to decide. He was a very athletic swimmer; it was his to do what he wanted with,” said Erin Danos, head coach of the south Lafourche club swim team, the Hurricanes. Danos coached Braxton for the past six years.\nOn May 31, in his last swim meet, Braxton led a relay team otherwise consisting of inexperienced members to a second-place finish in one race, Danos said.\n“He is a very good butterfly-er, but he’s a very good sprinter (as well),” Danos said. “He was able to keep up with people with very little practice, he would keep up at a swim meets and beat people who would practice every day. … He was a very explosive swimmer.”\nCorey Callais, swim coach at South Lafourche, said Braxton’s talent in the butterfly was natural. As a freshman, Braxton placed in the top eight at the state track meet last November.\n“He was just so powerful,” Callais said. “As many years as I’ve been involved in swimming, I don’t know if I’ve seen a butterfly that powerful, not for someone that young.”\nCallais said Braxton exuded confidence\n“He always knew how to make you laugh,” Callais said. “He was one of those kids, you want to give him a hug at one point and at the next, you wanted to throw him in the pool. That’s Braxton.\n“Braxton was always God’s gift to women. He always joked around with the girls on the team. He was the ‘black Michael Phelps.’ He had that much confidence in himself. It showed in the pool.”\nGaye Cheramie, South Lafourche High’s principal, said she has known Braxton since the day he was born, a byproduct of living in a small, rural community.\n“He always had a smile,” Cheramie said, adding they spoke frequently in the school’s hallways. “I can still picture him on the bench, right in front of our concession area, with his friends. He always had friends around him.”\nCheramie, while careful not to comment on the scrutinized circumstances surrounding the shooting, said the tragedy perpetuates the idea her community is vulnerable to gun violence.\n“It’s sad that the potential of this young man will never be fulfilled. It’s sad, and it’s scary,” Cheramie said. “We’ve been isolated from a lot of the things going on in society today because we are a rural, close-knit community. I feel like what the rest of the country is experiencing is filtering down. … For handguns to be so readily available to children in the streets, it’s so disheartening.”"}