{"uri": "http://www.nj.com/essex/index.ssf/2013/12/third_victim_identified_in_christmas_morning_shooting_at_an_irvington_go-go_bar.html", "title": "Third victim identified in Christmas morning shooting at Irvington go-go bar", "dct": "Wed, 25 Dec 2013 18:15:00 GMT", "id": "5fedcfd4837b0ada9cbb4d09008aa772", "content": "To view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nIRVINGTON — A Christmas morning dispute at an Irvington go-go bar ended in gunfire early yesterday, leaving three men dead and two others in the hospital with gunshot wounds.\nThe men were shot at about 12:45 a.m. outside Slick’s Go-Go, an often busy nightspot located in a desolate part of Irvington at the corner of Nye Avenue and 21st Street.\nPierre Clervoyant Jr., 34, of Elizabeth, the manager and son of the owner, along with Woodley Daniel, 32, of Hillside, a bouncer at the bar, were both pronounced dead at University Hospital in Newark shortly after 1 a.m., along with a third victim, Mushir Cureton, 27, of Newark.\nEarly reports described a gray sedan speeding away from the scene.\n“It appears the gunman was trying to enter the bar armed and was stopped by the bouncer,” said Chief Anthony Ambrose of the Essex County Prosecutor’s Office, in a statement.\nPolice said two or more suspects entered the bar, but Daniel, the bouncer, told them to leave after he felt a gun while patting one of the men down. A police source who asked not to be identified because the matter is under active investigation said the man stepped back and shot Daniel and Clervoyant outside the bar.\nA 27-year-old Irvington man and 34-year-old East Orange man were also shot and taken to University Hospital. Their names were not released.\nOutside the Hillside home of Woodley Daniel yesterday afternoon, at least a dozen friends and relatives gathered, crying and hugging each other.\n“We were born several days apart,” said Noah Joseph, 32, a cousin. “Our mothers carried us in their wombs at the same time.” Joseph said Daniel was originally from Irvington and had moved to Hillside.\n“He was very loved,” Joseph said, voice cracking. “He had many nieces and nephews and he was a father to all of them. He was a good man with a heart of gold. Anyone who knows him will say that about him. He was a protector. He was a hero.”\nPierre Clervoyant Sr., who owned Slick’s, said two men came to the bar at around 12:30 a.m. He said they were denied entry because “they were clearly drunk.” His son approached the men “to calm the situation down,” as their argument with Daniel moved outside. One of the men then pulled out a gun and fired, he said, killing Daniel and Clervoyant Jr., wounding two others and fatally shooting Cureton.\n“He was trying to be the peacemaker,” said Stephanie Clervoyant, 25, the sister of the bar manager. She wore his New York Knicks pullover, gathering along with other family at their Elizabeth home.\nClervoyant lived upstairs from his parents with his wife, Candice Clervoyant — a maternity nurse at St. Barnabas Medical Center in Livingston — and their daughter Jaidyn, who turned 6 on Sunday.\n“Everyone knew Pierre because of his smile,” she said,” calling him a mentor to youth in the Haitian community. “He was better than a great father,” she said. “He was excellent. He was kind and compassionate.”\nA Facebook account for Clervoyant, a graduate of Fairleigh-Dickinson University, has a photo of his daughter as the profile picture. She sits on an ottoman, wearing flower barrettes in her hair. On both Instagram and Facebook, messages mourned the bar manager. “My prayers and condolences goes out to my Slicks family in Irvington,” read one post. “Such sad news to wake up to this morning on a day like this.”\nIn addition to managing the bar, Clervoyant worked for the city of Elizabeth, in the Office of Aging, which runs programs for seniors.\nElizabeth Mayor Christian Bollwage, reached by email yesterday, called him “A great young man who had everything going for him.”\nPierre Clervoyant Sr. says police took a computer containing footage from surveillance cameras.\nActing Essex County Prosecutor Carolyn Murray and Joseph Santiago, Irvington Police director, said Irvington Police and the Essex County Prosecutor’s Office Homicide/Major Crimes Task Force are investigating the shooting. Its Crimestoppers program announced a $10,000 reward for information that would help in the arrest and conviction of a suspect.\nThe Irvington bar has been the scene of at least two other shootings in recent years. Steven Charles, 24, of Irvington, was fatally shot after an argument outside the bar in August of 2010.\nStar-Ledger staff writers Mark Di Ionno and Lisa Rose contributed to this report.\n• Go-go bar victim in Christmas Day shooting lived in two different worlds\n• $10,000 reward being offered in Christmas Day go-go bar shooting that left 3 dead"}