{"uri": "http://krqe.com/2015/10/20/albuquerque-police-4-year-old-shot-in-the-head-i-40-at-unser-shut-down/", "title": "Road rage shooter sought for killing 4-year-old girl", "dct": "Tue, 20 Oct 2015 15:16:00 GMT", "id": "6d42915197fa6ff9cd0414ed578fd7ec", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nALBUQUERQUE (KRQE) – Police say a 4-year-old girl was shot and killed during a road rage incident on I-40 on Tuesday afternoon.\nI-40 westbound was shut down at Coors for nearly six hours. I-40 westbound has since been reopened.\nPolice are searching for a suspect’s vehicle, however, due to conflicting information they are not releasing any details and are interviewing multiple witnesses.\nTuesday night, Albuquerque’s Police Chief, Gorden Eden, made a plea to the public to help solve this case.\n“We are begging for the community’s help,” said Chief Eden. “This should have never happened.”\nNo arrests have been made at this time and Albuquerque police are requesting the public’s help; if anyone has any information, they are urged to call 242-COPS or Crime Stoppers. Police are looking for information on:\nRoad rage incident that occurred at about 3 p.m.\nOccurred on I-40 westbound starting east of Coors possibly by Rio Grande\nInvolving a vehicle in the westbound lanes that cut off other cars\nOfficers said a Bernalillo County Sheriff’s deputy was first on scene, spotted a disabled vehicle and stopped to help. There, a frantic father said his 4-year-old daughter was shot during a road rage incident.\n“I’ve seen tragic loss of children in car crashes,” said Chief Eden. “To me, this is one of the crimes which is unexplainable.”\nSo far, no one has explained how this all started. Detectives said the suspect likely fired off shots while driving.\n“This is a complete disrespect of human life,” said Eden.\nPolice closed westbound I-40 at Coors for about six hours, as they searched the interstate for evidence.\nSky News 13 shows a pickup truck stopped along with other cars. Officers have not said which vehicle belongs to the victims.\nPolice said several people stopped to help. The little girl’s family rushed to the hospital.\n“We owe them the highest degree of respect and a time for the family to be together,” said Chief Eden. “It’s a terrible tragic loss. We should never see these incidents happen in our community.”\nThe chief expressed anger that anyone would pull a gun on the road, and has a message for the shooter. “The best thing for you to do is to turn yourself in,” said Chief Eden.\nAlbuquerque Police said they have been getting calls and are following up on any information they receive.\nPress Conference Video\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nSky News 13 Video\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}