{"uri": "http://www.beaumontenterprise.com/neighborhood/fortbend/news/article/Couple-children-dead-in-apparent-murder-suicide-7257662.php", "title": "Couple, children dead in apparent murder-suicide in Katy area", "dct": "Wed, 20 Apr 2016 00:00:00 GMT", "id": "a8467f791478a6dc152799fca4d4350f", "content": "Jeremy and Natalie Srinivasan had lived in Katy's Grayson Lakes subdivision for almost 10 years. They often walked the quiet neighborhood with their two young children. They were known by their neighbors as a normal, kind couple.\nSo it came as a surprise to neighbors that the couple and their two children were found shot to death in an apparent murder-suicide Tuesday morning at their home in the 1300 block of Longdraw Drive.\n\"They were a lovely family. It's a great tragedy. A total shock,\" said neighbor Amy Ballog. \"Their kids played with all the neighbor kids, they went on family walks. … They came out to Super Bowl parties and crawfish boils.\"\nOfficials with the Fort Bend County Sheriff's Office found the family around 9:30 a.m. after a welfare call from a family member. They haven't officially determined who pulled the trigger, spokesman Bob Haenel said. Authorities could not immediately provide a motive for the slayings.\nNeighbors said they did not hear any gunshots.\nJeremy Srinivasan, 37, was from the Katy area, neighbors said, and his 35-year-old wife had moved from her home in Chicago. Jeremy Srinivasan owned the LED Shop of Texas, a light supply store in Richmond, according to his LinkedIn page.\nFacebook photos show their curly-haired 5-year-old daughter reading a story to her 2-year-old brother, and the couple eating crawfish while their kids play on a playground nearby.\nMost neighbors knew Natalie, and said Jeremy was more reserved. Tracee Dugal said she was best friends with Natalie, who did her hair.\nDugal said she knew the family kept guns locked in the house.\n\"She was very spiritual,\" Dugal said of the dead woman. \"If I had problems I would call her and she would send me scriptures, come take me out,\" Dugal said. \"She was a sweet, sweet soul.\"\nNext of kin for both adults have been notified, the sheriff's office said.\n\"We're interviewing neighbors and family members and others to try to piece together exactly what took place here. We're investigating this right now as a murder-suicide,\" Fort Bend County Sheriff Troy Nehls told KPRC. \"Anytime you have children involved like this. It hits close. It's hard.\""}