{"uri": "http://www.thenewstribune.com/news/local/crime/article53513175.html", "title": "Lakewood man charged with giving nephew gun used to kill 13-year-old", "dct": "Thu, 07 Jan 2016 10:47:00 GMT", "id": "3e2bfdcc318b3787f7727659d821c356", "content": "A Lakewood man has been charged with giving his teenage nephew a revolver later used to kill a 13-year-old friend.\nRichard Gastelum, 21, pleaded not guilty Wednesday to a charge of delivery of a firearm to an ineligible person and was ordered jailed in lieu of $60,000 bail.\nPierce County Superior Court Commissioner Meagan Foley ordered him not to have contact with his nephew, 17-year-old Adonis Brown.\nBrown is charged with second-degree manslaughter and unlawful possession of a firearm in the Oct. 20 shooting of Alexander Demello, who died days after being shot in the face.\nDemello and his 14-year-old brother were walking with Brown in a wooded area in the 15000 block of Woodbrook Drive Southwest near Joint Base Lewis-McChord when the boy was shot, police said.\nThe victim’s brother told police he heard a shot, turned around and saw Demello on the ground. Brown ran away because he had a warrant and later gave a friend a backpack with bloody clothing inside, according to charging papers.\nWhen the friend realized what was inside, he turned it over to police.\nDetectives arrested Brown at his girlfriend’s house. He told police the shooting was an accident.\nHe said he found the weapon under some brush during the walk. He said he didn’t realize it was loaded, “fidgeted with it” and the gun went off, records show.\nBrown initially told police he left the gun at the scene and then said he discarded it near a sign.\nHis girlfriend told detectives she thought Brown got the gun from his uncle because he went somewhere with Gastelum and came back with the revolver.\nA family friend told police Brown asked for a ride to buy a .22-caliber gun. Another witness told detectives Gastelum admitted he gave the gun to his nephew.\nPolice tried to interview Gastelum after Demello died but were unable to find him. He was arrested Tuesday after a security officer recognized him in municipal court.\n“We want to hold him responsible for giving somebody a gun that was later used in a crime,” Lakewood police Lt. Chris Lawler said.\nStacia Glenn: 253-597-8653"}