{"uri": "http://www.dnainfo.com/chicago/20140603/south-shore-above-79th/south-shore-strip-mall-shooting-leaves-six-people-wounded", "title": "Police Have Video Footage of Mass Laundromat Shooting in South Shore", "dct": "Tue, 03 Jun 2014 10:11:00 GMT", "id": "ebadc596b16d588a27661fea01a0cab1", "content": "SOUTH SHORE — Chicago Police have video surveillance footage of a mass shooting at a South Shore laundromat, and it shows a lone gunman opening fire \"without any sort of provocation,\" Police Supt. Garry McCarthy said Tuesday.\nThat lack of provocation leads police to believe the shooting that left six people wounded — including two teens — could be gang-related.\n\"It kind of fits that pattern that we're accustomed to seeing, but we haven't really made that determination,\" McCarthy said. \"For all we know, this could be a fight over a girl.\"\nAll six of the victims are expected to survive, and three already have been released from the hospital, he said.\nMcCarthy told reporters Tuesday morning police recovered video of the shooting and said the gunman appeared to open fire \"without any sort of provocation.\"\nThe gunman walked up to group of people in the 2600 block of East 79th Street and began firing a handgun at them, police said.\nSix people, ages 14 to 52, were shot. McCarthy said some of those wounded are known gang members, but he did not elaborate.\nMcCarthy said there are at least five ongoing gang conflicts in the South Chicago police district where the shooting took place.\nTuesday morning, blood, shattered glass and a small slipper were in the parking lot of a strip mall in the 2600 block of East 79th Street, marking the spot where the gunman opened fire Monday evening.\nThe doors of the strip mall's laundromat were boarded up, and discarded police tape and medical supplies littered the ground. But inside, the place again bustled with neighborhood residents washing their clothes.\nThe strip mall sits on the north side of East 79th Street, the border between the city's South Shore and South Chicago neighborhoods.\nFour people — including a 14-year-old boy, a 16-year-old boy, a 27-year-old woman and a 52-year-old man — were all shot in their legs, police said. A 41-year-old man was shot in his elbow, and a 42-year-old man was shot in his hand.\nThe 14-year-old boy was taken to University of Chicago Comer Children's Hospital, and the 16-year-old was taken to Advocate Christ Medical Center in Oak Lawn, police said. The rest were taken to area hospitals.\nMcCarthy said all those wounded in the shooting were cooperating with police.\n\"But they don't really have a whole heck of a lot to give us,\" McCarthy said. \"Most of these folks didn't even see what happened.\"\nWhile waiting on a load of laundry, Jesse Hayes said he was shocked at news of the shooting.\n\"You always hear the sirens, but I didn't know it was like that until I saw the news this morning,\" he said.\nCustomers like Hayes, who lives just a block away, said the shooting left them rattled.\n\"It's jacked up. You can't even do your laundry,\" Hayes said. \"They need to up the police patrols.\"\nZeke Herrera, who said he comes to the laundromat at least once a week, said he was shocked at the timing of the shooting.\n\"On a Monday of all things,\" he said. \"Friday, by now, the mindset is you stay inside. But you shouldn't have to live like that.\"\nHerrera, who said he lives just a couple blocks away, also said he's no stranger to the sound of gunshots, but Herrera said Monday's shooting felt too close.\n\"This is my home. This is where I live,\" he said. \"I'm feeling very afraid that it's going to be me next time.\"\nBut many customers in the laundromat Tuesday morning said the shooting would not stop them from returning to the business. It's the closest option for many in the neighborhood.\nOne man, who declined to be named, said he still feels safe in the neighborhood.\n\"It's not gonna change nothing about what I do,\" he said. \"Nobody died up here last night, and they'll all be back this evening.\"\nWhen asked by a reporter what he planned to do about gang violence in South Shore and South Chicago — an area known as \"Terror Town\" — McCarthy said the department would continue with its gang reduction strategy.\n\"There's no magic formula here,\" he said. \"It's hard work, and it's intelligence-based, getting in between these conflicts and preventing the next shooting.\"\nAs of Tuesday afternoon, no one was in custody in connection with the shooting.\nFor more neighborhood news, listen to DNAinfo Radio here:"}