{"uri": "http://www.nbcwashington.com/news/local/Suspect-Arrested-in-Fatal-Shooting-of-2-Maryland-High-School-Students-Sources-Say-399494871.html", "title": "Suspect Arrested in Fatal Maryland Shooting of 14-Year-Old Boy", "dct": "Tue, 01 Nov 2016 15:50:00 GMT", "id": "9cafdc383d5995bbb502404f86710e28", "content": "Prince George's County Police Department\nA second shooter is believed to have shot Kevin Davis, an 18-year-old high school senior.\nPolice have made an arrest in the Capitol Heights, Maryland, shooting that left two high school students dead and four other people injured.\nBravon Freeman, 22, was charged in the killing of 14-year-old Todd James Webb, Prince George's County police said Tuesday afternoon.\nWebb and Brian Davis, 18, died after gunfire rang out early Sunday in the parking lot of an apartment complex on the 6800 block of Walker Mill Road.\nPolice believe that another shooter killed Davis, they announced Tuesday.\nAccording to the preliminary investigation, Freeman, Davis, Webb and four other people were gathered outside the apartment building around a game of dice, police said.\n\"For a reason which remains under investigation, a suspect or suspects began to shoot into the group,\" police said in a statement.\nDavis was killed in that initial shooting, police said.\nSeveral minutes later, detectives believe Freeman went inside the apartment building, retrieved a gun and shot and killed Webb.\nPrince George's County police arrived about 2:45 a.m. Webb and Davis were pronounced dead at the scene, one man received life-threatening injuries, another person was hospitalized with less serious injuries and two other people were treated at a hospital and released, police said.\nFreeman was arrested at the scene.\nTwo teenagers including a 14-year-old and 18-year-old, were killed and four others injured in a shooting in Capitol Heights, Maryland. News4's Derrick Ward reports. (Published Sunday, Oct. 30, 2016)\nDavis lived in Northwest D.C. and was a senior at Roosevelt Senior High School. He wanted to join the military, his grandfather told The Washington Post.\nWebb was a freshman at Suitland High School in Forestville, Maryland. He was shot just steps from his front door. He dreamed of being a professional football player, a cousin and a friend told the Post.\nAnyone with information about this case is asked to call police at 301-772-4925. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), text \"PGPD\" plus their message to CRIMES (274637) , or go to www.pgcrimesolvers.com to submit a tip online. A reward of as much as $25,000 is offered.\nStay with News4 for more details on this developing story."}