{"uri": "http://www.firstcoastnews.com/news/crime/police-say-landing-art-walk-shooting-likely-linked-to-northside-gang/386710736", "title": "Police say Landing, Art Walk shooting likely linked to Northside gang", "dct": "Tue, 17 Jan 2017 00:00:00 GMT", "id": "1a96845c3b3e0e0996588d5232a3ff81", "content": "JACKSONVILLE, Fla. - A shooting outside the Jacksonville Landing that killed one and injured another Monday was in retaliation to the Art Walk shooting that happened earlier this month, the Jacksonville Sheriff's Office said.\nA 16-year-old and a 13-year-old were shot outside the front entrance of the Landing around 4 p.m. Both teens were taken to a local hospital, but the 16-year-old, identified as Khamoi Petersen, passed away, JSO said.\nAt a press conference Tuesday, Sheriff Mike Williams announced that they believe this shooting was an act of revenge for the January 4 Art Walk shooting that injured two teens. He also said it's likely linked to a Northside gang.\nREAD MORE | Two teens shot, one dead in shooting at the Jacksonville Landing\nHe said everyone involved in the shooting knew each other, though the shooting itself was random.\nJSO believes the most recent downtown shooting at The Landing is connected to the Art Walk shooting from 2 wks ago. Details on #GMJ\n— Shelby Danielsen (@NewsShelby) January 17, 2017\nAuthorities are searching for a suspect or suspects and they are questioning about 30 witnesses, including the parties involved. However, police say those involved in the shooting are not cooperating with police. There is no suspect description at this time.\nSheriff Williams said JSO plans to meet with downtown officials to discuss options to help keep people safe, including a possible curfew.\n\"It's an option, we're going to discuss it,\" Williams said. \"We'll come up with something that works for everybody.\"\nWilliams said they also plan to discuss whether or not businesses should team up with JSO when it comes to properly patrolling the area.\nIf you or someone you know, knows anything about this shooting, please call the sheriff's office at 904-630-0500. To remain anonymous and receive a possible cash reward, call Crime Stoppers at 1-866-845-TIPS.\n(© 2017 WTLV)"}