{"uri": "http://www.trentonian.com/article/TT/20161118/NEWS/161119722", "title": "PROSECUTORS: Man shot dead on Genesee Street", "dct": "Fri, 18 Nov 2016 13:44:00 GMT", "id": "7cbab3ea9cba2fc1461844d6d064fa17", "content": "Scott Ketterer - The Trentonian\nHAMILTON >> The Mercer County Homicide Task Force is investigating a homicide in the township.\nThe Mercer County Prosecutor’s Office confirmed the death which occurred around Friday morning. The office reports that Kelvin Watford, 50, of Willingboro, died after being shot inside of a Genesee Street residence at 11:23 p.m..\nA female friend of Watford’s called 911 reporting she had shot an intruder inside of her home, then discovered that she had shot Watford in the chest.\nWatford was pronounced dead at the scene.\nAdvertisement\nInvestigators say Watford was trying to surprise the woman, as she was on the phone with Watford at the time of the shooting.\nShe heard noises in the house and grabbed her gun, fearing that there was an intruder in the home. She told investigators that she saw a shadow in the hallway and fired one shot.\nBy 8:00 a.m. the scene appeared to have been cleaned up and there did not appear to be any further police activity.\nOfficials say that the death appears to be accidental.\nThe fatal shooting occurred about a block away from Hamilton High West, and children were seen walking to school in the otherwise quiet neighborhood.\nThis marks the fourth homicide in the township this year. In March Michael DiMattia was shot to death inside of his Estates Boulevard apartment; three people have been arrested in his killing. On August 13, Dominic M. Neal, was shot and killed by off-duty corrections officer Niam Camp after he attempted to enter the home on Vicky Court in the early morning hours. That incident is still being reviewed as to whether or not it was a justifiable homicide.\nOn Sept. 12, Deja Farrior, of Trenton, was killed when her vehicle was struck by a vehicle following a police chase that has become the subject of much scrutiny in the township. Chandler Heaviside, 22, of Jackson, who has a history of run-ins with police was arrested and charged with vehicular homicide in Farrior’s death."}