{"uri": "http://www.king5.com/story/news/local/kent/2015/05/20/persons-of-interest-in-kent-drive-by-shooting-/27681289/", "title": "Persons of interest in Kent drive-by shooting in custody", "dct": "Wed, 20 May 2015 00:00:00 GMT", "id": "dbd78b8e8222e0dac3e61fceb5cd8e41", "content": "KENT, Wash. -- Kent police say four people of interest in the Kent drive-by shooting that left a one-year-old baby dead have been arrested on unrelated charges and warrants.\nAccording to Kent Assistant Police Chief Derek Kammerzell, last Friday detectives served a \"high risk search warrant\" at a residence in Kent, where the occupants were believed to be related to gangs.\nNumerous phones and four guns were seized. Three of those guns were confirmed stolen and associated with felons who lived at the residence. Other \"significant\" evidence related to the case was also seized.\nKammerzell says the four people in custody have counsel and are not giving any statements related to the case.\nKent police say they have five detectives working exclusively on the case, in addition to detectives with the Special Investigative Unit and other departments. Kammerzell says 17 search warrants have been written and executed in the case so far, with more to come.\nThe drive-by shooting happened on April 16 in Kent. One-year-old Malijah Grant, who was riding in the back seat of the car with her parents, was hit by gunfire. She died two days later.\nKent Chief of Police Kent Thomas said the shooting is tied to gang activity and has been linked to 12-15 other shootings that have occurred along a stretch from Seattle to Tacoma.\nAfter reviewing surveillance video, police identified two vehicles related to the case. Based on a tip from a citizen, police recovered what they believe to be the suspected vehicle - a dark blue 2014 Chevy Cruze.\n\"We believe there are people out there with additional information about this crime. We know there were additional witnesses who have not come forward yet,\" Thomas said.\nPolice ask anyone who was near the Safeway Store at Meeker Street and Lake Fenwick on April 16 to call the tip line if you recall anything from the afternoon. That number is 253-856-5808."}