{"uri": "http://www.chron.com/neighborhood/spring/news/article/Death-penalty-trial-set-for-man-accused-in-Spring-9186401.php", "title": "Man accused in Spring family massacre will face death penalty", "dct": "Fri, 26 Aug 2016 00:00:00 GMT", "id": "25a181624dcd65e7f4894ef472fba137", "content": "A man charged with capital murder in the execution-style shootings of six members of a Spring family in 2014 will face the death penalty, according to attorneys connected to the case.\nRonald Haskell, 36, of Utah, is set to stand trial in the fall of 2017, according to Harris County Assistant District Attorney Kaylnn Williford.\nTHE CRIME: 6 members of Spring family shot to death in likely domestic dispute\nProsecutors and defense attorneys updated state District Judge Kent Ellis during a court hearing Friday, but Haskell did not appear in court.\nOutside the courtroom, defense attorney Doug Durham confirmed reports of Haskell's mental health issues and said those problems would likely be part of the defense. He said little else about the defense or mitigation.\nDETAILS: Prosecutor say suspect in Spring family slaying shot victims 'execution-style'\nHaskell is accused of slaying Katie and Stephen Stay and their children Bryan, 13; Emily, 9; Rebecca, 7; and Zach, 4. Another daughter, Cassidy, 15, also was shot, but survived.\nThe case made national headlines after Haskell, disguised in a FedEx uniform, allegedly pushed his way into the Stay residence where Cassidy Stay was home alone. He then bound the teen, and other members of the family as they arrived home. Haskell demanded to know the whereabouts of his ex-wife, Katie Stay's sister, then shot them all in the head.\nInvestigators said Haskell was trying to find out the location of his estranged ex-wife, a woman who apparently left him after several episodes of domestic violence.\nOn his initial appearance in court two days after the shooting on July 9, 2014, Haskell collapsed as an assistant district attorney described the crime he is accused of committing.\nAfter that, Durham outlined a possible insanity defense, saying Haskell suffered from mental illness, and was not on his medication when the crime occurred.\nHaskell remains in the Harris County Jail without bail."}