{"uri": "https://usgunviolence.wordpress.com/2013/06/24/mass-shooting-killed-carlton-lewis-kansas-city-mo/", "title": "Mass Shooting – Killed – Carlton Lewis (Kansas City, MO)", "dct": "NODATE", "id": "cdfb2a22658ab4826907f1e978fd496e", "content": "Two women visiting Kansas City took a wrong turn, stopped for directions and ended up getting shot when a gunman opened fire on two men talking to the visitors, police said Tuesday.\nThe visitors had stopped at a liquor store at 18th Street and Benton Boulevard before driving into a housing complex and ending up in the 1700 block of Kansas Avenue. After getting directions from Lewis and a second man, they lingered to chat with them in the parking lot, police said. The women remained in the car and the men were outside the vehicle, police said.\nSuddenly a gunman on foot opened fire, killing Lewis and critically wounding the other man. The women heard gunshots and their car window shattered. The driver noticed she had been struck in the arm and her passenger in the neck.\nThe women sped away and stopped for help in a McDonald’s parking lot near 14th Street and Prospect Avenue. They are expected to survive.\n2013 Homicide Victim: Carlton L. Lewis, B/M, 27 yrs old On 06/24/2013 at approximately 9:18 pm, Carlton Lewis was discovered deceased from apparent gunshot wounds in the parking lot of the Sycamore Groves Apartments (1711 Kansas Avenue). Anyone with information about the homicide is urged to call the TIPS Hotline at 816-474-TIPS (8477), or contact Det. Rodney Haney, the case detective, KCPD Homicide Unit, 816-234-5043.\nhttp://www.kansascity.com/2013/06/25/4313317/women-shot-in-kc-had-stopped-for.html\nhttp://fox4kc.com/2013/06/25/family-of-shooting-victim-pleads-to-stop-the-violence/\nhttp://www.kshb.com/news/crime/kansas-city-police-investigating-incident-where-three-were-shot-one-fatally\nhttp://www.legacy.com/obituaries/kansascity/obituary.aspx?pid=165563477\nhttp://www.legacy.com/obituaries/kansascity/obituary.aspx?n=carlton-l-lewis&pid=165548588&fhid=16400"}