{"uri": "http://www.abc12.com/home/headlines/Mid-Michigan-man-faces-charges-after-3-year-old-son-shoots-himself-378684951.html", "title": "3 year old who accidentally shot himself found gun under couch", "dct": "Mon, 09 May 2016 17:12:00 GMT", "id": "a554766338821f6c74629db551754b3a", "content": "GLADWIN COUNTY (WJRT) - (05/09/16) - A Mid-Michigan father is facing criminal charges after his 3-year-son shot himself.\nProsecutors tell us the father was using the gun as a flashlight and didn't put it away.\nTwenty-three-year-old Josh Dikowski faces child abuse and careless discharge charges after his son was shot.\nThe incident happened at a home in the Kerswill Lake area of Gladwin County. According to the police report, Dikowski told police the night before the shooting, he went to check his mail using the flashlight mounted on his 9 millimeter semi-automatic handgun.\n“I wouldn't guess that is not standard protocol throughout Gladwin County,” said Sheriff Mike Shea.\nShea says when Dikowski went back into the home, he placed the gun under a couch, thinking his son wouldn't be able to find the weapon. Dikowski told investigators he does have a gun safe where the handgun is usually kept.\n“The idea that you can actually put it somewhere loaded, where it’s safe, not when there is a child in the house, there is no place safe,” Shea said.\nThe next day, Dikowski fell asleep watching cartoons with his son. A loud pop woke him up and he noticed his son's left arm had a bullet wound and immediately drove him to the hospital.\nDikowski wouldn't comment on the charges, but says his son is doing fine.\nShea says anyone purchasing a firearm should look into buying gun safety products, like safes and trigger locks. Before bringing a gun into a home, they should think about three things.\n“Safety, safety, safety,” Shea said. “There is a lot of different things out there on the market that can keep these weapons safe, especially when it comes to younger children.”\nDikowski is free on a $2,500 bond and his bond conditions state he cannot have any firearms in the house while he cares for his son."}