{"uri": "http://www.tennessean.com/story/news/local/davidson%20/2016/03/01/police-respond-triple-shooting-east-nashville/81145026/", "title": "Teen, peeved at getting up for school, shoots family", "dct": "Tue, 01 Mar 2016 00:00:00 GMT", "id": "be7a7746559e703a5337c764a70e02d0", "content": "George Walker IV / The Tennessean\nAn argument over getting out of bed for school Tuesday morning led a teenage boy to open fire on four family members, including his grandmother and two young children, in an East Nashville home, Metro police said.\nNashville police spokeswoman Kris Mumford said that shortly before 7:17 a.m. a relative was attempting to wake up the 16-year-old boy inside his home at Berkshire Place Apartments on Porter Road when an argument broke out.\n\"There was a quarrel about getting up and getting ready for the day when (at some point) the 16-year-old ran to a closet, got a 9 mm handgun and started firing,\" Mumford said.\nBullets struck the teen's 67-year-old grandmother twice, and his 12-year-old sister and 6-year-old nephew were both grazed by gunfire. The teen's nephew is his older sister’s son, Mumford said.\nThe teen also tried to shoot his 42-year-old mother in the living room of the home, but Mumford said the woman ducked behind a couch and avoided being hit.\nThe teen's 2-year-old sister was also in the home when the gunfire broke out but she was not struck by bullets, Mumford said.\nThe teen then fled the home on foot and tossed the gun at a nearby apartment.\nPolice responded and six nearby schools, including Cora Howe School — a polling location for Tennessee’s primary elections — were placed on lockdown, Metro Schools spokesman Joe Bass said.\nPolice eventually recovered the handgun and captured the teen walking in the 1500 block of Straightway Avenue near a set of railroad tracks.\nThe teen's grandmother was transported to Vanderbilt University Medical Center where she is expected to recover. The two children were being treated at Monroe Carell Jr. Children's Hospital at Vanderbilt. No one else was struck by gunfire.\nMumford said the teen's family told officers they were not aware the firearm was in the closet.\nShe said investigators plan to test the gun in an attempt to track where it came from.\nAs of Tuesday afternoon, police had not released the boy's name. Police say he refused to talk to domestic violence detectives.\nThe boy has been charged in Juvenile Court with four counts of attempted homicide and one count of reckless endangerment.\nMumford said the teen attends Johnson Alternative Learning Center and although he has a misdemeanor arrest history, his record does not include violent crime.\nThe triple shooting comes on the heels of the city seeing a drastic surge in lethal youth violence in 2015.\nOf the 75 criminal homicides last year, 20 of the victims were teenagers or younger — the highest number of youth deaths to hit Nashville in the past decade. The teens all died as a result of gunfire.\nAs law enforcement and community leaders struggle to understand the trend of lethal youth violence, Nashville Mayor Megan Barry vowed in December to create a new action plan on the issue by the spring.\n“Fortunately, these were non-life-threatening injuries,\" Mumford said Tuesday. \"These are disturbing actions as the community as a whole is addressing youth violence. It’s going to take all of us working together to try and dissuade people from using this kind of violence.\"\nReach Natalie Neysa Alund at 615-259-8072. Follow her on Twitter @nataliealund."}