{"uri": "http://www.mlive.com/news/detroit/index.ssf/2016/07/dad_whose_daughter_killed_brot.html#incart_river_home", "title": "Dad whose daughter killed brother with shotgun guilty of manslaughter", "dct": "Mon, 11 Jul 2016 18:30:00 GMT", "id": "afbff5426accc9eade4e157158735079", "content": "DETROIT -- A father whose daughter found a loaded shotgun in his unlocked bedroom closet and fatally shot her brother was found not guilty of second-degree murder last week.\nBut Christopher Head, 45, of Detroit, was convicted of manslaughter, and could serve up to 15 years on that charge alone. As a fourth-offense habitual felon, he could face an even lengthier prison sentence.\nHead was also found guilty of negligent manslaughter, second-degree child abuse, being a felon in possession of a firearm, possessing a short-barreled shotgun and felony firearm.\nHis attorney, Byron Pitts, said the verdict reinforces what he's previously said, that the second-degree murder count filed by Wayne County Prosecutor Kym Worthy's office is an example of \"improper\" overcharging.\nPitts said the verdict shows the jury agreed.\nThe 11-year-old girl with the word \"Love\" written in flower letters on the front of her pink shirt cried at times and spoke softly about the day she accidentally shot her 9-year-old brother in the head with her dad's shotgun.\nHead's daughter, now 11, took the stand during the brief but emotional two-day trial last week.\nThe girl, whom MLive isn't naming because she's a minor, admitted to shooting her 9-year-old brother, Daylen M. Head, after finding a loaded shotgun in her father's closet Nov. 9.\nThe gun was located feet from the video game console at the foot Head's bed.\nThe girl testified: Dad \"told me to go upstairs and do my hair because he was trying to take care of some business.\"\nUpstairs, she found Daylen playing \"a shooting game\" in her father's bedroom.\n\"I went back in the room to check on him,\" she said. \" ... And I went in my dad's room and I stand there. I say, 'Can I play?'\n\"He said, 'Yeah,' and so it was still his turn, and I said, 'Do you want to act it out?'\"\n\"So I went in the closet to get the gun,\" Head's daughter said. \"And he's standing up and I start waving the gun up and down, and then it jerked down, and then I tried to, like, pull it up and the gun went off.\"\nChristopher Head, a 45-year-old Detroit father, didn't pull the trigger; he wasn't even in the room. Still, Head been convicted in the murder of his 9-year-old son, Daylen.\nThe father went to great lengths to try and keep his daughter from having to testify about the tragedy, Pitts said.\nHe previously pleaded guilty to second-degree murder and the other charges with the hope that his daughter would not be forced to testify publicly about killing her brother.\nThe Wayne County Prosecutor's Office agreed to the deal, which called for Head to serve a maximum of six years in prison, but Wayne Circuit Judge Dana Hathaway threw out the plea deal and ruled the case would have to go to trial.\nPitts said he has some theories about why the deal was scratched at the last minute but declined to speculate publicly.\n\"I think it was wrong to charge him and to subject this child to this kind of environment,\" Pitts said last week. \"She's a child. She feels horrible about what happened. To only pile onto this child's psyche, I think is just deplorable.\"\nHathaway is scheduled to sentence Head at 9 a.m. July 21.\nHead pleaded no contest to extortion and aggravated stalking and had an arson charge dismissed in 2006, according to Wayne County online records. He was found guilty of illegally carrying a concealed pistol in 1989 and cocaine possession in 1994."}