{"uri": "http://www.mlive.com/news/detroit/index.ssf/2016/07/girl_describes_accidentally_ki.html#incart_river_home_pop", "title": "Girl describes accidentally killing brother while mimicking video game", "dct": "Fri, 08 Jul 2016 20:50:03 GMT", "id": "dcd0896110541d2482936c94627ac9b3", "content": "The 11-year-old girl with the word \"Love\" written in flower letters on the front of her pink shirt cried at times and spoke softly about the day she accidentally shot her 9-year-old brother in the head with her dad's shotgun.\nWayne County prosecutors called the girl to testify in court Wednesday, hoping her testimony would help convict her father, Christopher Head, of second-degree murder and other crimes stemming from the death of his son, Daylen Head.\nAfter two days of testimony, a 12-person jury began deliberations Wednesday afternoon.\nHead, a 45-year-old convicted felon from Detroit who can't legally own a firearm, is accused of allowing his children to play video games at the foot of his bed, feet from an unlocked closet where he kept a loaded shotgun leaning against the wall.\n\"Who's this guy here sitting in the white suit,\" was one of Wayne County Assistant Prosecutor Michael T. Woodyard's first questions to the girl.\n\"My dad,\" she said sheepishly.\nWhen testimony in the first day of trial concluded Tuesday, a father stood with tears in his eyes and watched the jury exit the courtroom in a single-file line. Christopher D. Head, 45, of Detroit, faces a second-degree murder charge stemming from the Nov. 9 shotgun death of his son, 9-year-old Daylen Head.\nThe girl, whom MLive isn't naming because she's a minor, was granted immunity from criminal prosecution in exchange for her testimony.\nWith a pink headband in her black hair, she talked about swimming with Daylen, cousins and friends and \"having fun\" at a hotel party before returning to her father's home on Barton Street in a high-crime Detroit neighborhood the night before Daylen's death. They played some more and fell asleep.\nOn Nov. 9, the siblings awoke, ate cereal and \"played a little bit,\" she said.\nHer dad \"told me to go upstairs and do my hair because he was trying to take care of some business.\"\nShe went upstairs and found Daylen playing a video game, \"a shooting game,\" in her father's bedroom, she testified.\n\"I went back in the room to check on him,\" she said. \" ... And I went in my dad's room and I stand there. I say, 'Can I play?'\n\"He said, 'Yeah,' and so it was still his turn, and I said, 'Do you want to act it out?'\"\nAt this point in her testimony, the girl's father had become visibly and audibly emotional.\n\"Man, why is you doing this to her,\" he interrupted.\n\"Stop,\" presiding Wayne Circuit Judge Dana M. Hathaway quickly told Head multiple times.\nThe girl, after being offered a break, declined and continued speaking with a box of tissues to her side.\n\"So I went in the closet to get the gun,\" Head's daughter said. \"And he's standing up and I start waving the gun up and down, and then it jerked down, and then I tried to, like, pull it up and the gun went off.\"\nAfter the shooting, Head told Detroit police he told his children repeatedly, \"like a broken record,\" never to go into his closed closet.\nHis daughter on Wednesday said her father never spoke to her about the gun.\nWhen it came time for cross-examination, Byron Pitts Jr., who is representing the father, lightened the mood.\nHe asked a few brief questions, nothing related to the shooting death of her brother. He asked the girl about entering fifth grade this upcoming school year and a recent vacation to visit relatives in St. Louis.\n\"I tell you what, you have a wonderful summer, OK?\" Pitts concluded.\n\"Yes,\" she replied.\nThe girl's mother met her daughter as she walked away from the witness stand, placing her right arm around the girl, pulling her close and pressing her daughter's head against her shoulder.\nPitts during closing arguments pointed out the girl \"has to wake up every single day and realize that she killed her brother, and if the prosecution has its way, that she helped convict her father.\"\nThe young girl's potentially incriminating testimony was delayed for more than an hour Wednesday after concerns arose about her receiving immunity.\nThe judge appointed defense attorney Lillian F. Diallo to represent the girl, but Diallo told the court she wasn't given access to speak to her by prosecutors, nor the girl's mother.\n\"I feel like I've been just blocked ... ' Diallo told the judge, adding she wasn't even able to review the immunity order with the witness. \"... I'm not trying to be the heavy, but I've just never had this much opposition in my life ... She's 11, for the love of God.\"\nHathaway reviewed the law and determined there is no requirement the juvenile meet with an attorney prior to testifying if there is an immunity order, since there will be no criminal liability.\nHead went to great lengths to try and keep his daughter from having to testify about the tragedy, his attorney said.\nHe previously pleaded guilty to second-degree murder and the other charges with the hope that his daughter would not be forced to testify publicly about killing her brother.\nThe Wayne County Prosecutor's Office agreed to the deal, which called for Head to serve a maximum of six years in prison, but Hathaway through out the plea deal at the sentencing and ruled the case would go to trial.\nHead is charged with second-degree murder, involuntary manslaughter, second-degree child abuse, possession of a firearm by a felon, felony use of a firearm and possession of a short-barreled shotgun.\nWithout a plea deal, he faces up to life in prison.\n\"I think it was wrong to charge him and to subject this child to this kind of environment,\" Pitts said Wednesday. \"She's a child. She feels horrible about what happened. To only pile onto this child's psyche, I think is just deplorable.\""}