{"uri": "http://www.springfieldnewssun.com/news/news/crime-law/report-child-4-hit-in-apparent-drive-by-shooting-i/nsPx5/", "title": "Man admits guilt in shooting 4-year-old in head with BB gun", "dct": "Sat, 28 Jan 2017 14:48:12 GMT", "id": "df7756b329622e554a8fdd13024f4f41", "content": "0\nURBANA —\nUPDATE @ 8:55 a.m. (Oct. 31)\nChad King Jr. is due to be sentenced after admitting he was the shooter in a drive-by incident in which a 4-year-old was struck in the head with a pellet or BB.\nKing entered a guilty plea to assault in Champaign County Municipal Court and he is scheduled for sentencing Nov. 9.\nOfficials said as part of the plea agreement, the charge of obstructing official business will be dismissed upon payment of court costs.\nUPDATE @ 11:03 p.m. (Sept. 7): The mother of the 4-year-old who was shot in the head a week ago in a drive-by outside their home in Urbana said the family possibly could have gotten a better look at the suspect vehicle had there been streetlights in the neighborhood.\nThe street in Urbana where police said Maci Clay was shot by someone who used an airsoft pellet or BB rifle is pitch black and her mother, Sarah Clay, said the family has been victimized by thieves because it’s so dark in the neighborhood.\nShe wants street lamps in the neighborhood.\nWednesday night, Urbana City Council President Marty Hess told News Center 7’s Caroline Reinwald that streetlights can cost thousands of dollars and getting them installed takes time.\n“We have to contact Dayton Power & Light, we have to contact the property owners, we have to contact our engineer to find out where the properties are and who has the right-of-way,” Hess said. “And then we have to find a time for DP&L to come set poles and run electric lines, so it’s not an overnight process unfortunately.”\nNonetheless, Clay said she will keep fighting for street lights to make her neighborhood safer.\nSee Reinwald’s TV report, which accompanies this update.\nUPDATE 12:30 p.m. (Sept. 6): The man accused in several BB gun shootings in Urbana pleaded not guilty to multiple charges in Champaign County Municipal Court on Tuesday.\nChad King Jr. is charged with assault and obstructing official business.\nHe posted bond and was released. He also has been ordered by the court to reside at his Columbus address not to contact the victim.\nA 9 p.m. curfew for King also was set by the court.\nUPDATE 7:23 a.m. (Sept. 2): Maci Clay and her older brother were watching their father take out the trash on Wednesday evening when she was struck by a pellet gun shot from a moving car.\nOne of the pellets hit her on the right side of the skull, and she was transported to Urbana Mercy Memorial Hospital for treatment. They told police they saw a silver car drive by.\n“We were getting ready to settle in for the night, to go to bed,” said Sarah Clay, Maci’s mother. “And he was walking back, the kids kind of straggled behind a little bit. There were three pops and she screamed. … My husband went to give her aid.”\nClay said the pellet is lodged so deep inside Maci’s skin it will never come out.\n“There was a lot of blood,” Clay said. “We weren’t exactly sure what happened at first. I knew something had hit her. It looked a lot worse than it was. It was really scary.”\nWhen asked if it still hurt, Maci nodded her head.\n“If you touch it. It hurt,” she said.\nUPDATE 3:11 p.m. (Sept. 1): Police are still searching for suspects involved in an incident that left a 4-year-old shot in the head by an airsoft rifle, Urbana Police Chief Matt Lingrell said in a statement.\nThe girl was watching her father take out the trash on Wednesday evening, the statement said, when she was struck by a pellet gun shot from a moving car. The pellet left a cut on her scalp, Lingrell said, and she was transported to Urbana Mercy Memorial Hospital for treatment.\nOfficers are also investigating two other incidents like this one, where people were shot at with an airsoft rifle from a moving car, Lingrell said. Police are asking for help with the investigation, he said.\n“These crimes are very troubling to us and to our community and it’s important that we identify those responsible quickly before another incident occurs,” the statement said.\nIn one of the incidents, the shooter reportedly yelled something about Pokemon, Lingrell said.\nAnyone with information on the shootings should call Urbana Police at 937-652-4350.\nINITIAL REPORT (Aug. 31)\nUrbana police are investigating the apparent wounding of a 4-year-old child hit in what was dispatched as a drive-by shooting.\nThe girl has been taken to Urbana Mercy Memorial Hospital, we’re told, suffering from injuries not believed to be life-threatening.\nThere was no word from the hospital about her condition.\nPolice and a city fire/rescue unit were dispatched to a residence on Dewey Avenue about 9:10 p.m. on a report that a 4-year-old child had been shot by someone who was using an airsoft rifle.\nThere has been no word about whether police have identified any suspects. A dispatcher said a statement from the police department will be issued Thursday morning.\nClick here to download our free mobile app for breaking news and news updates."}