{"uri": "http://www.clickondetroit.com/news/detroit-police-investigating-seven-people/28025096", "title": "Multiple people shot, killed in northwest Detroit", "dct": "Fri, 12 Sep 2014 12:25:00 GMT", "id": "4cf5c88ff9253bc26652f8f974574825", "content": "DETROIT - A violent night on Detroit's northwest side has police investigating two scenes after multiple people were shot at a candlelight vigil.\nDetroit police confirm two people are dead including 33-year-old Kercilla Reed.\n\"And a total of five others that have been shot are in temp-serious condition,\" said Assistant Police Chief Steven Dolunt.\nThe vigil was held at a home on Patton. That's where, Detroit police say, the shootout started after someone opened fire in the house. Others, some in cars, started returning fire, killing one person at the home.\nOver at the second scene a red car crashed after being pursued by police. Police say a woman was ejected and killed. Family members identify her as Reed. Another passenger who was in the back seat of the car is in critical condition.\nLocal 4 has learned another person from that red car is in police custody. Overall, police have three people in custody.\nTomeka Reed said one of the people in custody is her son, who she was looking for earlier.\n\"I'm in shock, getting the call saying that my kid's been shot -- both of my sons was gone,\" she said. \"But I found one of them and I don't know where the other one is at right now.\"\nShe said her son is one person who is being questioned by police.\nDetroit police said three weapons were recovered including a pistol at the car crash and an assault rifle at the home.\nPolice are trying to figure out what sparked a shooting at a place where people were supposed to be mourning.\n\"Now we're facing two other vigils because you have a young lady here that's dead and another person dead at Patton. It's senseless and it's stupid, and there's no reason for it,\" said Dolunt.\nCopyright 2014 by ClickOnDetroit.com. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}