{"uri": "http://www.readingeagle.com/ap/article/police-officer-dead-another-injured-in-san-diego-shooting-suspect-in-custody", "title": "Police officer dead, another injured in San Diego shooting; suspect in custody", "dct": "Fri, 29 Jul 2016 09:02:00 GMT", "id": "dc4cf56e362d76641af78337f9037d66", "content": "SAN DIEGO — A traffic stop late Thursday night led to a shooting that killed a San Diego police officer and wounded a second officer and a suspect in the city’s Southcrest area, where police searched for hours for other possible suspects.\nThe names and tenures of the male officers, both part of the department’s gang suppression unit, were not released.\nThe slain officer suffered multiple gunshot wounds and died at a hospital despite life-saving efforts, San Diego Police Chief Shelley Zimmerman said early Friday. The wounded officer underwent surgery early Friday and was expected to survive.\nThe male suspect, who had been shot, was being treated at a hospital, Zimmerman said.\nPolice offered few details about how the shooting unfolded.\nThe two officers had pulled over a vehicle about 11 p.m. somewhere in the area of Acacia Grove Way and 38th Street. Immediately after, they called for emergency cover.\nOther officers were in the area and arrived swiftly. They found the two officers suffering from gunshot wounds to the upper torso. The critically injured officer was rushed to a hospital in a police vehicle.\n“Despite heroic efforts by officers on scene and heroic efforts by doctors to save his life, I’m heartbroken to report they were unable to save him, and he is deceased,” Zimmerman said outside Scripps Mercy Hospital, where the mood was tense and somber.\nOutside the main entrance, some officers could be seen hugging one another. Others stood stoically, guarding the hospital doors. Zimmerman escorted several people into the hospital.\nZimmerman later said she had gone to the home of the slain officer and notified his wife, two children and extended family members who were at the home.\n“It is extremely difficult, but something you have to do,” Zimmerman said, joined by other department leaders. “There’s nothing that prepares you to do that.”\nThe wife of the critically injured officer was beside him at the hospital as he underwent surgery, Zimmerman said.\nBecause other family members of the two officers had not yet been notified, their names were not released to the public.\nThere was no update on the condition of the suspect, who was found shortly after the shooting in a ravine near South 38th and Alpha streets.\nPolice, including officers from many other agencies, swarmed the area and, with guns drawn, searched for any other possible suspects with the aid of police dogs, a helicopter and SWAT team members. They focused for hours on the Chollas Creek open area just south of Acacia Grove. Residents were asked to stay indoors and streets were cordoned off for several blocks in all directions.\nShortly before sunrise, no other suspects had been found.\nMany officers from the other police agencies were released from their posts by 4 a.m. and some streets reopened after that.\nThe incident comes as police in Southern California and throughout the country are on high alert following the killing of officers in Dallas and Baton Rouge, La., earlier this month.\nThe National Law Enforcement Officers Memorial Fund on Wednesday issued a report revealing that 67 law enforcement officers have been killed in the line of duty this year through July 20 — an 8 percent increase over the same period last year, when 62 officers were killed.\nOther figures on the Officer Down Memorial Page website showed that 19 officers had been slain nationwide in July, through Monday.\n(EDITORS: STORY CAN END HERE)\nThe last two San Diego police officers slain in the line of duty were Christopher Wilson and Jeremy Henwood.\nWilson, 50, a 17-year police veteran, was shot and killed on Oct. 27, 2010, as he and other officers tried to take a parolee into custody at a South Meadowbrook Drive apartment in the Skyline neighborhood.\nPolice, probation officers and U.S. marshals wanted to talk to Alex Charfauros in hopes he could lead them to a fugitive named Holim Lee. Charfauros was removed from an apartment, then officers kicked in a bedroom door. They were met with a barrage of gunfire, with a round hitting Wilson in the head. He died early the next morning.\nInside the bedroom, Lee and girlfriend Lucky Xayasene died of self-inflicted gunshot wounds. Lee is believed to have killed Wilson.\nMelissa Ortiz and Patrick Luangrath also were holed up inside a closet in the bedroom.\nThey surrendered to police after a SWAT standoff that lasted several hours. Charfaurous, Ortiz and Luangrath were all sent to prison in connection with the fatal shooting.\nHenwood, 36, a four-year police veteran, was killed in an ambush-style shooting on Aug. 6, 2011, as he was patrolling through City Heights. The gunman, who had just shot a man in Santee 30 minutes earlier, drove alongside Henwood’s car, aimed a shotgun at the officer’s head and opened fire.\nThe shooter, Dejon White, was killed by other officers a short time later.\nOnly moments before the shooting, Henwood had stopped at a Fairmount Avenue McDonald’s and took time to buy cookies for a 13-year-old boy who didn’t have enough money for the treat. Next week will mark the fifth anniversary of the officer’s slaying.\nIn a more recent, non-fatal assault, Officer Tim Bell, 29, survived being shot four times on Oct. 24, 2013, by a wanted felon he chased into a storm drain in City Heights. Bell’s bullet-proof vest saved his life as he took rounds to the chest, arm and leg. At the time of the shooting, Bell had been on the department for 5 ½ years.\nIgnacio Canela, an ex-convict who had led officers in a pursuit before running into the storm drain beneath state Route 15, was sentenced in June to 54 years to life in prison for premeditated attempted murder.\n———\n(Staff writer Pauline Repard contributed to this story.)\n———\n©2016 The San Diego Union-Tribune\nVisit The San Diego Union-Tribune at www.sandiegouniontribune.com\nDistributed by Tribune Content Agency, LLC.\n—————\nGRAPHIC (for help with images, contact 312-222-4194):\n_____\nTopics: t000002458,t000027866,t000149877,t000027879,t000002827,t000003813,t000184889,t000412858,t000208436,t000191749"}