{"uri": "http://www.postandcourier.com/20160815/160819571/four-in-summerville-house-arrested-after-berkeley-deputies-find-wanted-man-crystal-meth-firearm", "title": "Four in Summerville house arrested after Berkeley deputies find wanted man, crystal meth, firearm", "dct": "Sun, 14 Aug 2016 00:00:00 GMT", "id": "e71ab83acb67979a94fbe36458a36500", "content": "The Berkeley County Sheriff’s Office seized crytal methamphetamine and a firearm from a Summerville residence Monday.\nDeputies and members of the U.S. Marshals Service Fugitive Task Force received information that David Earl Evans, 31, who was wanted on 11 warrants, was at a residence on Tennyson Way, near Sangaree Parkway.\nSam Ferguson Jr., 34, eventually opened the door for deputies, who found that he also was wanted on drug charges by the Summerville Police Department, according to a Monday media release from the Sheriff’s Office. He was found to be in possession of methamphetamine and charged.\nTen people were located inside the residence, some who exited on their own and others who were found hiding, the release states.\nWhen everyone was out of the residence, a search warrant was executed and deputies found a Taurus 9 mm gun in the bedroom where Evans was found. They also found 10 grams of crystal meth, the release states.\nAllen Craig Davis, 43, claimed ownership of the meth after he was found hiding behind a water heater, according to the release. He was charged with possession of methamphetamine with intent to distribute.\nEvans was charged with possession of a firearm as a convicted felon. He was also served warrants for failure to stop for blue lights (a second offense), possession of heroin, possession of a stolen firearm, assault on a police officer while resisting arrest, unlawful carrying of a pistol, grand larceny, possession of methamphetamine, evading arrest, malicious damage to personal property and two counts of possession of a firearm by a convicted felon.\nNone of the addresses of the three men who were arrested were released. A woman at the residence was also arrested and charged with public disorderly conduct.\nReach Melissa Boughton at 843-937-5594 or at Twitter.com/mboughtonPC."}