{"uri": "http://krqe.com/2016/08/28/police-confirm-3-found-dead-in-northwest-albuquerque/", "title": "Albuquerque police: 3 dead in suspected murder suicide", "dct": "Sun, 28 Aug 2016 12:46:00 GMT", "id": "49222de8be12a26f2b40ec93c9736325", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nALBUQUERQUE, N.M. (KRQE) – Residents at one northwest Albuquerque apartment complex are holding family a little closer after police found three people dead in a suspected murder suicide. Police confirm one of those victims is a minor.\nOne of the victims of a murder-suicide this weekend is just 11-years-old, Nhi Nguyen.\nA vigil will be held for Nguyen on Sunday night.\nPolice are now working to notify their next of kin, but it won’t be easy. The family found dead at Villa Hermosa Apartments is Vietnamese and the next of kin is in Vietnam.\n“It’s going to take some time. It’s a little bit harder because of that,” said Officer Simon Drobik.\nOfficer Drobik says they had a translator on scene to help determine what happened. Police aren’t saying much, just that they’re investigating this as a murder suicide.\nAlbuquerque police say they got a call around 10:00 a.m. Sunday from someone who knew the family and found them dead in the apartment. Neighbors at Villa Hermosa say what happened is shocking, especially when they had never seen violence there.\n“To have my kids around this environment you know what I mean, it’s just, it’s not good,” said Angelina Gonzales.\nNeither a motive or cause of death have been released.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}