{"uri": "http://www.wave3.com/story/29043282/vine-grove-neighbors-shocked-by-murder-suicide-involving-sweet-girl", "title": "Vine Grove neighbors shocked by murder-suicide involving 'sweet' girl", "dct": "Fri, 26 Jun 2015 17:41:00 GMT", "id": "5dc2cabe0bcbc55af6b55884e7b89217", "content": "VINE GROVE, KY (WAVE) - Kentucky State Police have taken over the investigation of what they say is a murder-suicide. Around 9 p.m. May 11, Vine Grove police responded to a call of shots fired on Willow Crossing Court. Officers arrived to find John Jonas, 42, and his 11 year old daughter dead in their side yard from apparent gunshot wounds.\nNeighbors say Jonas was a Lieutenant Colonel in the Army who was in the process of retiring. They also say he was suffering from Post Traumatic Stress Disorder. Saying they were shocked to hear the news, neighbors described to us the relationship they saw between Jonas and his daughter.\n[PREVIOUS STORY: KSP: Father, daughter dead in apparent murder-suicide]\n\"Very close. I saw them doing everything together,\" Vikki Laramore said. \"He worked out in the yard, she was always helping. He took me in the house, showed me her bedroom and how he decorated it. He was really, really, proud with what he had done with her bedroom, I mean just very loving.\"\nNeighbors say they could hear the little girl laughing through the neighborhood almost every afternoon. She loved to ride bikes with some of the girls in the neighborhood.\n\"She was a sweet little girl,\" said Nellie Rios said. \"She was just riding around on her bike, as sweet as can be, you know always laughing about something, giggling about something.\"\nThe girl was in 5th grade at Vine Grove Elementary. John Wright with Hardin County Schools said they are encouraging students to lean on one another.\n\"We are going to be visiting with students in small groups and just kind of ask them what's on their mind, what questions do you have? Can we help you get through this process?\" Wright said.\nWright says both teachers and students were heartbroken and in shock to hear the news.\nCopyright 2015 WAVE 3 News. All rights reserved."}