{"uri": "http://www.baltimoresun.com/news/maryland/crime/bs-md-ci-overnight-shootings-20161214-story.html", "title": "Three shot in Baltimore overnight after city surpasses 300 homicides", "dct": "Wed, 14 Dec 2016 10:23:00 GMT", "id": "4390e11d9ca99c6d6a678e347d55f8a1", "content": "Three people were shot in Baltimore overnight, while the second victim in a double shooting Tuesday night died at a hospital, police said.\nPolice did not identify any of the victims, but said the two men killed in the shooting in the 3900 block of Groveland Avenue were 42 and 48 years old.\nThe homicides were the city's 300th and 301st for the year. It marked the second straight year the city has surpassed 300 killings, and only the second time since the 1990s.\nState's Attorney Marilyn J. Mosby and Police Commissioner Kevin Davis addressed the homicide mark at a Wednesday morning forum hosted by the Greater Baltimore Committee.\n\"Hitting the 300 mark is very disturbing to me,\" Mosby told the group of business leaders. She noted that she and her family live in West Baltimore.\nMosby said she was particularly concerned with the level of retaliatory violence, and said she and Davis plan to go to Annapolis in the upcoming legislative session and push for tough punishments for gun possession.\nDavis said 60 percent of the sentences for people convicted of carrying a gun this year were suspended.\nDavis said he was also concerned with the high number of non-fatal shootings, saying such incidents often represent \"unfinished business\" for shooters or their victims.\n\"We have to make quick arrests, particularly in those non fatal shootings,\" he said.\nPolice, meanwhile, were investigating three shootings that occurred late Tuesday night and early Wednesday that injured a 17-year-old and two 26-year-olds.\nPolice said all three victims were \"uncooperative\" with detectives, refusing to give them locations of the shootings.\nPolice were called just before 5 a.m. Wednesday to the 17-year-old victim's grandmother's home in the 200 block of Furrow Street in Southwest Baltimore. The teen had with a gunshot wound in his arm, police said. Police said he left the home after arguing with his grandmother and returned after being shot. He told police he was shot at a bus stop, but did not elaborate.\nThe other two victims arrived at hospitals after being shot, one of them in the back of the neck around midnight and the other in the buttocks about 10 p.m. Tuesday, police said.\nPolice are also investigating what led a Coppin State University police officer to kill a gunman near the edge of campus Tuesday night.\nThe man killed by police was firing upon a car occupied with at least two people near Daley Residence Hall on the east edge of campus, police spokesman T.J. Smith said. Police have not identified the man, but say he was not a student.\nAnyone with information may call the Baltimore Police Homicide Unit at 410-396-2100 or Metro Crime Stoppers at 1-866-7LOCKUP.\ntwitter.com/cmcampbell6"}