{"uri": "http://www.ajc.com/news/crime--law/dead-quadruple-shooting-henry-county/Ta37qInHYZf24QQq9vMg6N/", "title": "5 arrested in deadly quadruple shooting in Henry County", "dct": "Thu, 27 Oct 2016 00:00:00 GMT", "id": "c4cdc09c709c1a32096c201767cc762b", "content": "UPDATE\nFive people have been arrested in connection with the deadly quadruple shooting at a home in a rural part of the county, Henry County police said late Thursday.\nThree of the four people shot at the home on Moccasin Gap Road in a remote part of McDonough are dead. The fourth person — a woman who authorities say is in her early 20s — is clinging to life at Grady Hospital. Henry Police Capt. Joey Smith said the dead include two men both in their 20s and a woman who was in her late teens or early 20s. All were shot at close range in the living room area of the home. The shooter apparently knew them, authorities said.\nSmith said Jacob Cole Kosky, 22, of McDonough and Mathew Baker, 19, of McDonough have been arrested and charged with three counts of murder.\nThree other people — Jacob Williams, 18, of McDonough, Kayla Head, 21, of McDonough and Brooke Knight, 19, of Locust Grove — are accused of obstructing the investigation.\nPolice would not release the names of the victims nor a motive for the shooting.\nORIGINAL REPORT\nThree people were killed and one person was critically injured Thursday in a quadruple shooting in Henry County, police said.\nAuthorities got a call about the deadly shooting at a home on Moccasin Gap Road in McDonough about 2 a.m.\n“It went out as a home invasion and ended up being some type of shooting,” Henry police Capt. Joey Smith said.\nPolice found the victims in the living room and kitchen of the home, he said.\nThree people died on the scene. The fourth person was flown to an area hospital in critical condition.\nRelatives arrived on scene just after 7:30 a.m. One woman fell to her knees and screamed the names of the three people killed, according to Channel 2 Action News. Authorities have not officially identified the victims, but said they all knew each other.\n“It appears that they were all up at the time or together,” Smith said.\nPolice spoke with a woman who lives at the home, and contacted witnesses inside the residence as well as neighbors.\nNo arrests had been made by 9 a.m.\nAnyone with information about the shooting is asked to call Henry police.\n“We’re trying to be as cautious as we can with information,” Smith said.\nStaff writer Lauren Foreman contributed to this article."}