{"uri": "http://www.henryherald.com/news/kosky-baker-indicted-in-moccasin-gap-quadruple-murder/article_6d0daa57-dc4a-5b7a-92bc-29a69bae506a.html", "title": "Kosky, Baker indicted in Moccasin Gap quadruple murder", "dct": "Tue, 24 Jan 2017 00:00:00 GMT", "id": "da0cd939960406222228f4fea5019fa5", "content": "McDONOUGH —A Henry County grand jury indicted Jacob Cole Kosky and Matthew Baker Tuesday in the October murders of four young people at a Jackson house party.\nKosky, 23, was indicted on four counts of malice murder, eight counts of felony murder, four counts of aggravated assault, one count of possession of a firearm during the commission of a felony, one count of possession of a firearm by a convicted felon and one count of felony theft by taking.\nBaker, 19, was indicted on four counts of malice murder, four counts of felony murder, four counts of aggravated assault, and one count of possession of a firearm during the commission of a felony.\nThe two McDonough men are accused in the shooting deaths of 18-year-old Matthew Hicks of McDonough, 29-year-old Keith Gibson of Covington, 20-year-old Sophia Bullard of Thomaston and Destiny Olinger, 20, of Jackson.\nThe jury charged that both acted “with malice aforethought” in the quadruple murder, despite Kosky’s alleged admission to police that he was the sole shooter and Baker’s prior claim that he acted in fear for his life.\nBaker’s attorney argued during a December preliminary hearing that the 19-year-old did not know what Kosky had planned when he was called to the Moccasin Gap Road home on Oct. 27.\nKosky and Baker had attended a bonfire at victim Destiny Olinger’s home earlier that night. At some point in the evening, Baker reportedly left the party with a crew of friends and later returned at Kosky’s request.\nWhen Baker arrived, Kosky allegedly handed him a gun and asked for backup, according to police.\nKosky, who turned himself in later Oct. 27, reportedly told investigators with the Henry County Police Department that he shot everyone remaining in the house.\n“At one point in the interview he made the admissions, ‘I domed everybody in the house. Two to the head. Everybody I saw. I did it,’” Detective David LeCroy testified during a November preliminary hearing.\nTwo witnesses hid and survived the shooting, including a woman identified as Kosky’s sister. The woman called police at about 2 a.m. to report the shooting.\nWhen police arrived at the home, Bullard, Hicks and Gibson were found dead. Olinger was found shot in critical condition. She was transported to Grady Memorial Hospital, where she later died of her injuries on Oct. 30.\nThree other people were arrested Oct. 27 in connection with the crime. Jacob Williams, 18, of McDonough, 21-year-old Kayla Head of McDonough, and Brooke Knight, 19, of Locust Grove were charged with obstruction of a police investigation. The three remain under investigation in the Henry County District Attorney’s Office.\nThe prosecution will now prepare for trial, although District Attorney Darius Pattillo said Tuesday that it is “hard to say” when a trial date will be set. The case has not yet been assigned to a judge.\nIf convicted of murder, Kosky and Baker could face a mandatory life sentence. Pattillo said the case will be reviewed at a later date in order to determine whether his office will seek the death penalty."}