{"uri": "http://pittsburgh.cbslocal.com/2015/09/01/police-called-to-north-side-for-reports-of-child-shot/", "title": "Police Charge Man In Fatal Shooting Of 22-Month-Old In Fineview", "dct": "Tue, 01 Sep 2015 17:10:00 GMT", "id": "62217bf8a844d8c8f44fa277f6c07518", "content": "PITTSBURGH (KDKA) — A man is facing charges in the fatal shooting death of a 22-month-old boy in an apartment complex in the city’s Fineview section.\nEmergency officials and police were first called to the suspect’s Allegheny Dwellings apartment on Sandusky Court around 5 p.m. Tuesday.\nLate Tuesday night, 30-year-old Harrison Marshman Jr. was charged with criminal homicide and endangering the welfare of a child in connection with the case.\nMarshman was initially believed to be the child’s stepfather. However, he is only dating the child’s mother.\nThe child was rushed to Allegheny General Hospital, where he later died.\n“We were called because a 2-year-old male child was shot in the chest,” said Pittsburgh Police Spokeswoman Sonya Toler. “The child was rushed to AGH by paramedics, and has since been pronounced deceased.\nPittsburgh Police Commander Larry Scirotto said the boy was shot with a 9mm pistol.\nIn a press release, Commander Scirotto said Marshman’s “actions were reckless and negligent and caused the death of the child.”\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nDetails on circumstances surrounding the gun being discharged were not immediately released.\n“This is a tragedy. Even if it’s a 20-year-old, if it’s a 30-year-old, anytime there’s gun violence in the neighborhood, it affects us all,” said English Burton, of the Violence Prevention Organization.\nWendell Kelly, a neighbor who lives across the street from the shooting, witnessed the immediate aftermath of the tragedy with his grandson.\nBefore the ambulance arrived on the scene Kelly said, “A policeman came outside with the baby boy in his arms. There was a little spot on the child’s chest, but the boy was covered with blood by the time the officer got to his car.\n“The cop broke down, he couldn’t catch his breath,” Kelly said. “I’ve never seen anything like it.”"}