{"uri": "http://www.tampabay.com/news/publicsafety/crime/boy-16-is-victim-in-fatal-busch-boulevard-motel-shooting/2300777", "title": "17-year-old is victim in fatal Busch Boulevard motel shooting", "dct": "Mon, 31 Oct 2016 14:04:00 GMT", "id": "c8530722166e971343c82b41b193008b", "content": "Kelly Stacy Jr., 17, had recently found out his girlfriend was pregnant, his family said.\nTAMPA — Toni Collins found out Sunday afternoon that her 17-year-old son had been killed.\nHer oldest son called around 3 p.m. to tell her either his brother or a friend was dead, but police hadn't made a definite identification. Minutes later, as she stood outside the crime scene at the Tampa Hotel, any hope Collins had that her child had survived was removed by a Facebook post.\nA photo of Kelly Stacy Jr. went viral, commenters speculating on why the young man had been shot to death and asking \"whose child is this?\" He was lying on his back, arms outstretched and dreadlocks splayed, outside the hotel at 2307 E Busch Blvd.\nWhen she saw the photo, Collins, 40, dropped her phone and crumpled to the ground, overcome with grief, said Stacy's sister, Shanetika Anthony, 21. All she could do was cry and pray and scream, Anthony said. That's all she, her mother, her brother and her sister have done since, she said.\n\"They took our baby. We loved him to death, and they took him,\" Anthony sobbed Monday. \"I don't think he deserved it, I don't think his baby that's not even here yet deserved it. I think he should have had another chance.\"\nStacy died of at least one gunshot wound around 3 p.m. Sunday, according to Tampa police. Detectives declined Monday to release more details about what happened, including a possible motive, said Tampa police spokeswoman Janelle McGregor.\nAnthony said Stacy's best friend was with him at the hotel and was shot three times. She heard he was preparing to be released Monday night from Tampa General Hospital.\nPolice said detectives are working to identify a suspect or suspects and released photos of five men who might have information about the shooting. Investigators do not believe it was random. Neither does Stacy's family.\nState records show Stacy had been arrested four times between February 2015 and July of this year. Last month, he pleaded guilty to carrying a concealed weapon and the court withheld a formal finding of guilt.\nBut last month he got news that his family hoped would save his life, Anthony said. He learned his girlfriend was about 5 weeks pregnant.\nStacy rarely cried. He was teased for being a crybaby when he was younger, and by the time he reached Greco Middle School he had learned to swallow his emotions. But when he told Anthony he was going to be a father, he broke down in tears, she said.\nHe was scared, but excited to start a family with the only girl he ever loved, a childhood friend and the only girl he ever brought home to meet his family. He started a piggy bank for the baby that he filled with spare change.\nHe also decided to enroll in adult education classes at Jefferson High School, and got a job at a warehouse near his home on Cypress Street.\nIn July, Stacy's father died after a yearslong battle with kidney failure. Anthony said she only saw her brother cry once during the ordeal, when he learned his father had been put on life support. He was stone-faced at the funeral.\nStacy made some bad decisions but never faltered in his love for his family, Anthony said. He was her 3-year-old son Zion's favorite babysitter and often her rescuer. When she couldn't afford presents for Zion's second birthday, Stacy emptied his savings to buy as many toys, gifts and party supplies as possible. Even Sunday morning, he made sure his sister had a plate of pizza and breadsticks ready for her when she got home from work.\n\"He lived young, wild and free, but he was so smart and had such a good soul,\" Anthony said. \"When he found out he was going to be a father, we all saw it in him, he wanted to change.\"\nCrime Stoppers Tampa Bay is offering a reward of up to $3,000 for information that leads to the identification and arrest of a suspect. To submit a tip, call (800) 873-8477, report anonymously at crimestopperstb.com or use the P3 Tips cellphone application.\nTimes researcher John Martin contributed to this report. Contact Anastasia Dawson at adawson@tampabay.com or (813) 226-3377. Follow @adawsonwrites."}