{"uri": "https://en.wikipedia.org/wiki/Candelaria,_Texas", "title": "Candelaria, Texas", "dct": "Tue, 13 Dec 2016 01:06:00 GMT", "id": "d59efe554cb66c1cafb68d03d01d4b5d", "content": "The town stands in the Chihuahuan Desert on the north bank of the Rio Grande, just across from the small Mexican town of San Antonio Del Bravo. The two towns were linked by a bridge across the river that enabled the inhabitants of San Antonio to buy groceries and supplies from Candelaria; some sent their children to school there. However, in 2008 the bridge was controversially removed by the US Border Patrol because of concerns that it had become, in the words of Border Patrol chief John Smietana, \"a route for terrorists, drug traffickers and illegals.\"[1]\nHistory[edit]\nIt is unclear when Candelaria was founded, but the area was occupied by Native Americans before farmers began to grow crops on the irrigated floodplain of the Rio Grande. It was known initially as Gallina (\"chicken\" in Spanish) before being renamed as Candelaria. In 1868, an entrepreneur named William Russell came to the area to establish a farm worked by the local people, selling the grain to the US Army at Fort Davis and Fort Stockton. Cotton was also grown locally. With the town's population increasing steady, it became the seat of one of Presidio County's three school districts in 1893. By 1911 it had grown to two stores, a church and a school, with 307 pupils in the school district and a general population of 1,842, though only a minority of these actually lived in the town.[2]\nThe remoteness of the area led to concerns about its security during the Mexican Revolution. The US Army responded in 1916 by establishing an army post, Camp Candelaria, that was garrisoned until late 1919. The town's fortunes waned thereafter; with its poor transport links along a 50-mile dirt road to Presidio, its small-scale agriculture could not compete with the industrial farms elsewhere along the Rio Grande.[2] The population fell steadily, from 250 in 1925 to 75 by 1940. By the late 1980s the town had shrunk to a two-room elementary school, a store, a Catholic church, and a cluster of adobe houses.[3]\nCandelaria gained its first paved access to the outside world only as late as 1985 when Farm Road 170 to Presidio was surfaced.[3]\n[hide]Climate data for Candelaria, Texas (Jun 1, 1940–Jul 22, 2011)\nMonth\nJan\nFeb\nMar\nApr\nMay\nJun\nJul\nAug\nSep\nOct\nNov\nDec\nYear\nRecord high °F (°C)\n86\n(30)\n92\n(33)\n99\n(37)\n105\n(41)\n110\n(43)\n115\n(46)\n114\n(46)\n111\n(44)\n109\n(43)\n103\n(39)\n93\n(34)\n86\n(30)\n115\n(46)\nAverage high °F (°C)\n66.6\n(19.2)\n72.4\n(22.4)\n80.7\n(27.1)\n89.3\n(31.8)\n96.6\n(35.9)\n101.9\n(38.8)\n100.0\n(37.8)\n97.7\n(36.5)\n92.9\n(33.8)\n85.6\n(29.8)\n74.6\n(23.7)\n66.8\n(19.3)\n85.4\n(29.7)\nDaily mean °F (°C)\n49.0\n(9.4)\n53.8\n(12.1)\n60.7\n(15.9)\n68.7\n(20.4)\n76.6\n(24.8)\n83.6\n(28.7)\n84.1\n(28.9)\n82.0\n(27.8)\n77.2\n(25.1)\n67.7\n(19.8)\n56.3\n(13.5)\n49.2\n(9.6)\n67.4\n(19.7)\nAverage low °F (°C)\n31.5\n(−0.3)\n35.2\n(1.8)\n40.6\n(4.8)\n48.2\n(9)\n56.5\n(13.6)\n65.3\n(18.5)\n68.2\n(20.1)\n66.4\n(19.1)\n61.5\n(16.4)\n49.9\n(9.9)\n38.1\n(3.4)\n31.6\n(−0.2)\n49.4\n(9.7)\nRecord low °F (°C)\n9\n(−13)\n9\n(−13)\n14\n(−10)\n21\n(−6)\n34\n(1)\n46\n(8)\n56\n(13)\n47\n(8)\n33\n(1)\n22\n(−6)\n15\n(−9)\n6\n(−14)\n6\n(−14)\nAverage precipitation inches (mm)\n0.44\n(11.2)\n0.36\n(9.1)\n0.27\n(6.9)\n0.36\n(9.1)\n0.65\n(16.5)\n1.48\n(37.6)\n2.17\n(55.1)\n2.26\n(57.4)\n1.99\n(50.5)\n1.19\n(30.2)\n0.39\n(9.9)\n0.45\n(11.4)\n11.99\n(304.5)\nAverage snowfall inches (cm)\n0.0\n(0)\n0.1\n(0.3)\n0.0\n(0)\n0.0\n(0)\n0.0\n(0)\n0.0\n(0)\n0.0\n(0)\n0.0\n(0)\n0.0\n(0)\n0.0\n(0)\n0.0\n(0)\n0.0\n(0)\n0.1\n(0.3)\nAverage precipitation days (≥ 0.01 in)\n3\n2\n2\n1\n3\n5\n7\n8\n6\n3\n2\n2\n43\nSource: Western Regional Climate Center, Desert Research Institute[5]\nCandelaria is zoned to schools in the Presidio Independent School District."}