{"uri": "http://www.stltoday.com/news/local/crime-and-courts/shot-that-killed-st-louis-girl-may-have-been-accidental/article_2381735c-329d-50fa-84e6-2e1145cbd048.html", "title": "Shot that killed St. Louis girl, 14, may have been accidental, police source says", "dct": "Mon, 18 Jan 2016 00:00:00 GMT", "id": "6261c60c288ab3be43a3c8ae3ca725d4", "content": "ST. LOUIS • Jamyha Luss was at a friend’s house Sunday afternoon when two boys stopped to visit. One of them had a gun.\nIt’s unclear what happened next, but police say Jamyha, 14, was fatally shot in the back. Both of the boys fled the home in the Wells-Goodfellow neighborhood before police arrived.\nSt. Louis police continued their investigation on Monday, identifying as a person of interest a boy, 14, who turned himself in to authorities Monday afternoon.\nAt this point, investigators believe the shooting was accidental, according to a police source.\nJamyha was a student at Gateway Middle School and lived most of her life with her grandmother Shirley Wright and her four siblings because her parents are incarcerated. She lived in the 5500 block of Palm Street, less than a mile from the friend’s home where she was shot.\nJamyha went over to her friend’s house on Friday to spend the weekend there, Wright said. Jamyha was close with the friend and spent a lot of time at her house. The home is near Martin Luther King Drive and Union Boulevard, in the 5300 block of Patton Avenue.\nWright said the friend told her that she had told the boys, one of whom had a gun under his shirt, that she wasn’t allowed to have company. She went upstairs to the bathroom, heard a shot and found Jamyha on the couch, Wright said.\nGrief counselors and a crisis response team will be available on Tuesday at Gateway Middle School, said Patrick Wallace, spokesman for St. Louis Public Schools.\n“She was really a fun person. Everybody loved her,” Wright said. “If you met her, you just automatically liked her.”\nOn Sunday, Marie Black, a woman who lives at the home, said the girl had spent the night there with Black’s daughter, as she often does on weekends. But Black, 47, was at work at the time of the shooting and said she didn’t know how the girl was shot.\nJamyha’s middle name is for her other grandmother, Hortense Luss. She said Jamyha liked basketball and going to the movies, and was a good student who didn’t have problems at school.\n“She was just a sweet 14-year-old,” Hortense Luss said.\nLast week, an Alton boy, 11, was shot and killed while waiting for a ride to basketball practice. The gunman was firing at someone else over a grudge that simmered on social media. In December, a 15-year-old boy shot a 3-year-old boy once in the chest inside his home in north St. Louis County, killing the toddler. Police have not said publicly whether that shooting was accidental or intentional.\nChristine Byers of the Post-Dispatch contributed to this report."}