{"uri": "http://www.gainesville.com/news/20160728/family-gathering-ends-in-bloodshed-1-killed-two-wounded", "title": "Family gathering ends in bloodshed, 1 killed, two wounded", "dct": "Sat, 28 Jan 2017 19:37:49 GMT", "id": "7c94494c3dd07733efc058618c00548b", "content": "Antonio Mason, 35, was holding his 11-month-old daughter when he was shot in the chest.\nA family gathering turned to chaos and tragedy late Wednesday night when two men barged into a home, fatally shot one man and wounded his baby daughter, along with another man.\nPolice spent much of Thursday morning interviewing witnesses and searching for evidence in and around the home at 820 NW Fourth Place.\nNeighbors, meanwhile, said they were disgusted that the culprits fired with children in the house.\n\"They were willing to shoot up a house ... with a newborn baby,\" said Tracie Davis. \"I have grandchildren, and that's just not cool ... I was scared, I was afraid.\"\nAntonio Mason, 35, was killed. Mason was holding his 11-month-old daughter at the time, and she was also struck in the arm by gunfire. Her wounds were not life-threatening, police said.\nA 21-year-old man was hit in the arm, and his wound was also not life-threatening.\nGainesville Police Officer Ben Tobias, the agency's spokesman, said calls about the shooting began coming in at 11:39 p.m. A K9 officer was at the house within a minute and saw 10 to 20 people who had been in the house running toward him.\n\"Our investigation revealed there were 20 to 25 people in the house including five or six children. It was a family gathering,\" Tobias said at a press conference. \"What's especially troubling is that Mason was holding his 11-month-old daughter in his arms when he was shot and killed. What kind of person would look at a person holding a child and make the barbaric decision ... to pull the trigger. I just can't fathom it.\"\nOfficers immediately began CPR on Mason and tended to the injuries of the infant and the man, who police are not identifying. Mason died at the scene.\nShell casings from two different handguns were found along with bullet holes all over the inside of the house.\nTobias said police don't believe the attack was random but would not discuss specific factors and said the motive for the shooting is unknown.\nSeveral neighbors said the family has lived in the home for a few months but that some of them have lived in the area for years.\nDavis was on her front porch listening to music with a friend when she saw two men ride bicycles slowly down the street.\n\"I told him, for some reason you'll feel things, and a voice just told me to get up and go in the house. I don't know what it was, but I responded to it,\" Davis said. \"As soon as I went in I heard five gunshots. I knew it was two different guns. Then I heard more shots. I said, 'Oh, Lord.' I got down and crawled to make sure my friend was OK. He was already down on the porch.\"\nA neighbor said the men ran out of the house and then north toward Fifth Avenue.\nTobias said someone who was in the house starting chasing the men but lost them.\nPatrols will be increased in the neighborhood. Anyone with information is urged to call detectives at 393-7670 or CrimeStoppers at 392-STOP. GPD has an anonymous tip line at 393-7700. Another option is to text the keyword GPDFL and the tip to 274637.\nPolice are offering a $3,000 reward for information that leads to an arrest."}