{"uri": "http://cbs12.com/news/local/police-investigate-deadly-shooting-near-the-university-of-florida", "title": "Police investigate deadly shooting near the University of Florida", "dct": "Thu, 28 Jul 2016 00:00:00 GMT", "id": "c5c2c449e249113c81a687e076baeb2a", "content": "GAINESVILLE (CBS12) — Early Thursday morning, the Gainesville Police Department responded to a shooting at the 800 block of NW 4th Place near the University of Florida.\nAccording to reports, two black male suspects came into the residence wearing masks and began shooting from the entrance late Wednesday night.\nPolice say that 35-year-old Antonio Mason was shot in the chest, while holding his 11-month-old infant daughter during the home-invasion. The child was shot in the arm. Another man, 21, also suffered a gunshot wound to the arm.\nOfficers who arrived on the scene immediately began CPR and emergency aid on Mason. He was later pronounced deceased on-scene. Both the second male and child were transported to local hospitals. Police say the injuries are non-life threatening.\nAccording to police, 20 other people that were in the house when the shooting occurred were fleeing the area. The two unidentified suspects fled the scene before police arrived. Witnesses say that one occupant tried to run after the suspects, but was unsuccessful.\nAuthorities are investigating but do not have a clear motive for the attack. GPD detectives, K9 units and the Joint Aviation Unit Helicopter are working the scene.\nAccording to reports, authorities believe that this was not a random attack. Police ask that residents remain inside for their safety.\nPatrols will be increased, while officers attempt to identify the shooters.\nGainesville Police Officer Ben Tobias said in a statement:\nWhat kind of person can point a gun at a father holding an infant and make the barbaric decision to pull that trigger? There is no excuse whatsoever for this to happen. We are expending every resource we have available to try to identify and capture those responsible for this horrendous act of violence.\nOfficials asks that anyone with information on this incident to please call GPD's Detective Bureau at 352-393-7670 or Crime Stoppers at 352-372-STOP.\nThis is a developing story. CBS12 will provide updates as they become available."}