{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-violence-shootings-20150801-story.html", "title": "3 killed, 12 hurt in Chicago weekend shootings", "dct": "Sun, 02 Aug 2015 13:07:00 GMT", "id": "293c97548528540e586b2bb9689a1ba5", "content": "Three men have died and at least 12 other people have been wounded in separate shootings since Saturday afternoon across the city, police said.\nA 21-year-old man and a 31-year-old man were shot early Sunday along the lakefront on the South Side and one of them died. The younger man was pronounced dead at 9:40 a.m. at Northwestern Memorial Hospital, according to the Cook County medical examiner's office.\nHe was later identified by the Cook County medical examiner's office as Vaughn King, Jr., of the 1000 block of North Milwaukee Avenue in Chicago (updated on 8-10-2015).\nThe men were critically wounded in a shooting about 3:15 a.m. Sunday in the Oakland community area on the South Side, said Officer Ronald Gaines, a spokesman for the Chicago Police Department. They were sitting on the lakefront in the 4300 block of South Lake Shore Drive when two gunmen walked up to them and fired gunshots, Gaines said.\nThe 31-year-old was hit four times in the stomach and once in the arm and was taken to Stroger Hospital. The 21-year-old was wounded in the abdomen and was taken to Northwestern Memorial Hospital. Both were initially listed in critical condition.\nAnother fatal shooting occurred about 5 a.m. Sunday in the 11700 block of South LaSalle Street in the city's West Pullman neighborhood, according to Officer Janel Sedevic, a spokeswoman for the Chicago Police.\nThe 20-year-old victim was found unresponsive in an alley with multiple gunshot wounds to the back, according to Sedevic. The man was dead on the scene, according to the medical examiner's office.\nHe was later identified as Chris Green, of the 12000 block of South Parnell Avenue in Chicago, according to the Cook County medical examiner's office. (updated on 8-10-2015).\nArea South detectives are investigating.\nSeparately, a 22-year-old man was shot to death and four other people were hurt in a shooting at a house party at 1:03 a.m. Sunday in the North Austin neighborhood on the West Side, Gaines said.\nAll five men were at a house party outside with several other people in the 4800 block of West Kamerling Avenue when two male attackers walked up and fired shots into the crowd, police said.\nA 22-year-old man was shot in the head and was pronounced dead at the scene, Gaines said. He was later identified by the Cook County medical examiner's office as Spencer Stewart, of the 3600 block of West 80th Street in Chicago (updated on 8-10-2015).\nA 22-year-old man was struck in the back and chest and was taken in critical condition to Mount Sinai Hospital, Gaines said.\nA 20-year-old man was shot in the stomach and was also taken to Mount Sinai, where his condition stabilized.\nA 19-year-old woman was shot in the thigh and was taken to Stroger Hospital in serious condition, police said.\nA 24-year-old man was grazed in the arm and was treated and released by paramedics at the scene, Gaines said.\nNobody was in custody as a result of the shooting, and police were still investigating.\nPolice officers cordoned off about a half-block of Kamerling Avenue with yellow tape.\nThe body of the 22-year-old man who was killed lay in the front yard of a one-story home.\nMinutes after the shooting, dozens of partygoers and neighbors gathered on both sides of the crime scene at the street, which is lined with red brick bungalows on both sides.\nKiera Robinson, 18, said she and her three friends just arrived at the house party and were walking through a crowd of people outside when two gunmen walked out of a gangway across from the house and fired shots.\n\"I just stared and stood there for a minute,\" said Robinson, adding that she heard about 10 gunshots. \"I didn't know what to do.\"\nOnce gunfire erupted, chaos ensued and people started running away, she said.\nRobinson, who lives in the Englewood neighborhood on the South Side, said she has witnessed shootings before. But the shooting early Sunday was the first time she saw someone die in front of her.\n\"I just want to get outta (Chicago),\" Robinson said.\nNeighbor Ozzy Rendon, 23, said he was talking to his girlfriend on the front porch of his home when he heard about eight gunshots.\nRendon, who grew up in Humboldt Park, said he moved to the neighborhood about three months ago with his family because of the affordable housing prices.\n\"I'm used to (the shootings),\" Rendon said as he stood outside his home early Sunday morning. \"It's another night in Chicago.\"\nAt least nine were wounded in other shootings since Saturday afternoon.\n• A 17-year-old male was wounded around 5 a.m. Sunday in the Englewood neighborhood on the South Side, police said. The teenager was standing on a corner in the 4300 block of South Wells Street when he heard gunshots and realized he was struck in the groin, police said. He was taken to St. Bernard Hospital and Health Care Center, where his condition stabilized.\nThe teen is being uncooperative with the police, and no other information was available about the shooting.\n• About midnight, a 31-year-old woman was wounded in a shooting in the Washington Park neighborhood on the South Side, Gaines said. The woman was outside in the 5200 block of South Calumet Avenue when she heard gunshots and noticed a cut behind her ear, Gaines said. The woman suffered a graze wound and was treated and released by paramedics on the scene.\n• Around 9:55 p.m. Saturday, a 25-year-old woman was critically hurt after getting shot in the South Austin neighborhood on the West Side, Gaines said. The woman was driving a car in the 5200 block of West Adams Street when she heard gunshots and realized she was struck in the neck, Gaines said. She was taken to Mount Sinai Hospital in critical condition, Gaines said.\n• About 9:30 p.m. Saturday, a 48-year-old woman walked into Weiss Memorial Hospital after getting shot in the Uptown neighborhood on the North Side, Gaines said. The woman was shot in the abdomen in the 5000 block of North Kenmore Avenue.\nShe was transferred to Advocate Illinois Masonic Medical Center, where her condition stabilized, Gaines said.\nNo other information about the shooting was immediately available.\nIn that same neighborhood about 24 hours earlier about 4:20 a.m. Friday, a 21-year-old man was seriously hurt after getting shot in the back on the same block of North Kenmore Avenue, police said.\n• Around 8:30 p.m. Saturday, a 20-year-old man was shot in the shoulder and chest while he was outside in the 7700 block of South Chappel Avenue in the South Shore neighborhood, police said. The man was listed in serious-but-stable condition at Stroger Hospital, Gaines said.\n• Around 6:40 p.m. Saturday, a 28-year-old man was shot in the leg in the Burnside neighborhood on the South Side, Gaines said. The man was in the 8800 block of South Cottage Grove Avenue when he was shot. He was taken to Jackson Park Hospital and Medical Center, where his condition stabilized, Gaines said.\n• An 18-year-old man was shot in the hand about 3:05 p.m. Saturday in the 400 block of North Lawler Avenue, police said. The man went on his own to West Suburban Medical Center in Oak Park, where he was in good condition. The man told police he was walking in the area when he heard shots and felt pain, police said.\nNo one was immediately in custody as a result of the shootings, and police were investigating."}