{"uri": "http://www.chron.com/houston/article/Boy-11-accidentally-shoots-himself-in-east-8956241.php", "title": "Boy, 11, accidentally shoots himself in east Houston", "dct": "Mon, 01 Aug 2016 00:00:00 GMT", "id": "cecd519a3840c574b3a332097bf80dd6", "content": "An 11-year-old boy is in critical condition after he shot himself with a gun late Sunday at a home in east Houston, the third time in recent days a child in the area has suffered a self-inflicted gunshot wound.\nThe most recent shooting happened about 9:25 p.m. in the 300 block of De Haven, according to the Houston Police Department.\nPolice said the boy somehow got his hands on his uncle's gun and was wounded in the neck. He was in critical condition when he was rushed to Texas Children's Hospital.\nThe shooting, investigators said, appears to be accidental. Police are investigating the case.\nREAD MORE: Alvin boy, 7, lucky to be alive after shooting himself\nOn Thursday, a-7-year-old boy shot himself in the head after grabbing a .38-caliber revolver from his grandfather's locked gun cabinet in Alvin, according to the Brazoria County Sheriff's Office. The bullet went into the boy's forehead just below the hairline, traveled under the skin on the crown of his head and then exited without piercing his skull.\nThe boy is expected to recover.\nThe grandparents, deputies said, will not face any charges since their grandson had to make great efforts to find the key to the locked gun cabinet.\nREAD MORE: Little boy who shot himself is on life support\nIn another case, a boy, believed to be 5 years old, shot himself in the face about 6:15 p.m. Tuesday at a home in the 9700 block of Shady Tree Lane. The child, who has not been identified, was rushed to a nearby hospital, where he later died, officials said.\nHarris County Sheriff's Office deputies said the shooting appeared to be an accident. Deputies were still trying to confirm how the boy got his hands on the gun. Charges have yet to be filed in the case, and officials said they weren't sure if any would be."}