{"uri": "http://www.kptv.com/story/33327561/police-responding-to-shots-fired-call-death-investigation-at-apartment-in-beaverton", "title": "Man, two children dead in apparent murder-suicide at Beaverton apartment", "dct": "Thu, 06 Oct 2016 12:09:00 GMT", "id": "7a13810af5801e8f64a0dd1e598eb09f", "content": "BEAVERTON, OR (KPTV) -\nPolice have confirmed that two children and one man were found dead at the scene of a shooting at an apartment complex in Beaverton.\nOfficers with the Beaverton Police Department responded to the Redwood Creek Apartments near Southwest Hall Boulevard and Southwest Greenway Avenue just before 4:30 p.m. Wednesday after a woman called 911.\nPolice said the woman discovered three bodies at the scene. When officers arrived to the scene, a 6-year-old boy, an 8-year-old girl and a 36-year-old man were found inside the apartment, on the ground.\nPolice thought all three were dead, but when investigators stepped out of the apartment, they said they heard a disturbing sound from inside.\n\"We heard rustling inside, we heard the sound of a gun and one initial gunshot from inside,\" said Officer Jeremy Shaw.\nInvestigators said that gunshot came from the man inside, who they believe took his own life. Investigators confirmed the man is the biological father to the two children.\nDetectives with the Beaverton Police Department and Washington County Major Crimes unit are investigating the deaths as a murder-suicide. Police said no other information would be released Wednesday about the investigation.\nFox 12 spoke with a neighbor who did not want to be identified. She said that she heard screaming, and then her husband ran over with a gun to help but it was too late.\nJosh Bliesner lives nearby, and is shaken up over the heartbreaking loss in his community.\n\"If life can get to you that hard, to make you turn on yourself and take away your creations that you brought into this world, two totally innocent, young, beautiful children. It just makes you think, how hard was that guy's life?\" said Bliesner.\nWhile police note that there will be traffic delays in the area as the investigation continues, they also said that they do not believe there to be a risk to the public at this time.\nCopyright 2016 KPTV-KPDX Broadcasting Corporation. All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}