{"uri": "http://www.nola.com/crime/index.ssf/2016/03/algiers_shooting_boyfriend_sho.html", "title": "'Can't believe it happened,' says family of boyfriend shot dead in Algiers", "dct": "Sat, 02 Apr 2016 11:08:32 GMT", "id": "27c6183e2c33796d6142ba78f81df874", "content": "(Orleans Parish Sheriff's Office)\nToyin Bailey arrived at the taped-off crime scene in Algiers Wednesday night (March 30) after his cousin's body had already been carted off in a coroner's van.\n\"I couldn't believe it,\" said Bailey, 23, who last saw his older cousin, Gerald Smith Jr., 25, when Smith visited him and his mother about three weeks ago. \"I can't believe that this would happen,\" he repeated.\nSmith was shot dead by his girlfriend Ebony Harmon, New Orleans police said, just before 5 p.m. as the two played with a gun. Harmon, 28, told police she believed the gun was not loaded and pulled the trigger after her boyfriend jokingly told her to shoot him.\nA mother of four young children, Harmon was booked Thursday (March 31) on one count of negligent homicide. Her bond was set at $50,000, court records show. Records also show she was placed on suicide watch.\nNew Orleans police arrested a 28-year-old woman accused of fatally shooting her boyfriend late Wednesday afternoon (March 30).\nHarmon's father, Ernest Battle, said he and his wife plan to sit down Thursday evening with their daughter's children, ages 3-to-9, to explain to their grandchildren where their mother is and why she's in jail.\n\"We haven't told them,\" Battle said Thursday afternoon in a phone interview. \"We're still not quite right ourselves, right now.\"\nBattle said the couple had been together approximately two years. Smith was not the father of any of Harmon's children, Battle said. \"They had a good relationship,\" he said. \"He was the love of her life.\"\nAccording to Smith's aunt, Janel Bailey, her nephew was her sister's only child, and he had no children of his own. He grew up mostly on the West Bank. She described Smith -- known by the family as \"GJ,\" for \"Gerald Jr.\" -- as a happy person who often smiled.\nSmith worked as a security guard in recent years, his aunt said. He avoided hanging out with the wrong crowds, she said, and never went out clubbing like some of his peers. Smith's routine was simple and consistent: \"Work and home, work and home,\" she said.\nBattle said knowing his daughter and her relationship with Smith, he believes the fatal shot was \"totally an accident.\" Battle said he spoke with Smith's father after the shooting.\n\"I do give my condolences to the boy's family,\" Battle said.\nJanel Bailey said the police officers who responded were polite and professional. She was relieved the investigation did not drag on. \"It's resolved,\" she said.\nDemetria Bailey, Smith's other aunt and mother of Toyin Bailey, said Smith was like brother to her son. Smith stayed humble, always, she said.\n\"He was a good child that didn't deserve what happened to him,\" she said.\nToyin Bailey said he broke down when he found out what happened to his cousin. Janel Bailey said her son couldn't stop crying. And Battle said he's had headaches from all the tears he shed in the last day. As the men weep, Demetria Bailey said she's still struggling to come to terms with her family's new, unwanted reality.\n\"It seems like a dream,\" she said. \"We're still trying to make it true.\"\nNegligent homicide in Louisiana is punishable by up to five years in prison."}