{"uri": "http://www.mcall.com/news/breaking/", "title": "In marijuana competition, a tension between clinical, alternative medicine", "dct": "NODATE", "id": "71387df6ad7216d566f0deca703a9f70", "content": "Tim Charles describes himself as a serial entrepreneur. The Allentown native has dabbled in energy efficiency, international trade, manufacturing and real estate. Now, Charles, CEO of PA Cannabis LLC, hopes to bring medical marijuana to Main Street via a dispensary that offers patients a holistic...\nNation/World\nTrump suspends admission of refugees, increases vetting of Muslims; vows priority for Christians\nPresident Donald Trump signed an order Friday to suspend admission of all refugees for 120 days while a new system is put in place to tighten vetting for those from predominantly Muslim countries and give preference to religious minorities. Trump said that the goal is to screen out \"radical Islamic...\nEntertainment\nEmmy-winner Barbara Hale, who played Perry Mason's secretary, has died at 94\nBarbara Hale, best known for her Emmy Award-winning role as Perry Mason’s loyal secretary Della Street on the long-running 1950s and ’60s TV series starring Raymond Burr, has died. She was 94. Hale died Thursday, according to her son, actor William Katt, who posted the news on his Facebook page....\nPennsylvania News\nPennsylvania Gov. Tom Wolf to seek consolidation of 4 health agencies\nGov. Tom Wolf's administration notified state officials and employees Friday afternoon that he wants to consolidate four state agencies into a single department as the first-term Democratic governor deals with a massive budget deficit and a Republican-controlled Legislature averse to raising taxes....\nPolice\nLife sentence closes case of fatal 2012 Wilson robbery\nAfter five years of heartbreak, countless hours of investigations, two trials and a guilty plea, the criminal proceedings tied to the death of a Wilson grandmother came to a close Friday at a court hearing with a predetermined outcome. As expected, Quadir Taylor was sentenced to life without parole...\nLV Business Cycle\nPolice chief: No charges for Pa. restaurant owner who used slur\nANNVILLE (AP) — A Pennsylvania police chief says no criminal charges will be filed against a chicken wing restaurant owner accused of using a racial slur toward a black customer. Ricky Bugg Jr., a junior at Lebanon Valley College, says he and his friend were waiting for their order Sunday when...\nBreaking News\nSalisbury Township couple found dead in September died of drug overdoses, coroner says\nA couple who had been dead for nearly a week before they were discovered in their Salisbury Township home in September died of accidental drug overdoses, the Lehigh County coroner's office said Friday. William Kenneth McConnell, 47, and his girlfriend, Corrinia Rismiller, 44, were found dead on...\nNation/World\nProsecutors won't pursue misconduct charge against New Jersey Gov. Chris Christie\nNew Jersey prosecutors said Friday they will not pursue a criminal misconduct case against Republican Gov. Chris Christie in the George Washington Bridge lane-closing scandal. Bergen County assistant prosecutor John Higgins said in a letter that the state does not believe it can prove official...\nEnergy Sector\nAir Products' CEO: We have 'firing power' to pursue acquisitions\nTREXLERTOWN — A slimmer, more-nimble Air Products now has the \"firing power\" to purse acquisitions, CEO Seifi Ghasemi during a conference call with analysts Friday. \"And you can rest assured that we are looking at a lot of different things, and I hope some of them materialize soon,\" Ghasemi said...\nLV Business Cycle\nOurBus to offer cheap fares from Lehigh Valley cities to New York\nA start-up company with an Uber-like business model plans to offer cheap bus fares from the Lehigh Valley to New York City starting in February, introducing new competition for Bieber Tourways and Trans Bridge bus lines. New York City-based OurBus, which sells tickets only via its website and a...\nBreaking News\nTeen at center of Holland Tunnel heroin 'rescue' mission dead\nThe troubled Wilkes-Barre teenager at the center of an Amber Alert kidnapping case and then a botched rescue mission to a New York drug den has died of a drug overdose, her father said Friday. Jenea Patterson, 18, died on Wednesday after using drugs with several friends, according to her father,...\nNation/World\nMarch for Life: Pence speaks as abortion opponents rally in shadow of Washington monument\nThe politically ascendant anti-abortion movement gathered Friday for a triumphant rally on the National Mall, rejoicing at the end of an eight-year presidency that participants said was dismissive of their views. Vice President Mike Pence told the crowd at the March for Life that anti-abortion...\nLehigh Valley Music\nThe 1975 sets another record for Sands Event Center's fastest sellout -- also likely quickest ever in the region\nIt was like a time warp for The 1975. When tickets for the British band’s May 12 concert at Sands Bethlehem Event Center went on sale at 10 a.m. Friday, all of its general admission standing tickets sold out in a flash of four minutes, setting the venue’s record for its fastest sellout, event center...\nCenter City Easton\nEaston convenience store wins appeal to convert to beer distributor\nDowntown Easton will get a long-disputed beer distributor after the Commonwealth Court upheld a Northampton Street convenience store's appeal to sell beer. Jagdish and Varsha Desai have been trying to open a beer distributor at Jack's Market at 222 Northampton St. since 2012, but were denied by...\nHealth Care\nLVHN cutting positions at Pocono\nA restructuring affecting an as-yet undetermined number of jobs is underway at the former Pocono Health System, which became part of Lehigh Valley Health Network this month. LVHN issued a statement confirming that it is \"making adjustments\" in managerial, clinical and non-clinical staffing. The...\nRetail\nRetailer Wet Seal closing all stores, including its Lehigh Valley Mall location\nWet Seal LLC, which has a store at the Lehigh Valley Mall in Whitehall Township, is planning to close all of its locations, the latest retailer to fall amid a difficult climate for companies that rely heavily on brick-and-mortar sales. The impending shuttering comes after Wet Seal, of Irvine, Calif.,...\nNation/World\nTrump promises 'great rebuilding of the Armed Forces' at Pentagon ceremony\nPresident Donald Trump signed an executive order Friday to launch what he called a \"great rebuilding of the Armed Forces\" that is expected to include new ships and planes, additional Special Operations forces and the modernization of the U.S. nuclear arsenal while cutting projects that are not...\nBreaking News\nMan, 21, killed in snowboarding accident at Camelback Ski Resort\nA 21-year-old snowboarder died Thursday night in an accident at Camelback Ski Resort in Tannersville, resort officials said. The victim, a Stroudsburg man who was not identified, was on a black diamond trail known as the Hump, when he was involved in an accident at 7 p.m., resort officials said....\nNation/World\n2 central Florida students arrested in Columbine-style school shooting plot\nAuthorities say two students who were plotting a Columbine-style attack at a central Florida middle school have been arrested. Sumter County Sheriff's officials said in a news release that the boys, ages 13 and 14, planned the attack at The Villages Charter Middle School for Friday. Deputies say...\nBreaking News\nAnti-heroin group founded by John Cramsey holding rally around two Allentown motels\nThe anti-heroin group Enough is Enough will be holding a rally and march around two east Allentown motels on Sunday afternoon. The group will meet at 1 p.m. behind the Redner's Quick Shoppe gas station in the Airport Road Plaza, 1135 Airport Road, and begin marching at 2 p.m., according to John...\nPennsylvania News\nEx-mayor gets probation in Wild West museum artifacts case\nA former Pennsylvania mayor is avoiding jail time after pleading guilty to accumulating Wild West artifacts he bought with public money for a museum that was never built. Former Harrisburg Mayor Stephen Reed was sentenced Friday to two years of probation in a courthouse around the corner from...\nPennsylvania News\nIn Hazleton and other towns, laws targeting 'the illegals' didn't go as planned\nStarting a decade ago, a group of small U.S. cities began passing laws to block undocumented immigrants from living within their borders. They were a collection of mostly white exurbs and faded manufacturing towns whose populations suddenly were transforming. More Latinos were arriving in search...\nLV Business Cycle\nIt's now illegal for business in France to offer free soda refills\nOffering free refills from self-service soda fountains has been uncommon in France, but now the practice is illegal. A governmental decree prohibiting restaurants, hotels and catering facilities from allowing customers to top up their drinks for free went into effect on Friday. The move is aimed...\nBreaking News\nTrump has a plan — a pretty good one — for tackling student debt\nPresident Trump has a pretty good idea. Although he hasn’t raised the issue since the November election, Trump tackled the growing problem of student debt while on the campaign trail. About 44 million Americans hold roughly $1.4 trillion in student loans — more than is owed for credit cards. “Students...\nPennsylvania News\nLehigh County says it's not a sanctuary under Trump executive order\nALLENTOWN–It took a couple of days, but Lehigh County's law department has determined President Donald Trump's executive order threatening to withhold federal funding from so-called sanctuary jurisdictions does not apply to the county. Trump's executive order, signed Wednesday, refers to a section...\nNation/World\nU.S. economic growth slowed to 1.9 percent rate in Q4; caps weakest year since 2011\nThe U.S. economy lost momentum in the final three months of 2016 as a downturn in exports temporarily depressed activity. But there were hopeful signs in housing and business investment that the economy will rebound in the coming months. The gross domestic product grew at an annual rate of just..."}