{"uri": "http://www.sun-sentinel.com/local/broward/pembroke-pines/fl-pines-teen-shooting-adult-20160623-story.html", "title": "Teen shot in head is out of hospital; accused shooter gets $25K bond", "dct": "Thu, 23 Jun 2016 19:09:00 GMT", "id": "3867701cf8146de21c1b24a5e97505eb", "content": "Nathan Walker,17, of Pembroke Pines, is charged as an adult with attempted manslaughter, while wounded friend, 15, is out of the hospital\n(Broward Sheriff's Office / Courtesy)\nA 17-year-old accused of shooting a friend in the forehead with a handgun has been charged as an adult.\nNathan Walker of Pembroke Pines told police he thought the.380 caliber Luger LCP was empty of bullets when he pointed it at the head of 15-year-old Nahji Alvarez and pulled the trigger, police said.\nAlvarez was taken to Memorial Regional Hospital in Hollywood with serious facial injuries but has been released.\nWalker's bond was set at $25,100 during a court hearing Thursday morning. Broward assistant state attorney Maria Schneider confirmed that he is charged with attempted manslaughter with a firearm and unlawful possession of a firearm by a minor.\nWalker's mother, father, step-father, uncle and a family friend attended his court appearance, where Broward Judge Michael Davis told Walker how lucky he was.\n\"You have tremendous family support in the courtroom today,\" the judge said. \"I need you to care about you and your future.\"\nWalker's family did not comment during or after the hearing, but defense attorney Neil Kerch said all are thinking of Alvarez.\n\"From day one, the concern has always been for the young man that was injured,\" Kerch said. \"We're happy it didn't take a turn for the worse, obviously.\"\nHis attorney, Joshua Polsky, said in a statement: \"He is incredibly fortunate to be alive under the circumstances, and we are optimistic and hopeful that his progressive recovery will continue. This was obviously a very serious close-range gunshot wound to the head, resulting in permanent serious bodily injury, much of which is still developing and not fully known.\"\nAccording to a Pembroke Pines police report, the shooting took place June 1 at Walker's home in the 8200 block of Northwest 10th Street.\nWalker told detectives he bought the gun for $230 from someone about two weeks earlier and had hidden it in his bed frame, according to an arrest report. There were no further details in the arrest report about the gun purchase.\nBefore showing it to Alvarez, Walker said he removed the magazine with five bullets from the gun then aimed the \"red laser pointer\" at his friend's head.\nThe bullet struck the 15-year-old between his eyes, causing facial fractures and leaving a bullet fragment behind his right eye. Another fragment severed his carotid artery and settled at the base of his skull.\nWalker waited a few minutes and called 911, describing his friend as conscious and alert.\n\"He's awake, he's awake, he's telling me to hurry up,\" Walker told the operator. \"He's walking and everything ... He went to the sink to wash his face off and stuff.\"\nPolsky said he anticipated the teenager needing rehabilitation in the future.\n\"We're still praying that he makes a full and speedy recovery,\" Kerch said.\nIn court, the judge told Walker he understood it was a \"very dangerous world,\" but having a gun was not the answer.\n\"If you're in a dangerous situation you call for help, you call police,\" Davis said. \"You don't need a gun.\"\nIn addition to the bond, the judge ordered Walker to have no contact with the wounded teenager and no hanging out or partying with friends. Walker must wear a location monitor on his ankle with travel restricted to work, school, church or shopping with his parents.\nwkroustan@sunsentinel.com or 954-356-4303"}