{"uri": "http://www.local10.com/news/crime/16-year-old-shoots-teen-with-gun-recently-purchased-off-the-street-police-say", "title": "16-year-old shoots teen with gun recently purchased off the street, police say", "dct": "Thu, 02 Jun 2016 14:35:00 GMT", "id": "84ef0b2a3acfff5f3b697d123185abaa", "content": "PEMBROKE PINES, Fla. - A 16-year-old boy from Pembroke Pines shot another teenager in the head Wednesday with a gun that he had recently purchased off the street, authorities said.\nNathan Jamil Walker, 16, faces multiple charges including attempted manslaughter, negligent manslaughter and aggravated battery with a firearm.\n15-year-old boy shot in head at Pembroke Pines home\nAccording to a probable cause affidavit, Walker and the 15-year-old victim were at Walker's house on Northwest 10th Street Wednesday when Walker retrieved a .380-caliber Ruger LCP hidden in his bed frame that he had purchased from an \"unknown subject\" about two weeks ago for $230.\nPolice said Walker thought that he had removed the magazine, which contained five rounds of ammunition, when he pointed the red laser pointer attached to the gun at the victim's forehead and pulled the trigger.\nThe bullet struck the victim between his eyes, causing several facial fractures and leaving a bullet fragment behind his right eye, with an additional bullet fragment at the base of his skull near his spine. The bullet also severed his carotid artery.\nThe victim was taken to Memorial Regional Hospital with critical injuries. Pembroke Pines Fire Rescue said the boy was conscious and answering questions when he was being taken to the hospital.\nAccording to police, Walker left his bedroom after the shooting and came back a few minutes later and called 911.\nDetectives said Walker confessed to intentionally pulling the trigger while pointing the gun at the victim, but said he believed the gun was unloaded.\nWalker appeared in juvenile court Thursday, where a judge ordered that he remain at the Juvenile Assessment Center for at least the next 21 days.\nHis attorney called the shooting a \"tragic accident.\"\n\"What I can say is they were very good friends,\" defense attorney Neil Kerch said. \"We know there was a tragic accident, and we're hoping and praying that the child makes a full recovery.\"\nWalker's next court appearance is scheduled for June 17.\nCopyright 2016 by WPLG Local10.com - All rights reserved."}