{"uri": "http://www.channel3000.com/news/multiple-squads-block-residential-street-in-montfort/30504470", "title": "Names released in Montfort shooting that left 6-year-old dead", "dct": "Sun, 04 Jan 2015 15:12:00 GMT", "id": "341484be345c0483a7fb5a15f3e190b7", "content": "MONTFORT, Wis. - The Grant County Sheriff's Office has released the names of the 6-year-old boy who died in a shooting in the town of Montfort Friday afternoon.\nSheriff Nate Dreckman said deputies responded to a 911 call of gunshot wounds inside 305 E. Main Street in Montfort after 3 p.m. Friday and found three victims inside the residence. Two of those victims were children.\nJaxon Slaight, 6, was pronounced dead at the scene, according to Dreckman. His brother, 8-year-old Joseph, and his mother, Morgan, 27, were both injured and taken by Med Flight to UW Hospital.\nSources told News 3 Joseph underwent surgery late Friday night. Dreckman said all three sustained head injuries from a .22-caliber pistol, and both Morgan and Joseph were in stable but critical condition.\nThe case is being investigated as a homicide. Dreckman said deputies have not ruled out a murder-suicide, but are keeping all possibilities open as they continue to gather evidence.\n\"There are several pieces of crucial evidence that will be processed at the Wisconsin Crime Laboratory that will assist in determining what exactly occurred Friday afternoon,\" Dreckman said. \"This process may take several weeks to complete.\"\nDreckman did not name a suspect at a press conference Saturday night and said no one has been arrested in connection with the case, but he reiterated there is no threat to the public. Friday night, Chief Deputy Jack Johnson had confirmed to media that a suspect was inside the home when deputies first arrived.\nAccording to Dreckman, Morgan and the two brothers were living at 305 E. Main Street with Morgan's sister and husband. Dreckman said that couple was not home during the incident and has nothing to do with the investigation.\nMorgan's husband, also the father of both boys, lives in the area but was not residing with the family at the home in Montfort, Dreckman said. He has been notified of the incident but is not considered a suspect.\nThe scene on Main Street was blocked off by multiple squad cars for much of the evening on Friday.\nMontfort native Cashton Laufenberg was outside his parents' house, just blocks away, when the shooting happened.\n\"I was outside playing basketball with my brothers, and next thing you know, there's cop after cop coming right down the road,\" Laufenberg said.\nLaufenberg and others watched as two people were taken out of the house on stretchers.\n\"It was just kind of a disturbing scene for a small town,\" Laufenberg said.\nLaufenberg and other neighbors said a couple with two young children had moved in less than a month ago, but kept mostly to themselves.\n\"No one really knew of them,\" Laufenberg said.\nMorgan Slaight had just moved to the area after living in Tulsa, Oklahoma. She and the boys were living with family members in Montfort. Slaight's husband, and the father of Jaxon and Joseph, was not living at the home. He is not considered a person of interest at this time.\nIn a small town with a population of fewer than 1,000, where everyone knows everyone and looks out for their own, Laufenberg said the incident was shocking and out of character.\n\"I lived here my whole life,\" Laufenberg said. \"I have never seen anything like this happen.\""}