{"uri": "http://www.channel3000.com/news/sheriffs-deputies-visit-boy-injured-in-montfort-shooting/31587726", "title": "Sheriff's deputies visit boy injured in Montfort shooting", "dct": "Wed, 04 Mar 2015 05:31:00 GMT", "id": "765866365dc2f57e3dcfcde3229cf211", "content": "MONTFORT, Wis. - A boy injured in a Jan. 2 shooting in Montfort is making steady progress in his recovery, according to Grant County Sheriff Nate Dreckman.\nJoey Slaight survived the Jan. 2 shooting in which Jaxon Slaight died and Morgan Slaight and her son, Joseph, were taken to UW Hospital in Madison where Morgan later died.\nThe sheriff said a forensic pathologist determined that the injuries to Morgan Slaight were consistent with a self-inflicted gunshot wound. Her death was ruled a suicide by the Grant County coroner. Jaxon's death was ruled a homicide, and Joseph's injures were ruled an attempted homicide.\nTwo months later, deputies who first responded to Montfort home are still keeping in touch with Joey. Deputies Nate Gallagher, Craig Reukauf, Rick Place and Jack Johnson say Joey's recovery has helped them heal, too.\n\"All four of us here have young children, and I think it's one of those things that hit home for all of us,\" said Reukauf as he recalled that Friday night in January.\n\"Really, it's not something you get over. I think it's something you always remember.\"\nFirst responders all went through critical stress debriefing and relied on each other to get through the following weeks by talking about what they had seen.\nBut maybe the best medicine came a little later, when deputies made a special visit to the hospital to see Joey.\n\"I walked around the other side of him and he reached out and grabbed my hand,\" Johnson said. \"That just pulled at my heart, the kid just was just amazing.\"\n\"Seeing the condition he was in that night to where he is now and being able to see that progression is just immensely helpful to me,\" Gallagher said.\nJoey's condition is improving steadily – the deputies say he was able to give them high fives and help put together a puzzle. It's better news than any of them could have hoped for.\n\"We didn't expect him to live,\" Johnson said. \"I didn't, and I don't think these guys did, either - no one did.\"\n\"The doctors have a bright future for him,\" Place said. \"I think that he's going to have a bright future and have some quality of life.\"\nJoey has since been moved to a hospital in Oklahoma, where doctors have goals for him to walk, talk and even dress himself in the future. The Grant County Sheriff's Office is still helping him from afar – they recently bought him an iPad to help with communication therapy.\nThe deputies take none of the credit for helping to save Joey's life that night.\n\"We owed it, I owed it to Joey, to Jaxon, to figure out what happened,\" Reukauf said. \"We'll never understand the 'why,' I guess, but the 'what happened,' to put that piece together, that's what we owed Joey and what we owed Jaxon.\"\nInstead, they say, Joey's recovery has helped save them.\n\"We might not ever know the why, but it's pretty inspiring to see Joey, who has been through so much, to pretty much beat all the odds.\""}