{"uri": "https://www.dnainfo.com/chicago/20130628/uptown/five-shot-uptown", "title": "Drive-by Shooting Injures Six Outside Uptown Grocery Store", "dct": "Sat, 29 Jun 2013 09:11:00 GMT", "id": "40fcea23c14cd652b45898753fce6553", "content": "CHICAGO — Six people were wounded in a shooting outside an Uptown grocery store Friday evening.\nSomeone in a four-door sedan fired shots at a group of people gathered outside the JJ Peppers Food Store in the 4800 block of North Sheridan Road at about 7:15 p.m., said Officer Michael Sullivan, a police spokesman.\nA 23-year-old woman was shot in both thighs, a 24-year-old man was shot in the buttocks and another 24-year-old man was shot in the ankle. All three of them were taken to Illinois Masonic Hospital.\nTwo other victims were taken to Saint Francis Hospital: a 30-year-old man shot in his right thigh and a 33-year-old man shot in his left arm.\nThe last victim was a 22-year-old woman shot in her knee and taken to Weiss Hospital. All of the victims were listed in stable condition after the incident, Officer Sullivan said. Fire officials said three of the victims were transported to hospitals in critical condition Friday night.\nFire officials dispatched five ambulances to care for victims.\nPolice taped off the alleyway directly behind the shopping center on the northwest corner of North Sheridan Road and West Lawrence Avenue as crowds gathered to watch. Yellow markers littered the mouthway of the alley.\nBefore Friday's shooting, at least four other people had been shot in Uptown in June, including two people shot in the 4800 block of North Sheridan Road on June 10th.\nLocal residents said Friday the recent shootings have been disturbing.\n\"This city is almost becoming unliveable,\" said Audrey Davis, a recently retired high school teacher and Edgewater resident. \"We can't continue like this.\"\nDavis said she is afraid to let her 17-year-old grandson out at night. Another resident who declined to give her name said she wants police to make an effort to improve the corner where the shooting happened.\n\"They have to clea this area up,\" she said. \"People are always hanging out on the corner.\"\nDavis shook her head and said she is not exactly expecting improvement anytime soon.\n\"The summer has arrived, so here we go,\" she said."}