{"uri": "http://www.baltimoresun.com/news/maryland/crime/bs-md-co-triple-homicide-20150717-story.html", "title": "Police: Perry Hall father kills sons, 10 and 12, before turning the gun on himself", "dct": "Fri, 17 Jul 2015 21:05:00 GMT", "id": "cab99b9c39983f478d2cd422c356a70b", "content": "A father who lost his temporary job as a human resources manager last week shot and killed his 12- and 10-year-old sons Friday morning before taking his own life at the family's Perry Hall home, authorities said.\nJulian Roary, 47, had struggled to find a stable position in recent years, said Shantal Brown-Winn, who said she was his longtime girlfriend.\n\"This was a good man who just thought he couldn't do it anymore because of the economy, the unfairness,\" she said.\nBrown-Winn told police that after hearing what she thought were firecrackers shortly after midnight, she checked and found Roary and his two sons, Julian Roary Jr., 12, and Ian Roary, 10, fatally shot in an upstairs bedroom in their home in the 8900 block of Yvonne Ave., off Ebenezer Road. She called 911, police said.\nRoary and his elder son were pronounced dead at the scene. Ian was taken to the Johns Hopkins Children's Center, where he was pronounced dead.\nCounty police spokesman Cpl. Shawn Vinson said the father shot both sons and then himself. Police said Roary left a note detailing his intentions.\nBrown-Winn said Roary struggled to provide for his family and didn't want to burden them.\nHe worked as acting human resources manager of the Baltimore City Parking Authority until last week, said Tiffany James, spokeswoman for the authority. James said she could not comment on why Roary left the authority because it was a personnel matter.\n\"We're deeply saddened to hear about him and what happened,\" she said. \"We're just really shocked that this occurred.\"\nJames said Roary had worked for the Parking Authority for 11 months and was placed there through the employment agency OfficeTeam. The assignment began in July 2014 and was a temporary position, said Stephanie Sweet, a spokeswoman for OfficeTeam, a division of the company Robert Half.\nBrown-Winn said Roary was devastated to lose the job. She said he had been struggling to find full-time work in human resources since 2009, when he left another job. While he held a doctorate in organizational development, she said, he felt he was passed by for jobs because he was an older job candidate.\n\"They say there are jobs out there, but it's hard,\" Brown-Winn said.\nRosilind Davis, a cousin of the boys' mother, Roberta Wheatley Roary, said, \"She's not doing well at all. It's been very trying for her.\"\nOn Friday morning, news trucks lined the suburban block and cars slowed past the house, some stopping to ask what happened. Several neighbors who awoke to the morning newscasts or heard helicopters and police sirens overnight stopped by the home to offer their condolences.\n\"You don't think of things happening like this in Perry Hall,\" said Baltimore County Councilman David Marks, a Republican who lives in the community. \"I think people are shocked. They are enormously upset that this could happen to two young innocent children.\"\nIn April, Baltimore County police were called to another murder-suicide in the area. In that case, a Parkville man shot his wife and 15-year-old daughter before killing himself.\nAfter stopping by to offer support to Brown-Winn, Lisa Pulling, a neighbor of Roary's, wiped tears from her face as she walked from the home. She was stopped by another neighbor, Jenny Merrill.\n\"A murder-suicide? Oh my God,\" Merrill said as she hugged Pulling on the sidewalk.\nMerrill said she had been concerned about Roary because he seemed stressed. \"But this? It feels unreal.\"\n\"Sometimes you don't see things coming,\" Pulling said.\n\"I can't believe he took the two boys,\" Merrill said.\nSitting on the steps of his home across the street, Greg Trembly, 16, said the tragedy in the quiet neighborhood seemed surreal.\nHe recalled Roary leaving early for work most mornings, and often saw him in the yard with the children. The boys, he said, loved to pet his family's Chihuahua.\nTrembly's mother, Laura, said she recalled Ian riding his bike up and down the street.\n\"We are all pretty shocked,\" said Laura Trembly, who described the boys as well-behaved and polite. \"These kids we always saw outside. It's unbelievable.\"\nBoth children attended Pine Grove Elementary, Brown-Winn said. Julian would have started middle school in the fall and Ian would have started the fifth grade.\nBrown-Winn said the boys were \"the best kids in the world.\"\nJulian, whom she called \"Jules,\" was mildly autistic, she said. \"The best gentle giant you can have.\"\nIan, she said, was \"smart as a whip.\"\nBrown-Winn said Roary coached many of their sports teams. She had a picture of Roary and Julian wearing matching red baseball jerseys. Julian beamed in the photo, sitting in front of his father, holding his bat and glove.\nShe pointed to fishing rods in the corner of the living room, saying her boyfriend had wanted to teach the boys to fish.\n\"I felt when I moved here — boys need their father, and here we are,\" she said.\n\"I guess he still has them.\"\ntwitter.com/janders5\ntwitter.com/aliknez"}