{"uri": "http://www.wdrb.com/story/32285563/police-four-people-shot-inside-apartment-near-churchill-2-dead", "title": "Shooting inside apartment near Churchill Downs leaves 2 dead, 2 injured", "dct": "Wed, 22 Jun 2016 21:46:00 GMT", "id": "c6f45dcc6a26a83da91313b2bf1e80ae", "content": "LOUISVILLE, Ky. (WDRB) -- Four people were shot inside an apartment near Churchill Downs on Tuesday, and two did not survive.\nThe crime scene became very emotional and volatile once family members arrived.\n\"If they killed my brother, it's going to be another one! I promise you that,\" said an angry man at the scene.\nThe raw emotion at the scene was palpable.\n\"Where is he at? Let me go over there. He's not dead is he?\" asked relatives.\nThe shooting happened Tuesday night on Rodman Street near M Street.\n\"It's just hard, really hard,\" Donnie Compton said.\nThe Jefferson County coroner confirmed the victims Wednesday night as Monte Compton, 24, and Donte Jefferson, 29. Both were pronounced dead at the scene around 10:20 p.m. of a single gunshot wound to the body.\n\"I was home asleep, getting ready for work and got the call that my son has been killed,\" Donnie Compton, Donte's father, said.\nLouisville Metro Police secured the scene, but had their hands full Tuesday night.\n\"We pretty much have all hands on deck,\" LMPD spokesperson Alicia Smiley said. \"That's primarily because of the number of victims involved.\"\nMeanwhile, as night turned to day, the crowd was gone, but there were bullet holes everywhere.\n\"When we got down there, they said it was two black males in the house that was already dead,\" Janice Mitchell said.\nMitchell said Monte Compton and Jefferson who died are first cousins and her nephews. She said family members are still waiting for information about the shooting.\n\"We've been up all night long. We don't know what happened.\"\nIf you have any information, you can call the police anonymous tip line at 574-LMPD.\nCopyright 2016 WDRB Media. All rights reserved."}