{"uri": "http://www.kentucky.com/news/local/crime/article126329854.html", "title": "18-year-old and his grandfather charged after shooting death of Jessamine teen", "dct": "Fri, 13 Jan 2017 08:33:00 GMT", "id": "185cbcffa2f5ebc15719c9e620d67a1a", "content": "Two men have been charged in connection with the Thursday night shooting death of a 15-year-old boy in Jessamine County.\nNicholasville police were called to Garden Park Drive about 7:30 p.m. Thursday night on a report of shots fired, officer Kevin Grimes said. Officers found a person down in the road with a gunshot wound.\nThe victim, Leo Travers, was taken to the St. Joseph Jessamine RJ Corman Ambulatory Care Center, where he was pronounced dead, according to police. Leo was a student at East Jessamine High School.\nNicholasville police worked all night and arrested Tyler D. Jeffers, 18, about 6 a.m. Friday, Grimes said. Jeffers is charged with murder, wanton endangerment, tampering with evidence and receiving a stolen firearm.\nJeffers’ grandfather, Albert L. McKinney, 66, was arrested on a charge of tampering with evidence, Grimes said.\nHe always had a big smile on his face. He was the kid everyone enjoyed being around.\nErinn Thompson, the baseball coach at East Jessamine High School talking about the victim, Leo Travers, 15\nPolice are working to find out what led to the shooting, Grimes said.\nThe gun allegedly used in the shooting was stolen from Michigan, Grimes said. Police were able to trace the weapon’s origin from the serial number on the gun, he said.\nWhen Jeffers told his grandfather where the gun was hidden, McKinney “moved the weapon into a tote” in the garage while police officers were searching for it, according to an arrest record filed in Jessamine District Court. McKinney later admitted moving the weapon after he was questioned by police, the document said.\nJeffers was charged with wanton endangerment because gunfire shattered the back window of a car being driven by a woman who was on Garden Park Drive at the time of the shooting, Grimes said.\nThe woman drove over a fire hydrant while trying to get away from the gunfire, Grimes said. She originally told officers she just happened to be in the area and didn’t know anything about the shooting.\nInvestigators later learned that the woman had been in the area to drop off Leo and another juvenile, Grimes said. Police said they don’t think the woman knew that the shooting was going to occur, but she knew more than she originally told officers. No charges are expected against her.\nGrimes said he’d known Leo, the victim, since he was 9 years old. He said Leo played on a travel baseball team and with a youth league. Leo was also on East Jessamine’s wrestling team, Grimes said.\n“He was a good baseball player, just an all-around good kid,” Grimes said.\nLeo’s mother is a former president of Parent-Teacher Organizations at Warner Elementary and East Jessamine Middle School, Grimes said.\nThe shooting deaths of youths in Lexington became more frequent during 2016, but the death of a teenager in Nicholasville has struck the community hard, Grimes said.\n“It’s a nightmare,” he said.\nStudents at West Jessamine, the other high school across town, would be familiar with Leo because he would have played in games with them, Grimes said.\nSeveral police officers were at East Jessamine High on Friday morning just to lend support to students and staff, Grimes said. Counselors were also being brought in to help students in their grief.\nA GoFundMe account was set up for Leo’s family.\nLeo had played baseball in Jessamine County since he was 5 years old, said Erinn Thompson, the baseball coach at East Jessamine High School.\n“He was the type of kid that gave everything he had every time he was on the field,” Thompson said. “He always had a big smile on his face. He was the kid everyone enjoyed being around.”\nThe baseball team gathered with other students and parents Friday afternoon to remember Leo during a Fellowship of Christian Athletes meeting, Thompson said.\nJeffers and McKinney are scheduled to be arraigned Tuesday in Jessamine District Court.\nGreg Kocher: 859-231-3305, @HLpublicsafety"}