{"uri": "http://www.kentucky.com/news/local/counties/jessamine-county/article128258434.html", "title": "What began as a marijuana deal ended in fatal shooting with stolen gun, detective testifies", "dct": "Mon, 23 Jan 2017 16:23:00 GMT", "id": "cdf2622e1f082ef25a32fdbc05ff8630", "content": "A detective confirmed Monday that a marijuana transaction was the purpose of a Jan. 12 meeting between two teens that led to the fatal shooting of East Jessamine High School student Leo Travers.\nNo cash and no marijuana was found on Leo, 15, nor his alleged killer, Tyler Jeffers, 18, detective Autumn Howard testified during a preliminary hearing in Jessamine District Court. Jeffers has been charged with murder, wanton endangerment, tampering with evidence and receiving a stolen firearm.\nRumors in the community had circulated that drugs were the reason behind the meeting, but Howard’s testimony was the first public confirmation.\nDistrict Judge Bill Oliver found probable cause to send the case to a grand jury for possible indictment. Commonwealth’s Attorney Andy Sims, who attended the preliminary hearing, said the grand jury might consider the case as early as March.\nLeo had arranged a meeting with Jeffers to buy a “quantity of marijuana,” Howard testified. Jeffers’ broken cellphone was found near Leo’s body on Garden Park Drive in Nicholasville. Information gleaned from Leo’s cellphone and from Facebook indicated a meeting had been scheduled.\nJeffers initially told police that he didn’t know and hadn’t met Leo.\nIn a later interview, Jeffers acknowledged he had met Leo and had shot him when Leo grabbed at Jeffers’ pockets, Howard said. Jeffers said he’d already had his hand on the handgun tucked inside the waist of his pants, Howard testified.\nJeffers “was a little nervous about the transaction because he didn’t know” Leo, Howard said.\nLeo was shot twice in the head, the detective said.\nJeffers was charged with wanton endangerment because gunfire shattered the back window of a car driven by a woman who took Leo to the meeting with Jeffers.\nThe gun had been stolen from Detroit, Howard testified. Police know that from the serial number on the gun.\nJeffers and his grandfather, Albert McKnney, 66, were each charged with tampering with evidence.\nWhen Jeffers told his grandfather where the gun was hidden, McKinney moved the weapon into a tote in his garage while police were searching for it, according to an arrest record in district court.\nMcKinney later admitted moving the weapon, the document said.\nMcKinney is scheduled to be arraigned on Feb. 2 in district court.\nGreg Kocher: 859-231-3305, @HLpublicsafety"}