{"uri": "http://www.wlwt.com/news/authorities-2-shot-in-madisonville/40694656", "title": "Suspect charged after man, toddler shot in Madisonville", "dct": "Thu, 14 Jul 2016 16:26:00 GMT", "id": "bda8df0f3249d6f244ebf07965e49588", "content": "MADISONVILLE, Ohio —\nPolice are investigating the shooting of a man and a toddler in Madisonville.\nAuthorities said the drive-by shooting happened around 6 p.m. Wednesday on Whetsel Avenue.\nThe man, Tim Reed, 36, was shot in the chest, police said, and taken to University of Cincinnati Medical Center. Authorities said Jonquezz Newbill, 2, was also shot and taken to Children's Hospital. In court Thursday morning, prosecutors said that Reed was the boy's grandfather.\nBoth are listed in critical condition.\nCincinnati police said that Ernest Cephas, 35, was arrested early Thursday on two charges of felonious assault.\nNeighbors expressed frustration and disbelief in the aftermath of the shooting.\n\"We shouldn't have to live like this. It's almost like we're under siege or something,\" neighbor Peggy Harris said. “There's no value on life anymore and bullets don't have eyes. I mean, the people on the other end of this, they need to pull themselves together.”\nCincinnati police said numerous people were outside when shots rang out Wednesday night.\n\"I was in my yard pulling weeds from my plants, and I heard I think about two or three gunshots,\" Harris added.\n\"That baby could have been anybody's baby,” neighbor Leyxus Warren said. “He was somebody's baby and it's wrong. I have a six month old, what if we were outside, what if she was in her walker.”\nPolice said that witness accounts have been somewhat murky throughout the investigation.\nAssistant Police Chief Paul Neudigate said safety of neighbors is their primary concern, and someone has to be held accountable.\n\"This is just completely unacceptable,” Neudigate said. “We have a small child shot, and we need the community's help. We need to put this one down. We need to hold someone accountable.\""}