{"uri": "http://www.mercurynews.com/2016/10/24/san-jose-victims-identified-in-last-two-deadly-shootings/", "title": "San Jose: Victims identified in last two deadly shootings", "dct": "Mon, 24 Oct 2016 15:46:00 GMT", "id": "bdf02ec860f1d987396e81dbb0271590", "content": "SAN JOSE — Authorities have identified a woman shot to death in front of an East San Jose home over the weekend, as well as a teen who was killed in a shooting last week, according to San Jose police.\nThe most recent killing occurred just before 6:30 a.m. Sunday when two unidentified men in their 20s walked up to a driveway on Lavonne Avenue near McCreery Avenue and opened fire on a woman and man who were outside.\nLaura Garcia, 35, of San Jose, was fatally wounded and died at a hospital. The man, described as Garcia’s relative, was hit in the foot and is expected to survive.\nA motive for the attack has not been released, but a source familiar with the investigation told this newspaper that one or both of the suspects yelled out gang slogans during the attack. Family members said neither Garcia nor the male relative has any gang affiliations.\nThe shooting left Garcia’s survivors searching for answers.\n“She was a good person and a great mother, and very loved,” said a cousin who asked not to be named out of safety concerns. “It’s unfair that they took her life from us. She was an innocent bystander.”\nThe cousin also lamented how Garcia was victimized right in front of her home.\n“We can’t be safe in our own homes?” she said.\nThe death marked the city’s 40th homicide of the year, a total that is well ahead of the 30 recorded in San Jose in 2015.\nThe 39th homicide occurred Wednesday evening in the area of Dove Hill Park near Ravens Place Way and Muir Place. Police were alerted to the shooting only after two male victims showed up at a hospital.\nOne of the victims in that case, 17-year-old Umberto Salas of San Jose, came in suffering from a gunshot wound and died at the hospital. The second victim, an adult male, was not shot.\nThe surviving victim reportedly told police that he and Salas were sitting in a parked car near the park when two unknown suspects walked up to the vehicle and tried to rob them. He said he was assaulted and that Salas was shot, and that the attackers fled.\nAnyone with information about these cases can contact the San Jose Police Department homicide unit at 408-277-5283. Tips about Garcia’s case should be directed to Detective Sgt. Pat Guire or Detective Todd Jennings, and tips about Salas’ case should be directed to Guire or Detective Raul Martinez. Tips can also be left with Silicon Valley Crime Stoppers at svcrimestoppers.org."}