{"uri": "http://www.thepilot.com/news/child-and-teen-injured-in-drive-by-shooting/article_55ffb114-9d55-11e6-84ad-07821cfb7d28.html", "title": "Young Girl Killed, Child in Critical Condition After Drive-By Shooting", "dct": "Fri, 28 Oct 2016 00:00:00 GMT", "id": "5453373c545a63727e9f496b4c5af137", "content": "Police are searching for the people responsible for a drive-by shooting on Friday afternoon that left a teenage girl dead and a small child in critical condition.\nTwelve-year-old Jalinda Campbell, a sixth grade student at Southern Middle School in Aberdeen, died in the hospital. Her nephew, Kyleigh Graham, 3, remains in critical condition, according to authorities.\nThe two young victims were sitting on the porch outside their duplex apartment at about 4 p.m. when someone drove up and began firing, according to a neighbor who witnessed the incident.\nSouthern Pines Police Capt. Charles Campbell said the shooter was targeting a separate individual who has not been identified. \"It was not a random act of violence,” he said.\n“Today, the families of Jalinda Campbell and Kyleigh Graham are suffering an overwhelming grief and heartache,” Police Chief Robert Temme said in a statement released Saturday. “The Southern Pines Police Department shares the pain and sorrow felt by these families, as does our entire community.”\nOfficers from the Southern Pines Police Department and members of the Moore County Sheriff’s Office Special Operations Team responded to the shooting. Authorities were on the scene collecting evidence late into Friday evening.\nA neighbor reported that one of the suspects was driving a gray Toyota Camry. He appeared to be in his mid-20s, the neighbor said.\nA crowd of neighbors gathered outside the apartment Saturday evening for a candlelight vigil. Earlier in the day, family members described Campbell as a bit of a tomboy who loved sports and school.\nAnyone with information can call the police department’s main line, (910) 692-7031; the department’s Investigation Division, (910) 693-1481; or the Crime Tip Line at (910) 693-4110. All information will remain confidential and can be provided anonymously."}