{"uri": "http://wncn.com/2016/10/28/2-children-shot-in-southern-pines/", "title": "12-year-old dies in Southern Pines shooting; 3-year-old stable", "dct": "Fri, 28 Oct 2016 19:28:00 GMT", "id": "ad156157bb2ae49c555e223f97cf2806", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nSOUTHERN PINES, N.C. (WNCN) – A 12-year-old girl has died after being hit by gunfire during a drive-by-shooting in Southern Pines Friday evening, and a 3-year-old boy was badly injured, police said.\nUPDATE: Vigil held for Southern Pines girl slain in drive-by shooting\nThe 3-year-old is now in stable condition and is still being treated, police said.\nJalinda Campbell, 12, and Kyleigh Graham,3, were sitting on a porch outside the apartment where they both lived when the shooting happened, according to police. The shooting took place at about 3:49 p.m. at 714 West Michigan Avenue, police said.\nPolice said the shooting was not random and people at the home knew the shooter. Police also said the investigation revealed that the drive-by-shooting had an intended target, but both victims were innocent bystanders.\nPolice have a suspect, but are not releasing his name yet.\nSouthern Pines police detectives are still investigating. Anyone with information is asked to call the Southern Pines Police Department at (910) 692-7031 or the Crime Tip Line at (910) 693-4110.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}