{"uri": "http://www.wave3.com/story/29047438/ksp-solider-fatally-shots-11-year-old-daughter-himself", "title": "KSP: Soldier fatally shoots 11-year-old daughter, himself", "dct": "Fri, 26 Jun 2015 23:25:00 GMT", "id": "3dcf8c355b7869c8c37b67758590da9c", "content": "VINE GROVE, KY (WAVE) – Neighbors are shaken after an Army soldier and his 11-year-old daughter were found dead outside of their Hardin County home in an apparent murder-suicide.\nThose who lived by the family said Tasha Jonas, 11, was rarely was seen without a smile and her bike.\n\"As sweet as can be, you know always laughing about something giggling about something,\" neighbor Nellie Rios said.\n[PREVIOUS STORY: Vine Grove neighbors shocked by murder-suicide involving 'sweet' girl]\nKentucky State Police believe Lieutenant Colonel John Jonas shot Tasha and then turned the gun on himself. One neighbor, who did not wish to be identified, believes Jonas may have called police right before. She said she heard the shots and not long after officers were at her door asking if they had seen their neighbor. By that point her husband made the horrific discovery.\n\"He looked around this truck and told the officer here they are right here laying in the yard,\" the woman said.\nShe said Jonas was in uniform.\n[PREVIOUS STORY: KSP: Father, daughter dead in apparent murder-suicide]\nJonas' next door neighbor, Jeff Manning, said he talked to Jonas almost daily.\n\"In fact yesterday, I had spoken to him as he was coming home from work and he just kind of broke off the conversation and walked in the house,\" Manning said.\nHe only remembers one time he heard him raise his voice.\n\"I did hear him get upset with her over her homework one time and he was very disappointed in her and she was crying and he was hollering at her,” said Manning.\nManning said Jonas was close to retirement from the Army's Human Resources Command at Fort Knox. He said Jonas was a single father and Tasha's mother lives out of state.\n\"He seemed like a good dad though, and I noticed that he made a lot of effort,\" Manning said.\nWhile the extent of Jonas' military background is unknown, neighbors feared he may have suffered from PTSD.\n\"For us, it's like what did we miss, what didn't we see and PTSD is real, it's real and you don't expect it to hit this close to the house,\" said Rios.\nTroy Yocum is the president of Active Heroes, an organization that helps veterans in hopes of preventing military suicide. He said it's tragedies like this that brings the reality to light.\n\"There's a lot of higher ranking officers and NCOs in the military that think that they are above sort of this I need help level,\" Yocum said. \"They are uncomfortable reaching out and asking for help.\"\nThe HRC is expected to release more information about Jonas on Wednesday.\nGrief counselors will be on hand at Vine Grove Elementary.\nCopyright 2015 WAVE 3 News. All rights reserved."}