{"uri": "http://www.courierpostonline.com/story/news/crime/2016/08/09/burlington-township-murder-suicide/88453434/", "title": "Murder-suicide shakes Burlington neighborhood", "dct": "Tue, 09 Aug 2016 00:00:00 GMT", "id": "2ff6db3ca41be58392419444a5252f23", "content": "BURLINGTON TWP. - A township man fatally shot his wife and 10-year-old son, then took his own life, authorities said Tuesday.\nRuben Johnson Jr., 50, allegedly killed his wife, Mashanda, 48, and their child in the family's Sunflower Circle home, the Burlington County Prosecutor's Office said.\nMORE SOUTH JERSEY CRIME NEWS\nPolice found the bodies around 10:15 p.m. Monday after a relative requested a wellness check there, the prosecutor's office said in a statement. The shootings occurred sometime Monday evening, according to the prosecutor's office.\n\"The motive for the shootings is being investigated,\" the statement said.\nAdditional details about the incident were not immediately available.\nOnline records show the couple's home, purchased for $500,000 in 2005, is scheduled for a sheriff's sale in October.\nNeighbors described the youth, Ruben III (Tre), as friendly and well-liked. They said an adult daughter, LoraVon, lived out of state.\n\"Tre was on his bike all the time. He got along with everybody,\" said Anthony Rosati, whose son regularly played with the boy.\nAnother neighbor, who did not give her name, said the mother was \"incredibly nice and sweet.\"\nBut the husband, who used the nickname \"Easy,\" was described as a big man who kept to himself.\n\"He was quiet,\" Rosati said.\nHe and other neighbors said Johnson ran a nightclub, Bogies Lounge, in East Orange, Essex County.\nA club representative could not be reached.\nIt was not immediately known if Mashanda Johnson had an occupation.\nLoraVon Johnson addressed the shooting on her Facebook page, saying she had lost \"my two best friends.\"\n\"I want everyone to tell me (this) is just a bad dream,\" she wrote. \"I lost the biggest part of my heart.\"\nSupporters launched an effort to cover $20,000 in funeral costs through gofundme.com.\nThe appeal says Mashanda, originally from Montclair, \"was one of the kindest people on earth, often offering to give even what she didn't have. Her smile was infectious and her sense of humor kept many in stitches.\"\nIt says Tre was \"so smart and super sweet and could light up a room with his warmth and energy. He was always willing to share, his kindness acquired from his mom.\"\nThe appeal does not mention Ruben Jr.\nThe shooting shook an upscale neighborhood where tree-lined streets wind past stately homes.\nNeighbors noted a large number of police responded to the incident, bringing a robot that searched the home.\n\"It's unbelievable,\" said Rosati, noting the slain boy and his own son regularly visited each other's homes.\n\"I just wish he'd been here last night,\" Rosati said of Tre. \"At least he'd have had a chance to live. This guy (Ruben Jr.) took that from him.\"\nThe township school district said grief counselors will be available at Burlington Township Middle School from 9:30 a.m. to 2:30 p.m. and 5:30 to 8:30 p.m. Wednesday.\nThe district's website also has information to help children cope with the deaths, Superintendent Mary Ann Bell said in a statement.\n\"Our thoughts and prayers go out to all those who have been touched by this sudden loss,\" she said. \"In times like this we need to come together as a community to support each other.\""}