{"uri": "http://www.contracostatimes.com/news/ci_23939970/four-people-including-two-girls-wounded-oakland-shooting", "title": "Four people, including three children, wounded in Oakland shooting", "dct": "Sun, 25 Aug 2013 19:47:00 GMT", "id": "bf4b5bbb55859a1300c1d4941f0a2ce7", "content": "OAKLAND — Four people, including three children, were wounded Sunday in a daytime shooting near the corner of 104th Avenue and Graffian Street in East Oakland, police said.\nOfficers were called about 2:20 p.m. to the 1300 block of 104th Avenue after receiving multiple phone calls about a shooting there, police said.\nPolice learned that three victims — a mother and her two young daughters — were inadvertently stuck by gunfire while outside their home in the North Stonehurst neighborhood. The 44-year-old mother and her daughters — ages 8 and 11 — were innocent victims, police said Sunday night.\nA 17-year-old boy, police said, was the intended target, and was struck in the leg by gunfire. The mother and her older daughter were struck in the lower legs. Her younger daughter was grazed in the hand.\nThe victims went to local hospitals for treatment and were all expected to survive their injuries, police said.\nA few houses were also hit by gunfire during the shooting, but no other injuries were reported.\nOfficers had portions of 104th Avenue and Graffian Street shut down for the investigation. About 18 yellow evidence placards marked the crime scene.\nPolice on Sunday night were still gathering suspect information and working to establish a motive.\nPolice and Crime Stoppers of Oakland are offering up to $20,000 in reward money for information leading to the arrest of the shooters. Anyone with information can contact police at 510-238-3326 or Crime Stoppers at 510-777-8572 or 510-777-3211 or by email at Oaklandhomicide@oaklandnet.com.\nStaff writers Malaika Fraley and Harry Harris contributed to this report. Contact Natalie Neysa Alund at 510-293-2469. Follow her at Twitter.com/nataliealund."}