{"uri": "http://www.newsnet5.com/news/local-news/cleveland-metro/two-people-shot-during-robbery-at-barbershop-on-clevelands-westside", "title": "5-year-old shot during attempted robbery at barbershop on Cleveland's west side", "dct": "Wed, 12 Oct 2016 20:15:00 GMT", "id": "f4923fc8042b8eb0c47b5970bf8a132b", "content": "Autoplay:Three people shot during robbery at barbershop on Cleveland's westsideCONNECTING...\nCLEVELAND - A 5-year-old and a man were shot in the middle of a crossfire at a Cleveland barbershop between two groups of people during an attempted robbery Wednesday night.\nCleveland police were called to the business on the 5900 block of Storer Avenue after reports of shots fired. Once police arrived, they found the child with a gunshot wound to his foot, according to an incident report.\nDuring the investigation, witnesses told police two males — one wearing a gray hoodie and carrying a large handgun — walked in to the barbershop, approached one of the barbers and told him to give him everything he had. A second man dressed in a red hoodie walked in behind the first man and pulled out a pink handgun.\nDescriptions of the men were vague in the incident report.\nMoments later two barbers pulled out their guns and began shooting at the two males. More than a dozen shots were exchanged at the business nestled on the corner of a busy and narrow street, police have said.\nA 26-year-old man was shot in the back and in the groin during the exchange, the incident report said.\nThe child and the man were taken to a Metro hospital to be treated for their injuries.\nThe barbershop was closed Thursday.\nMultiple bullet holes at Prodigy Cuts & several at Dairy Deli. @wews pic.twitter.com/Fl2ZvbhYno\n— Sarah Phinney (@sarahephinney) October 13, 2016\nWitnesses told police they think the 26-year-old man was involved with the other two men and setup the botched robbery. One witness told police the man had already received a haircut, made a phone call and then returned just before the two males entered the barbershop. The man also ran out the front door with the two males during the shooting.\nDetectives are waiting to interview the man to determine if he was involved in the robbery, Cleveland police spokeswoman Sgt. Jennifer Ciaccia said.\nA second witness told police he saw a black male in all red run from the barbershop, sit down at the corner and make a phone call. The witness said he heard the person on the other end of the phone ask the man \"You just got shot in the chest?\" That is all the witness heard, the incident report said.\nPolice were later called to Metro Hospital after a man was dropped off at the entrance with a gun shot wound to the chest. Witnesses to the shooting identified the man as one of the shooters who attempted the robbery at the barbershop. The man was later arrested at the hospital by police.\nSgt. Ciaccia said the man arrested at the hospital was a 16-year-old who had a gunshot wound to the chest. The two men named in the report who were involved in the robbery were still on the loose, she said.\nCopyright 2016 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}