{"uri": "http://chicago.suntimes.com/news/man-dead-6-wounded-in-city-shootings-thursday/", "title": "Man dead, 6 wounded in city shootings Thursday", "dct": "Fri, 09 Dec 2016 03:23:00 GMT", "id": "b4dd8f055203af5f639448a3a398c991", "content": "A man was killed and at least six more people were wounded in shootings across Chicago on Thursday.\nThe homicide happened about 4 p.m. in Englewood on the South Side, where a 31-year-old man was letting a passenger out of his vehicle in the 7100 block of South Morgan when someone walked up and shot him in the chest, according to Chicago Police. The man tried to drive away and crashed into three other vehicles. He died at the scene, authorities said. The Cook County medical examiner’s office has not released his name. Three other people were hurt in the crash, including a 5-year-old boy.\nThe latest nonfatal shooting happened about 9:30 p.m. in the same neighborhood. A 17-year-old boy was in an alley in the 6300 block of South Morgan when he heard gunfire and realized he’d been hit in the shoulder. He was taken to Stroger Hospital, where his condition was stabilized, police said.\nAt 9:08 p.m., a 25-year-old man was getting into a vehicle in the 5600 block of West Washington in Austin when another car pulled up and someone got out to shoot him repeatedly, police said. He was taken to Mount Sinai Hospital in critical condition.\nJust before 6 p.m. in Austin, a bullet grazed the arm of a 27-year-old man in the 5700 block of West Augusta, police said. He showed up at West Suburban Medical Center in Oak Park in good condition.\nAbout 3:15 p.m., a 25-year-old man was sitting in a car parked in the 2200 block of North Cicero in the Northwest Side Cragin neighborhood when someone opened fire from behind him, grazing his head, police said. He was in serious condition at Illinois Masonic Medical Center.\nTwo hours before that, a 20-year-old man sitting in a vehicle parked in the 400 block of North Springfield in Humboldt Park was shot in the face. He was stabilized at Mount Sinai, police said.\nThursday’s first shooting happened about 7:40 a.m. in Little Village on the Southwest Side. A 35-year-old man was shot in the chest in the 2900 block of West 25th Street and taken in serious condition to Mount Sinai, but he wasn’t cooperative with investigators, police said.\nEight people were shot in Chicago on Wednesday."}