{"uri": "http://www.khou.com/story/news/crime/2015/12/11/hpd-16-year-old-shot-while-playing-guns/77137128/", "title": "HPD: 16-year-old shot while playing with guns", "dct": "Fri, 11 Dec 2015 00:00:00 GMT", "id": "3898dbfa9ed31046697f62cc77d65457", "content": "HOUSTON – A family is at the hospital pulling for a 16-year-old boy's recovery Friday morning.\nPolice say some poor choices he and some friends made inside in an upstairs apartment could lead to lifelong consequences.\nAccording to the Houston Police Department, the group of teenagers were playing with guns at the Villa Nueva Apartments in the 5300 block of West Gulf Bank near West Montgomery Road.\nPolice say at about 9:30 p.m. Thursday one of the friends accidentally fired off a shot. The bullet piercing the 16-year-old in the chest.\nHe is expected to survive, but police say he could be paralyzed as a result of that gunshot wound.\nThe young woman, who is staying in the apartment next door to where this happened, says she ran outside after hearing the gunshot and did what she could to keep the teen conscious.\n\"I was talking to him the whole time he wasn't really responding. All he was saying is my chest hurt,\" Leticia (last name withheld) said. \"He kept trying to look up and I kept bringing his attention back down.\"\n\"It's just so sad these kids are left to run around all the time. That's what it is. Unsupervised kids it's not so much guns. It's just that parents aren't watching their kids,\" Melissa Pulido, neighbor, said. \"They're not taking their responsibility.\"\nThe friend who accidentally shot the teen boy has been arrested and is now in the Harris County Juvenile Detention Center on a charge of aggravated assault with a deadly weapon.\nInvestigators were scene removing several firearms from the apartment where this happened, including what looked like a semi-automatic rifle.\nPolice say the 22-year-old who rents the apartment where this happened has also been arrested on a charge of possession of a controlled substance with intent to deliver.\nThe teen who was shot is listed in serious condition."}