{"uri": "http://www.rrstar.com/news/20160731/neighbors-report-early-morning-gunfire-15-year-old-male-dead-in-rockford-shooting", "title": "15-year-old male dead in Rockford shooting, neighbors report early morning gunfire;", "dct": "NODATE", "id": "4b2368e2a415e96870e23034761f8c1c", "content": "ROCKFORD - David Garcia and Kierra Minor woke up this morning to six gunshots outside their window as their infant son slept in the next room.\n\"It felt extremely close to where we were,\" Minor said. \"I looked out of our son's room and saw two cars leaving and heard a bunch of commotion.\"\nAs cop cars rolled in, neighbors stood outside their houses to find out what was going on. Minor said she didn't notice the body lying in a pool of blood on the driveway at the house next door until a few minutes later.\n\"It was the worst thing I have ever seen,\" she said.\nA 15-year-old male was killed and two other teens were shot following what police said was an argument at a house party in the 3200 block of Green Dale Drive in Rockford's Rolling Dale neighborhood, near Hillman Elementary School.\nRockford police responded to a call of shots fired about 1:30 a.m. On arrival, officers found the 15-year-old with a head wound. He was taken to a local hospital where he was pronounced dead.\nShortly after, 17- and 13-year-old females arrived at the hospital with injuries sustained at the same party. They were treated and released, according to the department.\nPolice said none of the shooting victims are believed to have been involved in the dispute.\nThis is the 12th homicide in Rockford this year and the fifth that involved a victim who was younger than 18. There were 19 homicides in the city last year.\nThe investigation is ongoing.\nDavid and Claudia Jackson have lived in a house across the street from the shooting since 1981. David Jackson called 911 when he looked outside his window about 1:30 a.m. and saw flashes as gunfire began. Police arrived within a minute, he said.\nIt's not the first time he's called police because of the neighbors, he said. Parties take place at the house where the shooting occurred at least a few times a month, and he's called before about the noise and nuisance, Jackson said.\nHe said he is increasingly frustrated.\n\"I have to live here,\" he said. \"I'm retired. I can't afford (to move.) My house has been paid off for 31 years. ...; It's got to stop.\"\nClaudia Jackson said she would like to start a neighborhood coalition to address the problem.\n\"When we move, we want it to be our decision,\" she said. \"We don't want to feel like we are running scared. That is why we have to do something.\"\nAnyone with information regarding this incident is asked to contact the Rockford Police Department at 779-500-6500 or Crime Stoppers 815-963-7867.\nBrittany Keeperman: 815-987-1395; bkeeperman@rrstar.com; @BKeeperman"}