{"uri": "http://winningdemocrats.com/2-year-old-in-critical-condition-after-authorities-say-a-gun-shot-itself/", "title": "2-Year-Old In Critical Condition After Authorities Say A Gun Shot Itself", "dct": "Tue, 05 Jan 2016 00:00:00 GMT", "id": "6e6e47b3ebe94f1d6f82dc1384d3363d", "content": "Yet another example of how guns do not kill people happened today when a 2-year-old boy shot himself with a gun he found in the front of his grandfather’s truck.\nThe boy’s family said that he was riding with his grandfather in the truck when the man parked in the driveway to stop briefly inside the boy’s house. He left the child in the backseat playing with tools.\nFifteen seconds later the boy had acquired the .32 caliber Kel-Tec gun out of the driver’s side door pocket, removed it from its holster, and promptly shot himself in the face.\nAuthorities said that they were not sure if the gun went off on its own.\nIf the gun went off on its own, maybe guns DO kill people. However, I seriously doubt that the boy would have shot himself while not holding a gun.\nThe child inexplicably did not harm himself with the tools he was playing with in the back of the truck. According to gun nuts, tools like hammers kill people more often than guns do in America. So…. why did the child have to go for the gun again?\nThe boy’s family told the local news that he was talking and trying to comfort his family while waiting patiently for the ambulance to arrive. Are you kidding me? A 2-year-old shot himself in the face and they are saying the kid was trying to comfort them?\nThe county sheriff’s office has declined to say if charges would be forthcoming while the investigation is ongoing.\nWhat the hell is there to investigate?! There isn’t a conspiracy of ninjas hidden in the glove box of this guy’s truck waiting to use guns he lets carelessly in his vehicle to shoot 2-year-olds that are also in the truck by coincidence.\nAuthorities apparently call this an accident, because the adult had no control over whether or not he left his own loaded gun in the truck with a toddler.\n#BREAKING: Officials told me seconds ago that all evidence is pointing towards an accidental shooting. #WFTV pic.twitter.com/CJyLr3apoD\n— Jeff Levkulich (@jlevkulichWFTV) January 5, 2016\nFeatured image via Photobucket"}