{"uri": "http://fox4kc.com/2013/06/23/prospect-shooting-spree-puts-nine-in-hospital-two-critically-hurt/", "title": "One dead, eight injured after Prospect shooting spree", "dct": "Sun, 23 Jun 2013 09:00:00 GMT", "id": "49d957bfa4beba5cb4b66968365361fd", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nKANSAS CITY, Mo. – An early morning shooting Sunday at a makeshift nightclub near 19th and Prospect sent a total of nine people to area hospitals. Two are still battling serious injuries and one person died from gunshot wounds, according to KCPD Chief Darryl Forte who posted the information on Twitter.\nPolice said the victim has been identified as Marlon E. Randolph, 23, of Kansas City.\nOfficers responded to the shots fired call at approximately 3:30 a.m. on Sunday.\nA crowd outside the club was estimated to be between 250 - 300 people. There were shots fired both inside and outside the club. One witness, Mimi Fuller, was inside the club and described how the incident began.\n“It was a fight and then after the fight it was just shooting, a couple of shootings. We went out the exit door and hid until we didn’t hear anymore shooting.” Fuller said\nWitnesses told FOX 4 News their versions of what happened.\n\"Everyone was ducking and taking cover. It was like a movie, but people were really getting killed around me,\" said Mark Newton, a witness, told FOX 4 News.\nNewton was inside the make-shift garage turned nightclub when the shooting started. He said he hit the floor while people around him ducked or ran.\n\"I heard three different pow, pow, pow. We hid until the pow, pow was over. We went to the front. Police were everywhere,\" Fuller said.\nCab driver John Maddux was parked directly outside. His card was trapped in a sea of frightened people.\n\"It was mass pandamonia and I couldn't go backward. Gunshots were forward, so I was like, 'What do I do?,'\" he said.\nBullets rained down. Inside the cab, Maddux said he feared for his life until out of no where a police officer appeared. He was carrying an assault rifle at the ready.\n\"Got out all by himself. No backup with assault rifle and started pointing the gun at everyone,\" Maddux recalled.\nWhen Maddux felt safe, he recorded a video of the officer using his phone. Maddux said the officer's brave action scattered 300 people in under two minutes without firing a shot.\n\"Jumping out in front of 300 people with guns takes a lot of guts,\" he said.\nSome witnesses to the shooting waited throughout the morning for police to interview them and release their vehicles from the crime scene.\nMr. Swag, the owner of the club, who is also part of the biker group known as the Red Line Riders, told FOX 4 News his biker group has been out in the community doing good and this latest incident is not something they stand for.\n\"It hurts to see someone in the city pass away, but it hurts even worse when you are around it when the incident happens. We have events here frequently. We never have had any incidents, but all it takes is one time, one bad apple and that record is tarnished,\" he said.\nSo far, no suspect has been arrested in the case If you have any information, call the TIPS Hotline at (816) 474-TIPS."}