{"uri": "http://www.kansascity.com/news/local/article322158/Officials-shut-down-KC-motorcycle-club-the-site-of-a-fatal-shooting.html", "title": "Officials shut down KC motorcycle club, the site of a fatal shooting", "dct": "Thu, 27 Jun 2013 18:13:00 GMT", "id": "ba917b824004e61eab31abe06d94441c", "content": "City and county officials have shut down a Kansas City motorcycle club where a shooting early Sunday killed a man and wounded eight.\nJackson County’s Drug Abatement Response Team brought city code inspectors and the fire marshal to the building at 1917 Prospect Ave. for an inspection Tuesday.\nThe fire marshal cited seven violations, including four electrical issues. Others concerned the storage of a gas can inside the building, lack of an inspection tag on a fire extinguisher and non-working smoke detectors.\nThe fire marshal shut off electricity to the building until the owner corrects the problems using a licensed electrician, according to the inspection report. The fire marshal also notified the building’s owner that the maximum occupancy is 49.\nThe owner, who refused to provide his name to The Star when reached by phone, said the violations were small, such as not having outlets covered, and nearly all the violations had been fixed. He said he began renting the building to the Redline Riders motorcycle club about a year ago after the club approached him and said it was a nonprofit group working toward nonviolence.\nBecause of the recent problems, the owner said, he probably will seek a beautician or barber for his next tenant.\nPolice accompanied the inspectors Tuesday and cited the motorcycle club with running a nuisance business, said Sgt. Brad Dumit, who supervises the vice unit. He said the ordinance violation included allegations of blocking the street and sidewalk and playing loud music late at night.\nView Larger Map\nThe club drew the attention of police and city and county officials after the 3:30 a.m. melee Sunday that started inside the club. When officers arrived, they saw 250 to 300 people fleeing.\nPolice say many of the people were not inside the club but were nearby along Prospect Avenue. Club patrons told police they paid a cover charge and gave donations to buy beer.\nA disturbance between two or more people inside the club led to a gunman opening fire in the cramped quarters, said Sgt. Joe Mabin. The dispute spread outside, where more than one gunman continued to fire, Mabin said. The bullets killed Marlon E. Randolph, 23, and critically wounded a teenage girl, who was shot in the head.\nDetectives still don’t know exactly what kicked off the dispute. They continue to look for witnesses.\nAnyone with information should call the TIPS Hotline at 816-474-TIPS (8477)."}