{"uri": "http://www.wfaa.com/news/crime/duncanville-hs-student-hit-by-bullet-during-aggravated-robbery/364903984", "title": "Duncanville HS student shot during bus stop robbery", "dct": "Wed, 07 Dec 2016 00:00:00 GMT", "id": "02b5da20f68f7a7ebb508b9bfb179294", "content": "CEDAR HILL -- Police are investigating after a high school student was shot at a bus stop.\nThree Duncanville High School students were waiting for a bus near Straus Road and McAllister just before 7 a.m. Wednesday in Cedar Hill. Police say a man wearing a ski mask and dark clothes approached them, demanding items and firing one shot from a gun.\nOne of the students, a 16-year-old, was shot in the lower leg, and the other two students took off running. The suspect ran from the scene and got into a white passenger vehicle.\nThe victim got onto the bus and alerted the driver, who took him to Duncanville High School. From there he was taken to a hospital with non-life threatening injuries, police say.\nIf you have any information, you are asked to call Cedar Hill PD.\nTia Simmons, principal for Duncanville High School, released the following letter to student and parents:\n\"Our students’ safety is always our top priority, and with that in mind, we wanted to inform you about an incident that occurred this morning at one of our bus stops.\nA few Duncanville High School students were waiting for the bus in Cedar Hill when a person approached them in an apparent robbery attempt, during which one student was shot in the foot.\nThe injured student got on the bus and told the driver that he had been shot. This was the final bus stop, so the driver notified authorities and continued to school. Our administrative staff immediately provided medical attention to the student until paramedics arrived and the student was transported to a local hospital.\nThe Cedar Hill Police Department is the investigative agency and will remain in the area throughout the day. If anyone has information about this incident, please contact Cedar Hill Police at 972 291-5181.\"\nCopyright 2016 WFAA"}