{"uri": "http://www.wfaa.com/news/local/dallas-county/dallas-shop-owner-describes-visit-from-suspected-baton-rouge-shooter/276303268", "title": "Dallas shop owner describes visit from suspected Baton Rouge shooter", "dct": "Mon, 18 Jul 2016 00:00:00 GMT", "id": "2900dbbfed40b98c7810f9a7c724afae", "content": "DALLAS — Workers at two of barbershops in Oak Cliff say they were shocked when they saw images of the suspected gunman, who investigators believe killed three officers in Baton Rouge.\nStylists at His & Hers and Classics barbershops say Gavin Long popped into the salons last week, just days after five Dallas officers were shot and killed by another man.\n\"This is unbelievable,” said Bryan Davis while shaking his head.\nDavis is the manager of His & Hers. He was cutting a client’s hair when Long entered the salon last Saturday.\nMy bodycam footage of me in Dallas out in them streets educating our people pt3\n# Stand Tall, Stand Wild, Stand Free pic.twitter.com/PbiYsQBPSW\n— Convos With Cosmo (@ConvosWithCosmo) July 10, 2016\n\"He came in and basically took over the floor,” Davis explained.\nWorkers say Long asked to hand out copies of a book he wrote called The Cosmo Way. It's a book about eating healthy, specifically geared toward African Americans.\nNo one in the shop knew the man. Nor did the packed salon know Long was secretly recording his visit with a body camera. He posted the video on Twitter.\nDavis said, \"When he came in, we allowed him to have his voice. Once he cleared it up, what he was about, all red lights went up around the building.”\nWorkers say Long went on a short tirade. They described his behavior as quickly shifting from calm to aggressive.\n“Everybody was just kind of, you know, that was kind of weird,” Davis said. “It had never happened before.\"\nMy bodycam footage of me in Dallas out in them streets educating our people pt2\n# Stand Tall, Stand Wild, Stand Free pic.twitter.com/oJh1VDZ9B0\n— Convos With Cosmo (@ConvosWithCosmo) July 10, 2016\nLong also posted a video from Classics Barbershop to his Twitter account.\nWorkers say they are also shocked the guy is linked to the deadly police shootings in Baton Rouge. They, too, had no idea the man was secretly recording them in the shop.\n\"It do make you feel a little uncomfortable,” said one man who was working in the shop and asked not to be identified, “ when you are working in an environment where you have to be open to the public.”\nThe staff at Classics says it is concerned because they have no idea who Long was, nor with whom he may be associated.\nWARNING: GRAPHIC LANGUAGE\nCopyright 2016 WFAA"}