{"uri": "http://www.shreveporttimes.com/story/news/local/louisiana/2016/08/30/va-marine-vet-who-killed-3-baton-rouge-officers-did-not-have-ptsd/89580220/", "title": "VA: Marine vet who killed 3 Baton Rouge officers did not have PTSD", "dct": "Tue, 30 Aug 2016 00:00:00 GMT", "id": "77a2179fbb4052f47f1754842cafb2a5", "content": "WICHITA, Kan. — A former Marine who ambushed and killed three Baton Rouge law enforcement officers last month never saw combat in Iraq, but told doctors he suffered from post-traumatic stress disorder because a buddy showed him videos of maimed and decapitated bodies, according to newly released Veterans Health Administration medical records.\nGavin Long's doctors at the Veterans Administration Medical Center in Kansas City, Missouri, diagnosed him in November 2011 as suffering from an \"adjustment disorder with depressed mood,\" but not PTSD, according to documents provided to The Associated Press under the Freedom of Information Act.\nDuring his PTSD evaluation, the VA noted Long avoided movies about the war and was \"unable to experience tenderness, loving feelings.\" It also had a cryptic notation about some \"sense of foreshortened future.\"\nLong, a black military veteran from Kansas City, Missouri, shot and killed three law enforcement officers and wounded three others on July 17 outside a Baton Rouge convenience store. Long had posted rambling internet videos calling for violence in response to police treatment of African-Americans, which he said constituted \"oppression.\"\nMORE ON THIS STORY: Biden honors all officers: 'We owe you' | Baton Rouge shooter may have embraced bizarre outlook | Officer Matthew Gerald's 'end of watch came too soon' | Montrell Jackson laid to rest: 'Your legacy will live on in all of us' | Remembering Brad Garafola: 'You are forever our Superman. Fly high' | Editorial: Gavin Long's failed mission | Gunman’s manifesto describes actions as ‘necessary evil’\nTwo Baton Rouge police officers — 32-year-old Montrell Jackson and 41-year-old Matthew Gerald — and 45-year-old East Baton Rouge Parish Sheriff's Office Deputy Brad Garafola were killed in the shooting.\nLong served in the Marines from 2005 to 2010, including a seven-month stint in 2008 in Iraq. He was a data network specialist, and told VA doctors he witnessed casualties but did not fight in combat, according to his medical records.\nLong had gone to the VA in 2011 complaining about trouble falling and staying asleep. He avoided crowds and experienced \"suspiciousness of others,\" according to the documents. Family members reported he was more aggressive and angered easily, noting these were issues his ex-wife complained about.\n\"He feels sad but claims he does not know what he feels sad about,\" his medical file noted.\nIn 2011, his doctor wrote that he \"informed patient that in this writer's opinion, he did not meet the ... criteria for PTSD.\" He was prescribed the antidepressant citalopram. The VA also informed him about its mental health clinic and its 24-hour services in the area.\nBut the VA ultimately found he was stable with no evidence of imminent harm to himself or others, and determined that he had no mental health condition requiring further intervention.\nMore than a year later, Long denied during a December 2012 visit to a VA hospital in Atlanta, Georgia, that he had any mental health symptoms or readjustment issues and assured his doctors at the time that no follow up was needed. His last VA medical visit was in August 2013, related to asthma and injury to his shoulder and arm, the documents show,\nHis mother, Corine Woodley, told PBS talk show host Tavis Smiley, that her son would \"pretty much lose it\" and become furious every time he heard about a black man being shot by police in what he considered an unlawful manner. She said her son received a letter from the Department of Veteran Affairs denying his request for treatment of PTSD in 2013 on grounds that the disorder wasn't related to his medical service. The medical records the VA provided AP did not contain such a letter.\nBaton Rouge was the second mass shooting of law enforcement officers last month and drew attention to the treatment of veterans after they returned from Iraq and Afghanistan.\nMicah Johnson, an Army reservist who served in Afghanistan in 2014, killed five Dallas police officers at the conclusion of a peaceful march on July 7 in downtown Dallas. The demonstrators were protesting fatal police shootings in Minnesota and Louisiana. Johnson had sought treatment from the VA for PTSD symptoms. Long killed the three Louisiana officers 10 days later."}