{"uri": "http://www.wwltv.com/news/report-gavin-long-suffered-from-ptsd/277890156", "title": "Report: Gavin Long suffered from PTSD", "dct": "Wed, 20 Jul 2016 00:00:00 GMT", "id": "b09e2af9186e76c18f81fb96a6f3221b", "content": "BATON ROUGE -- The gunman Gavin Eugene Long, who is accused of killing three Baton Rouge police officers Sunday during a rampage, suffered from post-traumatic stress disorder or PTSD, CNN is reporting.\nLaw enforcement officials have said Long killed two Baton Rouge Police officers -- Montrell Jackson and Matthew Gerald -- and East Baton Rouge Parish Sheriff's Office Deputy Brad Garafola.\nLong joined the Marines in 2005 and received an honorable discharge in 2010. He also served in Iraq.\nThe Baton Rouge Advocate reported the Department of Veterans Affairs said in health records show “a number of contacts” with Long from 2008 to 2013, and Long’s last encounter with the VA was in August 2013.\nLong killed the three officers and injured three more during a shooting spree in which he specifically targeted police before a SWAT marksman killed Long from over 100 yards away, according to State Police.\nSources also told CNN Long was taking anti-anxiety medication, including Valium and Ativan.\n\"That is certainly in the realm of possibility,\" said Gov. John Bel Edwards during an appearance on the Eyewitness Morning News, \"but I cannot confirm that this morning.\"\nLong was in Baton Rouge for several days before going on the rampage, and investigators are trying to put together the timeline of his movements in those days.\nInvestigators believe that Long acted alone. \"At this point we know he was the only shooter,\" Edwards said. \"To the best of our knowledge, he was the only one at the scene of all of the shooting that was involved.\"\nBut investigators are still looking into Long's movements in the several days he spent in Baton Rouge and if he had help committing the acts.\n\"We trying to determine if had anybody on the ground in Baton Rouge assisting him,\" Edwards said. \"At this point we don't have enough information to say that he did.\"\nWhile State Police Col. Mike Edmonson made it clear that police officers were Long's main target, his motive for attacking police is still somewhat unclear.\nFor individual who received training in marksmanship and tactics to use against our nation's enemies and to turn that training against our nation's heroes, that is unspeakable,\" Edwards said. \"That is part of this episode we've got figure this out.\"\nEdwards said, however, it is clear that \"hate had affected his (Long's) heart.\""}