{"uri": "http://hudsonvalleypost.com/police-officers-killed-in-baton-rouge/", "title": "Multiple Police Officers Killed in Baton Rouge Ambush [UPDATED]", "dct": "Sun, 17 Jul 2016 12:09:00 GMT", "id": "c20f41ddb2963b41f498f34126d0926f", "content": "UPDATE: 3:00 P.M. ET: Two suspects are at large and being sought by police. The incident does not appear to be race-related, according to CNN’s law enforcement sources.\nUPDATE: Baton Rouge Police Department saying this shooting situation does not appear to be race related. https://t.co/C5rJD12MP5\n— George K. Howell (@GeorgeHowellCNN) July 17, 2016\nPresident Obama issued the following statement:\nI condemn, in the strongest sense of the word, the attack on law enforcement in Baton Rouge. For the second time in two weeks, police officers who put their lives on the line for ours every day were doing their job when they were killed in a cowardly and reprehensible assault. These are attacks on public servants, on the rule of law, and on civilized society, and they have to stop.\nI’ve offered my full support, and the full support of the federal government, to Governor Edwards, Mayor Holden, the Sheriff’s Office, and the Baton Rouge Police Department. And make no mistake – justice will be done.\nWe may not yet know the motives for this attack, but I want to be clear: there is no justification for violence against law enforcement. None. These attacks are the work of cowards who speak for no one. They right no wrongs. They advance no causes. The officers in Baton Rouge; the officers in Dallas – they were our fellow Americans, part of our community, part of our country, with people who loved and needed them, and who need us now – all of us – to be at our best.\nToday, on the Lord’s day, all of us stand united in prayer with the people of Baton Rouge, with the police officers who’ve been wounded, and with the grieving families of the fallen. May God bless them all.\nUPDATE 12:30 P.M. ET: A police spokesman, Corporal L’Jean McKneely, told reporters, “We’re not sure of anything right now. All we do know at this particular time is that there was a shooting. We believe there are multiple suspects. One suspect is deceased. Multiple officers were shot. We do have some that have been killed.”\nOriginal story begins here:\nA man in Baton Rouge, Louisiana, shot and killed three police officers and wounded several more in a Sunday-morning attack. Exact details remain unclear, as there are multiple conflicting reports at this time, but there have not been any further shots fired in at least the last hour as of noon ET. The scene is being described as “active but contained,” meaning the police most likely have the situation under control.\nApparently police received a call of a “suspicious person walking down Airline Highway with an assault rifle.” Airline Highway is near where groups of demonstrators have been gathering to protest the recent killing of Alton Sterling less than two weeks ago.\nThis post will be updated as further information comes in."}