{"uri": "http://www.wral.com/eight-injured-in-durham-drive-by-shooting-no-arrests-made/14846369/", "title": "Eight injured in Durham drive-by shooting; no arrests made", "dct": "Sat, 22 Aug 2015 00:00:00 GMT", "id": "f2dc61f0e21a3038c249c87acc0f0c2d", "content": "Video Playback Not Supported\nPlay Video\nPlay\nMute\nCurrent Time 0:00\n/\nDuration Time 0:00\nLoaded: 0%\nProgress: 0%\nStream TypeLIVE\nRemaining Time -0:00\nPlayback Rate\n1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptions\nFullscreen\nAutoplay:\nOn / Off\nThis is a modal window.\nThis video is not supported on your platform. Please make sure flash is installed.\nCaptions Settings Dialog\nBeginning of dialog window. Escape will cancel and close the window.\nText Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps\nDefaults Done\nEight injured in Durham drive-by shooting\nAre you still watching?\nYes, ContinueNo\nDurham, N.C. — A Durham neighborhood erupted into chaos Friday night after eight people were injured in a drive-by shooting that happened during a late-night cookout.\nAccording to Durham police, the shooting happened at about 10:30 p.m. at a home in the 2700 block of Hinson Drive.\nOne person remained hospitalized in serious condition Saturday afternoon. The other seven people, including a second person who was taken to a local hospital, did not suffer life-threatening injuries, police said. Their names have not been released.\nDeanna Wilson, who lives on Hinson Drive, said she heard between 15 and 20 gunshots that sounded like \"a roll of firecrackers.\"\n\"You didn't hear anything but gunshots, and then you heard a bunch of yelling and commotion,\" she said. \"The whole neighborhood erupted into chaos. Everybody came out of their house. You only see stuff like that on TV.\"\nNo arrests have been made, but a Durham Police Department spokesman confirmed that officers had canvassed the neighborhood earlier Friday because of increased tensions that resulted from a separate shooting earlier this week.\n“They were out canvassing, just knocking on doors,” Wilson said.\nAuthorities said Saturday that they are looking for a white vehicle that may have been involved in Friday’s incident.\nAnyone with information about the shooting should call Durham Crime Stoppers at 919-683-1200.\nCrime Stoppers pays cash rewards for information leading to arrests in felony cases and callers never have to identify themselves."}