{"uri": "http://www.mlive.com/news/grand-rapids/index.ssf/2016/03/man_forgot_gun_in_vehicle_befo.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+grpress+%28The+Grand+Rapids+Press+Latest+News+%7C+MLive.com%29", "title": "Man forgot gun in vehicle before son, 3, shot mother in head", "dct": "Tue, 08 Mar 2016 08:19:31 GMT", "id": "965b13f22dd7ec93541f7c8ebf71767e", "content": "KENTWOOD, MI - A man told police he forgot that he'd left his gun in his vehicle before his 3-year-old son found it and fired the weapon, hitting the boy's mother in the head.\nThe woman was not seriously injured.\nKentwood police reports did not name the parents but other sources identified them as Michele and Jacob Hanson.\nThe incident occurred around 2:35 p.m. Feb. 20 at the Hansons' home at 5745 East Grove Drive SE.\nThe father told investigators he was in his kitchen when he heard a gunshot coming from the garage. His wife was in the front passenger seat of their Chevrolet Traverse.\nTheir son was in the front seat holding a 9mm pistol.\nThe father took the gun and noted it had jammed after the first shot. He then helped his wife onto the driveway and called 911, reports said.\nThe woman told police she was sitting in the front passenger seat vacuuming while her son helped clean the sport-utility vehicle.\nShe told police that \"she looked down and heard a loud bang. (She) said she thought something had fallen and hit her in the head, and when she looked up (the boy) was holding the gun. (She) said she started screaming ... .\"\nThe father told police that he has a license to carry a concealed pistol. He usually has the weapon holstered when outside of his vehicle. When he is inside the vehicle, he usually secures it in the door compartment.\nThe father told police that earlier in the day, the family was out running errands when neighbors, who are moving, said they wanted to get together. When they got home, they visited the neighbors, then went back home.\nAt home, he typically secures it in a gun safe. He told police he must have been in a rush to see his neighbors and forgot to put it away.\nHe \"stated he does not typically leave his pistol in the car, however, he had been out running errands and had forgotten to take it out,\" police reports said.\nOne of the neighbors they had visited earlier rushed over after hearing the gunshot. She could see the boy standing inside the vehicle. She helped get the victim to the driveway.\nShe recalled hearing someone say, \"The gun was in the door of the car.\"\nPolice said the victim was taken to a hospital. She was treated and released later that day.\nChief Assistant Kent County Prosecutor Chris Becker said Jacob Hanson legally owned the firearm.\nJohn Agar covers crime and other issues for MLiveE-mail John Agar: jagar@mlive.com and follow him on Twitter at twitter.com/ReporterJAgar"}