{"uri": "http://www.tulsaworld.com/news/crimewatch/three-to-stand-trial-in-shooting-death-of-east-central/article_20baaee1-adab-5d79-a552-f54adfcafad4.html", "title": "Three to stand trial in shooting death of East Central High School football player", "dct": "Fri, 23 Dec 2016 00:01:00 GMT", "id": "651d5323eb858d1374efeeeda93a9336", "content": "Three people will stand trial in a drive-by shooting that resulted in the death of an East Central High School football player, a judge decided Thursday.\nDeonta Ramon Mullins, 19, and Zaire Dequan Ross, 18, waived their right to a preliminary hearing, but their co-defendant, 18-year-old Chrishun Marquiss Smith, appeared before Special Judge James Keeley, who determined that probable cause exists that Smith played a role in the Aug. 23 death of 17-year-old East Central senior Marquis Mullins.\nThe teenagers are charged with first-degree felony murder and two counts of using a vehicle while discharging a weapon, or in the alternative, shooting with intent to kill, and committing a gang-related offense in connection with an incident in the 1600 block of 125th East Avenue the day Marquis Mullins died.\nRoss and Deonta Mullins are additionally accused of possessing a firearm after juvenile adjudication. Although none of the teens fired the shot that killed Marquis Mullins, they all face felony murder charges because he died during the alleged commission of a felony.\nFormer Tulsa Police Department homicide detective Matt Frazier testified Thursday that Smith admitted in an interview to being at the scene on the day of the shooting. Frazier said Smith told him that Ross, alleged to be a Hoover Crips member, had a “beef” with the Bloods gang and wanted to “get back” at a group of people for a shots-fired incident at Ross’ mother’s home.\nSmith, according to Frazier, was with Deonta Mullins and Ross when they picked up Marquis Mullins from school. Frazier said Smith told him they were driving through a neighborhood when they saw two people, ages 16 and 19, who were the apparent subjects of Ross’ anger and subsequently opened fire on them from their vehicle. A third person fired back at the vehicle as it fled, police say, striking Marquis Mullins in the back. He died at Saint Francis Hospital.\nRoderick Harbin, the man believed to have fired the fatal shot, has not been charged in the case. Sgt. Dave Walker has said Harbin gave detectives a “plausible explanation” as to why he shot at the vehicle.\nHarbin also testified during Thursday’s preliminary hearing, later prompting Assistant District Attorney Isaac Shields to say Harbin had the right to defend himself in the matter.\nDefense attorney Brian Boeheim argued for Keeley to merge the two vehicle-related counts and said he doesn’t think the shootings should be counted as one incident, as Harbin and the others fired as the vehicle was fleeing the area.\nBoeheim additionally questioned the state’s witnesses on how they determined that Smith is a gang member and said the state didn’t prove there was intent to kill anyone.\nBut Shields said Marquis Mullins’ death is the result of “a series of events set in motion by the defendants,” and he called it a “gang drive-by shooting of other gang members.”\nDeonta Mullins, Ross and Smith will appear Jan. 3 for trial court arraignment before District Judge Sharon Holmes."}