{"uri": "http://www.tulsaworld.com/news/crimewatch/brother-of-slain-east-central-football-player-named-tulsa-s/article_cdbe367a-6e28-5652-8a1c-3ed08d394962.html", "title": "Brother of slain East Central football player named Tulsa's Most Wanted fugitive", "dct": "Sat, 22 Oct 2016 00:01:00 GMT", "id": "b7854cbe209149c28b5908ba193d503d", "content": "Related story: Two arrested in shooting death of teen after attempted drive-by; suspected shooter released\nThe alleged driver in an attempted drive-by shooting that left his teenage brother dead in August has been named the Tulsa Police Department’s Most Wanted fugitive.\nDeonta Ramon Mullins, 19, is wanted on charges of first-degree murder and two counts of using a vehicle while discharging a weapon in connection with the shooting death of 17-year-old Marquis Mullins. The deceased teenager was a senior at East Central High School and also played on the school’s football team.\nDeonta Mullins is the third man to be charged in the slaying. Zaire Dequan Ross and Chrishun Marquiss Smith, both 18, have been in the Tulsa Jail since their arrests on Aug. 24.\nAccording to police reports, Deonta Mullins drove his brother, Ross and Smith to the area of the 1600 block of 125th East Avenue on Aug. 23 with the intent of shooting two people, ages 16 and 19, who they claimed had attacked Ross in the past. From inside the Mullins’ family vehicle, Smith and Ross allegedly opened fire on the pair as they walked along the street, but neither was hit.\nA man who lived with one of the intended targets fired two shots at the fleeing vehicle, striking Marquis Mullins in the back, homicide Sgt. Dave Walker said. The teenager was dropped off at Saint Francis Hospital, where he was soon pronounced dead.\nThe other three who were in the car were taken into custody at the hospital. Although Smith and Deonta Mullins did not fire the shot that killed Marquis Mullins, they were charged with murder because the teen died while they were committing a felony, Walker said.\nHe said police did not immediately arrest Deonta Mullins because he did not fire any shots during the drive-by. However, a warrant was issued for his arrest Sept. 1, and police named him the Most Wanted fugitive Friday.\nThe man believed to have fired the deadly round, identified as Roderick Harbin, later turned himself in to police and was released after reportedly giving detectives a “plausible explanation as to why he shot.” Police submitted a report on Harbin to the Tulsa County District Attorney’s Office, which declined to files charges despite him reportedly admitting to using a firearm as a felon. Charges still could be brought against him in the future, Walker said.\nHarbin has been convicted of several crimes, mostly drug-related, since the late 1980s in Tulsa County and is on probation until 2017, according to state records. One of those convictions was for a felon in possession of a firearm.\nWalker said Mullins is believed to still be in the Tulsa area. He is described as a 5-foot-6 black man weighing about 145 pounds.\nAnyone with information may contact Crime Stoppers by phone at 918-596-COPS (2677), online at p3tips.com/918 or through the Tulsa Tips app, which can be downloaded from the Google Play or iTunes stores.\n918-581-8451\nkyle.hinchey@tulsaworld.com"}