{"uri": "http://www.kplctv.com/story/31799232/3-year-old-fatally-shot-natchitoches-man-charged", "title": "3-year-old fatally shot; gun has yet to be found", "dct": "Sun, 08 May 2016 02:19:00 GMT", "id": "f3cccf1713997881f3f4e4c10b8a2dfa", "content": "NATCHITOCHES, LA (KSLA) -\nA 3-year-old is dead, a man is in jail and police still are looking for the gun.\nMore\nNeighbors said they were unsure what had happened when they heard a shot ring out on their alley.\n\"Somebody's always shooting,\" said one who wished to stay anonymous.\n\"Yeah, gun violence in this neighborhood,\" said another neighbor wishing the same.\nIt wasn't until paramedics arrived that the neighbors saw a mother cradling her 3-year-old son.\n\"She was just holding the baby when they pulled up, as they was pulling up, getting off the truck,\" one neighbor said. \"She was saying: 'My baby's not breathing! My baby's not breathing!'\"\nNatchitoches police detectives said the boy found a pistol and accidentally shot himself once in the head just before 5:30 p.m. Friday.\nIt happened at a residence in the 600 block of Sabine Alley.\n\"The mother and Mr. Alverious Demars, they were laying in the bed together,\" Natchitoches police Detective John Greely said. \"Some time when they were laying together, the 3-year-old was able to get a hold of a firearm and accidentally discharged it, striking himself in the head.\"\nThe child was taken to Natchitoches Regional Medical Center, where he later died.\nNow 22-year-old Demars, of Natchitoches, is being held in Natchitoches Parish Detention Center on 1 count each of negligent homicide and obstruction of justice in connection. The latter charge arises from the fact that the gun has yet to be found.\n\"We conducted a search of the house. A very, very extensive search,\" Greely said. \"It was hidden somewhere, removed from the scene prior to our arrival.\"\nPolice want a ballistics report on the gun to better piece together what happened that evening.\nThe shock of the shooting spanned beyond the small alley.\n\"In a situation like that, my heart goes out to anybody,\" said Natchitoches Parish resident Jessie Jefferson.\nNo bond has been set for Demars. Police said that won't happen until he goes before a judge Monday.\nCopyright 2016. KSLA. All rights reserved."}