{"uri": "https://www.flashalert.net/news.html?id=3056", "title": "Portland Police Bureau Swearing In 14 New Police Officers (Photo)", "dct": "Sat, 28 Jan 2017 21:10:43 GMT", "id": "4beb01810fd8abebd2ca0aae5f68bc3e", "content": "SERT/CNT Responding to Assist North Precinct on Tactical Incident on Mallory Avenue (Photo) - 01/28/17\nThe Portland Police Bureau's Special Emergency Reaction Team (SERT) and Crisis Negotiation Team (CNT) are responding to assist North Precinct on a disturbance at a residence in the 4800 block of Northeast Mallory Avenue involving a firearm.\nPreliminary information indicates a person inside the home has fired a gun, there are no reported injuries.\nNortheast Alberta Street is closed between Martin Luther King Jr. Boulevard and Williams Avenue. Several side streets will also be affected during this tactical incident.\nInterested media should stage at North Williams Avenue and Alberta Street, access from the West. The Public Information Officer (PIO) will be responding to the scene.\n###PPB###\nAttached Media Files: PPB_SERT.jpg\nToday - Dragon Boat Team to Give Special Olympics Oregon Athletes Unique Experience Ahead of Annual Polar Plunge Event (Photo) - 01/28/17\nToday, Saturday January 28, 2017, beginning at 9:30 a.m., the Bridge City Paddling Club will practice with seven Special Olympics Oregon athletes during an exclusive dragon boat ride. Nearly 150 members and supporters of the Bridge City Paddling Club are preparing for the annual Oregon Law Enforcement Polar Plunge benefiting Special Olympics Oregon (SOOR). Participating in the Plunge for its 8th year, Bridge City Paddling Club routinely brings the largest team to the event, raising over $11,000 dollars in 2016 alone.\nThis year the paddle team is doing even more, by sharing with the athletes the experience of being on the water during practice. The athletes will also help recruit more members to join the \"BRRRidge City Polar Paddlers\" plunge team. The partnership will not only give Special Olympics Oregon athletes the experience of what it's like to be a member of a dragon boat team but also for Bridge City Paddlers to directly meet many of the athletes they are supporting.\n\"Our club loves supporting the community on and off of the water,\" said paddler Sophiea Tyler. \"Our motto is 'Kick Ass, Save the Planet' and as a club we believe in sharing our passion for dragon boating with everyone, especially the Special Olympic Oregon athletes for whom we support and plunge for each year!\"\nJoining the athletes and paddlers will be Portland Police Officer Lt. Andy Shearer. A \"Super Plunger\" this year, Shearer alongside his SOOR athlete teammate, will be plunging into the Columbia River 24 times in 24 hours. Together they will be raising $5,000 in support of Special Olympics Oregon.\nMedia:\nWhat: Special Olympics Oregon athletes join Bridge City Paddling Club\nWhere: River Place Hotel -- 1510 SW Harbor Way Portland\nMedia availability: Interested media should meet at the boat ramp near the River Place Hotel for interview and b-roll opportunities.\nAbout the Polar Plunge\nDonning their wildest costumes and swimming attire, thousands of brave supporters will take the plunge into the frigid Willamette River, Saturday Feb. 25 at Broughton Beach for the 2017 Oregon Law Enforcement Polar Plunge presented by Fred Meyer. Benefiting Special Olympics Oregon, participants will raise more than a half million dollars statewide in support of those with intellectual disabilities -- the largest disability population in the state. Registration is open at http://www.plungeoregon.com\nAbout Special Olympics Oregon\nSpecial Olympics Oregon serves more than 13,000 participants with intellectual disabilities year-round and statewide through the organization's life changing sports programs. Athletes gain self-confidence, social competency, develop physical fitness, demonstrate courage, experience joy, and participate in a sharing of gifts, skills, and friendship with their families, other Special Olympics athletes, and the community. Learn more at www.soor.org.\nMedia Contact\nChad Carter -- Sr. Director of Marketing & Communications\nC: 503.550.5852 (Media Only) | ccarter@soor.org\n###PPB###\nAttached Media Files: IMG_0399.JPG , IMG_0400.JPG\nOne Person Injured in Suspected Gang Shooting in Lower Southeast Portland (Photo) - 01/28/17\nOn Saturday January 28, 2017, at 1:14 a.m., Central Precinct and Gang Enforcement Team officers responded to the report of a shooting at Southeast 9th Avenue and Sandy Boulevard.\nOfficers and medical personnel arrived in the area and located a male adult suffering from gunshot wounds. The victim was transported by ambulance to a Portland hospital for treatment to injuries that are not believed to be life-threatening.\nOfficers located evidence of gunfire at the scene and have detained several people suspected of involvement in the shooting.\nBased on information learned at the scene, the shooting is believed to be gang-related so the Gang Enforcement Team will be investigating.\nAnyone with information about the shooting that has not spoken to police is asked to call the Police Non-Emergency Line at 503-823-3333.\nAnyone with information about gun crimes in the City of Portland is encouraged to provide information to the Portland Police Bureau's Tactical Operations Division at 503-823-4106 or email information to gangs@portlandoregon.gov.\nInformation learned from social media sites such as Facebook, Twitter or YouTube should be shared with investigators as these tips may lead to the identification of a suspect or suspects.\nIf you see a gun crime in progress, call 9-1-1.\nThe Portland Police Bureau works closely with Enough is Enough PDX, a community-led campaign aimed at encouraging people to take a stand against gang violence in the area.\nFor more information about Enough is Enough PDX and how you can get involved, please visit https://www.facebook.com/EnoughIsEnoughPDX\nAdditional information about Enough is Enough PDX and other City efforts addressing youth violence can be found at the Office of Youth Violence Prevention, http://www.portlandonline.com/safeyouth/\nCrime Stoppers of Oregon is offering a minimum $250 cash reward to anyone who reports a convicted felon or a juvenile in possession of a firearm and tipsters can remain anonymous. Rewards of up to $1,000 are available for other unsolved felony crimes - $2,500 for unsolved homicides.\nSubmit an anonymous tip:\nText CRIMES (274637) - Type 823HELP, followed by the tip.\nOnline at http://crimestoppersoforegon.com/submit_online_tip.php\nCall 503-823-HELP (4357)\nVisit http://tipsoft.com to download the TipSubmit app for the iPhone or Droid.\n###PPB###\nAttached Media Files: PPB_GET.jpg\nSeven Men Arrested in Undercover Sex Trafficking Mission in Early January - 01/27/17\nDuring the week of January 9 - 13, 2017, the Portland Police Bureau's Sex Trafficking Unit conducted an undercover mission to address online sex trafficking.\nInvestigators posted online ads on known sex trafficking websites. Seven men contacted undercover police officers to arrange payment for sexual acts. Investigators were assisted by a Portland hotel as part of this effort.\nFor investigative reasons, the Sex Trafficking Unit is not sharing the specific website, application, or ad text publicly.\nThe seven men who responded to the ad and came to the hotel were arrested with the misdemeanor crime of Commercial Sexual Solicitation (Oregon Revised Statute 167.008).\nThe following is a list of the men arrested for Commercial Sexual Solicitation:\n36-year-old Robert Jon Haydon of Portland, Oregon\n34-year-old Husam M. Mohammed of Portland, Oregon\n51-year-old Joel Reuben Spielman of Portland, Oregon\n31-year-old Brian Christopher O'Donnell of Seattle, Washington\n48-year-old Samuel Beno Parkman of Portland, Oregon\n38-year-old Danya Peter Feltzin of Portland, Oregon\n50-year-old Christian J. Larson of Salem, Oregon\nSex trafficking and prostitution are not victimless crimes. Victims of sex trafficking and prostitution are forced, coerced, and manipulated into this lifestyle against their will. They are forced to suffer through physical, sexual, and mental abuse. The Portland Police Bureau, in conjunction with other Federal and local law enforcement agencies, is committed to deterring prostitution and sex trafficking activities.\nIf you know or think that someone may be involved in trafficking or is being exploited, please contact the Portland Police Bureau's Sex Trafficking Unit at 503-255-0118, the Sexual Assault Resource Center hotline 1-800-640-5311; or the National Center for Missing and Exploited Children, 1-800-843-5678 or via the Cyber Tipline: http://www.missingkids.org/CyberTiipline\n###PPB###\nUnknown Suspects Burglarize Businesses on Lower Division Street in Southeast Portland (Photo) - 01/27/17\nOn Friday January 27, 2017, at 4:37 a.m., Central Precinct officers responded to the report of a burglary alarm at Bar Avignon, located at 2138 Southeast Division Street.\nOfficers arrived in the area and found evidence of forced entry into the building. Officers searched the building but did not locate any suspects. Officers checking the neighborhood located and responded to several alarms and broken windows at several businesses along Division Street, between 21st and 32nd Avenues.\nNo suspects were located and there is no description at this time.\nAnyone needing to report a burglary should call the Police Non-Emergency Line at 503-823-3333. Anyone with information about these incidents should send it to CrimeTips@portlandoregon.gov.\nBusiness owners are encouraged to review crime prevention information shared by the City of Portland's Office of Neighborhood Involvement by visiting http://www.portlandoregon.gov/oni/53528\n###PPB###\nAttached Media Files: Boris_the_Burglar.jpg\n43 Citations, 23 Warnings in Thursday Night #VisionZero Traffic Safety Mission (Photo) - 01/27/17\nOn Thursday January 26, 2017, from approximately 6:00 to 8:00 p.m., the Portland Police Bureau's Traffic Division, assisted by North, Central and East Precinct, conducted a Vision Zero traffic safety mission on Southeast Hawthorne Boulevard, from 12th Avenue to Cesar E. Chavez Boulevard. This area was selected due to numerous community complaints and it is a high traffic area for all road users.\nIn total, 43 citations for 61 separate violations were issued as well as 23 written warnings.\nThe Traffic Division and Precinct operations will be conducting future enforcement missions as staffing allows.\nThe Portland Police Bureau is committed to working with our partners in government and the community to create safer streets and work towards reducing, and eventually eliminating, traffic fatalities as part of Vision Zero.\nTo learn more about the City of Portland's Vision Zero effort, please visit: http://www.portlandoregon.gov/transportation/40390\n###PPB###\nAttached Media Files: Vision_Zero.jpg\n- 01/26/17\nToday, Thursday January 26, 2017, at 9:00 a.m., the Portland Police Bureau will be swearing in 14 new police officers and two professional staff members.\nThe swearing in ceremony will be held on the 14th floor of the Justice Center in the Wayne Sullivan Room. Media is invited to attend but must check in at Central Precinct and should arrive early.\nThe Portland Police Bureau is actively recruiting for new officers. To learn more about how to apply, please visit http://www.joinportlandpolice.com/\n###PPB###\nAttached Media Files: PPB_Badge.jpg\nGang Enforcement Team Investigating Early Morning Shooting in Northeast Portland (Photo) - 01/26/17\nOn Thursday January 26, 2017, at 2:44 a.m., East Precinct officers responded to the report of a fight and shooting at Club Sin Rock, located at 12035 Northeast Glisan Street.\nOfficers and medical personnel arrived and located a male adult victim suffering from an apparent gunshot wound. The victim was transported by ambulance to a Portland hospital for treatment to the non-life-threatening injuries.\nAt 3:09 a.m., a second gunshot victim arrived by private car at Legacy Emanuel Medical Center. The 33-year-old male was suffering from multiple gunshot wounds that did not appear to be life-threatening.\nWitnesses told police that there was an altercation in the parking lot of Club Sin Rock that led to the shooting. The shooter was described to police as a black male that left in a white SUV.\nBased on information learned at the scene and the hospital, the Gang Enforcement Team responded to conduct the investigation.\nAnyone with information about gun crimes in the City of Portland is encouraged to provide information to the Portland Police Bureau's Tactical Operations Division at 503-823-4106 or email information to gangs@portlandoregon.gov.\nInformation learned from social media sites such as Facebook, Twitter or YouTube should be shared with investigators as these tips may lead to the identification of a suspect or suspects.\nIf you see a gun crime in progress, call 9-1-1.\nThe Portland Police Bureau works closely with Enough is Enough PDX, a community-led campaign aimed at encouraging people to take a stand against gang violence in the area.\nFor more information about Enough is Enough PDX and how you can get involved, please visit https://www.facebook.com/EnoughIsEnoughPDX\nAdditional information about Enough is Enough PDX and other City efforts addressing youth violence can be found at the Office of Youth Violence Prevention, http://www.portlandonline.com/safeyouth/\nCrime Stoppers of Oregon is offering a minimum $250 cash reward to anyone who reports a convicted felon or a juvenile in possession of a firearm and tipsters can remain anonymous. Rewards of up to $1,000 are available for other unsolved felony crimes - $2,500 for unsolved homicides.\nSubmit an anonymous tip:\nText CRIMES (274637) - Type 823HELP, followed by the tip.\nOnline at http://crimestoppersoforegon.com/submit_online_tip.php\nCall 503-823-HELP (4357)\nVisit http://tipsoft.com to download the TipSubmit app for the iPhone or Droid.\n###PPB###\nAttached Media Files: PPB_GET.jpg\n14 People Taken Into Custody on Wednesday Afternoon in Various Protests - 01/25/17\nOn Wednesday January 25, 2017, Portland Police Bureau officers responded to reports that several people were blocking road traffic and transit lines in Downtown Portland, along the Steel Bridge, in the Rose Quarter, and on the Lower East Side. The Bureau was aware of numerous threats issued publicly in the previous 24 hours to block traffic and interrupt transit.\nIn total, 14 people were taken into custody as a result of their behavior throughout the afternoon and evening -- 12 adults and two juveniles. All those taken into custody were issued a traffic citation for Oregon Revised Statute (ORS) 814.070 -- Improper Position on a Highway in addition to any criminal charges.\nArrested at Southwest 6th Avenue and Yamhill Street (or surrounding area):\n22-year-old Shayne Reanne Sellers\nDisorderly Conduct in the Second Degree\n34-year-old Lucy Elizabeth Smith\nDisorderly Conduct in the Second Degree\nInterfering with Public Transportation\n23-year-old Micah Isaiah Rhodes\nDisorderly Conduct in the Second Degree\nParole Violation (Oregon Youth Authority)\n51-year-old Robert Lee West\nDisorderly Conduct in the Second Degree\n18-year-old Elijah Jorgensen\nDisorderly Conduct in the Second Degree\nInterfering with Public Transportation\n30-year-old Anya Danielle Noftsier\nDisorderly Conduct in the Second Degree\nInterfering with Public Transportation\nArrested in the area of Northeast 2nd Avenue and Davis Street (or surrounding area):\nA 17-year-old was taken into custody and later released with a traffic citation for violation of ORS 814.070 -- Improper Position on a Highway.\n18-year-old Rachael Balnius\nDisorderly Conduct in the Second Degree\n20-year-old James Christopher Linn\nDisorderly Conduct in the Second Degree\n18-year-old Billy Marvin Ellison\nDisorderly Conduct in the Second Degree\n19-year-old Christopher Klehr Brooks\nDisorderly Conduct in the Second Degree\nArrested in the area of Southwest 2nd Avenue and Madison Street:\n25-year-old Samuel Jerome Resnick\nDisorderly Conduct in the Second Degree\n30-year-old Evan Timothy Burchfield\nDisorderly Conduct in the Second Degree\nA 17-year-old was taken into custody and later released with a traffic citation for violation of ORS 814.070 -- Improper Position on a Highway.\nAll of the adults were lodged at the Multnomah County Jail and will be arraigned at a later time, except Rhodes who may be arraigned on his parole violation on Thursday January 26, 2017.\nBooking photos for all adults are available (or will be) by visiting http://www.mcso.us\n###PPB###\nUPDATE - FOUND SAFE: Public's Help Sought to Locate a Missing 37-Year-Old Woman (Photo) - 01/25/17\nEarly Wednesday morning, Taylor was found safe in Downtown Portland.\n###PPB###\n###ORIGINAL RELEASE BELOW###\nThe Portland Police Bureau's Missing Persons Unit is asking for the public's help to locate 37-year-old Rebecca \"Becca\" Taylor, reported missing late-Tuesday evening.\nTaylor is described as a white female, 5'10\" tall, 190 pounds, wears glasses, wearing an orange jacket and blue jeans.\nTaylor was with her parents at the Portland Winterhawks game on Tuesday evening at the Moda Center and got separated from her family.Taylor has money and is familiar with TriMet but may not know her way back home to Newberg, Oregon.\nThere is no indication of any foul play and her family and police are asking for the public's help to locate her to check her welfare.\nAnyone seeing Taylor is asked to call 9-1-1. Anyone with non-emergency information is asked to contact Detective Lori Fonken at 503-823-1081, lori.fonken@portlandoregon.gov.\n###PPB###\nAttached Media Files: Becca_Taylor_37.jpg\nDetectives Arrest Suspect in November Riots - Multiple Felony Charges (Photo) - 01/23/17\nOn Monday January 23, 2017, Portland Police Bureau detectives arrested a suspect involved in the November 2016 protest and riot in Downtown Portland. 20-year-old Samuel Kusaj was booked into the Multnomah County Jail on charges of Assault in the Third Degree, Riot and Criminal Mischief in the First Degree (three counts). Kusaj will be arraigned on Tuesday in Multnomah County Court.\nKusaj' charges are the result of vandalisms at Broadway Toyota in Northeast Portland, Bank of America in the Pearl District, Chase Bank in the Pearl District; and, an assault in Downtown Portland.\nKusaj was identified after extensive investigation and tips from the community, including photographs shared anonymously (including attached photo).\nDetectives served a search warrant on Monday evening at Kusaj' residence in Southeast Portland in connection with this investigation.\n###PPB###\nAttached Media Files: Samuel_Kusaj_20.jpg , Kusaj.jpg\nMajor Crash Team Investigating a Fatal Crash in Southwest Portland - 01/23/17\nOn Monday January 23, 2017, at 3:56 p.m., Central Precinct and Traffic Division officers responded to the report of a single vehicle crash at Southwest Barbur Boulevard and Parkhill Drive.\nOfficers, firefighters and medical personnel arrived and located the vehicle off the roadway with the driver inside. Medical personnel determined that the driver, a male in his 30s, was deceased.\nPreliminary investigation indicates a that the driver may have suffered a medical event prior to the crash.\nTraffic in the area will be affected a short time longer as efforts are underway to remove the vehicle from the hillside.\nNo additional updates are expected this evening.\n###PPB###\nNortheast Portland Liquor Store Robbed on Saturday Night - No Injuries - 01/22/17\nOn Saturday January 21, 2017, at 9:01 p.m., North Precinct officers responded to the report of an armed robbery at the MLK Liquor Store, located at 3532 Northeast Martin Luther King Jr. Boulevard.\nOfficers arrived in the area and contacted the employee and customers who told police that the suspect walked into the store, armed with a handgun, and demanded money. After obtaining an undisclosed amount of cash, the suspect left the store without incident.\nOfficers, including a Canine Unit, searched the neighborhood but did not locate anyone matching the suspect's description.\nThe suspect was described as a black male, 5'9\" to 6'00\" tall, medium build to heavy build, wearing all black clothing, and a mask.\nAnyone with information about this incident is asked to contact Robbery detectives at 503-823-0405.\n###PPB###\nNo Reported Injuries After Early Morning Shooting on Southeast Stark Street - Gang Enforcement Team Investigating - 01/22/17\nOn Sunday January 22, 2017, at 3:44 a.m., police officers inside the East Precinct police facility heard multiple gunshots outside the building. Officers developed a plan to quickly get to the parking structure top floor to safely get a view of the front of the precinct and the surrounding neighborhood.\nA 9-1-1 caller reported that there was a shooting outside a residence in the 10800 block of Southeast Stark Street (around the corner from East Precinct) and that an apartment was struck by gunfire.\nOfficers responded to that location and found evidence of gunfire in the gunfire in the apartment complex parking lot and damage to an apartment. The victim's apartment was struck multiple times with some bullets traveling through walls into neighboring apartments. Nobody was injured in the shooting.\nBased on information learned at the scene, the Gang Enforcement Team responded to conduct an investigation.\nAnyone with information about gun crimes in the City of Portland is encouraged to provide information to the Portland Police Bureau's Tactical Operations Division at 503-823-4106 or email information to gangs@portlandoregon.gov.\nInformation learned from social media sites such as Facebook, Twitter or YouTube should be shared with investigators as these tips may lead to the identification of a suspect or suspects.\nIf you see a gun crime in progress, call 9-1-1.\nThe Portland Police Bureau works closely with Enough is Enough PDX, a community-led campaign aimed at encouraging people to take a stand against gang violence in the area.\nFor more information about Enough is Enough PDX and how you can get involved, please visit https://www.facebook.com/EnoughIsEnoughPDX\nAdditional information about Enough is Enough PDX and other City efforts addressing youth violence can be found at the Office of Youth Violence Prevention, http://www.portlandonline.com/safeyouth/\nCrime Stoppers of Oregon is offering a minimum $250 cash reward to anyone who reports a convicted felon or a juvenile in possession of a firearm and tipsters can remain anonymous. Rewards of up to $1,000 are available for other unsolved felony crimes - $2,500 for unsolved homicides.\nSubmit an anonymous tip:\nText CRIMES (274637) - Type 823HELP, followed by the tip.\nOnline at http://crimestoppersoforegon.com/submit_online_tip.php\nCall 503-823-HELP (4357)\nVisit http://tipsoft.com to download the TipSubmit app for the iPhone or Droid.\n###PPB###\nGang Enforcement Team Investigating Saturday Night Shooting Near Convention Center - 01/22/17\nOn Saturday January 21, 2017, at 11:25 p.m., North Precinct and Traffic Division officers responded to a report of gunfire in the 600 block of Northeast Grand Avenue. As police were responding to the area, additional callers reported gunfire and that several ran to vehicles and sped out of the area.\nOfficers arrived in the area and located evidence of gunfire in the street on Northeast Irving Street, between Grand Avenue and Martin Luther King Jr. Boulevard. No gunshot victims were located at the scene or arrived at any area hospitals.\nOfficers learned that there was a hip hop music concert at the TAO Event Center, located at 631 Northeast Grand Avenue, and that a shooter or shooters may have fired at a group of people standing outside the building. Officers located bullet damage to a Convention Center window.\nAnyone with information about the shooting, including who the intended victim(s) may have been, please contact Detective Jeff Pontius at 503-823-2081, jeffery.pontius@portlandoregon.gov.\nAnyone with information about gun crimes in the City of Portland is encouraged to provide information to the Portland Police Bureau's Tactical Operations Division at 503-823-4106 or email information to gangs@portlandoregon.gov.\nInformation learned from social media sites such as Facebook, Twitter or YouTube should be shared with investigators as these tips may lead to the identification of a suspect or suspects.\nIf you see a gun crime in progress, call 9-1-1.\nThe Portland Police Bureau works closely with Enough is Enough PDX, a community-led campaign aimed at encouraging people to take a stand against gang violence in the area.\nFor more information about Enough is Enough PDX and how you can get involved, please visit https://www.facebook.com/EnoughIsEnoughPDX\nAdditional information about Enough is Enough PDX and other City efforts addressing youth violence can be found at the Office of Youth Violence Prevention, http://www.portlandonline.com/safeyouth/\nCrime Stoppers of Oregon is offering a minimum $250 cash reward to anyone who reports a convicted felon or a juvenile in possession of a firearm and tipsters can remain anonymous. Rewards of up to $1,000 are available for other unsolved felony crimes - $2,500 for unsolved homicides.\nSubmit an anonymous tip:\nText CRIMES (274637) - Type 823HELP, followed by the tip.\nOnline at http://crimestoppersoforegon.com/submit_online_tip.php\nCall 503-823-HELP (4357)\nVisit http://tipsoft.com to download the TipSubmit app for the iPhone or Droid.\n###PPB###\n19-Year-Old Man Arrested for Firing Gun into his Yard in Southeast Portland (Photo) - 01/22/17\nOn Sunday January 22, 2017, at 12:10 a.m., East Precinct officers responded to the report of gunfire at a residence in the 15700 block of Northeast Glisan Street after a Gresham Police Department officer in the area heard the gunshots. Neighbors called 9-1-1 to report the gunfire also and provide a more exact address of the incident.\nOfficers arrived in the area and worked to contain the neighborhood and insure neighbors' safety. Gresham officers assisted with this effort.\nOfficers spoke with witnesses who told police the suspect fired a handgun numerous times, pointing it into the ground.\nOfficers obtained a phone number for the residence and contacted the occupants. The suspect came outside, was compliant with officers' commands and was taken into custody. A handgun was seized as evidence from the residence.\nThe suspect, 19-year-old David Julian Sanchez, was booked into the Multnomah County Jail on a charge of Discharge of a Firearm, a misdemeanor under Portland City Code (https://www.portlandoregon.gov/citycode/article/15438).\n###PPB###\nAttached Media Files: David_Julian_Sanchez_19.jpg\nPublic's Help Sought to Locate a Missing 62-Year-Old Woman (Photo) - 01/21/17\nThe Portland Police Bureau's Missing Persons Unit is asking for the public's help to locate a 62-year-old woman missing since January 19, 2017.\nLiz Bazzani is described as 5'4\" tall, 110 pounds, white hair, and green eyes. She was last seen wearing green Ugg-style boots, flowing light-colored pajama pants, and a blue sweater. Bazzani is familiar with TriMet but left all personal affects at her residence in Northeast Portland.\nBazzani's family is concerned for her welfare as she is normally in regular contact with them. She was reported missing after she did not show up for work in the Pearl District on Thursday morning. There are no indications that her disappearance involves foul play.\nAnyone seeing Bazzani should immediately call 9-1-1 so officers can check her welfare. Anyone with non-emergency information should contact Detective Heidi Helwig at 503-823-0797, heidi.helwig@portlandoregon.gov.\n###PPB###\nAttached Media Files: Liz_Bazzani_62.jpg\n32-Year-Old Man Arrested After Guns, Cocaine Found Stashed in Northeast Portland Bar (Photo) - 01/21/17\nIn the late evening hours of Wednesday January 18, 2017, Portland Police Bureau Gang Enforcement Team (GET) officers responded to Katie's Backyard Bar, located at 11307 Northeast Sandy Boulevard, to conduct a walk-through based on possible gang activity.\nAs officers arrived in the parking lot, several people in the parking lot ran into the bar. Officers walked through the bar and recognized several known gang members and associates. During the walk through, officers located and seized two loaded handguns and three separate baggies of cocaine, totaling approximately 2.5 ounces.\nOne subject was arrested and GET officers will be continuing the investigation.\n32-year-old Marcus Anthony Davis was booked into the Multnomah County Jail on charges of Felon in Possession of a Firearm, Unlawful Possession of a Firearm, Possession of a Loaded Firearm, Manufacturing Cocaine, Delivery of Cocaine, and Possession of Cocaine. Davis is also being held on a parole violation.\nAnyone with information about gun crimes in the City of Portland is encouraged to provide information to the Portland Police Bureau's Tactical Operations Division at 503-823-4106 or email information to gangs@portlandoregon.gov.\nInformation learned from social media sites such as Facebook, Twitter or YouTube should be shared with investigators as these tips may lead to the identification of a suspect or suspects.\nIf you see a gun crime in progress, call 9-1-1.\nThe Portland Police Bureau works closely with Enough is Enough PDX, a community-led campaign aimed at encouraging people to take a stand against gang violence in the area.\nFor more information about Enough is Enough PDX and how you can get involved, please visit https://www.facebook.com/EnoughIsEnoughPDX\nAdditional information about Enough is Enough PDX and other City efforts addressing youth violence can be found at the Office of Youth Violence Prevention, http://www.portlandonline.com/safeyouth/\nCrime Stoppers of Oregon is offering a minimum $250 cash reward to anyone who reports a convicted felon or a juvenile in possession of a firearm and tipsters can remain anonymous. Rewards of up to $1,000 are available for other unsolved felony crimes - $2,500 for unsolved homicides.\nSubmit an anonymous tip:\nText CRIMES (274637) - Type 823HELP, followed by the tip.\nOnline at http://crimestoppersoforegon.com/submit_online_tip.php\nCall 503-823-HELP (4357)\nVisit http://tipsoft.com to download the TipSubmit app for the iPhone or Droid.\n###PPB###\nAttached Media Files: Marcus_Anthony_Davis_32.jpg\nFive People Arrested During #J20PDX Protest on Friday Evening in Downtown Portland (Photo) - 01/20/17\nOn Friday January 20, 2017, five people were arrested during protest events in Downtown Portland.\n* 21-year-old Nicholas Martin Johnson was arrested for Disorderly Conduct in the Second Degree on the Burnside Bridge.\n* 30-year-old Rosemary Vera Tustin was arrested for Disorderly Conduct in the Second Degree at West Burnside Street and 2nd Avenue.\n* 45-year-old Craig Allen Hasty was arrested for Disorderly Conduct in the Second Degree at West Burnside Street and 2nd Avenue.\n* 18-year-old Travis Allen Martin was arrested for Disorderly Conduct in the Second Degree and Harassment at Southwest 5th Avenue and Yamhill Street.\n* 41-year-old Matthew Ray McGaugh was arrested for Disorderly Conduct in the Second Degree at Southwest 5th Avenue and Yamhill Street.\nJohnson, Tustin, Hasty, and Martin were booked into the Multnomah County Jail and will be arraigned in approximately two weeks. McGaugh was issued a citation in lieu of custody and was not booked into jail.\nA sixth person was arrested early in the evening, before protest events started, in connection with the November 2016 protest and riots. Details of this arrest can be found at http://www.portlandoregon.gov/police/news/read.cfm?id=17873\nMuch of the afternoon and evening was attended by peaceful protesters at Pioneer Courthouse Square and a subsequent march in Downtown Portland. When some in the crowd began to take aggressive actions towards law enforcement and commit minor acts of vandalism, many of the peaceful protesters left the area.\nMost of the remaining crowd dispersed at approximately 9:00 p.m. after several hours of protesting in Downtown Portland streets. There were some reports of minor vandalism and incidents of protesters throwing bottles, rocks, eggs, ice (snow) balls, and road flares/incendiary devices at police and government buildings. As a result of these actions, officers deployed some riot control agents and munitions intended to disperse the crowd.\n###PPB###\nAttached Media Files: J20_Arrests.png , Nicholas_Martin_Johnson_21.jpg , Rosemary_Vera_Tustin_30.jpg , Craig_Allen_Hasty_45.jpg , Travis_Allen_Martin_18.jpg\nNovember Riot Suspect Arrested Tonight at Pioneer Courthouse Square (Photo) - 01/20/17\n18-year-old Billy Ellison was arrested in the early evening hours of Friday January 20, 2017, at Pioneer Courthouse Square in connection with the November 2016 protest and riot in Downtown Portland. Ellison was identified by police after tips from the public were provided to investigators. Ellison was booked into the Multnomah County Jail on two counts of Interfering with Public Transportation.\nWhen officers arrested Ellison, they located a torch (photo attached), a large knife and a gas mask with extra filters.\nEllison was identified to police after his photo was released in connection with the November 2016 protest and riot. The photo (attached) was posted to the Bureau's CanYouIDMe page - http://www.portlandoregon.gov/police/canyouidme/\nEllison will be arraigned on Monday January 23, in Multnomah County Court.\n###PPB###\nAttached Media Files: Billy_Ellison_18.png\n17-Year-Old Given Park Exclusion, Weapons Seized During Protest March (Photo) - 01/19/17\nIn the afternoon hours of Thursday January 19, 2017, an \"Anti-Betsy DeVos Walkout\" event was held at Pioneer Courthouse Square in Downtown Portland. A group of approximately 50 teens and adults gathered for speeches at 4:00 p.m., then began marching in the street on Southwest Morrison Street, against traffic, at approximately 5:00 p.m.\nThe group marched through the streets to Salmon Street Springs in Tom McCall Waterfront Park to listen to more speeches. Vehicular traffic was impacted by the protest marchers walking against traffic but there were no major incidents reported to police.\nAn alert community member alerted police to the presence of a teen male in Pioneer Courthouse Square with a machete strapped to his backpack (a violation of City of Portland Park Rules - http://www.portlandoregon.gov/citycode/?c=28627&a=147782)\nAt Salmon Street Springs, officers contacted the 17-year-old male and issued him a 30-day park exclusion for Waterfront Park and took the machete and two other knives from him for safekeeping (photo attached, cell phone used for scale).\nThere were no significant incidents related to the march and the group broke up shortly after arriving at Waterfront Park.\n###PPB###\nAttached Media Files: Weapons.JPG\nInauguration Protests Events Anticipated in Downtown Portland on Friday and Saturday - 01/19/17\nThe Portland Police Bureau is anticipating numerous protest events to occur in Portland in conjunction with the Presidential Inauguration. Most events appear to be scheduled for Downtown Portland; however there are some events over the weekend that appear to be set for Northeast Portland's Holladay Park, Southeast Portland's Mt. Tabor Park, North Portland's Columbia Park, and the East 162nd Avenue MAX Station.\nThe events on Friday January 20, 2017, are anticipated to begin starting at 12:00 p.m. and last throughout the afternoon. There could be an impact to traffic and TriMet has announced they have developed contingently plans for transit; riders should check http://www.trimet.org/alerts in advance of any travel to learn about service disruptions and route changes.\nThe \"Women's March on Portland\" is scheduled for Saturday January 21, from 12:00 p.m. to 4:00 p.m. as part of a national series of events. The event organizers have worked with City of Portland officials to ensure a safe and orderly event.\nWhile most people attending these events may be peaceful, the Bureau has received information that some people interested in attending the protests may attempt to conduct criminal behavior similar to actions conducted in November 2016 after the election. The Bureau's goal is to facilitate a peaceful protest and to prevent criminal behavior from happening during the events.\nEveryone attending any of the various protest events is encouraged to obey all laws and be respectful of others who are using city streets, freeways and mass transit. Marching into and blocking streets without a permit is illegal and dangerous to protesters as well as road users and has a significantly negative impact to our community. Pedestrians walking on the freeway is illegal and extremely dangerous to all road users.\nThe Portland Police Bureau will investigate reports of criminal behavior and work to identify suspects during and after any incidents. In November 2016 there were several incidents of criminal mischief resulting in arrests. Some of the suspects remain unidentified and pictures are posted at https://www.portlandoregon.gov/police/canyouidme/\nThe Bureau will provide updates via Twitter (@portlandpolice) as needed and will post news releases on significant events that occur as a result of the protests.\n###PPB###\nSuspect Pleads Guilty to 1995 Homicide of Darrin Ezell (Photo) - 01/17/17\nOn Friday January 13, 2017, 47-year-old Adrian Cavette Stafford pled guilty to one count of Manslaughter in the First Degree and Conspiracy to Commit Robbery in the First Degree in connection with the 1995 murder of Darrin Ezell. Adrian Stafford is awaiting sentencing in this case, which is expected to be 19 years in prison.\n51-year-old Danny Conner and 53-year-old Vinson Louis White previously pled guilty and are also awaiting sentencing.\nA fourth defendant, 47-year-old Selwyn Terris Stafford (Adrian's brother), is awaiting trial in this case.\nThis investigation started on December 20, 1995, at approximately 7:20 a.m., when 24-year-old Darrin Ezell was killed while sleeping inside his home, located in the 9300 block of Southeast Ramona Street. Two children were in the home at the time of the homicide but were not harmed.\nIn 2012, Portland Police Bureau Cold Case Homicide Unit Detectives Jim Lawrence and Meredith Hopper began reviewing the case and developed new leads in the investigation. Detectives worked in collaboration with Chief Deputy District Attorney Kirsten Snowden, Senior Deputy District Attorney John Casalino and Deputy District Attorney Melissa Marrero of the Multnomah County District Attorney's Office, which assists in reviewing cold cases for possible prosecution.\nThe Cold Case Homicide Unit reviews unsolved murders in the Portland area and, since its inception in 2004, has reviewed approximately 250 homicide cases and solved more than 40.\nThe Portland Police Bureau Cold Case Homicide Unit is comprised of a Sergeant and four Detectives who are assisted by several retired investigators who volunteer their time to assist in solving cases.\nThe Portland Police Bureau Cold Case Homicide Unit has a close partnership with the Multnomah County District Attorney's Office and the Oregon State Police Crime Lab.\nThe Portland Police Bureau Cold Case Homicide Unit's slogan is: \"We don't give up. We never give up.\"\nInformation about many of these unsolved homicides can be viewed by visiting http://www.portlandoregon.gov/police/35696\n###PPB###\nAttached Media Files: Adrian_Stafford_47.jpg\nBank Robbery Investigation Underway in Southeast Portland - 01/13/17\nOn Friday January 13, 2017, at 5:11 p.m., East Precinct officers responded to the US Bank branch located at 16002 Southeast Division Street on the report of a robbery.\nOfficers arrived in the area and spoke with employees who told police that the suspect entered the bank, jumped the counter and demanded money. After obtaining an undisclosed amount of cash, the suspect left the bank without incident. The suspect implied that he had a gun but none was seen.\nThe suspect is described as a white male in his 40s, 5'9\" tall, thin build, blue or green eyes, wearing dark clothing and a dark bandana covering his face.\nOfficers checking the neighborhood did not locate anyone matching the suspect's description.\nAnyone with information about this incident should contact Robbery detectives at 503-823-0405, or the Portland Office of the Federal Bureau of Investigation at 503-224-4181.\n###PPB###\nStabbing Investigation Underway at Holladay Park - One Teen Male Injured - 01/12/17\nOn Thursday January 12, 2017, at 5:52 p.m., North Precinct, Transit Police and Gang Enforcement Team officers responded to Holladay Park, located at Northeast 11th Avenue and Holladay Street, on the report of a stabbing.\nOfficers and medical personnel arrived in the area and contacted the victim, a teen male, who was suffering from non-life-threatening stab wounds. He was transported by ambulance to a Portland hospital for treatment.\nThe victim told police that he was surrounded by five black males in Holladay Park and one of them stabbed him. The victim told police that all five males were wearing red clothing.\nNo suspects have been located and the Gang Enforcement Team is investigating the stabbing.\nAnyone with information about this incident is asked to call the Police Non-Emergency Line at 503-823-3333.\n###PPB###\nOfficers Providing Transport to Shelter, Assisting Stranded Motorists Overnight (Photo) - 01/11/17\nPortland Police Bureau officers have been actively assisting those in need overnight due to the heavy snow in the Portland area.\nEast Precinct officers were out looking for stranded motorists and developing a safety plan for folks stuck in their cars, including transportation to safe, warm locations. If vehicles were unoccupied, officers were marking them with yellow tape to indicate that the car had been checked and was clear. Officers on ATVs and in SUVs contacted and/or marked nearly three dozen vehicles on I-205 and along surface streets.\nCentral Precinct officers responded to dozens of hazard calls, especially in the West Hills, I-5, I-405 and Highway 26. Officers worked to block roadways that were of significant concerns and worked with the Portland Bureau of Transportation (PBOT) to close others.\nOfficers responded to stranded motorists and worked to help them get to a safe place. Some were able to get home while others were given rides by police to Central Precinct where they were provided food as officers contacted area hotels to arrange for rooms. Once rooms were secured, officers gave families rides to the hotels for the night.\nOfficers also responded to welfare checks for homeless people and made dozens of contacts. Approximately three dozen homeless people were transported to warming shelters. More than two dozen did not want to go to shelters so officers gave out a few jackets to those that needed them.\nAs the cold weather continues, drivers need to be properly prepared for the weather with a full tank of gas, traction devices or snow tires, extra food and water, and a healthy dose of patience.\nIf you see someone outside, unsheltered whose life appears to be in danger or is in an apparent medical crisis, call 9-1-1. Otherwise, if you see someone about whom you are concerned, such as not being dressed for the weather conditions, call police non-emergency 503-823-3333 and request a welfare check for that person. To assist someone in locating shelter and transportation to shelter, please call 211.\nAs freezing temperatures continue, Portland Police officers will be actively looking for and checking on vulnerable people and facilitating transportation to warming shelters as needed.\nWarming centers are open in Portland and Gresham with capacity during day and night. Call 211 in Multnomah County at any hour for the latest information about open shelters. Calls are answered in over 150 languages. You can also visit 211's website at http://www.211info.org for updated information and sign up for emails or texts about updated warming center locations. Severe weather centers will accommodate individuals and couples, pets and belongings, and do not require identification or any other documentation. Families with children seeking shelter should also call 211 and will be directed to a shelter that can accommodate children.\nPeople seeking to get warm, especially during daytime hours, are encouraged to utilize public buildings that are open to the public, including, for example, libraries and community centers. Library hours are listed on Multnomah County Library's website - https://multcolib.org/hours-and-locations City community center information is listed here - https://www.portlandoregon.gov/parks/39839\nDuring extreme cold weather there is increased risk of exposure-related injuries for unsheltered homeless people who do not have sufficient gear, such as coats, hats, gloves, footwear, tarps, sleeping bags and blankets. For information about what and where to donate, please contact 211info by dialing 211 or by visiting their website.\nFor additional information on the dangers of cold including: hypothermia, carbon monoxide hazards and important information on the use of alternative sources of heat, please visit - https://multco.us/multnomah-county/news/dangers-cold\n###PPB###\nAttached Media Files: PPB_ATV_1.jpg , PPB_ATV_2.jpg , PPB_Snow_2.jpg , PPB_Snow.jpg\nUPDATE #2: Death Investigation Underway on Southwest Barbur Boulevard (Photo) - 01/10/17\nPreliminary information indicates that the deceased, a 29-year-old male, died of hypothermia due to exposure. Detectives believe that the man was likely living in the woods below Barbur Boulevard.\nThe man's name will be released to the public after his family is located and notified of his death.\nIf you see someone outside, unsheltered whose life appears to be in danger or is in an apparent medical crisis, call 9-1-1. Otherwise, if you see someone about whom you are concerned, such as not being dressed for the weather conditions, call police non-emergency 503-823-3333 and request a welfare check for that person. To assist someone in locating shelter and transportation to shelter, please call 211.\nAs freezing temperatures continue, Portland Police officers will be actively looking for and checking on vulnerable people and facilitating transportation to warming shelters as needed.\nWarming centers are open in Portland and Gresham with capacity during day and night. Call 211 in Multnomah County at any hour for the latest information about open shelters. Calls are answered in over 150 languages. You can also visit 211's website at http://www.211info.org for updated information and sign up for emails or texts about updated warming center locations. Severe weather centers will accommodate individuals and couples, pets and belongings, and do not require identification or any other documentation. Families with children seeking shelter should also call 211 and will be directed to a shelter that can accommodate children.\nPeople seeking to get warm, especially during daytime hours, are encouraged to utilize public buildings that are open to the public, including, for example, libraries and community centers. Library hours are listed on Multnomah County Library's website - https://multcolib.org/hours-and-locations City community center information is listed here - https://www.portlandoregon.gov/parks/39839\nDuring extreme cold weather there is increased risk of exposure-related injuries for unsheltered homeless people who do not have sufficient gear, such as coats, hats, gloves, footwear, tarps, sleeping bags and blankets. For information about what and where to donate, please contact 211info by dialing 211 or by visiting their website.\nFor additional information on the dangers of cold including: hypothermia, carbon monoxide hazards and important information on the use of alternative sources of heat, please visit - https://multco.us/multnomah-county/news/dangers-cold\n###PPB###\n###ORIGINAL MESSAGE BELOW###\nAttached are some photographs from the scene. These are being shared for public use as its unsafe to bring media in closer to the scene due to the location.\n###PPB###\n###ORIGINAL MESSAGE BELOW###\nOn Tuesday January 10, 2017, at 8:19 a.m., Central Precinct officers responded to the 4900 block of Southwest Barbur Boulevard on the report of a deceased person down a hillside.\nOfficers and Portland Fire & Rescue personnel arrived and confirmed the person was deceased.\nHomicide detectives, Criminalists from the Forensic Evidence Division and the Medical Examiner are responding to conduct a death investigation.\nMedia staging will be on the West side of Barbur Boulevard near the police vehicles.\nSergeant Chris Burley will be responding as the Acting Public Information Officer.\n###PPB###\nAttached Media Files: IMG_0344.JPG , IMG_0343.JPG , IMG_0342.JPG , IMG_0341.JPG , IMG_0340.JPG , IMG_0339.JPG , IMG_0338.JPG , IMG_0337.JPG\nUPDATE - 52-Year-Old Woman Found Deceased in Downtown Portland Parking Garage, Possibly Weather-Related - 01/09/17\nThe Oregon State Medical Examiner conducted an autopsy and determined that 52-year-old Karen Lee Batts of Southwest Portland died of hypothermia due to exposure.\n###PPB###\n###ORIGINAL MESSAGE BELOW###\nOn Saturday January 7, 2017, at 2:05 p.m., Central Precinct officers responded to the Smart Park parking garage, located at 730 Southwest 10th Avenue, on the report of a woman in her 50s that had been removing her clothing and appeared to be struggling in the cold weather.\nOfficers and medical personnel arrived and determined that the woman was deceased. She has tentatively been identified as a 52-year-old woman who resides in Downtown Portland.\nBased on observations at the scene by officers and paramedics, it appeared that woman may have died of exposure due to cold temperatures. The Oregon State Medical Examiner will conduct an autopsy and ultimately determine the cause of death.\nIf you see someone outside, unsheltered whose life appears to be in danger or is in an apparent medical crisis, call 9-1-1. Otherwise, if you see someone about whom you are concerned, such as not being dressed for the weather conditions, call police non-emergency 503-823-3333 and request a welfare check for that person. To assist someone in locating shelter and transportation to shelter, please call 211.\nAs freezing temperatures continue, Portland Police officers will be actively looking for and checking on vulnerable people and facilitating transportation to warming shelters as needed.\nWarming centers are open in Portland and Gresham with capacity during day and night. Call 211 in Multnomah County at any hour for the latest information about open shelters. Calls are answered in over 150 languages. You can also visit 211's website at http://www.211info.org for updated information and sign up for emails or texts about updated warming center locations. Severe weather centers will accommodate individuals and couples, pets and belongings, and do not require identification or any other documentation. Families with children seeking shelter should also call 211 and will be directed to a shelter that can accommodate children.\nPeople seeking to get warm, especially during daytime hours, are encouraged to utilize public buildings that are open to the public, including, for example, libraries and community centers. Library hours are listed on Multnomah County Library's website - https://multcolib.org/hours-and-locations City community center information is listed here - https://www.portlandoregon.gov/parks/39839\nDuring extreme cold weather there is increased risk of exposure-related injuries for unsheltered homeless people who do not have sufficient gear, such as coats, hats, gloves, footwear, tarps, sleeping bags and blankets. For information about what and where to donate, please contact 211info by dialing 211 or by visiting their website.\nFor additional information on the dangers of cold including: hypothermia, carbon monoxide hazards and important information on the use of alternative sources of heat, please visit - https://multco.us/multnomah-county/news/dangers-cold\n###PPB###\nMan Sitting on MAX Rail Line Struck and Critically Injured on Saturday Night - 01/08/17\nOn Saturday January 7, 2017, at 10:05 p.m., East Precinct and Transit Police Division officers responded to the report of a man struck by a MAX operator 141st Avenue and East Burnside Street.\nOfficers and medical personnel arrived and located 45-year-old Jason Robert Beveridge suffering from traumatic injuries. He was transported to a Portland hospital for treatment to life-threatening injuries and is listed in critical condition.\nInvestigators learned that Beveridge was walking across Burnside onto the MAX tracks where he tripped and fell then sat down for several minutes before being struck by an eastbound MAX train. The man was not crossing at a marked rail crossing and it is not clear why he remained on the tracks.\nThe Transit Police Division is conducting the crash investigation.\n###PPB###\nUPDATE - Major Crash Team Investigating a Serious Crash in the Sellwood Neighborhood - 01/06/17\nThe male driver involved in this crash died at the scene. The female passenger, who is the driver's wife, remains in a Portland hospital being treated for non-life-threatening injuries.\nPreliminary information indicates that the driver may have suffered a medical event prior to the crash.\nNames of those involved will be released on Saturday.\n###PPB###\n###ORIGINAL MESSAGE BELOW###\nOn Friday January 6, 2017, at 6:32 p.m., Central Precinct officers responded to Southeast 9th Avenue and Tenino Street on the report of a traffic crash with serious injuries and a vehicle on its side.\nOfficers and medical personnel arrived and located two people injured. A female passenger was transported by ambulance to a Portland hospital for treatment to serious injuries. The male driver remains lodged inside the vehicle and his condition is not known.\nPreliminary information indicates that the driver hit several parked cars prior to rolling his vehicle. It is unclear what factors led to the crash.\nThe Traffic Division's Major Crash Team has responded and will be conducting an investigation. There will be a limited traffic impact in the neighborhood for the next several hours.\nThe Portland Police Bureau is committed to working with our partners in government and the community to create safer streets and work towards reducing, and eventually eliminating, traffic fatalities as part of Vision Zero.\nTo learn more about the City of Portland's Vision Zero effort, please visit: http://www.portlandoregon.gov/transportation/40390\n###PPB###\nPortland Police Bureau K9's Maverick, Rico, Jasko, Marko, Bravo, Billy, Bora, Siggi, & Utzi Have Received Body Armor (Photo) - 01/06/17\nPortland Police Bureau K9's Maverick, Rico, Jasko, Marko, Bravo, Billy, Bora, Siggi, & Utzi have received a bullet and stab protective vests thanks to a charitable donation from non-profit organization Vested Interest in K9s, Inc. The K9's vests are sponsored by The Margaret Thiele Petti Foundation of Portland, Oregon and embroidered with the sentiment \"In memory of Margaret Thiele Petti.\"\nVested Interest in K9s, Inc. is a 501c (3) charity located in East Taunton, MA whose mission is to provide bullet and stab protective vests and other assistance to dogs of law enforcement and related agencies throughout the United States. The non-profit was established in 2009 to assist law enforcement agencies with this potentially lifesaving body armor for their four-legged K9 officers. Since its inception, Vested Interest in K9s, Inc. provided over 2,200 protective vests, in 50 states, through private and corporate donations, at a cost of over 1.9 million dollars. All vests are custom made in the USA by Armor Express in Central Lake, MI.\nThe program is open to dogs actively employed in the U.S. with law enforcement or related agencies who are certified and at least 20 months of age. New K9 graduates, as well as K9s with expired vests, are eligible to participate.\nThe donation to provide one protective vest for a law enforcement K9 is $1,050.00. Each vest has a value between $1,795 -- $2,234 and a five-year warranty, and an average weight of 4-5 lbs. There is an estimated 30,000 law enforcement K9s throughout the United States. For more information or to learn about volunteer opportunities, please call 508-824-6978. Vested Interest in K9s, Inc. provides information, lists events, and accepts tax-deductible donations of any denomination at www.vik9s.org or mailed to P.O. Box 9 East Taunton, MA 02718.\nCanine Unit Biographies\nUtzi\nK9 Utzi is a 4 year old German Shepherd who was purchased from Denver, Colorado. Utzi was certified in Patrol work in October of 2014. She is assigned to Sergeant Jason Preston.\nSiggi\nK9 Siggi is a 3 year old German Shepherd who was imported from Israel. Siggi was certified in Patrol work in October of 2014. He is assigned to Sergeant Troy Grundmeyer.\nJasko\nK9 Jasko is a 4 year old German Shepherd who was imported from Germany. Jasko was certified in Patrol work in December of 2013. He is assigned to Officer Shawn Gore.\nMaverick\nK9 Maverick is a 6 year old German Shepherd who was raised in Snohomish, Washington. Maverick was certified in Patrol work in July of 2012. He is assigned to Officer Lonn Sweeney\nRico\nK9 Rico is a 3 year old German Shepherd who was born and raised in Springfield, Oregon. Rico was certified in Patrol work in April of 2016. He is assigned to Officer Jeff Dorn.\nMarko\nK9 Marko is an 8 year old German Shepherd who was imported from Germany. Marko was certified in Patrol work in April of 2011. He is assigned to Officer Ryan Hilsenteger.\nBravo\nK9 Bravo is a 7 year old German Shepherd who was born and raised in Vancouver, BC. Bravo was certified as a Patrol K9 in April of 2011. He is assigned to Officer Ben Davidson.\nBilly\nK9 Billy is a 3 year old Belgian Malinois who was bought from the Vancouver B.C. Police Department. Billy was certified in Patrol work in May of 2015. He is assigned to Officer Rob Wullbrandt.\nBora\nK9 Bora is a 5 year old German Shepherd who was born in Canada and raised in Eugene, Oregon. She is assigned to Officer Kristi Butcher.\n###PPB###\nAttached Media Files: Utzi.jpg , Siggi.jpg , Jasco.JPG , Maverick.jpg , Rico.jpg , Marko.JPG , Bravo.PNG , Billy.JPG , Bora.JPG\nNew Years Resolution: Have a Designated Driver #VisionZero (Photo) - 01/06/17\nDuring the month of December 2016, Portland Police Bureau officers arrested 23 impaired drivers, utilizing additional funds supplied with a grant from Oregon Impact.\nAs we enter 2017,we'd like to remind everyone to drive responsibly.\nDrivers impaired by alcohol or drugs injure and kill thousands of people every year.\nAdditional DUII enforcement units will be added throughout the month of January 2017 to ensure community safety and to prevent needless tragedies.\nThe Portland Police Bureau would like to remind the driving public that drug-impaired driving is just as dangerous as alcohol-impaired driving.\nDesignate a sober driver, call a taxi or ride share, and remember that \"buzzed\" driving is drunk driving.\nSupport zero tolerance for impaired driving by reporting impaired drivers to 9-1-1.\nThe Portland Police Bureau is committed to working with our partners in government and the community to create safer streets and work towards reducing, and eventually eliminating, traffic fatalities as part of Vision Zero.\nTo learn more about the City of Portland's Vision Zero effort, please visit: http://www.portlandoregon.gov/transportation/40390\n###PPB###\nAttached Media Files: Drive_Sober.jpg\nUPDATE: Major Crash Team Investigating a Serious-Injury Crash in Southeast Portland - 01/05/17\nThe pedestrian injured in last night's crash has been identified as 43-year-old Jessica Michelle Moore of Northwest Portland. She remains in critical condition at a Portland hospital with life-threatening injuries.\nThe driver has been identified as 56-year-old William Schuyler Gilmour of Elk Grove, California. Gilmour was not impaired at the time of the crash and fully cooperated with investigators.\nTraffic investigators have learned that Gilmour was driving a white Kia Forte 4-door westbound on Main Street at or below the speed limit when he struck Moore, who was in a crosswalk, crossing from North to South across Main Street.\nInvestigators will continue to review information as part of the ongoing investigation. Once the investigation is complete, it will be forwarded to the Multnomah County District Attorney's Office for review.\n###PPB###\n###ORIGINAL MESSAGE BELOW###\nOn Wednesday January 4, 2017, at 5:13 p.m., East Precinct officers responded to the report of a pedestrian struck by a driver in the 10100 block of Southeast Main Street.\nOfficers and medical personnel arrived and located the female pedestrian suffering from traumatic injuries. The pedestrian was transported by ambulance to a Portland hospital with life-threatening injuries.\nThe male driver remained at the scene and is cooperating with officers.\nThe Traffic Division's Major Crash Team is responding to conduct an investigation into the crash.\nAll traffic on Southeast Market Street may be impacted for several hours due to the crash investigation.\nUpdate will be provided when they become available.\nThe Portland Police Bureau is committed to working with our partners in government and the community to create safer streets and work towards reducing, and eventually eliminating, traffic fatalities as part of Vision Zero.\nTo learn more about the City of Portland's Vision Zero effort, please visit: http://www.portlandoregon.gov/transportation/40390\n###PPB###\nPolice Bureau Seeks Public's Input on Directives (Photo) - 01/05/17\nThe Portland Police Bureau directs member action through the establishment of policy, procedure and rule, as found within Bureau directives.\nCurrently, the Bureau in the process of reviewing all of its directives and is asking for the community's feedback regarding the following:\n* 210.70 - Secondary Employment\n* 210.80 - Extra Employment\n* 640.36 - Communication with Hearing Impaired and Limited English Proficient Persons\n* 1025.00 - Firearms at Portland International Airport\n* 1070.00 - Firearms Confiscation and Acquisition\nCommunity members are encouraged to read the directives and provide drafting comments at:\nhttp://www.portlandoregon.gov/police/59757\nThis webpage also enables community members to sign up for email notifications when new directives are posted for review.\nThese directives will remain posted and comments collected for 15 calendar days. Prior to enactment by the Chief of Police, a finalized version of the directive(s) will again be posted for review for 15 calendar days.\n###PPB###\n#CEO\nAttached Media Files: Polcy_Manual.jpg\n51-Year-Old Homeless Man Dies of Hypothermia in East Portland on Monday Night - 01/03/17\nOn Monday January 2, 2017, at 7:45 p.m., East Precinct officers responded to the 9900 block of East Burnside Street to conduct a welfare check on a man down, not checked.\nOfficers arrived found an unresponsive male lying in front of a business. The man appeared to be homeless, lying on a pillow with a blanket covering his body.\nPortland Fire & Rescue personnel responded and determined that the man was deceased and had been for several hours. The man was identified as 51-year-old Mark Elliot Johnson, last known address in Hillsboro.\nBased on observations at the scene by officers and paramedics, it appeared that Johnson died of exposure due to cold temperatures. Today, the Oregon State Medical Examiner determined Johnson's cause of death to be hypothermia.\nIf you see someone outside, unsheltered whose life appears to be in danger or is in an apparent medical crisis, call 9-1-1. Otherwise, if you see someone about whom you are concerned, such as not being dressed for the weather conditions, call police non-emergency 503-823-3333 and request a welfare check for that person. To assist someone in locating shelter and transportation to shelter, please call 211.\nAs freezing temperatures are expected to continue this week, Portland Police officers will be actively looking for and checking on vulnerable people and facilitating transportation to warming shelters as needed.\nWarming centers are open in Portland and Gresham with capacity during day and night. Call 211 in Multnomah County at any hour for the latest information about open shelters. Calls are answered in over 150 languages. You can also visit 211's website at http://www.211info.org for updated information and sign up for emails or texts about updated warming center locations. Severe weather centers will accommodate individuals and couples, pets and belongings, and do not require identification or any other documentation. Families with children seeking shelter should also call 211 and will be directed to a shelter that can accommodate children.\nPeople seeking to get warm, especially during daytime hours, are encouraged to utilize public buildings that are open to the public, including, for example, libraries and community centers. Library hours are listed on Multnomah County Library's website - https://multcolib.org/hours-and-locations City community center information is listed here - https://www.portlandoregon.gov/parks/39839\nDuring extreme cold weather there is increased risk of exposure-related injuries for unsheltered homeless people who do not have sufficient gear, such as coats, hats, gloves, footwear, tarps, sleeping bags and blankets. For information about what and where to donate, please contact 211info by dialing 211 or by visiting their website.\nFor additional information on the dangers of cold including: hypothermia, carbon monoxide hazards and important information on the use of alternative sources of heat, please visit - https://multco.us/multnomah-county/news/dangers-cold\n###PPB###\nWoman Attempting Suicide by Police Taken to the Hospital on Monday Night - 01/03/17\nOn Monday January 2, 2017, at 10:09 p.m., North Precinct officers responded to the area of North Willamette Boulevard and Jessup Street after a 9-1-1 caller reported that a woman was armed with a gun and waving it around as she made threats to kill people.\nOfficers arrived in the area and saw a 27-year-old woman sitting on a bench that matched the description of the reportedly armed person. Officers called out to her and asked her to put her hands up and walk towards the police. The woman complied and was taken into custody without incident. Officers checked the woman's possessions and the area around the bench for a gun but did not find anything.\nOfficers learned that the woman was in a mental health crisis and called 9-1-1 to make the false report about a woman waving a gun, hoping that officers would shoot her if she charged at them.\nThe woman was transported by police to a Portland hospital on a police officer hold for a mental health evaluation.\nHelp is available for community members struggling from a mental health crisis and/or suicidal thoughts. Suicide is preventable.\nThe Portland Police Bureau created a video in 2013 titled, \"What if You Could Turn Back the Clock on Suicide?\" It is available for viewing at https://youtu.be/_1uz3cs-HdA\nThe Multnomah County Mental Health Call Center is available 24 hours a day at 503-988-4888.\nIf you or someone you know needs help with suicidal thoughts or is otherwise in an immediate mental health crisis, please visit Cascadia or call 503-963-2575. Cascadia Behavioral Healthcare has an urgent walk-in clinic, open from 7:00 a.m. to 10:30 p.m., 7 days a week. Payment is not necessary.\nLines for Life is also available 24 hours a day at 1-800-273-TALK (8255).\nInformation about the Portland Police Bureau's Behavioral Health Unit (BHU) and additional resources can be found by visiting http://portlandoregon.gov/police/bhu\n###PPB###\nUPDATE: Person Killed on I-205 Northbound - Freeway Closed at Foster Road - 01/02/17\nThe person killed on Sunday afternoon has been identified as 54-year-old Mark Jay Schnoor of Southeast Portland.\nTraffic investigators learned that Schnoor pulled his white 2002 Chevrolet Silverado pick-up truck to the right emergency lane and turned his hazard lights on.\n47-year-old Laura N. Rotharmel of Northeast Portland was driving northbound on I-205 in the right lane in a 2016 Freightliner semi-tractor with a 53' trailer.\nMoments before Rotharmel was to pass Schnoor's pick-up truck, Schnoor exited the driver's side door and stood in Rothararmel's lane of traffic where was struck by Rotharmel's truck and died at the scene.\nPreliminary information indicates that Schnoor stepped in front of Rotharmel's truck as an intentional act.\nThe investigation is continuing and, once complete, will be forwarded to the Multnomah County District Attorney's Office for review.\n###PPB###\n###ORIGINAL MESSAGE BELOW###\nOn Sunday January 1, 2017, at 12:36 p.m., East Precinct officers responded to the report of a person struck by a semi-truck driver on I-205 northbound over Powell Boulevard.\nOfficers and medical personnel arrived and located the male adult pedestrian and determined that the he was deceased. The semi-truck driver stopped and has cooperated with officers.\nPreliminary information indicates that the man pulled off the freeway and was struck after exiting his vehicle.\nThe Traffic Division's Major Crash Team is responding to conduct an investigation into the crash.\nAll I-205 northbound traffic will be diverted off the freeway at the Foster Road exit and allowed to re-enter the freeway at Powell Boulevard. The freeway is expected to remain closed for several hours.\nUpdates will be shared when they become available.\nThe Portland Police Bureau is committed to working with our partners in government and the community to create safer streets and work towards reducing, and eventually eliminating, traffic fatalities as part of Vision Zero.\nTo learn more about the City of Portland's Vision Zero effort, please visit: http://www.portlandoregon.gov/transportation/40390\n###PPB###\nHeroin and Cash Seized in Drug Arrest in Northeast Portland on Friday Evening (Photo) - 01/02/17\nOn December 30, 2016, Central Precinct Street Crimes Unit officers performed a drug investigation near Northeast 69th Avenue and Northeast Sandy Boulevard. During the investigation officers established probable cause for the arrest of 28-year-old Edson Duran-Hernandez.\nOfficers contacted Duran-Hernandez and took him into custody without incident. During a search of Duran-Hernandez's vehicle officers located and seized approximately 12 ounces of heroin. Additionally, officers seized a cell phone, a knife, and $2530 cash as evidence that Duran-Hernandez was involved in trafficking narcotics.\nDuran-Hernandez was booked into the Multnomah County Jail on charges of Delivery of Heroin, Possession of Heroin, and Manufacture of Heroin.\nThe North Precinct Street Crimes Unit, Drugs and Vice Division and Gang Enforcement Team assisted in this investigation.\nThe Central Precinct Street Crimes Unit works to address neighborhood livability issues and street-level drug dealing.\nCommunity members concerned about drug activity in their neighborhood should report the information on line at http://www.portlandonline.com/police/index.cfm?c=30740 or call the Drugs and Vice Division Drug Complaint Hotline at (503) 823-3784.\n###PPB###\nAttached Media Files: Edson_Duran-Hernandez_28.jpg\nGang Enforcement Team Investigating Early New Year's Day Shooting -- No Injuries - 01/01/17\nOn Sunday January 1, 2017, at 1:23 a.m.., North Precinct officers responded to a residence in the 8900 block of North Portsmouth Avenue after receiving reports the house was struck by gun fire.\nOfficers arrived at the home and located multiple bullet strikes into the residence as well bullet casings near the corner of North Portsmouth Ave and North Houghton Street. There were seven persons in the residence when it was struck by gunfire but none were injured.\nBased on information learned at the scene, the Gang Enforcement Team will investigate this incident.\nPersons with information regarding this shooting are asked to contact Detective Brent Christensen at 503-823-2087 or Brent.Christensen@portlandoregon.gov.\nAnyone with information about gun crimes in the City of Portland is encouraged to provide information to the Portland Police Bureau's Tactical Operations Division at 503-823-4106 or email information to gangs@portlandoregon.gov.\nInformation learned from social media sites such as Facebook, Twitter or YouTube should be shared with investigators as these tips may lead to the identification of a suspect or suspects.\nIf you see a gun crime in progress, call 9-1-1.\nThe Portland Police Bureau works closely with Enough is Enough PDX, a community-led campaign aimed at encouraging people to take a stand against gang violence in the area.\nFor more information about Enough is Enough PDX and how you can get involved, please visit https://www.facebook.com/EnoughIsEnoughPDX\nAdditional information about Enough is Enough PDX and other City efforts addressing youth violence can be found at the Office of Youth Violence Prevention, http://www.portlandonline.com/safeyouth/\nCrime Stoppers of Oregon is offering a minimum $250 cash reward to anyone who reports a convicted felon or a juvenile in possession of a firearm and tipsters can remain anonymous. Rewards of up to $1,000 are available for other unsolved felony crimes - $2,500 for unsolved homicides.\nSubmit an anonymous tip:\nText CRIMES (274637) - Type 823HELP, followed by the tip.\nOnline at http://crimestoppersoforegon.com/submit_online_tip.php\nCall 503-823-HELP (4357)\nVisit http://tipsoft.com to download the TipSubmit app for the iPhone or Droid.\n###PPB###\nOne Person in Custody after Threatening Persons with Knife and Throwing Items from 15th Floor Balcony in Downtown Portland (Photo) - 12/30/16\nOn Thursday December 29, 2016, at 7:29 PM., Central Precinct officers responded to the report of a man smoking an unknown substance, threatening persons with a knife, breaking items and throwing objects while atop the fifteenth floor balcony of Departure located at 525 Southwest Morrison Street.\nMultiple officers arrived on scene and implemented a plan to ensure the safety of guests at Departure, The Nines Hotel, community members on the roadways and sidewalks surrounding the building, the subject who was in crisis, and responding officers.\nAs officers arrived on scene they learned the man had thrown bricks and other items from the fifteenth floor balcony to the sidewalk and roadway below. Additionally, witnesses informed officers the man had threatened several employees at Departure prior to officers arriving.\nOfficers requested The Nines Hotel and Macy's Department Store ensure their guests did not exit onto sidewalks where debris was being thrown. The roadways and sidewalks from Southwest Morrison Street to Southwest Alder Street on SW 6th Avenue and from Southwest 5th Avenue to Southwest 6th Avenue on Southwest Alder Street were closed to pedestrian, vehicle and TriMet traffic.\nOfficers, including two Enhanced Crisis Intervention Team (ECIT) officers, multiple sergeants and a lieutenant, responded to the location and began talking with the 57-year-old man who was in crisis. The man initially did not communicate with officers and moved from a fifteenth floor balcony to a roof structure on the fourteenth floor. Once the man was on the fourteenth floor roof structure officers continued to attempt to engage the man; however, he would not cooperate. The man attempted to break a window with a hard object and gain entry into an occupied hotel room at the Nines Hotel. Officers had started to assist persons on the fourteenth floor from their rooms and to a safe location, but, this room was still occupied. Concerned the man would break the window and enter a room occupied by multiple persons, officers deployed pepper spray. The pepper spray was effective in deterring the man from breaking the window. The man stopped his attempt to enter the room and officers continued to try and communicate with the man.\nOfficers continued to create dialogue with the man. Eventually the man agreed to come inside a fourteenth floor room where he was taken into custody. Initially the suspect was uncooperative and would not provide his name. He was later identified as 57-year-old Matthew Lee Owen. Once taken into custody he was evaluated by medical personnel. Owen was booked into the Multnomah County Jail on charges of Trespass in the Second Degree, Unlawful Use of a Weapon, Menacing, Disorderly Conduct in the Second Degree, Criminal Mischief in the First Degree, and Harassment. He initially provided a fictitious name upon being lodged at the Multnomah County Detention Center. Owen was lodged at the Multnomah County Jail under the name \"David Owen.\" Officers have since confirmed his name to be Matthew Lee Owen.\nAdditionally, officers requested Multnomah County Jail Mental Health evaluate Owen prior to his release from the jail.\n###PPB###\nAttached Media Files: Matthew Owen\nShooting Injures One Man Early Friday Morning on East Burnside Street - 12/30/16\nOn Friday December 30, 2016, at 1:05 a.m., East Precinct officers responded to the report of a shooting at the intersection of East Burnside Street and 122nd Avenue.\nOfficers arrived in the area and learned that a 19-year-old male was suffering from four gunshot wounds to his legs. As officers approached the victim to render him aid they observed him holding a firearm. The victim complied with officers' directions to place the firearm on the ground. The victim was transported to a Portland hospital by ambulance for treatment and is expected to survive.\nOfficers seized the victim's firearm and located multiple bullet casings near the initial contact location with the victim. It is unclear if the injuries are self-inflicted.\nNo suspect has been located in this investigation.\nBased on information learned at the scene, the Gang Enforcement Team is conducting the investigation.\nAnyone with information is asked to call the Police Non-Emergency Line at 503-823-3333.\nThe Tactical Operations Division's Gang Enforcement Team (GET) and Gun Task Force (GTF) are continuing to investigate several incidents of gun violence citywide.\nAnyone with information about gun crimes in the City of Portland is encouraged to provide information to the Portland Police Bureau's Tactical Operations Division at 503-823-4106 or email information to gangs@portlandoregon.gov.\nInformation learned from social media sites such as Facebook, Twitter or YouTube should be shared with investigators as these tips may lead to the identification of a suspect or suspects.\nTips on gun crimes can be emailed to GunTaskForce@portlandoregon.gov.\nIf you see a gun crime in progress, call 9-1-1.\nThe Portland Police Bureau works closely with Enough is Enough PDX, a community-led campaign aimed at encouraging people to take a stand against gang violence in the area.\nFor more information about Enough is Enough PDX and how you can get involved, please visit https://www.facebook.com/EnoughIsEnoughPDX\nAdditional information about Enough is Enough PDX and other City efforts addressing youth violence can be found at the Office of Youth Violence Prevention, http://www.portlandonline.com/safeyouth/\nCrime Stoppers of Oregon is offering a minimum $250 cash reward to anyone who reports a convicted felon or a juvenile in possession of a firearm and tipsters can remain anonymous. Rewards of up to $1,000 are available for other unsolved felony crimes - $2,500 for unsolved homicides.\nSubmit an anonymous tip:\nText CRIMES (274637) - Type 823HELP, followed by the tip.\nOnline at http://crimestoppersoforegon.com/submit_online_tip.php\nCall 503-823-HELP (4357)\nVisit http://tipsoft.com to download the TipSubmit app for the iPhone or Droid.\n###PPB###\nOne Person Injured in North Portland Shooting -- Suspect in Custody - 12/30/16\nOn Friday December 30, 2016, at 12:44 a.m.., North Precinct officers responded to the report of a shooting at Jags Clubhouse, located at 605 North Columbia Boulevard. As officers were responding to the scene they learned that one person was shot by a female suspect who had left the scene.\nOfficers and medical personnel arrived and located a 37-year-old male victim, suffering from a non life-threatening gunshot wound to his shoulder. The victim was transported by ambulance to a Portland hospital for treatment.\nThe suspect was located nearby. The suspect, a 24-year-old female was taken into custody without incident. A firearm has been seized as evidence.\nPreliminary information indicates an argument started inside Jags Clubhouse and the shooting occurred during the argument.\nAssault detectives will be the lead on the investigation.\nUpdates will be provided when they become available.\n###PPB###"}