{"uri": "http://www.dispatch.com/content/stories/local/2016/07/17/0717-east-side-shooting.html", "title": "Girl, 12, is killed, brother wounded in shooting on East Side", "dct": "NODATE", "id": "bf49433bde8dbd432465f8865ed406d7", "content": "Hide caption The scene of the shooting Jim Woods / Dispatch\nA man entered the den of an East Side home where a young girl and boy were watching television with their grandmother on Sunday evening and started shooting. The girl, Cheyenne Stewart, 12, died in the den. Her brother, Thaijuan Green, 10, survived and was taken in critical condition to Nationwide Children's Hospital, Columbus police said. Their grandmother was not hit.\nA man entered the den of an East Side home where a young girl and boy were watching television with their grandmother on Sunday evening and started shooting.\nThe girl, Cheyenne Stewart, 12, died in the den. Her brother, Thaijuan Green, 10, survived and was taken in critical condition to Nationwide Children's Hospital, Columbus police said. Their grandmother was not hit.\nColumbus police officers who responded to the scene in the 2600 block of Kenview Road South at 5:40 p.m. took the suspected shooter, Milous Keith III, 59, into custody at the house. Police said Keith is the children's uncle.\nKeith was charged with murder and felonious assault, police said.\nThe gun used in the shooting was recovered, said Sgt. Joseph Plancon, second-shift supervisor of the homicide squad.\nKeith was questioned at Columbus police headquarters last night and taken to the Franklin County jail.\nDuring questioning by detectives Keith admitted that he shot Cheyenne but didn't recall shooting Thaijuan. He told detectives that he was upset that his mother was watching the children, according to court records.\n\"We don't know what his history is or whether he has mental-health issues,\" Plancon said during the early stages of the investigation. The man lived at the house but it was not immediately clear where the children lived.\n\"It's unfortunate. He walked in and started shooting the kids,\" Plancon said.\nThe boy was struck in the stomach and arm. He went through surgery last night and is expected to survive, police said.\nA man who lives down the street and didn't want to give his name said he was out in his garage smoking a cigarette when he saw a young boy dart across the road.\n\"I didn't pay it any mind,\" the man said, but then knew something was up when moments later police and fire crews rushed to the house down the street.\nPlancon said the boy ran to a neighbor's house, where paramedics attended to him.\nMarlene Finch, 73, lives on a nearby street and surveyed the somber scene from behind the yellow police-tape line.\n\"It's sad,\" Finch said of the scene. \"I got grandkids. It's scary.\""}