{"uri": "http://www.nbcwashington.com/news/local/Shooting-in-Southeast-DC-393848481.html", "title": "2 Dead, 7 Hurt in Southeast DC Shooting at Community Party", "dct": "Sun, 18 Sep 2016 01:33:00 GMT", "id": "ad251b2cb6c15f4e96dff2e71ceabe89", "content": "Two men were killed and seven other people were hurt when shooters opened fire Saturday night at an annual community party in Southeast D.C.\nZoruan Otto Harris, 18, and Scorpio-Rodney Alonzo Phillips, 31, died after gunfire erupted on the 2600 block of Birney Place SE, police said. Residents were attending the annual Dorsey Day community party, with food, drinks and a moon bounce for children.\n\"There were multiple people out there and it looks like there were multiple shooters,\" Metropolitan Police Department Interim Police Chief Peter Newsham said. \"There was some kind of dispute up here that resulted in gunfire.\"\nPolice were called to the block about 8:20 p.m. Harris -- a recent high school graduate with a scholarship to head to college -- and Phillips were pronounced dead at the scene.\nSeven other people received non-life-threatening injuries, including a boy believed to be just 8 years old and two women, police said. The boy was conscious and speaking when he was taken to a hospital.\nTwo people are dead and seven people are injured, including one child, after a shooting at an outdoor event in southeast D.C. Saturday night, police say. (Published Sunday, Sept. 18, 2016)\nOn Sunday, relatives of the victims spoke out against the violence.\n\"I want to see justice...I want the person that shot my cousin -- I want them done...in jail for life,\" said Lashawn, Phillips' cousin.\nHarris, known to his friends as Von, was the father of a 1-year-old boy and had graduated from National Collegiate Preparatory in Southeast in the spring. He was headed to college in January, relatives said.\n\"Everything was just going his way,\" Harris' uncle said. \"He always had a lot of smiles and...he was just always upbeat.\"\nWitnesses told News4 that ambulances were delayed in arriving at the scene. Fire department officials provided a time line showing that ambulances arrived within 7 minutes 30 seconds from when they were dispatched, which falls within department guidelines.\nAt least four of the people shot, including the child, made it to a hospital without being transported by D.C. Fire and EMS.\nNo arrests had been made as of Monday morning, and police said they did not know how many shooters opened fire. Police were talking to \"some folks,\" Newsham said.\n\"Because of the fact that there were so many people up here, we have a pretty good sense that we're going to be able to get to the bottom of what exactly occurred,\" he said.\nResidents and the interim police chief condemned the shooting.\n\"This shouldn't happen. Folks ought to be able to come out here an enjoy a nice event on a nice evening, and the fact that you would have some violent offenders out here doing this kind of thing, hurting young people, hurting women and you have two folks that are killed -- it shouldn't happen,\" Newsham said.\nDorsey Day was created to honor a resident known for his support of the community.\nANC Commissioner Paul Trantham expressed frustration.\n\"Here we go again. Violence in Southeast -- gun violence and the chief of police and the mayor still refuse to put out the vice squad, people out here that can control our streets, patrol our streets and keep our streets safe,\" he said."}