{"uri": "http://www.dailyrepublic.com/news/crimecourts/2-dead-2-hurt-during-vallejo-party-shooting/", "title": "2 dead, 2 hurt during Vallejo party shooting", "dct": "Mon, 03 Jun 2013 00:00:00 GMT", "id": "5598ee70783a286876e5918d24dd4593", "content": "FAIRFIELD — Two people died and two others were injured late Saturday when they were shot during a party in Vallejo.\nThe shooting occurred on the 100 block of Linfield Drive and was reported at about 11:42 p.m., Vallejo police report.\nTwo men were shot multiple times and were pronounced dead at the scene, police report. Another man was grazed in the head by a passing bullet. His injuries were not considered life-threatening. A juvenile male was taken to the hospital with a gunshot wound that was not considered life-threatening.\nThe names, ages and cities of residence of the victims were not released.\nA suspect fled the scene. He’s described as a Hispanic male, 20 to 30 years old, 5 feet 6 inches to 5 feet 8 inches tall with a medium build, goatee and a mustache. He was wearing a black hoodie.\nAnyone with information about the shooting is asked to call Vallejo police detectives at 1-800-488-9383. Tipsters can also remain anonymous and call Solano County Crime Stoppers at 644-STOP.\nReach Glen Faison at 427-6925 or gfaison@dailyrepublic.net. Follow him on Twitter at www.twitter.com/GlenFaison.\nGlen Faison\nGlen Faison joined the Daily Republic as managing editor in September 2009. He previously worked as a reporter and editor for daily and weekly newspapers in the San Joaquin Valley for 20-plus years. His experience includes time as editor of the Golden Eagle, a military paper serving the Lemoore Naval Air Station. He graduated from Fresno State University with a bachelor's degree in journalism and bleeds Bulldogs red. He is an avid fan of the NFL's Washington team, and attended the 1988 NFC Championship Game against the Minnesota Vikings at RFK Stadium. He's a member of the Fairfield-Suisun Twilight Rotary Club and a board member for the Solano County Library Foundation. He married his wife, Jill, in 2005, and has three children: Courtni, Tyler and Hayli."}