{"uri": "http://www.tribstar.com/news/local_news/update-sullivan-teen-died-of-self-inflicted-gunshot/article_b51562c8-2caa-5ab8-95b3-3f1421713513.html", "title": "UPDATE: Sullivan teen died of self-inflicted gunshot", "dct": "Wed, 07 Sep 2016 00:00:00 GMT", "id": "8a9d26814733f6272299cffb846ae91f", "content": "A self-inflicted gunshot was the cause of death for a 14-year-old Sullivan County boy on Monday.\nAn autopsy conducted Tuesday determined that Jacob Settler of Graysville died of the gunshot wound, but the investigation remains open, according to Indiana Conservation Officer Max Winchell.\nA 911 call was made to the Sullivan County Sheriff’s Dispatch at noon Monday reporting the gunshot incident in a wooded area behind Setter’s residence in the 4100 block of West Indiana 154, Graysville. Settler was pronounced dead at the scene by the Sullivan County Coroner’s Office.\nToday, Winchell said the information gleaned from the investigation, coupled with the Sullivan County Coroner’s report, shows that Settler died from a self-inflicted gunshot. The incident has been determined to not be hunting related, Winchell said.\nThe news release from Winchell did not list the manner of death as suicide, however, the autopsy report by Dr. Roland Kohr did list suicide as the manner of death.\nOriginal post 5:42 p.m. Monday, Sept. 5, 2016\nIndiana conservation officers are investigating the shooting death of a 14-year-old Sullivan County boy that happened about noon today.\nJacob Settler, 14, of Graysville, was pronounced dead at the scene by the Sullivan County Coroner’s Office. A 911 call was made to the Sullivan County Sheriff’s Dispatch at 12:01 p.m. The incident occurred in a wooded area behind Setter’s residence in the 4100 block of West Indiana 154, Graysville.\nAn autopsy is set for 10 a.m. Tuesday at Terre Haute Regional Hospital, said Conservation Officer Max Winchell.\nNo further details can be released pending the investigation, Winchell said."}