{"uri": "http://www.fresnobee.com/news/local/crime/article45430338.html", "title": "Five are shot outside southwest Fresno market near Edison High School", "dct": "Wed, 18 Nov 2015 19:03:00 GMT", "id": "1b65ee9c2df7b70ccb514a723c1056db", "content": "Five people were shot Wednesday evening at a southwest Fresno market two blocks from Edison High School, where a boys water polo playoff match was briefly halted until police secured the shooting scene.\nThe shooting occurred just before 6 p.m. in the parking lot outside of Zack’s Market at California Avenue and Martin Luther King Jr. Boulevard. Police said three men, one boy and one girl were hit.\nOne of the men is in serious condition, police Lt. Dave Ramos said. The other victims had nonlethal injuries, he said. Ramos did not know the age of the children.\nThe victims were transported to Community Regional Medical Center.\nFresno police were diverting traffic from the intersection.\nThe motive is still unknown. Police believe the victims were targeted, but they don’t know whether the shooting was gang-related, Ramos said. He said a large group of people was gathered in the parking lot when the gunman came up and began shooting.\nPolice said the only description they have so far is that the suspect is a black man who fled in possibly a white SUV. He is still being sought.\nRamos said officers patrolling nearby heard the shots and then the dispatch call and were able to get to the scene quickly and begin canvassing the area.\nAt Edison High School two blocks away, the Division III boys water polo semi-final between Edison and Exeter High was interrupted briefly because of the shooting. The school’s aquatics facility was evacuated about five minutes before players were allowed back in the pool and fans were let back in the facility.\nDetectives are continuing their investigation, and Ramos said the intersection will likely remain closed until 11 p.m.\nStaff writers Nick Giannandrea and Paul Schlesinger contributed to this report. Troy Pope: 559-441-6442, @troycpope"}