{"uri": "http://abc11.com/news/14-year-old-shot-in-durham/1682588/", "title": "'Week of Peace' undaunted despite latest Durham shooting", "dct": "Mon, 02 Jan 2017 00:00:00 GMT", "id": "6dfbc712848abaff3b8675d0512eb078", "content": "DURHAM (WTVD) --\nA 14-year-old boy was shot during the very week a group has called for a \"Week of Peace\" in Durham.\nThe shooting happened Monday morning. Police were investigating a shooting at the intersection of East Pettigrew and South Plum streets and just after 11 a.m., they were called to a nearby BP gas station at 308 S. Alston Ave. That's where they found the teen with a gunshot wound to the hip.\nHe was taken to the hospital with injuries that don't appear to be life-threatening, according to police.\nNo word yet on any suspects, but along with police, another group is asking anyone with information to come forward.\n\"We know we can't stop all the violence,\" said Dorel Clayton.\nClayton is with a group called Bull City United, hosting what they call a \"Week of Peace.\"\nRELATED: WEEK OF PEACE AIMED AT CURBING DURHAM VIOLENCE\nThey started on Sunday and plan to visit some of Durham's most violent neighborhoods each night this week.\nMonday night, they had a packed room in Durham's Turnkey neighborhood at the recreation center on Walton Street.\nThey heard from mothers of children lost to gun violence. They even heard from ex-offenders who admit to not knowing the gravity of what they were doing until they lost someone close.\n\"I'm tired of going to crime scenes, listening to mothers, fathers, scream and cry for their son who has lost his life to what? Senseless violence,\" said Sheriff Michael Andrews, who plans to make it to as many of these events this week as he can.\nMayor Bill Bell was also in the crowd, along with County Commissioner Brenda Howerton, with her own story of loss.\n\"Two of my children were murdered,\" Howerton said. \"So I am your county commissioner, but I'm also a mother that carries that pain every day.\"\nThe crowd also heard from members of the clergy and concerned citizens who said there needs to be more action than conversation and that the change needs to start in helping the youth. Organizers also said change begins with reporting crimes.\nAnyone with information about Monday morning's shooting of the 14-year-old boy, or any crimes, is asked to call CrimeStoppers at (919) 683-1200.\nCrimeStoppers pays cash rewards for information leading to arrests in felony cases and callers never have to identify themselves.\nReport a Typo"}