{"uri": "http://www.13newsnow.com/news/local/virginia/eastern-shore/police-1-dead-3-injured-after-shootings-in-northampton-county/248976360", "title": "One dead, three hurt after pair of shootings on Eastern Shore", "dct": "Mon, 20 Jun 2016 00:00:00 GMT", "id": "131ec79e5436a3ed31447750645a5bb2", "content": "Picott-Cleveland is accused of shooting 4 people at 2 different locations Saturday night.\nOne of the victims, Ronald Graves, died. Sheriff David Doughty said 30-year-old Graves and Picott-Cleveland are related.\nWitnesses told 13News Now they saw Picott-Cleveland sitting in a car on their street for about half an hour. Then, they watched as he jumped out and started shooting.\n\"He came to kill. He literally jumped out to kill,\" said Courtney Doughty, who was sitting on her porch when the shooting took place.\n\"When we seen it, it was like it didn't really hit you at that moment until you realize like he's got a gun, and he's trying to kill this guy,\" she said.\nExmore police received a call about the gunfire just before 7:30 p.m. Neighbors said by the time officers got to Frederick Douglas Road, 22-year-old Picott-Cleveland was gone, that he sped-off in a car with other people.\nMany people were outside at the time for a tribute to someone who was killed in Exmore last year.\n\"The road was loaded. There were cars and vehicles, children everywhere, kids on their bikes,\" said Courtney Doughty.\n\"It was crazy. It was something that in broad daylight, with so many people around, you wouldn't expect that,\" said Eric Doughty, who watched from his home down the street.\nAbout 30 minutes after the shooting on Frederick Douglas, the Northampton County Sheriff's Office got a call that Picott-Cleveland was at a home on Arlington Road near Kiptopeke State Park.\nDeputies got to Arlington Road and found Graves and a woman who were hurt.\nInvestigators determined the woman had been shot at the Frederick Douglas Road location.\nSheriff Doughty said Picott-Cleveland left the second location. That's when the search for him began.\nThe manhunt ended around 6:45 a.m. Sunday, when deputies took Picott-Cleveland into custody.\nHe was arrested at his home in the area of Arlington Road without incident.\nPicott-Cleveland is charged with Murder,Use of a Firearm While Committing Murder, 3 counts of Malicious Wounding, 3 counts of Use of a Firearm While Committing Malicious Wounding, Reckless Handling of a Firearm, and Brandishing a Firearm. He is being held at the Eastern Shore Regional Jail without bond.\nThe third -- one of the men -- still is in the hospital with critical injuries.\nSheriff Doughty said the Northampton County Sheriff's Office is working with the Exmore Police Department on the investigation.\n(Photo: Northampton County Sheriff's Office)"}