{"uri": "http://www.nydailynews.com/new-york/13-people-shot-wild-brooklyn-house-party-article-1.2312195", "title": "'There were bodies on the ground': Nine shot and wounded after bullets ring out during wild Brooklyn house party", "dct": "Mon, 03 Aug 2015 09:07:51 GMT", "id": "5dc91cd965041e4a3c5ccac8bd5d9087", "content": "A slew of shootings over the weekend killed three people and wounded 19 with nine people shot at one Brooklyn house party early Sunday.\nFive women and four men between the ages of 19 and 38 were hit — none fatally — by bullets outside a backyard house party in East New York around 2:20 a.m. after a disagreement turned into a gunfight, authorities said.\nNeighbor Irgra Dabreo, 39, said she heard an argument at the party followed by the sounds of five gunshots.\n“Someone said ‘What the f---,’ she said. “The music stopped. People started screaming and running. It was very scary.”\nDabreo said people fleeing the party came jumping over her back fence.\nFour more people suffered minor injuries during the mayhem.\nA 19-year-old woman and a 24-year-old man were struck in the neck while the other victims were all shot in the leg.\nOne man who said he was at the barbecue said he saw two women lying in the street after the madness.\n“I actually helped a girl who was shot in the leg get to the hospital,” said the man, who declined to give his name.\nShell casings and a bloody rag littered the street outside the home early Sunday as dozens of investigators scoured the area for bullet fragments and other evidence.\nA neighbor said the gunshots woke him up.\n“There were bodies on the ground. Everybody was lying down ‘til the shooting stopped and then they got up and scattered,” said Faylo Alston, 43. “They looked afraid for their lives.”\nThe victims were taken to local hospitals, where at least two people were listed in serious condition, according to the fire department.\nDabreo, who claims there were at least 200 people at the house party, said the shooting had her fearing for the lives of her three children.\n“This is a prime example of why I don’t let them stay out,” she said. “We talk about the violence all the time. It’s not safe. It’s an everyday occurrence in East New York.”\nShe said her neighbors have thrown other parties that have caused issues in the past.\nVirginia Thomas, 77, a longtime East New York resident, said she felt the shooting is a sign the neighborhood is getting worse.\n“It's just repeating itself,” she said.\nThree other shootings shook the city in the wee hours of Sunday morning.\nIn the Bronx, an unknown shooter shot three people, one fatally, in a playground around 1:30 am.\nPolice say Christian Garcia, 20, died after being shot in the chest at the Space Time Playground in Soundview, while an unidentified 25-year-old man and a 17-year-old girl were hit in the leg and buttocks, respectively.\nThe wounded man was taken to Jacobi Hospital and the girl was brought to Lincoln Medical Center, where they were both listed in stable condition, authorities said.\nBack in Brooklyn, a 46-year-old man was shot to death outside the Walt Whitman Houses in Fort Greene around 2:20 a.m., authorities said.\nThe man, who was not immediately identified, was rushed to Methodist Hospital with multiple gunshot wounds on his body, but he could not be saved\nAs the bloody summer night wore on, a 15-year-old boy was shot in the stomach when a gunman in a car sprayed bullets across Flatbush Ave. and Lincoln Road, hitting several vehicles in Prospect-Lefferts Gardens at 3:45 a.m., police said.\nThe boy was taken to Kings County Hospital, where he was expected to survive.\nSunday saw 14 people shot during a bloody weekend with 19 gunshot victims, as authorities continue their attempts to stanch the increase in shootings and homicides to bring this year's statistics in line with last year’s numbers.\nUntil Saturday at midnight, the week had looked promising: there were 14 shootings compared to 40 and one murder compared to four over the same time period in 2014.\nFor the year, homicides are still up by more than 10% over 2014’s historic lows, according police statistics current to July 26.\nShootings have been up by just under 3%.\nNone of the suspects had been arrested as of Sunday morning.\nerosenberg@nydailynews.com"}