{"uri": "http://abc7ny.com/news/gunmen-sought-after-9-shot-in-brooklyn;-total-of-19-shot-over-weekend-in-nyc/898447/", "title": "Police looking for gunmen in shooting that wounded 9 in East New York; total of 19 shot over weekend in NYC", "dct": "Mon, 03 Aug 2015 00:00:00 GMT", "id": "ac44f1906136f9fc1a30f0541e4cb637", "content": "EAST NEW YORK (WABC) --\nPolice are trying to find the two gunmen who opened fire at a gathering in East New York, Brooklyn early Sunday.\n9 people were wounded. They were among 19 shooting victims around the city over the weekend, three of whom died.\nBrooklyn Borough President Eric Adams is launching a 'Take Five to Stay Alive' campaign to combat the gun violence.\nAdams led a procession Monday that was carrying a coffin containing pictures of those who have died from gun violence, as well as a mirror. Adams said he wants people passing by to stop and not just think about the troubling issue but also to mobilize and do something about it.\n\"This issue is so important that we're at the crisis stage,\" said Adams. He set up the open casket outside Brooklyn Borough Hall, where it will stay for five days.\nThe powerful image, Adams said, is a reminder of the many lives lost to gun violence. \"When a bullet is discharged from the barrel of a gun it does not discriminate,\" he said. \"It will take the life of anyone and anything that it hits.\"\n\"We won't solve this problem until we take the problem of gun violence and public safety out of the realm of just police,\" said Brooklyn City Councilman Jumaane Williams.\nMeanwhile, police hope that newly released surveillance video will help them track two gunmen who were seen opening fire in East New York.\nWATCH:\nOne of the victims in the shootings spoke with Eyewitness News.\n50 shell casings were found where 25-year-old Donnell Smith was killed on Friday night.\n\"He rang the phone and said 'Mommy, I'm on my way home!'\" said Smith's mother, Rosalind Jackson.\nThat was the last time Jackson would hear her son's voice. This shooting was just the beginning of a violent weekend of gunfire throughout several boroughs.\n\"I went to him and told him 'Mommy is here, and I watch my son breathe and stop breathing,\" adds Jackson, \"then when they got there and they started pumping his chest, I knew my child was gone.\"\nAntoine Stoves is recovering from bullet wounds. He was shot on the foot and arm at a party celebrating the life of a young girl who died.\n\"This man started shooting nine people, it was amazing,\" Stoves said, \"it was like at least 10 ambulance out there.\"\nFor Stoves, the shooting was a case of life imitating art/ He is an actor in a web series about violence in Brooklyn, and the damage it does.\n\"People see the damage, and then they worry - they don't think about it before they do it,\" Stoves says.\nThis leaves mothers like Jackson to beg for a better way.\n\"You got to put the guns down - what happened to the old days when we used to go out and have a fight, and we fought with our fists?\" she said.\nThe Councilman commented on this saying it is a war zone if your own grandparent can't leave the house to go to the store."}