{"uri": "http://www.wsmv.com/story/27904193/clarksville-police-id-suspect-in-shooting", "title": "Clarksville police arrest suspect in shooting", "dct": "Wed, 21 Jan 2015 17:07:00 GMT", "id": "6e1c99c741d4b5be2efd5190e478445b", "content": "CLARKSVILLE, TN (WSMV) -\nClarksville police have arrested Timothy David Shoffner, identified as a suspect in a shooting Tuesday night that left one person dead and three people injured.\nShoffner was arrested Sunday at the Walmart on Fort Campbell Boulevard.\nThe shooting occurred about 8:45 p.m. at 321 Lansinger Lane.\nPolice said Lisa Downs, 57, and Donald Johnson, 23, suffered multiple gunshot wounds and were transported by helicopter to Vanderbilt University Medical Center. Sherri Downs-Tipton, 48, was taken to Gateway Medical Center with a gunshot wound.\nMontrel Quintres Patterson, 22, of Clarksville, was found dead at the scene.\nShoffner, 22, is 5'8”, weighs 140 pounds and has black hair. He has several arrest warrants on file, according to police. He is believed to be in the Clarksville or Ashland City area.\nNeighbors said Downs, Johnson and Tipton live in the apartment complex. They said they do not know the man who died.\n\"I was watching, like, an action movie and I heard two gunshots,\" said Donald Matthews, a neighbor. \"And I sat there and was listening and I turned the TV down and I heard five shots. I heard screams for help.\"\nMatthews raced downstairs at his Lasinger Lane apartment and was stunned by what he found.\n\"I see four people laying on the ground, blood everywhere,\" he said.\nAll four had been shot. Matthews said he recognized three of the people as his neighbors. He did not know the other man.\n\"His pulse was weak and he pretty much just died right there,\" Matthews said. \"Heart stopped.\"\nThe neighborhood is home to many Fort Campbell soldiers and their families. People raced over to help.\nMatthews said his own military training kicked in.\n\"Ran in their house, grabbed one of the their blankets and cut it up thinner,\" he said. \"Slow the bleeding.\"\nPolice declined to give details of what led to the shooting.\nStill shaken by what he saw, Matthews said he is still proud to be part of the Fort Campbell community.\n\"It's good there were military folks, military members, because this is what we do,\" he said. \"We help out to protect.\"\nAnyone with information about this case is asked to call Clarksville police.\nCopyright 2015 WSMV (Meredith Corporation). All rights reserved."}