{"uri": "http://homicides.suntimes.com/2017/01/13/david-gonzalez-killed-four-men-wounded-in-what-alderman-calls-ambush-with-assault-weapon-in-brighton-park/", "title": "David Gonzalez killed, four men wounded in what alderman calls ‘ambush’ with assault weapon in Brighton Park", "dct": "Fri, 13 Jan 2017 10:50:00 GMT", "id": "a5ce87aca9181e5245f1fa9e49bdf161", "content": "By SAM CHARLES and MITCHELL ARMENTROUT\nChicago Sun-Times Wire\nDavid Gonzalez was killed and four other men were wounded in a shooting in the Brighton Park neighborhood Wednesday evening that the local alderman called an “ambush” carried out with an assault rifle.\nIt was the second area shooting in recent weeks to be carried out with an assault rifle.\nAbout 6 p.m., a group of gang members drove to the 4200 block of South Talman and “ambushed” another group of men before opening fire, according to Ald. Raymond Lopez (15th).\nAn assault-style weapon was likely used and almost 30 shell casings were found at the crime scene, he said.\nThe five who were struck tried to drive away, but only made it to the parking lot of a vacant business at the southwest corner of Archer and Western, according to Lopez and Chicago Police.\nGonzalez, 18, was pronounced dead at the scene, according to the Cook County medical examiner’s office. He lived less than two blocks from where he was shot in the 4200 block of South Fairfield.\nTwo men were taken in critical condition to Stroger Hospital: an 18-year-old shot in the back and a 22-year-old shot in the face, according to police and fire officials. Two more men were taken in good condition to Mount Sinai Hospital, including a 25-year-old shot in the arm and a 21-year-old shot in the finger.\nLopez addressed the media in the pouring rain with community activist Andrew Holmes, a regular presence at crime scenes across the city.\n“This is unacceptable,” Lopez said. “We have to get these guns off the street. We have to stop this senseless killing in our neighborhoods. We have got to come together to put an end to the retaliatory culture of conflicts on our streets.”\nLopez said there has been an increase in assault-style guns recovered in his ward. Recently, he said, a “machine pistol” was recovered by police.\nThe alderman chalked up the shootings to gang members looking to inflict as much damage as they can.\n“These are gang members who are on a mission to kill as many of their opposition as possible,” Lopez said. “There’s no rhyme or reason. They’re almost killing for sport, just so they can say that they killed that gang member or that gang member, for the bragging rights of saying they’ve killed people.”\nLopez said the targets of Wednesday’s shooting were likely in the same gang as the targets in another nearby shooting last month that left two dead and two wounded about a block away at 43rd and Rockwell.\n“Someone inside of their home, I can guarantee you, knows where these weapons [are] at, what garage they’re hiding them in, what abandoned car they’re hiding them in,” Holmes said. “Before it hits some baby or some child, that person needs to give this information up or they’re going to have blood on their hands.”"}