{"uri": "http://abc30.com/news/men-arrested-for-gunning-down-3-teens-in-merced-county/196944/", "title": "Men arrested for gunning down 3 teens in Merced County", "dct": "Thu, 17 Jul 2014 00:00:00 GMT", "id": "1af62b1557db5e590b930547e22e8ae4", "content": "MERCED COUNTY, Calif. (KFSN) --\nAfter a long year of legwork, detectives at the Merced County Sheriff's Office have arrested three men they say went on a shooting rampage at a party last year, gunning down three teenagers.\nThis investigation was very time consuming, since more than 100 people were at the party this night. Tracking down all the witnesses was a challenge, so was getting them to talk. But, recently the case all came together.\nSamantha Parreira would've turned 18 on Monday. Her mom said she would have also graduated from high school this year. But, a party last year, stripped Parriera, and two other teenage boys of their lives.\nSamantha's mother Desiree said, \"I'm a mother. My daughter was 16 years old. I'm never going to see her again because of these people. I've learned to forgive, but I'm never going to forget it.\"\nWednesday investigators tracked down 19-year-old Jose Luis Botello and 18-year-old Jose Carballido. Both are being charged with murder. On Thursday, Jacob Tellez was also arrested in San Jose.\nDetectives say last March the small gathering turned into a large house party on the outskirts of Atwater. He doesn't believe the victim's even knew their attackers, who investigators say are also gang members.\nChuck Hale with the Merced County Sheriff's Office said, \"We believe it started as a small party attended by high school aged students and quickly through social media and text messages being forwarded from one phone too another from teenagers and young adults. The party quickly grew out of control.\"\nNews of the arrests brought overwhelming emotions to Sammi's mom.\n\"I didn't know whether to be mad, happy, sad, I just didn't know how to feel,\" said Desiree. \"It's just, everything is hitting me all at once.\"\nDetectives say as time went on, those who attended the party were more talkative about what they witnessed, the night Sammi, along with 19-year-old Matthew Fisher and 18-year-old Bernabed Canela all died. Two others were also injured by gunfire.\nHale added, \"The case got to a point where people were willing to come forward and assist us and cooperate with the investigation and provide us with details. Detailed accounts of what they saw and who they saw.\"\nInvestigators were still interviewing the third suspect Thursday afternoon, so we are still waiting on his booking photo. In addition, all three will also be facing gang enhancements."}