{"uri": "http://www.mercedsunstar.com/news/local/crime/article23150256.html", "title": "2 gang suspects to stand trial for 2013 slayings of 2 teens in Merced County", "dct": "Thu, 04 Jun 2015 18:08:00 GMT", "id": "3ec8fa76e9763ad8721524951dd8d303", "content": "Two suspected gang members on Thursday were ordered to stand trial for killing two teenagers at a large house party outside Atwater.\nJose L. Botello, 19, and Jose M. Carballido, 20, have pleaded not guilty to murder in connection with the deaths of Samantha Parreira, 16, and Matthew Fisher, 19.\nBoth victims were shot to death March 30, 2013, in the backyard of a party in the 9200 block of Westside Boulevard, outside Atwater.\nJudge Ronald W. Hansen on Thursday held both Botello and Carballido to answer for homicides following a preliminary hearing in Merced Superior Court.\nParreira’s mother, Desiree, said she was pleased with the judge’s ruling to keep both men in custody.\n“I think all the information brought out this afternoon will help put these guys away and will help find peace of both Matthew’s family and for my Sami,” Desiree Parreira said.\nDiane Reis, Fisher’s mother, echoed Parreira’s statements.\n“I’m glad they’re being held responsible for taking my son’s young life,” Reis said outside the courtroom. “Maybe we finally see some kind of closure.”\nInvestigators from the Merced County Sheriff’s Department testified during Thursday’s preliminary hearing, along with witnesses with information regarding the case.\nDeputies testified that Botello and Carballido were both members of an Atwater street gang. Investigators said both men attended the party and said multiple people from other rival gangs were also at the party. Deputies believe Botello rushed toward Fisher in the backyard and opened fire, striking Fisher and Parreira, who was seated close to Fisher at the time of the shooting.\nDeputies testified that Carballido was next to Botello during the shooting. They described Carballido as possibly serving as a lookout for Botello during the violence.\nRobert Wynne, Carballido’s attorney, said his client did not know Botello was armed and was not aware of any plans to confront gang members at the party.\n“My client was just standing there,” Wynne said.\nBotello’s attorney, Ty Kharazi, said Botello’s arrest remains a case of mistaken identity.\n“There are two witnesses who are in Southern California that say our clients didn’t do it,” Kharazi said. “We’re conducting further investigation, but they didn’t do the shooting.”\nOne other man was killed during the same party, but deputies have said his death was unrelated to the slayings of Fisher and Parreira.\nBernabed Hernandez-Canela, 18, was shot and killed in front of the house, apparently while multiple guns were being fired and dozens of people were fleeing the scene, authorities have said.\nHernandez-Canela’s death received additional scrutiny last year when Ethan B. Morse, son of Merced County District Attorney Larry Morse II, was charged with murder in connection with the homicide. Morse was accused of driving a getaway vehicle while his co-defendant, Jacob Tellez, was charged with shooting Hernandez-Canela.\nMorse and Tellez, however, were found innocent in November after a preliminary hearing before Hansen, the same judge who handed down Thursday’s ruling.\nBotello and Carballido remain in custody at the Merced County jail without bail. They are scheduled to return to court June 19.\nRob Parsons: (209) 385-2482"}