{"uri": "http://www.modbee.com/news/local/crime/article3150494.html", "title": "Three people dead in Atwater gang shooting", "dct": "Sun, 31 Mar 2013 16:56:00 GMT", "id": "5fc2fa98137de75e6956bdcff6264fc0", "content": "Three people are dead following a gang shooting Saturday night in the 9200 block of Westside Boulevard in the Atwater area, the Merced County Sheriff's Department reported.\nThe victims are described as two males, 18 and 19 years old, and a female in her mid-teens, according to Sheriff Mark Pazin.\nThe female victim died on Sunday after being taken to a Modesto hospital for surgery.\nTwo other males were wounded during the incident, a 16 and 21-year-old, and were transported to the hospital with non-life threatening injuries.\nThe shooting happened around 11 p.m. Saturday, after a group of people approached a rival gang at a party near the residence.\nPazin said the group was having some sort of Easter gathering, and the rivals were able to sneak up on them.\nMultiple shots rang out after the confrontation, he said, followed by a series of 911 calls.\nMerced and Atwater police arrived on the scene, as well are the fire department. Pazin said many of those injured had already been transported to hospitals when Sheriff's deputies arrived.\nAuthorities said the motive behind Saturday’s shooting was gang-related.\n\"Was it gangs involved? Yes, it was,\" Pazin said during a news conference Sunday. \"We're not going to sugar coat it. The absolute immaturity and insensitivity over a couple of gang colors is just breathtaking.\"\nPazin said the Sheriff's Department won’t release the victims' names out of respect for the families on Easter Sunday, however, they have been notified.\n\"We want to give them some time to catch up and grope for answers in this nonsensical system that we call gang violence,\" he said.\nMany of the witnesses have been uncooperative, but the major crime unit is working on piecing together what happened during the incident.\nThere are no suspects in custody at this time, Pazin said.\nThe three deaths mark the 8th homicide for Merced County this year."}