{"uri": "http://www.sacbee.com/news/article2604101.html", "title": "Three suspected gang members arrested for 2013 triple homicide", "dct": "Thu, 17 Jul 2014 11:45:00 GMT", "id": "824976acb4dff512bd6974e2aa560aeb", "content": "Three Merced County youths have been arrested in connection with a suspected gang-related shooting last year at a house party near Atwater that left three teenagers dead, the Merced County Sheriff’s Department confirmed.\nGunfire erupted March 30, 2013, during an Easter holiday party in the area of the 9200 block of Westside Boulevard. Three people – Samantha Parreira, 16; Bernabed Hernandez-Canela, 18; and Matthew Fisher, 19 – were fatally shot and two other young people were injured. “Three young people were killed that night, and hopefully this will bring a little bit of closure, but we will never forget, ever forget,” said Desiree Parreira, Samantha’s mother.\nFamilies of the other victims could not be reached Thursday for comment.\nJose L. Botello and Jose M. Carballido, both 19-year-old Atwater residents, and Jacob Tellez, 18, of Merced, were arrested by detectives with the sheriff’s Major Crimes Unit this week on suspicion of murder and gang participation, Detective-Sgt. Chuck Hale said at a Thursday news conference.\nAll three suspects remained behind bars Thursday without bail.\nTellez was arrested early Thursday in San Jose. He was still going through the booking process Thursday afternoon and a mugshot was not immediately available. Botello and Carballido were arrested late Wednesday in Atwater. Both Atwater residents belong to the same criminal street gang, and Tellez is a member of another gang, Hale said.\nDetectives have not ruled out the possibility of making additional arrests. Deputies said the party started as a holiday gathering for high school students that escalated when word of the gathering spread through social media and text messages, attracting more than 100 people, including members of several Merced County street gangs.\nHale declined to comment on the specific incidents at the party that sparked the gun violence, saying releasing certain details, including the number of shooters or whether any murder weapons have been recovered, could harm the investigation. Cooperation from the public and witnesses was a critical factor in making the arrests, Hale said, although he stressed the need for additional help. “There are other people out there that have more information about this party and we invite them to come forward,” Hale said.\nDesiree Parreira pleaded for anyone with knowledge of the incident to reach out to sheriff’s investigators. “Don’t be scared,” she said Thursday. “If we keep running around being scared, these gangs are just going to take over and they’re going to take everybody away from us.”\nShe described her daughter as a “charismatic, go-getting” young lady who was close to her siblings. The family on Monday celebrated what would have been Samantha’s 18th birthday. She would have graduated from high school earlier this year. “We don’t get to share those things with her anymore. I don’t get to have that anymore and it’s not fair,” she said.“When she was taken from me, it just hardened my heart to know there’s people out there who’d take her away from us.”\nParreira’s aunt, Charlotte Alves, said she was “overjoyed” with news of the arrests. “My Sammie was such a good girl. Her smile could light up any room,” Alves said. “She had so much life, so many dreams that will never be accomplished now. This means so much.”\nSheriff Tom Cavallero praised the work of the detectives and deputies “who collaborated so well in this effort and were absolutely driven to bring about a resolution.”\nDesiree Parreira said the arrests sparked a range of emotions and hadn’t really “sunk in” yet. She said all the families want justice for their loved ones. “My daughter was 16 years old, and I’m never going to see her again because of these people,” she said. “I’ve learned to forgive, but I’ll never forget.”"}