{"uri": "http://www.denverpost.com/2016/06/04/aurora-family-mourning-the-death-of-10-year-old-boy-while-police-continue-to-investigate/", "title": "Aurora family mourns shooting death of 10-year-old boy while police investigate", "dct": "Sat, 04 Jun 2016 10:33:00 GMT", "id": "1e2bcb8be5c057afc037dca116898b6c", "content": "AURORA — The family of a 10-year-old boy — described by relatives as sweet and smart — was in disbelief Saturday as they mourned his death.\nAurora police were called Friday at about 9:45 p.m. to the Nordic Arms apartments at 1575 Galena St., after a report of shots being fired and found the boy with a gunshot wound. He was pronounced dead at the scene.\nPolice are still investigating, but family members said they believe the boy died from an accidental, self-inflicted gunshot wound. They believe he found the gun, wrapped in cloth and sitting on top of a shelf.\nThe family was in the process of moving into the Aurora apartment on Friday.\nFamily identified the boy as Anthony Jaliel Lujan Hemmings — a straight-A student who gave “bear hugs.”\n“He was 10, but he was big,” said aunt Stephanie Aragon. “He would just come up to you and give you a hug. He was so sweet.”\nAnthony had three brothers and two sisters. He also called some of his cousins his siblings, including cousin Jassir Aragon, 11.\n“He was the nicest kid you could ever meet,” Jassir said. “When his mom was upset, he gave her a hug and would tell her everything was going to be OK.”\nFamily members were placing balloons and flowers outside the apartment on Saturday to remember Anthony as they shared memories of the boy.\n“He wasn’t your average 10-year-old boy, he was very tall and very outgoing and friendly,” said Tawana Lester, another aunt. “You don’t imagine this kind of thing happening. But God doesn’t make mistakes.”\nAnthony liked to play sports and dreamed about making it to the NFL one day, Jassir said.\nFor now, he had just finished the fourth grade, and family was looking forward to his fifth grade continuation next year.\n“I can’t believe he’s gone,” Aragon said.\nA short vigil is planned for 6 p.m. Monday at the Martin Luther King Library, 9898 E. Colfax Ave., “to reflect on his life and what we can do as a community to help prevent such tragedies going forward within our community,” according to a notice sent out by Eric Nelson, a candidate for Colorado House District 42. A march from the library to the apartments where Anthony died will follow the vigil.\nPolice are asking anyone with information about the incident to call Detective Sgt. Bob Wesner at 303-739-6093.\nSponsored Links\n.\nForge Of Empires - Free Online GameThe most addictive game of the year! Play with 14 million Players now!Forge Of Empires - Free Online Game\nGreeningzMonica Lewinsky's Net Worth Left Us Jaw DroppedGreeningz\nMoney MorningCapital Gains Tax Loophole?Money Morning\nDealStealsTop rated mattress deals. Bye bye back pain!DealSteals\nelitesingles.comFinding Meaningful Dating and Lasting Love in Fremontelitesingles.com\nScribolHikers Found This Horse Alone In The Woods. Then They Looked At His Face and Realized…Scribol\nSponsored\nPenny Pot Stocks Set to Explode by February 1st\nLearn More Sponsored by Agora Financial"}