{"uri": "http://www.denverpost.com/2016/06/07/older-brother-of-10-year-old-aurora-boy-who-was-fatally-shot-arrested-in-case/", "title": "Older brother of 10-year-old Aurora boy who was fatally shot arrested in case", "dct": "Tue, 07 Jun 2016 19:03:00 GMT", "id": "9cc33b3c6c62dd89b16249a9d8ac9e03", "content": "The older brother of a 10-year-old who fatally shot himself in Aurora last weekend has been arrested in the case.\nThe brother, 17, was arrested on suspicion of negligent child abuse resulting in death, a felony, according to an Aurora Police Department media release.\nHe is being held on a $10,000 bond at the LINK Juvenile Assessment Center in Adams County, police said.\nAurora police were called about 9:45 p.m. Friday to the Nordic Arms apartments at 1575 Galena St., after a report of shots being fired and found the boy, Anthony Jaliel Lujan Hemmings, with a gunshot wound. He was pronounced dead at the scene.\nPolice are still investigating, but family members said they believe the boy died from an accidental, self-inflicted gunshot wound. They believe he found the gun, wrapped in cloth and sitting on top of a shelf.\nAnyone with information about this case is asked to call Detective Bob Wesner with the crimes against children unit at 303-739-6093.\nEditor’s note: This story has been updated to reflect that the arrested brother has been charged as a juvenile.\nSponsored Links\n.\nHome Solar QuotesHomeowners Are Furious With Their Power Company!Home Solar Quotes\nPrimal Plants Supplement - Gundry MDThis Simple Skin Fix May Surprise YouPrimal Plants Supplement - Gundry MD\nTophatterThe Most Addicting Shopping Site For WomenTophatter\nSoldiers: Free Online GameThis game will eat days of your lifeSoldiers: Free Online Game\nTruthFinder People Search SubscriptionType in Any Name, Wait 15 Seconds, Brace For ResultsTruthFinder People Search Subscription\nElvenar - Free Online GameWomen: Have You Tried this Addictive Game Yet ?Elvenar - Free Online Game\nSponsored\nRumors Have Been Confirmed, Jolie Comes Clean\nThe Rumors Have Been Confirmed, Jolie Comes Clean - Will Family And Friends Forgive Her? Learn More Sponsored by Chatter Box Daily\nSponsored\nHow To: Stop Tinnitus\nLearn More Sponsored by Tinnitus Terminator"}