{"uri": "http://www.mercurynews.com/breaking-news/ci_23684177/oakland-girl-8-killed-when-gunman-opens-fire", "title": "Oakland: Eight-year-old girl killed, three…", "dct": "Fri, 12 Aug 2016 15:16:00 GMT", "id": "b8249c849144bf7d0d20485c422ed50a", "content": "OAKLAND — An 8-year-old girl at a sleepover was killed and two other children and their grandmother were wounded late Wednesday when a Dimond District apartment was sprayed with gunfire, police said.\nAlaysha Carradine, who went by the nickname “Ladybug” and would have been a third-grade student at Fruitvale Elementary School, was gunned down after someone fired a barrage of bullets into the apartment’s front security screen door about 11:18 p.m. Wednesday.\nThe wounded — a 4-year-old boy, his 7-year-old sister, and their 64-year-old grandmother — were all in stable condition and were expected to recover from their wounds. No arrests have been announced and police don’t have a motive for the attack.\nThe shooting happened in the 3400 block of Wilson Avenue, which runs between Montana Street and MacArthur Boulevard in the lower Dimond District neighborhood, just north of Interstate 580. At least a half-dozen bullet holes could be seen Thursday in the front door and the living-room carpet was stained with blood.\nKhamel Hardin, 22, who lives in the apartment, identified the other three victims as his mother, Clara Field, niece Amara York, 7, and nephew Antoine York, 4. His sister, 28-year-old Brea Colbert, is the mother of Amara and Antoine and also lives there, he said. She was not home at the time of the shooting, police said.\nHardin said he was in the living room with the children when he heard gunshots and saw a shot pierce the door and “whiz” through the air.\n“It was like a bomb, explosion,” said Hardin. “I was dodging shots. I tried to get them out of the way.”\nPolice said Alaysha lives in Oakland and was at the apartment for a sleepover with her friend, Amara.\nHardin said the girl frequently visited the home because the girls attended school together. He said he had no clue why anyone would target the home.\nAn Oakland Unified School District spokesman confirmed Alaysha was a student at Fruitvale Elementary School, where staff were visibly shaken Thursday morning and one worker broke down when asked about Alaysha.\nAlaysha’s stepfather, Jesse Fowler, said he cannot believe she is gone.\n“It’s a shocker to me,” Fowler told television station ABC7. “It hit me earlier at the hospital. I’m still in denial that she is really gone.\n“I’m used to her talking my ear off and she is not going to be there anymore. She has a younger brother who I have to raise without her now, so this is going to be difficult.”\nFowler had to tell Alaysha’s mother what happened, because she was out of town on vacation. She is now on her way back to Oakland, he said.\nFowler said that the night before her death, Alaysha asked him to walk with her to her best friend’s door. Fowler asked her if she was too big for that and she said no, so he walked her to the door.\nThat was the last conversation he had with his stepdaughter, he said.\nIn a photograph released by the family on Thursday, Alaysha is shown in a bright green sweatshirt decorated with a multicolored butterfly and the words “Peace, Love and Hope.”\nOutside the family’s front door on Thursday, neighbors created a makeshift memorial comprised of flowers and cards.\nDeangelo Anderson, 24, arrived at Wilson Avenue with other members of East Oakland’s Victory Baptist Church on Thursday to pray for victims and their families.\n“It has to stop,” Anderson said of the violence. “The kids can’t even play out front anymore. They have to be locked up and that’s not fair. They’re just children.\n“We can’t depend on anyone else to change our city. It’s got to start with the youth. It’s got to start with us.”\nJohn Hughes, who lives in the same neighborhood, already knows the pain Alaysha’s family is experiencing. Three years ago, his own son was shot and killed.\n“I know what she’s going through,” Hughes said. “It’s about old grown folks older than these kids killing these little kids. They’re killing off our future and we need to do something about it.”\nPolice were asking for the public’s help in the case. “We really need the community to help in tracking down the suspect in this heinous and shocking crime,” said Investigating Officer Rob Rosin.\nAlaysha, the youngest person to be killed in the city so far this year, was one of seven children fatally shot in Oakland. The other six were all age 17. Her death marked Oakland’s 54th homicide of the year.\nPolice and CrimeStoppers of Oakland are offering up to $25,000 in reward money for information leading to the arrest of suspects. Anyone with information may contact Oakland police at 510-238-3821 or the anonymous tip line at 510-773-2508.\nCheck back for updates."}