{"uri": "http://fox43.com/2016/11/11/lancaster-man-faces-charges-for-accidentally-shooting-himself/", "title": "Lancaster man faces charges for accidentally shooting himself", "dct": "Fri, 11 Nov 2016 13:59:00 GMT", "id": "774ff2ef5c4b404084bd8b748eafd82a", "content": "A Lancaster man, after being discharged from Lancaster General Hospital, was taken into custody on a criminal warrant.\nDamien Scott Finch, 21, of the 600 block of E. Madison St., was charged with Persons Not to Possess Firearms, and Firearms not to be Carried Without a License. He was processed and arraigned on the warrant.\nFinch was committed to Lancaster County Prison in lieu of $100,000 bail, according to Lancaster police.\nOn Thursday, Nov. 4, Lancaster City Bureau of Police was dispatched to the hospital for a report of a shooting victim who walked into the emergency room with a gunshot wound. Officers immediately responded to the hospital to obtain more information.\nWhile officers were responding, they were advised by dispatchers that the shooting may have occurred in the area of McCaskey High School. The Lancaster City Bureau of Police School Resource Officers at McCaskey were immediately notified and reported that everything was okay at the school. Additional officers responded to the 600 bock of N. Franklin Street and began checking the area for a crime scene.\nLancaster police explained that detectives responded to the hospital and assisted with the investigation. Police learned that Finch sustained a single gunshot wound to the lower leg. His injuries were determined to be non-life threatening.\nDetectives contacted the Lancaster Community Safety Coalition and began reviewing video footage from around the area. Through the investigation, the detectives learned that at approximately 7:35 am, the victim was in a parking lot on the southeast corner of N. Franklin Street and New Holland Ave., off of the 600 block of N. Franklin Street.\nThe detectives also learned that the victim had a handgun concealed on his person and the firearm accidentally discharged, striking his lower leg. The victim went home and then went to Lancaster General Hospital to seek medical treatment. The victim is cooperating with the investigation, and a firearm that was reportedly involved has been recovered by the police.\nDet. Morant had charged Finch before Magisterial District Judge Janice Jimenez. All persons accused of a crime are presumed innocent unless proven guilty in court."}