{"uri": "http://www.press-citizen.com/story/news/crime-and-courts/2017/01/16/north-liberty-police-investigating-shooting-mobile-home-court/96646452/", "title": "North Liberty police investigating shooting in mobile home court", "dct": "Mon, 16 Jan 2017 00:00:00 GMT", "id": "545173bfd83505f228896d5bf982826d", "content": "Two residents of Golfview Mobile Home Court said they found a friend suffering from a gunshot wound in the street outside their home Monday afternoon.\nNorth Liberty police responded to a report of a shooting along Golfview Drive around 3:15 p.m., according to a North Liberty news release. They found 19-year-old man who had been shot in the leg. He told police he did not know the person who shot him. A witness described the shooter as a man wearing a dark-colored hoodie who fled northeast on foot through the trailer court.\nPolice have not located the suspect and are unsure of the victim's status, the release said.\nDaylan Kozak, 20, said he heard \"a loud bang\" that he recognized as a gunshot after declining an offer to visit with two male friends who knocked on his door between 3 p.m. and 4 p.m. Kozak said he went to his window after he heard the noise, roughly five minutes from the time he greeted his friends, and saw one of them \"laying in the street, bleeding.\"\n\"I ended up finding a shirt that we were able to tie around his leg for a little bit in order to stop some of the bleeding,\" he said.\nKozak said police and an ambulance arrived shortly thereafter and took the victim to the hospital, but he was unsure of the victim's current condition.\nZach Bogs, 22, said he lives with Kozak and was asleep when the incident occurred. He said Kozak woke him up after helping the victim, a former classmate, and he saw emergency responders addressing the wound, noting the victim was conscious at the time.\nPolice are investigating the incident and said no other details are currently available.\nThey urge anyone with information about the shooting to contact CrimeStoppers at 358-TIPS (8477). CrimeStoppers holds all calls in strict confidence and guarantees anonymity. Individuals who provide information do not have to reveal their identity to collect a reward, the release said.\nThe Johnson County Sheriff’s Office, Coralville police, Iowa State Patrol, Johnson County ambulance and North Liberty Fire Department assisted the North Liberty Police Department.\nReach Holly Hines at hhines2@press- citizen.com or at 319-887-5414 and follow her on Twitter at @HollyJHines."}