{"uri": "http://www.mailtribune.com/news/20160501/police-apprehend-suspect-in-saturday-shooting?rssfeed=true", "title": "Police apprehend suspect in Saturday shooting", "dct": "NODATE", "id": "b8334763e0cd01b15ab09168088a597c", "content": "Medford police on Sunday said they've apprehended a suspect in Saturday's shooting that left one man dead in west Medford.\nPolice also identified the victim as 34-year-old Luke Adrian-Heiner Barmes.\nAccording to a news release, the suspect, whose name has not been released pending the outcome of the investigation, was located early Sunday morning at the Ashland Hills Hotel & Suites and fled from the hotel room only to surrender to police after confronting police canine Barry.\nThe suspect was lodged in jail on an unrelated, outstanding warrant and, as of Sunday afternoon, had not been \"charged with a crime related to the actual shooting, as that piece is still under investigation,\" the release said.\n\"While we are confident we know who the shooter is, we are obligated to determine what the circumstances of the shooting were, whether it was reckless, whether it was intentional or whether it was accidental,\" Medford police Lt. Mike Budreau said. \"Those are all things we are still trying to determine.\"\nThe shooting was reported at 4:56 p.m. Saturday at 208 Iowa St., Medford. Upon arrival, police found Barmes dead of an apparent gunshot wound in the backyard of his residence.\nBased on reports from witnesses, there was no apparent hostile confrontation preceding the shooting, Budreau said.\nThe investigation revealed that the shooter and a second person had arrived shortly before the shooting. And, while the second person returned to his vehicle parked on the street, Barmes and the shooter walked to the backyard, where a single shot was fired, fatally wounding Barmes.\n\"There were a lot of people around and people inside the residence,\" Budreau said. \"We're still trying to piece together why the victim was shot and under what circumstances.\"\nThe shooter and second person fled the scene in a vehicle, which witnesses described as a white Honda coupe. Detectives later recovered the gun involved nearby on Clark Street.\nAt 10 p.m., Oregon State Police troopers spotted a vehicle matching the description provided by witnesses heading south on I-5 at milepost 30. Troopers conducted a traffic stop at milepost 24 and detained a male and female. The male was determined to be the person who was in the car during the shooting.\n\"He was interviewed and released because we didn't believe he knew the shooting was going to happen,\" Budreau said. The female also was released.\nEarly Sunday morning, the suspect was tracked to the Ashland Hills Hotel & Suites. He was not bitten by Barry nor was additional forced used during the arrest, the release said.\n-Reach education reporter Teresa Thomas at 541-776-4497 or tthomas@mailtribune.com. Follow her at www.twitter.com/teresathomas_mt."}