{"uri": "http://www.mailtribune.com/news/20160702/medford-man-charged-in-shooting-death-sent-to-state-hospital?rssfeed=true", "title": "Medford man charged in shooting death sent to state hospital", "dct": "NODATE", "id": "f6ceacd395ba93aea67bb79f93623d07", "content": "A man facing manslaughter charges in the shooting death of a west Medford man is undergoing psychological evaluation in Salem.\nVincent Santana DiCostanzo, 22, of Medford, was ordered transported to the Oregon State Hospital in Salem in June, documents filed in Jackson County Circuit Court show. The documents cited DiCostanzo's \"unfitness to proceed\" on grounds that he's unable to participate in his defense because of mental illness.\nA court hearing set for June 27 was rescheduled for Aug. 29 because of more time needed to complete the evaluation, a document filed in the case shows.\nDiCostanzo is facing felony manslaughter and weapons charges for the alleged backyard shooting of 34-year-old Luke Heiner Barmes April 30 at Barmes' residence at 208 Iowa St.\nA message to Christine Kantas Herbert, DiCostanzo's lawyer, wasn't returned Friday, but the order authorizing DiCostanzo's transport for psychiatric evaluation is based on a section of Oregon Revised Statute 161.360 ruling a defendant can be found incapacitated because of mental disease if he can't understand the nature of the proceedings against him, if he can't cooperate with his defense counsel or if he can't cooperate in his defense.\nThe court order filed June 5 was based on a psychiatrist's report that found DiCostanzo is a harm to himself or others and the resources he needs aren't available in the community.\nMedford police have described the death as accidental. Barmes allegedly showed DiCostanzo his loaded handgun during a short visit to exchange property when the firearm discharged a bullet into Barmes' chest, killing him.\nAccording to a search warrant report from the homicide investigation, police recovered from the scene a glass pipe and socks in Barmes' pockets, three cellphones and a flash drive from Barmes' bedroom, a phone in another resident's bedroom, a computer tower from the living room and a tablet from the back patio.\nDiCostanzo had fled after the shooting and was found at the Ashland Hills Hotel the next morning, where he initially tried to flee on foot until surrendering after encountering a police canine, archives show.\nCourt records show that DiCostanzo pleaded guilty earlier this year to a felony charge of heroin possession and driving under the influence of intoxicants stemming from a July 2015 incident.\nDiCostanzo previously had faced felony counts of second-degree robbery in July 2014 that alleged he tried to take or use a vehicle belonging to Brandon Paul Palmer by threat of physical force. Prosecutors dismissed the case in January 2015 because of insufficient evidence, court documents show.\nReach reporter Nick Morgan at 541-776-4471 or nmorgan@mailtribune.com. Follow him on Twitter at @MTCrimeBeat."}