{"uri": "http://brooklynda.org/2015/03/18/brooklyn-man-sentenced-to-47-years-to-life-in-prison-for-quadruple-shooting-in-gang-dispute-at-basketball-tournament/", "title": "Brooklyn Man Sentenced to 47 Years to Life in Prison For Quadruple Shooting in Gang Dispute at Basketball Tournament", "dct": "Wed, 18 Mar 2015 00:00:00 GMT", "id": "3fac9489916325ceb618f44fe29b2263", "content": "FOR IMMEDIATE RELEASE\nDefendant Shot Four Teens at Marcy Houses, Killing One and Injuring Three\nBrooklyn District Attorney Ken Thompson today announced that a 21-year-old man has been sentenced to 47 years to life in prison for the gang-related shooting death of an 18-year-old boy and for shooting and injuring a 15-year-old and two 13-year-olds during a basketball tournament at the Marcy Houses in Bedford-Stuyvesant.\nDistrict Attorney Thompson said, “Today’s sentence should serve as a warning that shooting and killing people on the streets of Brooklyn will not be tolerated. An 18-year-old boy is dead and three other teens were shot all because this defendant decided to commit senseless and terrible acts of violence. Now he will pay for what he did by being locked up for most of his life.”\nThe District Attorney identified the defendant as Brandon Reese, 21, of Brooklyn. He was today sentenced by Brooklyn Supreme Court Justice Sheryl Parker to 47 years to life in prison following his conviction earlier this month on one count of second-degree murder, one count of second-degree attempted murder, one count of first-degree assault, one count of first-degree attempted assault, one count of second-degree assault, one count of second-degree attempted assault, one count of first-degree reckless endangerment, and two counts of second-degree criminal possession of a weapon following a jury trial.\nThe District Attorney said that, according to trial testimony, on July 6, 2013, at approximately 6:30 p.m., at the Marcy Houses, located at 472 Marcy Avenue, in Bedford-Stuyvesant, during a basketball tournament two rival crews engaged in a dispute which ultimately resulted in a shooting.\nThe District Attorney said that, according to trial testimony, a number of gang members from Bushwick Houses, who belong to a crew named Young Stackers (YS), were hanging out in front of Marcy Houses. A member of Stack Money Goonz (SMG) walked by and realized that one of the YS’s had previously pulled a gun on him. He then called his older brother, the defendant, Brandon Reese, for back-up.\nThe District Attorney further said that, according to trial testimony, after an argument ensued between his brother and the YS kids, the defendant pulled his gun from his waistband and fired approximately nine shots. Mario Lopez was shot approximately eight times and pronounced dead later that evening. Three others were injured: A 13-year-old shot in the neck with the bullet exiting his nose was left with permanent partial paralysis of his face; a second 13-year-old was shot in the knee; a 15-year-old was grazed on the hip and suffered minor injuries.\nThe case was investigated by now retired New York City Police Detective James Tischler and other detectives assigned to the NYPD’s 79th precinct.\nThe case was prosecuted by Assistant District Attorney Nicole Chavis, Chief of the District Attorney’s Violent Criminal Enterprises Bureau, with the assistance of Assistant District Attorney Iris Das, under the supervision of Executive Assistant District Attorney William E. Schaeffer, Chief of Investigations.\n#"}