{"uri": "http://6abc.com/news/girl-6-critically-injured-in-west-oak-lane-shooting-/1463538/", "title": "Surveillance video captures shooting that injured 6-year-old girl", "dct": "Wed, 10 Aug 2016 00:00:00 GMT", "id": "584d3574530e7f135139af1bf617a8cd", "content": "WEST OAK LANE (WPVI) --\nA 6-year-old girl who was caught in crossfire in Philadelphia is improving. And police now have surveillance video of the crime that they hope will help them find the shooter.\n\"When someone gets hit with a stray bullet and you're innocent, that is of particular concern, but it's just a child. This is a 6-year-old girl,\" said Philadelphia Police Chief Inspector Scott Small.\nIt happened around 7 p.m. Tuesday on the 2000 block of West Chelten Avenue in the city's West Oak Lane section.\nThe shooting is still under investigation, but detectives are looking to if the bullet that hit 6-year-old Anila Garrick is the same one that went through the windshield and the rear window of a nearby minivan and hit her as she was playing out front of her home.\nSurveillance video obtained by Action News shows the neighborhood in chaos after a stray bullet hit Anila. A family member is seen distraught, then Philadelphia police officers rush the girl into their cruiser, taking her to Albert Einstein Medical Center.\nDoctors at Einstein managed to stabilize the girl. Anila was then brought to St. Christopher's Hospital for Children where she remains at this hour.\nSurveillance video from a camera directed towards the intersection of Chelten Avenue and Woodstock shows two individuals, and at least one opens fire.\nPolice believe at least twenty bullets were fired.\nChief Inspector Small explains, \"There was at least two separate weapons used based on the ballistic evidence. We found two separate caliber fired cartridge casings, which means it could be one individual with two guns, or it could be two or more individuals.\"\nDetectives say a bullet hit the little girl in the shoulder then lodged in her torso. Investigators don't know why the shooter or shooters aimed at the 6300 block of North Woodstock, which is full of children. Just last Saturday neighbors held a block party.\nPolice say the girl is rapidly improving and is now listed in guarded condition.\nPolice are looking for any information from the public. Remember, you can always remain anonymous."}