{"uri": "http://www.al.com/alabamafootball/index.ssf/2016/12/how_an_alabama_football_player.html#incart_most-comments", "title": "How an Alabama football player accidentally blew finger off with 12-gauge shotgun", "dct": "Sat, 31 Dec 2016 01:54:24 GMT", "id": "2848dead0113fe034a8ff2abdb8de6ae", "content": "Dakota Ball stood out as Alabama players filtered into the Georgia Dome for Thursday's Peach Bowl Media Day.\nThe defensive lineman wore a smile, his recognizable beard and nine fingers.\nThis senior won't be playing Saturday afternoon against Washington because of an accident that occurred two weeks ago Thursday in Calhoun, Georgia.\nBall was enjoying some downtime with a friend in the break before bowl practices, riding four-wheelers and doing a little hunting. They were riding along when it happened.\n\"I shot my finger off with a 12-gauge shotgun,\" he said matter of factly.\nHis left hand was still heavily bandaged, but he isn't shy about showing the picture of his missing index finger. A row of staples closed the gap where his index finger once was.\n\"It's completely gone,\" he said. \"I shot it right at the knuckle and blew it off.\"\nBut how?\n\"I was tying a rope around the barrel and around the stock to keep the shotgun from falling out of my lap,\" Ball said. \"I was tying rope around the barrel and it just went off. I didn't have my hand on the trigger.\"\nThere was a brief moment of disbelief.\nAt first he thought he had shot through the middle of his hand. Then he saw the index finger \"hanging by a piece of skin.\"\nThey rushed back to his buddy's house on the four-wheeler and drove straight to the hospital. Ball can't remember how long it took.\n\"At first it wasn't painful but once we got to the hospital, that's when it started hurting -- when my adrenaline started wearing off,\" Ball said. \"Then it got pretty bad.\"\nAnd there was no hope for the finger.\n\"They had to go down and cut the bone out,\" Ball said, \"two inches down.\"\nMost people remain in the hospital for a few days, sometimes a week. Ball said he checked out the following day.\nAlabama's bowl practice started the next day and Nick Saban included the accident in his injury rundown. The coach from West Virginia had a story for Ball that he told Thursday.\n\"There was a guy -- I was in eighth or ninth grade -- and he was the best athlete in the school,\" Saban said. \"Was the quarterback, a great basketball player. He actually shot his leg off in a similar kind of hunting accident and was never able to play again.\"\nA young Saban wasn't allowed to go hunting without his dad around.\nThis could be the end of the road for Ball's football career. He's a senior who played a reserve role on Alabama's generational defensive line.\n\"Am I worried about football? No,\" Ball said. \"I'm just worried about my hand healing. If I can play in the next game, like special teams. I'll do it. But I'm not going to worry about it, really.\"\nWhat kind of recovery will this be long term? Ball isn't quite sure yet.\nA lesson was learned, though he isn't retiring from his hobby.\n\"I think I forgot to put the safety on but I didn't have a finger on the trigger,\" Ball said. \"But that doesn't matter. You have to be as careful as possible with guns. No messing around. But I would never say get rid of guns.\n\"I love guns, but I'll take a break from them for a little bit.\""}