{"uri": "http://www.dailypress.com/news/crime/dp-hampton-toddler-dead-after-gun-accident-man-arrested-for-child-neglect-20150703-story.html", "title": "Hampton boy dies after accidental shooting, stepfather charged", "dct": "Fri, 03 Jul 2015 21:28:00 GMT", "id": "a757abab29cf02dd5c3724d0c9821ab0", "content": "A 4-year-old Hampton boy was remembered Friday evening as someone who loved everyone and always had a big, bright smile on his face.\nChris L. Palmer Jr. died Thursday night after getting a hold of a loaded handgun and accidentally shooting himself, according to the Hampton Police Division.\nPolice officers responded to calls about a shooting on the 300 block of West Chamberlin Avenue shortly before 9:30 p.m. Thursday evening, according to a release from Hampton police. They found Palmer, known to his family as CJ, suffering from a single gunshot wound.\nThe boy was rushed to the hospital by medics, where he was pronounced dead upon arrival.\nA police investigation determined that Palmer was inside the house when he found a loaded gun in his parents' bedroom and accidentally shot himself, the release said.\nThe boy's stepfather, Lashawn Stephenson, 26, was arrested and charged with felony child neglect.\nBoth Stephenson and the victim's mother, Quasha Jones, were in the house at the time of the incident, according to Hampton police.\nThe couple were back home Friday afternoon, holding each other on their front lawn.\nStephenson busied himself by painstakingly spelling out “Lil CJ, we love you,” with tea candles on the front porch ahead of a candlelight vigil.\nHe smiled as he talked about CJ, describing an active, joyful and intelligent kid who was always on his bike or playing ball and was excited by everything. He sobbed when embraced by friends and family.\nJones joked he was too smart for his age and was getting ready to start Kindergarten.\nDuring the vigil, dozens of friends and family gathered. “My baby is gone,” Jones wailed at one point. She entreated the crowd put aside petty things and focus on what was important.\n“My baby loved everybody, he didn't like arguing,” she said. “You never know how long you have.”\nEvelyn Randolph, a neighbor, prayed over Stephenson and Jones before the vigil, asking God to grant them strength. She often saw the boy playing around the neighborhood and regretted not talking to him more when he was around.\n“To all parents, they need to teach children that guns aren't toys … if you get shot, sometimes you won't wake up,” she said.\nAnother neighbor, Susan Janik, heard a woman screaming for help Thursday night, and when she came out, she saw a man with blood on him carrying the boy and holding his head.\nJanik said the woman, who appeared to have just gotten out of the shower, yelled that he shot himself and that he was supposed to be asleep, Janik said at the scene Thursday night.\nShe saw the boy being placed on a stretcher and taken to a local hospital.\nHer daughters said they sometimes saw the boy playing around the neighborhood.\n“My heart was breaking for them,” Janik said.\nMurphy can be reached by phone at 757-247-4760; Castillo at 757-247-4635."}