{"uri": "http://www.news-press.com/story/news/crime/2015/10/20/lehigh-acres-2-year-old-shot/74264202/?from=global&sessionKey=&autologin=", "title": "Lehigh Acres 2-year-old accidentally shot", "dct": "Tue, 20 Oct 2015 00:00:00 GMT", "id": "ee5ad5627b6bbf499b8d629eecab712c", "content": "Yelling and screaming, a frantic search for car keys and then a car speeding away is what one Lehigh Acres resident said was the situation Monday afternoon at a home on South Alabama Road where a two-year-old was apparently accidentally shot.\nThe Lee County Sheriff's Office is investigating a shooting that occurred at approximately 5:30 p.m. Monday at 554 Alabama Road, Lehigh Acres. A two-year old child was shot and was transported to Tampa Regional Hospital.\nA spokeswoman for the hospital said the girl, Armiya Robinson, was listed in critical condition. On the family's Facebook page, her mother, Resha Robinson, said her daughter is doing fine.\n\"She is doing fine everybody yall just keep her in yall prayers and me as WELL the surgeon just came out and talk to me he said she is fine he said its a miracle and somebody was watching over her he told me you need to run to the chapel right now on bended knee and thank him until you cant thank him enough,\" she said via a Facebook post.\nResha Robinson declined to elaborate on circumstances around the shooting.\nFurther information was not available from the sheriff's office due to the ongoing investigation.\nThe shooting appears to be accidental.\nRobin Sanchez lives across Alabama Road on Pullman Street from the home where the shooting took place. She said the duplex residence had been empty until early in the summer when both sides of the home became occupied.\n\"There is lots of loud yelling, a lot of activity, during the day,\" she said.\nSanchez said she heard a commotion Monday around 5 p.m. including screaming and yelling, and when she looked she saw a man yelling about keys and a woman holding what looked like a bundle.\nShe said the man and woman seemed frantic until he told the woman to get in the car and they sped off.\nShe said shortly thereafter her daughter told her that there were a lot of sheriff's cars at the home.\nSanchez said the area is \"usually\" fairly quiet.\n'We've had no problems out here,\" she said.\nCheck news-press.com for further updates about this story."}