{"uri": "http://www.nbclosangeles.com/news/california/4-People-Dead-in-San-Francisco-Shooting-288132691.html", "title": "4 Found Dead in Stolen Car in San Francisco", "dct": "Mon, 12 Jan 2015 07:04:00 GMT", "id": "62dba3a6517159a50dac24f018e25180", "content": "Four men fatally shot in San Francisco's Hayes Valley neighborhood Friday night were inside a stolen car, police said Saturday.\nWhen police arrived at the 200 block of Page Street around 10 p.m. on a report of multiple shooting victims, they found four victims shot to death in a car, Lt. Tony Chaplin of SFPD's homicide detail told reporters. Chaplin said all four were adult males pronounced dead at the scene. No suspects are in custody yet.\nSFPD spokesperson Albie Esparza said the victims were in a stolen car that was double parked on the street. Police are working to verify the make and model of a car that was seen speeding away from the shooting and if it is related to the homicide, Esparza said.\nNeighbors in the area said they heard rapid gunfire, almost like firecrackers, and what sounded like a car crash. Some bullets went through nearby homes, one even lodged into someone's refrigerator.\nPolice told NBC Bay Area the area has a history of gang violence.\n\"We don't know that's what happened here just yet,\" Chaplin said. \"Our gang taskforce unit is on scene and they will be looking into that aspect.\"\nBut neighbors said the shooting came as a shock because lately, the area has been safe.\n\"I'm sure there are places in the city where it happens,\" business owner Trey Degrassi said. \"You hear about it in Oakland all the time, but not so much here.\"\nChaplin said SFPD's ShotSpotter gunshot detection system had been activated with numerous shots being fired. He estimated at least 10 shots were fired Friday night.\nPolice say a semi-automatic weapon was used, and a newer model gray Scion was seen leaving the area.\nPolice cordoned off several blocks with yellow crime tape and were canvassing the neighborhood for witnesses Friday night. Yellow evidence markers were spotted near the scene of the shooting.\nOn Sunday night, there was a growing memorial for the victims. Community leaders in San Francisco will hold a prayer vigil Monday night.\nInvestigators are talking to witnesses for information and hoping to look at video footage from the scene. Anyone with information on the homicide is asked to call SFPD at (415) 575-444 or send a tip by text message to TIP411 with SFPD at the start of the message.\nInformation from Bay City News was included in this report.\n— Cheryl Hurd (@hurd_hurd) January 10, 2015"}