{"uri": "http://www.nbcsandiego.com/news/local/Balderamma-Park-San-Diego-Street-Oceanside-Teen-Girl-Shot-to-Death-392244421.html", "title": "15-Year-Old Girl 'Targeted,' Killed at Park in Oceanside: PD", "dct": "Sat, 26 Jan 1929 00:00:00 GMT", "id": "7489bb5570fbe53f2d4bfb865a5a7971", "content": "A 15-year-old girl was found shot to death on a playground structure at a park in Oceanside early Saturday morning in what police believe was a \"targeted\" attack.\nThe Oceanside Police Department (OPD) said officers were called to Balderrama Park in the 700 block of San Diego Street just after 2:30 a.m. Saturday to investigate reports of shots fired in the area.\nWhen police arrived at the park, they made a grisly discovery: a teenager was found unresponsive on playground equipment near some handball courts, suffering from at least one gunshot wound.\nOfficers tried to save the girl, but she succumbed to her wounds and was pronounced dead at the scene, the OPD said. Police said it appears the victim was targeted and this was not a random shooting.\nNBC 7 spoke with the sister of the slain teen on Saturday as well as several friends who identified the victim as Anabell Flores. Her loved ones were distraught. They gave personal photographs of Flores to NBC 7 and shared a few details about the teen.\n\"Everybody loved Anabell; she was the best of life,\" said friend Nadia Musoke.\nThe teen's family and friends told NBC 7 Flores loved hanging out at Balderrama Park with her friends, and considered the playground home.\n\"There was no reason to kill. She’s not out looking to cause problems; she just loved being here,\" Musoke added.\nThe girl's friends said they were having trouble coming to terms with Flores' sudden, violent death.\n\"To me, it doesn’t even feel real. [It’s] like she’s still here,\" one friend who goes by Lani told NBC 7.\n\"She’s passed away now? No, not her – she’s a baby girl – 15 years old,\" added Flores' friend, Santa Torres, in disbelief.\nHomicide detectives remained at the park Saturday collecting evidence. The police department said that as of 8:30 a.m. no suspects had been arrested in the deadly shooting of the teen.\nDetectives believe there were likely others present at the time of the shooting, and are working to track down all potential witnesses.\n\"We believe there were possibly witnesses on the scene during the incident, but we don’t know what the role was of those witnesses,\" police said.\n\"We’re still trying to piece this together,\" Ryan Keim, of the OPD, told NBC 7.\nNo further details were immediately released by police.\nThis isn't the first time a young victim has been shot to death at a park in the Oceanside community.\nIn March 2013, four teens -- including Melanie Virgen, 13, and Edgar Sanchez Rios, 16 -- were gunned down at Libby Lake Park in Oceanside. Rios and Virgen died, while the other two teens survived the shooting. The suspects in that slaying were sentenced earlier this year.\nBefore that, in May 2011, the bodies of teens Fernando Felix Solano, 16, and Sandra Salgado, 14, were found shot to death near Libby Lake Park.\nA community impacted by gang activity, Oceanside continues to rebuild after the violent tragedies, promoting a better life for youth through mentoring programs such as the Vista Community Clinic’s Project REACH.\nWith each violent shooting, the community has been shaken to its core. Parents in Oceanside say they are outraged and frustrated that these types of shootings keep happening – robbing teens of their lives.\n\"You’ve [taken] away someone’s child, and you’ve taken away my family,” said Lani.\nThe community is praying the violence will stop.\n“Stop it. Stop That. No more,” added Torres.\nFlores’ loved ones told NBC 7 they hope police catch the person who killed the teen and that they are swiftly brought to justice.\nAnyone with information can call the OPD at (760) 435-4911."}