{"uri": "http://www.nola.com/crime/index.ssf/2016/12/his_murder_wasnt_spoke_about_s.html#incart_river_index", "title": "'His murder wasn't spoke about': slain 10-month-old's grandmother pleads for justice", "dct": "Tue, 13 Dec 2016 07:30:00 GMT", "id": "6ef5c03663471e690fe38392f424bfb3", "content": "More than a week after her 10-month-old grandson was shot dead in Marrero, Chermaine Davis is determined to get answers and justice. Even so, scant information has surfaced as to what happened on the evening of Dec. 3, when authorities say a gunman stormed into a Marrero home and opened fire, killing Xy'Ahir Davis and leaving a teen wounded.\nSpeaking by phone on Monday, Chermaine Davis, 42, said she and the infant's 17-year-old father, Xevion Davis, have relocated to Texas for now out of fear for their safety. Davis, who said she works in construction in Texas, said her son Xevion is struggling to cope with the profound loss of his child, whose nickname is \"Nemo\" and who she said was \"everything\" to his father.\n\"He felt like his baby was everything he had,\" said Chermaine Davis. \"Everywhere he went, he kept his baby with him. He was just trying to be a daddy to his baby, not knowing it would come to this.\"\nAt least five people were inside the home when someone came through the front door and started shooting.\nAccording to the Jefferson Parish Sheriff's Office, at least five people -- including the infant, his father and the wounded teen -- were inside a home in the 2100 block of Caddy Drive on Dec. 3 around 4:30 p.m. when a gunman burst through the front door and started shooting. Both the infant and a 16-year-old boy were hit multiple times, and Xy'Ahir was later pronounced dead at West Jefferson Medical Center. Family members said last week that the teen was expected to pull through.\nSince that tragic evening, Crimestoppers has set a $5,000 reward for information leading to the arrest of whoever is responsible for the shooting. On Saturday, family members buried Xy'Ahir Davis at Woodlawn Park Memorial Cemetery in Westwego.\nAmid profound grief, Chermain Davis said she struggled mightily to pay for funeral expenses out-of-pocket, in the face of an insurance policy too threadbare to cover costs. And as she's watched her surrounding community show an outpouring of support for slain football standout Joe McKnight, Davis said she feels like public attention over her grandson's killing has evaporated.\n\"I just want peace and justice,\" Davis said on Monday. \"This was a 10-month-old baby, and his murder wasn't spoken about.\"\nIn particular, she called out local elected officials who rallied to the McKnight family's side but who have not once reached out to Xy'Ahir Davis' family.\n\"The community didn't come forward, the councilmen stayed home,\" she said. \"I feel like nobody came forward to speak up for my grand-baby.\"\nThough far more people have turned out to support McKnight, family and friends did gather to grieve Xy'Ahir Davis during a candlelit vigil held a day after the infant's death. That night, around 50 people huddled outside the home at the corner of Caddy Drive and Rue Voltaire to mourn Xy'ahir and condemn violence in the community.\n10-month-old Xy'Ahir Davis was shot and killed Saturday afternoon inside a home in the 2100 block of Caddy Drive.\nAmong several speakers at the vigil, Ashonta Wyatt -- who is the founder and executive director of the activist group Mother2Mother -- unleashed a fiery challenge to those in attendance: hold yourselves accountable for the violence, she commanded.\n\"When are you going to be tired?\" she shouted. \"I hold everyone accountable for this. They don't have a box big enough for this baby.\"\n\"We cannot be OK with this,\" she continued. \"And we better start speaking up.\"\nThe killing of Xy'Ahir came at the end of a gruesome week in the greater New Orleans area that saw a mass shooting on Bourbon Street that left one man dead and nine others wounded, a shooting that wounded a law enforcement officer in Metairie, and the McKnight's slaying during a road rage incident in Terrytown. A man also shot dead a 35-year-old mother of two outside a house in Metairie on the Friday of that gruesome week.\nAnyone with information about the Marrero shooting is asked to call JPSO's homicide division at 504-364-5400 or CrimeStoppers at 1-887-903-STOP.\nJoe McKnight, the former NFL player, and a 10-month-old baby were among eight people killed in violence in metro New Orleans the week that ended Sunday, Dec. 4."}