{"uri": "http://nypost.com/2016/04/24/daily-blotter-857/", "title": "Daily Blotter", "dct": "Sun, 24 Apr 2016 00:01:00 GMT", "id": "4259893c8d7f22fede8e577ef65eaf5e", "content": "By Natalie Musumeci and Amanda Woods\nThe Bronx\nCops are looking for a suspect pictured above who assaulted a straphanger in Mott Haven, cops said. The 34-year-old victim was boarding a southbound 5 train at the Third Avenue-149th Street station at 7:10 a.m. on April 15 when the attacker approached from behind, cops said. The suspect grabbed the victim, punched her in the face and fled, according to authorities. The victim declined medical attention.\nA woman, 30, was mugged in broad daylight in Parkchester, police said. Two thugs, seen on surveillance video, walked up to the victim in front of 1460 Zerega Ave. at about 6:30 a.m. on April 13, cops said. The suspects pulled a gun on the woman, pushed her against a wall and grabbed her purse, authorities said. Police described one suspect as about 6 feet tall and wearing a black hat, blue jeans and a black coat. The other man is about 5-foot-11 and weighs 185 pounds, and was wearing a brown, UPS-like uniform.\nBrooklyn\nTwo thugs beat up a man and pulled off his pants as they grabbed his wallet in Brownsville, cops said. The punks approached the 56-year-old man from behind at Livonia Avenue and Chester Street at 2:50 a.m. Friday and started punching him, police said. When the victim fell to the ground, the crooks pulled off his trousers and grabbed the wallet. The suspects took money from the wallet and fled, cops said. One of the suspects wore a gray hooded sweat shirt with red stripes and a Yankee baseball cap. Their images were captured on surveillance video.\nQueens\nA veteran NYPD cop was arrested early Saturday for choking his wife and pushing his teenage daughter in their St. Albans home, police said. Officer Richard Phipps, 42, who works in the 105th Precinct, was charged with assault, harassment, criminal obstruction of breathing and acting in a manner injurious to a child in the 12:20 a.m. attack, cops said. Phipps allegedly shoved his 16-year-old daughter and then pushed his 40-year-old wife onto the bed, applying pressure to her neck with his forearm following an argument, police said. Phipps was busted about six hours later and was suspended without pay, police said. His wife and daughter were not seriously injured, authorities said.\nA 28-year-old woman was shot in the breast as she sat in a red Cadillac in Richmond Hill early Saturday, police said. The woman’s boyfriend called 911 at about 4:25 a.m. using the Cadillac’s emergency OnStar button. He reported that his girlfriend had been shot in the right breast while the car was parked at Atlantic Avenue and 120th Street, cops said. The victim told cops a man wearing a mask walked up to the car, fired one round and fled. The boyfriend drove her to Jamaica Hospital where she was treated for non-life-threatening injuries.\nA 29-year-old pizza-delivery man was robbed of $680 in Jamaica early Saturday, cops said. The victim was making a delivery on 89th Avenue near 197th Street at about 1:25 a.m. when a suspect came up and asked about the delivery, cops said. Then the suspect asked to use the victim’s cellphone — and a second suspect grabbed him. The first suspect rummaged through the deliveryman’s pockets while the other punched him repeatedly in the ribs. Two other suspects were involved in the mugging, said cops. The four suspects, believed to be in their 20s and possibly armed with a firearm and knife, fled on 89th Avenue, said police. They got away with the wad of cash and the deliveryman’s iPhone, police said. The victim was treated at Long Island Jewish Medical Center.\nManhattan\nThree men and a woman were shot in Harlem early Saturday, police said. Gunshots rang out on Edgecombe Avenue near Bradhurst Avenue at about 1 a.m., authorities said. Two victims, both 29-year-old men, were shot once in the leg. Also, a 28-year-old woman was shot twice in the leg and a 39-year-old man took a bullet to the arm, cops said. The 39-year-old victim was rushed to Lincoln Hospital while the others were taken to Harlem Hospital. A motive in the shootings was not immediately known. Police said the suspect wore a light-colored hooded sweat shirt and dark pants. Cops recovered six shell casings at the scene."}