{"uri": "http://www.capitolhillseattle.com/2015/12/spd-report-on-broadwaypike-shooting-released/?utm_source=CapitolHillSeattle.com+List&utm_campaign=54a876ace8-CHS_Daily_Subscriber_Mail_Morning10_19_2014&utm_medium=email&utm_term=0_caa1513de4-54a876ace8-432482293", "title": "SPD report on Broadway/Pike shooting released", "dct": "Tue, 01 Dec 2015 07:00:00 GMT", "id": "1b989a2cf977c6e1258b03d5c9229630", "content": "The motive behind the November 22nd drive-by shooting outside the Broadway and E Pike QFC remains unclear, but a police report from one of the responding officers lays out some basic facts about how the incident response unfolded and provides a few additional details about the assailants witnesses saw open fire and speed away.\nDetails about an argument reported to have happened just prior to the shooting, as briefly mentioned in SPD’s Blotter, are not included in the report. An SPD spokesperson told CHS those witness accounts may have been recorded in officer statements not yet available to the public.\nSeattle Police have not announced any arrests in the ongoing investigation into the early morning Sunday, November 22nd drive-by that resulted in four people suffering gunshot wounds and a fifth person injured by flying glass.\nWhile the report obtained by CHS doesn’t provide new details about what led to the shooting, there are some elements of the incident that have not yet been widely disseminated including limited eyewitness descriptions of the suspects. According to the witness descriptions, the shooter was a black male with a beard or possibly a goatee while the driver of the silver sedan used in the shooting was female.\nThe full report is below. The redactions were made by SPD to comply with department policies.\nA video obtained by local TV stations showed the graphic moments when shots rang out and appears to have captured images of the the suspect vehicle.\nMeanwhile, the normally 24-hour Harvard Market QFC will start closing its doors during weekend nights as part of an ongoing effort to address security concerns on the corner of Broadway and E Pike, a company spokesperson told CHS. Over the weekend, a sign was posted on the store’s front door notifying customers that it would close from 1 AM-4 AM on Saturday and Sunday.\n“Since that (timeframe) is when there are a lot of people coming out of the bars in the area, we determined that it might help eliminate a gathering space if we closed the store during that time,” said Fred Meyer/QFC spokesperson Melinda Merrill.\nAccording to Merrill, the new hours were not a direct result of the shooting, but part of an ongoing analysis of the store’s security procedures.\nMayor Ed Murray and East Precinct commander Capt. Paul McDonagh recently spoke with community representatives and members of the neighborhood chamber of commerce about the shootings, ongoing emphasis patrols, gun violence across Central Seattle, and new tools coming to Capitol Hill in 2016 to free more time for cops to focus on policing while moving more drug and mental health issues toward services and programs.\nMany of 2015’s shooting incidents have gone without arrests and the August murder on Capitol Hill tied to gang violence remains unsolved.\nUPDATE 12/1/2015: The president of the Seattle Police Officers Guild has gone to the media to complain about what he says is a cover-up of a staffing study that shows SPD needs to hire “300-400 more officers” and that Seattle is currently under-policed for a city of its size. “The City of Seattle has a moral obligation to safely staff the patrol ranks of SPD,” Ron Smith wrote in an update on the guild’s Facebook page. “Sadly this isn’t the case. We will be turning up the heat higher on those who the responsibility falls upon their feet.”\nFollowing the shooting, Mayor Murray and East Precinct commander McDonagh said the department is having difficulty recruiting new officers as Seattle faces intense competition for qualified candidates.\nOne alternative solution for the area’s nightlife businesses could be working together to form an organization that would be allowed to hire off-duty cops to help bolster SPD’s presence. An organization like the Broadway Business Improvement Area, currently being planned for expansion to cover areas including Pike/Pine as part of the priorities for the chamber’s newly hired director, could be one example of the type of organization that would be allowed to hire off-duty cops. Police officers are prohibited from providing security services to private businesses like bars and clubs."}