{"uri": "http://www.star-telegram.com/2014/02/17/5575730/shooting-victim-dies-in-hospital.html", "title": "Stray bullet kills grandmother in Fort Worth Stockyards shooting", "dct": "Mon, 17 Feb 2014 11:06:00 GMT", "id": "b3ec05afb758d888614031883b0a40ae", "content": "A grandmother was fatally shot by a stray bullet at a bar in the Fort Worth Stockyards on Sunday night and was not involved in the altercation that led to four men being wounded, police said Monday.\nSylvia Salazar, 56, of Fort Worth died at 1:57 a.m. at John Peter Smith Hospital, according to the Tarrant County medical examiner’s office.\nFour men who were wounded at North Side Outlaws bar, 115 NW 25th St., were in stable to critical condition Monday at area hospitals, said Sharron Neal, a police spokeswoman.\nSalazar’s sister, Cynthia Villarreal, 55, said Salazar had gone to the bar, about a half-block off North Main Street, with a friend “just to relax. She wanted to go out and have a nice time.”\nThe first 911 call about a shooting was received about 8:45 p.m., police said. Salazar and a wounded man in his 20s were taken to John Peter Smith Hospital, MedStar spokesman Matt Zavadsky said.\nA second wounded man, also in his 20s, was taken to Texas Health Harris Methodist Hospital Fort Worth, he said.\nTwo other wounded men were taken to hospitals by private vehicles, Zavadsky said.\nNo arrests had been reported by early Monday evening.\nVillarreal said Salazar was a good sister, a loving mother and a good grandmother.\n“She was raising one grandson, her oldest son’s child,” she said.\nThe bar’s Facebook page sought information today:\n“My deepest and most sincere sympathy and condolences to our customers and their families for Sunday’s horrific tragedy. While there are no words or actions to console anyone please know that each and every one of y’all is in our prayers. If anyone has any information please contact the detectives and help us put these cowards away!!!”\nThe bar is about block from the Fort Worth Police Department’s north side sector station.\nDomingo Ramirez Jr., 817-390-7763"}