{"uri": "http://www.click2houston.com/news/texas/hpd-teen-fatally-shot-while-laying-out-clothes-for-work-in-bedroom", "title": "HPD: Teen fatally shot while laying out clothes for work in bedroom", "dct": "Mon, 30 Jun 2014 17:39:00 GMT", "id": "1e9b75a5c26524f58d18e8c3acdc03c6", "content": "HOUSTON - Police are looking for the person who fired a deadly bullet that flew through a bedroom window and took the life of a 16-year-old boy.\nThe shooting happened as the teen was laying out his clothes for work inside an apartment complex on Ranchester near Bellaire in southwest Houston.\nHouston police investigators say David Otoniel Charar Yac was at home at the Happy Village apartments early Monday morning laying out his clothes for work when he was shot. His family struggles to understand.\n\"This is something we don't understand. We are supposed to be safe. He was not in the streets,\" said one family member.\nPolice say he was in his family's upstairs apartment when a single gunshot came through the window, hit his head and killed him instantly.\n\"He immediately fell to the floor and eventually died from one gunshot wound. We do not know at this time if someone was on foot or in a vehicle on the northbound or southbound lanes of traffic along Ranchester,\" said Jesus Sosa, with the Houston Police Department.\nPolice say the crime appears to be random. Investigators say the bedroom light was off and only a closet light lit the room of the teen whose family had recently moved here from Guatemala for a better life.\n\"He was a child, 16 years old. He never caused trouble with anyone. He was in his house getting ready for bed when someone does this,\" said a neighbor.\nInvestigators say four shots were heard a couple of hours before Yac was shot and killed. They do not believe those shots are related to this case.\nWitnesses reported seeing a male walking down the street in the area and peering into the apartment just before the shooting.\nPolice said they are still collecting evidence and have no definitive conclusions. No arrests have been made.\nAnyone with information in this case is urged to contact the HPD Homicide Division at 713-308-3600 or Crime Stoppers at 713-222-TIPS.\nCopyright 2014 by Click2Houston.com. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}