{"uri": "http://abc6onyourside.com/news/local/child-shot-by-father-in-east-columbus", "title": "Police: 2-year-old accidentally shot in the head by father", "dct": "Wed, 21 Dec 2016 00:00:00 GMT", "id": "7a192b5e51e29e5f8b2131db3aa49af3", "content": "Columbus Police are investigating two scenes at Noe Bixby Road after a father accidentally shot his 2-year-old son in the head. (WSYX/WTTE)\nCOLUMBUS, Ohio (WSYX/WTTE) -- A two year old boy is fighting for his life after being shot in the head.\n\"So much happening around here man it is terrible,” when Joe Baucum heard his two year old neighbor was shot this afternoon, his first reaction was shock, \"I can't believe somebody doing that to a small kid.\"\nColumbus police say just before three o’clock Wednesday afternoon, the toddler, Jaeson Hill, was shot in the head by his father, 34-year-old Brandon Hill, inside their home on the 2700 block of Noe Bixby Road.\nThe father, who has been charged with child endangering, was the only other person at the home during the incident.\nPolice believe the weapon wasn't secured at their home.\nAccording to detectives, the father put the child in his vehicle and drove up the street where he flagged down a police officer explaining the child was shot accidentally.\n\"The father has been taken down to headquarters. We're trying to sort through exactly what happened, what took place and at that point we'll see where this whole thing transpires and goes,” said Columbus Police Sergeant Stan Latta.\nThe child was taken to Nationwide Children’s Hospital with life threatening injuries. While police wait to see if the two year olds condition changes, neighbors like Baucum, who's a gun owner, doesn't buy this was an accident.\n\"I look at this way, if you have your gun right, there ain't going to be no accidents.\"\nAuthorities say they’ll be watching the boys condition as their investigation continues.\nABC 6/FOX 28 will have more details in this developing story when they're made available."}