{"uri": "http://www.nola.com/crime/index.ssf/2014/05/graduation_party_explodes_into.html", "title": "Graduation party explodes into violence, claims life of 15-year-old and injures others", "dct": "Sat, 24 May 2014 10:27:00 GMT", "id": "21f0a6f4917791eaca6412b15959725e", "content": "Empty cups litter the yard. Deflated orange and green balloons dangle from a gate. A banner celebrating the graduation of a young man named JeShan hangs nearby.\nA graduation party here in Gentilly turned violent at 11:20 p.m. Friday, when police say a 15-year-old was fatally shot and five others were injured. Gunfire exploded after an argument, police said, with one person believed to be the gunman.\nJeShan Vail, 17, who graduated Thursday from George Washington Carver Senior High School, said the party was for him. He said he was standing beside his younger brother, Tremaine Robinson, 15, when Tremaine was fatally shot.\n\"He was an innocent bystander,\" Vail said. \"He don't even sell drugs or in a gang. None of that. He's just a normal little kid.\"\nJohn Gagliano, chief investigator for the Orleans Parish Coroner's Office, confirmed that Tremaine Robinson, 15, of Spring, Texas, died at Interim LSU Hospital after being shot in the head.\nVail said his brother was born in New Orleans, but left after Hurricane Katrina in 2005. He said part of the reason he hasn't moved back from the Houston area is that Tremaine's mother is wary of the crime here. Tremaine, he said, enjoyed basketball and fashion and was about to enter his junior year of high school.\nA few feet away from where Vail spoke, a \"Thou Shalt Not Kill\" sign was stuck in the grass.\nThe scene at the home in the 6200 block of Eads Street was somber Saturday. By noon, people had emerged from the home to begin cleaning up what was left from the party: trays and bottles, cans and cups and food.\nThose injured in the gunfire included three women ages 19 to 30 and two men ages 22 to 25, police said. The 19-year-old is undergoing surgery, according to police. The others sustained non-life-threatening injuries.\nAround 8 a.m. Saturday morning, a car containing five young college students from Lafayette slowed down in front of the house, located off of Robert E. Lee Boulevard. The driver, a 19-year-old who declined to give her name, said she was looking for their purses, which they'd left behind in all the chaos the night before.\nShe said she'd heard about the party on social media. The organizers charged $5 for admission and issued armbands to guests, she said.\nThough she said she was cautious at first, she and her friends described feeling relieved when they saw young children and what she believed were adult family members at the event.\n\"We were just having fun and the next thing you know everyone was running under the tables,\" said the driver, who said she's a student at the University of Louisiana at Lafayette. \"We want to go back to Lafayette because there are not these problems.\"\nA tweet advertising the party on Twitter indicated free alcohol would be provided all night and that the price of admission would rise to $10 after 11 p.m.\nVail said the money was collected to offset the costs of the food and drinks. He estimated 250 to 300 people attended. He said family members including Tremaine had gathered in town not only to celebrate his graduation, but also to honor an aunt who recently died.\n\"It was mostly friends,\" he said of the Friday party. \"So whoever did what they did, we didn't know them.\"\nNeighbors said this was the second year the residents of the house had held such a party.\nOne neighbor said she heard the shots and peeked out of her door and saw who she thought was the gunman. She said she quickly closed the door. Later, she found a bullet had pierced the trunk of her car.\nThe woman described the teenagers who live at the house where the party was held as friendly and well-mannered, frequently engaging her in conversation. \"They are really nice people,\" she said.\nThe 15-year-old is the second-youngest homicide victim of the year so far in New Orleans.\nDetectives are investigating the incident to determine a motive and the identity of the suspect in the case. Detective Charles Hoffacker is the lead detective.\nAnyone with information is asked to call CrimeStoppers at 1.877.903.7863 or 504.822.1111. A cash reward of up to $2,500 is available for information leading to an arrest.\nCorrection: An earlier version of this story, using information provided by police and coroner's office officials, incorrectly reported that there were seven additional shooting victims instead of five, and that the teen slain was named Tremaine Robertson instead of Tremaine Robinson.\nPhotojournalist Chris Granger contributed to this report. Rebecca Catalanello can be reached at rcatalanello@nola.com or 504.717.7701."}