{"uri": "http://www.click2houston.com/news/6-people-shot-after-fight-in-boss-nightclub-sports-bar-parking-lot/27286692", "title": "6 people shot after fight in Boss Nightclub & Sports Bar parking lot", "dct": "Tue, 02 Sep 2014 08:43:00 GMT", "id": "9de18dfa28ede9f095475b8bd542cc1a", "content": "HOUSTON - Harris County sheriff's deputies are investigating a shooting that left six people injured early Sunday morning. Deputies were called to the Boss Night Club and Sports Bar at 3403 F.M. 1960 around 2 a.m. to reports of a weapons disturbance.\nHarris County Sheriff's Office spokesperson Thomas Gilliland said two groups of people were involved in a dispute across the street from the nightclub in a parking lot that had been used for overflow parking.\n\"There were probably more than 30-40 rounds fired, again, hitting at least six. Some of the businesses were shot, some of the windows were shot out. It was a random exchange of gunfire by two groups,\" Gilliland said.\nInvestigators said one of the victims was flown to a Memorial Hermann Hospital with critical injuries and two others were taken to Ben Taub Hospital via ground ambulance. Gilliland said three others were taken to a nearby hospital in personal vehicles.\nDonny Richard told Local 2 he had been at the club celebrating his sister's birthday and everything was fine until the crowd started to leave.\n\"We came outside and everything was cool and all of a sudden everybody started running, taking off. There was gunshots – it was a nightmare,\" Richard said.\nStray gunshots hit two businesses in the parking lot, including The Unique Slipper. O.W. LeDay, the owner's grandfather, said his granddaughter and others were cleaning up after a party at the time of the shooting.\n\"Last night, every one of them kids was in harm's way because they were leaving their party and here's all these guys, shooting at each other like it's a war,\" LeDay said.\nLeDay said it wasn't the first time violence had broke out between patrons of the Boss Night Club and Sports Bar.\nInvestigators from the Sheriff's Office have not detained anyone in connection to the shooting.\nGilliland said they are still seeking people from both sides of the dispute for questioning.\nCopyright 2014 by Click2Houston.com. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}