{"uri": "http://www.kptv.com/story/34101556/road-rage-incident-on-i-84-leaves-8-year-old-girl-with-gunshot-wound", "title": "Road rage incident on I-84 leaves 8-year-old girl with gunshot wound", "dct": "Tue, 20 Dec 2016 23:50:00 GMT", "id": "baef688f6f39e38537b5a887b976614f", "content": "PORTLAND, OR (KPTV) -\nPortland police are investigating a case of road rage on Interstate 84 Tuesday afternoon that ended with an 8-year-old girl suffering a gunshot wound to her foot.\nOfficers from the East Precinct responded to a call of a shooting at 2:56 p.m. in the 8500 block of Northeast Multnomah Street. When they arrived at the scene the learned the victim had been shot from a vehicle passing them on I-84.\nMedical personnel arrived and treated the victim for her superficial injury. She did not require immediate transportation to a hospital.\nAccording to police, the girl had been in the back seat of a car being driven east on I-84 by her mother when they came upon another person driving a minivan in a reckless manner, almost causing the victim’s mother to crash.\nThe mother then said someone shot from the van into her vehicle, hitting her daughter, as she drove past it. Another child in the backseat of the car was uninjured.\nThe suspect van was described as a blue minivan of an unknown make and model. The driver was described as a white or Hispanic man, 30 or 35 years old with a chunky build who was unshaven and wearing a hat.\nPolice note there may have been a passenger in the van, and it may have been involved with at least one hit-and-run incident on I-84 prior to the shooting.\nOfficers from the East Precinct stopped a van matching the suspect vehicle description at Southeast 162nd Avenue and Stark Street and detained the driver, Joshua Eric Constantine, 32, for further investigation by detectives.\nConstantine was later booked into the Multnomah County Jail on charges of attempted assault in the first degree and assault in the second degree.\nHe will be in court on Wednesday.\nPolice ask that anyone with information on this case or the possible hit-and-run incident please call the non-emergency line at 503-823-3333.\nCopyright 2016 KPTV-KPDX Broadcasting Corporation. All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}