{"uri": "http://www.columbian.com/news/2016/jul/18/woodland-murder-homicide-skinhead-vancouver-cowlitz/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+the-columbian-local-headlines+%28The+Columbian%3A+Local+Headlines%29", "title": "Woodland murder suspect appears in court", "dct": "Mon, 18 Jul 2016 11:33:00 GMT", "id": "192e8d3757f718af3fccf0cd31f0be53", "content": "A suspect with a long, violent criminal history in Clark County made a first court appearance Monday on suspicion of three counts of first-degree murder and one count each of attempted first-degree murder and unlawful possession of a firearm.\nSecurity was tight as Brent W. Luyster, 35, was escorted into a courtroom wearing handcuffs, leg shackles and a “suicide smock,” the name given to a garment that is designed to prevent prisoners from harming themselves. Nearly a dozen uniformed officers crowded into the courtroom.\nSuperior Court Judge Robert Lewis ordered Luyster to be held in the Clark County Jail without possibility of bail.\nHe will be arraigned on the charges Aug. 1.\n“I think it’s important obviously, given the information that we have at this point, given the severity of the charges that were filed, to make sure the community is protected and that there’s no risk of further violence here,” Deputy Prosecutor James Smith said after the appearance.\nLuyster, a former Vancouver resident who sports numerous white supremacist tattoos including the word “skinhead,” is accused of fatally shooting three people and wounding another Friday night at a rural home southeast of Woodland. He was apprehended Saturday afternoon on Ocean Beach Highway, west of Longview, after a day-long manhunt.\nDeputies were dispatched about 10:30 p.m. Friday after a woman with a gunshot wound to the left side of her face came to a convenience store in Woodland and asked employees to call the sheriff. The woman, identified in court records as Breanne L. A. Leigh, 31, told authorities that she and three others had been shot at a residence at 4006 N.W. 417th St.\nA SWAT team arrived at the home shortly before 11 p.m. and found the bodies of Joseph Mark Lamar, 38, and Zachary David Thompson, 36, lying in a gravel driveway. Both men had been shot in the head. A woman, identified as Janell Renee Knight, 43, was found on the living room couch. She also died from an apparent gunshot wound to the head, according to a probable cause affidavit.\nOfficers said they found shell casings, likely from a .45-caliber, next to the bodies.\nAt the hospital, Leigh was unable to speak with Clark County sheriff’s deputies but communicated by writing on paper. When asked who shot her, Leigh wrote, “pretty sure Brent … Luyster. He’s in big trouble Fed,” the affidavit said.\nThompson and Leigh have children together and live in Camas. Lamar and Knight lived together at the Woodland residence, court records show.\nLeigh told deputies that she passed out when she was shot, and when she came to, she army-crawled away from the house. She flagged down a motorist and got a ride to Woodland, according to the affidavit.\nSmith said that a motive is unclear. It’s possible prosecutors will file more charges against Luyster.\nAccording to court documents, Luyster’s former girlfriend told Washougal police June 22 that Luyster had directed relatives and other people to find her and their 5-year-old son. The woman said she believes Luyster is going to hurt or kill her and take their son.\nThe former girlfriend also told police she thinks Luyster is facing his “third strike,” court records said.\nUnder the state’s three-strike law, offenders convicted three times of certain violent and sexual felonies receive mandatory life sentences.\nAn FBI agent confirmed Luyster is facing charges in federal court for unlawful possession of a firearm based on a May incident in Cowlitz County, according to court documents. He is accused of pistol-whipping his former girlfriend. It was previously reported that his trial was scheduled to start Monday on charges of assault, harassment and illegal firearm possession. Smith said today that Luyster’s trial was previously set over to this fall.\nLuyster is well-known to Southwest Washington police. Most recently, he was released from the Cowlitz County Jail on June 8.\nIn the past, he has been involved in a drive-by shooting, taking a motor vehicle without permission and has been convicted of assault, rioting while armed with a deadly weapon, malicious harassment, malicious mischief and theft, among other crimes. According to Columbian archives, Luyster’s criminal history dates to June 1988, when he was 7."}