{"uri": "http://koin.com/2016/07/18/accused-killer-with-nazi-tattoos-brent-luyster-in-vancouver-court/", "title": "Accused killer with Nazi tattoos smiles at cameras", "dct": "Mon, 18 Jul 2016 06:12:00 GMT", "id": "9320a4c271c217807e2aec3b6c37dfc2", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nVANCOUVER, Wash. (KOIN) — Though he stands accused of 3 counts of 1st-degree murder, Brent Luyster flashed a smile at TV cameras as he made his first court appearance Monday.\nLuyster, 35, also faces one count of 1st-degree attempted murder and a 1st-degree charge of unlawful possession of a firearm. He was arrested Saturday afternoon without incident by Cowlitz County deputies and Washington State Troopers for allegedly shooting those 4 people at a home at 4006 NW 47th Street before fleeing.\nAll shot in the head\nCourt documents paint a harrowing picture of Friday’s triple murder. The bodies of 3 victims were found at a Woodland home, and all 3 appeared to have been shot in the head.\nVictims\nJoseph Lamar\nJanell Knight\nZach Thompson\nBreanne Leigh (wounded)\nThe victims were identified as Joseph Lamar, Janell Knight and Zach Thompson. The wounded woman — shot through the left side of her face — is Breanne Leigh, who is the mother of Thompson’s children.\nLamar and Thompson were found outside in the driveway next to each, both shot at point blank range. Knight was inside lying on a couch, also shot in the head.\nLeigh reportedly told officers she “army crawled” to safety and flagged down a vehicle, which took her to a nearby AM/PM store on CC Street, where police arrived and the investigation began.\nWhen authorities arrived they found she was unable to speak but was able to write answers to their questions.\nAccording to the affadavit, a deputy knew the shooting happened at the house of one of the victims, Joseph Lamar. The deputy asked Leigh if she knew who shot her, she wrote, “pretty sure Brent Lyster (sic) Luyster. He’s in big trouble. Fed.”\nIn court Monday, Clark County Deputy Prosecutor James Smith recommended Luyster be held without bail. That request was quickly granted.\n“I think it’s important obviously, given the information we have at this point, given the severity of the charges that were filed, to make sure the community’s protected and that there’s no risk of further violence here,” Smith said.\nLuyster’s next scheduled court appearance is August 1.\nPrevious arrests\nLuyster, 35, was still facing charges for allegedly pistol whipping his ex-girlfriend — the mother of his child — in May. When he was arrested that time, deputies heard shots fired and eventually talked him into surrendering. He was out on bail on this particular charge at the time of the murders.\nIn 2013, Luyster, his brother Robert and a man named Donald McElfish were arrested for an alleged racial attack at the QuarterDeck Bar in Vancouver. All 3 have with ties to a white supremacy group and were charged at that timewith 2nd-degree felony assault and racially motivated malicious harassment for the incident.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}