{"uri": "http://www.mlive.com/news/grand-rapids/index.ssf/2015/03/father_of_girl_killed_in_alleg.html#incart_story_package", "title": "Father of 12-year-old girl killed in shooting, fire said he worried for her safety", "dct": "Wed, 11 Mar 2015 16:47:00 GMT", "id": "4d23a5c54974cf16a74e5f9235b71881", "content": "ALLEGAN COUNTY, MI -- The father of a 12-year-old girl found dead after a fire and alleged shooting in Dorr Township said he'd worried for her safety for years after his daughter told him she had been hit several times by her mother's boyfriend.\nWilliam McComber, 36, cried softly on Wednesday, March 11, as he spoke of petitioning the courts multiple times over the past seven years for physical custody of his daughter.\nIn weekend visits with McComber, his 12-year-old daughter, Emma McComber, told him Corey LaValley had hit her and her two half-brothers several times and was physically abusive toward the children's mother, William McComber said.\nHis daughter told him that LaValley would \"lock all the doors\" in the couple's home and \"walk around with guns,\" McComber said.\nMcComber said he went to the Dorr Township mobile home to pick up his daughter for a visit last November and was told by the girl's mother that he could not see her. McComber said he had been threatened by LaValley in the past and told not to get out of his vehicle when he pulled up.\nWeeks passed. His only recent contact with his daughter was through a few texts he received. The last, on Feb. 16: \"I miss you so much dad,\" McComber said, reading the message that remains on his phone.\nPolice and firefighters on Tuesday, March 11, responded to a fire at the mobile home where Emma was living with her mother, Debra Sheppard, LaValley, and her half-brother, Corey LaValley Jr.\nFlames ripped through the home quickly and firefighters later found Sheppard dead inside with Emma and Corey Jr. Family members said authorities have told them the three were shot.\nThe elder LaValley was arrested Tuesday night and is lodged in the Allegan County Jail. State police records show sheriff's authorities have requested a warrant against him for one count of felony homicide.\nHis court appearance is set for Thursday morning.\nLaValley's previous criminal record included convictions of disturbing the peace in January 2015 in Allegan County, assault and battery in Eaton County in 2005, misdemeanor controlled substance possession and retail fraud.\nRecords show LaValley's most recent disturbing the peace conviction did not involve a person with whom he was living.\nOther court records reflect a back-and-forth battle over custody issues between Sheppard and McComber, dating back to Emma's infancy.\n\"I had tried for some time to get my daughter out of a bad situation. Nobody would ever listen. I really wish (the state) didn't make it so hard to do something,\" McComber said. \"I would tell CPS, petition the court, nothing would ever come of it.\"\nMore recently, in October 2009, records show McComber filed a motion in Kent County regarding extended parenting time with his daughter.\n\"Emma told me she gets punished and 'spanked' when she is done visiting me and she said Ms. Sheppard's boyfriend told her the next time she went with me, he would -- and she would not finish her sentence and was scared,\" the paperwork reads.\nEmma was not in school for two days following a weekend she had spent with McComber, he wrote then.\nIn February 2010, McComber filed another motion for a change in the custody arrangements.\n\"Ms. Sheppard has continued in a relationship with an abusive boyfriend and I am afraid for my Emma's safety due to the fact the last fight Ms. Sheppard and the boyfriend had, a child in the home was injured.\"\nNo charges against LaValley resulted from the alleged incident mentioned by McComber, but a police report number is cited in court records.\nA family court judge denied McComber's motion the same day, records show, noting the facts provided did not indicate an immediate threat of injury, loss or danger.\nMcComber for now is reflecting on the memories he has of Emma and her love for life. She was doing well in school and was outgoing, despite the challenges she may have faced, he said.\nEmma was in sixth grade at Hopkins Middle School. She enjoyed arts and crafts and spending time outside, her father said.\nTogether, the two would go on motorcycle rides, her in her own vest and helmet.\n\"It was just her and dad time,\" McComber said, his voice breaking. \"She was outgoing and loving. She could talk your ear off, she could tell you stories all day long.\"\nEdine Bronold, Sheppard's mother, acknowledged concerns her family had with LaValley but said Wednesday she would never have expected such tragedy to occur.\n\"Debra tried very hard to make a family and make a home for her children. That's something she worked to do and worked very hard at trying to do ... she loved her kids very much,\" Bronold said.\nLast summer, Bronold, Sheppard and her children went camping together at Wilderness State Park in Northern Michigan. They had made reservations for the same trip this year and looked forward to new memories.\nBoth Emma and Corey Jr. excelled in school. Corey, a fifth-grader, had an interest in sharks and marine life and Emma was doing well in advanced math. They were smart kids who worked hard and had good hearts, Bronold said.\n\"I never, ever, ever expected this.\""}