{"uri": "http://chicago.suntimes.com/news/man-charged-with-double-murder-at-horan-park-last-summer/", "title": "Man held without bond for double murder at Horan Park", "dct": "Thu, 23 Jun 2016 09:21:00 GMT", "id": "0d92ae06ec4fc36e4c9bdd17aa2a945d", "content": "A 19-year-old purported gang member was ordered held without bond Thursday for allegedly killing two people and wounding two others in a shooting at a West Side park last summer.\nSeveral witnesses saw the dark colored BMW Frank Robinson was known to drive circle around Horan Park several times before shots were fired on Aug. 26, killing 22-year-old Kwamaine Lovette and and 23-year-old Kortney Blakes, Assistant Cook County State’s Attorney Jamie Santini said.\nRobinson was seen getting out of the luxury car at Albany and West Van Buren with his face partially covered as the driver pulled into an alley, Santini said.\nRobinson, a Traveling Vice Lord whose gang had been feuding with the Gangster Disciples at the time, pulled out a handgun and started shooting in the direction of people in the park, Santini said.\nBefore jumping back into the BMW, Robinson pulled down his covering, revealing his face and distinctive facial tattoos to witnesses, Santini said.\nBlakes was shot in the head and Lovette was shot in the back, Santini said.\nAnother 22-year-old man suffered a gunshot wound to his shoulder and another 23-year-old man suffered a gunshot wound to his leg.\nOne witness told police he saw “lil Frank” get into the BMW before the shooting armed with a handgun with an extended clip, Santini said.\nAnother witness also saw Robinson with the weapon the next day and allegedly heard him say, ‘F— that. We’ve been dropping opps.” The witness took that to mean that Robinson was shooting and killing rivals, Santini said.\nAn arrest warrant had been issued for Robinson, but it wasn’t until this week that police got a tip that he was hiding in an apartment in Forest Park, Santini said.\nRobinson was charged with first-degree murder and aggravated battery with discharge of a firearm.\nRobinson, of the 1500 block of South Harlem in Forest Park, had attended Hillside Academy East, his attorney said."}