{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-3-shot-in-east-garfield-park-20150826-story.html", "title": "2 dead, 8 wounded in separate shootings", "dct": "Thu, 27 Aug 2015 04:00:00 GMT", "id": "99fea95e366e2c42c3272c4ee1d4fd72", "content": "Two men were killed and eight others, including a 14-year-old girl, have been wounded in separate shootings across the city since late Wednesday morning, police said.\nA man was killed and three others were wounded Wednesday morning in a shooting at a park in the East Garfield Park neighborhood, authorities and a witness said.\nSeveral people were hanging out at a playground at Horan Park, 3025 W. Van Buren Ave., around 10:35 a.m. when someone opened fire, according to witnesses and police.\nA 23-year-old man was shot in the head and was pronounced dead at Stroger Hospital, according to Officer Janel Sedevic, a spokeswoman for the Chicago Police Department. He was identified as Kortney Blakes, of the 3200 block of West Polk Street, according to the Cook County medical examiner's office.\nA 22-year-old man was shot in the abdomen and was in serious condition at Mount Sinai Hospital. A 22-year-old man shot in the right leg and a 23-year-old man shot in the left shoulder were at the same hospital in good condition, police said.\nLonnie Williams, 47, was sitting at the park's baseball diamond with his girlfriend when he saw a man with a black bandanna over his face jump out of a dark-colored BMW parked in a nearby alley and shoot toward those standing in the park.\nThere were \"a lot of people in the park, too, about 15 or 20, and he shot over into the crowd, about 10 straight rounds until it jammed,\" Williams said.\nWilliams said he saw one man who was shot in the head and another wounded in the leg, as well as a third who was hurt and ran to a nearby gas station.\nMore than a dozen evidence markers, some over shell casings, lay across the street from the park's basketball court while a few others lay next to the playground's slide.\nEvidence technicians examined a van parked on the street next to the park. The windshield had an apparent bullet hole.\nWilliams and others said the park is well-kept, but it has been a haven for drug dealers and a battleground for two rival gangs.\nTwo other people were wounded in the same neighborhood, East Garfield Park, on Wednesday afternoon and evening, police said.\nShortly before 1 p.m., a 31-year-old man suffered a wound to the foot in the 400 block of North Hamlin Avenue, said Officer Nicole Trainor, a police spokeswoman.\nThe man, who is a documented gang member, was taken in good condition to Mount Sinai Hospital.\nOne man was killed and three others were wounded in a shooting Aug. 26, 2015, at Horan Park in the East Garfield Park neighborhood, authorities and a witness said.\n(Jose M. Osorio / Chicago Tribune)\nLater, a 14-year-old girl was wounded in a shooting around 9:30 p.m., police said.\nThe girl was standing on a corner in the 3800 block of West Adams Street when she heard gunshots and was struck, said Chicago Police Department spokesman Officer Hector Alfaro.\nShe was hit in the right buttock and was taken to Loretto Hospital, where her condition was stabilized, police said.\nLater Wednesday evening, a 23-year-old man died after getting shot around 7:30 p.m. in the 1100 block of West 51st Street in the Back of the Yards neighborhood, police said.\nThe man was hit in the back and taken to Stroger Hospital in critical condition, police said. He was later pronounced dead at the hospital, police said.\nUpdate at 10:18 a.m. on 8-31-2015: The man was identified by the Cook County medical examiner's office as John Short, of the 1000 block of East 51st Street in Chicago.\nIn other shootings:\n• About 12:40 a.m. Thursday, a 34-year-old man was wounded in a shooting in the South Shore neighborhood on the South Side, said Chicago Police Department spokesman Officer Ron Gaines.\nThe man was standing near a vehicle in the 6700 block of South East End Avenue when someone fired shots from a passing green vehicle, Gaines said.\nThe man was struck in the leg and in the shoulder. He managed to get himself to the University of Illinois Hospital and Health Sciences System, where his condition was stabilized, Gaines said.\n• About 11:20 p.m. Wednesday, a 22-year-old man was wounded in a shooting in the Park Manor neighborhood on the South Side, Gaines said.\nThe man was outside his residence in the 300 block of East 69th Street when he heard gunshots and was struck in the leg, Gaines said.\nThe man was taken to St. Bernard Hospital, where his condition was stabilized, Gaines said.\n• About 9:25 p.m., a 20-year-old man was wounded in a shooting in the Brighton Park neighborhood on the Southwest Side, Alfaro said.\nThe man was standing outside in the 4600 block of South Fairfield Avenue when two male attackers came out of a gangway and started shooting, Alfaro said.\nThe man was struck in the left side of his body and was taken to Mount Sinai Hospital, where his condition was stabilized, Alfaro said."}