{"uri": "http://tbo.com/news/crime/hernando-deputies-several-people-hurt-in-shooting-20140829/", "title": "Brooksville police: Three killed, one injured in shooting", "dct": "Fri, 29 Aug 2014 00:00:00 GMT", "id": "443397bd1e62666f65740ea09110f825", "content": "BROOKSVILLE — Police on Saturday said they were trying to find out what snapped inside George Mason III, causing him to kill three people and injure another the previous night.\nAuthorities said Mason, 42, and his girlfriend were visiting the home at 820 Peach St., where his half-brother, Gabriel Taylor, 33, lived with Jannie Taylor, 81, and Ralph Peyton, 29.\nAt about 9 p.m. Friday, Mason pulled out a 9-mm handgun and shot to death Peyton and Jannie Taylor, police said. He shot and killed his girlfriend, 37-year-old Tarasha Townsend, in the roadway out front, then chased Gabriel Taylor to nearby Dr. Martin Luther King Jr. Boulevard.\nMason shot his half-brother five times before he accidentally was struck by a Dodge pickup truck traveling along the road, police said.\nBoth men were taken to Bayonet Point Hospital in Hudson.\n“Something sparked Mr. Mason to decide he was going to kill everybody in the residence, and that’s what he did,” said Brooksville Police Chief George Turner.\nMore people were in the house at the time of the shooting but were not injured, Turner said. Investigators on Saturday were trying to determine what Mason and the others were discussing before the suspect pulled out the gun, the chief said. “We don’t really know what the deal was,” Turner said.\nGabriel Taylor was in critical condition Saturday and underwent surgery, Turner said. Mason sustained numerous internal injuries when he was struck by the passing truck. His condition was unknown.\nThe truck driver had nothing to do with the shooting, police said. He stopped immediately and cooperated with investigators.\nMason and Townsend had children together, Turner said. They lived together at 24922 Oakhaven Court in Lutz.\nMason has a lengthy criminal history, records show, and previously has been arrested for possession of marijuana, possession of cocaine, selling cocaine, domestic violence, burglary and other charges.\nEbehrman@Tampatrib.com\n(813)259-7691\nTwitter: @LizBehrmanTBO"}