{"uri": "http://www.kfvs12.com/story/30828384/poplar-bluff-mo-teen-taken-off-life-support-after-accidental-shooting", "title": "Poplar Bluff teen dies after accidental shooting", "dct": "Fri, 25 Dec 2015 00:01:00 GMT", "id": "8a22e30be1e58827a37972bc683a71b2", "content": "POPLAR BLUFF, MO (KFVS) -\nAccording to Butler County Coroner Jim Akers, a Poplar Bluff teen who was accidentally shot was taken off of life support on Christmas Eve has died.\nKaitlyn Pullam, 17, died around 4 p.m. on Saturday, Dec. 26.\nShe had been taken off of life support on Christmas Eve.\nThe news was confirmed from the family through their pastor at The First United Methodist Church of Poplar Bluff.\nPullam was shot the night of Monday, Dec. 21 at her home.\nButler County Sheriff Mark Dobbs said her father thought the gun was not loaded and it inadvertently went off.\nWhen deputies arrived they found, Kaitlyn in her bedroom unresponsive with what appeared to be a single gunshot wound to her face.\nWitnesses told deputies that another family member in the home was trying to unload a black powder rifle when it discharged and went through the wall, hitting Kaitlyn.\nThe sheriff said Kaitlyn did not have a pulse when authorities arrived at the scene.\nDobbs said deputies and EMS personnel continued CPR on her.\nHe said she eventually regained a pulse at a Poplar Bluff hospital emergency room.\nPullam was airlifted to St. Louis Children's Hospital for further treatment, where she remained in a coma.\nHer pastor at The First United Methodist Church in Poplar Bluff said Kaitlyn's family is moved by the community's support.\n\"They just greatly appreciate everything that people have done,\" said Pastor David Stewart. \"They've been surprised by the number of people who've wanted to be involved and connecting. They've been overwhelmed by the amount and outpouring of generosity.\"\nPastor Stewart also said Kaitlyn had dreams of working in forensics, and that she was very intelligent.\n\"She had goals, she was driven, she was going to accomplish those,\" Stewart said. \"In fact, she really had already graduated, but was going to hang out for just one more semester just to walk with everybody else.\"\nThe pastor said her family had moved to Poplar Bluff from West Plains, Missouri not long ago.\nThe family plans to donate Kaitlyn's organs.\nAnyone wanting to support Kaitlyn's family can send a donation or gift to The First United Methodist Church in the family's name.\nDownload the KFVS News app: iPhone | Android\nCopyright 2015 KFVS. All rights reserved."}