{"uri": "http://www.kptv.com/story/33332829/police-identify-father-children-killed-in-beaverton-murder-suicide", "title": "Police identify father, children killed in Beaverton murder-suicide", "dct": "Thu, 06 Oct 2016 15:36:00 GMT", "id": "2d3dc5935837484378ab2685a0fec593", "content": "BEAVERTON, OR (KPTV) -\nPolice on Thursday morning identified a father and his two children who were found dead in an apparent murder-suicide at a Beaverton apartment complex.\nOfficers responded to the Redwood Creek Apartments near Southwest Hall Boulevard and Greenway Avenue just before 4:30 p.m. Wednesday after a woman called 911.\nPolice said the woman discovered three bodies in an apartment at the complex.\nWhen officers arrived, they found Lakalo Kawika Enfield, 36; Lakalo Vergara Enfield, 6; and Lehua Elaysea Enfield, 8 inside an apartment.\nIt appeared all three were dead, but when officers stepped out of the unit they heard a gunshot, which they believe was Lakalo Kawika Enfield taking his own life.\nPolice say Lakalo Kawika Enfield is the father of the two children.\nA Beaverton School District spokeswoman said both children attended Greenway Elementary School.\nThe school brought in a team of counselors on campus Thursday to help students and staff deal with the loss of the children.\n\"It’s sober in terms of the staff,\" district spokesperson Maureen Wheeler said. “Our hearts and thoughts are with the family and the loss of these dear children.”\nDetectives with the Beaverton Police Department and Washington County Major Crimes unit are investigating the deaths as a murder-suicide.\nPolice confirmed they responded to the location on Sept. 29 on reports of a verbal domestic disturbance. Officers said there were no signs of an assault and Lakalo Kawika Enfield agreed to go to a relative's home.\nOfficers were not called to that location again until Wednesday.\nCopyright 2016 KPTV-KPDX Broadcasting Corporation. All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}