{"uri": "http://www.fox19.com/story/30942657/police-father-shoots-son-14-thought-he-was-intruder", "title": "Prosecutor: No charges filed against dad who mistakenly shot, killed 14-year-old son", "dct": "Tue, 12 Jan 2016 12:26:00 GMT", "id": "20e79e8bbdc7115b0e383fd8f1dbae1f", "content": "EAST PRICE HILL (FOX19) -\nA father who mistakenly shot and killed his own 14-year-old son, thinking he was an intruder, will not be charged, Hamilton County Prosecutor Joe Deters announced Wednesday.\n“There is only one word for this - - tragedy. It is impossible to imagine how horrible this father must feel for mistaking his son for an intruder. All of the forensic evidence matches what the father told the police, and, therefore, no charges are appropriate,” Deters said, in a release.\nThe teen, Georta Mack, died shortly after he was taken to Cincinnati Children's Hospital Medical Center in \"extreme critical condition,\" Cincinnati Police said.\nThey said the son told his 72-year-old father he was going to school and walked down the street to catch a bus on Glenway Avenue. But he decided to skip class and sneaked back into the basement, where he planned to hide until his father went to work.\nHis dad thought he was an intruder, got up out of bed, and went downstairs, according to police.\nThe teen startled with his father, who had a gun in his hand and shot him in the neck, they said.\nThe father immediately called 911 after the tragic accident, according to investigators.\nOfficers responded to the home, located in the 1200 block of Blanchard Avenue off Glenway Avenue, about 6:30 a.m.\nThey questioned the father and said they believe the shooting was accidental. The father has no prior criminal record, Deters said.\nMack's brother and wife, Harvey and Regina Benford, said there were plans for Mack to move with them to their home in the Washington, D.C., Virginia area.\n“He came to visit us in June and over Christmas. He was going to be moving in with our family over Spring Break and was looking forward to a fresh start” Harvey told FOX19 NOW, in a text message.\nHarvey said they visited the Marine Corps Museum in D.C. He said Mack seemed to have some interest in being a Marine like his two older brothers.\n“He was sweet, had a great sense of humor , and loved music,” Harvey told FOX19 NOW.\nCopyright 2016 WXIX. All rights reserved."}