{"uri": "http://www.nola.com/crime/index.ssf/2016/12/6_shootings_reported_to_new_or.html", "title": "6 shootings reported to New Orleans police overnight", "dct": "Sun, 11 Dec 2016 16:27:36 GMT", "id": "4883785ebaddbf11e9ae325743bfc79c", "content": "In less than 12 hours, New Orleans police were called to six shootings across the city between Saturday evening (Dec. 10) and Sunday morning (Dec. 11).\nThe shootings were described in a preliminary NOPD report.\nSaturday\n6:17 p.m. -- Lizardi and Marais streets in the Lower Ninth Ward\nA gunman in a black vehicle fired several shots, injuring a 42-year-old man. The man was taken to a hospital in a private vehicle. Police did not release further details.\n7:30 p.m. -- Mardi Gras Boulevard and Hendee Street in Algiers\nA 21-year-old was standing near a vehicle in front of his girlfriend's house when a white, older-model car drove up, police said. A passenger in the vehicle rolled down the window and fired between 15 and 20 shots. The 21-year-old was struck once on his right leg. He was taken to the hospital by a private vehicle.\n10:58 p.m. -- 3100 block of Oliver White Ave. in the Desire neighborhood\nA 16-year-old male and a 21-year-old man were each shot several times. The teen told police that someone inside a white car fired on them from a back window. The 21-year-old told police that an unknown person walked up to them and fired a gun. NOPD did not release further details.\n11:04 p.m. -- Jackson Avenue and Clara Street in Central City.\nA 31-year-old man told police he was shot, and the man said he \"could not provide any more information,\" according to a preliminary NOPD report. No further details were available.\nSunday\n1:01 a.m. -- 2000 block of Florida Ave. in St. Roch\nA man was shot in the leg by an unknown male gunman. NOPD did not release further details.\n1:55 a.m. -- 1800 block of Odeon in Algiers.\nA 29-year man was returning home when a a man with a gun walked up to his front door. The gunman demanded the victim's property. When the victim refused to allow the gunman inside his home, the gunman fired a shot, striking the victim in his right arm. The victim ran inside the house, and the gunman continued firing through the door. The gunman eventually ran away. The victim was taken to a hospital by ambulance."}