{"uri": "http://www.wsoctv.com/news/local/police-investigating-early-morning-shooting-in-shelby/461141493", "title": "3 arrested in shooting that killed woman, child in Shelby", "dct": "Sat, 29 Oct 2016 08:34:00 GMT", "id": "9708e8c777876e5cd6bad5fba460d6ae", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nSHELBY, N.C. - Three people were arrested Friday in connection with the killing of a woman and a child in Shelby on Thursday morning.\nMario Wilson, Morris Abraham and Aubre Sucato were arrested and charged with murder.\nOfficials identified the child as 3-year-old Liam Murray.\n(Liam)\nRelatives said Liam and his mother were inside the home along with Miranda Woods when police said a robbery went bad.\nPolice said around 7 a.m. someone inside the house on Whisnant Street opened fire, killing Liam and Woods, while wounding a man identified as Jerod Shippy.\nLiam's grandmother said Sucato was best friends with Liam's mother and the two once lived together when the child was born.\n“That hurts me worst,” the grandmother, Sunshine Murray, said Friday night.\nFamily members grief stricken after 3 yr old child & woman shoot & killed on Whisnant St this morning in Shelby NC. pic.twitter.com/Nf0Y34FbrF\n— Garry Stanley (@garryWSOC9) October 27, 2016\n“Oh my God, it kills me. I want to hurt them because it was her best friend. It was her best friend that let these people into her house.”\nSunshine Murray said one of the two male suspects, Abraham and Wilson, was Sucato's\nboyfriend.\nThe family said that Woods was staying the night before the deadly shooting and that Liam's mother told them she was asleep, but woke up to the sound of gunshots.\n\"A 3-year-old child? I mean, who is heartless enough to do that?\" asked Tyler\nBeason, the child’s stepfather.\nDetectives spent Thursday morning going door-to-door throughout the neighborhood asking for information.\nBrother of fallen @ShelbyPolice officer Tim Brackeen comforts and prays for people at scene where two were killed including a toddler. pic.twitter.com/YBAzFjM71x\n— Ken (@kenlemonWSOC9) October 27, 2016\nThe police chief said people are volunteering information in a way police have not seen in the past, and told Channel 9 that he thinks the death of such a young child has angered people.\nAuthorities said Shippy was taken to the hospital. Relatives said he was Woods' boyfriend and he underwent surgery.\nAll three suspects were charged with two counts of first-degree murder, one count of attempted first-degree murder, attempted robbery with a dangerous weapon and conspiracy to commit robbery with a dangerous weapon.\n\"We are going to figure this out,\" Shelby Police Chief Jeff Ledford said Thursday. “Loss of life is sad. Loss of life of a child is senseless.\"\nThe investigation is ongoing.\nRead more top trending stories on wsoctv.com:\n© 2017 Cox Media Group."}