{"uri": "http://www.heraldtribune.com/article/20160713/NEWS/160719828/2066/NEWS?Title=Guns-bullets-but-no-evidence-in-fatal-shooting-", "title": "Guns, bullets, but no evidence in fatal shooting", "dct": "NODATE", "id": "1d2982397780f4447b68ba89046fb9c7", "content": "David Morse was killed by target shooter, but the Sheriff's Office could be at an impasse in pressing charges\nSARASOTA COUNTY - The .22-caliber bullet that killed 48-year-old David Morse on May 16 was fired by someone target shooting in the backyard of 4632 N. Shade Ave.\nThe shooters had hung a target on a wooden fence at the rear of the property.\nThe fatal round passed through the thin wood, easily, and traveled about 200 yards before it struck Morse at the base of the neck.\nMorse and the shooter likely never saw each other.\nMorse likely never heard the shot.\nHe was found dead that morning by his roommate and longtime family friend, Richard Lobo.\nNow, even though they know where the fatal round was fired, and have the guns that may have fired it, Sarasota County Sheriff's Office investigators may be at a potential impasse in their investigation.\nBallistics experts at the Florida Department of Law Enforcement can't match the round that was recovered from Morse's body to two weapons seized from the residents at 4632 N. Shade - including one that was purchased on the day of the shooting - because of the poor condition of the bullet.\n\"Several bullets were recovered from the scene including the bullet that struck and killed Morse, two bullets that struck a residence in the 2000 block of Golf Course Drive, and two bullets as well as several .22-caliber shell casings in the rear lawn of 4632 N. Shade Avenue,\" sheriff's spokeswoman Kaitlyn Johnston said in a written statement. \"FDLE is unable to 'identify nor eliminate' the bullet as being fired from the .22-caliber weapon seized from 4632 N. Shade Avenue.\"\nPainting over a fence\nData on file at the Sarasota County Property Appraiser's Office and other sources indicate that 4632 N. Shade Ave. is owned by Michael and April Lipstein.\nA woman who answered the door Wednesday didn't balk when asked if she was Ms. Lipstein, but immediately ordered a Herald-Tribune reporter and photographer off her property.\nA man who answered a phone associated with the property, who identified himself as Mike Lipstein, said he had \"no comment\" when asked about the fatal shooting.\nA large section of the wooden fence at the Lipstein home is missing.\nIt was seized by investigators as evidence in the days following the shooting.\nWhen detectives arrived, they found the homeowner painting over the fence.\nWhile Morse was the only person injured, the target practice caused other damage: A condominium at 2424 Golf Course Drive, in the Rolling Green Golf Village subdivision, had two bullet holes in the front window, which faces 4632 N. Shade.\nOne bullet hole was about five feet above the ground, the other a foot higher.\nDouglas Poreda was home when the first bullet struck his window, but didn't realize what had happened.\n\"I thought a bird had hit the window,\" Poreda said.\nAbout 45 minutes later, Poreda was barbecuing outside, when he heard gunfire and then the second round struck his home.\n\"I went a little bit nuts,\" he said. \"I'm glad my wife was working. That's her sewing room. If she'd have been sewing ...\"\nPoreda found one of the bullets in his home. He didn't learn of Morse's death until the next day.\n\"First comes the anger, and then I was just glad my wife wasn't there,\" he said. \"This person - the shooter - should be in jail.\"\nMorse, a 1985 graduate of Manatee High School, was a stage worker who worked for a theatrical stage employee union.\nHe had lived with Lobo and his wife for more than 10 years.\nLegal experts have said that an appropriate charge for a death resulting from a \"stray round\" would be manslaughter, a second-degree felony punishable by up to 15 years' imprisonment.\nSheriff's officials declined to be interviewed about the case.\n\"This is an active investigation and while detectives continue to analyze evidence, they are urging anyone with information to contact Detective Dave Tuck at 861-4939,\" Johnston said in her written release.\n- Contact investigative reporter Lee Williams at 941-284-8553 or lee.williams@heraldtribune.com."}