{"uri": "http://wpri.com/2014/07/09/5-people-shot-in-city-neighborhood/", "title": "Witness: Providence shooting ‘sounded like a war’", "dct": "Wed, 09 Jul 2014 01:27:00 GMT", "id": "3fad0d59aae188b2953fd004a8e5c5cb", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nPROVIDENCE, R.I. (WPRI) — Police continue to investigate after a shooting in the capital city late Tuesday night sent five people to the hospital.\nAccording to Providence Police Major David Lapatin, the shooting happened at about 11:30 p.m. in the Chad Brown section of the city.\nInvestigators said there were multiple crime scenes on or around March Street. Three females and two males were taken to Rhode Island Hospital, and at last check, one victim – 27-year-old Gabriel Burgos – was listed in serious condition.\n“It was really loud,” said eyewitness Decantee Baygboe. “It sounded like a war, like somebody was shooting back and forth.”\nOne neighbor said it sounded like machine guns were used, rather than handguns.\nDetectives are still working to figure out what led to the violence and who fired the shots.\n“We don’t know if there’s one shooter, two shooters, multiple shooters, we’re not definite on that yet,” said Major Lapatin.\nWhen asked if the violence could be gang-related, Lapatin said “it could be.” The department confirms they’re increasing patrols in the area to head off potential retaliation.\nThe police report revealed the victims range in age from 23 to 41 years old and all but one hail from Providence, the last having a Dorchester address.\nPolice have not yet named any suspects or motive in the shooting.\nHere’s a look at how Eyewitness News coverage has progressed throughout the day on WPRI 12.\nGunfire rang out at Chad Brown housing complex around 11:30 p.m. July 8, 2014\nEarly Investigation\nEyewitness News This Morning: Police are investigating the shooting of three women and two men in Providence.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}