{"uri": "http://pittsburgh.cbslocal.com/2015/06/22/county-police-homicide-detectives-investigating-shooting-in-wilkinsburg/", "title": "County Police Homicide Detectives Investigating 2 Shootings in Wilkinsburg", "dct": "Mon, 22 Jun 2015 04:15:00 GMT", "id": "c9319d47c69e9623fa62d139a65ac7f9", "content": "WILKINSBURG (KDKA)- Shots rang out in Wilkinsburg overnight, and at least four people may have been injured.\nAllegheny County homicide detectives were called to the scene near the intersection of Rebecca and East Swissvale Avenues. The shooting took place around 11:45 p.m. Sunday.\n“We heard about four or five rounds and I turned to him and I said. ‘What was that, do you think that was gunshots?’” Vanessa Young said.\nForensic investigators gathered evidence, and at least 18 evidence markers were on the ground at the scene. There were multiple shell casings from the shooting.\nTwo of victims are brothers who were on the stoop of an apartment building.\nTwo of the victims were taken to area hospitals and had to undergo surgery. The third victim was in less serious condition.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\n“It was just really scary because I have children. They were in bed sleeping and the last thing I want to think about when I just put my kids to sleep is if I got to get down for fear that shots come through my apartment,” Young said.\nPolice are not revealing any information about a possible motive or how many were involved in the shooting.\nThe scene of the shooting was cleared around 2:15 a.m. A few minutes later, there was a report of another shooting just four or five blocks away.\nIn that incident, a man was shot in the leg along the 1600-block of Wesley Street. He was taken to the hospital and was last listed in stable condition.\nMeanwhile, people in the neighborhood are worried about the reckless shooting.\n“Them shooting, hitting your house, hitting you. It could be all different types of situations,” one woman said.\n“It could affect my family and it could affect my family horribly. Someone in my family could be gone because of what’s going on out here,” Young said.\nSo far, there have been no arrests in either shooting."}