{"uri": "http://www.wistv.com/story/33038274/nc-police-chief-man-wanted-for-shooting-ex-wife-killing-son-found-dead-in-columbia-motel", "title": "Man who bragged on Facebook Live about shooting ex-wife found dead in Columbia motel", "dct": "Thu, 08 Sep 2016 23:21:00 GMT", "id": "cf65767634643ffcc29c8945585f5d46", "content": "COLUMBIA, SC (WIS) -\nA man wanted for shooting his ex-wife and killing his son in North Carolina was found dead in a Columbia motel Wednesday evening.\nRichland County Coroner Gary Watts said 45-year-old Earl Valentine was found dead at the Days Inn off Interstate 20 in Columbia.\nRichland County deputies and the county coroner were called to the Days Inn Columbia NE Fort Jackson on Plumbers Road Wednesday evening. A spokesman for the sheriff's department said Valentine was found dead at about 8 p.m. in a motel room from gunshot wounds to the upper body. Deputies discovered the body after receiving information from the Fugitive Task Force that Valentine may have been at the motel.\nPolice say Valentine confessed to seriously wounding his ex-wife and killing his 15-year-old son on Facebook Live in North Carolina.\nPolice in Norlina, N.C., say Valentine broke into his ex-wife's home on Tuesday morning and shot both victims. Valentine, police said, then logged on to Facebook and broadcast a confession to all his friends.\nSoon after the shootings, investigators say, the 45-year-old drove to Richmond Virginia - claiming he would kill his in-laws. But police say, he instead turned around and headed south to Columbia, where his mother lives. By then, federal and state law enforcement had launched a multi-state manhunt. It ended Wednesday night at the Days Inn near I-20 in Richland County when Valentine's body was found in a room after he'd put a gun to his head.\nRichland County Sheriff Leon Lott says his department had already located Valentine and was just about to try to take him into custody.\n\"I don't feel no [expletive] remorse for what I did,\" Valentine told his friends. \"I loved my wife, but she deserved what she had coming. I know a lot of y'all are going to be disappointed in me, but it was something that had to be done.\"\nNorlina Police Chief Taylor Bartholomew said the victims had moved to the area to escape Valentine's abuse and a restraining order just expired last month.\nWIN A TABLET FROM WIS!\n\"I've been law enforcement in 20 years and I've never seen anything like this,\" Police Chief Taylor Bartholomew said. \"This guy is bragging about it on social media.\"\nCopyright 2016 WIS. All rights reserved."}