{"uri": "http://www.wmcactionnews5.com/story/26708141/two-dead-two-critically-injured-after", "title": "Two dead, two critically injured after Berclair shooting", "dct": "NODATE", "id": "fe68ab9ceae897429df3fad6814f451d", "content": "(WMC) - Police are hunting down two suspected shooters in the Berclair area and neighbors say violence is out of control in their community.\nNeighbors on Gherald Street woke up to crime scene tape around a neighbor's house, bullet holes in the walls and two men dead.\n\"We watched as they rolled four or five people out of the house,\" said Casey Jackson.\nJackson says her mother-in-law's street became a crime scene as officers and paramedics rushed two gunshot victims to the hospital and took two others to the morgue.\n\"I feel bad ... I feel not safe,\" Zoila Medrano said.\nMedrano lives a couple of doors from where the shooting happened. She feels Hispanics in the area are being targeted by robbers. Landlord Steve Brown agrees.\n\"Like, I'm saying where are the police, where are the police cause right now you've got people being targeted and you've got a lot of folks getting hurt,\" noted Brown.\nNeighbors say the two gunmen ran up to a group of men hanging out in the front yard of a house on Saturday night. They pointed guns at the men and demanded money.\n\"It went on for about five minutes. Fifteen gun shots went around,\" added Jackson.\nResidents say this is not the first time they've seen crime scene tape in their neighborhood and, they are afraid it won't be the last.\n\"It makes me want to move out from here, move to somewhere different,\" said Jackson.\nAccording to investigators, one person was pronounced dead on the scene, while the other three were transported to Regional Medical Center.\nOne victim died upon arrival at the hospital, while the other two remain in critical condition.\nAll of the victims were under the age of 30. Police need your help tracking down the shooting suspects. If you have information that can help, call Crime Stoppers at 528-CASH.\nCopyright 2014 WMC Action News 5. All rights reserved."}