{"uri": "http://www.click2houston.com/news/breaking-now-active-shooter-in-west-houston", "title": "Suspected shooter identified in west Houston mass shooting", "dct": "Sun, 29 May 2016 11:05:00 GMT", "id": "6091f57c5618d49914b7f37ecf762539", "content": "HOUSTON - An officer-involved shootout Sunday morning left two dead and several others injured, including multiple innocent bystanders, in the west side of town, police said.\nPolice said the main suspect, Dionisio Augustine Garza III, 25, was shot by a SWAT officer, and several others were wounded.\nAmong the victims were Byron Wilson, 30, Denise Slaughter, 59 and Eugene Linscomb, 57, who was shot to death inside a black Mercedes.\nInvestigators found a military-style backpack Monday at the Conoco gas station, which caught fire Sunday after being hit by a hail of gunfire. The backpack contained bullets, a birth certificate and several other items.\nInvestigators believe the backpack was detonated Sunday.\nHPD looking through backpack, bullets, & other items found. Police say bag was detonated yesterday. Unsure of owner. pic.twitter.com/sA0OTmqkyG\n— Brandon Walker (@KPRCBrandon) May 30, 2016\nOfficers responded to reports of shots fired around 10 a.m. Sunday at Memorial Tire & Auto in the 13200 block of Memorial Drive near Wilcrest Drive. Police said the first officer to arrive at the scene immediately became a target for gunfire.\n[PHOTOS: Following shooting rampage that left 2 dead, 6 injured in west Houston]\n\"The results of what happened to his windshield and his vehicle-- miraculously, he was not hurt,\" HPD spokesperson John Cannon said. \"If (SWAT) hadn't taken that action quickly, this could have been a lot worse than it was.\"\n#DEVELOPING Just heard officers yell \"FIRE IN THE HOLE\" then detonate something near shooting scene @KPRC2 pic.twitter.com/U1UCO4olrt\n— Sara Donchey (@KPRC2Sara) May 30, 2016\n\"The police that were driving down the street were on the loudspeaker on the bullhorn, telling everybody to get inside and lock their doors,\" McConn said.\nParamedics took a woman and two men to the hospital, HPD officials said. Authorities said they are all expected to survive.\nIn a news conference, interim HPD Chief Martha Montalvo said two Precinct 5 deputy constables were injured in the shooting. One was saved by his bulletproof vest. The other was struck in the hand. The two officers have since been released from the hospital and are recovering at home.\nHPD says first officer to arrive to active shooter scene was met with gunfire, he is \"lucky to be alive\" @KPRC2 pic.twitter.com/3LwcNxbnUI\n— Sara Donchey (@KPRC2Sara) May 29, 2016\nOfficials said Garza allegedly fired multiple shots at a Conoco gas station at Memorial Drive and Wycliffe Drive, causing a fire.\nA witness, Shayan Sadri, captured a brief Snapchat video of the gunfire and gas station, which caught fire. The 29-year-old, who is from New York, was in the area visiting his family.\nNo injuries were reported in connection with the gas station fire.\nPolice also said Garza allegedly shot a police helicopter five times.\n“The suspects had high-powered weapons that they were using — AR-15s that they were using. They were actually able to shoot at a helicopter,” Montalvo said.\nSources told KPRC 2 that the person officers initially believed was a second suspect is no longer considered a suspect. That person was injured and taken to the hospital.\nResidents were ordered to shelter in place as law enforcement searched for the shooter.\n\"I saw police and a car and I saw another guy walking up, shirtless,\" witness Bill Schwartz. \"He had tattoos on him (and) dark hair. He put his hands in the air. Then when I got another 15 down Memorial Drive, I heard a pop.\"\n[VIDEO: First HPD press conference on officer-involved shooting in west Houston]\nInvestigators said there is no known motive for the shootings.\n\"We do not know what started this, but what we do know is that they were shooting randomly at who ever happened to come upon the scene,\" Montalvo said.\nSeveral streets in the area of Memorial Drive from Britmore to Lockwood were shut down overnight as police investigated.\n\"These officers, their training kicked in,\" Montalvo said. \"They did what they had to do. They took care of one another and they contained the scene as best as possible.\"\nIn a Facebook post, Chapelwood United Methodist Church said Linscomb and his family were active members of that congregation. There will be a community-wide healing service at 7 p.m. Thursday at Memorial United Methodist Church.\nFYI: Memorial Drive is still closed at Wilcrest. Police haven't been able to say when it will reopen @KPRC2 pic.twitter.com/ouSLdvYf75\n— Sara Donchey (@KPRC2Sara) May 30, 2016\n#UPDATE: three people who were shot in W. Houston (two men, one woman) are all expected to survive @KPRC2\n— Sara Donchey (@KPRC2Sara) May 29, 2016\n#BREAKING: two Pct. 5 deputy constables who were shot this morning have been released from the hospital @KPRC2 pic.twitter.com/ju5D0eIsL5\n— Sara Donchey (@KPRC2Sara) May 29, 2016\nNeighbor who lives in area of shooting showed me this photo, he believes this truck had windows shot out @KPRC2 pic.twitter.com/bR9Y38LsUv\n— Sara Donchey (@KPRC2Sara) May 29, 2016\nCopyright 2016 by KPRC Click2Houston - All rights reserved."}