{"uri": "http://bransontrilakesnews.com/news_free/article_0df27d14-947e-11e6-aeec-6307d41f5f0f.html", "title": "Forsyth teen charged with murder", "dct": "Mon, 17 Oct 2016 10:26:00 GMT", "id": "5c13ddefc4e6a7fba1869f9f9329c3d7", "content": "FORSYTH — A teenager has been charged with murder in a shooting death of another teenager in Forsyth.\nTristan Carr, 18, has been charged with first-degree murder and armed criminal action in the death of Eric Summerfield, also 18.\nAccording to a probable cause statement from the Forsyth Police Department, used to file charges in the case, police arrived at a home on Skyline Drive and found Summerfield lying in the road with a gunshot wound to the chest. Carr reportedly was crying and told officers he had shot Summerfield. An officer, and then paramedics, gave Summerfield CPR, but he died at the scene.\nAfter being given his Miranda warning, Carr told an officer that he had asked Summerfield and other friends to come to his residence and “hang out.” He told the officer that the car had come from a different direction than he was expecting, and he was scared when the vehicle stopped, the report states.\nA witness, whose name was redacted from the court document, told officers that when the vehicle arrive, Carr looked out the window, uttered an expletive and said “Eric is here.”\nThe witness told police he went outside and greeted Summerfield, then started to walk away. He said Carr and Summerfield were talking and then he heard either an expletive followed by a gunshot, or a gunshot followed by an expletive. Then Summerfield took off running, accoring to the report.\nThe report stated that there was blood leading from the driveway into the street where Summerfield died.\nCarr is in Taney County Jail on a $500,000 bond.\nBelow are previous updates from the weekend.\nFORSYTH — Police have named the victim of a shooting that took place Saturday evening.\nEighteen-year-old Eric Summerfield, of Forsyth, was found with a single gunshot wound to his chest, according to Forsyth Police Department.\n“The Forsyth officer attempted CPR on the victim,” the press release stated. “The victim was later pronounced deceased at the scene.”\nThe 18-year-old male shooter, of Forsyth, was taken to Taney County Jail.\nForsyth Police are asking the State Prosecutor to file charges of first degree murder, armed criminal action and unlawful use of a weapon, the press release stated.\nOriginally posted at 12:26 a.m. Oct. 16\nFORSYTH — The Forsyth Police Department is investigating a shooting that left one man dead Saturday evening.\nA male victim was found dead with a gunshot wound to his chest area, according to a press release from Forsyth Police Chief Roger Ellis. The police were dispatched “to a reported accidental shooting” at 7:38 p.m. Oct. 15, the press release stated.\n“The male shooter is being interviewed by detectives at this time,” Ellis stated. “The scene is still being investigated.”\nNo names have been released.\nThe Branson Tri-Lakes News will have more updates as they become available."}