{"uri": "http://www.wfaa.com/story/news/2015/06/15/grandfather-kills-grandson-in-hunting-accident/71267698/", "title": "Sheriff: Man shoots grandson in fatal hunting accident", "dct": "Tue, 16 Jun 2015 00:00:00 GMT", "id": "9f5e7837fa14a051c5ff289f143598b9", "content": "DECATUR — Hunting at the Nine Bar Ranch in Decatur has brought so many families so much joy. And now, for one family, unspeakable sadness.\n\"I can't imagine anything worse than this,\" says Decatur ISD superintendent Rod Townsend.\nPeppered with pictures of a little boy wearing a cowboy hat and a grin, a GoFundMe page starts to tell the tragedy. Wise County Sheriff David Walker says Saturday morning, 55-year-old Jim Bob Little, who owns the popular ranch, was hunting with his 9-year-old grandson, Callen Little. Walker says Callen left the hunting blind, unbeknownst to his grandfather, and somehow ended up in the path of his grandfather's shotgun. He died after being shot once in the chest.\n\"It's a tragedy,\" Walker says. \"No one wants to see any kids hurt no matter what it is.\"\nWalker says investigators remain on the case, but all signs point to this being nothing more than a heartbreaking accident. Hunting, Walker says, is part of the fabric of so many families here.\n\"It's been a tough couple of days,\" says Townsend.\nTownsend says Callen had just finished the third grade at Carson Elementary school in Decatur. He says Callen's teachers describe him as an obedient, helpful, joyous little boy.\n\"There's probably no such thing as a perfect child, but he was as close as they'd ever seen,\" Townsend says.\nNews 8 spoke Monday to friends and family at the ranch who said they aren't ready to talk about what happened over the weekend. They asked for everybody's healing prayers and also issued a statement on their public Facebook page, which said in part: \"We lost a very special boy today. I know he left a mark on everyone's heart. God speed Callen. We will see you again some day.\"\n\"His teacher even said he was on his journey to doing amazing things,\" Townsend says. \"There was not a doubt in her mind that when he got to high school he was going to be mister everything.\"\nIt's hope that has now turned into a little boy's legacy."}