{"uri": "http://www.star-telegram.com/news/local/community/article66091767.html", "title": "Game warden: Weatherford student accidentally shot himself", "dct": "Mon, 14 Mar 2016 22:18:00 GMT", "id": "4b0001679836a853c62d873f1d2e6a90", "content": "The Weatherford teen killed Monday morning in a hunting accident was leaving a wooden ground blind when his gun discharged and wounded him in the head, a Wise County game warden said.\nBrennan Weikel, 17, was hunting feral hogs with three family members in western Wise County, close to the Jack County line, game warden Penny Nixon said.\nThe accident happened at about 3:50 a.m. Monday on leased hunting land near County Road 3825, Nixon said, noting that it’s not unusual for hog hunters to hunt overnight. Weikel was a senior at Weatherford High School, and was on spring break this week.\nWeikel’s stepfather had shot a hog and called Weikel on a cell phone. The stepfather told authorities he heard a gunshot “immediately” after that phone call.\n“As he reached down, he grabbed the grip near the trigger,” Nixon said. “As he was transitioning to get up and exit the blind, the gun discharged.”\nThe gun was a Remington .243 rifle, Nixon said.\n“[The shot] was pretty point blank,” Nixon said. “A young hunter — a relatively new hunter— killed this way is everybody’s worst nightmare. It’s hard for a young hunter who’s naturally looking to shoot to remember some basic skills sometimes on maneuvering around the blind.”\nWeikel played defensive end for the Weatherford High School football team, his coach, Weldon Nelms, said.\n“He wasn't very big, but he was just tough-minded and a hard worker,” Nelms said Tuesday. “A coach is always supposed to go before his kids, and that’s the kind of a tough thing I’ve had to face in 37 years of coaching.”\nLast summer, a 9-year-old boy was fatally shot by his grandfather in a hunting accident east of Decatur.\nIn 2013, Denton Guyer football player Nate Maki was accidentally shot to death by his best friend while hunting coyotes on a ranch near Bowie. The friend, Michael Bryce Underwood, received five years’ probation after pleading guilty to criminally negligent homicide.\nStaff writer Lance Winter contributed to this report\nRyan Osborne: 817-390-7684, @RyanOsborneFWST"}