{"uri": "http://www.weatherforddemocrat.com/news/tpw-weatherford-senior-shot-himself-while-hunting/article_b361cb42-ead3-11e5-a6ca-c7d66a4c0691.html", "title": "TPW: Weatherford senior shot himself while hunting", "dct": "Tue, 15 Mar 2016 00:00:00 GMT", "id": "b4fbdd7823a6976dcb9249869d856bc8", "content": "A Weatherford High School senior killed in a hunting accident Monday morning apparently accidentally shot himself, according to information from the Wise County Sheriff’s Office and the Texas Parks and Wildlife Department.\nBrennan Weikel, a 17-year-old football player on spring break this week, was hunting with his stepfather and one or two other relatives early Monday morning in Wise County when the shooting occurred, according to officials.\nThe group had a lease license and were hunting hogs overnight on a property off County Road 3825 south of Runaway Bay near the Wise County and Jack County line, according to Game Warden Penny Nixon.\n“They were placed in individual ground blinds, the little wooden ones,” Nixon said. “His stepfather shot a hog and called the victim to ask him to help retrieve it. And the stepfather reported that immediately upon hanging up with the stepson, just seconds later, he heard a shot. It came from the blind where the young victim was.”\nAfter getting no response to a text asking about the shot, the Weikel’s stepfather, who was approximately 300 yards away, went over to the stand and found the teen crumpled up in the corner, his feet tangled up in a chair, according to Wise County Sheriff Lane Akin.\n“There may have been some hunter inexperience involved,” Nixon said.\nAkin said the gun is believed to have gone off when he leaned over the rifle, which had a round chambered and the safety off, and all indications point to an accidental shooting.\nNixon said it appears that when Weikel went to stand up and move out of the blind, he reached for the grip of the rifle and squeezed the trigger as he moved, shooting himself with a .243 round.\n“It was instantly fatal,” Nixon said. “It’s a real tragedy.”\nWeikel had completed a gun safety course five days earlier and was licensed to hunt, according to law enforcement officials.\nThe teen’s body has been sent to Dallas for autopsy and the Remington 789 sent to a firearms examiner, according to Akin, who said the local Texas Ranger is also assisting in the investigation.\nA funeral service for Weikel will be held at 11 a.m. Saturday at New River Fellowship Church in Hudson Oaks. Visitation has been scheduled for 6 p.m. to 8 p.m. Friday at Greenwood Funeral Home on White Settlement Road in Fort Worth."}