{"uri": "http://www.wcpo.com/news/local-news/hamilton-county/cincinnati/madisonville/pd-adult-infant-shot-in-madisonville", "title": "Police say they caught man who shot 2-year-old in Madisonville drive-by", "dct": "Wed, 13 Jul 2016 18:14:00 GMT", "id": "b0de8609fc02c25f78753f5781fe1125", "content": "Autoplay:PD: Toddler critical after Madisonville shootingCONNECTING...XPD: Adult, infant shot in Madisonville, shooter on the loose\nCINCINNATI - Police say they quickly arrested the man who shot a 2-year-old boy and his grandfather in Madisonville on Wednesday evening. And they're praising witnesses for their help.\nPolice say 35-year-old Ernest Cephas shot the pair in a drive-by on Whetsel Avenue, then fled in a car with its back window shot out. He was caught just a few hours later.\nBoth victims are in critical condition at the hospital and their chances of surviving are \"worrisome,\" a prosecutor said in court Thursday.\nPolice are grateful that witnesses came forward to help make a quick and safe arrest, Lt. Col. Mike John told WCPO.\n\"The cooperation we got from the community at large was just incredible,\" John said Thursday. \"It made such a huge difference simply because we were able to put everything together so quickly.\"\nWitnesses often hold back because they fear retaliation or don't trust police, but that didn't happen in this case. John was very encouraged.\n\"We have to build that collaboration, open up conversation,\" John said. \"We have to build that level of trust that people can feel that they can say information to us and know they're not going to come into harm's way.\"\nResidents here say they want to see the violence stop.\n\"Shootings are all the time here,\" said David Culberson, who has lived in Madisonville for 40 years. \"You just have to hope it all goes well is all I can say.\"\nCulberson said he knows the grandfather who was shot.\n\"I've been around the young man most of his life,\" he said.\n\"It's too much,\" said Leyxus Warren, who lives on Whetsel Avenue with her 6-month-old daughter. \"We can't even come in our yard no more because there is a whole bunch of violence. I have a baby, and I knew that baby. He didn't deserve that bullet.\"\nWCPO also spoke with the victims' family and they said they are sick of the violence. Neighbors said they hope witnesses to any crime will step up and talk to police.\nNote: Police originally identified the adult victim as a 25-year-old male. Lt. Steve Saunders later corrected this error, saying the victim is 36."}