{"uri": "http://www.fresnobee.com/news/local/crime/article91383227.html", "title": "Four-year-old wounded in central Fresno drive-by shooting", "dct": "Fri, 22 Jul 2016 15:47:00 GMT", "id": "ef1b88a173d42d20df97db13c8ce24a4", "content": "A 4-year-old boy was shot Friday afternoon while standing with his family in front of a central Fresno apartment complex, police said.\nSgt. Mark Hudson said the boy was grazed across his neck by one bullet, while a second shot passed through his left wrist. He was rushed to Community Regional Medical Center in Fresno with what were believed to be non-life-threatening wounds.\nThe boy’s great-aunt, Terry Hutchinson, said the family was celebrating her grand-niece’s birthday when the shots rang out.\n“My brother was coming to get his grandkids,” Hutchinson said. “We were just laughing and talking about who was going to get the bread for the hot dogs and the cake – because you know we were going to cut the ... ”\nShe stopped to compose herself. “It just happened so fast.”\nHutchinson’s shirt was covered with blood as she spoke. She used to work in at-home care, she said, so she held “her baby” to her chest and tried to apply pressure to his wounds to stop the bleeding.\n“I was just holding my baby, and I just prayed to God that he’d be OK,” Hutchinson said.\nHudson said three men were driving a silver four-door sedan around 2:30 p.m. near East Saginaw Way and North Thorne Avenue when the backseat passenger fired seven to 10 shots from an unknown caliber gun at a group of people. The boy was the only person hit, but nearby apartments were struck by gunfire.\nPolice believe the suspects specifically targeted the group, as they first passed by the complex, stopped, then turned back toward it before firing the shots.\nInvestigators do not yet know whether the shooting was gang-related, Hudson said.\nAnyone with information about the shooting is asked to call the Fresno Police Department at 559-621-7000.\nRory Appleton: 559-441-6015, @RoryDoesPhonics"}