{"uri": "http://www.kmov.com/story/32053393/infant-taken-to-hospital-following-a-north-st-louis-shooting", "title": "Man accused of fatally shooting son, kidnapping kids facing char - KMOV.com", "dct": "Wed, 25 May 2016 00:00:00 GMT", "id": "7d317c1d08851f738623a3c755e1bd66", "content": "ST. LOUIS, Mo. (KMOV.com) – The man accused of fatally shooting his son is facing multiple charges in connection with the incident.\nDiata Crockett, 35, is charged with first-degree murder, armed criminal action, unlawful use of a weapon, second-degree assault, endangering the welfare of a child and illegal possession of a firearm.\nPolice said Diata Crockett and his wife, who have six children, were driving around 1:00 p.m. Tuesday with their three youngest children inside a black Hyundai Sonata when they began to argue. During the argument, his wife stated she wanted a divorce, authorities believe.\nCrockett then became angry and allegedly struck his wife with a semi-automatic pistol with an extended clip. Crockett's wife then crawled into the backseat with the children. Crockett then said he should have killed her yesterday and that he was going to kill her herself, according to the probable cause statement.\nCrockett allegedly drove in the direction of a secluded area where he had taken his wife on past occasions. In fear of her life, Crockett's wife, with her 8-month-old baby Reign in hand, opened a car door and got out of the car.\nCrockett's wife told police she was only few steps out of the car when she heard shots and felt burning on her her arm. Authorities say Crockett shot Reign near the intersection of Hall Street and Riverview in north St. Louis. Crockett's wife then ran across the street for help and a driver took both her and Reign to a local hospital, where he was pronounced dead. Police sources told News 4 Crockett’s intended target was the mother of the children.\nAfter the shooting, Crockett allegedly fled the scene with two other children in the car, prompting an AMBER Alert. Originally a SARAA alert, which is an AMBER Alert for only St. Louis area was issued, but the alert was then expanded to a wider geographical area.\nBlaze Crockett, 3, and 2-year-old Ryker Crockett were believed to be with Crockett. They were found safe in a home in Bellefontaine Neighbors.\nCrockett’s vehicle was found at the Canfield Green Apartments in Ferguson.\nWhile Crockett was on the run, his mother urged him to turn himself in.\n\"You need to turn yourself in,\" said Diata's mother, Casetta Crockett, told News 4 Tuesday night. \"Talk to your attorney and come in ASAP. You have to set the record straight. We know you love your kids and you would never hurt them, so we know this was a horrible accident. You have to come in, if nothing else, you have to come in for your other kids.\nWednesday morning, St. Louis Police Chief Sam Dotson took to Twitter to announce that Crockett turned himself in to his lawyer, Scott Rosenblum.\nDiata Crockett is in custody after turning himself in to his lawyer. Thanks to everyone who assisted in ensuring the children's safety.\nRosenblum told News 4 he made arrangements to have Crockett turn himself in to police Wednesday morning. He also said Crockett is mourning the loss of his son.\nCourt documents show Crockett's latest felony charges in 2010 included unlawful use of a weapon, resisting arrest and forgery. In his first convictions more than 10 years ago, he received suspended sentences for burglary and tampering with a vehicle. The Department of Corrections say Crockett was sent to prison in June 2011. But by December 2011, he was let out and put on parole. Crockett violated that parole and has had a warrant out for his arrest since January 2013.\nDotson said Crockett had made suicidal and homicidal threats against himself and his family prior to the shooting. The couple was engaged in an argument that started at their home.\n\"In interviews with the mother she's talked about suicidal and homicidal threats the suspect has made towards her and towards their family,\" Dotson said Tuesday. \"This is a very serious situation. Anybody in the community, anybody in the public that has info on the whereabouts of the children or can help us located this car and take the suspect into custody it's very important for us right now.\"\nCopyright 2016 KMOV (Meredith Corporation). All rights reserved"}