{"uri": "http://www.wsoctv.com/news/local/4-shot-2-in-critical-condition-after-report-of-shots-fired-on-n-tryon-street-officials-say/476922908", "title": "4 teens shot in parking lot of northeast Charlotte nightclub", "dct": "Tue, 20 Dec 2016 13:57:00 GMT", "id": "2a541eac402809b789d01b4f6d48122a", "content": "CHARLOTTE, N.C. - Charlotte-Mecklenburg police are trying to figure out what led to a shooting that left four teenagers in the hospital late Saturday night in northeast Charlotte.\nIMAGES: 4 teens shot at Charlotte nightclub\nOfficers responded to the shooting call around 10:30 p.m. at the Spice Lounge on North Tryon Street, near Sugar Creek Road.\nInvestigators told Channel 9 that when officers arrived at the parking lot of the nightclub, they found four wounded teens.\nHuge police presence on 4100 block N. Tryon after shooting @wsoctv pic.twitter.com/atAI6GrfxQ\n— Elsa Gillis (@ElsaWSOC9) December 18, 2016\nThe victims’ ages range from 14 to 16 years old.\nAll four were rushed to Carolinas Medical Center. One was being treated for life-threatening injuries and the other three were expected to be OK, officials said.\nReporter Elsa Gillis spoke with a manager at the nearby Popeye's, Jonathon Owens, who was working when it happened.\n\"Probably like a group of 100 kids. They came swarming this way, they came to our drive-through,\" Owens said. \"They started swarming like they were about to fight.\"\nOwens told Channel 9 that he and a co-worker went outside and asked them to leave. Moments later, they heard gunshots.\n\"There was a little girl lying right over there on the sidewalk holding her face. You know it was just like pandemonium, kids running around yelling 'This person got shot, that person got shot,'\" he said.\nSpice Lounge is in a complex with a church, market and beauty shop. Some of the businesses told Channel 9 that this is not the first time the club has had problems, something Owens said has impacted their store.\n\"I guess they throw teen parties over there and whenever they get shut down the teens run up and down Tryon. They spill over into Popeye's and tear up our store,\" Owens said.\nDetectives told Channel 9 that they have charged a 16-year-old with possession of a firearm by a minor. Officers also charged an unnamed 15-year-old boy with carrying a concealed weapon, possession of a firearm by a minor and shooting in the city limits.\nBoth juveniles were at the Spice Lounge during the shooting, and police said they found a gun inside the 16-year-old's vehicle.\nOfficers told Channel 9 that the 15-year-old admitted to firing a gun into the air after the shooting occurred.\nOfficers have not said what led to the shooting but told Channel 9 that a party was being held at the club when the shots rang out in the parking lot.\nDetectives are still working to determine the identity of the suspect in the shooting.\nThe owner of Spice Lounge declined to speak on camera because of the ongoing investigation, but said he has security in place at the club and his customers should feel safe.\nRead more top trending stories on wsoctv.com:\n© 2017 Cox Media Group."}