{"uri": "http://www.wsmv.com/story/32402261/officer-shot-in-ballwin", "title": "Ballwin officer identity released after 'ambush' shooting on Friday", "dct": "Fri, 08 Jul 2016 00:00:00 GMT", "id": "83abf1d69bdaa32cf67fa48abc8dec4c", "content": "BALLWIN, Mo. (KMOV.com) – A police officer is in critical, stable condition after being shot Friday morning, according to the Ballwin Police Department.\nThe officer, identified as Mike Flamion, was shot around 11 a.m. after he pulled the suspect's vehicle over for a speeding violation in the 300 block New Ballwin Road, police said. After conversing with the suspect, identified as Antonio Taylor, Flamion walked back to his vehicle to process paperwork, at which time Taylor exited his vehicle, moved quickly towards Flamion and fired three gunshots, striking him once in the neck.\nFollowing the shooting, Taylor drove from the scene in a Blue Ford Taurus with temporary Illinois plates. Officers from several surrounding areas helped apprehend Taylor around 11:25 a.m. in the 800 block of Burgundy in nearby Manchester. Police say he was tased before he was arrested.\nA semi-automatic handgun was recovered from the scene, police said.\nA man who lives nearby said his wife saw part of what happened and helped the wounded officer.\n\"A nurse drove by and she told my wife to get a towel, so she ran in and grabbed a pillow case that’s on our stairwell ran back out and put it on his neck and stopped the bleeding,\" Ben Riley.\nSkyzoom 4 was over the scene on Burgundy Lane around 12:30 p.m. when a handcuffed man was being placed in the back of a police vehicle.\nPolice say Taylor was on probation for a a federal weapons violation. They also said his record includes a stolen car in Oklahoma and a previous weapons offense in California. Police said charges are pending against the suspect.\nDuring a press conference Friday afternoon, police said Flamion's dashcam captured the shooting. They also urged anyone with video of the shooting to give it to police to help with the investigation.\nFlamion is a nine-year veteran, seven of which he served in another jurisdiction.\nSt. Louis County Police Chief Jon Belmar said the officer was ambushed.\nThe St. Louis Police Department's Bureau of Crimes Against Persons is handling the investigation.\n2/2Thank you to the community for the outpouring of prayers &\nsupport.We look forward to the\ncont. support of the community during this time\n— Ballwin Police Dept (@BallwinPolice) July 8, 2016\nWhile police investigate the shooting, traffic is being diverted off New Ballwin at Old Ballwin and Reinke Roads.\nCopyright 2016 KMOV (Meredith Corporation). All rights reserved"}