{"uri": "http://www.cbs46.com/story/30289761/child-killed-in-accidental-shooting-in-paulding-county", "title": "Gun dropped in family's house kills Paulding County child", "dct": "Sun, 18 Oct 2015 19:13:00 GMT", "id": "d22b984b035f139e2214bb4cdf8d04e8", "content": "PAULDING COUNTY, GA (CBS46) -\nAn 8-year-old girl has died and her mother remains in the hospital following an accidental shooting inside a home in Paulding County.\nPolice responded to a home in the 400 block of Fairview Drive outside Dallas at about 5 p.m. Saturday evening.\nA handgun fired unexpectedly when it was dropped inside the house.\nThe 45-year-old mother, Marsha Lynch, told deputies the bullet went through her leg, then hit her 8-year-old daughter, Sharai Lynch, in head.\nThe child was transported to WellStar Paulding Hospital where she died Sunday. The child's mother was taken to Floyd Hospital in Rome for surgery.\nThe girl's two older sisters and one other adult were in the house at the time of the shooting. They were not injured.\nNeighbors said all three girls in the family go to Ragsdale Elementary School in Rockmart.\nAuthorities did not release any further description of their understanding about what may have happened, including how the gun fell and who dropped it.\nThey are waiting for the mother to be released from the hospital to question her further.\nCopyright 2015 WGCL-TV (Meredith Corp). All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}