{"uri": "http://www.chicagotribune.com/news/local/breaking/chi-mother-of-slain-teen-asks-what-happened-to-my-baby-20130710-story.html", "title": "Mother of slain teen: 'What happened to my baby?'", "dct": "Thu, 11 Jul 2013 07:21:00 GMT", "id": "576f23f81e952bf68bce95c1953e13f9", "content": "Two weeks have passed since a neighbor knocked on Nortasha Stingley’s door with the grim news: Her 19-year-old daughter Marissa had been gunned down just blocks from their Park Manor home.\n“I asked her, 'Where’s Marissa at, where’s my baby?' ” Stingley said, fighting back tears. “She said, 'Marissa got shot,' and pointed to her eye.”\nStingley said she talked to detectives later that day and hasn't heard from them since. Now about two weeks later, she fears her daughter has been forgotten.\n“I have done everything in my power to keep my kids safe,” said Stingley, a single mother who also has two sons, 6 and 18. “This is the one time I couldn’t. I just want to know why. What happened to my baby?”\nPolice reported no arrests as of Wednesday and could provide no description of the shooter, except that he fled in a black SUV after opening fire at another car about 2:30 a.m. on June 25 at a stoplight at 73rd Street and King Drive.\nMarissa Boyd-Stingley was one of five passengers inside that other car. She was shot in the head, and another woman, a neighbor, was wounded in the hand. Three men, one age 18 and two age 20, were also shot: One in the chest, one in the shoulder, and the other in the hand, police said. Boyd-Stingley was the only one who died.\nNortasha Stingley said she had felt something wasn't right that night and had called her daughter early that morning, worried.\n“I woke up and sat straight up in my bed and called her,” she said. It was shortly before 1 a.m. “I asked her where she was and told her I loved her and to be careful. God woke me up to tell my baby I love her one last time and I thank him for that.”\nAbout two hours later, Stingley heard banging on her first-floor window and rushed to the door, thinking it was her daughter. But it was her neighbor saying her daughter had been shot.\nThe next moments are a blur to Stingley. She remembers cursing and crying and finally screaming for the neighbor to leave her house. She could only think of what more she could have done to save her daughter.\nEarlier this year, her daughter had come home from Central State University in Ohio, concerned about her mother's health after an accident. Stingley had fallen down and was knocked unconscious, cracking her front teeth, she said.\nWhile Stingley underwent medical tests, her daughter cared for her 6-year-old brother Levell. Still, Stingley said she did not feel at ease with her daughter’s decision to come home.\n“My chest was heavy and I didn’t know why,” she said. “I didn’t like the company she was keeping. Something just didn’t feel right.”\nShe worried about a young man Marissa had met -- a man who was in the car when the shots were fired. Neighbors had warned Stingley about the man, telling her he was “no good,” she said. The man and her daughter, along with other friends, had been at the lake on the day of the shooting and were on their way home.\nNone of the people who were with her daughter that night has contacted her to share information about what led up to the shooting, Stingley said.\n“I want the people in the car to sit down with me and the police. I want to know what happened that night,” Stingley said. “Why isn’t the mayor, the governor, the first lady coming to my house for my baby? She was good, she wasn’t a criminal. She was a student. Why doesn’t anyone care?\n“I laid a foundation of morals, respect and decency for my kids,” Stingley said as she sat in her living room next to her daughter’s high school diploma. “My daughter’s only mistake was going out that night with possibly the wrong people. Did she deserve to die because of that mistake?\n“This hole in my heart is where my daughter used to be. I have to be strong, but things will never be the same.\"\nStingley busies herself with her two other children, Levell and Thomas, 18.\nLevell, at 6, doesn’t quite understand that his big sister is gone. “Marissa ran away,” he said. “I miss her. ... Please find Marissa.”\nThomas just visited Southern Illinois University at Carbondale, where he is scheduled to attend in the fall. He works filing cases at the Cook County Circuit Court.\n“Marissa was a well-rounded person,” he said Wednesday as he was leaving his job. “She cared about others more than herself.”\nThomas said he would like to know why there is so much ammunition and weapons in the street. “I think they should open a draft and send these people to the military since they like to handle weapons,” Thomas said.\nAs for the person who killed his sister, Thomas said, “I want them to come forward.”\nTwitter: @neacynewslady"}