{"uri": "http://www.wvva.com/story/33801149/2016/11/27/at-least-one-person-dead-after-shooting-in-mcdowell-co", "title": "UPDATE: Victims identified in McDowell County double-shooting", "dct": "Sun, 27 Nov 2016 20:16:00 GMT", "id": "8130ee0d2b436583842cade3da2267a6", "content": "MCDOWELL COUNTY (WVVA) -\nWe now know the name of a 16-year-old boy who was shot to death by his step-father Sunday morning in McDowell County.\nFamily members tell us Jeremy Daugherty died trying to defend his mother, Jessica, from her estranged husband, Michael Kennedy.\nThe shooting happened around 2 a.m. near Iaeger. Kennedy was taken into custody without incident in the Long Branch area of Wyoming County.\nJessica Daugherty remains hospitalized in a Kentucky medical center. Family members tell us she is fighting for her life.\nThe investigation is ongoing.\nRead full news release below:\nAccording to Senior Trooper R. W. Justus of the WVSP Welch Detachment Michael G. Kennedy, 32, of the Simon area of Wyoming County, WV, has been charged with multiple offenses to include 1st degree murder, attempted murder, malicious wounding, grand larceny, wanting endangerment, assault during the commission of a felony ,and burglary in the connection with the murder of a male juvenile and the attempted murder of the juvenile’s mother, identified as Jessica Daugherty in the Coon Branch Road area of McDowell County, WV.\nOn Sunday, November 27, 2016, at approximately 0153 hours, Trooper J. C. Woods and Trooper M. Brooks with the West Virginia State Police Welch Detachment were dispatched by the McDowell County 911 Center, to a residence in Coon Branch Road, Iaeger area of McDowell County, WV. Upon arrival, the Troopers discovered the body of a male juvenile that had succumbed to gunshot wounds inside his residence. The Troopers also located the juvenile’s mother, identified as Jessica Daugherty inside the residence also having gunshot wounds. Ms. Daugherty was transported by Jan Care Emergency Medical Services, and later flown to Pikeville Medical Center, Kentucky with life threatening injuries.\nJessica Daugherty’s estranged husband, Michael G. Kennedy fled the scene after forcibly entering the residence and shooting the victims, subsequently traveling to the Long Branch area of Wyoming County, WV.\nAfter coming in contact with law enforcement, Michael Kennedy fled on foot from Wyoming County Sheriff Deputies into a wooded area.\nMembers of the West Virginia State Police Welch Detachment, Jesse Detachment, Bureau of Criminal Investigations (BCI), and K-9 Units later apprehended and arrested Michael Kennedy in a wooded area of Long Branch. The Wyoming County Sheriff’s Office and Department of Natural Resources (DNR) Officers also assisted with the investigation.\nMichael Kennedy was arraigned in Wyoming County by Magistrate Cook, having his bond set at ($300,000) cash bound. A bond of the 1st degree murder charge is pending a bond hearing with the McDowell County Circuit Court. Michael Kennedy is currently being held at the Southern Regional Jail.\nAdditional charges are expected in this ongoing investigation. Senior Trooper R. W. Justus is the lead investigator.\n-----\nAccording to a release from WVSP, troopers responded to a domestic related shooting involving two victims in the Iaeger area around 2 a.m. Sunday morning.\nTrooper J.A. Tupper of the West Virginia State Police Welch Detachment says the victim who died in the shooting was a juvenile. The second victim, a female, was still hospitalized Sunday.\nTroopers were able to develop and identify the accused in this investigation.\nMichael Kennedy was taken into custody without incident in the Long Branch area of Wyoming County. At this time the investigation is still ongoing.\nMore stories on WVVA.com\nAccording to troopers, the shooting suspect, Michael Kennedy, has been taken into custody.\nKennedy was captured in the Long Branch area in Wyoming County.\nLocal law enforcement confirm one juvenile is dead and a female is in the hospital.\nAt least one person is dead after a shooting in McDowell County.\nAccording to local law enforcement, the shooting happened near the McDowell County and Wyoming County border sometime Sunday morning.\nDetails are still very limited at this time.\nStay with WVVA for the latest."}