{"uri": "http://www.nola.com/news/index.ssf/2015/10/louisiana_boy_12_accused_of_us.html", "title": "Louisiana boy, 12, accused of using air-pellet gun to kill man; whale-watching boat sinks (10 Things to Know for Monday)", "dct": "Sun, 25 Oct 2015 23:35:00 GMT", "id": "65d9c05b387c6a55ff3697b85bfba3bc", "content": "Your daily look at late-breaking news, upcoming events and the stories that will be talked about Monday:\n1. BOY CHARGED WITH HOMICIDE IN DEATH OF MAN FROM AIR-PELLET GUN\nA 12-year-old Louisiana boy has been booked with negligent homicide after a single shot from an air-gun pellet killed Courtney Honore, 29, of Alexandria, police said. The victim was pronounced dead at a hospital after the shooting Friday evening. The boy's name was not released because he's a juvenile, Alexandria police said. The Town Talk and KALB-TV report that the boy and man were acquainted.\n2. SUSPECT IN OKLAHOMA CRASH MAY BE MENTALLY ILL\nThe woman faces second-degree murder charges after authorities say she plowed her car into a crowd at Oklahoma State University homecoming parade, killing three adults and a toddler.\n3. WHALE-WATCHING BOAT SINKS OFF BRITISH COLUMBIA\nThe vessel was carrying 27 people and Canadian authorities are saying at least three have died.\n4. NEW CHANCE TO HEAL\nKim Phuc, who was immortalized as \"napalm girl\" in a famous AP photograph from the Vietnam war, is getting a series of laser treatments that will relieve the deep aches from her old burn scars.\n5. WHAT IS SPARED DESTRUCTION FROM HURRICANE PATRICIA\nDrenching storms that made it all the way to Texas finally clear, without leaving behind the devastation that was feared.\n6. WHOM EARLY PRISON RELEASE WILL TEST\nThe 6,000 drug felons who are set to be freed around Nov. 1 as part of a national effort to reduce some drug sentences may not receive the support they will need to re-enter civilian life.\n7. RIGHT-WING PARTY WINS POLAND'S PARLIAMENTARY VOTE\nAn exit poll shows the conservative Law and Justice party winning 39 percent of the vote, enough to govern alone without forming a coalition.\n8. TV COMIC BECOMES GUATEMALA'S NEW PRESIDENT\nJimmy Morales takes a commanding lead in the presidential runoff election in the country, where huge protests and widespread public anger over corruption help oust the last government.\n9. WHO TEAMS UP AGAINST GUN VIOLENCE\nComedian Amy Schumer and her cousin, Sen. Charles Schumer, stood in front of New York's City Hall for what they call their \"crusade on guns.\"\n10. JUSTIN BIEBER IS BIG WINNER AT MTV EMAS\nThe pop singer dominates the ceremony with five European music awards, including for best male performer, best collaboration and best look."}