{"uri": "http://www.wsbtv.com/news/officials-5-people-dead-in-2-shootings-in-georgia/236889044", "title": "Daughter says father made threats day before fatal shootings", "dct": "Sun, 24 Apr 2016 00:07:00 GMT", "id": "e10d685f56482c8b55f8e3fb81d85cba", "content": "Daughter says father made threats day before fatal shootings\n© 2017 Cox Media Group.\nATLANTA (AP) — The daughter of a northeast Georgia man suspected of shooting five people to death before killing himself says her father was a \"ticking time bomb.\"\nLauren Hawes told The Associated Press on Saturday that she, her mother Angela Dent and her 1-year-old daughter hid in a neighbor's house — barely escaping with their lives — while her father, Wayne Anthony Hawes, 50, went on a bloody rampage and killed five people, including her grandmother and cousin.\n\"He made threats before, but we never thought it would be at this capacity,\" Lauren Hawes said. \"He's been kind of a ticking time bomb if you want to put in a few words.\"\nCapt. Andy Shedd of the Columbia County Sheriff's Office said in a statement that the Friday night shootings stemmed from a domestic dispute that left three men and two women dead at two separate locations within about a mile of each other. The body of shooting suspect Hawes was recovered Saturday by authorities in his home in Appling.\nLauren Hawes, 26, confirmed that the bloodshed was connected to a domestic dispute between her parents: her mother had walked out on her father just a week ago. Angela Dent had left before — but this time, she took her possessions with her to prevent Hawes from destroying them as he had done in the past.\nAfter Dent's departure, Wayne Hawes bottomed out emotionally.\n\"He's done things that were questionable in the past, but never to this extent. This is very surprising. We thought he could possibly hurt himself, but not others,\" said Lauren Hawes.\nThe rampage began Friday evening, when sheriff deputies responded to a home at about 8 p.m. and found three victims. Authorities then were called to a second home nearby, where two other victims were found.\n\"We believe the two shootings were related based on witness accounts,\" Shedd said. When authorities reached Hawes' house and entered, they found him dead of a self-inflicted gunshot wound to the head. They also found evidence that he attempted to set the house on fire.\nThe victims were identified as Roosevelt Burns, 75; Rheba Mae Dent, 85; Trequila Clark, 31; Lizzy Williams, 59; and her husband Shelly Williams, 62. One of the female victims died on the way to the hospital, Shedd said. The others were dead at the scene.\n\"We believe some of the victims were related to the suspect's wife,\" Shedd said.\nLauren Hawes said her parents had known each since they were teenagers, and had a common law marriage.\nLauren Hawes said Rheba Mae Dent was her grandmother, and her cousin was Trequila Clark. She said her grandmother was retired and her cousin was a registered nurse, who graduated from Augusta State University in 2012. She said Roosevelt Burns was her grandmother's brother. She also said family knew the Williams family from church and while her dad wasn't much of a church-goer, he was neighborhood friends with Shelly Williams.\nOla Murry of Appling in northeast Georgia said the neighborhood is still devastated by the events. Murray said she thought Hawes was a nice guy, but he made a \"stupid\" decision.\nShe would see him around the neighborhood and he would often say hello while passing by.\n\"I always thought he was a nice guy,\" Murray said. \"I know he did what he did, but that doesn't make him a bad guy. You know, the devil gets into you sometimes and you do stupid stuff. You got to think. You always have to put the Lord in front of you, let him lead you and you won't go wrong.\"\nAn investigation is ongoing.\n___\nThis story has been corrected to fix the spelling of two of the victims' names from Kelia Clark to Trequila Clark and from Rebva Mae Dent to Rheba Mae Dent.\nCopyright 2017 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}