{"uri": "http://www.greenvilleonline.com/story/news/local/2015/01/09/callers-fatal-greenville-shooting-accident/21500719/", "title": "911 callers: Fatal Greenville shooting was an accident", "dct": "Fri, 09 Jan 2015 00:00:00 GMT", "id": "7d187dce6bcc3a551349e6390050b832", "content": "Dispatchers were unable to get any details about the circumstances surrounding the Greenville shooting.\nAt least two people at the scene of a fatal shooting in which a man was charged with murder said it was an accident, according to 911 calls obtained by The Greenville News under the state's Freedom of Information Act.\nThe Greenville County Sheriff's Office charged Guy Robert Mitchell, 17, of Hicks Road, with murder in the death of 20-year-old Tiffany Yvette Ford. She was shot once in the neck Dec. 7 at a home on Echols Drive, according to arrest warrants. Several people were inside the residence on Echols Drive when the shooting happened, the sheriff's office said.\nThe 911 calls reveal a chaotic scene, and at one point two people appeared to be on separate calls with dispatchers simultaneously.\n\"It was an accident. It was an accident,\" a male said as he was being asked about the incident.\nDispatchers were unable to get any details about the circumstances surrounding the shooting. A sheriff's office representative called the home and asked what happened and a female said \"it was an accident.\" When asked \"Where is the gun at now,\" she spoke in a quieter tone to someone at the house.\n\"I can't answer them. I don't know what to say.\"\nMultiple people pleaded with the dispatchers to hurry up, although at least one female caller was unsure about the address. When asked what happened, she said, \"I don't know. It happened too quick.\"\nAnother person was asked if the assailant was still nearby. She said yes. Mitchell turned himself in three days after the shooting. He is in jail without bond. His attorney, public defender Charles Sims Propst Jr., was not immediately available for comment Friday.\nThe owner of the house was not at home at the time of the shooting, she told dispatchers. She said her son called to tell her the shooting happened."}