{"uri": "http://wtvr.com/2016/10/18/sandston-teen-shot-to-death-playing-russian-roulette/", "title": "Sandston teen shot to death playing Russian Roulette", "dct": "Tue, 18 Oct 2016 22:59:00 GMT", "id": "d353be703e9e7799e9577256c96ad55a", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nHENRICO COUNTY, Va. -- A young man was celebrating his 18th birthday Saturday, and then was pronounced dead at VCU Medical Center on Monday.\nCourt documents reveal he shot himself playing a dangerous game of Russian Roulette.\nPolice surrounded a home on Treva Road in Sandston Saturday night after a shot rang out in a detached garage on the backside of the property.\n\"All we heard was a gun shot, and I looked back and saw Austin collapse on the floor,\" said Amber Crampton, the victim’s girlfriend.\nAccording to court documents, Austin Balcarcel was playing with a gun. He opened it, closed it, spun it around once, stuck it to his head and pulled the trigger, according to an affidavit.\nIt says when Austin pulled the trigger, the gun just clicked and his friend told him to stop. The document states Austin said, “I know how to handle a gun,” and placed the gun to his temple again.\nAustin pulled the trigger and the gun discharged.\n\"It was his and his mom’s birthday,” said Crampton. “We were inside having a good time.\"\nBalcarcel was rushed to VCU Medical Center, where his girlfriend tells us he died two days later.\n\"He was caring and sweet, especially towards his family and me,\" said Crampton.\nHours into adulthood, Austin Balcarcel played a dangerous game that ended in his death.\n\"Don't go anywhere near guns. They are nothing to joke with,\" his grieving girlfriend said Tuesday.\nPolice did a search of the detached garage and found the gun hidden in a fertilizer bag. Affidavits say Austin’s stepfather put it there.\nThe gun was a .38 caliber revolver that had been stolen during a rash of car break-ins in June."}