{"uri": "http://www.abqjournal.com/581724/news/fatal-shooting-of-17-year-old-at-skate-park-was-self-defense-police-say.html", "title": "Skate park shooting was self-defense, police say", "dct": "Fri, 08 May 2015 23:00:00 GMT", "id": "4b93157d96d037b49dffffd6208c039e", "content": "To view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nALBUQUERQUE, N.M. — A month and a half after a shooting at Los Altos Skate Park left one person dead and six injured, police told a news conference Friday afternoon that the man who shot and killed a 17-year-old at a Northeast Albuquerque skate park did so in self-defense.\nPolice said cellphone video of the encounter shows that the teen who was shot and killed, Jaquise Lewis, was one of the shooters firing at the skaters. However, they do not believe he was the first one in his group to fire shots.\nThe fight began after members of one group asked to borrow a couple of skateboards from the other group, said officer Tanner Tixier, a spokesman for the Albuquerque Police Department. The first two skateboards were returned, but when someone asked for the third back, a fist fight broke out.\nIt turned into a gunfight.\nTixier said there was no indication the shooting was race-related or gang-related.\nStills taken from a cellphone video depict many people fighting in a crowd before four muzzle flashes are seen, indicating shots were fired in the air. Two of the injured skateboarders – one wearing a yellow shirt and the other in red – can be seen in the video, and Tixier said one man in his 20s is now paralyzed and just gave his first statement to police at the beginning of the week.\n“We do believe that Jaquise Lewis was the one that fired those rounds against the other young man in yellow,” Tixier said. “We can’t see everything in the video, so we can’t say 100 percent, but we’re fairly confident that this is a picture of Jaquise Lewis shooting the individual in the yellow shirt.”\nDetectives have identified the man who they believe shot Lewis but are not pressing charges. He was not injured in the shooting.\n“We have had four meetings with the district attorneys showing them what we know at this point and showing them the full video,” Tixier said. “We’ve all come to the conclusion at this point that Jaquise Lewis was shot in self-defense.”\nTixier asked for additional witnesses to come forward with information and said detectives have mostly only been able to interview the skaters, not anyone who was part of Lewis’ group of friends.\nNo guns were recovered from the scene, he said.\nIn an autopsy report obtained by the Journal, the Office of the Medical Investigator ruled Lewis was shot in the left back and left upper arm and “the range of fire for both injuries is best classified as distant.”\nPolice said a person does not have to be facing another for a shooting to be considered self-defense.\n“He was walking back toward another group,” Tixier said. “He had already showed propensity to not only fire rounds but also threatened numerous individuals with a gun, and he was rushing back in the direction where there was a group of people.”\nLewis should not have been at the park that night, according to Larry Gallegos, a spokesman for the Bernalillo County Youth Services Center.\nLewis was under house arrest after being charged with negligent use of a deadly weapon and unlawful carrying of a handgun by a person under 19 in early March, according to his order of release.\n[photoshelter-gallery g_id=”G0000Nf2hN9XTxHM” g_name=”Los-Altos-Skate-Park-shooting-03-22-2015″ width=”600″ f_fullscreen=”t” bgtrans=”t” pho_credit=”iptc” twoup=”f” f_bbar=”t” f_bbarbig=”f” fsvis=”f” f_show_caption=”t” crop=”f” f_enable_embed_btn=”t” f_htmllinks=”t” f_l=”t” f_send_to_friend_btn=”f” f_show_slidenum=”t” f_topbar=”f” f_show_watermark=”t” img_title=”casc” linkdest=”c” trans=”xfade” target=”_self” tbs=”5000″ f_link=”t” f_smooth=”f” f_mtrx=”t” f_ap=”t” f_up=”f” height=”400″ btype=”old” bcolor=”#CCCCCC” ]\n“Being on house arrest means the CCP (community custody program) officer would have to give him permission to leave the house,” Gallegos said. “The night of the shooting, he did not call for permission to leave the house.”\nIf Lewis had requested permission to leave the house, he would have had to be accompanied by a guardian. Lewis’ grandparents were acting as his guardians. They refused requests for an interview.\nOn March 1, Lewis was at a friend’s house learning how to disassemble a gun, according to a court document filed in the 2nd Judicial District Court. Witnesses told police the gun went off and Lewis’ 14-year-old friend was struck in the buttocks by the bullet.\nLewis took off but later returned to the scene and cooperated with police, according to the document.\nHe told police he would show them where he had thrown the gun, but they were unable to find it, according to the document.\nLewis’ friend told police it was a black Ruger 9mm handgun.\nPolice have not found any of the guns fired in the Los Altos shooting, although they found casings. Tixier refused to say what kinds of guns police believe were fired.\nThe assistant district attorney who was prosecuting the charge against Lewis of negligent use of a deadly weapon wonders if there is a connection between the shootings.\n“I’m certainly wondering whether the gun used in the case I was prosecuting was the same as in the skate park shooting,” Alma Rosa Delgado said.\nAn attorney for Lewis’ grandparents said he does not believe the March 1 shooting is relevant to Lewis’s death.\n“If they’re taking the position today that suggests Jaquise Lewis died from someone acting in self-defense, give us the entirety of the evidence, let us, the community, judge this process,” said Ahmad Assed, a defense attorney representing the family. “Don’t let APD call the shots in this conversation. The African-American community deserves better; the whole community deserves better.”\nAssed said he requested all pertinent documents, including police reports, recordings and documentation of evidence from the Police Department, under the Inspection of Public Records Act. He said he was told his request was too burdensome and could not be completed at this time.\n“It’s been seven or eight weeks since this young man died, and we don’t have anyone charged in this process,” Assed said. “They presented an opinion based on certain photos, I want to be able to look at the entire video.”\nTixier said police are not showing the full video at this time in the hopes that some of the people identified in the stills will come forward as witnesses.\n“If we show the video, there will be no way for us to corroborate if what they told us is accurate, or if they’re just reciting back what they saw in the video,” he said. “We need to hold it so we can compare their statements to us with it.”"}