{"uri": "http://www.wral.com/reports-shooting-shuts-down-sanford-christmas-parade/16310374/", "title": "Man faces attempted murder charge; 2 shot at Sanford Christmas parade", "dct": "Mon, 05 Dec 2016 00:00:00 GMT", "id": "b14cae2e21ce26be2ff1a4cbaab058b1", "content": "Video Playback Not Supported\nPlay Video\nPlay\nMute\nCurrent Time 0:00\n/\nDuration Time 0:00\nLoaded: 0%\nProgress: 0%\nStream TypeLIVE\nRemaining Time -0:00\nPlayback Rate\n1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptions\nFullscreen\nAutoplay:\nOn / Off\nThis is a modal window.\nThis video is not supported on your platform. Please make sure flash is installed.\nCaptions Settings Dialog\nBeginning of dialog window. Escape will cancel and close the window.\nText Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps\nDefaults Done\nStore owner heard '7 or 8 shots' at Sanford Christmas Parade\nAre you still watching?\nYes, ContinueNo\nFind News Near Me\nSanford, N.C. — Two people were injured when shots were fired during the Sanford Christmas Parade Monday night.\nPolice said Sean Dimitrius Matthews, 18, of Sanford, was in critical condition at UNC Hospitals with gunshot wounds to his stomach, arms and leg. Jadakis Tysor, 16, of Sanford, was hit in the arm by a bullet and was treated and released.\nSgt. Vincent Frazer with the Sanford Police Department said officers chased and caught Deion Jamille Johns, 20, of 1508 Westover Drive. Police believe Johns shot both men, and they charged him with attempted murder, assault with a deadly weapon inflicting serious injury, discharging a firearm within city limits, possession of a weapon at a parade and going armed to the terror of the people.\nJohns was jailed under a $360,000 secured bond.\nMany witnesses said that, at the time of the incident, a motorcycle caravan was going by in the parade and revving their engines, so bystanders did not immediately realize what had happened because of the noise.\nAbdo Alwahishi, the owner of the Rite Stop Shop convenience store near the intersection of Wicker Street and Gulf Street, said he was outside telling a group of men blocking his door to move to another location when he heard shots ring out. He believed the incident occurred in the parking lot in front of his store.\n\"I heard about seven or eight gunshots. I was standing at the door and as soon as I came in the store, before I even hit the counter, that's when I heard the gunshots,\" he said.\nPolice have taken surveillance video from the Rite Stop Shop as part of their investigation, Alwahishi said."}