{"uri": "http://www.wbtv.com/story/33930616/two-teens-shot-man-arrested-at-nc-christmas-parade", "title": "Two teens shot, man arrested at NC Christmas parade", "dct": "Tue, 06 Dec 2016 13:01:00 GMT", "id": "dbd058a10f2615a88823d56f7e05df71", "content": "SANFORD, N.C. (WNCN) -\nTwo teens were hurt in a shooting in Sanford along the town’s Christmas parade route Monday night, officials said.\nThe shooting, which forced the parade to end early, happened at Wicker and Gulf streets in the Rite-Stop grocery store parking lot around 7:50 p.m.\nPolice say they have arrested 20-year-old Sanford resident Deion Jamille Johns, who is now facing one count of attempted murder. He was placed in Lee County Jail under a $360,000 secured bond with a first court appearance scheduled for Tuesday.\nOne victim, 18-year-old Sean Dimitrius Matthews, of Sanford, was found suffering from several gunshot wounds to his lower abdomen area, arms and leg. He’s now recovering at UNC Hospital in Chapel Hill and he’s listed in critical condition.\nA 16-year-old Sanford boy, Jadakis Tysor, was also struck by a bullet and is now being treated for injuries to his arm. Johns has been charged with one count of felony assault with deadly weapon inflicting serious injury in connection with the shooting.\nHe was also charged with three misdemeanors, including discharging a firearm within city limits, possession of a weapon at a parade, and going armed to the terror of the people.\nThe owner of Rite-Stop said he watched his store’s surveillance video that showed a man walking up to a group in front of the store and firing shots as parade floats went by.\nThe store owner, Abdo Alwahishi, later released the video to CBS North Carolina.\n“It was scary. Cause everybody was nervous and as soon as they heard the gunshots, people were running inside the store and people were running out,” Alwahishi said of the shooting scene. “People were also running in the other direction hoping that the bullet wouldn’t hit them.”\nJust six seconds after the shooting, police officers who were stationed along the parade route swarmed the parking lot, the surveillance video showed.\nThe town’s annual Christmas parade was set to begin at 7 p.m. Monday evening and much of its route led along Wicker Street."}