{"uri": "http://www.deseretnews.com/article/865594341/5-found-dead-in-Spanish-Fork-home-suspected-murder-suicide.html", "title": "5 dead after officer kills family in Spanish Fork", "dct": "Fri, 17 Jan 2014 09:10:00 GMT", "id": "bb849eb92a0c61f7b74bd00b7006c0c8", "content": "Kelly Boren, right, and her son Joshua \"Jaden\" Boren were shot and killed by their husband and father, Lindon police officer Joshua Boren according to Spanish Fork police. Boren also shot and killed his daughter and mother-in-law before killing himself on Thursday, Jan. 16, 2014, according to Spanish Fork police. Boren, 34, Kelly Boren, 32, Joshua Jaden Boren, 7, Haley Boren, 5, and Marie King, 55, were found dead inside a house at 37 N. 630 West in Spanish Fork where they all lived.\nKelly Boren, right, and her son Joshua \"Jaden\" Boren were shot and killed by their husband and father, Lindon police officer Joshua Boren according to Spanish Fork police. Boren also shot and killed his daughter and mother-in-law before killing himself on Thursday, Jan. 16, 2014, according to Spanish Fork police. Boren, 34, Kelly Boren, 32, Joshua Jaden Boren, 7, Haley Boren, 5, and Marie King, 55, were found dead inside a house at 37 N. 630 West in Spanish Fork where they all lived.\nSPANISH FORK — A shocking discovery was made late Thursday at a home where police believe a police officer shot and killed his wife, two young children and his mother-in-law, before killing himself.\nIt was the second murder-suicide in Utah involving parents killing their children in just two days.\nThe bodies of Kelly Boren, 32, Joshua “Jaden” Boren, 7, Haley Boren, 5, and Marie King, 55, and officer Joshua Boren, 34, were found Thursday night inside a Spanish Fork house at 37 N. 630 West where they all lived.\n\"We're a small department. Our families are one big family, so we knew his entire family as well. Just a tremendous shock to our entire organization,\" said Lindon Police Chief Cody Cullimore.\nJosh Boren was a Lindon police officer and had previously worked at the Utah County Sheriff's Office.\n\"He was well-liked, had a lot of friends at the sheriff's office,\" said Utah County Sheriff's Sgt. Spencer Cannon. \"He was a big guy, just solid as a rock muscle guy. But just a teddy bear is how I would have described him. Just a mild-mannered personality.\"\nBut Cannon said that image of the hulking teddy bear is now gone as officers try to deal with the shock of hearing about Boren's apparent horrific actions.\n\"How we knew him suddenly fades into the distance because of the heinous nature of what he has apparently done. How do you talk about Josh as a good person, and all the good things that he did and all the good work he did and the good deputy that he was, when he appears to have done something that is almost unexplainable. I mean, how do you wrap your mind around killing your wife, your two children, and your mother-in-law? You just can't,\" Cannon said.\n\"Suddenly, it just seems inappropriate to talk about him as a good deputy. It would be inappropriate to talk about the good things that he does when there is a family out there now suffering at the tragic and senseless loss of a mother and daughter and cousins and grandchildren. That's where the focus needs to be because that's where the real tragedy lies. There are four innocent victims who have died for no reason at all.\"\nNeighbors of the family shared in the disbelief expressed by law enforcement.\n\"The kids came over and played with our kids all the time, and I would always see them at the gym and would always wave to Kelly and Josh,\" said neighbor Brian Sloan. \"You feel sad for the kids and it is kind of weird, you see see this on TV and now it happens to a neighbor.\"\n\"We decided saying a prayer for the rest of the family was best,\" added neighbor Nadine Meyer. \"This is a very close-knit neighborhood, and we take care of each other. But when they are all gone, there is no one to take care of, which is difficult to deal with.\"\nBoth Cullimore and Cannon said they were aware of marital problems between Josh and Kelly Boren.\n\"I was aware there had been a brief set period of separation. I was not aware of any violence in the past or anything like that. Again, his wife, Kelly, was a friend of mine, a friend of my wife. So anything major that would have happened, I would have known about,\" Cullimore said.\nKelly Boren had worked in the Human Resources Department for the city of Bluffdale since August. Prior to that, she was the finance director for the town of Vineyard for six years.\nSpanish Fork police, who are investigating the killings, said Friday they believe that martial contention led to Boren shooting his family.\nThe first sign of trouble came Thursday night when Boren was scheduled to be at work at 10 p.m. When he hadn't arrived by 11 p.m., officers were sent to his house to do a welfare check.\n\"They were just concerned he hadn't arrived for work,\" Spanish Fork Police Chief Steven Adams said. \"If an officer is supposed to be on duty at 10 o'clock, he should be there at 10 o'clock. It might not be that in other businesses or employment. But if an officer doesn't arrive on duty at the time he's assigned, there's something amiss.\"\nWhen officers arrived at the home, they looked through the windows. The lights were on and the front door was unlocked.\nThrough the window, the officers could see blood on the carpet, shell casings, a handgun and even a slug, Adams said. After officers entered the home, they discovered \"a large quantity of blood on the stairway leading to the second floor of the residence.\"\nThe mother-in-law was found deceased in one upstairs bedroom, and the four others in another.\nThe last known phone contact with the Boren family was about 4:30 p.m. Thursday. That phone call was not of a distressed nature, Adams said. Police have never been called to the Boren house for a domestic call or complaint of any kind, he said. The family apparently had lived there for four or five years.\nPolice said neighbors did not report hearing any gunshots.\n\"This is a tragedy in anybody's life, whether you're in law enforcement as Joshua is, or not. Many of my officers that went on the scene are having a hard time with it. The things that go through their minds, asking the question that can't be answered, which is 'Why?'\" Adams said.\nAdams declined to say what evidence led detectives to believe Josh Boren killed his family before shooting himself. \"There are specific things we believe have happened in the home, those specific things I'm not going to get into today\" he said.\nPolice noted, however, that no suicide note was found.\nAdams said investigators would likely be going through the house for a couple of days collecting evidence. However, the biggest question may never be answered.\n\"We hope to gain an understanding at some time of all the things that were going through Josh's mind, but I'm certain we'll not be able to do that,\" the chief said.\nThe children, Josh and Haley, attended the American Leadership Academy charter school in Spanish Fork. The Nebo School District sent crisis counselors over to the school to assist students at the school Friday. The district also sent counselors to Spanish Fork Elementary School, even though the children never attended that school, to help other young students who may have heard the news.\nOn Kelly Boren's Facebook page, she posted an old picture of her children on Thursday. There are several pictures of her and her children enjoying a trip to Southern California and Disneyland at the end of December.\nDespite their known marital problems, Cannon said there was never a hint of potential violence on the part of Josh Boren.\n\"There was no indication to anybody this was going to happen. A number of people knew he was having struggles in his marriage, but that's not uncommon. People in all professions, in all areas of life, some have struggles with their marriages,\" he said. \"There was nothing going on that rose to the level of concern that anything bad in any way might happen.\"\nJosh Boren was hired by the Utah County Jail as a corrections officer in 2006. He worked several jobs, including as an animal control officer at one point. He left the jail to become a patrol officer for the 15-member Lindon Police Department in October. But he also continued to work at the jail part time. He was selected from a field of 70 qualified applicants to fill the Lindon position.\nUtah County offers an employee assistance program for anyone who is having problems at home or feeling stress, Cannon said. Employees can talk to counselors and their conversations will be kept confidential from their employer, unless the employee confesses illegal activity, he said.\nThe tragedy in Spanish Fork is the second incident in less than a week of a parent killing other members of their family before taking their own life.\nOn Tuesday, Kyler Ramsdell-Oliva, 32, shot her two daughters, Kenadee Oliva, 13, and Isabella Oliva, 7, in their Syracuse home before killing herself.\nThe mother had just broken up with her fiance and told him to leave their home. Close friend Pegi Butler said Ramsdell-Oliva had fought depression, but things in her life had improved in recent years. She confessed to Butler that she still loved the man deeply but was heartbroken. Still, Butler never suspected she or the girls were in any danger when they spoke on Sunday.\nIn 2013, the Deseret News counted seven incidents of domestic-related murder-suicides where anger, jealousy or depression appeared to be motivating factors. In 2012 there were four, according to statistics kept by the Deseret News.\n\"What's really important, I think, for folks to understand is that these really tragic incidents rarely happen in isolation. Often times there may be some other things that are happening. People may be feeling extremely desperate, depressed, they may have made threats to hurt themselves or other people in their family,\" said Kendra Wyckoff, interim director of the Utah Domestic Violence Council.\nWyckoff said it was important for those threats to be taken seriously.\nAs to why some people kill their children in addition to their significant other before killing themselves, she said she didn't have a good answer.\n\"Clearly, people are in a desperate place. We need to help people understand there are resources available. There is help.\"\nThere are two suicide hotlines in the state for people to get help.\nThe National Suicide Prevention Hotline, 1-800-273-8255, operates 24 hours a day. The Utah Domestic Violence LINKLine is 1-800-897-LINK (5465).\nContributing: Shara Park, Sam Penrod\nTwitter: DNewsCrimeTeam"}