{"uri": "http://wsvn.com/news/local/shooting-leaves-1-juvenile-injured/", "title": "Teen shot in head in Pembroke Pines home; 1 in custody", "dct": "Wed, 01 Jun 2016 00:00:00 GMT", "id": "877239ae97dc7e62b0a706b247f85ff3", "content": "PEMBROKE PINES, Fla. (WSVN) — A teenage boy was taken into custody in connection to a shooting inside a Pembroke Pines home that left a 15-year-old boy with a gunshot wound to the head, according to police, Wednesday.\nAccording to Pembroke Pines Police, the victim was shot on the 8200 block of Northwest 10th Street, just after 12:30 p.m.\nThe teen was transported via ground rescue to Joe DiMaggio Children’s Hospital in Hollywood. According to officials, he was conscious and alert during transport.\nOfficials said there was no exit wound in the victim’s head, so it remains unclear whether the teen was shot or grazed.\nOfficials said the teen is alive. He is in guarded condition, and may have sustained skull fractures.\nArea residents said this is a quiet neighborhood, and they are surprised by the shooting. “I didn’t hear anything,” said a man who lives near the home, where the shooting took place. “From what I gathered, there were some shots fired, but I was in my house, and the shots were inside that house, so I didn’t hear nothing.”\n“I live a few houses east of the ruckus, and I came outside and saw a barricade and a big truck, and it kind of freaked me out,” said Netta Nicosia.\nPolice are attempting to determine the circumstances behind the shooting and where the teens may have gotten the gun. Detectives are interviewing the 16-year-old teen who was taken into custody.\n“I believe that schools should start teaching gun safety,” said Nicosia. “I mean, if they’re gonna teach sex education, why can’t they teach gun safety instead of having all these accidents?”\nNeighbors said the family who lives in the home where the shooting took place had recently moved into that residence and described them as nice, hardworking people. Officials have not disclosed the teens’ identities, and it remains unknown whether police have been able to notify the victim’s parents.\nCopyright 2017 Sunbeam Television Corp. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}