{"uri": "http://www.thisweeknews.com/content/stories/whitehall/news/2015/07/27/police-beat-boy-accidentally-shoots-himself-at-city-park.html", "title": "Whitehall: Boy accidentally shoots himself at city park", "dct": "Sat, 28 Jan 2017 13:11:54 GMT", "id": "5f85c9154dc809e562607ec44e3caa41", "content": "Whitehall police reported a 17-year-old Columbus boy apparently shot himself by accident July 18 at Robinwood Park.\nWhitehall police reported a 17-year-old Columbus boy apparently shot himself by accident July 18 at Robinwood Park.\nPolice were called to Mount Carmel East Hospital at 5 p.m. July 18, where the boy was being treated for a gunshot wound to the leg that was not life-threatening.\nThe boy told police he was playing basketball at Robinwood Park when a group of people he was unable to describe approached his group. The boy further stated he was not familiar with the area and that someone from the group \"shot in his direction\" for an unknown reason.\nPolice reported the suspect's account was not credible and upon further questioning, the boy said he was with several friends and was smoking marijuana, and a gun \"just went off in his pocket.\"\nOthers tried to patch the gunshot wound at a Beechwood Road residence before an adult there determined the boy needed to go to a hospital, according to reports.\nThe adult dropped the boys at the emergency room and said they were \"grown enough to handle (it) on their own,\" reports said.\nColumbus police were unable to locate the boy's parents, according to reports.\nIn other recent Whitehall police reports:\n* Burglaries were reported at 9:10 a.m. July 17 in the 400 block of Erickson Avenue; at 10:30 a.m. July 20 in the 3700 block of East Broad Street; at 4:25 p.m. July 20 in the 800 block of South Hamilton Road; and at 4:55 p.m. July 21 in the 100 block of Woodcliff Drive.\n* Police reported a robbery at 1:35 a.m. July 21 in the 100 block of Fairway Boulevard.\n* Thefts were reported at 7:20 p.m. July 20 in the 4000 block of Ural Avenue; at 9:45 a.m. July 21 in the 4400 block of East Broad Street; and at 12:10 a.m. July 22 in the 4600 block of East Broad Street.\n* Assaults were reported at 2:45 a.m. July 17 at an apartment in the 400 block of South Hamilton Road; at 2:25 a.m. July 18 in the 3800 block of East Main Street; at 4:20 p.m. July 19 in the 100 block of Woodcliff Drive; at 5:20 p.m. July 20 in the 4600 block of East Main Street; at 9:20 p.m. July 20 at Beechbank and Beechtree roads; and at 3:45 p.m. July 21 in the 400 block of Wolfe Avenue.\n* Vehicles were reported stolen at 12:05 p.m. July 17 in the 200 block of South Hamilton Road; and at 5:55 p.m. July 21 in the 3700 block of Elbern Avenue.\n* Police responded to a report of shots fired at 9:25 p.m. July 17 at Robinwood Avenue and Beechbank Road.\n* Property destruction was reported at 7 p.m. July 19 in the 4000 block of Beechbank Road; at 9:45 p.m. July 19 in the 5300 block of Great Oak Way; at 4:10 p.m. July 20 in the 4400 block of Poth Road; at 8:30 p.m. July 20 in the 4500 block of East Main Street; at 12:25 p.m. July 21 in the 3900 block of Beechbank Road; and at 10:30 a.m. July 22 in the 4000 block of Ural Avenue."}