{"uri": "http://www.cleveland.com/metro/index.ssf/2016/11/investigation_into_spate_of_sh.html", "title": "Investigation into spate of shootings lead to SWAT standoff, arrest", "dct": "Mon, 14 Nov 2016 18:01:00 GMT", "id": "33e06f56942e41bc6209b9befa4bc7a4", "content": "CLEVELAND, Ohio -- A man that investigators say is part of a group of men tied to a series of shootings, including an attack on an Oakwood police officer, was arrested Monday after a short chase with Cleveland police.\nThe arrest preceded another police chase and SWAT standoff that touched off a swarm of police activity on the city's East Side that ended in the arrest of Brico Allen, 20.\nThe incident started about 1:30 p.m. Monday, when officers spotted a man driving an SUV that police identified as being part of the group and possibly Allen.\nThe officer tried to stop SUV, which led to a short chase. The man crashed the SUV into a utility pole near intersection of Signet Avenue and East 123rd Street.\nThe man ran into a home in the 12500 block of Signet. Officers followed and called for a SWAT team when the man didn't emerge from the house. Ten people inside the home came outside. They were handcuffed and eight were later released.Two were arrested on unrelated warrants.\nThe SWAT team called for Allen to emerge from the home about 2:30 p.m. The SWAT team entered the home with a police dog shortly after and no one was found inside the home.\nAbout the same time, officers spotted Allen driving a stolen car on East 137th Street. He led police on a short chase and crashed into a building on East 142nd Street and Kinsman Avenue.\nPolice arrested Allen and found a loaded gun inside the car.\nAllen and a group of about three others are being investigated in connection with a string of shootings in the neighborhood, including the shooting of a 19-month-old girl. The girl was shot in the shoulder while riding in a car on Oct. 31 on East 177th Street and Harvard Avenue.\nA group of men, including one wearing a Joker mask, fired several shots at the car, hitting the girl and a 19-year-old man.\nAllen is also accused of stealing an Oakwood Village police officer's cruiser after the two fought during a traffic stop, according to U.S. Marshals.\nThat incident happened about 11 a.m. Nov. 1 on Lee Road near South Miles Road and left the officer with injuries to both legs. The officer used his stun gun on Allen, but Allen grabbed the stun gun and used it on the officer. He jumped into the cruiser and drove off.\nOfficers recovered the stolen police cruiser after the man ditched it on Cloverfield Avenue in Cleveland.\nTo comment on this post, please visit our crime and courts comments page."}