{"uri": "http://www.toledoblade.com/Police-Fire/2016/08/14/Police-seek-details-in-fatal-shooting-in-central-Toledo.html", "title": "Police seek details in fatal shooting in central Toledo", "dct": "Sun, 14 Aug 2016 00:00:00 GMT", "id": "2916a03d44111e8dcc012bfbae7d92bb", "content": "A Toledo teenager was shot and killed early today while riding his bicycle in the central city.\nDesmont Kendall, 17, was shot around 1 a.m. at Nesslewood and Scottwood avenues, where his aunts and cousins gathered hours later to mourn his death. Toledo police are investigating the incident as a homicide, the city’s 14th this year.\nHis aunt, Kisha Gary, who lives one house away from the corner where the shooting took place, said she came home from work Saturday night and then heard one gunshot sometime after midnight.\n“He was on his bike, right here,” she said, of the residential neighborhood.\nRELATED CONTENT: The Blade 2016 Homicide Report\nDesmont lived roughly a mile away, near Willys Parkway, with his father, she said. He often visited the area where his aunt lived, just a block from West Central Avenue.\n“It’s pretty quiet, a few little things happening but nothing having to do with us,” Ms. Gary said. “It’s pretty quiet here right now.”\nHis aunts and cousins remembered Desmont as a “quiet” and “cool” teen who wanted to be a rapper. He had made a couple of songs, his family said.\nHe had attended Glass City Academy, a Toledo dropout prevention school, and had one test to pass before he graduated, Ms. Gary said.\nHe graduated eighth grade from Horizon Science Academy, his aunt, Teshauna Isaac, said.\nDesmont played multiple sports as a youngster, including football, and used to box, his aunts said.\nMs. Isaac and Ms. Gary are the sisters of Desmont’s mother. He had a brother on his dad’s side and five younger siblings on his mother’s side, his aunts said, and he liked his big brother role.\nThe teen was pronounced dead at the scene, according to police. Police have not released any additional information about the incident, and a sergeant could not be reached for comment.\nHis death is the 15th homicide in Toledo’s metro area this year.\nAuthorities ask anyone with information to call Crimestopper at 419-255-1111.\nContact Vanessa McCray at: vmccray@theblade.com or 419-724-6065, or on Twitter @vanmccray."}