{"uri": "http://dfw.cbslocal.com/2013/10/10/witness-comes-forward-in-quadruple-homicide-in-paris-texas/", "title": "Witness Comes Forward In Quadruple Homicide In Paris, Texas", "dct": "Thu, 10 Oct 2013 08:49:00 GMT", "id": "59a14d5303222047030a45f386740d4f", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nUPDATED: 9 P.M.\nPARIS, Texas (CBSDFW.COM) – Four people were shot and killed in the northeast Texas city of Paris late Wednesday night. Police have not received any tips from the community, which they say is highly unusual, especially considering the number of people murdered.\nAccording to Chief Bob Hundley Jr. with the Paris Police Department, a female called shortly before 11:30 p.m. to report that someone was bleeding at a home in the 400 block of Northeast Sixth Street. When authorities arrived at the scene, four victims were found dead toward the front of the home, all with gunshot wounds. The female 911 caller had come by the house to visit one of the male victims.\n“This was a pretty violent situation. I’ve been a police officer here for 39 years . I can’t recall any multiple homicides that we’ve had,” said Chief Bob Hundley.\nThe victims were identified as 18-year-old Romello Dewain Steward of Paris, 21-year-old Devante Larry Adkins of Paris, 24-year-old Brijonne Rashad Woods of Paris and 32-year-old Billy Charles Carey of Garland. Denise Powell, an assistant pastor at Mt. Pisgah Baptist church knew victim Romello Steward as a child.\n“At vacation bible school they were just normal kids, ready to learn probably a lot more than they were learning but they never gave us any problems,” she said.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nThe potential for this being a murder-suicide case has been ruled out by crime scene detectives. Police are treating the case as a homicide, but have not given any information about possible suspects or witnesses at this point.\n“The only thing I could say to ease the concern of the community is that it doesn’t appear to be a random act of violence that you would think the community would be concerned about,” Cpt. Danny Huff, an investigator with the Paris Police Dept.\nThe investigation found that two other men were at the home at some point on Wednesday night. One of those men has been arrested on an unrelated charge. The other man has been interviewed by authorities.\nParis is located about 100 miles northeast of Dallas. The city is home to around 25,000 people. Pastor JWT Spies said he’s been in touch with the victims families.\n“They are devastated. They are hurt. They are baffled by what has taken place,” he said. “To me this is unheard in a small town like this.”\nOfficer Joe Harn with the Garland Police Department confirmed that Carey had a criminal history dating back to 1995, with arrests for theft, assault, burglary and marijuana possession. Most recently, in January of this year, he was taken into custody for traffic violations.\nThe Texas Rangers are also assisting with the investigation but police are struggling to establish a motive. Anybody with information about this case is urged to call the Paris Police Department immediately at 903-784-6688 or Lamar County Crime Stoppers at 903-785-TIPS.\nLatest News:\nTop Trending:"}