{"uri": "http://www.nbcdfw.com/news/local/Paris-Police-Investigating-Quadruple-Homicide-227221721.html", "title": "Paris Police Investigating Quadruple Murder", "dct": "Thu, 10 Oct 2013 00:00:00 GMT", "id": "dd67b94d3496b030533ee2a07e3dce63", "content": "The bodies of four men were found inside a home in Paris Wednesday night after two women called 911 reporting a shooting and someone bleeding.\nThe Paris Police Department said they received the callsat about 11:23 p.m. and that officers and EMS first responders arrived at the home on the 400 block of NE 6th Street just moments later. (One of the calls can be heard here).\nInside they found the bodies of four men, all in a front room, dead from apparent gunshot wounds.\nPolice identified the victims as 18-year-old Romello Dewain Steward, 21-year-old Devante Laray Akins, and 24-year-old Brijonne Rashad Woods, all from Paris. Additionally, 32-year-old Billy Charles Carey, of Garland, was identified as a victim. Autopsies have been ordered for each of the men.\nInvestigators said there were two other unnamed men in the house at some point during the evening. Police interviewed one of the men, while the second was arrested on an unrelated charge.\nPolice investigators worked overnight, processing the complex crime scene until about 8 a.m. Thursday.\nIn an afternoon news conference Thursday, officials said they were in the early stages of the ongoing, active investigation and that they had little new information to share about the homicides other than that they believe the shootings were not a random act of violence and that one of the victims lived at the residence.\nWhen pressed for more information, officials would not say if the men were executed or if they had any defensive wounds. Also, police have not revealed or established a motive and investigators refused to speculate on what may have led to the slayings.\nAnyone with any information regarding the incident is encouraged to contact the Paris Police Department at 903-784-6688 or Lamar County CrimeStoppers at 903-785-TIPS. Tipsters may remain anonymous and are eligible for a $1,000 reward."}