{"uri": "http://www.whio.com/news/news/crime-law/dayton-police-investigate-reported-shooting/nqLZX/", "title": "Police: No 911 call from home where teen shot in head", "dct": "Sun, 07 Feb 2016 00:00:00 GMT", "id": "ab34d17628167ed019516af8b8ffbcb0", "content": "Dayton police said a teenager is in critical condition after being shot in the head in the 1200 block of Rosedale Drive Sunday night.\nVictim is 15-year-old girl\nVictim, 4 other children home alone at time of shooting\nUnknown where children got weapon\nUPDATE @ 3:21 p.m. (Feb. 8)\nDayton police said in a statement Monday, they believe this shooting to be accidental.\nPolice were called to Good Samaritan Hospital just before 9 p.m. Sunday after the shooting victim was taken to the hospital by a family member.\n“The initial investigation by Dayton homicide detectives determined there were five children between the ages of 9 and 15 years old at the Rosedale Avenue home when the shooting occurred,” reads the police statement. “The gun was kept in the house by the family. The children’s parents were not at the home at the time of the incident.”\nUPDATE @ 2:49 p.m. (Feb. 8)\nDayton police and area hospitals have released little information into the shooting a 15-year-old girl inside her home. Law enforcement did say there were no 911 calls from the home following the shooting.\nSunday evening, the teenage girl was critical at Cincinnati Children’s Hospital Medical Center. Today, hospital officials won’t say whether she’s listed as a patient, citing privacy laws.\n“I’m just saddened for the family because it’s a tragedy that happened,” said neighbor Pamela Osborne. “I’ve never seen anything (there). The kids are playful and they’re respectful.”\nOsborne said she doesn’t believe a shooting like this was intentional or done on purpose.\n“We see them a lot and we wave, and the kids … they’re friendly,” Osborne said. “I just want to send my love and prayer out to the family.”\nUPDATE @ 11:10 a.m. (Feb. 8):\nThe 15-year-old girl critically injured in a shooting in the 1200 block of Rosedale Drive has been identified as Quataija Shavers.\nWe checked with Cincinnati Children’s Hospital and they could not release any information on Shavers.\nINITIAL REPORT:\nOfficers were dispatched around 8:50 p.m. after the girl was driven to Good Samaritan Hospital by her father. The girl has since been transported to Cincinnati Children’s Hospital by CareFlight and is listed in critical condition, according to officers.\nSgt. Gordon Cairns said the girl along with four other children were home alone at the time of the shooting, but officers are not sure who pulled the trigger.\nHomicide detectives are investigating the scene, including interviewing the children in the home, but Cairns said it’s likely all the children will be released to their parents tonight.\nPolice said investigators are still gathering the facts of the case and no charges have been filed to any children or parents.\nCairns said its also unknown where the children obtained the weapon from."}