{"uri": "http://www.kwch.com/content/news/Early-morning-shooting-402852086.html", "title": "Teen charged in shooting death of 15-year-old", "dct": "Fri, 25 Nov 2016 10:15:00 GMT", "id": "659388761adcde7d77bec86b066d1aa3", "content": "WICHITA, Kan Update 11-29: The Sedgwick County District Attorney's Office says a 15-year-old arrested in the Thanksgiving Day deadly shooting of 15-year-old Jimmy Shopteese is facing charges in juvenile court.\nThe charges include felony charges of first-degree murder and attempted aggravated robbery and a misdemeanor charge of possession of marijuana.\nAccording to jail records, 26-year-old Darian Lee Freeman the unidentified 15-year-old were arrested for felony murder.\n------\nUpdate 11-28-- 5 p.m.: Police say the Thanksgiving morning shooting that killed 15-year-old Jimmy Shopteese appears to be drug-related.\nPolice arrested two suspects in the case and are looking for a third. They say the shooting appears to be connected to marijuana and advise anyone who knows anything about the crim to call police.\n-----\nUpdate 11-26-16 10:12: Wichita Police release the name of the man arrested in connection to the murder of 15-year-old Jimmy Shopteese. According to jail records, 26-year-old Darian Lee Freeman and another unidentified 15-year-old were arrested for felony murder.\nJimmy's family is raising money for his memorial fund. If you would like to donate, click on the link in this story.\n----------------------------------\nWichita Police Chief Gordon Ramsay says two people have been arrested in the shooting death of a 15-year-old boy.\nPolice say a 26-year-old man and a 15-year-old boy were arrested on Felony Murder charges.\nAccording to police, the 15-year-old victim and his 13-year-old friend arranged to meet acquaintances in a parking lot in the 1900 block of E. Pawnee.\nOnce they met in the lot, police say a 26-year-old man shot the teen one time in the back with a handgun.\nAs a result of their investigation, police were able to locate and arrest that 26-year-old man on one count of felony murder. Police also arrested a 15-year-old male on the same charge for his role in the incident.\nPolice say they are still investigating the case.\nFamily identified the 15-year-old as Jimmy Shopteese.\nHis mother, Crystal Weers, said they are raising money for Jimmy's funeral and burial.\nWeers said the owner of Wichita Clothing Company has offered to donate proceeds from the business to her family. She said over the next two weeks, people who buy from the company will be donating to service needs for Jimmy. You can visit the business website here.\nThe GoFundMe page Jimmy's family made can be found here.\n\"It makes me feel really good knowing that Jimmy was so loved,\" Weers said.\nThe mother has also been concerned about people judging Jimmy and her family. Weers said she is a good mother.\n\"Should I have been awake at 1:30 watching the door? No,\" Weers said. \"I trust my son. I didn't know he was out that late.\"\nShe said Jimmy was a good kid who was respectful.\n\"I'm sure it was arranged for them to meet,\" Weers said. \"I'm pretty sure they were selling something.\"\nWeers said regardless of what happened, she doesn't want people to judge her or Jimmy.\nThe family will be having a candlelight vigil Saturday night at 7:30 p.m. It will be at 1909 East Pawnee, Wichita, KS 67211.\n----\nWichita police say a 15-year-old boy has died after being shot early Thursday.\nFamily members have identified him as Jimmy Shopteese, a student of South High School.\nOfficers were called to a report of a shooting at the Burger King in the 1900 block of E. Pawnee.\nThere, police contacted a 13-year-old boy who said that he and a 15-year-old male were confronted by three people in the parking lot of The Lost Sock laundromat across the street.\nHe said one of the guys pulled out a handgun and shot the 15-year-old one time.\nThey ran across the street to Burger King to call for help. The 15-year-old collapsed at the restaurant. He was take to the hospital where he later died.\nPolice do not have much information on the suspects, three black males in a silver four-door vehicle.\nAnyone with information is asked to call 911.\nJimmy's family is raising money for his memorial fund. You can visit this GoFundMe page if you would like to donate to the fund: https://www.gofundme.com/memorial-for-jimmy-shopteese"}