{"uri": "http://www.kake.com/story/33787110/18-year-old-dies-following-shooting-in-south-wichita", "title": "Two arrested in shooting death of Wichita teen", "dct": "Thu, 24 Nov 2016 08:21:00 GMT", "id": "e2fb84ca59e5b60d723afb602ab74610", "content": "WICHITA, Kan. (KAKE) -\nWichita Police said two suspects have been arrested in the Thanksgiving shooting death of a 15-year-old boy.\nSedgwick County booking records show Darien Lee Freeman was arrested for first-degree murder and unlawful possession of a firearm by a felon. A 15-year-old was also arrest for a role in the crime.\nJimmy Shopteese was shot in the 1900 block of East Pawnee early Thanksgiving morning. Another teen said he and Shopteese were confronted by three people in front of a laundromat.\nToday on facebook, Wichita Police Chief Gordon Ramsay posted;\nHomicide detectives made two arrests in the murder of a 15 yr old from early yesterday. Crime doesn't stop on holidays and either does the tremendous dedication of our staff. Thanks for your work in solving this terrible crime.\nPolice said Shopteese and a 13-year-old arranged to meet acquaintances at a parking lot. A news release said Shopteese was shot once in the back by\nPrevious story:\nA teenage boy has died following a shooting early Thanksgiving morning in south Wichita, family tells KAKE News.\nOfficers were called at around 2 a.m. to the report of a person shot near the Burger King in the 1900 block of east Pawnee. A 13-year-old boy told police he and the victim, 15-year-old Jimmy Shopteese, were confronted by three suspects in front of the Lost Sock laundromat.\n\"The 13-year-old stated one of the suspects brandished a handgun and shot the 15-year-old one time,\" Officer Charley Davidson said in a news release. \"The two juveniles then ran across the street to the Burger King parking lot where the 15-year-old male victim collapsed.\"\nShopteese was taken to a local hospital with critical injuries. His mother said he has since died.\n\"My son got shot and murdered and I don't know who did it,\" said Crystal Weers, Shopteese's mother.\nWeers says that she had no idea her son sneaked out and wishes she could have stopped him.\n\" I just want to see my son walk in the door, I want to see my son tell me that he loves me,\" she said.\nAuthorities are looking for anyone in the area who might have surveillance video of the shooting.\nOfficer Davidson said the only suspect information at this time is three black males in a silver four-door car. Anyone with information is asked to call 911.\nThursday morning's shooting death is Wichita's 29th homicide of 2016.\nShopteese's family is concerned about how they are going to pay for a funeral, saying that they do not have enough money. They are hoping a local church will help. If an organization would like to help, the can contact the Crystal Weers by email: crystalmarie616@gmail.com\nThis story has been corrected to reflect the victim's correct age.\nCharges filed against woman accused in slaying, baby abduction\nMan shot to death inside Wichita restaurant\nTeen arrested in northeast Wichita shooting death"}