{"uri": "http://www.9news.com/story/news/local/2016/01/30/shooting-stabbing-reported-denver-coliseum/79570036/", "title": "Motorcycle club fight turns deadly", "dct": "Mon, 01 Feb 2016 00:00:00 GMT", "id": "9ee0e481c5d1a822d0022b158ba12811", "content": "DENVER – A disagreement between two biker clubs at the Colorado Motorcycle Expo Saturday afternoon ended with violence.\nDenver Police say one person died and seven others were injured when the two groups exchanged gunfire at the National Western Complex.\nFour people – including the person who died – were shot. One person was stabbed, and three others suffered injuries consistent with a fist fight, according to Denver Police Chief Robert White. Three of the people shot are in critical condition.\n\"Most of them were members of motorcycle clubs,\" White said. \"Whether they are local or out-of-town is yet to be determined.\"\nSources tell 9NEWS one of the two motorcycle clubs involved has law enforcement members among its ranks.\nThe other is listed as a \"major gang\" by the FBI.\nThe victims were treated at Denver Health, which was placed on lockdown for hours as heavily-armed Denver Police officers surrounded the building.\nThe violence broke out just before 1 p.m. at the National Western Complex.\nDarren Moffitt was nearby eating a burger with his brother when he heard the \"pop\" of gunshots. He and the rest of the people inside of the restaurant got under the tables as the room started to fill with smoke.\nWhen the commotion stopped, he says the magnitude of what happened was immediately clear.\n\"I look down at my feet and I was walking through a pool of blood,\" Moffitt said. \"Not even a stream, but a pool.\"\nThe City and County of Denver opted to cancel the Colorado Motorcycle Expo on Sunday out of both respect for the ongoing investigation and public safety.\n\"This is an event that has taken place for over 30 years, and we haven't had any serious incidents that occurred,\" White said.\nWhite says police are currently interviewing witnesses and one person of interest. No arrests have been made. Investigators have strong reason to believe there is more than one shooter.\n\"Right now we're calling this a shooting,\" White said. \"And whether it was motorcycle gang-related or motorcycle club-related has yet to be determined.\"\nMotorcycle clubs are normally nonviolent, White said, whereas gangs engage in activity that is more \"questionable.\"\nDenver Police wouldn't confirm which motorcycle club or gang was involved in the fight.\nWhite says there were Denver Police officers at the National Western Complex Saturday, but the violence broke out before they could do anything.\n\"We're going to assess how this event – if at all – will be held in our city,\" White said.\n\"We strongly suspect there's more than one shooter,\" White said. \"How many firearms were recovered, or how many firearms were used -- that part of the investigation is ongoing.\"\nCustomers who bought tickets for Sunday's motorcycle expo will receive refunds, the City and County of Denver said in a news release.\nOther events scheduled at the National Western Complex Saturday night and Sunday afternoon will continue as planned.\n\"I've been to this show many times for several years,\" Moffitt said, \"never seen it like this.\"\n(© 2016 KUSA)"}