{"uri": "http://www.news4jax.com/news/local/jacksonville/jso-investigating-a-death-on-18th-and-main-street", "title": "2nd victim in Springfield shooting dies", "dct": "Sun, 01 Jan 2017 16:45:00 GMT", "id": "9b8050b530910b18c5b9e9bffcf0b7c7", "content": "JACKSONVILLE, Fla. - The second victim of a New Year's Day double shooting in Springfield has died, according to the Jacksonville Sheriff's Office.\nPolice said Kareem Hagan, 22, died after the 3:53 p.m. shooting at the intersection of 18th and Main streets, which in the greater Springfield area, but outside the historic Springfield zone. On Monday, police said 17-year-old Marquis Marquez died of his injuries at UF Health Jacksonville.\nThese were the city's first two homicides of 2017.\nRELATED: Interactive map of shootings around Jacksonville\nA witness who said he lives across the street on Main Street said he saw a fight between a large group of men -- at least two dozen -- that ended in gunfire.\n\"I saw them congregating over here about 2 o'clock in the afternoon on the first,\" Johnny Reeves said. \"Half of them came over here on this sidewalk. Then they started walking down each sidewalk. Then I heard one of them say, 'Well, you want some? Let's get it now.' Then the next thing I hear was gunshots.\"\nNews4Jax records show Hagan was arrested for burglary in 2015 but was found not competent for prosecution because of intellectual disability and autism. His competency was reviewed twice, including as recently as November, and the findings had not changed.\n\"God bless the momma and the daddy, that's all I can say,\" Reeves said.\nOther witnesses told News4Jax they saw a person lying on the ground dead between two houses. Officers blocked off the area to investigate. Officers found bullet casings on the street and had to push the crime scene tape back further so evidence wasn’t missed.\nA police helicopter circled above a crime scene that stretched along Hubbard Street between 17th and 18th streets Sunday afternoon while officers on the ground assisted by a K-9 unit searched for the shooter.\nTony Bell said his house was hit by gunfire and a bullet was just feet away from hitting him.\n\"I was lying in bed sleeping,\" Bell said. \"A bullet hit the window, and it woke me up, and police were everywhere.\"\nA witness told News4Jax that he was just down the street when the shooting happened.\n\"Me and my cousin were in our clubhouse and we heard gunshots and then we seen three people running around our block,” the witness said. “One with a red-colored shirt and he looked young. And there was another one with a hat on. He ran around the corner and then he came back around and hid behind someone's house, and then we saw a blue car come and pick them all up.\"\nNews4Jax looked at a crime map of the area. The shooting happened within the 32206 ZIP code. Statistics show within the past month within a half-mile radius of the shooting there have been:\nSeven thefts, one involving a vehicle\nSix batteries, one with a deadly weapon\nOne robbery\nOne burglary\nAnyone with any information on who may be responsible for the deadly shooting is asked to call Crime Stoppers at 1-866-845-TIPS.\nCopyright 2016 by WJXT News4Jax - All rights reserved."}