{"uri": "http://www.timesfreepress.com/news/2014/apr/10/3-dead-1-wounded-lookout-valley-shooting/", "title": "Victims identified in triple homicide; authorities hunting up to two more gunmen", "dct": "Thu, 10 Apr 2014 00:00:00 GMT", "id": "3d1da3f5ccdce359a895c1741a1b8033", "content": "A 19-year-old Chattanooga man, accused of killing three men and wounding another in an attack Wednesday night in Lookout Valley, remains in custody.\nDerek Morse, 19, is facing a charge of attempted criminal homicide in connection with a shooting at Kellys Ferry Road and Kellys Ferry Place. His bond is set at $750,000.\nHe is also going before a magistrate to have bond set for three counts of criminal homicide.\nThe surviving victim, 16-year-old Michael Callen, was found wounded in the doorway of his residence, according to the arrest report. He directed officers to a nearby motor home where three men were found dead. Numerous cartridge casings littered the road.\nJohn F. Lang, Caleb N. Boozer, and Jon E. Morris have been identified as the victims by the Hamilton County Sheriff's Office.\nCallen told police he had been at the motor home when two men came up shooting at them. Callen was struck and managed to make it to his home. He continued to hear gunfire.\nOne of the gunmen said, \"Make sure they're all dead,\" according to the report.\nHamilton County Sheriff Jim Hammond said this was not a random shooting and that his office is still looking for one or two more suspects.\nHammond said the shootings may be drug related. The sheriff's office is not yet releasing the relationship of the victim to the suspects.\nThe sheriff's office is not saying at this time what type of weapons were used.\nMorse had four counts of aggravated assault, one count of domestic assault and one count of simple assault dismissed less than a week ago by the Hamilton County district attorney, court records show.\nIn that case, court records show Morse reportedly opened fire on a carload of people. The car was dropping off Morse's girlfriend at his residence on McNabb Way in January when the couple began to argue. When she returned to the vehicle, Morse reportedly brandished a gun and fired numerous shots at the vehicle. He said, \"Do you want to lose your life?\" and \"I'll end a life.\"\nFor more on this story read Friday's Times Free Press."}