{"uri": "http://www.desmoinesregister.com/story/news/crime-and-courts/2016/12/29/des-moines-iowa-shooting-two-victims-mercy-medical/95982742/", "title": "Des Moines police face puzzle after 2 males reported shot", "dct": "Thu, 29 Dec 2016 00:00:00 GMT", "id": "9c35f8899a12bb6764b345b8b8615a19", "content": "Police responded to Mercy Medical Center early Thursday morning, where two males were being treated after being shot, according to a police report.\nAt around 1:30 a.m., police interviewed both victims. One had been shot in the leg, and the other's injury was not described in the report.\nThe first was a 16-year-old, who police said was \"in a lot of pain and very emotional,\" which made it hard for officers to question him.\nThe teenager initially told police that he was walking in an alley when he was shot, but later said he was shot while driving a silver Mercury Mariner, which belonged to his mother.\nThe man told police he had been at the QuikTrip near the Iowa State Capitol, which police deduced was at 1501 E. Grand Ave., and pulled into an alley nearby after filling the vehicle with gas. The report states the man was unsure where the alley was in relation to the convenience store, but said he was driving near there when he was shot.\nAccording to the report, the 16-year-old told police he didn't know who shot him or the origin of the shots.\nHe then told police he didn't know how he got to the hospital or who drove him there, though the report states the victims arrived at the hospital in the Mercury Mariner described.\nThe second victim was an 18-year-old who police say was \"uncooperative.\"\nHe told police that he and the first victim were driving south of Iowa Lutheran Hospital, more than a mile and about seven minutes away from the QuikTrip the first victim described.\nHe told police that the 16-year-old victim was driving and he was the passenger in a gold SUV, when they heard gunshots and attempted to leave the area.\nThe 18-year-old then said he felt a pain in his leg and realized he had been shot, according to the report.\nThe man then told police: \"That is all I can say.\"\nThe 16-year-old victim said there was one other person in the car with the two victims at the time of the shooting whom he didn't know, but said it was a friend of the 18-year-old victim.\nThe incident remains under investigation."}