{"uri": "http://www.swnews4u.com/section/125/article/19810/", "title": "Boscobel Elementary mourns sixth grade shooting victim", "dct": "Thu, 20 Feb 2014 10:40:00 GMT", "id": "a41aef2aedd8b0684b9776a7a3c5a9a9", "content": "By DAVID KRIER\nBoscobel Elementary School had counselors on hand last Wednesday morning following the news that sixth grader Briar Brown had shot himself the night before at his Crawford County home.\n“We pulled together early Wednesday morning and did a quick planning session on how we would prepare the kids,” said Principal Rick Walters. “We went classroom by classroom, concentrating most heavily on the sixth grade, of course.\nElementary school counselor Sharyl Kay was joined by high school counselor Rhonda Scallon, Riverdale counselor Stacey Troxel and several clergy members in counseling the children.\n“Things worked out well,” said Walters. “We had staff in each classroom looking for unique responses to the news.”\nThe Crawford County Sheriff’s Department received a 911 call from the Brown’s Marietta Township home at approximately 7 p.m. on Tuesday, Feb. 11 that 12-year-old Briar had been shot with his .22 rifle. He was transported to Boscobel Area Hospital and Clinic by the Boscobel Rescue Squad and later taken by Medflight helicopter to Madison. He died the following day at American Family Insurance Children’s Hospital in Madison.\n“I’m not sure anyone will ever know exactly what happened; he was alone at the time,” said Crawford County Sheriff Dale McCullick. “Was it self-inflicted? Was he cleaning his gun? Was he going to shoot a skunk? I’ve heard all those things, but none of us will ever know what happened. It’s an absolute tragedy. We all know that.”\nMcCullick added that there was “absolutely no foul play” and the investigation is completed.\nTuesday night’s boys’ basketball game was dedicated to Briar, with his framed jersey presented to Briar’s parents, Scott and Kari Brown, by his sixth grade teammates. His funeral will be held Friday at 6 p.m. in the Boscobel High School gym.\nBriar was an avid athlete, a member of the sixth grade basketball team who was well liked at school.\n“He was kind of a quiet guy who always had a smile on his face,” said Walters. “Just a wonderful young man. He will be missed.”"}