{"uri": "http://boston.cbslocal.com/2015/03/30/investigators-release-few-details-in-bedford-nh-deaths/", "title": "NH AG: Bedford Mother Killed Daughters In Murder-Suicide", "dct": "Mon, 30 Mar 2015 12:28:00 GMT", "id": "55b947769fcbaa506cf585c45c726691", "content": "BEDFORD, N.H. (CBS/AP) — The three people found dead in a Bedford, New Hampshire home over the weekend were identified Monday as a mother and her two young children.\nNina Obukhov, 34, and her two daughters, Katherine, age 8, and Elizabeth, age 6, were all found in their house on McAfee Farm Road Saturday with gunshot wounds to the head, the attorney general’s office announced in a statement.\n“Based on the information to date however, the deaths appear to the result of a murder-suicide where the mother, Nina Obukhov, shot and killed her two daughters and then turned the gun on herself,” Attorney General Joseph Foster said.\nNo other information was released.\nFlowers and stuffed animals were left outside the home Monday.\nCounselors were available to students at Riddle Brook Elementary School where the girls attended classes.\nBedford Superintendent of Schools Chip McGee wrote an email Sunday to parents of children who attend Riddle Brook Elementary to let them know that additional counselors would be at the school Monday.\nIt said, “This tragedy will affect all of us, and it will affect Riddle Brook School in particular.”\nA neighbor, Colin Snell, said he hadn’t met the people who lived in the house, but that he had seen police cars there more than once in the last year.\n“Certainly, you wouldn’t expect this in a neighborhood community, but the reality is it’s everywhere now,” he said, talking about violent crime.\n(TM and © Copyright 2015 CBS Radio Inc. and its relevant subsidiaries. CBS RADIO and EYE Logo TM and Copyright 2015 CBS Broadcasting Inc. Used under license. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report.)"}