{"uri": "http://abc7.com/news/2-arrested-in-deadly-west-adams-party-shooting-/1557964/", "title": "2 arrested in deadly West Adams party shooting", "dct": "Sun, 16 Oct 2016 00:00:00 GMT", "id": "02329cd9abc09c41bc7db92d1fd6d64c", "content": "LOS ANGELES (KABC) --\nTwo people have been arrested in connection to a house party shooting in the West Adams area that left three people dead and 12 others wounded, authorities from the Los Angeles Police Department said Sunday.\nThe suspects were identified as Mowayne McKay, 33, and Diego Reid, 25, both of whom are Jamaican nationals, police said.\nThe shooting happened at about 12:30 a.m. Saturday at what was described as a makeshift restaurant in a home in the 2900 block of Rimpau Boulevard.\nAccording to the owner of the restaurant, there was a birthday party going on when an argument broke out between two groups, which led to the shooting.\nPolice said three men were found dead inside the home and 12 others -- nine males and six females -- were hospitalized with injuries that ranged from minor to critical.\nAmong the dead was the man who \"initially engaged in the argument with the two suspects,\" the LAPD said in a statement.\nThe names of the deceased were not disclosed, authorities said, as Los Angeles County coroner's officials were still determining their identities and thus have yet to notify their families.\nAs of Sunday afternoon, police said, one male victim remained in \"extremely critical\" condition. Most of the other survivors had been released from the hospital.\nThe suspects were arrested early morning Sunday and were each expected to be booked for murder.\nMowayne was being held in lieu of $2,000,000 bail, according to the Los Angeles County Sheriff's Department. Bond information for Reid was not immediately available.\nAnyone with information about the shooting is asked to call Detective David Dilkes or Detective Isidro Soto, of the Los Angeles Police Department's Criminal Gang/Homicide Division, at (323) 786-5110."}