{"uri": "http://ktla.com/2016/10/15/3-dead-12-injured-after-shooting-at-south-l-a-birthday-party/", "title": "3 Dead, 12 Injured After Shooting at South L.A. Birthday Party", "dct": "Sat, 15 Oct 2016 22:49:00 GMT", "id": "4e7fddac400dc18dab2727d1708ddf47", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nThree people were killed and 12 were injured during a shooting at a South Los Angeles birthday party early Saturday morning, according to the Los Angeles Police Department.\nDozens gathered to celebrate a birthday at a home that was used as a non-permit makeshift restaurant in the 2800 block of Rimpau Boulevard when shots rang out around 12:28 a.m., police said. A man and woman were taken in custody as \"persons of interest,\" according to the L.A. Times, but authorities said they were still searching for at least one suspect late Saturday night.\nAt some point during the night, three people, possibly two men and one woman, left the party and returned with guns, Sgt. Frank Preciado of the LAPD said.\nThe group opened fire and shots were returned, according to police. Three people were pronounced dead at the scene and 12 were transported to local hospitals in various conditions.\nThe death toll is expected to rise, officials said, as the victims' injuries range from serious, to critical, to grave.\nDetails were not released on the deceased, but police said all the victims were adults.\n\"When officers responded here, my understanding was that there were at least 50 people running from the location of 2800 Rimpau Boulevard,\" said Preciado. \"This a very chaotic situation at this point.\"\nPolice found a semi-automatic handgun at the home, located in the West Adams District.\nWitnesses told KTLA that people were having a good time and enjoying the party when the violence began.\n\"It was a birthday party; I don't know what happen,\" said Dilly, the homeowner of the restaurant that is said to be very popular in the neighborhood. \"I went to go hide next door by the trashcan. When I come out, I hear plenty of people get shot.\"\nIt is currently unknown what caused the shooting. Criminal Gang Homicide detectives are investigating and gang relation has not been ruled out, Preciado said.\nThough the location attracted a good amount of foot traffic, it was the first time proceedings had turned violent, according to neighbor Millie Luarca.\n“They’re good neighbors,” she said. “I’ve lived here 10 years and this never happened before.”\nMayor Eric Garcetti issued a statement Saturday afternoon in wake of the shooting.\n\"Today, Los Angeles woke up to a horrifying shooting in West Adams — the latest example of a senseless gun violence epidemic that causes so much pain and sorrow in our city and across the nation,\" Garcetti said.\n\"We have every confidence that the LAPD's investigation will answer the many questions about what happened, and why,\" the mayor added. \"Our thoughts are with the families mourning or praying at bedsides today. We must take action against easy access to firearms and the thoughtless, indiscriminate, murderous use of them. We cannot tolerate these tragedies multiplying in communities across America.\"\nOne woman is in custody and being treated at a local hospital, where she is also being questioned by police, authorities said.\nDetectives have not released any further details about the shooters involved.\nYou need to have the Adobe Flash Player to view this content. Please click here to continue."}