{"uri": "http://www.wcpo.com/news/local-news/hamilton-county/cincinnati/east-westwood/cpd-5-hurt-in-west-side-shooting", "title": "CPD: 1 dead, 3 wounded in East Westwood 'gun battle'", "dct": "Tue, 08 Dec 2015 19:32:00 GMT", "id": "adb762280926996772d2e1943d0bd58c", "content": "Autoplay:Police identify man killed in East Price Hill shootingCONNECTING...XCPD: 1 dead, 3 wounded in East Westwood 'gun battle'\nCINCINNATI -- Officers found one dead and three wounded after what police described as a \"gun battle\" in East Westwood Tuesday night.\nPolice said more than 20 rounds were fired in front of a busy market on the 2300 block of Baltimore Avenue near the intersection of Baltimore, McHenry and Hawkins avenues during dinner time Tuesday evening.\nOfficers identified the man killed as 24-year-old Jonathan Austin. Officers did not release the names or conditions of the three people wounded in Tuesday's shooting.\nReligious leaders in the neighborhood called the incident a horrifying act.\n\"(There's) potential for a lot of kids to be out in the street, bullets flying,\" pastor and community outreach advocate Peterson Mingo of the Cincinnati Human Relations Committee. \"It's just total disregard for human life.\"\n“Things like this are going to happen as long as we say nothing. As long as we stay silent and there's only one way to stop it. We have to stop it,” Mingo said .\nThis corner of Cincinnati's west side is no stranger to multi-victim shootings. The intersection was also the sight of two back-to-back shootings in a single night last May that resulted in four people wounded. Another shooting at the same intersection left another person injured just two days later.\nPolice did not say what led to the gun fight Tuesday evening, nor have any suspects been identified.\nWCPO will update this story as it develops.\nOpen full screen to view moreSign inShooting on Cincinnati's west side26,824 viewsMade with Google My MapsShooting on Cincinnati's west side\nMap data ©2017 Google\nTerms\n2,000 ftCreate new mapOpen mapShared with youHelpFeedbackGoogle Drive"}