{"uri": "http://www.denverpost.com/2016/11/14/11-year-old-boy-shooting-death-mesa-county/", "title": "Coroner identifies 11-year-old boy slain in apparently accidental shooting near Grand Junction", "dct": "Mon, 14 Nov 2016 08:35:00 GMT", "id": "1db9e42e4a504246fad451585168abf7", "content": "Authorities in Mesa County have arrested a man on suspicion of manslaughter and prohibited use of a weapon in the apparently accidental Saturday shooting death of an 11-year-old boy.\nJeremy Mushrush , 41, is also suspected of attempting to influence a public official in connection with the case. He turned himself in to investigators on Sunday.\nThe Mesa County Sheriff’s Office says the boy, Caden Randolph, died after being shot in the chest Saturday at a home on the 3000 block of Sandpiper Avenue, just east of Grand Junction.\nThe county coroner’s office says Caden died at St. Mary’s Hospital. His manner of death has been ruled a homicide.\nMushrush is not related to Caden, investigators say, though the shooting happened at Mushrush’s home. Officials said the boy was there visiting a friend.\nMushrush was interviewed by authorities in the hours after the shooting, but not immediately arrested. Further information gathered later by investigators “implicated Mr. Mushrush in criminal activity,” leading to his arrest, officials said.\n“When the gun went off, unfortunately the young boy happened to be in the line of fire,” said Megan Terlecky, a sheriff’s office spokeswoman. “This is a very sad tragedy and unfortunately an incident that didn’t have to happen.”\nTerlecky said Monday she wasn’t sure if the gun was a handgun, a rifle or a shotgun.\n“There were possible plans for a target practice outing the following day,” Terlecky said. “That’s why the gun was out. Unfortunately, nearly every gun safety rule available does not appear to have been practiced.”\nMushrush is being held at the Mesa County jail in lieu of $100,000 bail, records show.\nThe county sheriff’s office says it is working with prosecutors and the coroner on the investigation. Court records in the case have been sealed.\n“This remains an ongoing, active investigation,” the sheriff’s office said in a news release."}