{"uri": "http://www.whio.com/news/news/crime-law/man-sentenced-8-years-springfield-homicide/nc4BY/", "title": "Man gets 8 years in prison in Springfield slaying", "dct": "Mon, 27 Jan 2014 00:00:00 GMT", "id": "bc96ad2fb5b229ee811e4a06f9562683", "content": "A Dayton man will spend eight years in prison after last year's shooting death of a Springfield bar patron who was trying to flee a fight that did not involve him.\nJulian A. Johnson, who took a plea deal Monday, faced the possibility of life in prison if he was convicted of single counts of murder and having a weapon under disability. Instead, Johnson agreed to charges of involuntary manslaughter and tampering with evidence.\nErnest Edwards of Springfield, was shot Jan. 26, 2013, at the Nite Owl, 601 W. Main St. Three others were injured in the shooting.\nDaniel Driscoll, Clark County assistant prosecutor, said he felt the agreement was the best because of problems with witnesses.\n\"I believe if witnesses had been more cooperative at the scene and if witnesses had been more forthcoming as we prepared for trial, we could have ended up with a larger amount of time for this individual,\" Driscoll said. \"However, I am satisfied with what we got considering what we were dealing with as we prepared for trial.\"\nEdwards, 34, was trying to exit the rear door of the bar after a fight broke out. According to a Springfield police report, Johnson went out the front door, retrieved a semiautomatic handgun from his car and began firing at the back door, reportedly killing Edwards and injuring three others.\nHe was hit multiple times, including the chest.\nJohnson was taken into custody in March by U.S. Marshals at an apartment complex in Trotwood, where authorities found him hiding in a bathroom.\n\"I think we got a good deal. I think that we served the purpose of putting someone who committed a crime behind bars for a long period of time,\" Driscoll said. He said that he talked last week and again Monday with Edwards' family to explain the plea agreement.\n\"We met with the family, and the family is on board with the plea deal we did today. So, in that respect, I am very satisfied with what happened,\" Driscoll said.\nEdwards is survived by his wife, Alicia, and a son, now 11.\nJohnson's lawyers late last week asked for a continuance. But when testimony was scheduled to begin Monday, the plea bargain was announced.\nEdwards \"was actually a true victim. He was not involved in the fight. He was just in the wrong place at the wrong time,\" Springfield Police Sgt. Jeffrey Flores said after the shooting.\nPolice identified Johnson as a suspect several days after the shooting but were unable to locate him, according to reports."}