{"uri": "http://www.pennlive.com/news/2016/01/perry_county_shooting_search_w.html", "title": "Search warrant reveals multiple weapons, ammunition taken from slain 12-year-old girl's home", "dct": "Sat, 16 Jan 2016 13:39:03 GMT", "id": "7006b812a6789e1898ca73d65041794d", "content": "Police seized ammunition and multiple firearms from the Perry County apartment where investigators claim Donald Meyer Jr. squared off against a Pennsylvania constable, resulting in the death of the man's 12-year-old daughter.\nCiara Meyer suffered a single, fatal gunshot wound Jan. 11 after the round fired by Constable Clark Steele, 46, passed through Meyer's arm and struck the 57-year-old's daughter, according to state police. The Perry County coroner ruled the girl's death a homicide.\nPolice said Meyer had pointed a loaded semi-automatic rifle at the constable during an eviction, and Steele then fired his .40 caliber weapon at Meyer.\nInvestigators waited at the shooting scene on Monday for a search warrant, which was ultimately approved by Magisterial District Judge Daniel McGuire, to re-enter and search the apartment.\nPolice collected firearms, ammunition, shell casings, blood, DNA, fingerprints, gunshot residue, hair and expended bullets from the Rebecca Drive apartment's kitchen, bedroom and living room areas.\nAccording to the search warrant, police collected the single spent casing fired during the incident, as well as five weapons, three magazines, five specified types of ammunition, a box of assorted ammunition and another with spent ammunition.\nEmergency medical responders flew Meyer to Penn State Hershey for treatment for a shattered upper arm bone. He faces an aggravated assault charge, among other offenses, related to the incident.\nPerry County District Attorney Andrew Bender has said the shooting is under investigation by his office and state police.\nOne of Ciara's aunts, Steff Gehman, established a fund in the girl's memory to cover funeral expenses and establish a Susquenita School District scholarship in the her name. As of Friday morning, $9,534 had been contributed toward a goal of $50,000 on GoFundMe.\nVisitation and services for Ciara Meyer are scheduled for Jan. 16."}