{"uri": "http://www.pennlive.com/news/2016/02/mental_health_gun_purchase_pen.html", "title": "How man charged in 12-year-old daughter's death cheated Pa.'s gun background check", "dct": "Tue, 02 Feb 2016 21:18:17 GMT", "id": "9383c3a74a751d6182999312dcfa6b12", "content": "With a single checkmark, Donald Meyer Jr. slipped through the system.\nPolice and family members say he lied by knowingly denying an involuntary mental health commitment and thereby falsifying his gun purchase application, but county officials and state police say they have always followed mental health reporting protocols.\nDespite this, Meyer's claim passed and he added another firearm to his collection.\nPolice found five weapons in the apartment where his 12-year-old daughter died from a gunshot wound on Jan. 11.\nInvoluntary commitments bar people from owning firearms under Section 302 of the state Mental Health Procedures Act. Yet in 2012 -- one year after Donald Meyer was involuntarily committed -- he had paperwork to purchase a weapon.\nThousands of people purchase firearms from Pennsylvania gun shops each year, but the state's background system -- the Pennsylvania Instant Check System -- is meant to flag those who lie on gun purchasing applications.\nSome put down false names or deny an arrest warrant. Others check the wrong answer when asked, \"Were you ever adjudicated incompetent or involuntarily committed?\"\nPennsylvania counties are required to report mental health information to Pennsylvania State Police, who in turn enter the information into PICS to check the buyer's self-reported information.\nSystem fails\nBut Meyer was not flagged after 2011.\nInstead, investigators said, Meyer met Constable Clark Steele with a loaded .223 semi-automatic weapon in an argument over the time of the family's eviction from their Perry County apartment.\nSteele, who has been cleared of criminal charges, fired a single bullet from his .40 caliber pistol that passed through Meyer's arm and struck the girl.\nPerry County District Attorney Andrew Bender filed a slew of charges against Donald Meyer, including criminal homicide, involuntary manslaughter and persons not to possess firearms, under provisions of the Mental Health Procedures Act.\nJason Gehman, brother of Donald Meyer's wife, told PennLive that he found a form in Meyer's home dated Oct. 1, 2012, that could be used to purchase a Bersa Thunder 380 handgun. Meyer had signed the form but did not disclose that he had been involuntarily committed under Section 302.\nState police Lt. Jonathan Mays said Meyer illegally purchased at least one weapon after his 2011 involuntary mental health commitment.\nInvoluntary commitment\nCiara Meyer's family members say they don't understand why her father was able to buy and own guns.\n\"He was 302'd - he shouldn't have had the weapons,\" Gehman said. \"I think the public should know, because there might be other situations out there.\"\nHe said the family had contacted children and youth agencies, medical facilities and police over the years about Meyer's behavior. They had told authorities that Meyer had weapons.\nIn 2011, Gehman said, Meyer was taken to Osteopathic Hospital for an overdose, and while there, he was involuntarily committed under Section 302 after threatening people.\nIn fall 2014, Gehman said, Meyer told them he was diagnosed with a mental illness.\n\"The ambulance services have numerous accounts of picking him up under situations. That should have been enough to blow this wide open,\" Gehman said, referring to the 911 calls.\nThe night before Ciara's death, Gehman said, Meyer told his wife, \"he's going out like a warrior, not like a mouse.\"\nWhen police arrived, Meyer had \"a full arsenal laid out on the table,\" Gehman said.\n'No question'\nIt's unclear how Donald Meyer's mental health information didn't make it into the system.\nState police didn't have Meyer's medical information on record, according to Trooper Adam Reed, state police spokesman.\n\"We have no record of having received a notification - either in our database or paper archives of this particular Act 77 notification form (from 2011),\" Reed said in an email to PennLive.\nDauphin County officials, responsible for reporting medical information from physicians to police, declined to specifically comment on Meyer's case but said, generally, protocols have been followed.\n\"While we cannot comment directly on specific cases, I can say that following media reports we reviewed all reporting policies and procedures and determined that all correct steps were followed,\" said Jack Sherzer, Dauphin County spokesman, in an email.\nRep. Todd Stephens, R-Montgomery County, has spoken in support of state and national mental health reporting. Upon hearing of Donald Meyer's case, Stephens expressed concern over how the information could have been lost.\n\"There's no question that this guy should've been flagged in the background check system,\" Stephens said.\nGuns denied\nA person has 30 days to challenge a PICS firearm purchase or transfer denial.\n\"Assuming there is no challenge, we then obtain specific records which are likely necessary for the investigation and an investigatory referral is sent to the corresponding police department,\" Reed said, adding that police then launch an investigation.\n\"If the investigation determines [a person knowingly provided false information or used a fraudulent identification] occurred, the individual could be looking at serious felony charges.\"\nReed noted that police made some policy changes in late 2013 \"to allow [them] to refer a greater number of denial investigations.\" Referrals have grown since 2012.\nPreliminary 2015 statistics show police handled more than 4,600 referrals, according to Reed.\nIn May 2014, Dauphin County mental health administrator began using an online option to enter information directly into the state police database, Sherzer said.\n'This went on too long'\nOver the past 10 years, Gehman said, Meyer's family \"had been to all the hospitals for Don, trying to get him some help, to no avail.\"\n\"This went on too long. There were other situations where the police had been called. They were notified of the situation and nothing was done. I still can't explain it - I don't understand,\" Gehman said.\nHe said police were once called to the Meyer home for a domestic incident in which Meyer was accused of threatening his wife. \"That should have been enough, but there was more than that,\" Gehman said.\nState police said the constable was aware that Meyer had weapons, but state police do not maintain a firearm registry to document who owns firearms to crosscheck with those unable to own weapons. A person has up to 60 days to dispose of a firearm once legally barred from owning one.\nNational checks\nStephens has backed House Bill 1498, which would require Pennsylvania State Police to further report any notification of mental health adjudication, treatment, commitment and drug use addiction to the U.S. Attorney General for inclusion in the National Instant Check System within 72 hours of learning of the information.\nThe bill, meant to prevent people disqualified from firearm purchase in Pennsylvania from leaving the state to purchase a weapon, awaits legislative movement after Stephens first introduced the legislation in August 2015. The information was previously included in Act 192, a piece of legislation in question after the Commonwealth Court struck it down in June 2015.\nStephens' bill would require that the mental health information be in the state system \"in a timely manner in order to transmit it\" to the national system, he said.\nState police do, however, continue to voluntarily report the information to NICS without the legislative mandate, according to Reed.\n\"In 2013, when the process to transmit records to NICS was established, we entered all legacy records,\" Reed said. \"We built the system to enter future information on a real-time basis.\"\nIn Meyer's case, officials say the information just wasn't there.\nGehman and family members maintain that Meyer not only shouldn't have had weapons, he shouldn't have had custody of his daughter.\n\"He shouldn't have had CeCe,\" Gehman said, referring to Ciara by her nickname.\n\"There was more than enough information to come up with a clear and present danger. We reached out to police to facilitate it further, and get reinforcement from other agencies, but it fell on deaf ears.\"\nPennLive reporter Barbara Miller contributed to this story.\nEditor's note: This post has been updated to include an imbedded copy of Dauphin County's mental health program policy."}