{"uri": "http://lancasteronline.com/news/pennsylvania/perry-county-man-charged-in-daughter-s-shooting-death-during/article_d2b27f32-c5ee-11e5-8d1e-97df7d01273d.html", "title": "Perry County man charged in daughter's shooting death during confrontation with constable", "dct": "Thu, 28 Jan 2016 00:00:00 GMT", "id": "fd841dfe92b796edea672f54a36acf92", "content": "A Perry County man is facing additional charges in the shooting death of his daughter during a confrontation with a constable earlier this month.\nDonald B. Meyer Jr. was charged Thursday with criminal homicide, involuntary manslaughter, aggravated assault, simple assault, recklessly endangering another person and endangering the welfare of a child.\nThe charges stem from the Jan. 11 death of his 12-year-old daughter Ciara, who was killed after being shot during a confrontation between Meyer and a state constable.\nPerry County District Attorney Andrew J. Bender announced the charges at a news conference in New Bloomfield.\nMeyer also was charged with persons not to possess, use, manufacture, control, sell or transfer firearms after the investigation revealed he was not permitted to possess a firearm “due to a prior involuntary commitment under the Mental Health Procedures Act,” according to the Perry County District Attorney’s Office.\n“But for Donald Meyer Jr.’s extremely reckless actions in pointing a loaded semi-automatic rifle at a uniformed law enforcement officer, Ciara Meyer would not have been killed,” Bender said.\nOn Jan. 11, state Constable Clarke Steele went to Meyer’s apartment to serve an eviction notice.\nAccording to a criminal complaint, Meyer, 57, initially opened the door to his apartment and then closed it. When he opened the door again, the two men exchanged words.\nMeyer then pointed a semi-automatic rifle at Steele’s chest, and Steele drew his service pistol and fired a shot that struck Meyer in his arm, the complaint states.\nThe bullet traveled through Meyer’s arm and struck his daughter Ciara, who was standing behind him, according to the district attorney’s office. She died at the scene.\nThe district attorney’s office cleared Steele of any wrongdoing, saying he discharged his weapon lawfully in self-defense.\n“Ciara Meyer’s death is a direct result of the willful and deliberate reckless behavior of (Donald Meyer),” the district attorney’s office said. “In pointing a loaded rifle at a uniformed law enforcement officer, knowing that his daughter was in close proximity, (he) consciously disregarded an unjustifiable and extremely high risk that his actions could cause the death of, or serious bodily injury to (his daughter).”"}