{"uri": "http://www.wlky.com/news/homicide-investigation-underway-after-4-bodies-pulled-from-burning-home/38613318", "title": "Police: Man shoots, kills family before arson, suicide", "dct": "Tue, 22 Mar 2016 01:33:00 GMT", "id": "92976e76c89601797eed3847b73a2654", "content": "LOUISVILLE, Ky. —\nA man shot and killed his wife and children before setting their house on fire and killing himself in Saratoga Springs on Sunday, Louisville Metro Police said.\nDetectives said multiple fires were set throughout the home.\nThe bodies of four people, including two children, were found in the home in the 13000 block of Saratoga Springs Place, off Old Heady Road.\nThe coroner identified the family as Brad and Billie Jo Hettinger and their children, Collin, 5, and Courtney, 4.\nThe coroner said Brad Hettinger, 33, died of a single gunshot wound to the head.\nBillie Jo Hettinger, 32, died of a gunshot wound to the chest and head, but also suffered thermal injuries in the fire.\nThe children died of gunshot wounds to the head and had thermal injuries from the fire.\nAn in-home alarm system alerted authorities that there was a fire in the home.\nInvestigators said firefighters did not know of the shootings until they found the bodies. The coroner said the children were found in their beds, Billie Jo Hettinger was found in the basement and Brad Hettinger was found on the first floor of the home.\nAccording to a priest at Saint Michael's Catholic Church, the four people were members of the church.\nLouisville homicide detectives and arson investigators are working to piece together what happened.\nFire crews said it is one of the most devastating fires they have ever had to work because of the victims involved.\nThe LMPD did not comment Monday on the motive for the murder-suicide.\n“This is a safe place for kids to be, and a nice place to raise a family. For something to happen this close to home, it's really hard for our community,” said Eddie Smith, one of the family's neighbors.\nHe said even late Sunday morning, nothing seemed strange.\n\"My wife walked the dog, saw them, waved to her just like a normal day,” Smith said.\nSmith said his children often played with the youngest victims.\n\"Hard to believe that innocence is gone,” Smith said.\nJefferstontown firefighter Drew Hinton was off-duty Sunday, but hearing about what happened hit him.\nHinton started an online donation page, to try and make things a little easier for the family of the victims.\n\"Help raise money for the family and friends for funeral costs and funeral expenses and any other unaccounted-for expenses they didn't expect,” Hinton said.\nThe Louisville Fire Department union has also started a donation page.\n\"Hits close to home, so we kind of just want to help out as much as possible, and especially hearing that there was children involved,” Hinton said.\nA vigil will be held for the victims at 8 p.m. Monday."}