{"uri": "http://www.washingtonpost.com/local/crime/one-person-dead-after-homicide-in-prince-georges-county/2015/05/13/0f49fd38-f95a-11e4-9ef4-1bb7ce3b3fb7_story.html", "title": "One teenager dead after homicide in Prince George’s County", "dct": "Wed, 13 May 2015 00:00:00 GMT", "id": "e8f3c498684b853025898285894db94d", "content": "A District man died Tuesday night after he and four others were shot in front of a home near Capitol Heights.\nOfficers were called to Pard Road near Glacier Avenue after a report of a shooting about 11:15 p.m. Tuesday, Prince George’s County police said. When officers arrived, they found Reginald B. Brown III, 18, and four others suffering from gunshot wounds, authorities said.\nBrown died shortly after he was taken to a hospital, and the other victims suffered wounds that didn’t appear to be life threatening, police said.\nPolice said the shooting didn’t appear to be a random incident and detectives are still working to determine a motive or suspect.\nOn Wednesday afternoon, friends and relatives gathered at the scene of the shooting.\n“He was getting a job and he was turning his life around,” said Brown’s cousin Nikki Washington as she sat on some steps surrounded by a dozen friends. “When it gets close it hurts.”\nUp and down the 4700 block of Pard Road, people were talking about the shooting and Brown.\n“He made everyone smile; people wanted to be around him,” said one man with a big smile who asked for anonymity for fear of reprisal. “He was good in football but not basketball.”\nAnother young man in the block, who spoke on the condition of anonymity, said, “Reggie wanted to do something for himself.”\nFriends say Brown moved around often to avoid trouble and said they believe he wasn’t meant to be the target of the shots fired Tuesday. “He was a good guy, but sometimes good guys hang out with bad people,” said another elderly man who knew Brown and also feared giving his name.\nOn social media, photos of a memorial appeared from friends who apparently knew him. Some posted pictures of “Lil Reggie,” saying he was “the last person I would expect this to happen” to, and his “life ended so early.”\nA $25,000 reward is available for any information leading to an arrest or indictment in this case.\nPolice are asking anyone with information to call 301-772-4925 or, to remain anonymous, 866-411-TIPS.\nDana Hedgpeth contributed to this report."}