{"uri": "http://www.rollingstone.com/music/news/wife-of-eagles-randy-meisner-shot-and-killed-investigation-ongoing-20160307", "title": "Wife of Eagles' Randy Meisner Shot and Killed, Investigation Ongoing", "dct": "Mon, 07 Mar 2016 00:00:00 GMT", "id": "78aabede4bee59012d3faddd4ff8caa7", "content": "Lana Rae Meisner, the wife of Eagles co-founder and former bassist Randy Meisner, was shot and killed Sunday at the Studio City, California house the couple shared. The LAPD confirmed to Rolling Stone that a \"death investigation\" was being conducted at the 3700 block of Eureka Ave., which the New York Post reports is in the vicinity of the couple's home address.\nAccording to CBS LA, a preliminary investigation into the shooting death at that location revealed the incident was not a homicide and the shooting appeared to be accidental. An investigator for the Los Angeles County Medical Examiner told Reuters that they are treating the death as an accident and confirmed the victim as Lana Meisner. As of Monday morning, no one has been detained or arrested.\nCNN reports that, according to the Los Angeles Police Department, investigators believe that a rifle accidentally discharged while being moved in a closet. \"As she lifted the rifle in the case, another item within the case shifted and hit the trigger of the rifle causing it to fire and fatally injure Mrs. Meisner,\" the LAPD said in a statement, adding that Meisner \"was cooperative throughout the investigation.\"\nA representative for Meisner declined to comment on the death or investigation.\nMeisner, who left the Eagles following the band's 1977 tour, had been married to his wife for nearly 20 years. The bassist is best known for co-writing and singing the Eagles' One of These Nights single \"Take It to the Limit.\" Meisner, who was replaced in the Eagles by Timothy B. Schmit — the two had previously both been in Poco, though at different times — last performed with the Eagles at the group's Rock and Roll Hall of Fame induction in 1998.\nMeisner was placed under court-ordered 24-hour supervision following a January 2015 incident where he allegedly threatened murder-suicide with an AK-47 and pills. In July 2015, Meisner's friend James Newton filed documents necessary to attain a temporary conservatorship over the former Eagles member, with Newton claiming Meisner was diagnosed as bipolar and suffered from \"suicidal ideations.\"\nNewton's lawyer also argued that Lana Rae Meisner had been in denial of her husband's mental condition for more than two decades; Lana Meisner stormed out of the court after the temporary conservator was appointed and later \"attacked\" Newton's lawyer verbally after the court date, with the lawyer requesting a sheriff's escort as he left the courthouse.\nMeisner's lawyer called Newton's claims \"widely overblown.\" At the time of the January 2015 incident, Meisner was being treated for alcoholism and was being medicated for a \"mood disorder.\"\nMeisner, who didn't perform with his former band mates during the Glenn Frey tribute at the 2016 Grammys, said in an interview he was in \"complete shock\" following the guitarist's death. \"I heard he wasn't feeling well, but I didn't think it was that serious. Then we heard he got pneumonia,\" Meisner told the New York Daily News. \"I knew he had some problems with his stomach, but I figured he'd be OK and get out of the hospital and do his thing again. All day yesterday, I was like a zombie. He was the last person I expected to go first. He was such an energetic guy. This is very sad for me. I'm sad we couldn't take it to the limit one more time.\""}