{"uri": "http://www.lapdonline.org/newsroom/news_view/60295", "title": "Tragic Accidental Discharge of Firearm Results in Death of Mrs. Lana Meisner NR16089lp", "dct": "Mon, 07 Mar 2016 00:00:00 GMT", "id": "fd7e3cbd033ebfedb648d794d180b6dc", "content": "North Hollywood: Mrs. Lana Meisner, wife of famed Eagles member Randy Meisner, was tragically shot when she moved a firearm that accidentally discharged.\nOn Sunday, March 6, 2016, around 5:30 p.m., North Hollywood patrol officers responded to a radio call of a woman asking for police assistance for a possibly intoxicated male suspect in the 3700 block of Eureka Drive. The officers took a domestic violence incident report and left the location.\nOn Sunday, March 6, 2016 around 7:00 p.m., North Hollywood patrol officers responded to a radio call of a shooting, in the 3700 block of Eureka Drive in the North Hollywood area. When officers arrived they found Mrs. Meisner suffering from a single gunshot wound.\nThe Los Angeles Fire Department responded and pronounced Mrs. Meisner dead at the scene.\nAfter a thorough investigation by Valley Bureau detective personnel and the Los Angeles Coroner's Office, it was determined that Mrs. Meisner's death was accidental. Mrs. Meisner was moving a rifle that was stored inside a case in a closet. As she lifted the rifle in the case, another item within the case shifted and hit the trigger of the rifle causing it to fire and fatally injure Mrs. Meisner.\nMr. Meisner was cooperative throughout the investigation.\nAnyone with additional information may call the Los Angeles Police Department Valley Bureau, at (818) 374-9550. During non-business hours or on weekends, calls should be directed to 1-877-LAPD-24-7(877-527-3247). Anyone wishing to remain anonymous should call Crime Stoppers at 800-222-TIPS (800-222-8477). Tipsters may also contact Crime Stoppers by texting to phone number 274637 (C-R-I-M-E-S on most keypads) with a cell phone. All text messages should begin with the letters \"LAPD.\" Tipsters may also go to LAPDOnline.org, click on \"webtips\" and follow the prompts."}