{"uri": "http://www.wickedlocal.com/news/20161216/investigation-into-brockton-boy-3-hit-by-stray-bullet-leads-to-3-arrests", "title": "Investigation into Brockton boy, 3, hit by stray bullet leads to 3 arrests", "dct": "Sat, 05 Nov 2016 00:00:00 GMT", "id": "9a4430226504c053a49ca99a41955099", "content": "BROCKTON - An investigation into an incident where a bullet flew through a wall and struck a 3-year-old Brockton boy last month, led to three people being arrested Friday morning.\nOn Saturday Nov. 5, a dozen gunshots rang out on Bartlett Street, minutes after a peace rally at city hall had come to an end.\nOne of the bullets pierced an outside wall and grazed the boy's leg as he stood in his living room. He was taken out crying by medical personnel and brought to a local hospital for treatment.\nTwo other bullets struck a U.S. Postal Service worker's mail truck.\nA trail of 9mm and .40 caliber shell casings was found along Bartlett Street.\nShow more...\nAs part of their investigation into the shooting, members of the Brockton Police Special Reaction Team and city detectives executed a search warrant at 27 Newton St., first floor, early Friday morning.\nInside, they found and arrested Neil King, 41, of 40 Holman St., Attleboro, Tere Watson, 21, of 4 Gillespie Road, Charlton and Jerry Chery, 26, of 24 Newton St., Apt. 1, Brockton.\nAs of Friday morning, none of the men are being charged in the shooting, however, police seized four rounds of 9mm ammunition, two .40 caliber rounds and six rounds of .38 special ammunition, Brockton Police Lt. Paul Bonanca said. No gun was found.\nThe ammunition seized will be tested against the shell casings that were collected at the scene, police said.\nIn addition to the ammunition, police said they found heroin, two digital scales, multiple cell phones and $1,334 in cash, Bonanca said.\nKing was charged with unlawful possession with intent to distribute a heroin) and unlawful possession of ammunition. Watson was charged with unlawful possession of ammunition and had two outstanding warrants. Chery was arrested on an outstanding warrant.\nBoth King and Watson are known to have gang affiliations, Bonanca said.\nLast April, Chery was arrested and charged in a raid on Battles Street where a gun, cocaine and heroin were seized, police said.\nTwo addresses in Attleboro were also searched Friday as part of the investigation, but no evidence was found and no arrests were made. State Police and Attleboro Police assisted in the raids.\nThe boy who was shot was treated and released from the hospital and his injury was described by police as superficial."}