{"uri": "http://www.dailymail.co.uk/news/article-3942742/How-escape-artist-David-Blaine-shot-stomach-multiple-times-preparation-bullet-MOUTH-final-trick-didn-t-planned.html", "title": "How escape artist David Blaine was shot in the stomach multiple times in preparation to take a bullet in his MOUTH - and why the final trick didn't go as planned", "dct": "Wed, 16 Nov 2016 17:49:00 GMT", "id": "20ddab124741d7e625db9d2343254371", "content": "His death-defying tricks have made him the modern-day Houdini.\nBut David Blaine's latest stunt was so dangerous, it almost proved to be a step too far for the magician.\nThe 43-year-old illusionist, magician and escape artist pulled off yet another death-defying stunt on Tuesday night - catching a speeding bullet in his mouth.\nUpon catching the bullet, the mouth guard snapped inside his mouth, with a broken piece hitting and cutting the back of his throat. Blaine was taken to hospital for treatment, but he insists he will still perform the trick during his upcoming live tour.\nThe crazy maneuver took intense preparation. The Brooklyn native was shot multiple times in the chest, while wearing a bulletproof vest, in order to teach himself not to flinch when the shot was fired.\nBlaine first attempted - and succeeded with - the bullet catch in 2009, when he had his best friend and fellow magician, Bill Kalush, fire the shot.\nHowever this time around he wanted to be the person shooting the gun at himself.\nThe main concern surrounding the trick was that Blaine would have to pull a string rigged to the gun that would fire, and it was imperative he was incredibly still and relaxed the entire time.\nTo prepare for that he wore a thin bulletproof vest and was shot multiple times in the chest.\n'(The vest) will stop the bullet from piercing, but I will feel exactly what it feels like,' Blaine told Rolling Stone.\n'The reason I want to feel what it feels like is because, in order to catch a bullet, I need to get comfortable with (being shot) first.\n'Even when I get hit with the .22 into a cup in my mouth, it knocks me out. I black out for a second.'\nAs a result, Blaine was shot with larger guns in his chest to fully prepare. The chest is considered the least dangerous place to take a bullet because it has the least amount of vital organs in one spot, he said.\nBlaine said that even though this trick involved guns and bullets, it was very similar to the magic he typically does.\nTo view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nClose\nIn light of high demand for this live stream please visit our partner page to continue watching the live event at http://www.yahoo.com\n'It's a very mechanical approach to something,' he said. 'And it related to card magic, because when you're learning certain things it's like a mechanical approach - repetition, repetition repetition, until it just become second nature.'\nBlaine performed the trick on Tuesday night for the ABC special Beyond Magic, before a celebrity-packed audience that included Drake, Johnny Depp, Margot Robbie, John Travolta, and Emma Stone.\nIn many ways the show's main function was to promote Blaine's first-ever live tour, after almost 20 years as a world famous magician, and he spent much of the episode hyping up his version of the bullet catch.\nThe dangerous illusion has been performed by such global luminaries as Scotland's Great Wizard Of The North John Henry Anderson in the 1800s and most famously Chung Ling Soo, who was killed while performing the effect in London in 1918.\nBlaine's version saw him hold a metal cup in his mouth, protecting his teeth with a mouthguard, and having a rifle round fired into his face at point blank range.\nHowever, despite all the intricate preparation and training, Blaine admits he neglected a key aspect of the trick - the sturdiness of the mouth guard he was wearing.\nUpon catching the bullet, the mouth guard snapped inside his mouth, with a broken piece hitting and cutting the back of his throat.\nIn the seconds after the catch, Blaine admitted he mistook the laceration for the bullet going through his head.\nBlaine explained to ABC afterwards: 'When the bullet struck the cup, there was a high-pitch ringing in my ears, and I felt an impact at the back of my throat. And I was sure that the bullet went right through my head, and that I was dead.'\nBlaine was checked out immediately by a doctor onset, who determined he had just suffered a cut to the throat.\n'Thank you everybody for being such an incredible audience. Peace and good night,' he said.\nBlaine also assured one staffer there was no problem, after the man thought it was his fault that the trick went slightly awry.\nHe told the employee: 'It's fine. It's not your fault ... I'm alive.'"}