{"uri": "https://www.thesun.co.uk/living/2554945/david-blaine-shoots-himself-bullet-stunt/", "title": "Magician David Blaine shoots himself in the mouth as famous bullet stunt goes wrong", "dct": "Fri, 06 Jan 2017 21:43:50 GMT", "id": "94c9b76a37b9b65f4edb43a33c6fc4b2", "content": "MAGICIAN David Blaine is known for his crazy stunts, but he has risked death in his latest trick – which saw him shoot himself in the mouth.\nThe 43-year-old’s show Beyond Magic, which was broadcast on E4 last night, aired a clip of him spitting out frogs to a live audience which included footballer David Beckham.\nABC\nThe show's main event was Blaine's famous bullet catch, which he first attempted in 2010.\nBlaine has revamped the trick by pulling the trigger on himself, in front of 20,000 people at Las Vegas' MGM Grand Garden Arena.\nThe performer prepared for the dangerous trick by allowing friends to shoot him in the chest, while wearing a bullet-proof vest.\nArray Array Array\nHe was then fitted with a special gum shield to hold a metal cup, in which David would catch the bullet.\nBut the cup was slipping in and out of the grooves of the mouth guard, showing the first sign of later problems.\nBlaine held a rope attached to the rifle, while the laser pointed to the spot where the bullet would hit.\nAs Blaine tugged on the rope, the bullet was fired into the cup - but the gum shield shattered in the process.\nSpeaking over the action, Blaine's narration explained: \"Time just started to move really slow.\n\"When the bullet struck the cup, there was a high-pitched ringing in my ears and I felt an impact on the back of my throat.\n\"I was sure the bullet went right through my head and that I was dead.\n\"Suddenly I became aware of the pain and it brought me back. At that moment I realised that the mouth guard had shattered again, and I was alive.\"\nAfter being checked over by doctors, Blaine discovered that he had a lacerated throat - and his friends have refused to assist with the death-defying stunt ever again.\nBut, shockingly, Blaine still plans to do the trick in his upcoming world tour.\nViewers took to Twitter to express their shock last night.\nAmong them was Ashley Harrison, who said: \"David Blaine? More like David Insane!\n\"He plans on doing the bullet catch trick in his world tour. How can he be so sure it won't kill him?\"\nWhile Meg labelled him an 'absolute mad b******' and Antoine called him a 'crazy dawg'.\nAnd Tom Vasiljevic added: \"David Blaine ain't human, what person would attempt to catch a bullet in their mouth? Or regurgitate frogs?\""}