{"uri": "http://www.abc12.com/content/news/School-resource-officer-on-leave-after-firing-gun-at-Bay-City-Western-High-School-401120265.html", "title": "Special prosecutor appointed after deputy accidentally fires gun in school", "dct": "Wed, 30 Nov 2016 11:40:00 GMT", "id": "513f4aeb84bbe35b92b12317328ce86a", "content": "BAY CITY (WJRT) - UPDATE: (11/30/16) - A special prosecutor has been appointed in the case where a Bay County Sheriff's deputy accidentally fired a gun in a school.\nIt was on Nov. 11 when Bay City Western's school resource officer, Adam Brown, accidentally fired his gun.\nThe bullet went through a wall and into a classroom. It hit a teacher in the neck, but did not break the skin.\nTo avoid any conflicts, the Bay County prosecutor's office forwarded the investigation to the state Attorney General's office, which has appointed Tuscola County Prosecutor Mark Reene to review the case.\nBrown remains on paid administrative leave.\n--\n(11/16/16) - Bay City Western High School has sent parents a new message explaining why it can't release much information about the school resource officer accidentally firing his gun on .\n“We haven't heard as much information as we thought we would.” said Stephanie Montoya.\nMontoya has children at Bay City Western High School and the middle school, which are in one building.\nIt was on Friday afternoon around 12:30 when the school resource officer, who police confirm is Bay County Sheriff's Deputy Adam Brown, accidentally fired his gun in an unoccupied classroom while testing the trigger.\nThe gunshot went through a wall and into another classroom with students, where the bullet hit a teacher in the neck, but did not break her skin.\nThe school district sent a message to parents again Tuesday night explaining why administrators have not given a lot of details of the incident to parents or the media. Montoya heard the message.\n“They would love to give more information but at this time they have been advised by the sheriff's department to not disclose any more information because they don't want to hamper the investigation.” said Montoya\nBut that's news to Bay County Sheriff John Miller, who says he has never told school officials not to discuss what happened. The Michigan State Police, which is conducting the investigation, says it has never told school leaders to keep quiet.\nOne thing is clear, Brown has plenty of support in the district.\n“I love him being in the school” said Chloe Riordan\nChloe Riordan is a 2015 graduate of Bay City Wester.\n“I guarantee you it was 100 percent an accident, there is no reason he would have purposely put people in harm’s way, at all.”\n“This is officer Brown we are talking about, he has to come back.” said Montoya\nThe state police investigation is now complete and will be forwarded to the prosecutor's office to review for possible criminal charges.\n--------------------\n(11/14/16) - A Mid-Michigan teacher is hit with a bullet inside a school, but amazingly is not hurt.\nNow, the Bay County sheriff deputy is on paid administrative leave while Michigan State Police finish the investigation.\nA single shot was fired inside Bay City Western High School in Auburn around 12:30 p.m. Friday.\n\"Bullet went through a wall, into a classroom filled full of children and struck the teacher,\" said Lt. David Kaiser, with the Michigan State Police.\nThe bullet didn't even break her skin.\n\"The bullet had lost enough velocity that when it struck the teacher it actually fell onto the ground,\" Kaiser said.\nAccording to Bay County Sheriff John Miller, the deputy assigned to the school pulled the trigger of his backup gun.\n\"It was his own personal gun, that he is qualified with. It is a sig sauer .380,\" Miller said.\nMiller says having that gun is OK under department policy.\nHe's waiting on the final report from the State Police, but early on he's been told this about what lead up to the gun being fired:\n\"He had been testing some type of trigger pull with another teacher and him were collaborating,\" Miller said.\nMiller says the deputy, with well over 20 years on the force, thought his gun was empty.\n\"The gun was not safe when he was handling it, meaning it was still loaded and there was a round in the chamber,\" Kaiser said.\nThe school immediately went into lockdown, as there was fear someone was inside shooting.\nABC12 News asked Kaiser if the school knew right away that it was the deputy who fired the gun.\n\"They did not. It wasn't for quite some time,\" Kaiser said.\nThe State Police investigation report will be forwarded to the prosecutor to decide if the deputy will face any criminal charges.\nMiller will also then have to decide what's next for the deputy.\n\"Anywhere from dismissal to all the way down to a written reprimand or a verbal reprimand,\" Miller said.\nWe've reached out to the high school for comment, but haven't heard back."}