{"uri": "http://www.mlive.com/news/bay-city/index.ssf/2016/12/deputy_school_shooting_charges.html#incart_river_home", "title": "Deputy who fired gun in school arraigned on felony, 2 misdemeanors", "dct": "Sun, 01 Jan 2017 19:03:12 GMT", "id": "b7d2daffd29cf2df247d43ec7d1554ea", "content": "CARO, MI -- A Bay County Sheriff's deputy who discharged his firearm in a high school has been arraigned on a felony charge and two misdemeanors.\nThe afternoon of Thursday, Dec. 29, Bay County District Magistrate Janice Doner arraigned Deputy Adam J. Brown on three charges -- tampering with evidence, a four-year felony; careless discharge of a firearm causing injury, a two-year high court misdemeanor; and careless discharge of a firearm causing less than $50 in damage, a 90-day misdemeanor.\nHe was released on a personal recognizance bond, officials said.\nAs of Thursday afternoon, Brown is suspended without pay from the Bay County Sheriff's Office until the case is resolved, said Undersheriff Troy Cunningham.\nThe charges stem from an incident last month involving Brown, who fired a handgun inside the Bay City Western High School and Middle School building at 500 W. Midland Road.\nFollowing a Michigan State Police investigation, the report was filed with the Bay County Prosecutor's Office. To avoid any conflict or appearance of impropriety, staff in Bay County requested a special prosecutor. State Attorney General Bill Schuette on Nov. 29 signed an order granting the request, appointing the Tuscola County Prosecutor's Office to the task of determining whether charges are warranted.\nPolice reports obtained by MLive/The Bay City Times via a Freedom of Information Act request state Brown, the school's resource officer, at about 12:30 p.m. on Friday, Nov. 11, was in the school's robotics classroom with another teacher. They used a force machine to test the trigger pull on Brown's personal Springfield EMP 9mm handgun.\nThe pair left the room, only for Brown to return alone and use the machine to test the trigger pull on his .380-caliber Sig Sauer, another personal handgun that he brought into the school. The gun was not empty of bullets and the experiment caused the gun to fire a round through two pieces of drywall. The projectile entered a classroom containing about 30 students, traveled toward the ceiling, scraped a tile, proceeded to hit a cement wall, ricocheted off it, careened across the room, and struck a teacher Brenda Amthor in the neck.\nAmthor was sitting at her desk when struck by the bullet. She was uninjured apart from a small scratch, police reports state.\nThough Brown was engaged in conversations with school staff on the projectile's origin, he did not admit to having fired a gun, reports indicate. As a result, the school was placed in secure mode while administrators attempted to discern what had happened.\nSchool staff gave Brown the bullet to hold, but he then tossed it in a grassy area covered by leaves, according to police reports. A K-9 Unit recovered the bullet.\n\"During this incident, Adam did not initially confess to discharging his weapon,\" wrote Detective Sgt. William Arndt. \"He confessed after being confronted by school administrators. Adam also admitted that he attempted to destroy evidence when school administrators gave him the fired bullet to protect. Adam left the school building, placing the fired gun in his personal vehicle, and threw the fired bullet into the school lawn in an attempt to thwart the investigation.\"\nArndt spoke with Brown, who was \"extremely emotional and explained that he had been in contact with his union representative who had advised him not to provide a statement. He did say, 'It was a total accident.'\"\nAfter Brown's arraignment, Tuscola County Prosecutor Mark Reene conducted a press conference in Caro. He began by commending Bay City Western personnel and Michigan State Police for their \"extraordinary efforts.\"\n\"This matter was completely, professionally, and thoroughly investigated,\" he said.\nIn recounting the precipitating incident, Reene spoke of how fortunate it was no one was seriously wounded.\n\"For those of you who believe in divine intervention, this incident is further evidence thereof,\" he said. \"The fact no student was injured or killed and only a minor injury was suffered by the teacher in the classroom was nothing short of a major miracle. Unfortunately, Deputy Brown did not acknowledge he had accidentally discharged the weapon for an additional 90 minutes.\"\nHe added that \"this is a difficult day for law enforcement. It's essential to keep in mind that 99.5 percent of the time, officers get it right and they do the right things. However, today's actions also confirm that when appropriate they're held accountable for their conduct.\"\nLooking to the positive, Reene said what could flow from this situation was increased firearm safety and awareness. He urged gun-owners to always treat a gun as loaded.\nDeputy Seung Lee has replaced Brown as Western's school resource officer, Cunningham said.\nBrown has been on the force since 1996.\nBrown is to appear for a preliminary examination before Bay County District Judge Mark E. Janer at 3 p.m. on Thursday, Jan. 26."}