{"uri": "http://www.mlive.com/news/bay-city/index.ssf/2016/11/parents_unhappy_with_response.html", "title": "Parents unhappy with response after deputy fires gun in school", "dct": "Wed, 16 Nov 2016 14:22:13 GMT", "id": "fc8abe0a8c8eac8b5c807cd0c3abc973", "content": "AUBURN, MI -- Authorities are releasing few details regarding a police officer's negligent discharge of a firearm inside a Bay County high school and parents are not happy.\nThe incident in question happened 12:30 p.m. on Friday, Nov. 11, inside Bay City Western High and Middle School, 500 W. Midland Road in Auburn. A Bay County Sheriff's deputy who acts as the school resource officer, fired a gun inside a room. The deputy was in the room by himself. The bullet passed through at least one wall and struck a female teacher in the neck area, Michigan State Police Special 1st Lt. David Kaiser said.\nThe projectile did not break the teacher's skin and she was uninjured.\nBay County Sheriff John E. Miller said the gun in question was a Sig Sauer .380-caliber pistol, the deputy's backup gun.\n\"That conforms to departmental policy,\" Miller said. \"He qualified with it and he was cleared by the range officer.\"\nMiller added the deputy has been with the department for more than 20 years.\nPauline Helmling, president of the Bay City Public Schools Board of Education, said school officials were asked by Michigan State Police not to comment on the incident until an investigation is concluded.\n\"This shook all of us to the core,\" Helmling said. \"It was very scary. And we are so grateful that no one got hurt.\"\nHelmling said some parents addressed the board at a meeting Monday evening, Nov. 14, with several questions.\n\"Being that it's still under investigation and in the hands of the Michigan State Police, we know only as much as the public knows right now,\" she said.\nHelmling added that she, nor the board, knows who the teacher was who was struck by the bullet and whether or not she is still working in the school.\nSome parents have expressed their displeasure with the way the school has handled the situation's aftermath.\nJenny LaPlant, of Linwood, has a son who is in sixth grade at Bay City Western Middle School, which is in the same building as the high school.\nShe said she received a phone call from the school about 3 p.m. Friday informing her there was a \"lockdown\" earlier, but the students were safe to ride the buses. She asked her son what happened and he told her he did not know, she said.\nLater that night, she and her husband received an automated service phone call saying there was an incident involving a gun being discharged by an officer.\nLaPlant said the call didn't reference a teacher being struck by a bullet.\n\"I didn't even know there was a police officer in this school,\" she said. \"I don't believe it's that bad of a school that it needs a police officer, let alone an officer with a gun. To me, they just put my kid and everybody else's kid in harm's way and they don't have enough respect for us parents. They should have called a meeting, but they're throwing it under the rug. My kid goes to that school and I do need to know what happened.\"\nLaPlant said she called Principal Judy Cox Monday morning.\n\"She said she can't give out any information,\" she said. \"She didn't tell me a teacher got hit. What would they say if one of our kids got hit? I don't believe a gun should be in a school, security or not. If we're trying to teach our kids not to bring guns to school, then why are (adults)?\"\nKevin Cliff, who also has a son in sixth grade at Western Middle School, echoed LaPlant's sentiments. He received an automated phone call at 10:10 p.m. Friday, informing him that something happened.\n\"I spoke at the school board meeting last night, expressing my lack of pleasure with their lack of transparency,\" said Cliff, who is a science teacher at Christa McAuliffe Middle School in Bangor Township and a boys' basketball coach at Bay City Central High School. \"They literally haven't said a word to anybody. Friday night, I had a discussion with my son about it and he said they didn't call secure mode for almost an hour after the occurrence.\"\nCliff said the school board didn't give him much of a response.\n\"They didn't say a word,\" he said. \"It seems like they're trying to cover their behinds. I think the secure mode wasn't done to make sure kids were actually safe; it was done to say they did it. That's the only justification. It really seems they're trying to close ranks. They're not being forthcoming. It makes me really question if there's more to the story.\"\nThe Bay City Times/MLive.com has left messages for Bay City Superintendent Janet Greif and Bay City Western Principal Judy Cox. The Times has been unable to reach Greif or Cox for comment.\nState police troopers are investigating the matter. They have not disclosed what prompted the deputy to have his gun out or why he compressed its trigger.\nThe deputy is on paid administrative leave as the investigation continues. Once the investigation is complete, troopers will forward their findings to the Bay County Prosecutor's Office for a decision on whether or not charges are issued.\nAuthorities have not disclosed the deputy's name.\nTimes reporter Andrew Dodson contributed to this report."}