{"uri": "http://baltimore.cbslocal.com/2016/11/30/police-investigating-shooting-in-nw-baltimore/", "title": "Police: 6 People Shot In Northwest Baltimore; 2 Fatalities", "dct": "Wed, 30 Nov 2016 23:41:00 GMT", "id": "17b8d8c3ca3a8b658586dc60b8bff0b6", "content": "BALTIMORE (WJZ) — Baltimore Police are investigating multiple people shot in northwest Baltimore. Six people were shot, two of whom have died from their injuries.\nPolice say this armed shooter is still at large as he fled on foot from the scene.\nWJZ reporter George Solis spoke to witnesses and authorities after the shooting shook the northwest Baltimore neighborhood.\nThe shooting happened around 6 p.m. on Wednesday evening at Duvall Ave and Garrison Blvd in northwest Baltimore.\nAmong the sea of police, police commissioner Kevin Davis also arriving on the scene of what soon became the scene of double fatal shooting.\nNearby residents describing to WJZ the harrowing moments unfolding moments before police arrived.\n“I heard like nine shots like mop, mop, mop, mop. I thought it wasn’t going to stop I turned the light off and hit the floor,” said one witness.\nBaltimore Police spokesman T.J. Smith said in a press conference Wednesday evening that a lone gunman came around the corner of a Stop One convenience store and deli on Garrison Avenue, and shot at some individuals standing in front of the business.\nTwo adult men were shot at multiple times, with one dying at the scene. The second man was taken to the hospital but later died there from his injuries.\nPolice say one man remains at the hospital with life-threatening injuries. Two women and one man have non-life threatening injuries.\nPolice say they likely won’t have the victim’s names until Thursday morning.\nSmith have limited information on the shooter, other than that he is described as a black male with dark clothing, wearing a hooded sweatshirt. He reportedly escaped on foot, ran on nearby Edgewood Street.\nSmith says, police believe the incident to be connected to other recent crimes in the area. “This is an area where there were some other crimes recently and we do believe that at this point in time, that this incident is connected, possibly to an earlier incident,” said Smith.\n“This is an area where there were some other crimes recently and we do believe that at this point in time, that this incident is connected, possibly to an earlier incident,” said Smith.\n“We believe that this probably an act of retaliatory violence,” says Smith.\nAs the rain let up, on a dreary day turned horrifying, loved ones of the victims began arriving at the scene, visibly distraught by the scene.\nPolice are still in search of the shooter, who got away on foot.\n“It’s senseless man everybody killing each other for nothing. I’m baffled like, what happened? Man it’s sad,” says a witness.\nAnyone with information about this shooting is asked to call Metro Crime Stoppers at 1-866-7LOCKUP. You can remain anonymous. Police can also be reached anonymously via text at 443-902-4824.\nThis story is being updated."}