{"uri": "http://www.baltimoresun.com/news/maryland/crime/bs-md-ci-shooting-suspect-20161212-story.html", "title": "Police make arrest in shooting that killed two, injured four outside Northwest Baltimore convenience store", "dct": "Mon, 12 Dec 2016 20:19:00 GMT", "id": "9fbf2bec6701d7b4d69b25d27ba88575", "content": "Baltimore police announced Monday the arrest of a man they believe shot six people — two fatally — outside a convenience store in Northwest Baltimore at the end of November.\nDamon Dwight Alexander was arrested by Warrant Apprehension Task Force officers Monday morning while sleeping on a couch at a relative's home, Police Commissioner Kevin Davis said at a news conference. Police said Alexander, 27, is a member of the Black Guerrilla Family gang.\nThe arrest comes as the city is on the verge of reaching the 300-homicide mark for the second straight year, but only the second time since the 1990s. As of Monday, there had been 299 killings in Baltimore.\nAlexander's arrest came partly as a result of tips, which Davis heralded as another sign that police are strengthening relationships with the community after last year's unrest over the arrest and death of Freddie Gray. In recent days, Davis said, five people suspected of violent crimes have been identified through tips; two were restrained by residents so police could arrest them.\n\"The last couple of weeks, we've done really, really well, the community has done really well working with us to get tips to identify these shooters and tell us where they are,\" Davis said.\nThe shooting Nov. 30 outside the Stop 1 Food Store in the 2900 block of Garrison Blvd. was caught on the store's surveillance video. The video showed a man in a dark hoodie walking up to a group of men standing outside the store and firing a handgun repeatedly. He stood over one of the fallen victims and shot the man until he ran out of ammunition.\nPolice called the shooting a brazen execution. While the suspect couldn't be clearly identified from the video footage, detectives were able to focus on the shooter's left hand, which was curled in an unnatural way. Detectives speculated that the man might have a deformity or injury, and they asked the public for help in identifying him.\nAfter Alexander's arrest, police said that the curling his hand in that fashion was a \"nervous tic,\" according to police spokesman T.J. Smith.\nPolice said they believe Alexander was aiming to kill four of the six people who were shot, and that the shooting is connected to a previous incident in the area. Three shootings that took the lives of five people have occurred in a half-mile area surrounding the Stop 1 store since Nov. 15.\nAt the time of the crime, Davis said Alexander was on probation for felony theft and for possession of a stolen, regulated firearm. Smith called the shooting \"brutal\" and calculated.\n\"This is a gruesome murder that we captured on film,\" Smith said. \"As he shot at his targets, he made sure they were down before he went back to empty his gun in the person he wanted to kill.\"\nAlexander faces two counts of first-degree murder, two counts of second-degree murder, four counts of attempted first- and second-degree murder, six counts of first- and second-degree assault, and five counts of reckless endangerment. He also faces a number of firearms charges.\nPolice say Alexander was found on the couch of a relative's home in the 2800 block of Westwood Ave. Alexander had no lawyer listed in court records, and relatives could not be reached.\nThe four people who were wounded in the shooting have been released from the hospital, including a man who had been in critical condition, police said.\nThe two victims killed in the shooting were identified as Davon Dozier, 23, and Troy Smothers, 29, who lived near each other on a nearby street, court records showed.\nKillings in Baltimore are slightly down this year compared with last year, when 344 were killed, but remain higher in than any year since the 1990s.\n\"We know we have this number 300 in our city implanted in our heads and that number of 300 is unacceptable,\" Davis said. \"The victims in the case are not … numbers 288 and 289. Their names are Davon Dozier and Troy Smothers. They have families, they have friends, they have loved ones who are still grieving their loss.\"\nAlso Monday, police identified the three most recent victims of violence in the city: Keith Ramsey, 32, who was killed Friday in the 2600 block of Greenmount Ave. in North Baltimore; Gregory Riddick, 26, who was killed Saturday in the 2600 block of Harford Road in Northeast Baltimore; and Ricardo Grimes, 37, who was killed Saturday in the 1100 block of Curtain Ave. in East Baltimore.\nBaltimore is enduring a spike in homicide numbers that also has affected several other major U.S. cities, including Chicago, Davis said. Getting the community to help police identify killers could help stem the tide, and Davis said he is seeing signs of progress.\nPolice have closed 37 percent of homicide cases this year. Last year, the homicide closure rate was 30 percent.\n\"The clearance rate is a really big concern for me and our city,\" Davis said.\nWitnesses don't cooperate with police for a variety of reasons, including fear of retaliation, prior poor experiences with law enforcement and negative perceptions of police. But, Davis said, Baltimore also has problems with gangs and neighborhood crews being uncooperative because they want to take retribution.\n\"When they do it outside and they do it in a public space and when they do it in broad daylight, there's a decision they've made to do it and risk identification,\" Davis said. \"They're willing to risk identification because they know that the chances of someone stepping up and identifying them are historically, traditionally slim. And that's something we are trying to change in the city of Baltimore.\"\nPolice continue to look for two suspects in the death of Tayvon Rashard Cokley, 23, on Dec. 5 in the 100 block of N. Eutaw St. He was killed about 1 p.m. in front of several people downtown. The suspects have been identified as Derrick Charles Jackson Jr. and Vincent Jamar Barefoot, both 24.\nPolice asked anyone with information about the shooting or the suspects to call 911 or Metro Crime Stoppers of Maryland at 1-866-7LOCKUP.\ntwitter.com/justingeorge"}