{"uri": "http://www.wsoctv.com/news/local/cmpd-investigating-after-person-shot-in-nw-charlotte/485451318", "title": "CMPD: 15-year-old uncooperative after being shot in NW Charlotte", "dct": "Wed, 18 Jan 2017 17:45:00 GMT", "id": "338a045055889980de2dbfe9f49af310", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCHARLOTTE, N.C. - Police are investigating after they said a teenager was shot early Wednesday morning in northwest Charlotte.\nOfficers were called just before 8 a.m. to the 4600 block of Wildwood Avenue, near Hovis Road and found a 15-year-old boy suffering from a gunshot wound to the leg.\nParamedics took the boy to the hospital, where he is expected to recover.\nInvestigators said a group of children were waiting at the bus stop when the teen came running down the street yelling than he had been shot.\nPolice tell me a 15yr-old boy was shot in the leg at some point this AM. He called for help at bus stop off Wildwood Ave. in NW #CLT @wsoctv pic.twitter.com/JoYmBxeGTu\n— Gina Esposito (@GinaWSOC9) January 18, 2017\nA neighbor told Channel 9 that the teenager was still wearing his backpack when he called for help.\nWhen he saw that the boy was bleeding from the leg, he rushed inside to call police.\n“He was very quiet, calm,” said Kenneth Massey. “He just said he had been shot. He just left with the fire truck and the ambulance.”\nParamedics took the boy to Carolinas Medical Center, but he is expected to be OK.\nPolice are still investigation what led up to the shooting and where it took place.\nThey canvassed the area and questioned neighbors to see if they heard or saw anything.\nPolice said the teen's parents believe the teen was fine when he left for school that morning.\nPolice said the teenager was wearing an ankle monitor at the time of the shooting.\nAfter tracing his steps, they determined he never left the neighborhood.\nNeighbor Alisha Woods said the violence among teenagers is frightening.\n\"I don't know what the situation was and how it happened and all that stuff but I just hope my son sees that he's going to be okay.\" She said. \"And that he don't have to be a part of that.\"\nRead more top trending stories on wsoctv.com:\n© 2017 Cox Media Group."}