{"uri": "http://democratherald.com/news/local/update-suspect-shot-himself-witnesses-say/article_39510b42-7186-5a08-949c-7249e69cb0dc.html", "title": "Suspect shot himself, witnesses say", "dct": "Mon, 17 Oct 2016 00:00:00 GMT", "id": "74efa73cf3de030941cb48dc54ba6ea1", "content": "A man armed with a handgun entered Santiam Liquor, 2530 Pacific Blvd. S.E., on Monday morning and held at least two people hostage before apparently shooting himself.\nThe suspect is Gerald Armand Thompson, 62, of Eugene, died Monday night after being transported to Good Samaritan Regional Medical Center in Corvallis.\nA 9-1-1 report regarding the “robbery” came in at 11:24 a.m.\n“Three people were in the store, but one left, got out and helped make the report,” said Lt. Brad Liles of the Albany Police Department.\nLiles added that the incident remains under investigation, and that includes the motive of the suspect.\nPolice evacuated and closed down Pacific Boulevard between Waverly Drive and Columbus Street for more than an hour during the incident.\nNearby blocks also were barricaded by police to keep motorists and pedestrians away from Pacific Boulevard, and Waverly Elementary School was put in a lockdown.\nAt about 11:47 a.m., police heard a shot from inside the location and then an additional shot rang out several minutes later, according to an APD news release. Two hostages exited the store and reported the suspect had shot himself.\nPolice used a loudspeaker to try to communicate with anyone still inside at about 12:15 p.m. “Pick up the phone and call 9-1-1,” and officer said.\n“Please come to the front door with your hands above your head,” the officer added, moments later.\nA robot was sent inside Santiam Liquor to survey the scene, and at about 12:25 p.m., at least four members of Linn Regional SWAT, including an officer with a riot shield, went into the business and located the suspect inside.\nLiles said that the gap of about a half-hour between the shots fired and police entering the building was due to safety precautions. Authorities didn’t want to rush in and put themselves or others in danger.\n“We’re going to make sure no one else is in there. … Even though the hostages came out and said the suspect had shot himself, that’s good information, but that doesn’t mean that he’s deceased or he still couldn’t be a threat,” Liles said.\nLiles couldn’t recall a similar hostage situation in Albany.\nAbout 20 public safety automobiles, including two armored vehicles, were in the vicinity of Pacific Highway during the incident.\nDozens of residents watched the police activity along Fourth Avenue S.E., Waverly Drive and other nearby streets, with some taking photographs with their cellular phones.\nThose with information about the case should contact Detective Dan Jones at 541-917-7686."}