{"uri": "http://www.detroitnews.com/story/news/local/wayne-county/2015/01/28/detroit-shootings/22459501/", "title": "Detroit police: Gun owner arrested after teen shot", "dct": "Wed, 28 Jan 2015 00:00:00 GMT", "id": "07302ca70580164b823b6b5204957de3", "content": "Detroit — Authorities say the fatal shooting of a 13-year-old girl has led to the arrest of a convicted felon who was illegally in possession of a handgun that caused her death.\nAccording to police, it appears the girl, who may have been babysitting, was with several other children when they discovered the weapon Tuesday in a home in the 15000 block of Lappin on the city’s east side.\n“They found a handgun and started playing with it,” said Sgt. Michael Woody. “The weapon went off, striking the girl.”\nThe girl was rushed to a hospital but was dead on arrival.\nThe shooting has led to the arrest of the father of a 14-year-old boy who was in the home when the incident occurred.\n“An investigation showed that the adult was the owner of the home and of the weapon,” Woody said. “Because he was a convicted felon, he has been charged as a felon in possession of a handgun. We also discovered he has a number of traffic warrants.\n“We have presented our findings to the prosecutor’s office, and there may be other charges coming from that office. The homeowner is currently in custody.”\nThe arrest was the latest twist in a bloody Tuesday in Detroit involving shootings that included the teenage girl and two adults (including a pregnant woman).\nThe adults were wounded in a drive-by assault while sitting in a car.\nAccording to police, one of the adult victims is a witness in a homicide case.\nThe shooting was reported about 5:45 p.m. near John R and Winchester.\nA Camaro was headed north on John R when a burgundy vehicle of unknown make came up behind and someone inside sprayed the Camaro with bullets, police said.\nThe victims, including woman who is six months pregnant, drove themselves to a local hospital with non-life threatening injuries.\nAnyone with information in the shootings is asked to call Detroit police at (313) 596-2260 or (313) 596-1140."}