{"uri": "http://www.fox5vegas.com/story/33402483/lvmpd-child-suffers-life-threatening-injuries-in-accidental-shooting", "title": "Woman arrested after child injured in accidental shooting in Las Vegas", "dct": "Sun, 25 Dec 2016 23:44:00 GMT", "id": "e7d665603d537a34a581f3991ceac38f", "content": "LAS VEGAS (FOX5) -\nA woman has been arrested after a child suffered life-threatening injuries in an accidental shooting Sunday, according to Las Vegas Metro police.\nPolice said they arrested 30-year-old Shaletres Townsend in connection to the incident.\nPolice responded at about 2:30 p.m.to the 4200 block of Studio Street, near Lamb Boulevard and Craig Road for reports that a toddler had been accidentally shot.\nPolice found a four-year-old girl with a gunshot wound. The child was transported to University Medical Center, where police later said she was upgraded to stable condition.\n\"We know the bullet entered somewhere near the victim's chin and throat area, but I don't know entry and exit points,\" said Lt. Grant Rodgers. of Metro.\nAlice Woolbright, who lived in the neighborhood for 17 years said she has never seen anything like this.\n\"That hurt my heart. I'm still dizzy, I couldn't believe what all I was seeing,\" Woolbright said. \"I just can't believe this happened on Studio Street.\"\nCiting the investigation, police said Townsend left her firearm on a chair in a bedroom where children were playing and the firearm accidentally discharged striking the girl.\n\"Guns should be locked up, because kids think guns are toys,\" Woolbright said.\nTownsend was booked in the Clark County Detention Center on one count of child neglect with substantial bodily harm, police said.\n\"This is a very preventable thing that occurred. It's a tragedy,\" Rodgers said.\nPolice said parents should safely store their firearms by keeping them in a locked container or use a gun lock to prevent them from being used unintentionally.\nAnyone with information on this incident is urged to contact Metro's abuse and neglect section at 702-828-3364. To remain anonymous, call Crime Stoppers at 702-385-5555.\nStay with FOX5 and FOX5Vegas.com for developments.\nCopyright 2016 KVVU (KVVU Broadcasting Corporation). All rights reserved."}