{"uri": "http://chicago.cbslocal.com/2013/08/19/6-dead-27-wounded-in-weekend-shootings/", "title": "6 Dead, 28 Wounded In Weekend Shootings", "dct": "Mon, 19 Aug 2013 06:35:00 GMT", "id": "627467ad496d51b07b78aefa9f19d134", "content": "CHICAGO (STMW) — Six people were killed and at least 28 others, including a 7-year-old boy, were wounded in shootings across the city since Friday night.\nA 7-year-old boy was wounded in a shooting Sunday night in the West Garfield Park neighborhood.\nThe little boy was shot about 9 p.m. in the 4200 block of West Fifth Avenue, authorities said. He was listed in good condition at Mount Sinai Hospital Sunday night, police said.\nOutside the hospital, the boy’s mother said he was shot under his arm and was OK.\nThe most recent fatal shooting happened a few minutes before 10 p.m. Sunday night in the Washington Heights neighborhood on the South Side, police said.\nThe two men were shot at 9:53 p.m. near South Elizabeth Street and West 93rd Street, police said. A 27-year-old man was shot in the head and dead on the scene, police said. Another man, 28, was shot in the arm and taken in good condition to Advocate Christ Medical Center in Oak Lawn.\nThe Cook County Medical Examiner’s office could not immediately confirm the fatality.\nA man died early Sunday a few hours after he was shot in the Roseland neighborhood on the South Side, authorities said.\nBerling Robinson, 36, was shot multiple times while he was walking towards his vehicle in the 200 block of West 94th Street about 2:10 a.m., authorities said.\nRobinson, of the 8400 block of West Wentworth Avenue, was taken to Advocate Christ Medical Center, where he died at 5:35 a.m., according to the Cook County Medical Examiner’s office.\nIn a separate shooting early Sunday on the West Side, one man was killed and three others were wounded in the 100 block of South Springfield Street at 4:35 a.m., police said.\nOne man, 20, was shot in the chest and died at the scene, police said. The medical examiner’s office confirmed the fatality, but did not release the man’s name Sunday night.\nThree other 20-year-olds were hurt in the same shooting, including a woman who was shot in the head and remains in critical condition. Two other men both suffered gunshot wounds to the leg and were taken to area hospitals in “stable” condition, police said. Details on circumstances surrounding the attack were not yet known.\nAbout 11:50 p.m. Saturday, a 19-year-old man was found fatally wounded in the 800 block of South Lawndale Avenue when officers responded to a call of shots fired, police said.\nAntione Green, of the 3100 block of West Douglas Boulevard, was shot in the head and taken to Mount Sinai Hospital where he was pronounced dead at 3:14 a.m., according to the medical examiner’s office.\nTwenty minutes earlier, one man was killed and another man was wounded in a separate shooting in the 0 to 100 block of South Parkside Avenue, in the West Side Austin neighborood.\nDaquan Boyd, in his 20s, was declared dead at the scene, while the other, thought to be in his late teens or early 20s, was taken to an area hospital in “stable” condition for a gunshot wound to his hand.\nOne man was killed and another was critically hurt late Friday when an argument about beer at a party resulted in a shooting Friday night in the Northwest Side Hermosa neighborhood.\nThe shooting occurred about 11:30 p.m. after a group of co-workers at the party in the 1800 block of North Pulaski Road started arguing about beer, police said. The suspect left the party and returned with a handgun before shooting two men and pistol-whipping a third person, police said.\nJuan De la Fuente, 35, was shot in the abdomen and taken to Mount Sinai Hospital, where he died at 2:45 a.m., according to police and the Cook County Medical Examiner’s office.\nA 27-year-old man sustained multiple gunshot wounds to the body and was listed in critical condition at Advocate Illinois Masonic Medical Center, police said.\nA 32-year-old man is in custody for the shooting and charges are pending against him, police said.\n(Source: Sun-Times Media Wire © Chicago Sun-Times 2013. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)"}