{"uri": "http://chicago.suntimes.com/news/woman-killed-daughter-and-brother-injured-in-joliet-shooting/", "title": "Woman killed, daughter and brother wounded in Joliet shooting", "dct": "Mon, 26 Sep 2016 05:18:00 GMT", "id": "056240b2eadd10de787c059da4a35134", "content": "A woman was killed in front of her family in a shooting Sunday night that also wounded her brother and 4-year-old daughter in southwest suburban Joliet.\nOfficers responded about 10:35 p.m. to a call of shots fired near East Washington and Richards streets, according to Joliet Deputy Police Chief Al Roechner. Upon arrival, they met a 21-year-old man “with blood all over him,” suffering from a gunshot wound just above his left elbow.\nThe officers then found the man’s sister, 22-year-old Dinesty Tillman lying unresponsive on the ground outside a vehicle, bleeding from the head, authorities said. Inside the vehicle, the officers found Tillman’s daughters, a 4-year-old girl and a 2-month-old girl. The older child suffered a graze wound to the left knee and the baby was not injured.\nTillman, who lived in Joliet, was taken to Saint Joseph Medical Center in Joliet, where she was pronounced dead at 11:08 p.m., according to the Will County coroner’s office. An autopsy Monday determined she died of a gunshot wound to the neck and her death is being investigated as a homicide.\nThe man and 4-year-old were also taken to Saint Joseph, where the man was listed in fair condition with injuries that were not life-threatening and the girl was treated and released to family members, Roechner said.\nInvestigators learned Tillman was driving north on Richards Street and turning right onto Washington Street when shots rang out, authorities said. Her brother was sitting in the passenger seat, but couldn’t say from where the shots came. They both got out of the vehicle and Tillman then collapsed.\n“They heard the shots, then when he looked over, he realized his sister was hit,” Roechner said. “He didn’t know if the shots came from a vehicle or a person on foot.”\nAnyone with information on the shooting is asked to contact Joliet police at (815) 724-3020."}