{"uri": "http://thesouthern.com/news/local/communities/carbondale/man-fatally-shot-sunday-was-decades-long-fixture-in-carbondale/article_981b0d01-aa11-5b75-a2c6-b869ea20fd07.html", "title": "Update: One arrested after fatal shooting in Carbondale; police looking for two more suspects", "dct": "Mon, 28 Mar 2016 00:00:00 GMT", "id": "233a27926d71d086d973b04bd9a184a2", "content": "CARBONDALE — Police said Monday one man was arrested and they are seeking two others after a shooting at a party early Sunday left one man dead and one person injured.\nPolice confirmed Monday the person who was fatally shot was Timothy Beaty, a decades-long fixture in the punk rock music scene. Beaty was 41. This was the first homicide in Carbondale this year, police reported.\nDwayne John Dunn Jr., 21, of St. Louis was arrested and charged with a single count of reckless discharge of a firearm, a Class 4 felony, Jackson County State’s Attorney Michael Carr said Monday.\nDunn is alleged to have discharged a Smith and Wesson handgun on Sunday \"by shooting it into the sky in a populated neighborhood in Carbondale, which endangered the safety of numerous individuals standing in the vicinity,\" according to the complaint from the state's attorney office.\nDunn is scheduled to appear in court at 1 p.m. Tuesday in Jackson County Circuit Court in Murphysboro. He is being held in the Jackson County Jail, where his bail has been set at $500,000.\nCarbondale Police are also trying to locate two black males who are believed to be the primary suspects, a news release from the department said.\nCarbondale Police Sgt. Corey Kemp provided no additional descriptive information about the two other suspects or where they are from; he said the two should be considered dangerous. Kemp said he could not comment on the role that Dunn played in the early Sunday morning fight and shooting, as the investigation was ongoing, and disclosing such details might jeopardize the investigation.\nPolice said they responded to 402 W. Walnut St. at approximately 2 a.m. Sunday after a report of shots fired. Officers arrived on the scene of a large party with multiple people leaving the scene. Police said shots had been fired inside the house after a physical altercation; the altercation then moved outside where more shots were fired.\nWord of Beaty’s death had circulated on social media, and among those involved in the music scene in Carbondale, throughout Sunday and into Monday.\nCurtis Conley, the manager of PK's and president of the Carbondale Music Coalition, said hundreds of people stopped by the bar throughout the day and into the evening Sunday to share memories of Beaty, who often played there, and is described as one of Carbondale’s most colorful, beloved musicians. Many people even drove in from out of town as word of the devastating news hit friends who had since left Carbondale, he said.\nConley said that at first there was confusion because it would have been unusual for Beaty to be at a fraternity party, which was apparently taking place at the house police initially responded to. One male, whose identity was not disclosed, was taken to Carbondale Memorial Hospital with a nonlife-threatening injury, Sgt. Kemp said.\nPolice said Beaty was found unresponsive inside his home in a neighboring residence to where the shooting took place. Police said Beaty was the victim of a gunshot wound, and said their investigation determined Beaty was an uninvolved bystander who was not participating in the party next door. Conley said Beaty lives adjacent to the home where the party was taking place, and it is believed he was home, and hit by a stray bullet.\nSgt. Kemp would not disclose whether Beaty was alone at the time of his death, but did say officers found him when they were conducting a canvass of the area following the shooting. Kemp also would not disclose if Beaty was killed by a bullet that came through an open door or window or whether it penetrated the housing material.\nPolice asked that anyone who was at the party or anyone with any information, even if they believe the information is irrelevant, to contact the Carbondale Police Department at 618-457-3200, or call anonymously through the Crime Stoppers line at 618-549-2677.\nConley said that Beaty has been playing the drums in various bands in Carbondale since at least the 1990s.\n\"We are a group of people, some of us from here some of us not, (who) mean a lot to each other, so it breaks my heart that someone that isn't even part of this community could take away someone that was such a big part of our friend group and our music scene,\" Jones continued. \"His absence will be felt every day. This group of friends is one of the most lovable and caring bunch of people that you will ever meet, even if we're all covered in tattoos and hang out at house shows.\"\nOn Nov. 14, 2014, Matthew Dierker, 33, died after he was hit by a drunken driver while Dierker was riding his bike on the shoulder of the road near Old Illinois 13 and Bigler Road. Dierker was also a well-known musician in the Carbondale punk rock scene, and was a friend to Beaty, Conley said."}