{"uri": "http://thesouthern.com/news/local/crime-and-courts/two-men-charged-with-first-degree-murder-in-shooting-death/article_7a6a9d60-3a22-5044-a67c-eda0309e4459.html", "title": "Two men charged with first degree murder in shooting death of Carbondale musician Tim Beaty", "dct": "Fri, 17 Jun 2016 00:00:00 GMT", "id": "b0e06600bb0e9510c57c36fed47fa663", "content": "Travis Tyler and John Ingram have been charged with first degree murder in the death of Tim Beaty, a Carbondale musician who was killed in a shooting on Easter Sunday in Carbondale.\nAccording to a news release from Jackson County State's Attorney Michael Carr, a Jackson County grand jury returned a superseding indictment against the two men for first degree murder and for various firearms offenses relating to the shooting on Easter morning, March 27.\nThe shooting happened at 402 W. Walnut St. Carbondale Police have said previously Beaty was found unresponsive inside his home in a neighboring residence to where the shooting took place, and he had been shot.\nA superseding indictment takes the place of the previous indictment in this case. Tyler and Ingram had previously been charged with aggravated battery with a firearm and aggravated discharge of a firearm into an occupied building. Ingram and Tyler in April pleaded not guilty to the charges.\nTyler and Ingram, both 21 and both of Cape Girardeau, were each indicted on two counts of first degree murder; one count of aggravated battery with a firearm, a Class X felony; and two counts of aggravated discharge of a firearm, both Class 1 felonies.\nCount 1 alleges that the defendants, while acting together and in concert with each other, knowingly and without lawful justification, while committing or attempting to commit a forcible felony, aggravated battery with a firearm, shot at Nehemiah Greenlee, and thereby caused the death of Timothy Beaty.\nCount 2 alleges that the defendants, while acting together and in concert with each other, without lawful justification, while committing or attempting to commit a forcible felony, aggravated battery with a firearm, discharged a firearm at or into a building located on West Walnut Street in Carbondale, from a place outside said building, when the defendants knew or reasonably should have known the building was occupied, and thereby caused the death of Timothy Beaty.\nConviction on either count carries a minimum 20-year sentence of imprisonment and a maximum sentence of up to 60 years.\nThe charge in count 3, aggravated battery with a firearm, alleges that the defendants, while acting together and in concert with each other and being legally accountable for the actions of each other, in committing a battery, knowingly and without legal justification, caused injury to Nehemiah Greenlee by the discharge of a firearm. If convicted, this offense carries a sentence of six to 30 years in prison and is not probationable.\nCount 4 alleges that that the defendants knowingly discharged a firearm at or into a building, located on West Walnut Street in Carbondale from a place outside the building, at a time when the defendants knew or reasonably should have known the building was occupied.\nThe charge in count 5 alleges that the defendants knowingly discharged a firearm in the direction of Nehemiah Greenlee."}