{"uri": "http://www.illinoishomepage.net/news/local-news/police-investigate-campus-shooting", "title": "Police investigate campus shooting", "dct": "Sun, 25 Sep 2016 02:42:00 GMT", "id": "5ec24df57f4386dfaddaeb9ad1b99864", "content": "Error loading player: No playable sources found\nCHAMPAIGN, Ill.\nLatest: 4:25 pm, 9/26/2016, Monday\nCHAMPAIGN -- Many in the area are shocked to hear about Sunday morning's shootings happening so close to the UI campus. Police are still looking for those responsible for two shootings.\nOne happened just after 12:30 am, in the 300-block of Green Street. Three were injured and one man was killed.\nThe other shooting happened about a half-hour later in the 700-block of State Street. One person was hurt.\nPolice haven't reported any arrests yet, but investigators say the shootings may be related.\nThey say the first shooting happened as a fight in an apartment on Green Street. The gunshots happened when it moved outside near a parking lot.\nPolice say the four people hit were innocent bystanders and had nothing to do with what was happening.\nShortly after, police were on their way to State Street for the second shooting. Witnesses told 911 operators they heard shots then saw several cars going the wrong direction on the one-way street.\nOf the four people injured Sunday morning, three have been treated and released from the hospital. As of last night, one was still being treated.\nPolice ask anyone who might have been in the area to contact them. They say you might have heard or seen something you thought was insignificant but which might be crucial to moving the case forward.\nThe five people shot were not the only ones hurt in the chaos. A person running from the scene was hit by a car. That person will be okay.\nPolice say the driver initially left the scene, but has since come forward to cooperate with the investigation.\nIn light of this weekend's events, the UI is offering support. There is counseling available to any student or staff. You can stop by the counseling center or make an appointment.\nThe assistant director says they want to be there for anyone who might need help in these stressful times.\nThere is also a vigil planned for George Korchev. He's the man who died as a result of his injuries in the shooting. The vigil is at 7 pm, on the Quad.\nLatest: 11:15 pm, 9/25/16, Sunday\nCHAMPAIGN -- Around 12:30 am, Kathryn Lawlor's birthday celebration came to a startling halt. As gunshots ring out, dozens run for safety and police cars flood campustown.\n\"I was with 11 different friends and we just all went our own ways because we were panicked. Everyone was just running, yelling, screaming, getting out of the way,\" she says.\nBars were closed and people scattered. Some who didn't hear the shots decided to follow the lights.\nBrandon Taylor says, \"We didn't really think much of it, like maybe somebody is just getting pulled over. People were fighting or something, but no.\"\nTaylor and Patrick McQueen say their attitude changed when they saw a man whose face was covered in blood. They made their way to Third Street only to find out 4 people had been shot. Before the crime tape went up, they got a close enough look to see the man laying in this driveway: someone they grew up with.\nTaylor says, \"I haven't seen him in years, and the next thing you know, I see him on the ground with a bullet wound to his arm.\"\nAs officers tend to him, paramedics rush another person into an ambulance at 12:49. George Korchev was pronounced dead just after 1 am.\n\"It's just unreal to see that it's happening so much more often nowadays,\" Taylor says.\nLawlor says that's especially true when it happens at the place she called home for eight semesters. Immediately after she heard the shots, she found comfort 19 floors up, watching the chaos unfold. Reflecting on what could have been, she says the fear and sorrow she felt is matched by humble relief.\nLawlor says, \"I'm so thankful to God that I am still here. It could have been anyone.\"\nGeorge Korchev was about to embark on a new career. Advocate Condell Medical Center, in Libertyville, says he was supposed to start work as a registered nurse Monday.\nPolice have not said if they have any suspects.\nLatest: 6:30 pm, 9/25/16, Sunday\nCHAMPAIGN -- The chaos didn't stop after the first shooting. Police also were dealing with a hit and run and a second shooting. Shots were fired and a victim was hit in the 700-block of South State Street. Authorities say the two may be related, but they're still investigating.\nA night of chaos didn't end at this scene.\n\"Kind of the feeling of not knowing and knowing your life is on the line was like incredibly terrifying.\"\nJohn Michael McMahon was out with friends when the shots were fired near Green Street and a woman running from the gunfire was hit by a vehicle.\n\"It hit a woman and she went face first into the concrete and luckily she got up and I think she was okay.\"\nHe says it still doesn't seem real.\n\"I think you have a new appreciation for things, and I think you kind of keep your guard up more because we were just out having fun not expecting anything like that to happen.\"\nLess than an hour later, police made their way to State Street for another shooting.\n\"I was just in my bedroom when I heard the shots and got up and immediately called 911.\"\nGretchen Warner was settling down after getting off work.\n\"We saw cars peeling out of here fast down the street and then we saw a couple cars go the wrong way up State Street, which is a one way.\"\nPolice say a victim was shot and sent to the hospital for non-life threatening injuries.\n\"A little uneasy. We've lived here for a couple of years now and it's always been quiet until a couple months ago.\"\nWarner says lately things haven't been too quiet.\n\"Last weekend 3:30 in the morning, they're screaming and yelling all up and down the street. Last night gunshots.\"\nOther neighbors agree there's usuaslly not much action on this side of town.\n\"To hear there was a shooting on State Street, that's on this strip, that's very surprising to me.\"\nPolice say the victim hit by the car is okay. The driver has also come forward and been cooperative.\nUpdate: 11:30 am, 9/25/2016, Sunday\nCHAMPAIGN -- Police are searching for those responsible for two early morning shootings.\nPolice say five people were shot; one of them died at the hospital. The Champaign County Coroner says George Korchev, of Mundelein, was pronounced dead just after 1 am.\nPolice say it started as a fight at an apartment in the 300-block of East Green Street just before 1 am. The fight moved outside and that's when the gunfire started. Police say the four shooting victims at that scene were bystanders. Korchev was walking by when he was shot.\nAbout a half hour later, shots were fired in the 700-block of South State Street. Police say one person was shot and is expected to be okay.\nPolice say the shootings might be related.\nOfficers are also investigating a hit-and-run. One person was hit by a vehicle while running away from the shooting near campus. That person is expected to be okay as well.\nPolice have not tracked down any suspects. Anyone with information is asked to call Crime Stoppers. You can remain anonymous and may earn a cash reward.\nOriginal: 9 am, 9/25/2016, Sunday\nCHAMPAIGN -- Police are investigating a shooting near UI's campus. It happened around midnight Sunday. Four victims were found with gunshot wounds. They were all taken away in ambulances.\nAuthorities say George Korchev, of Mundelein, was pronounced dead just after 1:00 am. The other shooting victims are being treated for their injuries.\nAnother person is being treated for minor injuries after running from gunfire and being hit by a car on East Green Street.\nInvestigators believe an argument took place during an apartment party in the 300-block of East Green. The argument transitioned outside where a fight broke out and shots were fired.\nThe victims in the incident were not involved in the fight. Korchev was walking near the area when the shots were fired.\nApproximately 30 minutes later, at 1:08 am, police received another report of gunfire in the 700-block of South State Street. Upon arriving, officers found a victim taken to the hospital for a non-critical gunshot wound.\nPreliminary investigations suggest that the two shooting incidents may be related.\nCopyright 2017 Nexstar Broadcasting, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}