{"uri": "https://www.dnainfo.com/chicago/20160624/englewood/shootings-kill-1-man-wound-7-people-since-thursday-police-say", "title": "Shootings Kill 1 Man, Wound 7 People Since Thursday, Police Say", "dct": "Fri, 24 Jun 2016 09:21:00 GMT", "id": "b7f5d98f72b07d071f707e56bd1c9c13", "content": "CHICAGO — One person was killed and seven wounded in shootings since Thursday, police said.\nAt 11:10 p.m. Thursday, a 29-year-old man was shot in his head and killed in Englewood. Another man was wounded in the shooting.\nIn non-fatal shootings:\n• Most recently, at 2:04 a.m. Friday, a 23-year-old man was shot in Back of the Yards. He was seriously wounded.\n• At 1:40 a.m., a 19-year-old man was shot in West Town. Police were not sure if the shooting was self-inflicted but were investigating that possibility.\n• At 11:10 p.m. Friday, a 20-year-old man was shot in North Lawndale, said Officer Laura Amezaga, a Chicago Police spokeswoman. The man was in the 700 block of South Karlov Avenue when he was shot.\nThe man was hit in his right arm. He was taken to Mount Sinai Hospital, where his condition was not released but he was listed as \"stable,\" Amezaga said.\n• At 10 p.m., a 16-year-old boy was shot in Garfield Park, Amezaga said. Police responding to calls of shots fired found the boy lying in a lot in the 4400 block of West Wilcox Street.\nThe boy had been hit in his head and stomach. He was taken to Mount Sinai Hospital in critical condition.\n• At 8:50 p.m., an 18-year-old man was shot in Bronzeville, Amezaga said. The man was in the 400 block of East 37th Street when a man walked up and demanded the victim's property. The robber fired shots at some point.\nThe victim was hit in his leg. He was taken to Northwestern Hospital, where his condition was not released but he was listed as \"stable,' Amezaga said. The robber ran away.\n• At 6:39 p.m., a 22-year-old man was shot in South Chicago, Amezaga said. The man was walking in the 7900 block of South Essex Avenue when he heard shots and felt pain.\nThe man had been shot in his left leg. He was taken to Northwestern Hospital, where he was in good condition, Amezaga said.\nThe man was a documented gang member, police said.\nPolice originally said an 18-year-old man had also been wounded in the shooting, but they no longer think he was grazed by a bullet.\nNo one was in custody in these shootings.\nFor more neighborhood news, listen to DNAinfo Radio here:"}