{"uri": "http://www.kansascity.com/news/local/crime/article95773432.html", "title": "Killers ‘have destroyed us,’ grandmother says as she mourns KC shooting victims, ages 8 and 9", "dct": "Mon, 15 Aug 2016 14:29:00 GMT", "id": "81c49241cb5e1a3f48bf32d265473901", "content": "The grandmother of one of two boys killed in a triple shooting made a tearful plea Monday to those who fired a barrage inside the small home on College Avenue:\n“Tell them please to turn themselves in, because they have destroyed us,” Ira Ross said.\nHer grandson Montell Ross, 8, and his 9-year-old cousin Jayden Ugwuh were fatally wounded about 1:30 a.m. Saturday in the 5700 block of College Avenue as someone fired at least 20 gunshots inside their home. A 16-year-old girl also was hit, but her injuries were not life-threatening.\nPolice have not said what they think led to the shootings. One boy was declared dead soon after reaching the hospital, and the second boy died later.\nOne witness told The Star he saw a man dressed in a white T-shirt and black sweatpants rush out of the College Avenue house, followed by another man. The two jumped into a pickup parked up the street and sped away.\nPolice continued their investigation Monday. The deaths were the city’s 66th and 67th homicides of the year.\n“They have destroyed grandmothers, aunts, cousins, brothers and sisters — there are so many of us who are hurting,” said Ross, Montell’s grandmother. “We don’t know what to do. They hurt us, they hurt our babies. They hurt my grandkids. He was the baby boy, and now he won’t be back.”\nThe boys lived with a number of relatives in the small frame house on the east side of College Avenue. No one answered the door Monday.\nJayden had recently entered the fourth grade at Hogan Preparatory Academy, and Montell was in the third grade. The two started classes last week.\nSeveral social workers were on hand Monday to help students as they grieved for their slain classmates.\n“They were great kids,” said school Superintendent Danny Tipton. “I know that a lot of people say that when someone passes, but man, they were just good kids. They were outgoing and really good kids.”\nSocial workers and school administrators visited each classroom to counsel students.\n“We’re taking it one step at a time,” Tipton said. “The ones who were in their classes are taking it pretty darn hard.”\nThe 16-year-old victim, who is in the 11th grade at Hogan Prep, was in class Monday.\n“She is doing as well as could be expected,” Tipton said. “She just wanted to get back to her normal routine as soon as possible. She has a lot of friends at school, and this is a safe place for her to be.”\nRoss said Montell was a mama’s boy who still occasionally sucked his thumb. He liked playing video games and watching cartoons. He and Jayden were inseparable, Ross said.\n“He was just a happy kid,” she said.\nNeighbor Ana Garcia said Jayden and Montell were frequent visitors to her home. They would march over to ask if her younger sons could play.\nShe said she was at work early Saturday when she received a frantic phone call from her 14-year-old son. He’d heard the gunshots and then a woman screaming, “My baby, my baby,” Garcia said.\nShe told her son to find a spot inside their house to take cover until he felt safe.\nAnother neighbor, Berchard Fountain, had just brought his two dogs back inside when the gunfire sent him ducking for cover on his front porch.\n“It was about 20 to 25 shots,” Fountain said. “I laid on the porch, and I got up when the shooting stopped.”\nHe said a boy about 10 years old jumped out a window of the house, ran to Fountain’s place and banged on the front door.\n“ ‘They’re shooting my family, they’re shooting my family,’ ” Fountain said the boy yelled at him. “ ‘Call 911. Call 911.’ ”\nFountain let the boy inside his home to make the call. He didn’t let the boy leave until police arrived.\nGarcia said her children were still shaken Monday.\n“They are still a little scared,” she said. “My little girl is scared — last night she asked if we could move because she is scared.”\nGlenn E. Rice: 816-234-4341, @GRicekcstar"}