{"uri": "http://www.kjrh.com/news/local-news/hearing-continues-for-fairmont-terrace-quadruple-homicide-suspect-cedric-poore-james-poore", "title": "Fairmont Terrace quadruple murder suspects Cedric Poore, James Poore hearing continued to September", "dct": "Tue, 16 Jul 2013 10:25:00 GMT", "id": "da1171b56ebf372eb4bdd42082e9aff8", "content": "Autoplay:\nTULSA - Only two days into court proceedings, the case against a pair of Tulsa brothers accused of murdering four women inside a 61st and Peoria apartment has been pushed to September.\nPreliminary hearings wrapped up Tuesday and won't resume until Sept. 9. A motion hearing is also slated for August.\nCedric and James Poore, who have pleaded not guilty to murder and robbery charges, are suspected of shooting Misty Nunley, Julie Jackson, Rebeika Powell and Kayetie Melchor inside a Fairmont Terrace apartment Jan. 7. All four were discovered bound with gunshot wounds to the head.\nRELATED: 4 found dead, shot inside Fairmont Terrace Apartments in south Tulsa (bit.ly/Fairmontdeaths)\nTuesday's hearing focused primarily on the brother of James Poore's girlfriend, DeAndre Jones, who sat on the stand for four hours. Jones, who said James Poore lived with him and his sister at Fairmont Terrace, testified seeing the Poores with guns on New Year's Eve and overheard them talking about a future robbery the day of the murders.\n\"You ready to hit this lick?\" Jones recalled one of the brothers saying.\nDefense attorneys pounced on Jones' testimony and challenged his timeline, his prior statements to police and to a federal grand jury. At times the questioning got personal, with inquiries into his sister and James Poores sex life, including whether he knew if they were monogamous or if the couple ever invited other women over for sexual rendezvous.\nRELATED: Brothers in court in connection with quadruple homicide (http://bit.ly/15ig4OG)\nOn Monday, several witnesses took the stand, including Cedric Poore's 19-year-old daughter who testified her uncle, James Poore, admitted he killed the women.\nQuashaun Poore said she told her uncle she was scared to visit Fairmont Terrace because of the murders.\n\"He said don't worry about it. He did it and no one suspected,\" she said on the stand.\nThe Poore brothers' sister, Casey Poore, also testified James confessed to the killings and said he needed to wash his clothes because there was blood on them.\nRELATED: Brothers' arrest report details murder of 4 Tulsa women at Fairmont Terrace (bit.ly/X9tlqz)\nLaura Moore, a neighbor of Powell's testified about finding the women's bodies. She said Powell's 3-year-old son led her to the women in a bedroom.\nMoore said she ran from the apartment, screaming \"They're all dead!\""}