{"uri": "http://wavy.com/2015/06/28/portsmouth-shooting-leaves-1-year-old-boy-dead-and-a-woman-wounded/", "title": "Third arrest made in shooting that killed 1-year-old boy", "dct": "Sun, 28 Jun 2015 10:40:00 GMT", "id": "67c3bd07c435e8aad3efdeec7e3fbf40", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nPORTSMOUTH, Va. (WAVY) – A shooting in Portsmouth left a 1-year-old boy dead and a woman wounded.\nPortsmouth Police confirmed they made a third arrest in this case. Marquis D. Hinton, 18-years-old of Portsmouth, turned himself in after he learned detectives were looking for him. Hinton is being charged with 1st degree murder, aggravated assault, attempted robbery and use of a firearm in the commission of a felony.\nAccording to Detective Misty Holley with Portsmouth Police, officers responded to the report of a shooting in the 1500 block of Maple Avenue around 9:30 p.m. When officers arrived at the home on Maple Avenue, they found 1-year-old Dion Lofton Jr. with a gunshot wound to the head and a woman shot in the back.\nWAVY News 10’s Andy Fox spoke to the child’s mother Monday. Nikita Hayes says two men came in the house looking for money. She says she did not know either of them.\nAccording to court documents, witnesses told police someone knocked on the door asking to buy Marijuana and that’s when the two other suspects, armed with handguns, entered.\nThen came in the next two suspects Jerry Atkinson and Anthony Holley who police say confessed he was in the home. “They came in and said where’s the money and I said to them what money? That is when there was a lot of shooting went across,” remembers Hayes.\nShe says Dion was shot through a bedroom door. “I don’t think it was intentional. When they shot they did not see the one-year-old because we closed the door, and they shot through the door.” Hayes says she grabbed several children when the gunfire started and thought she had her son protected. “When everything stopped I looked and saw my baby laying on my bed…he was just laying down and he was shot by his cheek, so I picked him up and rushed him outside, laid him down, applied more pressure until the ambulance came.”\nMedics took the child and the woman to a local hospital where the boy died. “They did a wonderful job. He was strong and he survived all the way to the hospital, Sentara. He was then transferred to Kings Daughter, and they say he passed in the elevator,” said Hayes.\nSarah Sutton, the woman who was shot, is expected to survive, according to Detective Holley.\nHayes says she gave police permission to search the backyard shed she says is always open, “They found a gun, crack, and marijuana in my shed.” We asked her, is any of that yours? She answered, “No it’s not mine.” We asked do you know who it belongs to? She quickly answered, “No. I do not.”\nPortsmouth Police would not answer when asked about drugs in the home where Dion Lofton Jr. died. We asked Hayes were there any guns or drugs found in the house? She answered definitely, “No. None. The police asked about the shed, and not the house…nothing was in the house,” Hayes said.\nDetectives arrested Anthony D. Holley and Jerry Atkinson of Portsmouth and charged them with first degree murder, aggravated malicious wounding, attempted robbery and use of a firearm in commission of a felony. Police say during questioning Holley confessed to being one of the three men. Both are in the custody of the Portsmouth Sheriff’s Office. They appeared before a judge Monday morning and their next hearing was scheduled for July 31.\n“He was a happy baby. He brought smiles and peace to everybody. He was innocent,” Dion Lofton Jr.’s grandmother Tonia Hayes said. “I want them to bring us justice,” she added. “I don’t know who they are, but they had no reason to take a one year old’s life.”\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}