{"uri": "http://www.adn.com/article/20150323/handgun-found-near-remains-thought-belong-missing-kenai-family", "title": "Handgun found near remains thought to belong to missing Kenai family", "dct": "Wed, 28 Sep 2016 00:00:00 GMT", "id": "e8e458b6b93d28d6e776ea4d9434e48f", "content": "KENAI -- Officials said Monday that remains discovered along a trail just outside of Kenai on Saturday appear to belong to a family of four that went missing in May of last year. Police also found the remains of a dog that may be the family's and a handgun at the scene.\nOfficials emphasized they were continuing to investigate but described the case as an \"active homicide.\"\nRebecca Adams, 23, her two children, Michelle Hundley, 6, and Jaracca Hundley, 3, and Adams' boyfriend, Brandon Jividen, 37, were last seen in late May at their apartment on the Kenai Peninsula. The remains and items missing from the family's apartment were found about about a quarter-mile from where they lived on California Avenue, in a wooded lot between Alpine Drive and Borgen Avenue.\nThe bodies were found in a grassy, shrubby area about 15 yards off a trail packed down for vehicles and four-wheelers. They were in what Kenai police Lt. David Ross called a \"depression\" in the ground, but not a hole. With spring or summer foliage, the remains would not have been visible from the main trail, he said. The area was mostly brown and snow-free when the bodies were found over the weekend.\nClothing discovered at the site had been missing from the apartment, and the serial number on the gun found at the scene matched the serial number on a handgun box inside the apartment, police said.\nThe discovery came after extensive searches over the last 10 months -- including in the area where the remains were ultimately found -- turned up nothing. Ross said he could not say exactly how many man-hours had been spent searching for the family, but he was relieved that a resolution to the case appears to be on the horizon.\nEarlier Monday, the sounds of engines echoed through the air near slushy Alpine Avenue on the outskirts of town. By 9 a.m. investigators returned to a brushy area where the remains were discovered over the weekend.\nNearly 30 minutes after a string of SUVs drove past the yellow crime scene tape cordoning off the area, a medical examiner's white van followed. Just moments after its arrival, members of the Kenai Police Department pushed members of the media back and expanded the crime scene.\nA beige tent and investigators dressed in white and blue protective suits could no longer be seen from the boundaries of the scene.\nThe case began on May 31, 2014, when police responded to the home of Adams and Jividen for a welfare check. The couple, children and family dog, \"Sparks,\" were all gone, but their vehicles remained in front of the building. The apartment is located in a faded beige fourplex, one of several that line the street within sight of the Wildwood Correctional Complex.\nPolice initially said they were hopeful that the family would be found. Extensive search efforts by authorities were called off after weeks of coordinated efforts. In the months that followed, family and friends organized their own efforts but came up empty-handed.\n\"Searching for things or people in the Alaska wilderness, it's not an easy thing to find people,\" Ross said.\nThe area where the remains were found had been searched before, he said. But when pieces of evidence -- discarded clothing, the family's usual walking routes, Jividen's known bait trapping station -- pointed in the other direction, officials focused the search on woods northeast of the apartment. The remains were found to the northwest.\nOfficials said Monday it was too early to draw conclusions about how the family died. Ross said no evidence currently suggests the bodies had been transported to the location after they died.\nMonday afternoon, more than a dozen investigators from the FBI and Kenai Police Department were actively working the case. The medical examiner's office will be conducting DNA tests to confirm identification of the remains.\nRoss also read a statement from relatives of the missing family, about a dozen of whom sat teary-eyed in the packed room at city hall during the press conference Monday.\n\"Our family was deeply saddened by this weekend's development,\" the statement said. \"We will continue to work with law enforcement to bring closure to this heartbreaking situation.\""}