{"uri": "http://www.nbc-2.com/story/30102691/breaking-fmpd-responding-to-report-of-two-children-shot#.VgRCGma9CDI", "title": "Seven people injured in multiple shootings around Fort Myers", "dct": "Thu, 24 Sep 2015 01:26:00 GMT", "id": "11b9c1159dacc994de729d0ac5829035", "content": "FORT MYERS -\nA total of seven people, including a 5-year-old child, were injured in multiple shootings around the city of Fort Myers Wednesday.\nThe shootings began at 4 p.m. on Davis Court and ended just before midnight on Davis Court. At this point, it is unclear if the shootings are connected.\nHere is a timeline of the events that occurred:\nUSING OUR APP? WATCH VIDEO HERE\n4:30 p.m. - Davis Court\nThe first shooting happened just before 4:30 p.m. in the 2100 block of Davis Court. Lee County EMS met the victim, identified as Leonard Monroe Burger, 35 of Lehigh Acres, at another location. Burger was transported to Lee Memorial Hospital with non-life threatening injuries.\n9 p.m. - Veronica Shoemaker Boulevard\nA few hours later around 9 p.m., four people drove themselves to Lee Memorial after an unknown vehicle pulled up alongside them and began shooting on Veronica Shoemaker Boulevard, north of Dr. Martin Luther King Jr. Boulevard.\nTazyhion Matthews, 5 of Fort Myers, and Orvasia Green, 17 of Lehigh Acres, were admitted as trauma alert patients.\nChancey Isom, 26, and Jatravia Isom, 24, both of Fort Myers were treated for non-life threatening injuries, police said.\nWitnesses said the victims got out of a bullet-riddled four-door sedan at the hospital, some of them covered with blood. Witnesses said there were at least five bullet holes in the car.\n11 p.m. - Colonial Boulevard\nShortly after, around 11 p.m., a man was found with a gunshot wound at the Marathon gas station at 4561 Colonial Boulevard. He was transported to Lee Memorial Hospital as a trauma alert.\nThe victim was identified as Ezekiel Burger, Jr., 20, of Lehigh Acres. He is expected to survive his injuries.\nThe incident originally occurred at the intersection of MLK Boulevard and Colonial Boulevard. According to a witness, a red or maroon vehicle pulled alongside Burger's vehicle at the red light. That's when someone inside the red or maroon vehicle started shooting into Burger's vehicle.\nIt is believed the victim drove to the gas station parking lot before calling for medical attention.\n11:30 p.m. - Davis Court\nThe final shooting happened just before midnight in the 2100 block of Davis Court.\nA witness said the victim, identified as Anthony Quinn Williams, 43 of Lehigh Acres, suffered a graze wound to the head and three more wounds to the torso. He was transported to Lee Memorial as a trauma alert, and is expected to survive his injuries.\nAccording to FMPD, Williams was driving his blue Dodge Durango northbound on Davis Court when he began to take fire from unknown suspects. Williams was struck and fled from his vehicle on foot. Williams ran to a nearby residence on Davis Court seeking help.\nOfficers said they were in the area of Harlem Lakes subdivision at 11:34 p.m. when they heard gunshots. Minutes later a 911 caller said a someone was knocking on their door. Officers responded to the location and discovered Williams suffering from a gunshot wound.\nAnyone with information is asked to call the Fort Myers Police Department at (239) 321-7700, or Crime Stoppers at 1-800-780-TIPS or text message C-R-I-M-E-S (274637) Keyword FMPD. Anyone who provides information that leads to the arrest and conviction of the offender may be eligible for a reward up to $5,000. Tipsters can remain anonymous. All updates will be issued via email."}