{"uri": "http://www.abcactionnews.com/news/region-polk/winter-haven-shooting-leaves-2-adults-with-life-threatening-injuries-investigation-continues", "title": "Police conduct death investigation in Winter Haven, suspect fatally shoots 78-year-old man", "dct": "Sat, 09 Jul 2016 17:34:00 GMT", "id": "6aab263a2865f6b02ca35b07e4b1df9c", "content": "The Polk County Sheriff's Office is conducting a death investigation that occurred at 5463 Laurel Oak Drive in Winter Haven.\nAround 3:40 p.m. on Saturday, the PCSO Emergency Communications Center received a 9-1-1 call in reference to a shooting at that location, which is the home of 78-year-old Paul McLees and his wife, 72-year-old Mary McLees.\nWhen deputies arrived on-scene, they encountered Mary outside the home, and she had been shot twice. She told deputies an armed and unknown Hispanic male suspect was still in her home with her husband, Paul.\nDeputies made a tactical approach into the home and located Paul and the suspect, identified as 25-year-old Ricardo Garcia Gomez of Winter Haven, in a back bedroom, both of whom were suffering from gunshot wounds.\nAccording to the investigation so far, which is in its very early stages and is subject to change, Gomez entered the McLees' home armed with a large knife.\nWhile Gomez was forcing Paul McLees at knifepoint to open a safe, Paul McLees pulled a firearm out of the safe and began shooting at the armed and dangerous suspect. In the process, Mary was shot twice. She was able to escape and run to a neighbor's home to call for help.\nPaul McLees was unable to be revived by first responders at the scene, and was declared deceased. The suspect, Gomez, was taken to an area hospital with life-threatening injuries and is undergoing surgery.\nIt is unknown at this time why Gomez chose this location to rob these victims, or exactly how the subsequent shootings of Gomez and McLees took place.\nPCSO Deputies said they won't have any additional information about this until they are able to further interview Mary McLees and the suspect, Gomez.\n\"This is a horrific and tragic situation. We are early in this investigation and hope to be able to piece together how this 78-year-old man who was defending himself and his home was fatally shot. Our thoughts and prayers are with his loved ones.\" - Sheriff Grady Judd"}