{"uri": "http://chicago.suntimes.com/news/one-of-four-fernwood-murder-victims-identified/", "title": "One of four Fernwood murder victims identified", "dct": "Mon, 19 Dec 2016 15:37:00 GMT", "id": "b7aaab125526542ba59ef9e35e96c642", "content": "One of four victims killed in a Far South Side shooting that may have been the result of a home invasion or robbery at a “dope house” has been identified.\nOfficers were called at 12:39 p.m. Saturday to a 1 1/2-story home in the 100 block of West 105th Street in Fernwood, according to Officer Jose Estrada, a Chicago Police Department spokesman. But it wasn’t clear just when the shooting happened.\nFour people were found dead with gunshot wounds: a 41-year-old woman, a 19-year-old woman, a 45-year-old man and a 36-year-old man, according to police. Three were found inside the home, and one of the women was found outside.\nThe 45-year-old man has been identified as Scott Travis Thompson of the first block of Kempton Drive in Romeoville, according to the Cook County medical examiner’s office. The names of the other three victims have not been released.\nA fifth victim, an 18-year-old woman found outside, was taken to Christ Medical Center in Oak Lawn, where she remained in critical condition. Detectives had not interviewed her as of Sunday evening, police said.\nA 2-year-old boy was also in the house. He was unharmed and was taken to Roseland Community Hospital for observation.\n“The investigation has revealed people in the home were selling potential narcotics out that home earlier in the day,” police spokesman Anthony Guglielmi said. “And we believe individuals returned to rob occupants in that home.\n“Detectives said they have very optimistic leads,” Guglielmi said, adding that police recovered substances that appeared to be illegal narcotics from the home.\n“It’s known that people in the home knew their attackers,” Guglielmi said, adding that no weapon has been found.\nPolice initially thought the shooting may have stemmed from a domestic situation, but they walked the theory back as more evidence came to light.\nSaturday’s shooting was the third time in 24 hours in Chicago in which at least four people were shot in a single incident.\nMore than 750 people have been killed so far this year, Chicago’s deadliest since the late 1990s."}