{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-four-dead-fernwood-homicide-investigation-20161218-story.html", "title": "4 killed on Far South Side may have died in home invasion: Cops", "dct": "Sun, 18 Dec 2016 17:36:00 GMT", "id": "dc5d6980428dc8a123428792078cb4a9", "content": "The deaths of four people during an attack in the Fernwood neighborhood Saturday that also left a woman critically injured may have been part of a home invasion and armed robbery, police said Sunday.\nThe two women, ages 19 and 41, and men, ages 36 and 45, were shot to death at a home in the 100 block of West 105th Street sometime around 12:40 p.m., along with an 18-year-old woman who suffered gunshot wounds and remained in critical condition Sunday, according to police. Three of the victims killed were shot in the head and the fourth suffered multiple gunshot wounds, the Cook County medical examiner’s office determined Sunday following autopsies.\nPolice had previously said the shootings may have been related to a domestic situation, but investigators now believe the shooting may have been part of a home invasion and robbery attempt, said Chicago police spokesman Anthony Guglielmi late Sunday afternoon.\nIt appears there may have been drug-selling going on at the home, and someone who was sold to earlier in the day may have returned and committed a home-invasion and robbery, Guglielmi said. Someone in the home and someone involved in the robbery knew each other, and the home was targeted, he said.\nInvestigators believe they have good leads in the case, he said.\nEarlier information indicated a 2-year-old child believed to have been in the home at the time of the killings was wounded, but that information was incorrect. Officials later said the child was taken to Roseland Community Hospital for observation. Some news outlets were reporting the 18-year-old woman had died, but both police and a spokesman for the Cook County medical examiner’s office said she remained in critical condition Sunday.\nAuthorities went to the home after getting an anonymous 911 call saying five people were shot there, police have said. Once they arrived they found two women on the front porch — one dead, the other critically injured. Inside, police found two men and a woman, all of them dead.\nA plainclothes Chicago police officer tries to calm a woman who said she knew victims of a shooting in the 100 block of West 105th Street, where four people were found dead at the scene and another person was taken to the hospital in critical condition on Dec. 17, 2016.\n(Abel Uribe / Chicago Tribune)\nFamily said at least four people lived in the house and were tight-lipped about who the shooter might be.\nIn a news conference Saturday. Police First Deputy Superintendent Kevin Navarro on Saturday said a weapon was not found.\nAfter Navarro held a news conference Saturday, relatives of those believed dead struggled with the tragedy, saying they still didn't know which of their family members were killed, as authorities hadn't yet released the identifies of those killed.\nThey believed that one of their cousins was among the dead because he had not answered the phone all day.\n\"(Why would) somebody do something like this? Just another senseless act of violence,\" said Melvin Jackson. \"This is a massacre, man. Who would do something like this?\"\nRelatives said neighbors told them that they didn't hear gunshots but did see a truck speed backward up the one-way street just before the child fled the home.\nOn Sunday morning, sunshine glistened off the freshly fallen snow.\nStrings of crime tape used to cordon off the scene a day earlier clung to a barren tree like garland. Two Chicago police SUVs posted outside the home where the bloodshed occurred.\nLarry Lawrence, 21, who lives two blocks away, trudged past the home in his pajamas and a hooded sweatshirt. He said he heard gunshots ring out around the time of the shooting but only later learned four people had been killed.\n\"My reaction was what could someone do to push you over the edge to do something like that?\" Lawrence said. \"Families over here are hurt. And right now we don't know the motive — that's the scary part.\"\nLawrence moved to the Fernwood neighborhood five years ago in hopes of escaping the violence from Chicago's West Side. But shootings, he said, have been a common occurrence even if the death toll from the latest violence is abnormally high.\n\"No matter where you go,\" Lawrence said, \"it finds you.\"\nStreaks of smeared blood stained the white door of the two-story house and police tape blocked off its backyard.\nMeanwhile, neighbors shoveled their driveways and sidewalks, seemingly numb to the gun violence that's plagued their community.\n\"People die over here all the time,\" said one man as he drove his metal shovel across the walkway near the scene. \"I never worry. I keep to myself. The only thing to worry about is retaliation.\"\nThe man, who declined to give his name, said the young people who lived at the home appeared to be withdrawn from the other neighbors as well.\n\"It's crazy. You can't live over here without getting stopped by police or shot.\"\nThe Chicago Tribune's Liam Ford contributed."}