{"uri": "http://www.kirotv.com/news/news/man-baby-found-dead-wash-home-real-estate-agent/nm3Pw/", "title": "Teacher, 17-month-old son found dead in home by real estate agent", "dct": "Mon, 20 Jul 2015 04:58:00 GMT", "id": "58b9757dfde7832f0aab93f0806fb135", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nWHATCOM CO., Wash. - A 59-year-old teacher and his 17-month-old son were found dead inside a Whatcom County home for sale on Sunday afternoon along with the wounded family member who police say shot them.\nQuick Facts:\nFamily says victims were husband and child of woman\nPolice say woman admitted to killing them\nReal estate agent found woman and two slain victims in upstairs bedroom\nAgent was about to hold open house in home near Bellingham\nInvestigators said the woman, who family told KIRO 7 is the wife and mother of the victims, admitted to police she was the shooter.\nThe victims and the 43-year-old woman, injured with a gunshot wound to the chest, were found at the home in the 5000 block of Noon Road in Bellingham when a real estate agent came by the home for a regularly scheduled open house.\n“The real estate agent was hosting an open house at that home. And, when he went there to initiate the open house, he entered the residence and he heard a woman on the second floor calling for help,” said Whatcom County Sheriff Bill Elfo.\nThat's when all three were found in an upstairs bedroom. Police said the woman, identified as Erin Agren, killed her baby, Miles, and her husband, Michael Jordan, and then tried to kill herself. She may have been laying there for several days.\nhttp://twitter.com/JoannaKIRO7/status/623150289516802049\n“It’s surprising to find a 17-month-old that’s been murdered. It’s certainly shocking and certainly very difficult,” said Elfo.\nElfo said Agren was badly injured and investigators are still trying to figure out a motive.\nOn Monday morning, KIRO 7 found a post on the Lummi Nation School's Facebook page saying that the man killed was a teacher there and there will be grief counselors on campus during summer school.\nThe education coordinator of Lummi Nation confirmed the names of the family and said Jordan began working with special needs students there in about 2007. Agren had been an intervention specialist at the school as well until two years ago when she left during her pregnancy to be a full-time mother.\nLIKE KIRO 7 Eyewitness News on Facebook"}