{"uri": "http://www.bellinghamherald.com/news/local/crime/article28352338.html", "title": "Charges: Wife planned murders of Lummi teacher, toddler for days", "dct": "Wed, 22 Jul 2015 14:59:00 GMT", "id": "c0c6ce287f93f4d4e5c242146985cc87", "content": "A Whatcom County woman accused of killing her husband and their toddler son planned the murders for days because she was “depressed and overwhelmed (with) the changes in her life,” according to charging papers filed Wednesday, July 22.\nErin Lee Jordan, 43, née Agren, confessed to a Whatcom County sheriff’s detective that she shot her husband Michael David Jordan, 59, and their son Miles, 1, while they slept in an upstairs bedroom in their house north of Bellingham, according to the charges.\nBoth Jordans were school teachers at the Lummi Nation School. He taught high school English and special education there starting in fall 2007. She briefly taught grade school students.\nA few months after their wedding, Erin Jordan gave birth at the age of 42. She left her job to raise her son.\nThis year their two-story house at 5056 Noon Road was put up for sale. A real estate agent, Steve Mullenix, dropped by on Sunday afternoon for an open house showing. He found the doors locked and faintly heard a woman begging for help.\nHe broke in, kicked in the bedroom door and found Erin Jordan on the floor. She had a gunshot wound to her shoulder. According to the charges, Miles had been shot in his body, and Michael Jordan had been shot in the head. They were on the bed beside a .22-caliber Ruger pistol. Sheriff’s deputies believe they were dead for at least two days.\nErin Jordan survived. She remained hospitalized as of Wednesday, though she’s technically on the county jail roster on charges of two counts of murder in the first degree. She has not made an appearance in court yet.\nA sheriff’s detective, Kevin Bowhay, interviewed her at the hospital. She admitted she started planning the killings two days before the shooting, according to the charges.\n“Erin said that she was stressed, depressed and overwhelmed of the changes in her life and she believed people were watching them and stalking them,” the charges state. “Erin said that she saved Michael and Miles by doing what she did.”\nErin Jordan told the detective she got the pistol from a closet and loaded it.\nMichael Jordan was remembered by friends and coworkers as a “beloved” teacher who had found his calling in life by working with at-risk kids.\nReach Caleb Hutton at 360-715-2276 or caleb.hutton@bellinghamherald.com. Read the Dispatcher blog at bellinghamherald.com/dispatcher-blog and follow him on Twitter at @bhamcaleb."}