{"uri": "http://www.miamiherald.com/news/local/crime/article109619227.html", "title": "Fatal stabbing in Miami apartment linked to 3 shooting deaths in Collier County", "dct": "Fri, 21 Oct 2016 10:59:00 GMT", "id": "032afb6e3f3e6f218f5911a2d7847221", "content": "Police suspect that a grisly discovery at a Miami apartment complex is linked to a murder-suicide in Collier County Thursday in which a juvenile and two others were found shot to death.\nOn Thursday night, after receiving a call from Collier County detectives, Miami police raced to a four-story complex just south of Miami International Airport and banged on the door of apartment 38. When they didn’t get a response, they forced it open.\nInside the apartment they found a woman in her early 40s, stabbed to death. Earlier in the day, Collier County police found the bodies of a juvenile girl, a man and a woman inside a Chevy Malibu on the side of a highway just outside Naples. The three had been shot to death.\nFriday morning, outside the apartment building at 550 NW 51st Ave., police said they suspect the two incidents are connected.\n“At the current moment, it’s a puzzle we’re putting together,” said Miami Police Sgt. Freddie Cruz.\nA resident at the apartment complex who lived just a few doors down and who wouldn’t give his name, confirmed that police questioned residents there and that the members of the family who were found dead Thursday lived in apartment 38.\nA Miami police source familiar with the investigation said, “It’s possible it’s tied to Collier County and it’s possible those people and this woman live in the same apartment.” The source also said it’s likely that the woman found dead in the apartment is the mother of the juvenile found shot in Collier County.\nBy mid afternoon Friday police in Miami and in Collier County had still not released the names of four people found dead. Calls to the Collier County Sheriff’s Office had not been returned.\nBut Collier County Sheriff’s Office spokeswoman Kristi Lester told Miami Herald news partner CBS 4 that the death investigations are related and that police are no longer looking for suspects.\nPolice were first alerted to the tragedy Thursday morning after someone discovered a Chevy Malibu on the side of U.S. 41 in Ochopee, about 36 miles southeast of Naples.\nJames Bronson, 63, told the Naples Daily News that he passed the car about 9:30 a.m., but thought little of it other than it probably broke down. Still, Bronson said he peeked inside the car, saw a woman and believed she was sleeping. When he returned about an hour later and the car was still there, he got more curious and wandered over.\n“I went and knocked on the window and there was no movement,” Bronson was quoted as saying in by the Naples paper. “So I looked inside and I could see that there was something bad, wrong, you know. I could see blood.”\nBronson called 911. Bronson said Collier County sheriff’s deputies told him they found three people dead inside the Malibu —a woman in the front seat and a juvenile and a man in the back.\nDeputies, either through identification found inside the car or the car’s Miami license plate, were able to tie it to the apartment on Northwest 51st Avenue. So they called Miami police.\n“All I can say is that this is tragic incident. We’re asking anyone with information that can help us put this puzzle together to please come forward,” said Cruz.\nCharles Rabin: 305-376-3672, @ChuckRabin"}