{"uri": "http://www.norwalkreflector.com/Law-Enforcement/2017/01/05/Prospect-Road-shooting-being-investigated.html", "title": "Fatal shooting being investigated", "dct": "Fri, 06 Jan 2017 00:00:00 GMT", "id": "42dd06951069f439fc1264fe8dfb6768", "content": "FITCHVILLE TOWNSHIP — A fatal shooting, firearms and marijuana: the Huron County Sheriff’s Office encountered all three while responding to the 9-1-1 call Wednesday at 3741 Prospect Road.\nTrent W. McCullough made the call and reported his friend, George Ely, had suffered an accidental, self-inflicted .45 caliber gunshot wound to the abdomen, according to deputies’ reports.\n“Units responded in reference to a gentleman that was shot in the stomach,” Sheriff Todd Corbin said. “They initially came in as a self-inflicted gunshot wound.”\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done\nAfter speaking to McCullough, Corbin said he learned the wound likely was not self-inflicted. A press release from the sheriff's office noted that evidence indicated \"the shooting was not an intentional act, but it was also not self-inflicted.\"\n“I actually interviewed Mr. McCullough and during my conversation he was overcome by the grief that his friend was injured,” Corbin said. “He admitted that he didn’t mean to shoot his friend.\"\nAn injured man was not all the sheriff’s office encountered. Detective Sgt. Bill Duncan obtained a search warrant for the residence following McCullough's arrest. Deputies recovered drug paraphernalia and firearms during a search of the house.\n“It was a marijuana grow operation,” Corbin said, referring to the drug paraphernalia.\nThe firearm used to shoot the victim also was recovered from the home, where the sheriff said McCullough does not live alone. Corbin referred to the residence as a family home, but declined to elaborate.\n“We were able to canvass the area and recover all the trace evidence (including) the shell casing,” Corbin said.\nMcCullough still was awaiting his bond hearing as of Thursday afternoon. He is charged with reckless homicide, a third-degree felony punishable by nine months to three years in prison.\nCheck back at the Reflector website as more information becomes available.\nOriginal story:\nFITCHVILLE TOWNSHIP — A rural Norwalk man was the victim of a fatal shooting incident Wednesday on Prospect Road.\n“The decedent is George Ely, a 49-year-old man,” Huron County Coroner Dr. Jeffrey Harwood said today. “He lives on 1929 Scanton Road.”\nThe suspected incident happened at the 3741 Prospect Road, New London, home of 53-year-old Trent W. McCullough. The Huron County Sheriff’s Office received reports of a gun shot wound at 3:58 and 4 p.m. Wednesday.\n“He (Ely) and Mr. McCullough were acquaintances and were together at McCullough’s residence,” Harwood said. “I don’t have any information on why he was there. … I don’t know what the details are at this point.”\nThe coroner said it appears Ely was shot once in the upper abdomen by McCullough. Dispatchers received a 9-1-1 call at 4 p.m. Harwood said the victim was transported to the Fisher-Titus Medical Center emergency room, where Ely was pronounced dead at 4:39.\n“He was shot once in the abdomen,” the coroner added. “He was unresponsive and died of his injuries.”\nThe sheriff’s office and agents with the Ohio Bureau of Criminal Investigated processed the suspected crime scene.\nMcCullough was arrested and transported to the Huron County Jail. He was charged with reckless homicide, a third-degree felony punishable by nine months to three years in prison.\nSheriff Todd Corbin was unavailable for comment as of press time.\nCheck back at the Reflector website as more information becomes available."}