{"uri": "http://www.nbcsandiego.com/news/local/Murder-Suicide-Suspect-Mark-Mata-Claimed-to-Be-Psychic-Medium--289397391.html", "title": "Murder-Suicide Suspect Claimed to Be 'Psychic Medium'", "dct": "Thu, 22 Jan 2015 05:22:00 GMT", "id": "bb2dcb9a0255b88ad9c0ea319f268264", "content": "The San Diego man who police say killed his wife and son before shooting himself touted his skills as a “psychic medium” and wrote two books on the subject before his death, his website reveals.\nMark Mata, 54, was a mortgage consultant in Southern California for more than 16 years, according to his LinkedIn page. But on the side, Mata worked as a psychic medium, running a website called SpiritualClairvoyanceChanneling.com.\nThere, Mata advertises his services as a spiritual guide who can create a “spirit connection with a loved one on the Other Side,” a gift he claims to have received during the passing of Pope John Paul II in 2005. Two e-books authored by “Rev. Mark Mata” are available on Amazon.\nSan Diego police say that career ended Tuesday when he fatally shot his 42-year-old wife Min Huang and 6-year-old son Hank Mata, a first grader at Sundance Elementary School.\nOfficers did a welfare check on their Rancho Peñasquitos house after a concerned friend reported the family had not been heard from in two days. When officers looked through the back window, they saw Huang’s body downstairs.\nThey then discovered Mata’s and Hank’s bodies in an upstairs bedroom. All three had suffered gunshot wounds to their upper bodies.\n\"It’s terrible to see a child be killed because they have a whole life ahead,” said neighbor Laura Sundquist. “Who knows what their life would have been. So that’s very tragic.”\nNext to Mata’s truck, which hasn’t moved in days, friends laid a bouquet of flowers, stopping by Wednesday to pay their respects.\nNeighbor Cary Monroe told NBC 7 she is making sure her child know she loves her as they try to wrap their minds around what happened.\n“I think everyone in the neighborhood is upset and appalled by this event. I’ve called her a couple times to tell her how much I love her,” said Monroe.\nMany residents said they did not know the victims, who lived in the home for about three years.\nAt this time, investigators are not releasing any information about a possible motive for the killings or whether a suicide note was found."}