{"uri": "http://www.miamiherald.com/news/local/community/miami-dade/miami-gardens/article86366462.html", "title": "Father loses 2nd son in ambush. All 4 of his children shot this month", "dct": "Tue, 28 Jun 2016 05:43:00 GMT", "id": "6d1fa6343f571d6491a8e17ab28c93f2", "content": "In early June, distraught over a shooting inside his home that left two children with gunshot wounds and a third child dead, Tremelle Raymond Sr. vowed he was moving out of Liberty City.\nHe did. It didn’t matter.\nEarly Tuesday morning, his fourth child, 16-year-old Jemelle Raymond was shot dead inside a car in what was a quiet Miami Gardens residential neighborhood. Also killed was Dre’quan Burnett, 18. A third person, Rodney Goree, 20, was shot but is expected to survive his wound.\nMiami Gardens Police Maj. Ralph Suarez said he wasn’t certain of a motive, but it seemed as if it was some type of gang retaliation. The shooter or shooters haven’t been caught.\nOne woman who asked that she not be identified told Miami Herald news partner CBS4 that she believed the original June 2 shooting that claimed the life of Jemelle’s 18-year-old brother Tremelle Raymond Jr. was actually meant for Jemelle.\n“They say it was meant for him but they got the brother. All the foolishness going on and retaliation and stuff,” she said.\nMiami Gardens crime scene detectives, who labored well into Tuesday morning taking pictures at the shooting scene and gathering evidence, didn’t say much. Police received a call of shots fired shortly after midnight, responded and found the three victims.\nJemelle was dead at the scene. Burnett died a short while later at Jackson Memorial Hospital.\nThe shooting took place in the backyard of a home at 2435 NW 168th St., a neighborhood of single-family homes with mostly groomed yards filled with oak and mango trees. Jemelle’s body was found in a dark car in the yard just off Northwest 24th Court, against a plastic, white picket fence.\nHis body remained in the vehicle as it was driven off to the morgue later in the morning. The yard, which is not fenced in, was filled with garbage and recycling cans, lawn chairs and a basketball. A basketball net attached to a pole leaned against an oak. A teddy bear was tied to the pole.\nThe white picket fence, separating the home from a neighbor and where the bullet-riddled car came to a rest, had at least four gunshot holes. It wasn’t clear Tuesday if a woman living in the home where Jemelle and Burnett were killed was his grandmother or great grandmother.\n“I heard the shots, ‘pow, pow, pow, pow.’ I rolled out of my bed on the floor,” neighbor Inez Harris told CBS 4.\nMiami Gardens Public Affairs Director Petual Burks asked for the public’s help in capturing the shooters.\n“We need as much info as possible to get them in custody,” she said.\nJemelle’s shooting continued a string of gunfire deaths to teens and children, mostly in the Liberty City and Miami Gardens areas, that this year had reached 13 by the middle of June. Last year 35 children and teenagers were killed by guns. In all, more than 335 have been killed the past decade.\nJemelle’s death cemented the fears of Raymond Sr., who four weeks ago told the Miami Herald he stopped watching the news and planned to move from his Liberty City home because too many children were getting shot.\nOne June 2, his oldest son Tremelle Raymond Jr. was on the phone with his girlfriend when shooters showed up. He ran for cover into his home in the 6900 block of Northwest Sixth Court. The shooters followed, firing in through the front door.\nRaymond Jr. was killed. Also shot in the hand was his 11-year-old sister. His 13-year-old brother was shot behind the knee. Both recovered.\n“They saw little kids there and kept shooting,” Raymond Sr. said.\nAfter that incident, Raymond Sr. speculated the shooting might have come after a fight at an alternative school his son attended. On Tuesday, Raymond Sr. could not be reached. Miami police said he moved and they aren’t sure how to reach him.\n#breakingnews: Miami Garden neighbors say the drive by shooting victim&#39;s brother killed a few weeks ago. @CBSMiami pic.twitter.com/atlAmh3H3G\n&mdash; Silva Harapetian (@silvaharapetian) June 28, 2016\n#breakingnews: Miami Garden neighbors say bullets that killed older brother were meant for younger brother killed this morning. @CBSMiami\n&mdash; Silva Harapetian (@silvaharapetian) June 28, 2016"}