{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-shootings-memorial-day-20160530-story.html", "title": "Memorial Day weekend closes with 69 shot in Chicago, many of them on West Side", "dct": "Tue, 31 May 2016 15:51:00 GMT", "id": "affd9b2924bf3746aa7a2cc8461abcf3", "content": "Just after midnight, in one of the last shootings of the Memorial Day weekend, two people pulled out guns and started firing in East Garfield Park.\nThe first call to police early Tuesday was for one person shot on Homan Avenue. Then a second victim. Then a third. Then someone walked into a hospital a few minutes later.\nIn all, 27 of the 69 people hit by gunfire over the weekend were shot in or near the Harrison District, one of the city's most violent and one of the most heavily patrolled by police.\nSo many people were shot there that Deputy Superintendent John Escalante promised Sunday to beef up patrols. Nine more people were shot there by early Tuesday.\nThe rest of the weekend shootings were scattered across Chicago. They happened as far north as West Rogers Park and northwest as Jefferson Park and as far south as the West Pullman neighborhood. The violence centered on the West Side, though. Seven of the shooting incidents on the West Side had more than one victim.\nWhile the number of shootings was up from last year, the number of deaths was down. Last year, 12 people were killed and 44 wounded over the holiday weekend. This weekend, 13 more people were shot, but six fewer people were killed.\nThere were no shooting deaths for more than 48 hours starting late Saturday afternoon through late Monday.\nThe breakdown from the weekend is: Three people killed and 12 people wounded Friday afternoon through early Saturday; one person killed and 24 people wounded Saturday evening through early Sunday; 13 people wounded Sunday afternoon through early Monday; and 16 people shot Monday into early Tuesday, two of them fatally.\nThe holiday weekend was police Superintendent Eddie Johnson's first since Mayor Rahm Emanuel picked the veteran cop to lead the embattled department in late March. The department sought volunteers to work overtime over the weekend, although police spokesman Anthony Guglielmi did not release figures on how many officers worked. Instead of hiring more cops during a city budget crunch, Emanuel instead has relied heavily on overtime to try to tamp down violence.\nThe weekend shooting scenes played out from a gas station in Dunning on the Northwest Side to a narrow tree-lined street in the South Side's West Pullman neighborhood. Residents and passersby at times grabbed towels and ice packs to aid the wounded. Others tried to figure out if the victims were friends or loved ones.\nLeft mourning were family members, including those of Veronica Lopez. The 15-year-old was the youngest of the homicide victims, shot as she rode with two older men police identified as known gang members along Lake Shore Drive near Fullerton Avenue about 1:30 a.m. Saturday. One of the men also was hit but survived.\nThat afternoon, her mother, Diana Mercado, wept outside her family's home above a storefront in the Belmont Craigan neighborhood. She said she had begun planning to move with Veronica to Florida in a year because of the city's violence.\n\"Now they took my baby,\" she said.\nLater that day, in the Lawndale neighborhood, the mother of another teen, Shequita Evans, walked up to a scene of a woman who was shot in the neck while driving down Lexington Avenue near Pulaski Road. Evans lamented that she had to get through \"one more summer\" until her 17-year-old could graduate high school and attend college outside the city.\nAt another scene in the Back of the Yards, a woman had to explain to a small boy how the loud pops they had heard weren't fireworks from the White Sox game. The boy smoothed the cape of a Superman doll as he asked officers if they had gotten the bad guys.\nIn addition to Veronica, the homicides included:\n• Mark Lindsey, 25, shot while sitting in a parked car in front of his mother's house in the 3700 block of West 75th Place in the Ashburn neighborhood around 11:20 p.m. Friday.\n• Garvin Whitmore, 27, shot in the head about 5:20 p.m. Saturday in the South Side's Fuller Park neighborhood. He was sitting in a car with his fiancee, Ashley Harrison, 26, who picked up a gun and fired warning shots in the air. She was charged with a felony.\n• Damien Cionzynski, 25, was shot by one of two men with whom he was arguing inside a BP gas station at Narragansett and Montrose avenues around 5:15 a.m. Saturday. Police have issued arrest warrants for two men.\n• James Taylor, 44, was shot in the 5100 block of South Calumet Avenue. Taylor, of the 6500 block of South Ellis Avenue, was pronounced dead at 11:20 p.m. Monday at the scene, according to the Cook County medical examiner's office. He died from multiple gunshot wounds, the office determined following an autopsy Tuesday. Police were called to the scene and found Taylor unresponsive on the street, near a vehicle, said Officer Thomas Sweeney, a police spokesman.\n• Johan Jean, 39, was shot in the 6400 block of North Rockwell Street. Jean, of the 100 block of Ashland Avenue in Evanston, was pronounced dead at 11:44 p.m. at St. Francis Hospital, according to the medical examiner's office. He died from a gunshot wound to the neck, the office determined following an autopsy Tuesday. Jean was discovered unresponsive in a gangway, and police said he may have died in a domestic incident.\nThe tally doesn't count a woman run over on Lake Shore Drive early Sunday. Her boyfriend, who also was hit in traffic, told police they were fleeing a group of armed robbers, and detectives have located evidence of a group of men in the area.\nBy Tuesday morning, the tally of those shot in Chicago this year was around 1,500, according to data compiled by the Tribune, with at least 250 killed. By this time last year, 957 had been shot, with 164 killed.\nSo far, shootings are up more than 50 percent this year, although the pace of increased violence had slowed from earlier this year, when Chicago was on track to see shooting victims nearly double.\nChicago police have said the violence has been fueled by gang conflicts and a proliferation of guns, mixed with weak gun law enforcement. The department has blamed most of the violence on a core group of about 1,300 people whom they have used data analytics to pinpoint. The department has called them \"strategic subjects.\"\nIt can be tougher to pinpoint exactly when that violence can explode, with spikes that can spring up on any warm weekend. Over Mother's Day weekend, more than 50 people were shot, eight fatally, in the most violent weekend in Chicago since September.\nThe 60 homicides this month have outpaced those in each of the previous three years in Chicago, according to Tribune data. By May 30, 2015, there had been 45 homicides, with 41 by the same date in 2014 and 47 in 2013.\nFollowing are the other shootings from the last 15 hours of the holiday weekend:\n• A 30-year-old man was injured about 1:45 a.m. Tuesday in the 10200 block of South LaSalle Street in the Fernwood neighborhood. He was taken in in stable condition to Advocate Christ Medical Center in Oak Lawn, police said. He had been shot in the shoulder.\n• A 17-year-old girl and 21-year-old man standing in the 2600 block of East 73rd Street were shot about 12:50 a.m. Paramedics brought the girl to Northwestern Memorial Hospital with a back wound, and the man walked in for treatment. The girl's condition was stabilized, and the man is in good condition.\n• Four people were shot when two people opened fire on a group in the East Garfield Park neighborhood on the West Side. It happened about 12:20 a.m. in the 3300 block of West Huron Street, a block east of Homan Avenue. A 53-year-old was taken to Norwegian American Hospital with a foot wound, and police believe he was not the intended target. An 18-year-old woman, a 19-year-old woman and a 30-year-old man were treated at Mount Sinai Hospital for leg wounds. The 30-year-old has a history of drug-related arrests and is a documented gang member, police said.\n• A 24-year-old man was shot in the right arm and left leg about 9:30 p.m. Monday in the Grand Crossing neighborhood, police said. The attack happened in the 1500 block of East 73rd Street. The man was wounded in a drive-by and taken to Stroger Hospital, where his condition was stabilized.\n• A 17-year-old boy was shot in the 3600 block of West 30th Street in the Little Village neighborhood about 5:25 p.m., police said. The boy was shot in the hand by a known male attacker who fired from across the street, police said. The boy was taken to St. Anthony Hospital in good condition.\n• Someone shot a 16-year-old boy in the 8700 block of South Escanaba Avenue in the South Chicago neighborhood. He was wounded about 4:55 p.m. and taken to Advocate Christ Medical Center, where his condition was stabilized. He was outside when someone emerged from a gangway and shot him in the leg.\n• About 3:55 p.m., a 15-year-old boy was shot in the city's Englewood neighborhood on the South Side. That shooting happened in the 6700 block of South Sangamon Street, said Officer Kevin Quaid, a police spokesman. The boy was outside when he heard shots and felt pain, according to preliminary information. He was taken with a gunshot wound to the back to Advocate Christ Medical Center, where his condition was stabilized, Quaid said.\n• Someone shot two men about 10:45 a.m. in the 3800 block of West Gladys Avenue, said Officer Bari Lemmon, a police spokeswoman. According to preliminary reports, someone in a black Nissan fired at two men, ages 28 and 21. The older man suffered a wound to his lower back and was taken in serious condition to Stroger Hospital. The younger man was shot in the left elbow and was taken to Mount Sinai, where his condition was stabilized, Lemmon said.\n• Someone shot a 17-year-old boy about 10:35 a.m. in the 4800 block of West Monroe Street. Reports indicated the boy was outside when a black SUV drove by and someone fired shots, striking him twice in the hip, Lemmon said. The boy was taken to Mount Sinai Hospital, where he was listed in fair condition."}