{"uri": "http://sanfrancisco.cbslocal.com/2013/01/22/4-teens-hurt-in-drive-by-shooting-in-brentwood/", "title": "4 Teens Hurt In Drive-By Shooting In Brentwood", "dct": "Tue, 22 Jan 2013 14:44:00 GMT", "id": "8fa309a31df375597f167f48d45ae582", "content": "BRENTWOOD (CBS SF) — A drive-by shooting that wounded four teenagers in Brentwood on Monday appears to have been gang-related, a police captain said.\nFour teens ranging in age from 13 to 16 were standing on the sidewalk in the 1100 block of Breton Drive when three or four men drove up and commented on their clothing, according to police.\nPolice Capt. Tom Hansen said that after the verbal exchange, the suspects drove by again and fired multiple rounds, striking the four boys.\nAll were taken to area hospitals to be treated for their wounds, which were serious but not life-threatening.\nHansen said that while the exchange about the clothing leads police to believe the shooting may have been gang-motivated, investigators have no reason to think any of the victims are involved with a gang.\n“There was some conversation between the victims and the suspects. Some of the words the suspects used leads us to believe that it could have gang motivated,” Brentwood Police Department Captain Tom Hanson told KCBS.\n“However, we have no reason to believe that the victims are engaged in gang activity, affiliated, or gang members at all,” said Hanson.\nHe said that although Brentwood is “not immune” to gang activity, it is rare in the town of about 52,000.\n“This is something that doesn’t happen often in Brentwood, so obviously we’re shocked and we’re going to work diligently to identify who did this,” Hansen said.\nAn investigation into the shooting is under way and police are attempting to identify witnesses that might lead them to the suspects.\nA description of the suspects was not immediately available. Police have described their vehicle as a white or light-colored, late-model four-door sedan.\nAnyone with information about the shooting is asked to call Brentwood police Detective Aguirre at (925) 809-7726 or Detective Folena at (925) 809-7743.\n(Copyright 2013 by CBS San Francisco and Bay City News Service. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.)"}