{"uri": "http://heralddemocrat.com/news/local/spd-says-sherman-deaths-were-murder-suicide", "title": "SPD says Sherman deaths were murder-suicide", "dct": "NODATE", "id": "72273d9167cbdefb9453b0b26ebe943e", "content": "Hide caption CHRIS JENNINGS / HERALD DEMOCRAT Sherman Police wait outside a home in the 2600 block of Rivercrest Drive in Sherman Monday afternoon. Police received a call earlier in the day with concerns for the family's welfare. When police entered the house they found two children and two adults dead inside.\nMalachi Russler shot and killed his wife and two boys, then he turned the gun on himself in what Sherman police said was an apparent murder-suicide.\nMalachi Russler shot and killed his wife and two boys, then he turned the gun on himself in what Sherman police said was an apparent murder-suicide.\nPolice found Kelly Russler, 39; Laing Russler, 7; and Jayden Evans, 10; shot to death inside their Rivercrest Drive home on Monday afternoon. In a statement released on Tuesday afternoon, police said the Dallas County Medical Examiner's Officer confirmed the police investigation findings.\n\"A fourth individual, 36-year-old Malachi Russler was also found dead inside the home from a self-inflicted gunshot wound,\" the statement said. \"Based on the information we have, we consider the investigation closed.\"\nSgt. D.M. Hampton said he couldn't speculate the motive behind the killing, and, because the suspect shot himself, police do not have a definitive answer as to why it happened.\nThe divorce petition Mrs. Russler filed in December shows that the couple was married in September of 2010 and ceased to live together as husband and wife on Dec. 16. The grounds for the divorce cited by both Mr. and Mrs. Russler were the standard ones quoted often in divorce papers and simply said there was discord or conflict in the couple's personal relationship. Neither party asked for any type of protective order. The papers showed that one child, Laing, was born of the relationship. While each parent asked to have the right to determine where that child lived, neither asked that the other be prevented from having access to the child.\nMrs. Russler was represented in the divorce by Sherman attorney Talmadge Nix and Mr. Russler was represented by Reggie Smith. Neither attorney returned phone calls seeking information about their clients Monday. In a text message Smith declined to comment citing attorney and client privilege and a desire to be respectful of the family's privacy.\nMrs. Russler worked at Zodiac Seats US LLC in Gainesville. \"We are kind of in a state of disbelief,\" the company said. \"It would be hard to find someone here who didn't think the world of her.\"\nZodiac called police for a welfare check on Mrs. Russler Monday because she report to work and had not called in. \"She had never done that before,\" the company said.\nGrayson County Judge Bill Magers offered a prayer for the family as the Commissioners Court started its meeting Tuesday. He said one of the children, Laing Russler, attended Montessori Academy of North Texas run by Magers' wife, Angela Magers.\nBill Magers said he was impressed at the kind and compassionate response his wife's school received from the Sherman Independent School District when officials learned of the death of one of the Montessori students. Magers said SISD sent out a notice saying it would provide counselors at its campus to work with the students and staff who knew Jayden Evans, a student at SISD's Fairview Elementary School. However, Magers said, the private school doesn't have those kinds of resources.\n\"What you see happening is educators and folks in the community pulling together in this time,\" he said. He said it was humbling for the county's largest school district to reach out to help the private school provide the help that its students and staff might need in light of the loss of one of their own.\nThe Sherman Police statement ended with the following: \"Our hearts go out to the victims, their families, and the entire community. This is a senseless tragedy that has affected us all.\""}