{"uri": "http://www.orlandosentinel.com/news/breaking-news/os-7-shot-columbia-street-20160917-story.html", "title": "Father of 5 killed in shooting that left another six injured", "dct": "Sat, 17 Sep 2016 18:59:00 GMT", "id": "a65bd3c73e41867a2f90f056a99992c7", "content": "Dwayne Antoine Stuart didn't usually have time to see friends.\nHe worked in construction and would often stay late because he had five kids for which he provided.\nBut he caved when friends asked him to go out Friday night. He ended up at the Chill Games Room pool hall with his brother, nephews and several friends. They drank some brews, played pool and were on their way home when everything changed.\nGunfire came from a vehicle and into a crowd outside the hall about 3:35 a.m. Saturday. Seven people were hit. Stuart did not survive his injuries.\n\"They just came by shooting. They just started shooting at everyone,\" his mother, 54-year-old Mary Stuart, said Saturday afternoon. \"He was just in the wrong place at the wrong time. I can't believe he's gone.\"\nThe six others hit in the gunfire were taken to a local hospital. Two of the six were released by the afternoon. The other four were in stable condition with non-life threatening injuries. Family said Stuart did not know the others wounded.\nNo arrests have been announced, nor has a description of the vehicle been released by the Orlando Police Department.\nStuart's brother knelt down on the street and held his hand until first responders arrived. He was pronounced dead at the scene. He's completely devastated, said fiancee Deborah Hibbard, 27.\n\"He doesn't usually hang out with everyone, so this was a very once-in-a-blue-moon thing that he was out that late—then this happens,\" Hibbard said. \"It just doesn't make any sense. It's not fair at all.\"\nBefore he went out with friends, Stuart's mother says he stopped by her home, something he did often.\n\"He'd always check on me to make sure I was OK,\" Mary Stuart said. \"That's just the kind of man he was. He asked if I was doing alright then said 'see you tomorrow, mom.'\"\nShe said he was the sole provider for his household and would spend time with his kids, who range in age from 5 to 20 years old, whenever he was not at work.\nStuart has a lengthy criminal history, court records show. His most recent arrest was in 2014, where he was later found guilty of possession of cocaine and resisting an officer. He's been arrested on charges ranging from drug possession to battery dating back to 1998.\n\"Despite his background, Dwayne was a really wonderful man who provided for his kids,\" Hibbard said. \"...You hear this stuff on the news but when it happens to you it feels totally different. It's just unbelievable.\"\nAbout noon Saturday, Columbia Street from Mable Butler Drive to Bruton Boulevard remained closed off, bordered by yellow crime-scene tape. Dozens of police markers pointed out evidence — including countless shell casings — strewn about over about a block-long area in front of Chill Games Room.\nNeighbors looked on as officers walked throughout the crime scene, where several vehicles parked in a lot next to the pool hall remained.\nchayes@orlandosentinel.com; cdoornbos@orlandosentinel.com"}