{"uri": "http://minnesota.cbslocal.com/2015/03/10/more-details-released-in-coon-rapids-shooting/", "title": "Police: Awareness Of Facebook Posts Could Have Prevented Shooting", "dct": "Tue, 10 Mar 2015 15:41:00 GMT", "id": "60645a3a28ed1995d5202f4a6e21d263", "content": "MINNEAPOLIS (WCCO) – Officials released more details Tuesday on the shooting in Coon Rapids where a teenage boy accidentally shot his girlfriend and then killed himself.\nCmdr. Paul Sommer with the Anoka County Sheriff’s Office said 15-year-old Alantae Arnold shot his girlfriend Monday afternoon with a .357 Magnum at the apartment building where he lived. Immediately after, the teen ran to a nearby school parking lot and shot himself in the head.\nInitially, authorities thought that Arnold had assaulted his girlfriend.\n“It’s highly unusual in a firearms accident that someone would flee the scene and commit suicide,” Sommer said.\nThe shooting left the 14-year-old victim with wounds in her chest and head. Police say she was lying down when she was hit by one bullet. It struck her chest and then hit her in the jaw, becoming lodged behind her ear. She is expected to be OK.\nThe girl told authorities that Arnold was “playing” with the gun when he accidentally shot her.\n“In her opinion, it was not an intentional act,” Sommer said.\nPolice are investigating how Arnold got the weapon. Sommer said he likely didn’t get it through any legitimate means, and that his mother didn’t get it for him. He added that she didn’t know he had the gun.\nSommer said that if Arnold’s mother had been aware of what he was posting on Facebook, she might have been able to take action. He also encouraged all parents to tune in to what their children are posting on social media.\nImages Arnold’s Facebook account showed the teen with a gun. However, the gun pictured in those photos wasn’t the one recovered from Monday’s shooting.\n“It’s a completely different type of weapon, completely different type of gun,” Sommer said.\nCurrently, police say they don’t know how Arnold got access to the gun in the Facebook photo. They also said that no other guns were found in a search of the teen’s home.\nPolice said they can only speculate as to why Arnold took his own life following the accident."}