{"uri": "http://minnesota.cbslocal.com/2015/07/13/mother-of-girl-accidentally-shot-by-boyfriend-speaks-out/", "title": "Mother Of Girl Accidentally Shot By Boyfriend Speaks Out", "dct": "Mon, 13 Jul 2015 22:32:00 GMT", "id": "b62331746c37c6002ed4c8deecf64868", "content": "MINNEAPOLIS (WCCO) – The mother of a 14-year-old girl accidentally shot by her boyfriend earlier this year has moved her daughter out of state.\nIn March, Keely Neal and Alantae Arnold, 15, were hanging out in the apartment where he lived in Coon Rapids. Neal said Arnold accidentally shot her.\nShe survived. He left the home and took his own life.\nNeal’s mother, Micki, told WCCO, in an exclusive interview, that this was a wake-up call for her, and she hopes it serves as a warning for other parents.\n“This has been extremely tough,” Micki Neal said.\nNeal calls the past few months some of the most trying of her life.\n“I could’ve lost my daughter, and I’m really grateful that she’s okay,” Neal said.\nAccording to the investigative report, Neal and Arnold were lying on his bed, when she says he accidentally shot her.\n“She didn’t know what was wrong,” Neal said. “She knew she was bleeding here and she could hardly hear and everything was getting fuzzy.”\nArnold’s mom was home and frantically called 911, telling a dispatcher her son is crying, and she needs an ambulance.\n“She’s shot!” his mother said.\nArnold fled the Winchester Place Apartments. Police swarmed the property and later found him in a wooded area not far from his apartment. He had shot himself in the head, the gun still in his right hand.\n“I couldn’t imagine how it was for him,” Neal said.\nWCCO obtained the investigative report into the shooting; family members interviewed described a troubled teenager. Arnold’s grandmother said he skipped school frequently and was scheduled to be in court the same week as the shooting for stealing his principal’s iPad.\nShe claims Arnold acted out and at one point choked his mother.\nHis mother told police Arnold was diagnosed with ADHD and was seeing a counselor who called him “a juvenile delinquent” who would hopefully grow out of it. She said she did not keep guns in the home.\nWCCO uncovered the .357 magnum used was stolen from a Coon Rapids home, where Arnold and Neal attended a party a few nights before. That theft remains under investigation.\nOn Facebook, two pictures of Arnold holding a gun surfaced shortly after the shooting. Police say the guns Arnold is holding are different weapons.\nWCCO discovered his dad saw the pictures “four to five months before the shooting.”\nAccording to his statement, he confronted Arnold about the picture on Facebook. He said Arnold “swore up and down it was fake. He was just doin’ it to … take a picture and … it was a BB gun.”\nMicki Neal also found the pictures and learned her daughter had seen them before the shooting. It left her feeling she failed as a parent.\n“It sickens me,” she said. “It makes me feel guilty.”\nAnd she learned more about her own daughter and what she was into.\n“I think marijuana,” she said. “I think the kids got together and sometimes drank.”\nShe said she looked the other way when her daughter began isolating herself, being stand-offish and was always tired. The shooting made her realize she needs to be a more active participant in her daughter’s life.\n“I couldn’t get into her Facebook page,” she said. “I couldn’t get into her phone. We know who they’re talking to, the parents, talking to the friends or the boyfriends but not just talking to them but getting to know them.”\nNeal’s injuries kept her in the hospital for four days. Surgery treated her wounds but more healing is needed. Micki Neal said doctors diagnosed her daughter with PTSD and the emotional scars linger.\n“We’re still going to be dealing with this for years down the line, as well as his family,” she said.\nShe said after the shooting, she found her daughter was once again hanging out with a teenager with a gun. When she learned that, she realized there was much more work to be done. The family has moved out of state and is going through counseling."}