{"uri": "http://www.nbcphiladelphia.com/news/local/Boy-Shot-10-Times-in-Germantown-Doing-Better-Shooters-Still-at-Large-390501901.html", "title": "Boy, 6, Shot 10 Times in Germantown Doing Better, Shooters Still at Large", "dct": "Wed, 17 Aug 2016 23:04:00 GMT", "id": "55cf16cc88c8defea63a47ab19902455", "content": "Mahaj Brown is alert and talking with visitors to his room at St. Christopher's Hospital for Children as the 10 gunshot wounds he sustained last week continue to heal, his aunt tells NBC10.\nThe 6-year-old was riding in his godfather's car near Ashmead Street in Philadelphia's Germantown section last Thursday night when a spray of bullets peppered the vehicle. He was hit 10 times, his family said, with at least one bullet entering his chest.\nAs he was being rushed to the hospital, Brown told family \"I can't believe I'm shot.\"\nAt a cease fire vigil Wednesday, Brown's aunt said the boy has been taken off a breathing machine and is doing much better. Brown's mother, Laprea Brown, also said he won't be released from the hospital for another three to four weeks. She also said the boy is in good spirits despite his injuries.\n\"I want to see him back to the Haji that we know,\" she said. \"The fun-loving, outgoing kid that he is.\"\nBrown was one of four people hit by gunfire, which investigators believe stemmed from a turf war between two groups of men. None of the injured were intended targets, police said.\nSome 40 rounds were fired down the block around 11 p.m. that night from an assault-style rifle and two handguns, police said.\nSo far, no one has been arrested for the shooting. The vigil focusing on stopping gun violence is the second held in the neighborhood after the shooting. Neighbors, Brown's family and police are frustrated by a lack of tips about the shootout.\nDetectives said the shooters fled in a newer model Mercury Mountaineer SUV that is painted two colors and has running lights. A $10,000 reward for information leading to an arrest and conviction.\nAnyone with information can contact the Philadelphia Police tipline at 215.686.TIPS."}