{"uri": "http://www.syracuse.com/news/index.ssf/2015/02/suspect_in_tipperary_hill_bar_shooting_identified_charged_with_attempted_murder.html#incart_river", "title": "Syracuse parolee arrested, 2 victims in critical condition after shooting at Tipperary Hill bar", "dct": "Mon, 02 Feb 2015 15:37:49 GMT", "id": "082038d48dff4fa2a55f33b025cedb84", "content": "SYRACUSE, N.Y. -- Police have charged 22-year-old Michael Morris, of Syracuse, in connection with the shooting at McAvan's Pub in Tipperary Hill early Sunday morning.\nThe shooting occurred after Morris, a parolee recently released from prison, ordered his ex-girlfriend at gunpoint to bring him to McAvan's, where her family was celebrating a birthday party, Police Chief Frank Fowler and Mayor Stephanie Miner said in a news conference.\nMorris opened fire on the bar, striking five people, including the ex-girlfriend's brother, police said. Two victims are in critical condition and another two victims are in serious condition, officials said. Another has been released from the hospital, officials said.\nMiner and Fowler provided the following account:\nMorris' ex-girlfriend, a 29-year-old woman, encountered Morris and his current girlfriend Saturday night around 10:30 p.m. at a market on Bellevue Avenue. Morris was released from prison on Dec. 5, 2014 after serving a five-year sentence for stealing a handgun in a 2009 burglary in Syracuse. He was serving another five years of supervised release.\nAt the Bellevue Avenue market, Morris threatened the ex-girlfriend with a handgun and ordered her into his car. After driving to various locations in the city of Syracuse and in Onondaga County, they drove to McAvan's.\nMorris ordered the woman into McAvan's pub, where she knew friends and family were gathered for a family member's birthday.\nHe told her to act as if there was no problem, but her 24-year-old brother sensed something was wrong. The brother tried to separate Morris from his sister.\nThat's when Morris pulled out a handgun and fired the first shot, striking the 24-year-old and seriously injuring him.\nMorris continued to fire, as two men, 28 and 31, wrestled the suspect out the front door. One of those men and another 28-year-old man were each struck by three bullets during this time. One of them is in critical condition and the other is in serious condition. The 31-year-old man was shot once, and has since been released from the hospital.\nBefore fleeing with his current girlfriend, Morris went back into the bar and fired another shot, this time hitting a 24-year-old man who was exiting the men's room, where he and others had taken cover. That man was critically injured, police said.\nAfter Morris left, police arrived on the scene, where several victims and witnesses said they knew Morris and cooperated in the investigation. Officers were able to locate Morris and his girlfriend at his home, 1613 W. Onondaga St.\nHe was arrested and charged with five counts of second-degree attempted murder, second-degree kidnapping, second-degree criminal possession of a weapon and first-degree reckless endangerment, all felonies. He has also been charged with misdemeanor second-degree menacing.\nMorris is being held at the Onondaga County Justice Center pending his arraignment in city court. Police are not releasing a booking photo of Morris.\nMorris has had prior police contact in addition to the burglary arrest, Lt. Eric said. He would not comment further on Morris' criminal history because that police contact happened when he was a juvenile, Carr said.\nFowler said police would not release the names of the victims to protect them and because investigators need to interview them as witnesses.\nPolice are not saying whether they have recovered any weapons in connection with the crime. Fowler said the department needed to complete their ballistic and forensic investigation before determining what weapon or weapons were used in these crimes.\nNo other arrests have been made in the shooting, but the investigation is still ongoing.\nPolice have asked that anyone with information call 315-442-5222.\nContact Julie McMahon anytime: Email | Twitter | 315-412-1992"}