{"uri": "http://www.syracuse.com/news/index.ssf/2015/02/lawrence_gabriel_tipp_hill_shooting_mcgavins_pub_west_crime.html", "title": "Hero of McAvan's Pub mass shooting: Now bouncer needs a hand", "dct": "Wed, 04 Feb 2015 11:12:31 GMT", "id": "35ee8a574eee887152eea31bc6245cb6", "content": "SYRACUSE, N.Y. -- A bouncer at a Tipperary Hill pub is a hero who wrestled out of the bar a gunman on a shooting spree early Sunday morning, the bouncer's fiancee said.\nLawrence Gabriel, 28, was working his weekend shift at McAvan's Pub at 12:50 a.m. when he saw his best friend, Douglas Spossey, 24, get shot in the chest.\nThe shooter, Michael Morris, then opened fire on others at the bar, police say.\nGabriel, a U.S. Army vet and a boxer, came to the rescue. He was able to pull the shooter out of the bar with help from his cousin, Joshua Kennedy, said Gabriel's fiancee, Megan Holmes, 23.\nGabriel was shot four times during the struggle, she said, and Kennedy was also wounded. A total of six people were shot in the spree. All are expected to live.\nAuthorities had only said two men pulled Morris out of the bar, but early Wednesday morning police confirmed the names of those wounded in the shooting spree.\nSpossey posted on Facebook that Gabriel's actions saved lives that night.\n\"He is the reason Me, and countless others are still alive right now,\" Spossey wrote. He asked the public to help via a gofundme page for his friend.\nHolmes said she was not surprised that Gabriel risked his life for others. The father of two young boys did a tour of duty in Iraq and is still in the U.S. Army Reserves.\nGabriel is still in critical condition in the intensive care unit at Upstate University Hospital, she said.\n\"It's not even a day-by-day thing right now. It's hour-by-hour,\" she said.\nThe funds earned will go toward any hospital bills not covered by their insurance, and toward living expenses for their family while Gabriel recovers, she said.\nOfficials said Morris took his 29-year-old ex-girlfriend, Rebecca Spossey, hostage at gunpoint around 10:30 p.m. Saturday. They drove around the city with his new girlfriend before going to McAvan's Pub where he knew the woman's family members were celebrating a birthday.\nWhen they entered the bar, Douglas Spossey noticed his sister's discomfort and tried to separate the two, officials said. That's when Morris opened fire, police said.\nA family member confirmed that two of the other shooting victims were Rich Lighton and Jake Palmer. Those two and Gabriel remain in the hospital.\nPolice said the sixth shooting victim is 35-year-old Cristina Voultsios."}