{"uri": "http://www.wcax.com/story/31390020/911-calls-released-in-shrewsbury-deadly-domestic-shooting-case", "title": "911 calls released in Shrewsbury deadly domestic shooting case", "dct": "Mon, 07 Mar 2016 22:00:00 GMT", "id": "ae7c28d10dd73e68155550344f9951dd", "content": "RUTLAND, Vt. -\nIt was a domestic dispute that turned deadly. Police say Frank Weir, 54, shot and killed his longtime girlfriend at their Shrewsbury home last month. He was in court Friday for a motion hearing after being arraigned last week.\nWeir is currently being held without bail until his trial, and Friday the state's attorney presented some evidence to uphold that, including 911 calls made the night Weir claims he accidentally shot Donna Marzilli.\nWhen Weir's mother, Joan Carlson, was asked for her reaction, she said, \"Oh my God, Frank, no.\"\nCarlson woke up just before midnight Feb. 15 when the phone rang. It was her son, Frank Weir.\n\"He was emotional, and he said, a terrible thing, an awful thing, something like that, has happened. And I said, what happened? And he said Donna and I had a little dispute and we had a tussle over the gun,\" said Carlson.\nWeir claims his longtime girlfriend, Marzilli, pulled a gun on him. He says he tried to take it away from her, but it went off, shooting Marzilli in the chest and killing her. Weir immediately called 911.\nDispatcher Christina Kramer: 911, Where is your emergency?\nWeir: 6718 Cold River Road... I just had an accident with a gun.\nThose calls were recorded and played by the prosecution in court Friday. Vermont State Police Dispatcher Christina Kramer was the one on the phone with Weir. She says he hung up on the first call, and police called him back.\nCall: Where is the gun?\nWeir: I don't know... I don't know where it is. She got it out of my hand and the trigger went off and I shot her. Oh, my God, I didn't mean to do it.\nState's Attorney Rosemary Kennedy also presented the court with calls between Weir and his mother when he was taken to Marble Valley Regional Correctional Facility in which he describes how the dispute came about.\n\"We were having a verbal disagreement about a private matter between us... my big mistake, I should have just let her shoot me,\" said Weir on the phone.\nThe motion for bail hearing continues Wednesday with filings from both the defense and the prosecution, Judge Thomas Zonay will issue a written decision at that time regarding Weir's bail.\nWhile on the stand, Weir's mother said that she video chatted with both her son and Marzilli twice that day, and everything seemed normal. In the phone calls between her and her son, they speak about a history of disputes between the couple.\nWeir is being held on charges of second-degree homicide and aggravated assault.\nDomestic dispute turns deadly in Shrewsbury\nShrewsbury man pleads not guilty to girlfriend's murder?"}