{"uri": "http://www.detroitnews.com/story/news/local/michigan/2016/06/28/gunplay-death-costs-mich-parents-sons/86498796/", "title": "Gunplay death costs Mich. parents both sons", "dct": "Tue, 28 Jun 2016 00:00:00 GMT", "id": "fe61192247193a035a9cbf8e2d670289", "content": "Jackson — Elaine and Brian Spitler were returning home from Meijer in December 2014 when Elaine spotted the flashing lights of police and fire vehicles in their neighborhood.\nTurning down their cul-de-sac, they realized the vehicles were in front of their home. Brian fretted one of their sons had caused a fire while cooking.\nIt was worse than that.\nRiley Spitler, then 16, thought a gun was empty when he jokingly pointed it at his 20-year-old brother and pulled the trigger, he later told police.\nThe bullet struck Patrick in the heart, killing him.\nRiley was later convicted of second-degree murder and, three months ago, was sentenced to up to 46 years in prison.\n“It’s such a tragedy,” said Kevin Pearson, a friend of Pat’s. “The family didn’t just lose Pat. They lost Riley, too.”\nThe parents’ anguish didn’t stop there.\nThe weapon that killed one son and sent the other to prison was bought by their mother, said Blackman-Leoni Township police.\nRiley had convinced his mom he needed the .380-caliber Taurus semiautomatic for self-defense.\nShe never told her husband, who didn’t allow guns in the home, police said.\nSo today, in a quiet, emptier home on a dead-end street, a grieving man feels betrayed and a grieving woman bears guilt for their sadness.\n“I could just strangle her. She didn’t tell me anything,” Brian told an officer about his wife, according to video from the officer’s body camera.\nThe Spitlers, who declined comment, are preparing to appeal the verdict to the Michigan Court of Appeals. Their attorney, Al Brandt, also declined comment.\nDuring the sentencing, Brian Spitler lambasted prosecutors for pushing for such a long prison term.\nJackson County Assistant Prosecutor Steve Idema objected to the criticism, telling the judge Spitler wasn’t speaking on behalf of Patrick, according to a transcript of the hearing.\n“I am speaking on behalf of Patrick,” Spitler spat at Idema. “I’m the only one in this room who represents Patrick.”\nIdema declined comment for this story.\nThe story of how a single, horrific incident cost the Spitlers both of their children comes from interviews, trial transcripts, court files and police records. The records contained videotaped interviews of witnesses, including a 90-minute interrogation where Riley seemed to speak candidly about the incident and his life.\nThe two brothers couldn’t be more different, Riley told police during the interview six days after the Dec. 6 shooting.\nRiley was a quiet, sullen loner, he and others told police. Despite being smart and articulate, he dropped out of school in the ninth grade.\nRiley told police he doesn’t like being told what to do.\n“I’m not the most talkative or social person ever,” he said. “I don’t really take help from anybody. I don’t really listen to anybody.”\nRiley, who worked at McDonald’s, said he sometimes sold drugs for a friend.\nPat, on the other hand, was a popular chatterbox with a goofy sense of humor, said his friends.\nHe also was a workhorse, putting in 18-hour days at Gordon Food Service and the Jackson YMCA.\nAt the YMCA, where he was a coach, bus driver and summer camp counselor, he was a favorite of the kids, chief executive Rick Wilson said.\nChildren were drawn to his constant smile and upbeat personality, Wilson said. He made them laugh by dressing up as Batman and Scooby-Doo.\n“Each and every day was a joy when Pat was in our building,” he said.\nPat tried to encourage his brother to do better, said friends. He felt Riley was smart and articulate but was wasting his life.\nPat had to tread carefully to avoid arguments with the volatile Riley, said friends.\nThree months before the 2014 shooting, the brothers fought after Pat criticized Riley, Riley told police.\nThey pushed each other, Riley struck Pat and Pat wrestled him to the ground.\n“We would just fight all the time,” said Riley. “We straight up didn’t like each other.”\nBehavior unknown to dad\nOn Nov. 26, 10 days before the shooting, Riley and his mother visited a Dunham’s Sports store in Jackson.\nShe paid $225 for the Taurus handgun in cash, according to the receipt, contained in the police file.\nRiley told police his mom was aware he was selling drugs. He said that was the reason he gave her for needing the gun.\nThat wasn’t the only thing Elaine Spitler knew about her wayward son.\nIn his bedroom was another semiautomatic handgun, two revolvers and a duffel bag holding four one-gallon Ziploc bags containing marijuana marked Chronic Thunder, Critical Rush, Liberty Haze and Blueberry.\nRiley told his mom he was holding the drugs and weapons for a longtime friend who had recently been charged with carrying a concealed weapon, he told police.\nAsked by police why his mom allowed such behavior, he said he often got his way by threatening to run away.\n“I know what you think about my mom,” Riley told police. “You know, horrible mother, horrible mother of the year.”\nHe said his father didn’t know any of this. Brian Spitler was never home, working two jobs as a bank security guard and at a phone parts warehouse.\nBrian Spitler told police he learned about the drugs and guns right after the shooting when his wife told him about them, according to video from an officer’s body camera.\nGun worried older brother\nShortly after receiving the Taurus, Riley was walking into the house one day when he flashed it to his brother.\nPat, who was eating at the kitchen table, stopped chewing and asked whether it was real, Riley told police.\n“His eyes lit up,” said Riley.\nPrivately, Pat was concerned, he confided in several friends.\nA week after seeing the gun, Pat was taking a weekly run with Dalton Dueck and asked if his friend could keep a secret, Dueck later told police.\nPat, who didn’t know about the other weapons in his home, told Dueck about the gun, saying he was worried Riley might hurt someone. Dueck asked Pat if he was afraid Riley might hurt him.\n“He was, like, right off the bat, ‘No, not at all.’ He was real adamant,” Dueck told investigators, according to police video of the interview.\nPat told Dueck he had talked to his mom about the gun but she didn’t want to confront Riley. He apparently didn’t know his mom had bought the weapon.\nPat said if he couldn’t resolve the matter in a few days, he would tell his father about it, Dueck told police.\nTwo days later, Pat was dead.\n‘You shot me’\nOn the night of Dec. 6, Pat was sitting on his bed, texting a friend, when Riley came into his room with the Taurus.\nWaiting for his brother to finish, Riley loaded and unloaded the gun, he told police.\nPat’s trophies from high school and youth soccer were on the dresser, according to video from an officer’s body camera. A blow-up Spiderman stood in the corner.\nRiley showed Pat how quickly he could rack the slide, and then handed the unloaded gun to his brother to see how fast he could do it, he told police.\nRiley reloaded the gun, racked the slide, which ejected a bullet, and pointed the weapon at his brother.\n“Let’s see if it’s your lucky day,” he said.\nHe pulled the trigger.\n“You shot me,” screamed Pat.\nRiley, who had had the weapon for just 10 days, later told police he thought he had released the magazine before ejecting the bullet.\nIn fact, the six-bullet magazine was still connected to the gun, feeding another round into the chamber when the first one was ejected.\nRiley called 911 while holding a rag to his brother’s heart.\n“Breathe, please breathe,” said Riley, according to a recording of the call. “I love you, Pat. I love you.”\nRiley rushed outside to greet the police but his front glass door was locked or jammed so he used his fists to break through it, he said.\nBarefoot and shirtless in the December cold, he didn’t realize his right hand was bleeding.\n“I don’t care if I spend the rest of my life in jail,” he told an officer. “I just need to know that he’s alive.”\nPolice skeptical of account\nPolice and prosecutors didn’t believe Riley’s story.\nThey doubted that Pat, after expressing fears about the gun, would play with it.\nThey said a more likely scenario, given the brothers’ turbulent relationship, was that Riley got angry for some reason and shot Pat.\n“I think your brother was giving you some crap about the guns and you tried to intimidate him and the next thing that happened: you shot him,” Detective Chris Boulter told Riley during the 2014 interview.\nBoulter declined comment.\nDuring a five-day trial in Jackson County Circuit Court, prosecutors made hay of Riley’s troubled past, talking about how he sold drugs and hid guns for his friend.\nThe jury could have convicted Riley of involuntary manslaughter, punishable by up to 15 years in prison.\nInstead, after deliberating two days, it found him guilty of second-degree murder, punishable by up to life.\nInvoluntary manslaughter involves careless behavior while second-degree murder involves an action that shows utter disregard for life.\nAnother name for the latter is depraved heart murder.\nRiley, who also was convicted of possession with intent to deliver marijuana and two counts of possessing a firearm during a felony, was given a prison sentence of 24-46 years.\nHe’ll be eligible for parole in 20 years.\nOn the night of the shooting, sitting in an ambulance getting his hand treated, Riley repeatedly asked police and paramedics how his brother was doing, according to police videos.\nFearing how he would respond, they lied and said they didn’t know.\n“Please tell me he’s still alive,” said Riley. “If not, just shoot me dead ’cause I can’t do this. This is my brother’s blood on my hands.”\nfdonnelly@detroitnews.com\n(313) 223-4186"}