{"uri": "http://www.sandiegouniontribune.com/news/public-safety/sd-me-heights-folo-20161116-story.html", "title": "3 now dead in City Heights shooting, including gunman police killed", "dct": "Wed, 16 Nov 2016 15:50:00 GMT", "id": "2c5a66567d7cc10029813289d789f125", "content": "The man killed by a San Diego police officer in City Heights Sunday night after he shot his ex-wife and mortally wounded her parents had a restraining order filed against him this year, according to court records.\nJuan Carlos Fernandez is accused of shooting Isabel Gonzalez, 21, and three members of her family in the courtyard of their apartment complex on Marlborough Avenue south of University Avenue.\nSan Diego police Capt. Brian Ahearn said on Wednesday it’s unclear why Fernandez went there about 9:15 p.m. Sunday, but investigators believe he got into a fistfight with his ex-wife’s boyfriend over the pair’s relationship.\nAfter the fight, police said Fernandez went to his car and got a handgun, chased the boyfriend away and then returned to the apartment complex and opened fire.\nGonzalez and her 67-year-old grandfather were wounded. Her parents, Reyna Gonzalez, 42, and Julian Gonzalez, 45, were killed. The mother died Sunday, and the father died Wednesday morning, Ahearn said.\nThe mother was shielding her daughter when she was shot, Ahearn said. The father was trying to wrestle the gun away from Fernandez when he was wounded, a family member said.\nFernandez dragged his ex-wife into the street and had her in a headlock, his gun trained on her, when police arrived.\nOfficer Ross Bainbridge, who was accompanied by an officer in training, repeatedly told Fernandez to lay on the ground, Ahearn said.\nInstead, the gunman threatened to harm the woman or police, the captain said. Bainbridge then shot Fernandez once with a shotgun, killing him. Ahearn said the officer is a 12-year veteran of the department.\nThe slain couple were excellent role models who always took care of and protected their family, said daughter Cecilia Gonzalez. “Our family is in terrible pain after losing our parents,” she said Wednesday.\nShe said despite such devastating losses, their family does not blame the Fernandez family. A GoFundMe page was started to help with funeral costs.\nFernandez was initially identified by the county Medical Examiner’s Office as a former boyfriend of Isabel Gonzalez, but court records show they we married on Halloween in 2014.\nThe couple separated nine months later. A divorce was filed in December 2015, and in February Gonzalez filed for and was given a restraining order against Fernandez.\nIn a letter to the court, she said Fernandez would randomly show up at her apartment to try to talk with her. He would tell her his friends had seen her leaving her home at specific times, making her feel as if she were being watched.\n“I don’t feel safe even walking out of my house,” she wrote.\nFernandez disagreed with the restraining order, saying he was merely trying to talk with her to see if he could change her mind about the divorce, according to court documents.\nHe wrote that he would never harm her or her dog. “Plus, I don’t know why I would harm anyone,” he said.\nThe court granted a one-year restraining order in March, saying there was “evidence that domestic violence or a threat of domestic violence has been committed.” Fernandez was advised he couldn't own, possess or buy guns, and pledged that he didn’t have any firearms or ammunition, according to court records.\nTwitter: @LAWinkley\n(619) 293-1546\nlyndsay.winkley@sduniontribune.com"}