{"uri": "http://www.kbtx.com/home/headlines/Active-Shooter-Situation-Reported-At-Fort-Hood-253635771.html", "title": "Argument May Have Preceded Deadly Fort Hood Shooting", "dct": "Thu, 03 Apr 2014 00:00:00 GMT", "id": "d420dc1795b793d3b324375f39639338", "content": "Milley, said investigators are looking into whether Lopez had a \"verbal altercation\" with another soldier or soldiers before the shooting late Wednesday afternoon.\nMilley said there’s \"very strong evidence\" that Lopez had a medical history indicating an unstable psychological condition and that it was believed to a \"fundamental underlying cause\" in the shooting.\nMeanwhile Thursday afternoon, the conditions of three shooting survivors at Scott & White Hospital in Temple were upgraded from critical to serious.\nFive of the six other victims taken to Scott & White Wednesday were released during the day Thursday, the hospital said.\nOne remained in the hospital in good condition.\nThe three most seriously injured victims suffered spinal, neck and abdominal injuries, doctors said earlier Thursday.\nThey have undergone surgery and two will require additional surgery, one Thursday and one Friday.\nDoctors said during a news conference Thursday morning that all of the critically injured victims should survive, but said they “are not out of the woods yet.”\nSeven others were taken to Carl R. Darnall Army Medical Center and three remained there Thursday.\nInformation about their injuries and conditions wasn’t immediately released.\nMilley confirmed Thursday that the .45 Smith and Wesson semi-automatic handgun Lopez used in the shooting was purchased on March 1 at Guns Galore in Killeen, the same gun shop where Army psychiatrist Nidal Hasan purchased weapons used in the Nov. 5 2009 shooting rampage at the post’s Soldier Readiness Center that left 13 dead and more than 30 injured.\nA tip from the same gun shop led to the arrest of AWOL Muslim soldier Pvt. Naser Jason Abdo in June 2011.\nAbdo was later convicted of plotting to set off bombs in Fort Hood area restaurants frequented by soldiers and their families.\nEmployees confirmed Thursday that U.S. Bureau of Alcohol, Tobacco, Firearms and Explosives agents were at the store after the shooting, but declined further comment.\nInvestigators were searching the gunman's home and questioning his wife Thursday.\nLopez deployed to Egypt from January 2007 to January 2008, apparently as a National Guard member.\nHe entered active duty service in June 2008, according to Fort Hood.\nHe deployed to Iraq from August 2011 to December 2011.\nLopez came to Fort Hood from Fort Bliss where he was assigned to the 1st Armored Division from April 2010 until November 2013 as an automatic rifleman, officials said.\nHe was reclassified as a motor transport operator in December 2013 and arrived at Fort Hood in February.\nArmy Secretary John McHugh testified Thursday in Washington that Lopez deployed to Iraq during the final months of the war in 2011, but did not see combat.\nMcHugh testified Thursday that Lopez appeared to have no connections to extremist groups.\nMcHugh says the soldier was examined by a psychiatrist last month and was found to show no violent or suicidal tendencies.\nHe said Lopez was prescribed Ambien to deal with a sleeping problem.\nWednesday night Fort Hood and III Corps Commander Lt. Gen Mark said Lopez was undergoing diagnosis for post-traumatic stress syndrome.\nLopez, who was originally from Puerto Rico, was married and had a daughter who was about 3-years-old.\nHe was assigned to the 49th Transportation Movement Control Battalion, 4th Sustainment Brigade, 13th Sustainment Command (Expeditionary).\nHe and his family recently moved into an apartment complex near the post, CNN reported.\nNeighbor Xanderia Morris described the Lopez's as a 'typical, average family.\"\n\"They would smile whenever they'd see someone,\" she said.\nAfter the news of the shooting broke on television, the wife came out of the apartment in tears, Morris said.\n\"She said 'I'm just worried, I'm just worried,'\" Morris said.\n\"I tried to console her and comfort her, let her know everything was OK.\"\nShe was taken from the apartment by law enforcement officials, and was cooperating, an FBI source told CNN.\nSheneice Banks lives in the same apartment complex as the Lopez family and helped the family move in.\nShe said Thursday she was completely shocked and said Lopez seemed like a nice man.\nHer husband, a Fort Hood soldier, was stranded on post by the lockdown after the shooting and didn’t get home until close to 3 a.m. Thursday, she said.\nThe.45 caliber Smith and Wesson automatic with which Lopez was armed was not registered on base as required, Milley said.\nLopez opened fire first in a building in the 1st Medical Brigade area, Milley said, and then got into a vehicle, firing several shots he drove to a second building in the 49th Transportation Battalion area.\nHe got out, entered the second building, and opened fire again, Milley said.\nA female military police officer then confronted him in the parking lot.\n\"She pulled out her weapon and engaged and then he put the weapon to his head,\" Milley said.\n\"It was clearly heroic, what she did at that moment in time,\" Milley said.\n\"She did her job, and she did exactly what we would expect of United States Army military police.\"\nThere’s no indication the shooting was terrorism-related, Milley said.\nFederal, state, military and local authorities are involved in the investigation of the shooting, he said.\nThe shooting occurred shortly after 4 p.m. in the area of a motor pool near Motor Pool Road and Tank Destroyer Boulevard.\nThe first 911 call was placed at 4:16 p.m. by two wounded soldiers, Milley said Thursday.\nA man who said he was a witness told News 10 that about 20 shots were fired.\n“There has been a shooting at Fort Hood and injuries are reported. Emergency crews are on the scene. No further details are known at this time,” the post said in a brief statement issued just after 5:30 p.m. Wednesday.\nWarning sirens sounded late Wednesday afternoon at Fort Hood because of the incident.\nPeople on post were told to stay indoors.\nA message that scrolled across the top of the post’s website said, “Shelter in place immediately. This is not a test.”\nThe 1st Calvary Division, which is based at Fort Hood, sent a Twitter alert telling people on base to close doors and stay away from windows.\nKilleen ISD schools were holding students until parents arrived because of the lockdown on post.\nCampus cafeterias were open to the students and administrators remained until the last of the children were picked up.\nTexas A&M Central Texas in Killeen canceled evening and night classes Wednesday at Fort Hood and at its Fairway building because of the situation on post.\nFirst responders from surrounding communities also headed to post.\nBell County sheriff’s deputies and Department Public Safety troopers also responded, sheriff’s Lt. Donnie Adams said.\nA DPS helicopter was seen hovering over a car on the post, but it's not clear whether the vehicle was related to the shooting.\nFBI agents were also reported to be en route, but the FBI did not immediately confirm that.\nOn Nov. 5, 2009, Army psychiatrist Nidal Malik Hasan opened fire at Fort Hood’s Soldier Readiness Center, killing 12 soldiers and one civilian and wounding 29 others before two Fort Hood civilian police officers shot him.\nHe is now on the military’s death row.\nU.S. Rep. John Carter, R- Round Rock, whose district includes the sprawling post, said news of a second attack on post was “heartbreaking.”\n“The knowledge that a soldier could attack another soldier is devastating to the emotional well being of our troops, which is why in the aftermath of this tragedy support for our troops is more important than ever,” he said.\nWe need to rally around the community and provide the safety and security these people deserve,” he said.\nPresident Barack Obama said the government will get to the bottom of what happened.\nMr. Obama said he's following the situation closely, but said that the situation is fluid.\nHe said officials are doing everything they can to make sure everyone is secure.\nMr. Obama said the incident brings back painful memories of the 2009 mass shooting at Fort Hood.\n\"We're heartbroken that something like this might've happened again.\"\n\"But just for now I would hope that everyone across the country keep the families of Fort Hood in our thoughts and our prayers. The folks there have sacrificed so much on behalf of our freedom. Many of the people there have been on multiple tours of Iraq and Afghanistan, they served with valor, they served with distinction. At their home base they need to feel safe. We don't yet know what happened tonight but obviously that sense of safety has been broken once again. We need to find out exactly what happened.,\" he said.\nMr. Obama spoke at a restaurant in Chicago where he held a fundraiser.\nDefense Secretary Chuck Hagel called the shooting a “terrible tragedy.”\n“There is nothing more important to us as an institution than the safety and well-being of our people, and for that reason I am grateful to all the first responders who rushed to the scene. We will closely monitor the situation at Fort Hood and stay informed by what investigators and law enforcement personnel learn about the shooting,” he said.\n“Tonight, Texans hearts are once again very heavy,” U.S. Sen. John Cornyn, R-Texas, said in a statement.\n“The scenes coming from Ft. Hood today are sadly too familiar and still too fresh in our memories. No community should have to go through this horrific violence once, let alone twice. I ask that all Americans join Sandy and me in praying for the victims, their families and the entire Ft. Hood community.\"\nGov. Rick Perry issued a statement Wednesday night in which he said, “Today Fort Hood was once again stricken by tragedy.”\n“As Texans, our first priority must be caring for the victims and their families. Ft. Hood has proven its resilience before, and will again. Texas will support those efforts in any way we can, with any resources necessary. The thoughts and prayers of all Texans are with everyone affected by this tragedy,\" he said.\nState Sen. Troy Fraser, R-Horseshoe Bay, whose district includes the post, issued a statement asking for prayers “for peace and healing.”\n\"Tonight, I join countless others in grieving following the senseless violence at Fort Hood. My thoughts and prayers are with all the brave men and women in uniform who serve us at Fort Hood and with their families and loved ones,” he said."}