{"uri": "http://denver.cbslocal.com/2016/01/30/police-investigate-multiple-shootings-at-denver-coliseum/#.Vq0jh9ELhDg.facebook", "title": "1 Dead, Others Injured In Shooting At Stock Show Complex", "dct": "Sat, 30 Jan 2016 16:40:00 GMT", "id": "12cceaa483bbe05cca87b60753179ae9", "content": "DENVER (CBS4)– One person was killed and numerous others injured after a shooting and stabbing at the National Western Stock Show Complex on Saturday afternoon.\nThe shooting happened inside the National Western Complex Expo Hall during the Colorado Motorcycle Expo.\nOfficers tweeted that there were several people shot.\nThe shooting happened about 1 p.m. at the Coliseum. Seven people were rushed to Denver Health Medical Center. Witnesses described a chaotic scene.\n“More than likely it was a fight,” said Denver Police Chief Robert White in a news conference on Saturday evening. “There were four individuals who were shot, one fatally and three lesser injuries.”\n“Everyone started running, a couple of guys went out the south side that were shot and one went out the north that was shot. They just took one out in the ambulance,” said witness Trey Schipper.\nThe injured were rushed to Denver Health Medical Center where multiple police officers were standing on patrol outside the emergency room entrance.\n“During the disturbance there were shots fired and at least one stabbing,” said Denver Police spokeswoman Raquel Lopez. “We do have one deceased party and multiple other victims.”\nThe shooting happened during the Colorado Motorcycle Expo. It’s described as “The largest motorcycle show & swap in the Rocky Mountain Region with antiques, custom motorcycles- live music auction- much, much more!”\nThe Motorcycle Expo scheduled for Sunday has been cancelled.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\n“The event has been cancelled in part due to the police investigation and safety,” said White. “The other events scheduled at the complex tomorrow will go on and there will be extra police presence.”\nThe event continued as scheduled after the shooting but once attendees left the complex and crossed police lines they were barred from re-entering.\nDenver police tweeted some pictures from the scene.\nVIEW FROM THE SCENE: https://t.co/1GeYr1plc6—\nDenver Police Dept. (@DenverPolice) January 30, 2016\nPolice confirmed that one person was killed and there were numerous other injuries.\nEight patients were admitted into Denver Health, one died, three were in critical condition on Saturday afternoon. The hospital was on lockdown for a few hours.\n“At this time we do not have anyone in custody,” said Lopez.\n“We are interviewing several witnesses and have a person of interest we are interviewing,” said White. “This is very early on in the investigation and as it unfolds we’ll give you and the community an update.”\nWhat initiated the attack is being investigated but witnesses tell CBS4 that there was a dispute between motorcycle gangs."}