{"uri": "http://www.wmcactionnews5.com/story/22294063/four-shot", "title": "2 killed, 2 injured in shooting", "dct": "NODATE", "id": "c57d9c64fae61c6c01bb6d0ed29d354d", "content": "(WMC-TV) - Two people are dead and two others are hurt after a shooting Sunday at the Woodbridge apartment complex, on the 2300 block of Ketchum Road.\nWhen police arrived on the scene Sunday, they found 18-year-old Brandon Chaffin and two other men, ages 14 and 28, had been shot. They were all taken to The MED by ambulance. Chaffin was pronounced dead at the hospital.\nA fourth victim was taken to The MED by a private vehicle. Illya Benson, 23, was pronounced dead upon arrival.\nMemphis Police Department investigators spent all Monday morning on the shooting scene. They sifted through surveillance video and searched for more evidence following the deadly shooting.\nSurvivor Chris Watts is fresh out of the hospital one day after the incident. A bullet wound is through his calf.\n\"I was just standing over there, sitting on the stoop,\" said Watts. \"Shots went off ... I hit the ground ... Felt like somebody punched me in the leg. I was hoping that was the only one, and prayed to God. Blessed that it was the only one.\"\nHe said it sounded like the Fourth of July.\nOnly instead of a celebration, witnesses said the Wild West broke out in a courtyard.\n\"All these kids around, this stuff is ridiculous around here. They need to stop this stuff. This don't make sense,\" said neighbor C.C Walton.\nNeighbors said a feud over a man escalated to the point that a woman stepped out onto a balcony and started shooting.\nOther guns came out, bullets whizzing in all directions.\nInnocent bystanders were hit near the laundry room. Chaffin and Benson both died as a result.\nTwo others who got shot are recovering, including Watts. Watts has no idea who shot him.\n\"I wasn't trying to see. I was trying to run away from the bullets, not run toward them,\" he said.\nA 14-year-old boy was hit in the leg. He is recovering from surgery.\nNo arrests have been made as of Monday. Investigators have leads on possible suspects. The public is still encouraged to call 528-CASH with any helpful information.\nCopyright 2013 WMC-TV . All rights reserved."}