{"uri": "http://www.whig.com/article/20160706/ARTICLE/307069671", "title": "Preliminary hearing of mother of girl who died in shooting continued to July 20", "dct": "Wed, 06 Jul 2016 16:15:00 GMT", "id": "1967462368cb771f8b580c09b7c6791b", "content": "QUINCY -- Karen L. Torres of Quincy, the mother of a 7-year-old girl who died in a shooting May 20 near Beverly, had her preliminary hearing continued Wednesday afternoon in Adams County Circuit Court.\nJudge Robert Adrian advanced the hearing date to 1:30 p.m. July 20 at the request of Torres' attorney, Ryan Schnack, who wanted more time to examine evidence.\nInvestigators said the shooting of the girl, Melina Torres, occurred during a family gathering at Julie Roberts-Cole's home near Beverly. Roberts-Cole is Melina Torres' grandmother.\nThe cases of the three others arrested in connection with the shooting are in various stages.\nº Roberts-Cole, 49, of Barry, had a preliminary hearing rescheduled to July 26 after her lawyer, Michael Ghidina, requested a continuance in Adams County Circuit Court. Roberts-Cole is charged with two counts of obstruction of justice. Police say Roberts-Cole gave false information to officers while they were investigating the death of her granddaughter.\nº Daniel W. Roberts, 32, of Quincy, \\uncle of Melina Torres, has pleaded not guilty to three felony charges, including endangering the life of a child. His trial is set for August.\nRoberts faces the most serious charges, which also include possession of weapon by a felon and obstruction of justice, both felonies. He faces up to 10 years in prison if convicted. Police say Roberts placed a loaded .22-caliber rifle into the possession of a 3-year-old, which led to the death of Melina Torres. As a convicted felon, Roberts is not allowed to own a gun.\nº Shannon Combes, 30, of Rockport, a family friend, will have a preliminary hearing July 26 on a charge of being a felon in possession of a weapon. According to information filed, Combes knowingly possessed a camouflage .22-caliber rifle with a scope despite having a felony conviction."}