{"uri": "http://wric.com/2015/03/19/petersburg-student-shot-himself-in-the-leg-on-a-school-bus/", "title": "Petersburg student accidentally shoots himself on school bus", "dct": "Thu, 19 Mar 2015 17:03:00 GMT", "id": "36f718f387ecbb394500a30e15bc186e", "content": "PETERSBURG, Va (WRIC) — A Petersburg High School spokesperson has confirmed to 8News that there was a gun incident on a school bus on Monday.\nA school official says that the student had a concealed weapon on the bus and accidentally shot himself in the leg.\n“Around 12:30 p.m. on Monday, March 16, 2015, a Petersburg High School student — who was riding bus number 61 — had a concealed weapon,” officials said in a press release about the incident. “During the transport, the weapon discharged — striking the student in question.”\nThe bus driver immediately investigated what sounded like a “small firecracker.” Officials say the source of the noise wasn’t clear right away.\nUpon further investigation, Petersburg City Public Schools along with the Petersburg Police Department later determined that a Petersburg High student shot himself in the leg while on the bus.\n“We are vigorously reviewing this incident, as well as policy and procedures. Meanwhile, PCPS is stepping up its safety measures by increasing random student searches.”\nThe investigation into the matter is ongoing, school officials say.\nStay with 8News for updates.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}