{"uri": "http://www.kctv5.com/story/32794226/one-dead-child-hurt-in-quadruple-shooting-in-kansas-city", "title": "2-year-old girl remains in critical condition after quadruple shooting", "dct": "Fri, 19 Aug 2016 01:43:00 GMT", "id": "b079a473de8d4af7f123b372603d9b4f", "content": "KANSAS CITY, MO (KCTV) -\nOne man is dead and a young child is fighting for life after four people were shot outside a Kansas City restaurant Thursday night.\nFamily members confirm to KCTV5 News that a 2-year-old girl named Reign was caught in the gunfire.\nAccording to a GoFundMe page set up by Reign's aunt, the child was shot in the left side of her head. Reign's mother was shot in the back. Emergency surgery was performed on the child.\nPolice say that child was sitting inside a vehicle in the parking lot of a Church's Chicken near Gregory Boulevard and Prospect Avenue. The manager said the altercation took place behind the restaurant. That was where the four people, including the child, were shot.\nIt appears the three adults got into an argument before the shooting, according to police One man died and another man and woman were rushed to the hospital in critical condition. Police say the man and woman are improving.\nInvestigators say the child shot, who is under the age of five, is still alive, but the fact that a child was one of the victims and that another child witnessed it made it even more heartbreaking for everyone, including police.\n\"We just lost two babies the other day that should have been getting ready for school, and then we're right back out here for the same thing,\" said Pat Clarke, community outreach specialist for Kansas City Police Chief Darryl Forte.\nSo far, police have not described the relationship between the victims, and they're urging witnesses to come forward with any new information.\n\"We just want our city to come together in prayer. This is a devastating scene, not only for the people that live in this area, but also for the officers and detectives that had to respond here,\" Sgt. Kari Thompson said.\nNeighbors in the area were left with a heavy heart following Kansas City's latest homicide.\nChi Ribgnal's mother lives one block away from Gregory and Prospect. Ribgnal said she was worried about her mother.\n\"I was like, OK, well are you guys OK? Just stay in the house. You never know what else could happen after that.\"\nCommunity members and police say violence like this has to stop, especially when it involves children.\nRev. Marvin Tigner of Fellowship Baptist Church is calling for peace.\n\"The first thing I was concerned,\" Tigner said. \"Was it any of our parishioners, someone that we know? Then how do we do better - was my first reaction- how do we do better?\"\nIt's a tough question to answer as he debates how to talk with his parish about the shooting during Sunday's service.\n\"The message is simply - we've got to do a better job with our kids,\" he said. \"What's going on with them and where they are all the time?\"\nThat was the main message when community members gathered at Freedom Fountain to protest violence in Kansas City.\nMore:\nLIVE on #Periscope: Plea to end violence in #KCMO at Freedom Fountain https://t.co/LK7LU2DzFM\n— Lisa D'Souza (@Lisa__DSouza) August 19, 2016\nCopyright 2016 KCTV (Meredith Corp.) All rights reserved."}