{"uri": "http://fox4kc.com/2016/08/19/surveillance-video-captures-moments-after-quadruple-shooting-that-killed-one-person-injured-child/", "title": "2-year-old girl fighting for her life after quadruple shooting in KCMO", "dct": "Fri, 19 Aug 2016 17:43:00 GMT", "id": "ef06abe4a314b36dd4c924ca07a4aba2", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nKANSAS CITY, Mo. -- A quadruple shooting and murder is not what one local business owner wanted to see on her store`s surveillance video Friday morning when she came to work, but she says unfortunately, it didn't surprise her.\nStephanie Hilderbrand owns Midland True Value Hardware near Gregory and Prospect . Her family has owned the store since 1976. It sits right across the street from the Church's Chicken, where three people were injured and one died in a shooting Thursday night just after 8 p.m.\nHilderbrand told FOX 4 she recently installed new video surveillance camera because of crime in the neighborhood, and those new cameras captured Thursday's shooting.\n\"A white minivan was backed up there and another white car parked next to it,\" Hilderbrand said.\nWhile you can not see the actual shooting, police say a man in each vehicle shot at the other. Both men were hit, one died. A woman and her two-year-old daughter were also shot. They both survived, but the two-year-old has critical injuries. A post on GoFundMe from a woman who says she is the two-year-old's aunt says 2-year-old Reign was shot in the left side of her head. The mother was shot in the back.\nAnother child was also in the parking lot but was not injured.\nBefore police arrived, one of the men can be seen stumbling around in the parking lot and falling to the ground. A little later, the woman can be seen walking outside of the car.\nA witness said when police arrived, officers didn`t wait for an ambulance, they scooped up the child and rushed off to the hospital.\n\"Unfortunately we are just so used to it, but whenever we hear about a child being shot, that`s what hurts my heart,\" Hilderbrand said.\nPolice on scene Thursday night said there was \"a lot of dope\" scattered on the ground after the shooting took place, possibly a drug deal gone bad. Other witnesses say that is was a domestic dispute.\nThe family of the little girl, who is in critical condition has set up a GoFund me page. They are asking for donations and prayers."}