{"uri": "http://www.freep.com/story/news/local/michigan/detroit/2015/08/03/3-year-old-shot-killed-detroits-east-side/31076801/", "title": "3-year-old shot, killed on Detroit's east side", "dct": "Mon, 03 Aug 2015 00:00:00 GMT", "id": "6755b25ce194fab879adf8f4e1cfd673", "content": "Three-year-old Elijah Walker was playing with another boy on Monday afternoon, after one of them had discovered a gun.\nMoments later, the gun went off, striking Elijah in the head. He was pronounced dead at a hospital.\nThe tragic incident, which took place in the 16000 block of Eastwood on Detroit’s east side, is the subject of a Detroit Police investigation. Police will not publicly say where the boys found the gun, or who owned it.\nBut Elijah’s family is reeling from the sudden loss.\n“I’m hurt,” said Elijah’s cousin, Tameka Cash. “Everybody is hurt. It’s just sad. It’s tragic.”\nElijah was an outgoing and fun-loving child who had been called a “miracle baby” by his family members. Though born prematurely, he survived without major complications.\n“He played and played and played,” Cash said. He was a happy baby.”\nOn Monday, moments before the shooting, Elijah was inside a home on Eastwood with his mother and aunt, Cash said. At some point, the boy got up and ran outside the home, and his aunt followed after him.\nBut before his aunt could get outside, she heard a shot, Cash said.\nThe 3-year-old, who was shot in the face, was found in the front seat of a car that had been parked behind the home, a source familiar with the investigation said. The source said it’s unclear whether the 11-year-old boy, who told police the kids had been playing with a gun, pulled the trigger.​\nThey found the gun in the home’s closet and a case in the car’s front seat, the source said.\nThere have been other recent accidental shootings involving minors. In January, a teen boy shot and killed his friend while the teen’s father was out of the house, getting pizza. The father, Ivan Berrien, 45, was ultimately convicted of second-degree child abuse and a felony weapons charge, and is scheduled to serve at least two years in prison, court records show.\nAnd in December, a 9-year-old boy was shot and killed by accident on Detroit's east side.\nFree Press staff writer Gina Damron contributed reporting.\nContact Daniel Bethencourt: dbethencourt@freepress.com or 313-223-4531. Follow on Twitter at @_dbethencourt."}