{"uri": "http://articles.sun-sentinel.com/2013-10-22/news/fl-margate-shooting-folo-20131022_1_lori-eller-shooting-victims-margate-coconut-creek-fire-rescue", "title": "Police receive tips in Margate quadruple shooting", "dct": "Tue, 22 Oct 2013 00:00:00 GMT", "id": "25aedebe7a437ee9e574fdfdb0689112", "content": "Four days after three men and a woman were wounded by gunfire inside a gated residential community, Margate police had not yet disclosed the victims' names or what may have happened.\n\"It remains an open, active investigation,\" Margate Police Sgt. Lori Eller said Tuesday. \"We're still gathering facts from the incident.\"\nWhat is known: About 11:45 p.m. Friday, Margate police responded to a report of possible shots fired inside the Cypress Cove community, which is west of Florida's Turnpike.\nMargate-Coconut Creek Fire Rescue took four gunshot victims to a hospital, and on Monday, two were in critical condition and two were stable, Eller said.\nAs of Tuesday, no arrests had been made, she said.\nSgt. Ryan McCarthy, of the agency's criminal investigations division, said via email that the shootings that happened in the 7400 block of Santa Monica Drive generated a lot of tips, and that police hope the public will continue to provide information.\n\"Our investigators are working closely with the victims in an effort to gather additional details related to the shootings,\" McCarthy's email states. \"Investigators were unable to initially speak with many of the victims due to their conditions on the night of the incident.\"\nTwo residents of the community said it was normally peaceful and that they have a lot of police officers who are their neighbors.\nEller said police officers were not among the shooting victims.\nOn Saturday, personnel from the Broward Sheriff's Office and a mobile crime scene lab could be seen outside the beige, two-story home, but BSO says it's Margate Police's case. That day, a silver SUV and a white SUV were being examined by investigators.\nMargate Police ask anyone with information to call 954-972-7111, or Broward Crime Stoppers, anonymously, at 954-493-8477."}