{"uri": "http://articles.sun-sentinel.com/2013-11-14/news/fl-margate-shootings-folo-20131114_1_shootout-quadruple-shooting-zettek", "title": "Margate shootout may be linked to international crime ring", "dct": "Thu, 14 Nov 2013 00:00:00 GMT", "id": "8735403e9d39917b0900801d0072eb21", "content": "MARGATE —\nIn an upscale, gated community like Cypress Cove — heavily patrolled and home to several police officers — even minor crimes are rare.\nSo neighbors were alarmed when several gunmen engaged in a shootout last month that could have been ripped from a Hollywood movie. Four people were found sprawled on a front lawn and bleeding from gunshot wounds, two of them critically wounded.\nNow, investigators say the shooting may be linked to an international criminal enterprise involving ID fraud and drugs.\n\"We don't know why for sure, but we suspect two cells involved in various criminal activities, ranging from ID theft, immigration fraud and other issues,\" Margate police Lt. Andy Zettek. \"We are not ruling out narcotics activity.\"\nHowever, police have called a community meeting next week to report that the gunshot victims have moved out and that residents are not in danger.\n\"I received a call from the association president who said they have fielded calls of concern,\" Zettek said. \"They want to know if this is something that will happen again. So I am going in there to relieve those fears.\"\nWith the exception of the shootout, the neighborhood has had few reported crimes this year, police said. Since Jan. 1, the community has had one domestic battery arrest, one case of criminal mischief related to a domestic disturbance, and one report of a stolen cellphone left on the front lawn, they said.\n\"It's a safe, quiet community,\" Zettek said. \"The shooting victims were targeted. One of them leased a house there.\"\nThat house, in the 7400 block of Santa Monica Drive, became a crime scene about 11:45 p.m. Oct. 18 when five people pulled into the driveway and the shootout erupted, police said.\nPAST STORY: Police receive tips in Margate quadruple shooting\nFrom the other side of a fence that separates Cypress Cove from Northwest 18th Street, one or more people fired numerous shots at four men and a woman as they got out of a Honda SUV, said Zettek.\nThey and perhaps a sixth person in the house fired back, said Zettek. Several shell casings were found in front of the house.\nFour of those arriving at the house were wounded. They were taken to a hospital by Margate-Coconut Creek Fire Rescue.\nOne of the victims, found inside a Chevy SUV parked in front of the residence, was helped inside by a neighbor, according to a search warrant obtained by the Sun Sentinel. That resident told police the wounded person carried a firearm inside with him.\nAnother witness told officers that after hearing gunshots, she saw two men in the back of the house next door. Police set up a perimeter, and with the help of a police dog, found a man identified as Andre Lang \"hiding in the area,\" according to the warrant.\nOne of the bullets fired during the shootout went through the garage door of next-door neighbor Jerry Pugh.\n\"It was very unnerving,\" he said. \"My wife and I were asleep on the couch in front of the television. I woke up to this rattling sound. I went to look and my wife said, 'Get down. Those are gunshots.'\"\nThe next morning Pugh said he found a pool of blood on his lawn, and in the street and driveway next door the painted numbers 1 through 69, indicating the spots where police found shell casings.\nPugh said Cypress Cove residents still drive by to see the site of one of the most memorable events in community history.\n\"It's like the Charles Manson house or something,\" he said.\nDuring the investigation, Lang told police he had been the driver of the Honda. Two of the wounded victims confirmed that he was in the vehicle with them, police said in the affidavit.\nLang was arrested, charged with loitering and prowling, and resisting arrest, Zettek said. He later bonded out of jail and vanished, Zettek said.\nAfter obtaining a search warrant, police seized from the home two foreign passports, a cellphone, two computers and a semi-automatic handgun.\nOf the people who pulled into the driveway, one is in federal detention on an immigration charge, one has left the country and the other three are believed to have left Florida, Zettek said.\nHe said police were at the house Wednesday to confirm that it is empty.\n\"Without a doubt, of the people that were shot, one was the intended target,\" Zettek said.\nPugh said he had a friendly, say-hello relationship with the couple who rented the house, but also suspected something strange was going on there.\n\"Lots of people coming and going at all hours,\" he said.\nOf the shootout, \"We're very lucky we didn't get hit by a stray bullet,\" said Pugh, an electrician. \"A bullet could have gone through the wall and hit my daughter right in the head.\"\nDown the street, Karla Velez, 26, a mother of two, said, \"I never expected we would see anything like that here. But I'm not worried now. I walk by there.\"\nThe community meeting is scheduled for 6:30 p.m. Thursday at Swift Management Solutions, 1750 N. University Drive, Coral Springs.\nStaff researcher Barbara Hijek and staff writer Steve Coate contributed to this report."}