{"uri": "http://www.margatenews.net/3909/123772/a/shooting-in-margate-retaliation-for-murder-of-gang-leaders-mom", "title": "Shooting in Margate retaliation for murder of gang leader’s mom", "dct": "Wed, 10 Jun 2015 00:00:00 GMT", "id": "c8a83f066e5e6013e26497937505a30d", "content": "Nearly two years after four people were shot in Margate’s Cypress Cove community police have released details that point to a beef between rival gangs, fraud and a Jamaican lottery scam.\n_______________\nOn October 18, 2013, Margate Police responded to numerous calls of gunshots circa 11:30 p.m. to find an off duty BSO sergeant pointing a gun at three men. All three, along with a woman sitting in the back of a Chevy Captiva, had been shot, and dozens of bullet casings from a rifle and handgun were scattered about the 7400 Block of Santa Monica Drive.\nPolice said the four pulled into the driveway of 7409 Santa Monica Drive and were suddenly fired upon when exiting a gray Honda CR-V. Some victims lived at the residence while others were visiting. All were returning from the Aventura Mall.\nSeen fleeing the scene was one Andre Lang, who police say lived at 7409 Santa Monica Drive. Lang was cornered by a K-9 cop and treated for dog bites. He was found in possession of $8,000 which he said came from a non-descript job in Broward. Lang was also seen throwing an object into the lake at Cypress Cove. The object was later identified as a 45-caliber handgun to which Lang did not admit owning.\nLang, aka Roderick England, was a person of interest in multiple homicides and violent crimes in Montego Bay and was wanted by Jamaican authorities. Additionally, U.S. Homeland Security said England had multiple aliases and was a major player in a Jamaican lottery scam. Sadly, Jamaican authorities declined extradition.\nShortly after the shootings, police received an anonymous call from a woman in Jamaica who said England, along with Chelcher (female victim), entered the U.S. illegally to send guns back to the Island. She suggested the Margate shootings were in retaliation for Lang murdering a gang members’ mom on the Island. Sources confirmed that the leader of the rival gang - “Citypuss” - may have ordered a hit on Lang (England)\nWhen police questioned Chelcher, she said Lang was shot at a month earlier at a gas station in Lauderhill where police in that city said the two were involved in a ring that produced false documents and driver’s licenses. Both were under watch by state law enforcement.\nShooting victims included Jamaican residents Imron Barett and Christopher Currie who suffered gunshots to the leg and torso. Both since have returned to the Island. Other victims, Anthony Dewayne Clarke and Chelcher, were shot in the arm and stomach.\nNone said they saw the shooter or were able to provide information regarding a vehicle associated with the shooting. All declined to aid police in locating and/or prosecuting gunmen.\nAlthough by the time police were privy to intelligence on Chelcher (aka Tania Nichole Henry) and Lang, the Santa Monica Drive residence was abandoned and the two were in the wind. Eventually, U.S. Immigration and Customs Enforcement (ICE) caught up to both and arrested them on immigration violations.\nThe real name of “Citypuss” was Orane Bernard. He went by multiple aliases including “Kareem Urgent” and “Nicholas Gooden” with nicknames “Citypuss” and “Madd One.” He remains a person of interest in a Lauderhill homicide and was arrested by ICE agents in Atlanta, Georgia.\nPolice from Coral Springs, Coconut Creek and the Broward Sheriff’s Office assisted Margate Police in securing the crime scene and ensuing investigation.\nRelated Article:\nShots Fired in Peaceful Margate Neighborhood. Investigation Continues"}