{"uri": "http://www.click2houston.com/news/bodies-found-in-burning-car-in-channelview", "title": "4 people found shot in head in partially burned car in Channelview identified", "dct": "Fri, 09 Dec 2016 15:45:00 GMT", "id": "5fb139eaee3e5ed0de1d1a88e34fe790", "content": "CHANNELVIEW, Texas - From close up, it was hard to see the damage caused by the fire on the four-door Kia sedan.\nThe car is now evidence after deputies say it was used to cover up the murder of four people.\nTwo men and two women were found with gunshot wounds to the head. A man and a woman, identified as Christopher Chaney and Nicholette Briscoe, were found in the trunk.\n\"They found the bodies of the first female and male in the trunk of the car,\" Thomas Gilliland with Harris County Sheriff's Office said.\nAnother female and another male, identified as Kelcii Flintroy and Willie Norman, were later found in the back seat. Channelview Fire Department was the first on scene.\n\"They got a call for a vehicle car fire,\" Gilliland said.\nOnce they found the first bodies, they called deputies in, and the 10-hour long crime scene investigation began.\nInvestigators said all four victims were shot in the head, but the car was only burning for a few minutes, which investigators say may be good news for them.\n\"(The fire) didn't engulf the car, which would've been a little more hard to determine, but hopefully it will work to our advantage,\" Gilliland said.\nBob Seibech lives just down the street. He says he was outside at the time of the fire but never heard a thing.\n\"I didn't even see smoke. They said the car was on fire, but I didn't even see smoke,\" Siebech said.\nHe says it makes him nervous to be in the area.\n\"Do I feel safe? No,\" Siebech said.\nDeputies say the victims are all African-American adults, but age and names have not yet been released.\nBoth cause and manner of death will be determined by the medical examiner.\nDownload the Click2Houston news app in your app store to stay up-to-date with the latest news while you're on the go.\nSign up for KPRC 2 newsletters to get breaking news, sports, entertainment, contests and more delivered straight to your email inbox.\n2016 Click2Houston/KPRC2"}