{"uri": "http://newyork.cbslocal.com/2014/06/29/violent-night-leaves-at-least-13-shot-in-all-five-boroughs/", "title": "Violent Weekend Leaves 21 Shot Across The Five Boroughs", "dct": "Sun, 29 Jun 2014 22:18:00 GMT", "id": "878ec5067ff4147512f327c6c8f0b5c7", "content": "NEW YORK (CBSNewYork) — It was a violent night in New York City after at least 21 people were shot in incidents spanning each of the five boroughs.\nAs CBS 2’s Janelle Burrell reported, one of the shootings happened on Staten Island, where a man is fighting for his life after being shot in the face.\nThe incident happened at around 3:30 a.m. on Amboy Road in the New Dorp section of Staten Island.\nPolice were still on the scene Sunday morning collecting and processing evidence, including a backpack that belonged to the 42-year-old victim.\nInvestigators told Burrell the shooting was not random.\nThe victim had apparently gotten into an argument with another man. Police said a gun was fired and the victim was hit in the face with a bullet just outside of his home.\nThe shooting suspect was caught on surveillance video running from the scene of the crime, police said. He got away in a dark-colored pick up truck, WCBS 880’s Monica Miller reported.\nThe victim was rushed to Staten Island University Hospital.\nNeighbors were shaken up over the news. They said it’s rare for the community to see this kind of violence.\n“This is a busy street, Amboy Road is busy, but it’s not an area where you would have a shooting of any kind. I mean, we’re here five years and this has never happened before,” said one neighbor.\n“We have a baby. You know, we have a 5-year-old. It’s very scary. This is unusual, very unusual for this area,” said another neighbor.\nDawn said she got an early wake up call from police who rang her door bell after the victim was shot just steps from her door.\n“We just saw them yesterday. You know I’m like this is very very strange and very scary, especially when you tell us a gun was shot. I said what!!” Dawn said.\nNeighbors also said the victim only moved to the area a few months ago with his wife and son.\n“It’s a man and his wife and their son. They’re very quiet people. They just moved in not long ago. They’re very nice people,” neighbor Mike told WCBS 880’s Miller.\nMike was just returning home from the night shift, only to find his house was on the part of the street that was sectioned off by police.\nThe shooting incident is just one of 13 that happened across the city in the last 24 hours, WCBS 880 reported.\nIn Cambria Heights, Queens, 33-year-old Bronx resident Jason Bragg was found shot to death around 10 p.m. Saturday.\nA 10-year-old boy and a male adult were shot in Coney Island at around 7 p.m. Saturday. Elhadi Abdel Rahman suffered minor injuries with a gunshot wound to his knee. The man was last listed in serious condition with a gunshot wound to his stomach. Police released a photo of the suspect.\n“I didn’t think they were gunshots. I thought they were firecrackers, but then everybody started running,” Abdel Rahman said.\nHe was a block away from his home when he was caught in the middle of a spray of bullets, CBS 2’s Don Champion reported.\nOne person was killed and two others were injured in a shooting at 92 Tapscott St. in Brooklyn.\nAlso in Brooklyn, a female was shot in the leg at 1780 Bergen St. She was taken to Kings County Hospital.\nFour people were shot at Fifth Avenue and West 139th street. CBS 2 reported the victims were teenagers. All of the victims were listed in stable condition at St. Luke’s-Roosevelt Hospital Center, WCBS 880 reported.\nIn the Bronx, a male suffered a gunshot wound to his torso at University Avenue & West 195th Street. A suspect was arrested in the case, WCBS 880 reported.\nEarlier this week NYPD Commissioner Bill Bratton addressed the spike in gun violence, saying more than 1,000 academy graduates will hit the streets this coming week. They are expected to be sent to areas where the most shootings have happened.\n“Actually it turns out we’re still significantly less shootings than we had at this time last year. We’re still well behind what we had last year for this week,” the commissioner said.\nInvestigations into the violent weekend continue, and the NYPD is pouring over statistics to determine if the end of the stop and frisk policy has led to an increase in the number of guns on city streets.\nIn the last week there have been 23 shooting incidents, compared to 37 in the same period last year.\nCheck Out These Other Stories From CBSNewYork.com:"}