{"uri": "http://www.macon.com/2015/06/16/3799996/new-suspects-named-in-fatal-wings.html", "title": "New suspects named in fatal Wings Cafe shootout", "dct": "Tue, 16 Jun 2015 17:20:00 GMT", "id": "39f8fd18475bfd62bf07ecb5bf520fae", "content": "A 72-count indictment adds five new names to the list of people accused in the December fatal shootout at Macon’s Wings Cafe that left three men dead.\nAuthorities now are charging seven men with murder. Tavarus Antwone Coney, 30, and Brinton Williams, 30, join Kenyata Norreece Lester, 30, Markques Patterson, 30, Vertuice Wall Jr., 39, and Jaquez Terrance Foster, 24, who were indicted in March.\nEmmanuel McGhee, 29, was arrested on a murder charge in April. He is included in Tuesday’s indictment.\nEach man also faces multiple counts of violating the state’s Street Gang Terrorism and Prevention Act.\nAuthorities have alleged the Dec. 12 shootout at the Bloomfield Drive nightclub involved two rival gangs -- the Blacc Team and the Crips.\nSurveillance footage shows alleged Blacc Team members arriving, entering and fighting with alleged Crips members who already were at the club. Shots were fired from both sides, authorities say.\nCorey Hollingshed, 25, George Henley, 34, and Derrick Jackson, 38, were fatally shot.\nNastajah Taylor, 23, was shot four times, but she survived. Lester, Patterson, Wall, McGhee, Coney, Williams and Foster face aggravated assault charges stemming from her shooting.\nMurder charges previously filed in the case against 29-year-old Eric Watkins will be dismissed because of his alibi, according to the district attorney’s office.\nAfter learning of the indictment, Watkins’ lawyer Paul Christian said, “We commend the state, the district attorney and detectives for seeking truth rather than victory.”\nTuesday’s indictment charges Watkins with theft by receiving stolen property and two violations of the gang act.\nWatkins, an alleged Blacc Team member, had a stolen handgun Dec. 16, according to the indictment.\nThe other three newcomers charged in the case are 26-year-old Shavious Antwan Balkcom, 24-year-old Master John Henry Brown, and 29-year-old Derek Montez Taylor. Each man is charged -- along with Lester, Patterson, Wall, McGhee, Coney and Williams -- with aggravated assault and gang charges stemming from punching Foster and tossing a lit cigarette, chairs and glass bottles at people in the club.\nAuthorities have alleged the flick of a cigar or cigarette sparked the shooting.\nLester, Patterson, Wall, McGhee, Coney, Williams, Balkcom, Brown and Taylor are alleged members of the Blacc Team street gang, a division of the Gangster Disciples, according to the indictment.\nFoster is an alleged Crips gang member.\nJury selection for a trial in the case is scheduled to begin Aug. 3.\nWings Cafe closed after the shootings and agreed in January not to reopen for two years after politicians sought a review of the business’ alcohol license.\nJackson’s widow has filed a wrongful death lawsuit against the club, seeking more than $1.1 million, alleging that the club and other unnamed defendants were negligent in not providing better security despite prior incidents.\nTaylor also has filed a suit against the club, according to Bibb County State Court records.\nInformation from Telegraph archives was used in this report. To contact writer Amy Leigh Womack, call 744-4398."}