{"uri": "http://www.macon.com/2014/12/12/3476102/2-men-dead-4-people-wounded-at.html", "title": "Bibb sheriff says fatal shots fired in ‘hive of hoodlums’", "dct": "Fri, 12 Dec 2014 04:51:00 GMT", "id": "8e3e33b6e33a229a1050a518c80dcf0d", "content": "A bloody trail led from the shattered front door of Wings Cafe where six people were shot, two of them fatally, early Friday in southwest Macon.\nTwo men died, another victim underwent emergency surgery and three others were treated for wounds at a local emergency room.\nOne eyewitness later described on social media the 1:55 a.m. barrage inside the sports lounge at 2822 Bloomfield Drive, just south of Eisenhower Parkway, as something out of the “wild, wild West.”\nCory Hollingshed, 25, of Springmeadow Drive in Macon, died of a gunshot wound to his chest, and club DJ George Henley, 34, of North Groveland Circle, suffered a fatal shot in his back, Bibb County Coroner Leon Jones said.\nDerrick Jackson, 38, underwent emergency surgery at Medical Center, Navicent Health.\nNastajah Taylor, 23, is being treated for four gunshot wounds. Markques Patterson, 29, was grazed by a bullet, and Jacquez Foster, 23, was also wounded, Jones said.\nA fistfight broke out in the club’s lobby before the shooting began, Sheriff David Davis said.\n“At that point, some individuals pulled out firearms,” Davis said of the episode that lasted maybe five minutes.\nHe said investigators worked all day Friday to identify “the players, and hopefully we’ll have some (arrest) warrants very soon for those that are involved.”\nMultiple arrests were expected.\nAt an afternoon news conference, Davis showed reporters video-surveillance footage from the club.\nHe narrated a “chaotic” scene where punches were thrown and another, highlighted by flashes of gunfire, where bullets flew.\nIn one clip, salvos of perhaps a dozen shots came from three different handguns.\n“There’s two places that people that perpetrate this kind of violence wind up,” Davis said. “One of them is jail, and the other one is hell.”\nDavis said Taylor and Henley likely were innocent bystanders.\nThe other victims, the sheriff said, “may have been involved in some of the shooting or altercation. ... They may not be completely without blame.”\nHenley, known as D.J. Fresh, was on his way outside when the shooting started, his girlfriend told family members.\n“He was in the wrong place at the wrong time,” said Tameka Jackson, Henley’s sister.\nFirst responders tried CPR but could not revive him.\nHe leaves behind a special-needs toddler, who was born premature and is awaiting an intestinal transplant, Jackson said.\n“He was a very loving guy. My kids loved him because he would get down on their level,” she said.\nTelling her three children that their uncle was dead, she said, was the hardest thing she’s ever done.\nHenley’s mother, who lives in Warner Robins, is holding up the best she can, Jackson said. Henley was a hard-working entrepreneur who had a store in Savannah before moving back to Macon.\n“These young kids, this violence, it’s senseless,” Jackson said.\nHollingshed’s grandmother said she was too upset to talk Friday afternoon as she sat on her swing in the backyard of the house she shared with her grandson. She saw him Thursday, she said, before he went out.\nThe club’s Facebook page had advertised Thursday night’s “bad a--” dancers and free tequila for the ladies at the DJ booth. The ad also noted there would be “security on deck.”\nStrands of Christmas lights wrapped around the lounge’s entryway columns cast a blue glow on the crime scene as detectives and forensic technicians gathered evidence.\nA couple of folded yellow cards marked bloodstains in the middle of the parking lot.\nHenley’s white pickup was parked under the “pole dancing ladies” sign just a parking spot away from the shattered front door.\nA sign taped to the door above an empty bouncer chair read: “We will call police if anyone is caught with any weapons.”\nAs the sun rose Friday, investigators searched a nearby CVS pharmacy looking for a gun that might have been used in the shooting. Something was found, but deputies did not immediately disclose whether it was a weapon from the club.\nSome posts on the club’s Facebook page were calling for someone to shut it down.\n“How many have to die?” one man wrote.\nIn July 2011, 35-year-old Alfred Smith was found shot numerous times and fatally wounded in his car in the lounge’s parking lot.\nA prosecutor later said the attack was triggered by a “rival gang situation.”\nThere were indications that Friday morning’s gunfire may be the result of a similar kind of dispute, possibly arising from a beef involving the Bloomfield Crips gang.\nDavis didn’t mention gang involvement at his afternoon news conference, but he referred instead to “an ongoing situation between a couple of groups.”\nHe said the incident boiled down to “personal animosity,” adding that those involved may have clashed at other establishments in recent days.\nAs for Wings Cafe, Davis said the former video store and Quincy’s steakhouse “has been implicated in too many situations. ... This place here has become a hive of hoodlums.”\nA pair of Macon-Bibb County commissioners, Al Tillman and Virgil Watkins, said they will, at a Tuesday Commission meeting, begin the process of trying to shutter the lounge.\nTillman described the place as “a nuisance.”\nDavis said the club’s owner was “cooperative” Friday and had shared video of the ruckus with investigators.\n“I don’t think he wants to have his place be the scene of a homicide,” Davis said. “But there are things that are allowed to go on there” that may have led to bloodshed.\nIn May, aspiring rapper Arika “Lottie Dottie” Jarrell and her friend Ralph Heard were at Wings Cafe hours before they were killed in an alleged armed-robbery ambush at Jarrell’s house.\nThe four men indicted, and a fifth who was killed in the shootout, Terrance “Heavy D” Dent, allegedly chose their victims while at the club, the indictment stated.\nJarrell’s mother learned about the latest shooting early Friday on Facebook.\n“My first thought was, ‘Wings. This is where it all began for my child, the planning to rob her,’” Stephanie Fraley-Jarrell said.\nThe thought catapulted her emotions back to late May when her daughter was shot to death in her car.\n“My heart is sad because the parents of these young men have to travel the road I’m traveling,” Fraley-Jarrell said. “How many more kids have to be gunned down in these death traps before somebody does something about it?”\nInformation from Telegraph archives was used in this report. To contact writer Liz Fabian, call 744-4303. To contact writer Joe Kovac Jr., call 744-4397."}