{"uri": "http://www.cleveland.com/metro/index.ssf/2016/06/kids_in_cleveland_accidental_s.html", "title": "Kids in Cleveland accidental shooting tell police gun fired while watching YouTube video on how to reload gun", "dct": "Mon, 27 Jun 2016 17:44:00 GMT", "id": "72283305cbf7cddd9e69f7d05d70890f", "content": "(Adam Ferrise, cleveland.com)\nCLEVELAND, Ohio -- The three boys involved in an accidental shooting Saturday that injured an 8-year-old boy told police the gun fired while they watched a YouTube video on how to reload the handgun, according to police reports.\nThe kids, who initially told police different stories of what happened, eventually told investigators the same information about what led up to the shooting after prodding from their parents.\nThe 8-year-old and his twin brother told police they found the loaded gun in their uncle's car about 2:30 p.m. Saturday. The car, a 2004 Cadillac Seville, was parked in front of the home in the 3700 block of West 120th Street.\nThe boys and their 10-year-old cousin grabbed the Cobra FS .38-caliber semi-automatic handgun and took it to an upstairs bedroom. The 10-year-old boy took three bullets out of the gun, but didn't know how to put the bullets back, according to police reports.\nThe 10-year-old watched a YouTube video of how to reload the gun. He thought the safety was on and accidentally fired the gun, police reports say.\nThe bullet went through the 8-year-old boy's left shoulder and out his arm. Cleveland police arrived and found the boys' 28-year-old babysitter and others on the porch applying pressure to the wound.\nThe boy, a third grader at The Haley School in Warrensville Heights, was crying and quickly losing blood and was rushed to MetroHealth for treatment, according to police reports.\nThe boy's brother and cousin initially told police they were watching videos in the bedroom when a bullet came through the wall and hit the other 8-year-old.\nCrime scene investigators, however, found that a bullet never went through the house. They did find a bullet hole in the wall that indicated the shot came from inside the room. Investigators also followed a trail of blood from the room to the Cadillac in front of the home.\nOfficers opened the car door and found the gun wrapped in a hat on the center console, police reports say.\nTwo hours after police arrived, the boys again gave a different story. They said the injured boy accidentally shot himself after they found the gun in the car.\nThe boy who was injured initially told police that his cousin shot him as he rode his bike after they found the gun in the car.\nThe 8-year-old boy's mother later called police and told officers her sons lied to them and that they wanted to tell the truth. Officers went back to MetroHealth and took the boys' statements.\nThey said they found the gun in the car and that the 10-year-old boy was waiving it around. The 8-year-old told police he alerted their 28-year-old babysitter about the gun.\nThe 10-year-old then unloaded the gun, reloaded and shot him. The trio ran downstairs and put the gun back, causing the blood trail to the car, according to police reports.\nBoth 8-year-old boys told police they talked to their uncle -- who they called \"Uncle Nutzo\" -- after learning the gun was his. They said their uncle told them what to say to police.\nOfficers were unable to interview the 28-year-old babysitter, police reports say.\nPolice reported the incident to Cuyahoga County Children and Family Services.\nThe 10-year-old boy's mother told cleveland.com all three kids are traumatized by the incident. The 8-year-old boy's mother said Monday her son \"is doing fine\" but declined further comment.\nNo charges have been filed in the case.\nTo comment on this story, please visit our crime and courts comments section."}