{"uri": "http://www.ktnv.com/news/one-shot-in-armed-robbery-in-jewelry-store-in-henderson", "title": "UPDATE: Jewelry store employee killed by security guard identified", "dct": "Sat, 21 Jan 2017 21:50:00 GMT", "id": "fe367999853a34c74c73f74f3e5b2893", "content": "Autoplay:XJewelry store employee killed by security guard identifiedAd will start in 5Skip ad00:00Fullscreenx\nLATEST: The victim has been identified as 57-year-old Kimberlee Ann Kincaid-Hill. Her cause of death was a gunshot wound to the chest.\n\"She was just that special person that just loved everyone and took care of everyone,\" said Kincaid-Hill's friend Maria Ryder-Curry.\nRyder-Curry used to work with Kincaid-Hill and said she drove by the jewelry store the night of the shooting.\n\"I thought it was a mistake, it was an error and I couldn't believe it,\" said Ryder-Curry.\nFamily, coworkers and customers stopped by the store Monday to drop off flowers. A memorial continues to grow outside the store.\nThe jewelry company sent this statement to 13 Action News:\nWe are deeply saddened to confirm that one of our Team Members, Kim Hill, was fatally wounded in an attempted armed robbery at our Henderson, NV store. We extend our deepest sympathies to her family, friends and colleagues. Nothing is more important than the safety of our customers and Team Members and their ability to shop and work in a safe environment.\nHenderson law enforcement has confirmed that she was struck by a shot fired by the on-site security guard. We are taking all necessary steps in cooperating with the local police department and working with our security provider. Our management team has reached out to her family and we are actively supporting our store Team Members. We will continue to cooperate with law enforcement in connection with their ongoing efforts to apprehend the suspect. We will continue to do everything possible to support those impacted by this tragic situation.\n- Kimberly Kanary with Signet Jewelers\nJared the Galleria of Jewelry in Henderson is expected to reopen Tuesday morning.\nUPDATE: According to new information from police, a Jared security guard shot the female employee while he was aiming at the robbery suspect.\nThe 57-year-old employee was taken to the hospital in critical condition but later died from her injuries.\nPer Nevada law, the robbery suspect is facing murder charges in addition to attempted robbery charges.\n13 Action News Crime and Safety Expert and retired Las Vegas police Lt. Randy Sutton says the suspect is still responsible for the woman's death.\n\"Dealing with that's gonna be a really difficult issue and you have the woman's family who lost someone that they love and all of this because someone wanted to commit a robbery,\" he said.\nAnyone with information about the incident is urged to contact Henderson police at 702-267-4911. To remain anonymous, call Crime Stoppers at 702-385-5555.\nUPDATE: A woman who was an employee at Jared's has died after being shot during a robbery. The suspect is still on the run.\nThe Clark County coroner will identify the woman after relatives have been notified.\nORIGINAL STORY:\nHenderson police responded to an armed robbery and a shooting at a jewelry store Saturday evening.\nHenderson police say the armed robbery happened at the Jared The Galleria of Jewelry located at West Sunset Road and Marks Street at 8:45 p.m.\nOne person was shot inside the Jared's and was taken to Sunrise Hospital in critical condition.\nThe suspect fled westbound on foot on W Sunset Rd. He was described as wearing a maroon hoodie, a dark beanie, a mask and had a backpack or bag in his hand.\nThe suspect is still on the loose and Henderson police are searching for him. There are no road closures as they search.\nThis is a developing story. Check back to 13 Action News for updates.\nCopyright 2016 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}