{"uri": "http://www.wkyt.com/content/news/Red-Mile-Road-closed-due-to-police-investigation-397852151.html", "title": "Lexington police: Suspect, friend of victim shot during robbery attempt", "dct": "Sun, 23 Oct 2016 10:27:00 GMT", "id": "2f43f8d5f073b33b0e4b1b3f8aa80a37", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nLEXINGTON, Ky. (WKYT) - Lexington police are investigating a shooting that injured two people Thursday night.\nPolice believe several people tried to rob a home in the Red Mile Road area around 8:30 p.m.\nAccording to Lexington Police, witnesses tell police the shooting happened during a narcotics-related robbery. Several of the suspects were armed with guns.\nPolice say three suspects with hoods over their heads and masks on, held two victims at gunpoint at an apartment on Red Mile Road.\nLexington Police said a friend of the person who lived in the home was also armed with a gun. That man shot at the suspects in an attempt to protect himself and his friends. Another person was accidentally shot as well.\nCourt documents reveal the 22-year-old, identified as Robert Record, was shot one time in the back unintentionally, while the 19-year old, identified by court documents as Saquan Freeman, was shot five times in the chest.\nPolice say Freeman is still in serious condition, while Record is expected to recover from his injury.\nMinutes after the shooting, police say they found the gun they believe was used in the shooting on the sidewalk near the intersection of Red Mile Road and Unity Way.\nPolice say Freeman showed up to the hospital missing a shoe, which was found near the crime scene by police.\nPolice soon surrounded a nearby townhome where they thought a possible suspect could be inside.\nFor about three hours, police tried to make contact with the person they thought was inside. Just after midnight, police say they went inside the home, and found no one was inside. They think the person who had been in the home escaped through a window, and got away.\nOn Friday, police obtained an arrest warrant for 20-year-old Demetrioun L. Boaz. Police told WKYT Friday night that Boaz turned himself in.\nBoaz now faces a first-degree robbery charge.\nNo other arrests have been made in the case.\nRed Mile Road is blocked at Unity Drive due to a police investigation. Very active scene. Officers just entered building with guns drawn. pic.twitter.com/OX5G4WyUUK\n— Garrett Wymer (@GarrettWKYT) October 21, 2016"}