{"uri": "http://www.aikenstandard.com/news/five-adults-one-juvenile-arrested-in-north-augusta-teen-s/article_51f050b4-aff8-11e6-bcf6-c7dee21ffcb6.html", "title": "Five adults, one juvenile arrested in North Augusta teen's death", "dct": "Mon, 21 Nov 2016 00:00:00 GMT", "id": "9234d038a0ce61530d46cacd518a34e0", "content": "Capt. Eric Abdullah with the Aiken County Sheriff's Office confirmed late Monday all suspects are in custody and charged in connection with the shooting death of Jordan Shores, 15, of North Augusta on Friday morning.\nAbdullah said at noon Monday Aiken County School District officials provided assistance to the Sheriff's Office with the arrest of three individuals at Silver Bluff High School.\nRonquavis James Howard, 17; Raihem McCorkle, 17, of New Ellenton; and a 15-year-old juvenile were arrested at the school, outside of the classrooms and with minimal disruption to the operation of the school, Abdullah said, adding during the time of the arrests there was no threats or safety concerns for other students at school.\nAll three are charged with one count of murder, two counts of attempted murder, one count of possession of a weapon during a violent crime, first-degree burglary and armed robbery, according to Abdullah.\nHoward and McCorkle were taken to the Aiken County detention center for booking. The juvenile was taken to the S.C. Department of Juvenile Justice in Columbia. His detention hearing is scheduled at 10 a.m. Wednesday, according to the Aiken County Solicitor's Office.\nTwo Beech Island area men – Undraize Antonio Dixon and Deonte Raequan Schultz – both 17, were charged Friday in the shooting death of Jordan Shores, 15, of North Augusta.\nSchultz, of Beech Island, is charged with murder, armed robbery, three counts of attempted murder, first-degree burglary, discharging a firearm into a dwelling and possession of a weapon during a violent crime, according to jail records.\nDixon, of Warrenville, is charged with murder, first-degree burglary, discharging firearms into a dwelling, three counts of attempted murder, possession of a weapon during a violent crime and armed robbery/robbery while armed or allegedly armed, jail records state.\nBoth men are scheduled to be in court in early January.\nAikel Leetrez Harrison, 19, has also been identified by investigators as the suspect who fled from police following the shooting. Abdullah said Harrison surrendered himself at the Aiken County jail at 5:15 p.m.\nWarrants have been obtained for Harrison on charges of one count of murder, two counts of attempted murder, one count of possession of a weapon during a violent crime, first-degree burglary and armed robbery, according to Abdullah.\nOn the morning of Nov. 18, a uniformed patrol officer in a shopping center at 4435 Jefferson Davis Highway heard gunshots coming from the area of Fairview Road, and while in the area, saw a red sedan traveling at a high rate of speed, according to the Sheriff's Office. The vehicle fled the scene after the officer attempted to stop the car, Capt. Eric Abdullah said.\nA short while later, police responded to 1034 Fairview Road after someone called 911 in reference to a shooting incident.\nWhen police arrived, they found a teenage victim, later identified as Shores, in the living room unconscious where a large pool of blood had formed beneath him, according to a police report.\nAnother teenage victim, 16, told police both were playing video games when three unknown subjects entered the home through an unlocked front door, and they were each armed with handguns and were wearing masks, the report said.\nThe victim told police one suspect fired his gun several times in one of the victim's general direction, while another approached the second victim and struck him several times in the face with the blunt end of his firearm, police reported.\nThe suspects left the home with a PlayStation 4 and fled the scene while firing additional rounds into the home, police reported.\nShores was pronounced dead at 9:15 a.m. Saturday at Augusta University Medical Center, according to Aiken County Coroner Tim Carlton."}