{"uri": "http://www.wrdw.com/content/news/One-shot-on-Fairview-Road-in-Clearwater-401838435.html", "title": "UPDATE | Juvenile suspect in teen murder denied release", "dct": "Mon, 05 Dec 2016 00:00:00 GMT", "id": "d1b9e8879d88d56a45a44c5ef8f32e4c", "content": "AIKEN COUNTY, S.C. (WRDW/WAGT) -- One suspect in the murder of 15-year-old Jordan Shores has been denied release from the juvenile detention center in Columbia.\nA family court judge decided to keep the teen in custody after a review on Thursday. The minor suspect is 15-years-old.\nProsecutors moved to get the juvenile tried as an adult, which the court granted. A pre-waiver evaluation is being conducted, after which a full hearing will determine if the minor can be tried as an adult.\nThe suspect is one of six people charged in Shores' death. The other five are being tried as adults and will appear in court in January.\nShores died from a gunshot wound following a home invasion on Fairview Road in November.\nThursday, Nov. 25, 2016\nAIKEN COUNTY, S.C. (WRDW/WAGT) -- Services have been set for 15-year-old Jordan Shores who was killed in his home on Fairview Road last weekend.\nThere will be a visitation at Woodbridge Baptist Church on Birch Street on Saturday, Nov. 26 from noon to 2 p.m. A Life Celebration service will follow from 2 to 3 p.m. The procession to Pineview Memorial Garden on West Five Notch Road.\nDec. 18 would have been Shores' 16th birthday. The community is invited to a candlelight vigil and balloon release at 6 p.m. at Woodbridge Baptist Church.\nWednesday, Nov. 23, 2016\nAIKEN COUNTY, S.C. (WRDW/WAGT) -- The Aiken County Sheriff's Office has confirmed a juvenile accused in the murder of a 15-year-old had a hearing Wednesday morning.\nA family court judge decided to keep the teen in custody in the Columbia Youth Detention Center.\nTuesday, Nov. 22, 2016 News 12 NBC 26 at 6 O'Clock\nAIKEN COUNTY, S.C. (WRDW/WAGT) -- The shooting in Clearwater killing 15-year-old Jordan Shores is still hurting many.\n\"The truth needs to come out, whoever knows the truth needs to speak it,\" Marie Jones said.\nIt's been four days since Marie Jones' son Artie was attacked and his friend killed. More than 100 hours have passed and she still has not heard from police and has barely seen her 16-year old son.\n\"I want him home, I want him in my arms, he won't come home,\" Jones said, \"He told me, he came and took and shower and got his clothes and teared and told us to leave, we weren't safe.\"\nJones says Artie was at a friend's house with Jordan when the attack happened.\nOne of the robbers pistol whipped Artie seven times, breaking his nose. But the wound that will never heal is losing his friend Jordan.\n\"He went down and held Jordan and tried to wake him up and he couldn't get no response,\" she said, \"That's never going to leave his mind.\"\nYesterday around noon, deputies pulled three suspects out of class at Silver Bluff High School. Ronquavis Howard, Raihem McCorkle and a 15-year old juvenile. At this point investigators have not nailed down a motive, but say this was not random.\n\"These individuals specifically targeted that location more than likely,\" Captain Eric Abdullah with Aiken County Sheriff's Office said, \"some of the indications show this was possibly drug related.\"\nNow this mother wants answers. She wants to know why she never heard from the hospital or police after her son, a 16-year old minor, was dropped off, bloodied and beaten.\n\"To see his face the way it was, it's something a mother shouldn't have to do to know that someone wasn't with him,\" Jones said.\nBut she says, after recent threats, she's ready to leave the neighborhood behind.\n\"I have not slept since Friday night, since he came home because of noises, I'm always worried,\" Jones said.\nMonday, Nov. 21, 2016 | UPDATE: 9:23 p.m.\nAIKEN COUNTY, S.C. (WRDW/WAGT) -- Deputies arrested three more suspects in connection to the Fairview Road home invasion and murder.\nNow, deputies have arrested a total of five adults and one juvenile for their roles in a 15-year-old's murder.\nAround noon Monday, investigators arrested 17-year-old Ronquavis James Howard, 17-year-old Raihem Faisson McCorkle, and a 15-year-old juvenile suspect at Silver Bluff High School.\nThe Sheriff's Office said the suspects were taken out of their classrooms and arrested with 'minimal disruption to the operation of the school.'\nAll suspects were charged with one count of murder, two counts of attempted murder, one count of possession of a weapon during violent crime, burglary 1st degree, and armed robbery, according to the Aiken County Sheriff's Office.\nHoward and McCorkle were taken to the Aiken County Detention Center for booking. The juvenile suspect was transported to the South Carolina Department of Juvenile Justice.\nInvestigators have also identified 19-year-old Aikel Leetrez Harrison as the suspect who fled from deputies on Nov. 18. Investigators have obtained warrants for Harrison for murder, two counts of attempted murder, one count of possession of a weapon during a violent crime, burglary in the 1st degree, and armed robbery.\nAround 5:15 p.m., Harrison surrendered himself at the Aiken County Detention Center where he is currently being held. Investigators have changed one of the attempted murder charges to murder on Undraize Antonio Dixon, 17, and Deonte Raequan Schultz, 17, as a result of this investigation. Both were arrested on Nov. 18.\nThe solicitor's office said the first appearance will be Jan. 6, 2017.\n7:50 p.m.\nAiken County deputies have arrested five adults and one juvenile for their roles in a 15-year-old's murder.\nThe Sheriff's Office is planning to release more information about those arrested on Tuesday morning.\nCapt. Eric Abdullah did confirm that Reihem McCorkle, 17, was one the adults facing charges.\nThose arrests include Undraize Antonio Dixon and Deonte Raequan Schultz, who were arrested Friday after investigators say Jordan Shores, 15, was shot. Shores died Saturday morning at the hospital.\n10:29 a.m.\nThe suspects in a deadly home invasion that left 15-year-old Jordan Shores dead will face a judge in January.\nAccording to the Aiken Co. Solicitor's Office, the first appearance for Undraize Antonio Dixon and Deonte Raequan Schultz will be on Friday, Jan. 6, 2017.\nBoth Dixon and Schultz remain in custody. Investigators are still searching for a third suspect. He is being described as a black male, wearing a long sleeve black hoodie, black pants, brown shoes, thin build with dreadlocks. Investigators consider him to be armed and dangerous.\nSunday, Nov. 20, 2016 | UPDATE: 6:20 p.m.\nCLEARWATER, S.C. (WRDW/WAGT) -- Two Beech Island teenagers remain in custody after a home invasion Friday morning left a 15-year-old dead. After years of incidents, neighbors say they're ready to leave the area altogether.\nThe only sound Stephen Thomas likes to hear on Sundays are the leaves being raked in front of his parents' home in Clearwater.\nBut a different scene played out Friday night at the Villa K Townhouses just a block away from their home.\n\"When they said their address, I said 'That's right by Momma and Daddy's house.' So I called and checked and they said they didn't hear anything and it was kind of shocking,\" Thomas says. \"We're not used to it. You're used to seeing it in a big city and stuff like that but not here in a small neighborhood.\"\nA home invasion that left two teenagers in custody and 15-year-old Jordan Shores dead.\n\"Oh that was terrible,\" Thomas says. \"And it was terrible that it was 17-year-olds that what did it. You don't need to lose a life at that young age. He got his whole life in front of him.\"\nNeighbors say people planning to leave after this incident. A woman who has lived at those townhouses for three years says she told her landlord she wouldn't be coming back.\nThey say it's the first time a shooting like this has happened in this quiet neighborhood and fear the violence could spread.\n\"Well, they should be concerned because it happened right down the road,\" Thomas says. \"They could've broken into their house and they need to be concerned somebody coming into your house at night. It'd be nice if we had more county cops riding through the neighborhood, keeping a check on everything. That would be great.\"\nThomas says the folks living here are mostly elderly and have had troubles with other break-ins the past few years. For now, they're doing what they can to feel safe again.\n\"Just keep a check on them,\" Thomas says, \"keep your doors locked and make sure everything's safe and sound before you go to bed at night.\"\nA third suspect is still on the run and is described as a slim black male with dreadlocks. Officials say he was wearing a long sleeve black hoodie and black pants.\nThe Aiken County Sheriff's Office is continuing their investigation into the home invasion.\nSaturday, Nov. 19, 2016 | UPDATE: 3:22 p.m.\nCLEARWATER, S.C. (WRDW/WAGT) -- Undraize Antonio Dixon, 17, and Deonte Raequan Schultz, 17, are both facing murder charges.\nDixon and Schultz were both arrested following a home invasion on Fairview Road early Friday evening.\nJordan Shores, 15, died from a gunshot wound after the incident.\nInvestigators are still searching for a third suspect. He is being described as a black male, wearing a long sleeve black hoodie, black pants, brown shoes, thin build with dreadlocks. Investigators consider him to be armed and dangerous.\nSaturday, Nov. 19, 2016 | UPDATE: 3:22 p.m.\nCLEARWATER, S.C. (WRDW/WAGT) -- A fifteen year old has died after the home invasion on Fairview Road early Friday morning.\nThe Aiken County coroner says Jordan Shores, 15, died at around 9:15 Saturday morning at Augusta University Medical Center.\nShores had a non survivable gun shot wound.\nDeputies responded to Fairview Road early Friday morning for reports of gunshots. There they found two victims, one in extreme critical condition, the other was pistol whipped.\nCapt. Eric Abdullah with the Aiken County Sheriff's Office said investigators believe the incident started from a home invasion.\nInvestigators said there are warrants for Undraize Antonio Dixon, 17, and Deonte Raequan Schultz, 17, for three counts of attempted murder, one count of armed robbery and one count of burglary in the 1st degree. A third subject has been described as a black male, 5'8, about 120 pounds, with black hair wearing a black hoodie, pants, and dark shoes, according to the Aiken County Sheriff's Office.\nThe Aiken County Coroner and the Aiken County Sheriff's Office are investigating.\nAn autopsy is scheduled in Newberry, S.C.\nFriday, Nov. 18, 2016 | UPDATE: 11 a.m.\nCLEARWATER, S.C. (WRDW/WAGT) -- The Aiken County Sheriff's Office has obtained warrants for two men believed to be connected to a shooting on Fairview Road overnight.\nInvestigators said there are warrants for Undraize Antonio Dixon, 17, and Deonte Raequan Schultz, 17, for three counts of attempted murder, one count of armed robbery and one count of burglary in the 1st degree. A third subject has been described as a black male, 5'8, about 120 pounds, with black hair wearing a black hoodie, pants, and dark shoes, according to the Aiken County Sheriff's Office.\nAccording to Captain Eric Abdullah with the Aiken Co. Sheriff's Office, deputies responded to a home on Fairview Road around 1:28 a.m. for shots fired. When they arrived, they saw a red sedan matching the description of the one they were looking for leaving the home and a pursuit started.\nThree suspects ditched the car on Blackstone Camp Road and fled on foot. Two suspects are in custody, but deputies are still looking for a third suspect in the area.\nDuring the pursuit, the other responding deputies attended to two victims found at the home. One person was found in 'extreme' critical condition after being shot, and the other victim was found pistol whipped.\nCapt. Abdullah said investigators believe the incident started from a home invasion. The identities of the suspects are not being released at this time. Both victims were transported to an area hospital for emergency treatment.\nAnyone with information is encouraged to call the Aiken County Sheriffs at 803-648-6811 or Crimestoppers of the Midlands: 888-CRIME-SC (888-274-6372).\n5:28 a.m.\nInvestigators are still looking for a third suspect in an overnight shooting that left two victims critically injured at a home on Fairview Road.\nThe third suspect is being described as a black male, wearing a long sleeve black hoodie, black pants, brown shoes, thin build with dreadlocks. Investigators consider him to be armed and dangerous.\nAccording to Captain Eric Abdullah with the Aiken Co. Sheriff's Office, deputies responded to a home on Fairview Road around 1:28 a.m. for shots fired. When they arrived, they saw a red sedan matching the description of the one they were looking for leaving the home and a pursuit started.\nThree suspects ditched the car on Blackstone Camp Road and fled on foot. Two suspects are in custody, but deputies are still looking for a third suspect in the area.\nDuring the pursuit, the other responding deputies attended to two victims found at the home. One person was found in 'extreme' critical condition after being shot, and the other victim was found pistol whipped.\nCapt. Abdullah said investigators believe the incident started from a home invasion. The identities of the suspects are not being released at this time. Both victims were transported to an area hospital for emergency treatment.\n2:11 a.m.\nAiken County deputies are investigating a shooting where at least one person was shot in Clearwater early Friday morning.\nIt happened on Fairview Road near Jefferson Davis Highway. Aiken County dispatch says two suspects have been arrested, but they are still working to find out how they may be connected to the shooting.\nNo word on the condition of the person shot. We have a crew on the scene trying to get more information.\nCheck back for updates."}