{"uri": "http://www.wowktv.com/story/29754943/child-killed-during-accidental-shooting-in-catlettsburg-ky", "title": "UPDATE: Name released of child killed in accidental shooting in Catlettsburg", "dct": "Tue, 11 Aug 2015 01:42:00 GMT", "id": "9f6bbe724c86ee9dfb816fd18434736e", "content": "CATLETTSBURG, KY -\nUPDATE (10:15 a.m. 8/11/2015)\nThe Boyd County Coroner has released the name of a young girl who was apparently accidentally shot and killed by her brother Monday night.\nIt happened about 8:17 p.m. in the 600 block of 28th Street.\nCoroner Mark Hammond tells 13 News the victim was 12-year-old Halee Marshall.\nIn a previous interview, the girl's grandfather said she was helping her brother unpack his pickup and move into the house.\nHammond tells 13 News the gun, a 12 gauge shotgun, belonged to Marshall's brother and he was taking it into the house when it accidentally fired. Hammond says he didn't realize the gun was loaded.\nThe girl was shot one time. She was pronounced dead at the scene.\nAt this time the shooting appears to be accidental. Hammond says neither drugs nor alcohol were involved.\nMarshall was a student at Boyd County Middle School. Grief counselors have been called into the school.\nAn autopsy is being performed on Marshall Tuesday in Frankfort. Hammond says he expects preliminary results by the end of the day.\n_____\nUPDATE (11:15 p.m. 8/10/2015)\nCatlettsburg Police say a 12-year-old girl was killed in an accidental shooting Monday night.\nIt happened about 8:17 p.m. in the 600 block of 28th Street.\nThe victim's grandfather tells 13 News he was out at the time when his granddaughter was helping her brother move in. He says she was taking items out of the truck when the gun may have gotten caught on the strap, causing it to go off.\nA portion of the road has been blocked off in order for emergency personnel and police to process the scene.\nKeep checking back for updates.\n_____\nAuthorities say a child was killed during an accidental shooting Monday night in Catlettsburg.\nIt happened about 8:17 p.m. in the 600 block of 28th Street.\nDispatchers say the victim was a 12-year-old girl.\nOfficers with the Catlettsburg Police Department and emergency medical personnel are on scene.\nWe are working to gather more information. Keep clicking for updates."}