{"uri": "http://www.fox5atlanta.com/news/190632591-story", "title": "One of two teens accused in shootout with Marietta officers appears in court", "dct": "Sun, 14 Aug 2016 12:57:00 GMT", "id": "c01e648a0006b1391b941b05d91ec6a6", "content": "MARIETTA, Ga. - One of two juveniles accused of shooting a Marietta police officer appeared in court for the first time Monday. Police said the 15-year-old was involved in a shootout with Marietta Police Sunday morning at Gallery Apartments.\nAuthorities were called out to the Gallery Apartments on Franklin Gateway in Marietta around 4:30 a.m. to a report of a vehicle break in. When officers arrived, investigators said the two suspects were in a car and fired the first shot at officers, striking Officer Scott Davis. Police said one of the suspects was struck by return fire from the officers.\nMarietta Police Officer Brittany Wallace told FOX 5 News two guns were recovered from the scene. Wallace said there is only one confirmed shooter and the suspect that appeared in court Monday is not the shooter.\nOne of two teens accused in shootout with Marietta officers appears in court\nInvestigators believe the 16-year-old, who is currently recovering at the hospital, was the gunman who injured the officer. No word on the extent of his injuries or current condition.\nOfficer Davis, a 10 year veteran with the department, was shot in the leg and is said to be coming along quickly in his recovery at WellStar Kennestone Hospital. Marietta Police said on Monday he is \"up and moving around\" and hoping to go home Monday night or Tuesday.\nFOX 5 News reached out to the Cobb County District Attorney’s Office to see if they plan to charge the teens as adults. Officials there said they are exploring all their options, one of which is to get the case transferred to Superior Court\nAn arraignment is set for Wednesday at 9 a.m. for the suspect who was in court Monday.\nOfficer Davis and the two other officers who were involved in the shooting were placed on administrative as is standard policy for officers in shootings such as this.\nWallace said in an email Monday that investigators determined the teens are Blood Gang members and will face charges under the state's gang statute, as well as other charges."}