{"uri": "http://www.dallasnews.com/news/crime/headlines/20130924-sheriff-navarro-county-mother-killed-husband-children-before-shooting-herself.ece", "title": "Sheriff: Navarro County mother killed husband, children before shooting herself", "dct": "Sat, 28 Sep 2013 00:00:00 GMT", "id": "dca96fbb8c1428d38a993c97d6de60fe", "content": "A mother fatally shot her husband and three sons in their Navarro County home before killing herself with a single shot in the head last week, the sheriff announced Tuesday.\nInvestigators were still trying to determine why 33-year-old Guadalupe Ronquillo-Ovalle killed her family late Thursday or early Friday in Rice, about 40 miles southeast of Dallas. Women are rarely the shooters in murder-suicides.\nNavarro County Sheriff Elmer Tanner said at a news conference that the bodies of Ronquillo-Ovalle; her husband, Israel Alvarez, 33; and their sons, ages 4, 8 and 10, were discovered by Alvarez’s father, who had to use a ladder to get into the house through a second-floor balcony. Tanner said there was no indication that Alvarez fired any shots.\nThe killings came less than two weeks after Alvarez was arrested Sept. 11 on a family violence charge.\nAccording to a sheriff’s office report released Monday, Ronquillo-Ovalle went to her children’s elementary school to call 911 because Alvarez took away her cellphone and removed the battery. She told a deputy that she was on the phone talking to her sister when Alvarez entered the room and pushed her.\nRecords show Alvarez pleaded no contest to family violence assault, a misdemeanor, and paid a $367 fine and was released after spending two days in jail.\nNo divorce filings or requests for a restraining order were filed, and Ronquillo-Ovalle did not ask for a protective order, according to records.\nTanner said investigators could not determine much from his arrest “other than that was an isolated incident involving family violence.”\n“We can only assume that there were problems in the household,” Tanner said.\nMaria Franco, a family friend, said the couple came to her home on Sept. 16, asking for advice about keeping their relationship together. The couple talked about “normal problems” they were having, she said.\n“I didn’t hear anything dangerous,” Franco said.\nJosh Sugarmann, the executive director of the Violence Policy Center, said family murder-suicides usually happen after “an event that prompts the person to lose control,” such as financial issues or domestic violence.\nBut usually, men are the shooters. Women commit only about 1 in 10 murder-suicides, according to the policy group’s study of news accounts.\nA few such shootings have occurred in recent years in North Texas.\nIn 2010, Coppell Mayor Jayne Peters killed her 19-year-old daughter and then herself. Peters had faced financial difficulties, and investigators found depression medication in the home.\nAbout six months ago in Mesquite, Angelica Vazquez fatally shot her two adult children and her husband before killing herself.\nDetectives believe that before the slayings, Vazquez had withdrawn from her family and “missed family functions that she typically would have attended and had refused family members’ suggestions to seek professional help,” police spokesman Bill Hedgpeth said.\nVazquez family friend Gustavo Herrera said the mother hadn’t been her usual happy, family-oriented self. But nobody saw any signs she would do something that “was so drastic,” he said.\n“This is something you didn’t expect from the mom,” he said.\nStaff writer Tristan Hallman,\nThe Associated Press"}