{"uri": "http://www.wave3.com/story/29682669/mother-says-teen-shooting-victim-and-suspect-were-close-friends", "title": "Mother says teen shooting victim, suspect were close friends", "dct": "Fri, 31 Jul 2015 20:30:00 GMT", "id": "a84f731d660df4bf63e4c473070d78f5", "content": "LOUISVILLE, KY (WAVE) – A 16-year-old died after he was shot in the head and now his 17-year-old friend is charged with his murder.\nThe victim's mother, Tamarah Cunningham, said her son and the suspect have been friends for 10 years. They even lived next to each other.\nLouisville Metro police are remaining tip lipped about the evidence that led them to this murder charge.\n[RELATED: 16-year-old homicide victim ID'd; 17-year-old charged with murder]\n“I feel like I lost a part of my heart, like a piece of me is gone and won't come back,” Cunningham said.\nCunningham will never forget the moment she got the call that her son, Desean Mitchell, was shot.\n“No one wants to harm my child because everyone liked him,” Cunningham said. “Everyone is at a loss right now, friends and family.”\nThursday night around 8:30, neighbors along Hudson Lane rushed to try to save Mitchell using CPR.\n“I want to thank them from the bottom of my heart for doing what they could to save him, for just being there with him,” Cunningham said.\nMitchell died during surgery at University of Louisville Hospital. The next day his 17-year-old friend was charged with murder.\nVance, who asked not to reveal his last name, was called to same house earlier in the night by a friend who said they found a 40 caliber semi automatic gun. Vance said his friend's parents were out of town and few guys were hanging out.\n“I got back there and it was just like sitting on the table, nobody was really touching it or anything,” Vance said. “I was just looking at it and I was just looking at it and was like ‘that's not real’ and the clip was next to it, so I was like ‘ok I guess it is real.’”\nVance said he ended up leaving before the shooting, but said everyone seemed fine and he did not sense anyone was in a conflict. As soon as he heard what happened, he said he rushed back to the house. He saw the teen police arrested still at the house. Vance said he knows the victim and the suspect and believes this had to be an accident.\n“I couldn't believe it,” Vance said. “I just kept saying in my head ‘this is not real, like I was just there.’ There is some guilt, like I wish I could have been there, maybe there was something I could have done.”\nCunningham said she just wants to know the truth.\n“I need to hear it from the people that was there on what's going on,” Cunningham said.\nPolice did recover the gun. LMPD did not to comment on the case due to juvenile privacy laws.\nWAVE 3 News did reach out to the suspect's mother for comment, but haven't heard back.\nMitchell was about to start his junior year at Southern High School. Cunningham said her son loved football and enjoyed being with friends and going to church.\nCopyright 2015 WAVE 3 News. All rights reserved."}