{"uri": "http://www.wdrb.com/story/29684164/16-year-old-desean-mitchell-accidentally-shot-and-killed-by-friend-according-to-witness", "title": "16-year-old Desean Mitchell accidentally shot and killed by friend, according to witness", "dct": "Sat, 01 Aug 2015 00:40:00 GMT", "id": "d4db6d5648f2072a83a814fbc06ad4f6", "content": "LOUISVILLE, Ky. (WDRB) -- Desean Mitchell was killed after being shot Thursday night on Hudson Lane near Fairground Road in Fern Creek. A friend of Mitchell -- who is unidentified because he is underage -- says another friend of Mitchell's is the one who pulled the trigger.\n“He shot my friend in the head and it was an accident, it was definitely an accident. It was never on purpose,” he said.\nLouisville Metro Police have since charged the 17-year-old friend with murder.\n“He thought that I took the clip out and didn't have the clip in the gun, but he cocked it back a couple minutes later, he pointed it at Desean joking around, he pulled the trigger and it fired,” he said.\nWhat's unsettling to a neighbor, who lives across the street, is what a group of teenagers was doing with a gun.\n“We found it down there, over there. We just thought it was cool at first and it took somebody's life,” he said.\nThis is the same block in the same neighborhood where 24-year-old Garfield Webb lived. Webb was killed Wednesday night on Camp Street in Shelby Park. LMPD says the two cases are not related, however with two murders in two days, at least one neighbor is thinking about moving.\nThe friend says the victim and suspect in Thursday's shooting were good friends and says seeing posts on social media about how the murder was planned is upsetting.\n“No, it was not that. It's just a mistake, it’s just one of those weird coincidences that just happen and it’s like man how did that happen?” he said.\nThe 17-year-old charged with murder is being held at the Louisville Metro Youth Detention Center.\nMore: Police arrest suspect after teen fatally shot in Fern Creek; victim identified\nCopyright 2015 WDRB News. All rights reserved."}