{"uri": "http://www.mlive.com/news/kalamazoo/index.ssf/2015/08/boy_12_charged_in_shotgun_kill.html", "title": "Boy, 12, charged in shotgun killing of sleeping pregnant woman", "dct": "Tue, 18 Aug 2015 14:55:00 GMT", "id": "7bf91911b92897759561d5e92cc432c4", "content": "KALAMAZOO, MI - A 12-year-old boy with mental impairments who police say accidentally shot and killed a woman in May while she slept has been charged with a misdemeanor in juvenile court.\nA petition authorized Wednesday by a Kalamazoo County Circuit Court Family Division referee charges the boy with one count of careless discharge of a firearm causing death. The charge is a high-court misdemeanor and punishable by up to two years in prison in cases where a defendant is being tried in adult court.\nIn the boy's case in juvenile court, a judge will eventually decide at a dispositional hearing what, if any, penalty he may face. County Prosecutor Jeff Getting said a penalty could range from fines and costs to placement in the county juvenile home or another facility for juveniles.\nProsecutors allege in the petition that the boy \"because of carelessness, recklessness, or negligence, but not willfully or wantonly\" caused a shotgun under his control to discharge, which led to the death of Deborah Christner on May 22 at 704 Dwight Ave.\nAssistant Prosecutor Scott Brower requested in the petition that the juvenile court take jurisdiction over the boy. Referee Douglas Cameron authorized the petition.\nKalamazoo Public Safety officers responded to a Dwight Avenue house in May on reports of a shooting. At the time, they said the incident appeared to be an accident.\nThe boy's grandfather, Daniel Hummel, said Monday that his grandson continues to live with him. He declined to comment about the case.\nAt the time of the shooting, Hummel said that the shotgun had been locked in a safe but that the boy came across the keys in the pocket of Hummel's clothing as he looked for change.\nHummel said the boy was up at 5:30 a.m. on the day of the shooting before anyone else in the house. After finding the key, the boy unlocked the safe, removed the shotgun and loaded it.\nHummel said his grandson knew what he was doing was wrong and, at one point, tried to take a shell out of the gun.\nThe gun, though, discharged, sending pellets through a nearby closet wall. The pellets struck Christner, 28, a friend of the family who had lived with the Hummels for about a year.\nHummel said Christner was two months pregnant when she was killed.\nAt the time of the shooting, Hummel said his grandson was an apprentice hunter and familiar with firearms, but that he did not know the full impact of his actions. He called the incident \"an unfortunate accident.\"\nThe boy, who is being represented by attorney Thomas J. Allen, of Kalamazoo, is scheduled to be back in court Oct. 9 for a pretrial hearing before Referee Robin V. King.\nRex Hall Jr. is a public safety reporter for the Kalamazoo Gazette. You can reach him at rhall2@mlive.com. Follow him on Twitter."}