{"uri": "http://denver.cbslocal.com/2015/07/21/no-charges-in-accidental-shooting-of-7-year-old-boy/", "title": "No Charges In Accidental Shooting Of 7-Year-Old Boy", "dct": "Tue, 21 Jul 2015 18:05:00 GMT", "id": "b50a6d69bf596895658f09e86bfd6422", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nAURORA, Colo. (CBS4) – The district attorney will not file charges in the accidental shooting of a 7-year-old boy in Aurora.\nMark Hurlbert, Assistant District Attorney for the 18th Judicial District, made the announcement on Tuesday afternoon during a joint news conference between the Aurora police and the district attorney’s office.\nNo charges will be filed against the 12-year-old who pulled the trigger or for anyone else responsible for the gun.\n“This was a thorough, thorough investigation. Truly the Aurora Police Department left no stone unturned and left no question unasked. It was one of the most thorough investigations I have seen,” Hurlbert said. “After reviewing all the police reports, after looking at all of the evidence and all of the witness interviews, we’ve decided not to file charges in this case.”\nSeveral children between the ages of 7 and 12 were home alone when the boy was shot on July 9. Police said it was a gun that was already in the house.\n“This event was a tragic reminder to gun owners about the importance of making sure that firearms are properly secured and not accessible to children,” Operations Division Chief Kevin Flynn said.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nFlynn said the shooter had allowed the group of juveniles into his home because they wanted a drink of water after playing outside.\n“This was against the house rules of his parents as he was not allowed to have anyone inside the residence when there was not an adult present,” Flynn said.\nSome of the juveniles left the home while others stayed inside. Flynn said the gun was retrieved by the shooter from the pocket of a coat that was hanging on a coat rack in the shooter’s father’s bedroom.\n“It is our understanding that the father had hidden the gun and didn’t believe that his son had access or knowledge as to where the gun had been located,” Flynn said.\nAccording to Flynn, the other juveniles witnessed the shooter insert a magazine into the firearm.\n“At one point the gun was passed around … all of them touching or handling it at some point. The shooter regained control of the gun in an effort to put the gun away … the trigger was accidentally pulled with the round striking the victim,” Flynn said. “The shooter made a statement in a subsequent interview that he never intended to shoot anyone.”\nThe boy, whose name hasn’t been released, remains hospitalized in stable condition at Children’s Hospital with what was called a “long recovery” ahead."}