{"uri": "http://www.firstcoastnews.com/news/crime/2-people-shot-in-front-of-jacksonville-landing-police-say/386455577", "title": "2 teens shot at Jacksonville Landing; 1 teen died", "dct": "Tue, 17 Jan 2017 00:00:00 GMT", "id": "b6f77e9631255daf05ba26f38f371fdb", "content": "Two people were shot near the Jacksonville Landing downtown Monday afternoon and police say it may be related to the shooting at First Wednesday Art Walk almost two weeks ago.\nA 16-year-old and a 13-year-old were shot outside the front entrance of the Landing around 4 p.m. - both were taken to a local hospital, a Jacksonville Sheriff's Office spokesperson says. The 16-year-old teen passed away, according to JSO.\nJacksonville Landing Shooting: One victim has died. #JSO #JAX #Jacksonville\n— Jax Sheriff's Office (@JSOPIO) January 17, 2017\nAuthorities on scene are searching for a suspect or suspects at this time and have about 30 witnesses detained for questioning. Police can't give any suspect description at this time.\nPolice say they believe the shooting where two teens were shot at Art Walk and this shooting are related because several of the same people were reportedly in the area.\nA confrontation in front of the landing reported escalated into gunfire, a spokesperson says. The front doors of the Landing had their glass shattered by gunfire.\nSeveral people were in the area and police say it was good more people weren't hit by gunfire. Authorities recovered a single handgun at the scene but believe there are more guns involved.\nThere may have been multiple shooters, but at this time police can't say one way or the other. Detectives will check nearby cameras to try and identify any suspects.\nTwo off-duty officers were working as security at the Landing at the time of the shooting and rushed outside to find the two teens shot.\nA spokesperson for the sheriff's office asks parents to be better about securing their guns and being mindful of what their children are doing. The sheriff's office also asks gun owners to secure their weapons; oftentimes firearms are taken out of unlocked cars.\nThere is a heavy police presence downtown on Water Street at Hogan Street near the west edge of the Landing and the roundabout near the Andrew Jackson statue is closed down as police congregate there.\nOne witness tells us via Twitter she saw people running right after the shooting; she says she works at the Wells Fargo building near the roundabout.\nThe sheriff's office insists that, statistically, downtown is very safe.\nEarlier this month, two people were shot during First Wednesday Art Walk near the Landing.\nA press agency representing the Landing released a statement shortly after 7 p.m.:\nThe incident that occurred on city property outside of the Landing today saddens us. This is an ongoing investigation by Jacksonville Sheriff's Office, therefore we cannot comment any further.\nJUST IN: Witness shares picture of blood-stained clothing near evidence marker at Jacksonville Landing. Suspect still on the run @FCN2go pic.twitter.com/c5Hhpc6tyo\n— Matthew Head (@matt8272) January 16, 2017\nI counted about 6 police markers in front of the Jacksonville Landing. 2 people were shot. @FCN2go pic.twitter.com/0MGt3c1vha\n— Steven Dial (@StevenDialTV) January 16, 2017\nIf you or someone you know, knows anything about this shooting, please call the sheriff's office at 904-630-0500. To remain anonymous and receive a possible cash reward, call Crime Stoppers at 1-866-845-TIPS.\nHAPPENING NOW: @JSOPIO working double shooting at the Jacksonville Landing. Multiple roads around the Landing blocked off. @FCN2go pic.twitter.com/pg9yevcKqs\n— Matthew Head (@matt8272) January 16, 2017\n(© 2017 WTLV)"}