{"uri": "http://triblive.com/local/valleynewsdispatch/11571730-74/jackson-williams-basement?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29", "title": "Homicide count stands in shooting in Arnold that ended teen girl's life", "dct": "Fri, 02 Dec 2016 12:09:00 GMT", "id": "ccda9dda154b7e582d6095b4339a6d3f", "content": "Brandon Jackson recalled Thursday how he tried desperately to help his dying teenage girlfriend after she was shot in the chest in the basement of his Arnold home while they were hanging out with his buddy.\n“She screamed for me to help her,” Jackson testified during a preliminary hearing for his friend, Cashaan “Dink” Williams, 18, who is charged with homicide in the Nov. 7 killing of Akira Marie Waters of Avonmore.\nJackson, 19, said he tried to carry his 16-year-old girlfriend of “six or seven months” up the stairs but laid her down on the basement floor when she fainted and slid back down.\nHe said he ran upstairs to dial 911 on a landline but said he couldn't reach a dispatcher quickly enough. Upon returning to the basement, Jackson said, Williams tossed him a cellphone that was already dialing 911 then fled the home.\n“Don't tell no one I was here,” Jackson said Williams told him.\nWilliams, of Arnold, was ordered held for court by District Judge Frank J. Pallone Jr., who refused a request by the suspect's attorney to consider lowering the charge to involuntary manslaughter.\nJackson was the only witness called by Westmoreland County Assistant District Attorney Larry Koenig during the hearing in a crowded courtroom in Pallone's New Kensington office.\nJackson testified that he thought the shooting was an accident but it left him confused. He said there had been no arguments among the three teens that day. Jackson told police that Waters was shot with a gun that “Williams frequently played with.”\nJackson said the three had just finished making donuts upstairs and were sitting in his basement bedroom when he said Waters joked to Williams, “You won't shoot me.”\nJackson said he remembered Williams replying, in a playful manner, “I won't.”\nJackson said, through tears, he then heard a click and a bang and realized Waters had been shot. He said he noticed a gun in Williams' hand but didn't see him holding it before the shooting.\nAsked by Williams' attorney, Duke George, if he thought the shooting was an accident, Jackson said: “I don't think my best friend would mean to shoot my girlfriend.”\nWilliams waived his right to a preliminary hearing on a separate felony charge, filed Thursday, of person not to possess or use a firearm. That stems from his adjudication on juvenile charges of simple assault and aggravated assault in 2012.\nA formal arraignment for Williams is scheduled for Jan. 25 before Westmoreland County Judge Christopher Feliciani.\nAndrew Erickson is a Tribune-Review staff writer. Reach him at 724-226-4675 or aerickson@tribweb.com."}