{"uri": "http://www.kmov.com/story/34265823/young-mother-from-st-peters-killed-in-triple-homicide-in-kansas-city", "title": "Young mother from St. Peters killed in Kansas City triple homici - KMOV.com", "dct": "NODATE", "id": "836b7dfeddb3ec0eeb20a48310233d6c", "content": "Print\nST. CHARLES COUNTY, Mo. (KMOV.com) – A young mother from St. Peters was killed in a triple homicide in Kansas City on Thursday night.\nAccording to police, three men entered the Trails at the Ridge apartment complex and shot five people inside. Three people were killed, including 20-year-old Ali Brown. Brown’s two year old son Karson was seriously injured along with another adult.\nBrown is the daughter of former St. Peters mayor Shawn Brown. She was living in Kansas City with her son.\n“They both just had those brilliant blue eyes and those long eye lashes,” said Carissa Figgins. Figgins is the executive director of Sparrow’s Nest in St. Charles, a home for pregnant teenagers. Brown lived at Sparrow’s Nest and became like family to Figgins. “For this to happen, it’s just unreal,” said Figgins.\nBrown’s brother Trent Brown who also lives in Kansas City said they have heard very little from police.\nInvestigators released a vague description of the suspects on Saturday, but no further information on the quintuple shooting.\n“It’s terrible that she’s gone, it hurts,” said Brown over the phone. He is heading to St. Louis for his sister’s funeral.\nBrown said his nephew Karson is miraculously expected to survive after being shot five times in the incident.\n“He’s going to be in the hospital for a great deal of time, a lot of things to recover from,” said Figgins.\nFiggins said Karson was Ali’s whole world.\n“Any teaching moment we gave her she just took it in and tried to be the best mom that she could for Karson,” said Figgins. “She was very vivacious, very energetic, very happy and trying to make everyone happy around her.”\nBoth Figgins and Brown’s family said they will do everything they can to help the two-year-old get through this tragic time.\n“As a community, whether it’s in St. Charles or Kansas City we can’t allow Karson’s life to be a tragedy, for all the love, for all the attention that Ali poured into her son, we can’t let his life be for naught.”\nThe family has set up a GoFundMe page to help with funeral expenses and future needs for Karson.\nCopyright 2016 KMOV (Meredith Corporation). All rights reserved."}