{"uri": "http://www.mysanantonio.com/news/local/article/Deadly-shooting-at-South-Texas-H-E-B-10639643.php", "title": "Police: 'Paranoid' H-E-B employee shoots 4 colleagues, killing 1 at South Texas store", "dct": "Mon, 28 Nov 2016 00:00:00 GMT", "id": "0cfb27e4b9dbc85eee4e79577d3f5153", "content": "A H-E-B employee who allegedly shot and killed one fellow worker and injured three others Monday morning at a South Texas store believed “everybody was out to get him,” Palmview Police Chief Christopher Barrera said in an interview with mySA.com.\n“He was paranoid. He felt everybody was out to get him,\" Barrera said, adding that the suspect didn't target a specific individual.\nRaul Lopez, 25, faces one first-degree felony charge of murder and three second-degree felony counts of attempted murder, Barrera said.\nAt around 3:15 a.m., Lopez allegedly fired 15 shots at a break room window of the H-E-B store at 1840 W. Palma Vista Drive in Palmview, about 10 miles west of McAllen, Barrera said, hitting four employees.\nRELATED: SAPD: Good Samaritan fatally shot outside Northwest Side Walmart\nMario Pulido, 48, was pronounced dead at the scene. Bill Martinez, 33, and Rafael Martinez, 37, were transported to a nearby hospital in critical condition, Barrera said. Frailian Garza, 51, sustained non-life-threatening injuries.\nLopez fled the scene but later called the Hidalgo County Sheriff’s Office to turn himself in, Barrera said. He drew investigators a map to find the 9 mm handgun he used in the shooting, which he had tossed in a field near his residence in Western Hidalgo County, Barrera said.\nBarrera said the 25-year-old employee, who does not have a prior criminal record, did not target specific employees. Lopez intended to scare the victims, not injure them, Barrera said.\n\"Anybody could've been in the break room,\" he said.\nH-E-B officials said the San Antonio-based supermarket chain is working closely with the Palmview Police Department during its investigation and looking to help its employees and their families. H-E-B spokeswoman Dya Campos said the company plans to reopen the Palmview store sometime Tuesday.\n\"The H-E-B family is deeply saddened by the tragic incident which occurred during the early morning hours of November 28th at our Palmview store resulting in the death of one partner and injury to three other partners,” Javier Avalos, H-E-B vice president and general manager for the border region, said in a statement. “As our company mourns, our thoughts and prayers are with the victims and the families of those affected.\"\nBill Martinez and Rafael Martinez were undergoing surgery for their injuries as of Monday afternoon, Barrera said. Garza was discharged with minor injuries.\nLopez is being held in Hidalgo County Jail on a $1.9 million bond.\nStaff writer Madalyn Mendoza contributed to the report."}