{"uri": "http://www.themonitor.com/news/local/one-dead-inside-a-palmview-heb-after-drive-by-shooting/article_50215ee4-b571-11e6-9f0e-87f6ccb8fde0.html", "title": "Shooting at H-E-B leaves 1 dead, 3 injured", "dct": "Mon, 28 Nov 2016 00:00:00 GMT", "id": "1b6603c1ab0904197f8e307aeb22947a", "content": "PALMVIEW — An H-E-B employee shot four of his co-workers killing one and injuring three others, while the men took a break from doing inventory early Monday morning, according to police.\nOfficers responded to a call about 3:15 a.m. for an active shooter inside the H-E-B at Goodwin Road and Expressway 83. The suspect was caught on surveillance video shooting into the store and fleeing the scene, but later called 9-1-1 and turned himself in, according to Palmview Police Chief Chris Barrera.\n“He told the dispatcher he was the shooter,” Barrera said. “Officers with the assistance of the Hidalgo County Sheriff’s Office responded to the address the man provided and found him standing in the middle of the street where he surrendered peacefully.”\nRaul Lopez Saenz, 25, was arrested outside his home in the 6200 block of Chris Drive, and confessed to the shooting which left one person dead inside the store and landed three others in the hospital.\nOfficers also recovered the alleged murder weapon after the suspect drew them a map of where he had thrown it after he fled the scene and drove back to his home, Barrera said. Crime scene investigators were seen surveying both crime scenes Monday morning using a drone and several street markers.\nAfter his arrest, Saenz told investigators he didn’t shoot anyone and said he believed the window was bulletproof and nobody was hurt, Barrera added.\n“His motive is paranoia, he thought everyone was out to get him,” Barrera said. “The employees there were not targeted in any way. It just so happened that they were there at the time of the shooting.”\nSurveillance video shows Saenz, who was working inventory Monday morning, clock out and leave the store before returning and parking his truck in front of the store. Saenz is then seen stepping out of his truck and walking up to the store where there are four square, dark-tinted windows, according to investigators.\nSaenz walked up to the second window and shot more than 15 times with a 9 mm handgun.\nOn the other side of the window were Rafael Ramirez-Martinez, 37; Frailan Garza, 51; Billy Joe Martinez, 33; and Mario Alberto Pulido, 48, inside the grocery store’s break room, police said.\nPulido died at the scene and the other three men were rushed to the hospital. Ramirez-Martinez and Martinez remained in critical condition after undergoing surgery Monday afternoon; Garza had been released after suffering non-life threatening injuries, according to Barrera.\n“We still have not interviewed the individuals who were taken to the hospital,” Barrera said during a 2 p.m. news conference alongside H-E-B vice president and general manager for the border region Javier Avalos.\n“The H-E-B family is deeply saddened by the tragic incident,” Avalos said. “As our company mourns, our thoughts and prayers are with the victims and the families of those affected.”\nAfter the news conference inside the police station, Saenz was formally charged with one count of murder and three counts of attempted murder, all first-degree felonies. Municipal Court Judge Jaime Muñoz issued Saenz a $1.9 million bond.\nIf found guilty of murder, Saenz could face up to life in prison and a $10,000 fine."}