{"uri": "http://blog.al.com/live/2014/03/7-year-old_suffering_gunshot_t.html#incart_2box", "title": "7-year-old found shot in the head dies of gunshot wound, Mobile police investigate (updated)", "dct": "Thu, 06 Mar 2014 00:54:33 GMT", "id": "64a753d6665ff09a87a42e36ab762413", "content": "MOBILE, Alabama -- Approximately six hours after a 7-year-old boy was rushed to the University of South Alabama Medical Center following a shooting on Wednesday morning, the child has died of his wounds, said a Mobile Police Department spokeswoman.\nJ'Daun Hill was killed of a gunshot wound to his head, which he sustained before about 9:30 a.m. on Wednesday morning, saide MPD spokeswoman Ashley Rains.\nPolice were called to a reported shooting on the 2600 block of Wealthy Street around 9:30 a.m., Rains said. They found J'Daun when they arrived.\nHe was transported to the University of South Alabama Medical Center, where he underwent surgery for an injury described by police as life-threatening.\nShe confirmed Wednesday afternoon that the boy had suffered a gunshot wound to his head but could not comment on whether the wound was self-inflicted or accidental.\nNeighbors said J'Daun lives with multiple siblings and his parents in the home on Wealthy Street where the shooting took place.\nGathering in the street surrounding the home many neighbors, including the child's great grandfather Clinton Hill, speculated that the 7-year-old shot himself accidentally, although police are still investigating to determine what led up to the shooting.\n\"This is a good neighborhood,\" Hill said, adding that most of the people on the block are \"family folk.\"\nMobile police spokeswoman Ashley Rains said authorities are not charging anyone in relation to the shooting as of 4 p.m. on Wednesday. Two witnesses, including at least one juvenile, were seen Wednesday morning as police led them away from the scene for questioning.\nFamily members, gathered at a home across from the shooting on Wednesday, identified the witnesses as additional relatives of the injured 7-year-old.\nUpdated at 7:25 p.m. to correct the spelling of J'Daun Hill's name."}