{"uri": "http://www.whio.com/news/news/crime-law/arrest-made-in-fatal-shooting-of-dayton-child/np59M/", "title": "Police release cruiser cam in high-speed chase", "dct": "Wed, 20 Jan 2016 00:00:00 GMT", "id": "182e88883e0b3c665c70a20696fb7121", "content": "UPDATE @ 5:30 p.m. (Jan. 20): Police have released cruiser camera footage from a high-speed chase on Friday that led to the arrest of a suspect in the shooting death last week of 13-month-old Elijah Johnson.\nDontay J. King, 23, was named as a homicide suspect and Bryan J. Cortner, 23, was identified as the driver in the 15-minute pursuit that reached speeds exceeding 100 mph in court documents. Both men were arraigned Tuesday and remain held in the Montgomery County Jail.\nAnother man, 25-year-old Shawn D. Smith, was arrested early Monday in connection with the drive-by shooting that killed Elijah and injured Isaiah Smith and the child’s grandmother, Diana Hicks.\nUPDATE @ 3:24 p.m. (Jan. 18)\nCortner was arranged by video today, and bond was set at $50,000 cash assurety. His preliminary hearing was scheduled for January 25.\nUPDATE @ 12:01 p.m. (Jan. 18)\nNewsCenter 7’s Mike Campbell is working today to gather new information in the fatal shooting of 13-month-old Elijah Johnson last week.\nA senior pastor at Tabernacle Baptist Church, where the family involved in shooting attends, said the family is holding up.\nUPDATE @ 2 p.m. (Jan. 16):\nTwo men arrested after a high-speed chase Friday remain In Montgomery County Jail today.\nAccording to jail records, the two are Bryan J. Cortner, 23, who was booked on multiple charges and Dontay J. King, 23.\nCortner was taken to jail on three outstanding warrants and suspicion of felony fleeing and eluding, along with other pending charges that include domestic violence and burglary. King was booked on suspicion of two parole violations.\nCortner and King were arrested after a chase Friday that started on Ohio Route 49 with speeds reaching 80 mph. It ended with a Pontiac Grand Prix on a lawn on Oakridge Drive and a firearm recovered next to it.\nDayton police have not commented on any potential links to Thursday’s drive-by shooting death of 13-month-old Elijah L. Johnson.\nDayton police Lt. Eric Henderson said Friday of the early investigation that two suspects were in custody, but he didn’t name them.\n“At this point in time, we don’t know if both are related to the incident,” he said.\nPolice have seized a black Chevy Impala they believe was used in Thursday’s shooting.\nIn the incident that killed Johnson, two others were shot and wounded, the child’s grandmother, 63-year-old Diana Hicks, and the boyfriend of his mother, 25-year-old Isaiah Smith. Police said they believe Smith was the primary target in what they describe as a drive-by shooting that broke out on Queens Avenue and seconds later moved to on Arlene Avenue.\nInvestigators have said the car Hicks used to take everyone to the hospital contained marijuana and a large amount of cash, evidence they said indicates illegal drug activity. — STEVE BENNISH, STAFF WRITER\nUPDATE @ 9:05 p.m. (Jan. 15) Derrick Foward, Dayton Unit NAACP president, spoke with reporters tonight to publicly plead for young people to stop the “black-on-black crime” that left a 13-month-old Dayton child dead of gunshot wounds.\n“This is a sad state of affairs in the history of our community, that the first homicide of this year will be that of a 1-year-old male boy,” Foward said, speaking in the neighborhood where two men were taken into custody as persons of interest in the slaying of Elijah Johnson on Thursday.\n“How about this black-on-black crime that continues to plague our community? We’ve got to stop, young men. We’ve got to stop, young women,” Foward said.\nHe said the violence makes it difficult for the NAACP to continue to fight for economic development in this community, for job retention and job growth.\n“But we have to keep fighting,” Foward said. “We can no longer sweep under the rug the violence of black on black. It is something that is inhuman.\n“Is it going to take this child’s life… to curb this reign of terror inside our community?” Foward asked, rhetorically. “I don’t have the answer but I hope that somewhere, in their hearts, that they know they are destroying our community by their senseless acts of violence.”\nUPDATE @ 5:30 p.m.: Two males detained as persons of interest in Thursday’s fatal shooting of a 13-month-old Dayton child are being questioned by homicide investigators. Their apprehensions occurred following a high-speed pursuit that ended in the 1700 block of Oakridge Drive, Lt. Eric Henderson said.\n“We have two persons in custody, one of which is potentially a suspect in the crime” that led to the death of Elijah Johnson and the wounding of his grandmother and the boyfriend of his mother, Henderson said. “At this time we don’t know if both [persons of interest] are related to the incident, so it’s still under investigation.”\nHenderson said one of the individuals was arrested near the vehicle both men were in, and police also recovered a firearm from near where that vehicle ended up, in a yard on Oakridge Drive. The other individual was apprehended as police and sheriff’s deputies were searching yards and houses in the neighborhood.\nThe two men fled in the vehicle from a traffic stop that began about 3:43 p.m. in the area of West Third Street and Gettysburg Avenue, Henderson said. That led to a pursuit that reached speeds of up to 80 mph on the Trotwood Connector and slowed as it reached city neighborhoods, the lieutenant said.\nUPDATE @ 5:13 p.m.:\nPolice have seized a black Chevy Impala they believe was used in Thursday’s fatal shooting. We’re told the car has been located at the Catalpa Crossings Apartments, 108 Turner Road, near North Main Street.\nThursday, Dayton Lt. Shannon Mason said the male wounded in the shooting told police the gunshots came from a black Chevy.\nUPDATE @ 5:02 p.m.:\nPolice have detained a second person in Thursday’s fatal shooting of 13-month-old Elijah Johnson and the wounding of his grandmother and the boyfriend of his mother.\nFIRST REPORT\nOne person has been detained and a second person is being sought in the fatal shooting of a 13-month-old Dayton child that occurred Thursday afternoon as the child, his grandmother and his mother’s boyfriend stood outside a home on Queens Avenue.\nThe detention followed a high-speed pursuit that began when two people in a car drove off from a traffic stop in the area of West Third Street and Gettysburg Avenue.\nWe have reporters on scene, in the area of Oakridge Drive and Anna Street, where the arrest occurred and police and a Montgomery County sheriff’s K-9 squad searched homes and structures in the neighborhood.\nPolice have been searching for suspects since the shooting Thursday afternoon that left Elijah Johnson dead, 63-year-old Diana Hicks and 25-year-old Isaiah Smith wounded.\nPolice said they believe Smith was the primary target in what they describe as a drive-by shooting that occurred first on Queens Avenue and seconds later on Arlene Avenue. Investigators have been able to establish that Hicks drove everyone to Good Samaritan Hospital, then drove to a home on Harvard Boulevard. She was taken from there to Miami Valley Hospital.\nInvestigators have said the car Hicks used to take everyone to the hospital contained marijuana and a large amount of cash, evidence they said indicates illegal drug activity."}