{"uri": "http://www.whio.com/news/news/crime-law/dayton-police-on-scene-of-reported-shooting/np5QD/", "title": "Police: Drugs in vehicle that transported shooting victims", "dct": "Thu, 14 Jan 2016 00:00:00 GMT", "id": "84cd2156b32e1c0dba630051356aec6a", "content": "A 1-year-old boy was killed and two others were injured following a shooting Thursday evening in Dayton.\nVictim killed is Elijah J. Johnson, 13 months\nVictims were standing outside on Queens Avenue when shot\nShots came from black car\nUPDATE @ 1:37 p.m. (Jan. 15)\nDayton police released additional information about a triple shooting that killed a 1-year-old boy.\nBefore officers arrived to the 1900 block of Arlene Avenue for a shooting, the three shooting victims were driven to Good Samaritan Hospital by one of the victims, Diana Hicks, 63, according to police.\nBut then Hicks left the hospital and drove to a home on Harvard Boulevard, where she was then removed to Miami Valley Hospital by a Dayton fire.\nDayton police say the vehicle Hicks used to transport the victims was recovered at the Harvard Boulevard location, and reportedly contained evidence of illegal drug activity, including marijuana and a large amount of cash.\nWitnesses told police they saw the 25-year-old man, Isaiah Smith, on Arlene Avenue with the 1-year-old Elijah J. Johnson in his arms, when the shooting happened. Police say they believe Smith was the primary target.\nHicks has been identified as a city of Dayton employee.\nTwo homes were damaged by gunfire.\nUPDATE @ 10:45 a.m. (Jan. 15):\nAccording to a Dayton police report a 63-year-old woman and 25-year-old man were both injured in the shooting also.\nDiana Hicks, 63, and Isaiah Smith, 25, were both listed as victims in the report.\nBoth Smith and Hicks suffered non-life threatening injuries, according to Lt. Shannon Mason. They were both treated and released from Miami Valley Hospital, according to a hospital spokeswoman.\nUPDATE @2:30 a.m. (Jan. 15): A 1-year-old boy who was shot in Dayton Thursday evening has died.\nThe victim is 13-month-old Elijah J. Johnson, according to the Montgomery County Coroner’s Office.\nAn autopsy will be conducted Friday morning.\nThe conditions of the toddler’s grandmother and mother’s boyfriend, who were also shot, is unknown at this time.\nA 5-year-old was shot and killed just two months ago.\nUPDATE @ 7:20 p.m. (Jan. 14): The injuries to the 1-year-old boy who was shot along with his grandmother and his mother’s boyfriend “may be more serious” than the injuries to the woman and man, although there is no concrete information on the boy’s condition, Dayton Lt. Shannon Mason said.\nPolice have no suspect information and are right now operating on a report from the male, 25, that the shots came from a black car. The male, Mason said, has not been forthcoming with police.\n“We need people to realize that guns kill. This is ridiculous,” the lieutenant said. “Children are innocent. They shouldn’t suffer the consequences of people firing off guns.”\nMason said that according to the preliminary investigation, the three victims were wounded by gunfire in front of a house in the 4700 block of Queens Avenue. The victims then went to a house in the 1900 block of Arlene Avenue, where the car returned and more shots were fired.\nThe grandmother was struck in the shoulder in the initial hail of bullets. The child and the male were hit on Arlene Avenue, Mason said. She was taken to Miami Valley Hospital. The child was taken to Dayton Children’s Hospital.\nThe grandmother, whose age was not available, drove her grandchild and the male to Good Samaritan Hospital and then left, Mason said.\nHe said police, who got a call from the hospital about 4:30 p.m. reporting that two gunshot victims had been brought there, believe the woman was found in her car on Harvard Boulevard and Kensington Drive. There, police found a car that had a bullet hole in it.\nWhy the three were targeted is anyone’s guess, Mason said. “All the police know is that shots came from a black vehicle. We have no idea how many people are involved.”\nNathaniel Cole, 80, who said he has lived in the neighborhood since 1999, interrupted Mason’s impromptu news conference with reporters to ask that the Dayton Police Department patrol the neighborhood more frequently because of drug-dealing in the area.\n“It is bad,” he said. “I know you all can’t be at this spot at all times. They pass by here and exchange drugs out of their cars continuously. Please, stop these people.”\nCole said he is fearful about leaving his house and only came out today because he saw all the police and media.\n“I refuse to come out of the house at night because this area is a drug-infested area,” he said. “I don’t know what the solution is for this problem.”\nUPDATE @ 5:50 p.m.:\nA child and two adults have been shot, Dayton police have confirmed.\nThe male has been taken to Good Samaritan Hospital. The woman has been taken to Miami Valley Hospital and the child has been taken to Dayton Children’s Hospital.\nTheir conditions and ages are not known, police tell us.\nPolice tell us the incident began outside a home in the 1900 block of Arlene Avenue. The three victims were standing out near their car when someone from a vehicle fired weapons at the victims and at houses along Queens Avenue, which is about a block east of the address on Arlene.\nUPDATE @ 5:25 p.m.:\nA Dayton police sergeant said he has been given to understand that two or three victims have been taken to hospitals.\nHe said police are trying to piece together what happened, but he believes the scenes at Harvard Boulevard and Philadelphia Drive, as well as the scene at Harvard and Kensington Drive are connected.\nWe’re on the way to a possible third scene, in the 1900 block of Arlene Avenue.\nFIRST REPORT\nPolice and a medic unit have been dispatched on a report of a shooting in the 3300 block of Harvard Boulevard that may have involved a child.\nThe dispatch was made about 4:38 p.m. We’re hearing that officers have established a scene and are putting up crime scene tape.\nPolice have closed the intersection of Harvard Boulevard and Philadelphia Drive. One Dayton medic unit has left the scene and another has arrived on scene."}