{"uri": "http://www.startribune.com/mom-of-wounded-10-year-old-describes-life-in-the-battle-zone/382179041/#1", "title": "Mom of wounded Minneapolis 10-year-old describes life in the battle zone", "dct": "Wed, 08 Jun 2016 00:00:00 GMT", "id": "31bb0ae9d429816403d1d3f729ae1f44", "content": "Out back, behind a row of aging townhouses on Plymouth Avenue N., there’s a circular patch of dirt and weeds.\nThat’s where the men and boys come day after day to shoot dice, shoot off their mouths, do drugs and deal drugs. Too often, there are guns involved.\nThe Minneapolis Police Department calculates that there have been 131 people wounded or killed by gunshots in the city so far this year. Eighty percent of those — 105 victims — were shot in the Fourth Precinct on the North Side. The next largest percentage was in the Third Precinct in south Minneapolis, with 9 percent.\nTen-year-old Jon’tayasia Dillon-White, who lives with her mom and four brothers on Plymouth, between James and Knox avenues N., was one of the North Side victims.\nIt was 10:20 p.m. on May 5, a Thursday night. She and her 11-year-old brother were in bed watching TV when a stray bullet came through the second-floor bedroom wall, pierced her right foot from sole to instep, and disappeared into the back wall of her closet.\nHer mom, Tequila Dillon, who works long hours at a restaurant in Eden Prairie, had been home about 20 minutes and was running the water in the bathroom next door, getting ready to take a shower.\nShe didn’t hear the gunshots. But she heard her youngest scream.\n“She been shot, y’all, she been shot!” Tequila Dillon recalled Tuesday.\nDillon, 31, sat on the front stoop of her home, describing what it’s like to live in the violence-plagued area. Her five kids popped their heads in and out of the front door.\n“Can I wash your car?” the 11-year-old asked.\n“No, leave it alone. Go in the house,” Dillon told him.\nJon’tayasia brought her a small plastic container planted with weeds and flowers.\n“For your birthday,” the girl said.\n“Oh, how pretty,” Dillon replied.\nTheir home is just a few yards from where Jamar Clark was killed by police officers during a confrontation last November, prompting weeks of protest in the area.\nDillon and the kids hear gunshots at least three times a week. Jon’tayasia was one of three people shot that night on the North Side, according to news reports.\n“It’s a never-ending battle over here,” she said. “Drugs, drug dealing, gambling, disrespectful men that don’t want to get off my block. You gotta worry about bullets being fired. You never know when it’s going to happen; it just happens.\n“They don’t live over here. Why bring your drama over here? Take the drama somewhere else. We’re tired of it,” she said.\nDillon worries about keeping her sons — particularly her 14-year-old twins — off the streets.\n“To be honest, it’s hard, it’s a hard battle,” said Dillon, who speaks with the passion of a community organizer. “They don’t really try to be part of that lifestyle, ’cause they know mama ain’t havin’ it. Just because we live here don’t mean they’re going to be a product of their environment.”\nDillon wants out, though. She’s tired of tackling the problem all on her own, she said.\n“No matter how much you try to fight it, try to tell them to take it somewhere else, it’s never going to take just one person to stand up,” she said. “It’s going to take a whole block to stand up and say we’re tired of this … we want our block back, we want our kids to be able to play.\n“I’m tired of doing it myself,” she said. “I get reckless. I sit out there with a bat. Get the [expletive] off my block. I’m not playing no more.”\nAlthough there were numerous people around the night Jon’tayasia was shot, nobody has stepped forward to help police.\n“This area is really rocked with violence that needs to stop,” said police spokesman John Elder. “We need to get this solved. Her daughter needs to feel safe.”\nPolice said they’ve sent extra patrols in to high-crime areas like Dillon’s neighborhood. For the week of May 3-9, in the Fourth Precinct, foot patrols were up 108 percent over last year, and hot-spot patrols were up 84 percent. Still, that week, ShotSpotter was activated in the precinct 118 times, with 10 reports of shots fired.\nCrimeStoppers is offering a reward (of an amount to be determined later) for information leading to an arrest and conviction in Jon’tayasia’s shooting. Tips can be called in to 1-800-222-8477 or texted to 274637. The incident number is 16-160009.\nA month after the shooting, Jon’tayasia is up and running around. But her foot isn’t healing as well as doctors would like, and she may need surgery. Dillon and her family rarely venture upstairs anymore except to shower. All six sleep in the first-floor living room, hoping the brick facing on the townhouse might protect them from any more bullets.\nAnd she tells her kids about karma.\n“If you do something out on the streets, it’s going to come back on you,” she said. “Everything you do, there’s a cause and there’s an effect. My older boys, they’re mad, they’re thinking that whoever did this, they want to get him back. But like I told them, at the end of the day, you don’t have to do nothing, because the same way somebody did something to her is the same way somebody is going to do something to them.”\nTuesday was a rare day off for Dillon, and the large extended family was at her house, preparing a barbecue to celebrate her twins’ graduation from middle school.\nDillon said people at her workplace helped her set up a GoFundMe page, hoping to make enough money so she can move her family out of the neighborhood. To donate, go to gofundme.com/233f5ks."}