{"uri": "http://www.local10.com/sports/brother-of-fsu-baseball-player-dies-after-pellet-gun-shooting-in-key-west/32467938", "title": "Brother of FSU baseball player dies after pellet gun shooting in Key West", "dct": "Mon, 20 Apr 2015 15:00:00 GMT", "id": "58e8afa912114cd929004432ad11ead8", "content": "Bert J. Budde Sr.\nPEMBROKE PARK, Fla. - The younger brother of a Florida State University baseball player has died after being shot in the chest with a pellet gun.\nJonathan Wells, 14, died five days after the April 10 incident at a Key West apartment.\nAccording to a Key West police report, officers were called to the apartment in reference to an injured person. When officers arrived, they found that Wells \"was not breathing and had vomited.\"\n\"The juvenile was (lying) on his back and had vomit next to his head,\" Officer Kathryn Hansell wrote in her report. \"I saw a paper towel with blood on it (lying) next to the juvenile on the floor.\"\nThree other children and an adult were in the apartment at the time of the incident, Hansell wrote.\nThe boy's father told police that his son \"had been playing with the pellet gun when it went off.\" He said the incident happened in the bedroom while he and his younger son were in the living room.\nWells was taken to Lower Keys Medical Center before being airlifted to a Miami hospital. A search of the Miami-Dade County medical examiner database shows that Wells died at 4:40 p.m. Wednesday.\nThere is no mention in the heavily redacted report of who was holding the pellet gun when it fired.\nThe pellet gun was collected and placed into evidence, Hansell wrote.\nWells was the younger brother of FSU freshman outfielder Steven Wells Jr. He has started two games for the Seminoles this season, batting .188 with 5 RBIs in 16 appearances.\nThe team is expected to fly to Key West to attend the funeral Wednesday.\nKey West police spokeswoman Alyson Crean said the investigation is ongoing.\nFollow Local 10 News on Twitter @WPLGLocal10\nCopyright 2015 by Local10.com. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}