{"uri": "http://www.palmbeachpost.com/news/crime--law/just-two-arrests-made-pahokee-shooting-that-injured-three/GJMSyBvFZUOs6vTxn3VKYL/", "title": "JUST IN: Two arrests made in Pahokee shooting that injured three", "dct": "Fri, 20 Jan 2017 00:00:00 GMT", "id": "c4f7acbaaeb923e1266e83a5ced42b83", "content": "PAHOKEE\nTwo people are facing charges in the Jan. 8 drive-by shooting that injured three people, Palm Beach County sheriff’s records show.\nIvy Love, 24, and a 17-year-old are accused of firing bullets into cars, a building and two people at about 5:30 p.m. Jan. 8, records show. Love, a Pahokee resident, was arrested Jan. 10 on charges of aggravated battery with a firearm, firing a weapon from a vehicle and possession of a weapon as a convicted felon. He is being held without bond in the Palm Beach County Jail until his next court appearance.\nThe teenager was arrested as well, the sheriff’s office said. He faces similar charges to Love’s. The Post is not naming the teen because he is a minor.\nVideo shows a yellow Ford F250 stop near the intersection of Rardin Avenue and Adams Place, which the sheriff’s office said in its report is a known gang area. Footage shows shots being fired at an older model truck, then at a Jeep, where a 71-year-old man was sitting.\nA woman was seen running behind the Jeep to shield a small child during the gunfire.\nTwo men, 23 and 17, were hit in the ankles by bullets, the sheriff’s office said. The 71-year-old man was cut by shattered glass. All three men were taken to Lakeside Medical Center in Belle Glade with non-life threatening injuries.\nOne of the men who was shot told police he saw three men in the truck, which police learned was reported stolen out of Royal Palm Beach. He identified the shooters by name and in a photographic line up, records show, but said he did not know the driver.\nThe man said Love and the teenager had been sending him threats for about a month over a situation involving a woman.\nOfficials found multiple .233 and .45 caliber casings in the roadway, records show."}