{"uri": "http://www.pe.com/articles/perris-792749-sheriff-business.html", "title": "PERRIS: 1 killed, 4 others injured in shooting at restaurant (UPDATE 3)", "dct": "Sat, 10 Sep 2016 11:10:00 GMT", "id": "cfce12850a0ec29a164a0bef544fb685", "content": "UPDATE (Saturday, Sept. 10): Fugitive arrested in Perris restaurant shooting that killed 1, injured 4\nOne person was killed and four others were injured, two seriously, in a shooting at a Perris restaurant early Monday, Jan. 25, authorities said.\nNo arrests have been made. Riverside County sheriff's officials remained tight-lipped Tuesday about both the circumstances of the shooting and the status of their investigation.\n“We are very actively following up on current suspect leads,” sheriff's Sgt. Mike Manning said, citing homicide Capt. Joe Borja.\nSheriff's deputies were called to the Nayarit Mexican restaurant at 140 S. D St. in Perris about 1 a.m. Monday and found five males who had been shot.\nOne man, whose name has not been released, was pronounced dead at the scene. Two others with serious injuries and two with minor injures were taken to area hospitals, Deputy Mike Vasquez said.\nFlowers and a prayer candle were left on the sidewalk in front of the restaurant.\nLeo Salazar, an employee at Magnuson Tires at 200 S. D St., said he wasn’t allowed to enter the tire store Monday morning because sheriff’s deputies said they were conducting an investigation that required the street to be closed.\nA block and a half south, where D Street approaches 4th Street, Alma Rodriguez, an employee at Monica’s Beauty Salon, said she was surprised to find out what happened at the restaurant.\n“We didn’t even know there was a shooting,” she said, adding that crime is relatively rare in that area.\nRodriguez said she arrived to the shop in the morning and saw that D Street had been taped off to 3rd Street.\nVidal Mijea, owner of clothing store Zapateria Jerez, said he thought the caution tape was up for a crime involving alcohol or drugs, but not a shooting.\nMijea said he was surprised to see all the caution tape up the street.\n“When we came in in the morning, it was closed -- everything.”\nThe Sheriff's Department did not release details about the shooting until almost 36 hours after it happened. Manning said there was no indication that any other member of the public was at risk, and detectives were concerned about jeopardizing the investigation if information were released.\nAnyone with information on the shooting may contact homicide investigators at 951-955-2777 or deputies at the Perris sheriff's station at 951-210-1000."}