{"uri": "http://www.news4jax.com/news/local/jacksonville/jso-investigates-reports-of-shots-fired-at-art-walk", "title": "Sheriff: 2 teens shot at Art Walk not cooperating", "dct": "Wed, 04 Jan 2017 21:55:00 GMT", "id": "6cc831b7788afdfcf9715e1603029c6c", "content": "JACKSONVILLE, Fla. - A double shooting during the first Art Walk of the year in downtown Jacksonville on Wednesday was not a random act of violence, Sheriff Mike Williams said Thursday.\nTwo teens were shot in an alley on North Laura Street, a few blocks from Hemming Park where the monthly Art Walk event was underway, police said.\nWilliams said the teens and the shooters possibly knew each other and that the victims are not affiliated with any known street gangs.\nUNCUT: Sheriff's news conference on Art Walk shooting\n\"Something got those parties in that alleyway together,\" Williams said, indicating it was possibly some type of criminal activity, such as a drug deal. \"We won't stop until those responsible for these acts of violence are arrested.\"\nWilliams said the two teen victims are not cooperating with police.\n2 teens injured\nOne of the two teens injured in the shooting is a football player for Raines High School, News4Jax has learned.\nBenwah Wilson, 16, was shot in the foot. He plays football for the Vikings, according to a team website. The other victim, 17-year-old Gregory Richardson, was shot in the leg, police said.\nPolice responded about 9:30 p.m. Wednesday to reports of shots fired in the area of Bay and Laura streets, near the Bank of America Tower.\nAn off-duty officer who was downtown at the time found Wilson in the area where the shooting happened and another off-duty officer found Richardson at the Jacksonville Landing, where he ran afterward, police said.\nWitnesses said Richardson ran to Fionn MacCools.\nBoth teens were taken to UF Health Hospital with serious but non-life-threatening injuries, police said.\nVIDEO: Manager describes scene at restaurant\nPaul Glaser, the general manager of Fionn MacCools, said his staff immediately called for help when Richardson stumbled through the front doors looking for help and tried to calm him down. He said they did an amazing job taking care of the situation in a professional manner.\n“I don't think you ever plan for, 'Oh, some guy's going to run into your restaurant with a bullet in his foot.' You know?” Glaser said. “I’m very proud of my employees, the way they handled it. They took care of the gentleman ... and called the proper authorities and got everyone here and got him taken care of. It's what I expect my employees to do, and I'm just proud that they did it.”\nJSO Sgt. C. Jones said it is unclear exactly how many shots were fired. Williams said that multiple guns were fired, based on shell casings found at the scene.\n\"There was -- it's just a guesstimate -- hundreds, if not a thousand or more, people down here at the time of the shooting. And certainly it could've been much much worse,\" Jones said.\nA football teammate of Wilson's said the teen is a great player and person.\n“I just found out today that he got shot, and I was like, 'Dang, he got shot?' And they told me how it happened, how he had to walk and go get help, and I was like, 'Dang, that ain't right,'” Nigel Allen said. “He is a great guy. He's fun to be around. He'll get you laughing for no reason.”\nAllen described his friend as very determined and said he is not a violent person.\n“Whatever he wants to do, he's going to do it,” Allen said. “If he's going to be a great football player, he'll be a great football player.”\nAllen also shared a message for his friend: \"Ben, I just hope you get better. That's it. You are strong. You're not going to let this stop you. You're going to keep moving forward.\"\nThe only suspect description was of a black male dressed in all black with dreadlocks, according to the police report.\nWilliams said Wilson had an empty holster on him, and another empty holster was found in a car stopped in connection with the investigation. News4Jax crime and safety analyst Gil Smith said the findings raise major red flags.\n\"It’s pretty reasonable to assume that, at one point, he did have a firearm. What happened to the firearm at this point? We don’t know. The fact that the victims are not cooperating tells me that they did know the gunman some way,\" Smith said. “It’s very fortunate that more people were not shot, which also tells me that maybe they were shot at very close range. At a further distance, other people may have been hit.”\nSmith said most juveniles who are armed with guns obtain the weapons illegally.\n“People are stealing guns and selling them back on the streets to juveniles. Juveniles know they are too young to purchase them legally,\" Smith said.\nDetectives are working to obtain surveillance video and will continue to investigate.\nAnyone with information is asked to call the Sheriff's Office at 904-630-0500. To remain anonymous, contact Crime Stoppers at 1-866-845-TIPS.\nSurveillance videos capture scramble\nSeveral witnesses told News4Jax that as soon as the gunshots rang out, people started running. The aftermath was captured on surveillance cameras at several downtown businesses.\n\"I heard a bunch of noise and I literally heard a sea of people running toward me because I had my jewelry all set up,\" said vendor Savannah Rivera. \"I didn't know what to do.\"\nNay-Lin Pelzer, who was also at the event, described the chaotic scene as being \"like something out of a Godzilla movie.\"\nWATCH: Reaction inside Jimmy John's after shots fired at Art Walk\nSurveillance video from inside a nearby Jimmy John's restaurant, on the corner of Laura and Adams streets, shows customers and employees ducking and scrambling after the shots rang out.\nA herd of people outside the restaurant can also be seen scrambling to get inside for safety. At least one man appears to lock the door after everyone gets inside.\nToward the end of the video, one of the employees motions to everyone to stay down and then gets up to check on the situation outside.\nVIDEO: Library surveillance shows crowds moments after shooting\nSurveillance video from the downtown library also captured crowds of people attending the Art Walk event running to take cover after shots are fired.\nDowntown business owners worried shooting may scare away customers\nThe shooting happened during the first Art Walk of the year in downtown Jacksonville, and business owners are now worried that the incident will not only scare away customers from attending the event held on the first Wednesday of every month, but from coming to the urban core altogether.\nJeries Ewais, the owner of Zodiac Bar and Grill, is one of many owners who benefits from Art Walk's big crowds to bring customers through the door.\n“It’s going to hurt the business and downtown, so it’s terrible,\" Ewais said.\nBut now that the event has been marred by a shooting, Ewais said he is concerned that fewer people will want to venture downtown at night.\n“Sadly, an incident is going to put things on hold. I’m sure the next Art Walk is going to be quieter because people are going to be scared,\" he said. \"But, hopefully, in a couple of months, people forget about it and we can go back to the old Art Walk -- active and busy.”\nGlaser also said he hopes the incident doesn't affect attendance at Art Walk, because it's a great event.\nA manager at Peterbrooke, which is on the same block as the shooting, said that overall she feels safe, but she believes more cameras should be added.\n\"Maybe right in this area. So if we have problem in the future, we can stop it, and get it on camera,\" Susan Wolfe said. \"Maybe they'll think twice. 'Hey, I'm on camera, maybe I shouldn't do this.'\"\nGiven the amount of attention surrounding the unusual downtown shooting, there will likely be a much heavier presence of law enforcement at next month’s Art Walk. Williams also said he plans to increase patrols in the area to make sure people are safe.\n\"We do a good job of planning and preparing, putting enough policemen in the right place at the right time to keep things and prevent things like this from happening,\" Williams said. \"And when they do happen, we analyze that to make sure if we can improve upon it, we will.\"\nDespite the events that unfolded Wednesday night, several people who frequent downtown businesses at night said they believe the area is still the safest part of the city.\nCity officials respond\nThe shooting was the first act of gun violence in the 13-year history of the Art Walk, and city leaders said they are working to make sure nothing like it happens again.\nThere were 18 off-duty officers working at the event Wednesday night, and Downtown Vision, the nonprofit group that puts on the event, said there will be even more at the next Art Walk in February.\nVIDEOS: Security concerns raised following shooting | Community members call for change\n“This has been a very unfortunate incident,” said Jake Gordon with Downtown Vision. “It's very unusual from my understanding from the board of directors. I don't want to let that spoil what has been a fantastic event for 13 years.”\nCity Council President Lori Boyer said she believes downtown is safe and encourages people not to turn away from events because of the shooting.\n\"I was kind of shocked because we never had anything like that occur on an Art Walk night, or to my knowledge on the Jazz Festival night. Or anything like that when we've had an event downtown, so first it was shock,\" Boyer said. \"It was disappointment, and then a concern about what we are going to do to make sure this doesn't happen in the future (so) that people feel safe coming downtown for events.\"\nDowntown Vision released a statement about the shooting:\nWe at Downtown Vision are deeply troubled by the shooting that occurred after last night's Art Walk. We thank Jacksonville Sheriff’s Office for its immediate and expert response to this unfortunate incident. Every month, we work closely with JSO on Art Walk, and they implement a number of detailed measures to keep everyone safe at the event.\nWe believe that for the past 13 years since its inception, Art Walk has become a well-loved tradition. It is important to our Downtown and to our community, representing the very best of Jacksonville. Every month, Art Walk continues to bring us together in a positive and meaningful way, while supporting our Downtown and its businesses.\nWe will continue to work closely with JSO to ensure the ongoing safety of everyone at Art Walk, and look forward to continuing this great Downtown event supporting creativity, diversity and peaceful expression as we work to create and support a more vibrant Downtown Jacksonville.\nMayor Lenny Curry's office also released a statement about the incident:\nThe mayor is strongly committed to public safety and will continue to engage with Sheriff (Mike) Williams on his team’s efforts to protect citizens and property throughout the entire city. Mayor Curry immediately contacted JSO and staff about the incident.\nCopyright 2017 by WJXT News4Jax - All rights reserved."}