{"uri": "http://www.khou.com/news/crime/3-teens-injured-in-shooting-at-mlk-block-party-in-se-houston/386587967", "title": "3 teens injured in SE Houston shooting, suspect search underway", "dct": "Tue, 17 Jan 2017 00:00:00 GMT", "id": "e4ec2ccd7e33dc9e71031ab454feac2a", "content": "HOUSTON -- A southeast Houston community is heartbroken and appalled after the spray of gunfire that wounded three teens out celebrating a legendary civil rights leader.\nThe gunfire was among a series of shootings that broke out at MLK Day celebrations across the country.\nPeople in Houston’s South Park community say what happened here is just one example of what is turning their neighborhood into a “war zone.”\nHouston police say they have had extra eyes on this community and particularly the intersection of Martin Luther King Boulevard and Reed Road following a gang-related shooting just a few weeks ago.\nNeighbors say they have seen the patrols, but they wonder if police are only scratching the surface of festering a problem that’s putting everyone at risk.\nSurveillance footage shows a crowd scattering an annual Martin Luther King Junior block party on MLK Boulevard, cut short by a hail of gunfire that wounded a 13-year-old and two 17-year-olds believed to be innocent bystanders.\n“My heart was hurting. Mainly this was representing our ancestors that fought so hard for us,” said Mandy Jones, owner of Nicey’s Restaurant & The Rock Christian Center & Book Store.\nJones’ businesses are both at the intersection where the bullets rang out. Inside what appears to be a bookstore is also a church.\nJones’ husband works as a pastor here and tries to reach out to youth in this community talking about the trouble he got into during his teen years.\n“Nowadays, our children fear nothing,” Jones said. “They have no respect, they have no fear. They don’t even fear the law.”\nAnother example of that, she believes, is the gang-related shooting at this very same intersection just two days into the new year.\nNew HPD chief Art Acevedo made his presence visible to this South Park community during that investigation.\n“We want the community… this particular community to know that you are important to HPD, and we’re going to be with you guys,” said Troy Fenner, South Patrol Asst. Chief with HPD.\nAfter the shooting, on the day set to honor the civil rights leader who preached that “returning violence for violence multiplies violence,” neighbors believe the message isn’t getting through to the younger generation, and they’re hoping authorities can help.\n“I ask all the city officials to come out. Come and observe what’s going on in the community. You have to mix and mingle with the people,” Jones said. “Then and only then you will understand what’s going on in the community.”\nPolice still have not released a motive or any suspect information in Monday night’s gunfire. Anyone with information regarding the shooting is asked to call 713-521-4600.\nAmong the shootings at MLK celebrations across the country, in Miami, eight people were wounded and in Chicago, 39 people were shot across the city over the holiday weekend, leaving at least 10 dead.\n(© 2017 KHOU)"}