{"uri": "http://www.nola.com/crime/index.ssf/2016/06/bunny_friend_park_mass_shootin_2.html#incart_river_index", "title": "Bunny Friend Park mass shooting ignited by argument, NOPD detective testifies", "dct": "Mon, 27 Jun 2016 19:01:00 GMT", "id": "0d3341b4a5f99b884463c2c86dcad25e", "content": "The mass shooting that left 17 people wounded last November at Bunny Friend Park in the Upper 9th Ward was touched off by a \"verbal altercation\" between members of rival groups, the lead investigator on the case testified Monday (June 27).\nNew Orleans police detective Chad Cockerham said an argument between Wilfred Celestine and several other men, including wheelchair-bound Rashad Walker, erupted into a gunfight that left members of the rival factions and several bystanders injured.\nCelestine was part of a group known as the Park Boyz, Cockerham said, while Walker represents the Killa Mafia Gang, explaining his nickname \"KMG Ezzy.\" Cockerham said other groups also were represented among the 10 suspects indicted following the shameful Sunday night conflict that sent bullets flying across a crowded public park around 6:15 p.m. on Nov. 22.\nMonday's hearing on motions in the case gave those 10 defendants - through their 10 different lawyers - their first opportunity to question Cockerham since the NOPD 5th District detective had them arrested last fall. But after nearly three hours of testimony, Criminal District Judge Robin Pittman denied the defendants' motions to suppress identifications and statements made to police.\nThough most of the suspects had been arrested and jailed on accusations of attempted murder, the indictment charges no one with that offense.\nIt is the disabled Walker, 22, who has the highest bond ($3.5 million) and faces the most charges in the case - six counts of discharging a firearm during a violent crime and one of possession of a firearm by a felon. Represented by private attorney Jay Daniels, Walker is expected to claim self-defense at the trial Pittman scheduled for Sept. 19.\n\"Mr. Walker stated that it was a life-or-death situation for him,\" Cockerham testified. \"Walker said he discharged his weapon to get people off him.\"\nMonday's testimony revealed how little evidence and cooperation police have turned up in the seven months since the shootout generated international headlines.\nEven though police estimated a crowd of around 300 filled the park at the time of the shooting, Cockerham did not say any video or photo evidence of the incident has turned up. The detective also testified that most identifications of the alleged gunmen have been generated by just three eyewitnesses, including one who wanted to trade information to police after being detained in a traffic stop and another who is an admitted heroin addict who said he frequently purchased drugs from one of the suspects.\nCockerham said investigators received some Crimestoppers tips in the case. But it appears detectives' biggest break came when one of the arrested men - Lawrence Veals - revealed to his brother Dante in a recorded jailhouse phone call the names of four gunmen he said were involved in the incident.\n\"Veals' crew was KMG,\" Cockerham testified. \"He said his group was in a verbal altercation with Mr. Celestine, and that Mr. Walker fired the weapon that was in (Walker's) possession. ... Veals also identifies Walker as one of his best friends.\"\nVeals' attorney, public defender Joyce Sallah, questioned whether her client's statements to police should be admissible. She suggested her client either was in pain from a gunshot wound near his hip or addled on pain medication when he shifted posture during a recorded police statement. But under questioning by prosecutor Bonycle Thornton, Cockerham said Veals only slumped over after detectives played for him his recorded jailhouse phone call naming other shooting suspects.\nThat same recording, Cockerham said, finally prompted a reticent Walker to also give police a statement.\nOne of the suspected shooters in the Bunny Friend Park gunfire exchange was seen pulling out his gun and walking into the middle of a verbal altercation seconds before shots were fired, a witness told police.\nThree of the defendants - Michael Allen, Allen Offray and Dominic Savoy - have successfully argued to have their bond amounts reduced. Offray, who Cockerham said has been linked by a witness to the \"Dusty Money\" group, and Allen already are free awaiting trial, having posted bonds of $100,000 and $170,000, respectively. Pittman said she will rule Tuesday on a bond-reduction request by Eddie Copelin, the only defendant thus far who has asked the judge to sever his case from his co-defendants.\nNearly all the defendants initially were charged with 17 counts of attempted second-degree murder, but those charges wilted for lack of evidence before an Orleans Parish grand jury handed up a 15-count indictment on Jan. 27. Most in the group now face lesser gun charges:\nMichael Allen: One count of discharging a firearm during a violent crime, one count of possession of a firearm by a felon, out on $170,000 bond (reduced from $1 million)\nQuendrick Bailey: One count of discharging a firearm during a violent crime, bond is $500,000\nWilfred Celestine: One count of discharging a firearm during a violent crime, bond is $500,000\nEddie Copelin: One count of discharging a firearm during a violent crime, bond is $500,000\nMalik Johnson: One count of discharging a firearm during a violent crime, three counts of obstruction of justice, one count of resisting an officer, one count of criminally negligent discharge of a firearm, two counts of illegal possession of stolen firearms, bond is $2.05 million\nAllen Offray: One count of discharging a firearm during a violent crime, out on $100,000 bond (reduced from $500,000)\nShawn Ruffin: One count of discharging a firearm during a violent crime, bond is $500,00\nDominic Savoy: One count of criminally negligent discharge of a firearm, two counts of illegal possession of stolen firearms, bond is $200,000 (reduced from $750,000)\nLawrence Veals: Two counts of discharging a firearm during a violent crime, one count of criminally negligent discharge of a firearm, bond is $1.25 million\nRashad Walker: Six counts of discharging a firearm during a violent crime, one count of possession of a firearm by a felon, bond is $3.5 million\nPittman also refused Monday to toss out the weapon possession charge against Allen. His attorney, John Fuller, argued that a gun found under a sofa cushion at his client's house resulted from an illegal search by U.S. Marshals and Jefferson Parish deputies. They were tasked by an arrest warrant to locate Allen, Fuller said, but only after finding the gun under the cushion did they then secure a search warrant authorizing the seizure of items from the residence when Allen wasn't home.\n\"They found the gun as the fruit of a poisonous search,\" Fuller told the judge. \"I've not seen a sofa yet high enough for a person the size of my client to hide under.\nBut Cockerham testified that fugitives have been known to hide from authorities inside the hollowed-out shell of a sofa bed, so flipping the cushions or lifting the couch was justified, even though the initial warrant was to arrest Allen, not search his home for evidence items.\n\"The law is clear that officers are allowed to search anywhere a body could be,\" Thornton said. \"That includes closets, kitchen cabinets or furniture - anyplace he could possibly be.\" Pittman agreed the search appeared proper and the found gun would be admitted into the trial."}