{"uri": "http://www.nola.com/crime/index.ssf/2016/10/plea_deals_offered_in_bunny_fr.html#incart_river_index", "title": "5 take plea deals in Bunny Friend Park shooting case, 3 get at least 10 years in prison", "dct": "Fri, 14 Oct 2016 19:39:37 GMT", "id": "182440a23f2c3fe1cfb1e968f06fe8c9", "content": "Five of the 10 men suspected of firing or possessing weapons used during the mass shooting that wounded 17 people last November at Bunny Friend Park pleaded guilty Friday (Oct. 14), with three accepting prison terms of at least 10 years.\nLawrence Veals, Rashad Walker and Malik Johnson received the stiffest penalties for their roles in the wild shootout at a crowded Upper 9th Ward park that drew worldwide attention on Nov. 22, 2015. Veals was sentenced to 11 years in prison, and Walker and Johnson received 10 years.\nPlea offers were extended to eight of the 10 defendants, a development some viewed as indicative of the weakness of the state's case and the failure of New Orleans police investigators to compile solid evidence about who was behind the gun battle.\nThree of the defendants rejected plea offers that assistant district attorney Bonycle Thornton said were being tendered for one day only. Criminal District Judge Robin Pittman reiterated that she would not entertain later plea negotiations in the case, which she set for trial Jan. 17.\nOnly Michael \"Mack\" Allen and Wilfred \"Lil Wilfred\" Celestine were not offered the chance to plead guilty to a lesser crime or to avoid an enhanced sentence under a multiple bill. Plea offers were extended to Quendrick 'C-4' Bailey, Eddie 'Eazy' Copelin, Malik 'Leaky' Johnson, Allen 'Snoop' Offray, Shawn 'Shooter' Ruffin, Dominic Savoy, Lawrence 'L' Veals and Rashad 'KMG Ezzy' Walker.\nSeven of the eight, originally booked by police with attempted first-degree murder, were instead indicted Jan. 28 on charges of discharging a firearm during commission of a violent crime, an offense punishable by 10 to 20 years upon conviction.\nThough most of the suspects had been arrested and jailed on accusations of attempted murder, the indictment charges no one with that offense.\nIn the plea deals, District Attorney Leon Cannizzaro's office offered to amend that charge for most of the defendants to illegal use of weapons, a lesser felony punishable by a maximum two-year prison term. Bailey, Offray and Ruffin rejected the offers, preferring to go to trial.\nVeals, whom Thornton said was caught admitting his guilt on a recorded jailhouse call, pleaded guilty to discharging a firearm during a violent crime and criminally negligent discharge of a firearm. The state agreed not to file a multiple bill against Veals, 19, who had a prior felony theft conviction. He agreed to a deal in which he must serve 11 years without the benefit of parole, probation or suspended sentence.\nWalker, 22, is a wheelchair-bound defendant who Thornton said was identified by several witnesses as being present and firing a gun at several people amid the Bunny Friend Park chaos. Thornton said Walker had at least three prior felony convictions, and faced six counts of discharging a firearm during a violent crime.\nThe state agreed to dismiss five of those counts, and refrain from a multiple bill, in exchange for Walker pleading guilty to one count of discharging a firearm during a violent crime, one count of illegal possession of a firearm by a felon, and one count of criminal damage for breaking a window inside the Orleans Justice Center with his wheelchair.\nWalker was sentenced to 10 years on each count related to the shooting, to be served concurrently without the possibility of parole or probation. A nine-month sentence for the jail damage will be credited with time already served.\nJohnson, 18, faced eight charges related to the shooting, including obstruction of justice, illegal possession of stolen firearms, negligent discharge and resisting an officer. He accepted a deal that saw all charges dropped except one count of discharging a firearm during a violent crime, for which he pleaded guilty and accepted a 10-year sentence.\nSavoy, 18, was caught one day after the shooting with weapons in his backpack believed to have been used at Bunny Friend Park, Thornton said. Savoy accepted a deal that saw a firearm discharge count dropped, and he pleaded guilty to two counts of illegal possession of stolen firearms. Pittman sentenced Savoy to 3 1/2 years on each count, with 2 1/2 years deferred, to be served concurrently. Savoy, who had no previous criminal record, will be on active probation for 2 1/2 years following his release.\nCopelin, 21, was accused of shooting at Veals. But Thornton admitted that Copelin has no previous arrests on his record, and the only witness accusing him of shooting at Veals was Veals himself. Copelin agreed to plead guilty to the lesser charge of illegal use of a weapon in exchange for a two-year sentence, with one year suspended. The deal specifies that Copelin, who has no previous arrests, will be on active probation for one year after his arrest.\nRuffin rejected an offer that would have seen him serve five years for three open cases. He is charged with discharging a firearm during a crime of violence in the Bunny Friend case, as well as with illegal possession of stolen things and aggravated assault with a firearm in separate cases. Ruffin elected to take a Nov. 16 trial date on the other cases.\nAllen and Celestine, who were not offered deals, remain accused of discharging a weapon during a crime of violence. Allen faces an additional count of illegal possession of a firearm by a felon.\nOffray and Bailey also remain charged with discharging a weapon during a violent crime. Bailey rejected an offer that also would have dropped a pending charge of simple escape."}