{"uri": "http://www.ksla.com/story/30591354/bunnyfriend-shootings-investigation-gets-little-cooperation-from-witnesses", "title": "Bunny Friend shootings investigation gets little cooperation from witnesses", "dct": "Tue, 24 Nov 2015 04:18:00 GMT", "id": "625f392a60710f3e24e1788f5bb7c0b8", "content": "NEW ORLEANS, LA (WVUE) -\nDespite a $5,000 reward from Crimestoppers and the large number of people at the Bunny Friend park shooting Sunday night, officers say they are getting little cooperation from witnesses.\n\"We would have hoped that with the number of potential witnesses that were at the event yesterday at the playground, our phone lines would be flooded with information,\" Crimestoppers Executive Director Darlene Cusanza said. \"We have gotten some information, but not nearly the volume that I would have thought, and I guess that's alarming.\"\nThe silence around the Upper Ninth Ward community park is also alarming. Stoops and porches in the area are usually humming with neighborhood chatter, but quiet and fear seem to have taken its place.\n\"Nobody wants to come around here. It's nothing,\" Duncan Smith said. \"You can't blame (residents).\"\nSmith did not witness the violent scene where 17 people were shot, including a 10-year-old boy. He came Monday to rally the neighborhood. But the neighborhood is not answering the call.\n\"At the end of the day, nobody is going to speak because they don't want to endanger their lives,\" Smith said.\nSeveral hundred people witnessed the shooting according to NOPD. Crowds gathered Sunday to record a music video and it gained popularity through social media. The hundreds who saw the shooting are not stepping up as much as authorities would like.\n\"These are individuals that are responsible for terrorizing a neighborhood,\" U.S. Attorney Kenneth Polite said.\nPolite said ATF agents are assisting NOPD with the shooting, which they believe is gang-related. He's confident that over time, more will come forward.\n\"Very quickly, I expect that we will be able to identify some critical pieces of information that will turn the tide and bring us in some of the critical targets,\" Polite said. \"Eventually, if it is so warranted, we may see a state or larger federal investigation or prosecution out of this case.\"\n\"Are you really going to speak about it? or are you just going to let it die down and karma comes around?\" Duncan asked. \"That's the fact that a lot of people in our culture and our community let happen, karma. But at the end of the day, karma is not going to always bring justice like talking about it.\"\nIf you have any information, call Crimestoppers at (504) 822-1111. Callers will remain anonymous and do not have to testify in court to receive money.\nCopyright 2015 WVUE. All rights reserved."}