{"uri": "http://www.wcyb.com/news/19yearold-charged-with-murder-after-3-relatives-killed/35015004", "title": "Charged with 3 murders, Denton's bond quadrupled to $1 million", "dct": "Mon, 31 Aug 2015 19:47:00 GMT", "id": "e4f48f4150bdd70a0423fab23afcf41a", "content": "SULLIVAN COUNTY, Tenn. - The 19-year-old charged with shooting three relatives to death on Saturday night made his first court appearance on Monday.\nJudge Kline Lauderback quadrupled Robert Seth Denton's bond to $1 million and set another hearing for next week. The judge also appointed Lynn Daugherty as his defense attorney because nobody in the Sullivan County Public Defender's Office could handle a possible death penalty case.\nThe charges were three counts of murder, aggravated assault, and reckless endangerment.\nAlso Monday, we learned new details about the case from Sullivan County Sheriff Wayne Anderson. The sheriff said Denton shot and killed his mother, stepfather, and grandmother in a matter of seconds on Saturday night.\nThe victims were identified as:\nToshya Millhorn, 39, Denton's mother,\nJames Millhorn, 36, Denton's stepfather, and\nLena Rose, 57, Denton's grandmother.\nThe shooting happened at a home shared by all the victims on Henson Road in Bristol, Tennessee.\nAccording to Sheriff Wayne Anderson, Denton drove to the home, parked at the end of the long driveway, put on a camouflage jacket, and then walked inside.\nThe sheriff says he shot all three in a matter of seconds with a high-powered semi-automatic rifle.\nThen, he walked next door to his his grandfather, Curtis Rose, who'd been working with tools and didn't hear the shooting. He told his grandfather to call 911 and started to drive away.\nAnderson said when the grandfather realized what had happened, he fired a shot at Denton. The bullet went through the glass and struck Denton in the arm. Denton called 911 for himself.\nDenton was found in the 800 block of Henson Road where officers took him to the hospital for his injuries. He was eventually brought to the Sullivan County Correctional Facility.\nThe sheriff said authorities don't have an exact motive for the shooting, but they have an idea and that Denton hated his mother for years.\nThere were six children, ranging in age from two to 10, inside the home when it happened. Five of them were Denton's half-siblings. The other was a friend who was visiting. The grandfather hid them in the bathroom after seeing what happened. Sheriff Anderson became emotional while talking about what the children witnessed.\nMonday, Robert Seth Denton was scheduled to be arraigned in court in Bristol.\nThe sheriff was been investigating his past. He said Denton did not have a local criminal history, but he was generally discharged from the military. Investigators are trying to find out why.\nAs for the weapon, Anderson said it was a high-powered rifle. He wasn't sure what type of gun it was, saying he'd never seen one like it before."}