{"uri": "http://wane.com/2015/06/26/father-admits-to-firing-shot-that-killed-daughter/", "title": "Father admits to firing shot that killed daughter", "dct": "Fri, 26 Jun 2015 14:08:00 GMT", "id": "53730e56e7c4da29496020b9e135bb0d", "content": "ALLEN COUNTY, Ind. (WANE) The father of 5-year-old Mya White, who died after being shot in the face, pleaded guilty Friday to reckless homicide and using a gun while committing the crime.\nToney White II was arrested in March after a month long investigation into the death of his daughter.\nBack in February of 2015, White was showing off guns to a friend when the shooting took place at his home on 4th Street. According to the affidavit of probable cause obtained at the time, police found three guns at the home.\nThe gun discharged, hitting Mya above her right eye. When police arrived at the scene, they found her in a pool of her own blood. She was taken to the hospital in critical condition but later died.\nMya was described as “a gift from God for all of us to cherish,” by the mother of her older half-siblings.\n“I appreciate the time she was with us. We will always treasure her moments, always. She’ll always be a part of us, always. She was just an angel, I mean just a gift from God is what she was, very special,” Melinda Lane told NewsChannel 15 back in February.\nWhite will be sentenced on July 24.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}