{"uri": "http://wtop.com/prince-georges-county/2016/02/double-homicide-under-investigation-in-fort-washington/slide/1/", "title": "Double homicide under investigation in Fort Washington", "dct": "Tue, 02 Feb 2016 10:40:00 GMT", "id": "c65ba6cdd27b519fbde4ac085646865e", "content": "WASHINGTON— In a crime that acting Prince George’s County Police Chief Hank Stawinski says “shocks the conscience,” a mother and her 2-year-old are dead after a shooting in Fort Washington, Maryland, Tuesday morning.\nAround 7 a.m., NeShante Alesha Davis was found in the parking lot of Pinewood Hill Condominiums, in the 1300 block of Palmer Road, according to the Prince George’s County Police Department spokeswoman Julie Parker.\nThe toddler, Chloe Nichole Davis-Green, was in a nearby car.\n“The woman was pronounced dead on the scene. The toddler was taken to the hospital and pronounced dead,” Parker said. “At this point, this is a very active police investigation. We can’t get into a lot of details at this point because of that.”\nCalling this a “profoundly sad day,” Stawinski said detectives are “actively pursuing leads.”\n“As soon as we know all of the facts, we’ll come back to you and share them with you,” he said during a morning conference.\nPolice received several reports of people hearing gunfire, but are asking anyone with information to call Crime Solvers at 1-866-411-TIPS (8477) or text PGPD plus your message to CRIMES (274637). Tips also can confidentially be reported online through Crime Solvers.\nThe crime has “enraged” Prince George’s County State’s Attorney Angela Alsobrooks.\n“This is absolutely unacceptable in any civilized society that a child should be killed in this way,” Alsobrooks said.\nAlsobrooks said once an arrest is made, the county will “spare no resource in holding that individual accountable.”\nDavis was a second-grade teacher at Bradbury Heights Elementary School in Capitol Heights, Maryland.\n“All of us [are] deeply saddened by the loss of NeShante Davis and her young child,” county schools spokeswoman Sherrie Johnson said in a statement. “Crisis teams are available at the school for all of our students, staff and their families as long as they need it.\n“The district will do all it can to support the school community at Bradbury Heights Elementary School. Our thoughts and prayers are with the family of NeShante Davis.”\nInvestigators have yet to identify a suspect or motive.\nWatch the news conference with Stawinski and Alsobrooks.\nComments\nWTOP is now using Facebook as our comment platform. Need help? Email us.\nFollow @WTOP on Twitter and like us on Facebook.\n© 2016 WTOP. All Rights Reserved."}