{"uri": "http://raycomgroup.worldnow.com/story/26293250/solicitor-murder-charge-dropped-in-greenwood-teens-homicide", "title": "Solicitor: Murder charge dropped in Greenwood teen's homicide", "dct": "Fri, 15 Aug 2014 21:39:00 GMT", "id": "d68cbbbaf109b5e4c98a2bc6d1caf4d1", "content": "GREENWOOD, SC (FOX Carolina) -\nDavid Stumbo, 8th Circuit Solicitor, said his office dropped the murder charge against a man in a 2013 homicide case.\nGreenwood Police say 15-year-old Malik Padgett, of Columbia, was shot and killed while visiting family in Greenwood during Spring Break in April 2013. Five other men were also shot but survived the shooting.\nThe shooting happened during a birthday party along Tabor Street. Malik Padgett's mother said her son was about to come home from his cousin's home where he had just gotten a haircut, and was caught in the line of fire.\nDays after the shooting Greenwood Police arrested 17-year-old Dayterrious White and charged him with murder.\nThen in June of last year, 26-year-old Jason Aiken was arrested and charged with murder and five founts of attempted murder.\nHowever, more than a year later, 8th Circuit Solicitor David Stumbo told FOX Carolina the charges against Aiken had been dropped.\nFOX Carolina\nOn Friday afternoon Stumbo released the following statement:\n\"Upon further investigation by law enforcement, and consideration of the evidence as it currently exists, the decision has been made to dismiss the indictments against defendant Jason Aiken with leave for the State to re-indict should new evidence come to light. It would be improper and unethical for my office to continue to pursue charges that, at this time, cannot be supported with credible evidence. We will continue to work alongside the Greenwood Violent Crimes Task Force investigators as they pursue further leads on this case. Our continued sympathy and prayers are with the family of Malik Padgett as they mourn their loss, and we will never give up hope that the perpetrators of this tragedy will soon be brought to justice.\"\nIn regards to Dayterrious White's charges in the case, Stumbo said, \"At this time, the charges against Dayterrious White are still pending. The investigation on this case is ongoing.\"\n\"I want my son's killer found,\" said Latarsha Padgett, \"But I don't want the wrong person charged.\"\nAnyone with information on this shooting is asked to call Greenwood Police at 864-942-8632.\nCopyright 2014 FOX Carolina (Meredith Corporation) All rights reserved."}