{"uri": "http://www.theadvertiser.com/story/news/2015/07/24/update-shooting-investigation-leads-police-motel/30608859/", "title": "'That was a horrific scene'", "dct": "Fri, 24 Jul 2015 00:00:00 GMT", "id": "14a4e5f8478644cbf7d776cfa7a219d9", "content": "Gov. Bobby Jindal: Shooter was methodical as he opened fire in movie theater\n5:20 p.m.\nAt a press conference at 5:15 p.m. Friday, Lafayette Police Chief Jim Craft said shooter John Russell Houser exited the Grand Theatre through a side door after shooting several people.\nWhen he saw a police unit pull into the parking lot, Houser re-entered the theater and fired three more rounds, then a fourth, that took his own life, Craft said.\nFifteen shell casings were recovered in various parts of the theater, he said.\n\"That was an horrific scene,\" Col. Mike Edmonson, Louisiana State Police, said.\nHouser purchased a 40-caliber semi-automatic handgun at a Phenix City, Alabama, pawn shop in February 2014, Craft said.\nIt's still unclear why Houser was in Lafayette. Craft said he entered Louisiana around July 2 or 3 and visited various locations up and down the interstate.\n\"He was out and about. We know he was doing some drinking,\" Craft said. \"He was circulating while he was here.\"\nHouser appears to have visited Lafayette more than once, possibly looking for 'a soft target,\" he said.\nFive people shot by Houser inside the theater remain hospitalized, Craft said. Four have been treated and released.\n2 p.m.\nThree shooting victims remained hospitalized at Lafayette General Medical Center on Friday, but officials said all three are in stable condition and expected to be released in a few days.\nThe hospital received five patients from the scene of the shooting Thursday night, said David Callecod, president of Lafayette General Health. Three of the patients were transported by ambulance, while two were brought via private vehicle.\nCallecod said all five victims had sustained gunshot wounds. Three were classified as Level One trauma patients, while one was a Level Two trauma patient.\n12:18 p.m.\nGrand Theater headquarters released this statement following last night's shooting:\n“All of us offer our thoughts and prayers to the victims and to the community of Lafayette. We are grateful to all local officials and to the governor for their efforts.”\nGrand Theater is one of three brands operated by Southern Theaters, LLC, based in New Orleans.\n11:42 a.m.\nReporter Seth Dickerson is out on the street talking to Lafayette residents who are shocked and saddened but strongly believe their community will unite in this tragedy.\n\"It was tragic. Just to stand up and shoot people, he must have had a mental illness. It was horrific,\" said Leon Simmons. \"I'm hurt. We're a very resilient community. We'll get through this, but we'll have to get through the grieving first.\"\nNurse Ashley Brinkhaus said the shooting was crazy.\n\"It hurts to the depths of my soul to know this happened in our own backyard,\" she said. \"We raise our kids here.\"\nResident Alex Thibodeaux had only one thing to say about the suspect.\n\"(Houser) was a coward,\" he said.\n10:40 a.m."}