{"uri": "http://myfox8.com/2015/07/23/louisiana-theater-shooting-2-dead-including-shooter-multiple-injuries/", "title": "3 dead, 7 hurt when gunman opens fire in Louisiana movie theater", "dct": "Thu, 23 Jul 2015 21:46:00 GMT", "id": "b743d7356000a298fe73143f014f0b59", "content": "Latest developments\n11:02 p.m.: According to authorities, the updated count from the theater shooting: 3 dead, including the shooter. Seven others injured.\n10:52 p.m.: Authorities said they know the identity of the shooter but are withholding it so as not to “affect the integrity” of the investigation.\n10:45 p.m.: “There’s nothing to believe that there was any kind of motive,” said Col. Michael Edmonson of the Louisiana State Police.\n10:43 p.m. ET: A 58-year-old white male who was a theater patron fired multiple shots, Edmonson said. The shooter was acting alone and is deceased, he said. There were about 100 people inside at the time.\n[Full story]\nLAFAYETTE, La. — A man opened fire inside a movie theater in a Lafayette, Louisiana, multiplex, Thursday night, killing two people and wounding seven others — before taking his own life.\n“There’s nothing to believe that there was any kind of motive,” said Col. Michael Edmonson of the Louisiana State Police.\nThe shooter was a 58-year-old white man who was a movie theater patron, police said. Authorities have his name but are withholding his name as the investigation continues.\nThe shooting took place at the Grand Theatre 16 in Lafayette, about 45 west of the state capital, Baton Rouge.\nAbout 100 people were inside the theater for a screening of the comedy, “Trainwreck,” when the shooting happened shortly before 8:30 p.m. ET.\nThe scene immediately after the shooting was chaotic.\n“A whole bunch of girls started screaming and we heard that someone was shot,” Roxy Martinez told CNN affiliate KATC. “There were a lot of people running.”\nHer brother saw a woman who had been shot in the stomach.\n“I see a lady full of blood in a dress,” Robert Martinez said. “She was just looking at me in complete fear.”\nTodd Moffatt, manager of a Mellow Mushroom pizza restaurant in the area, said 20 to 30 emergency vehicles had arrived on the scene. The area was locked down, he said.\nLouisiana Gov. Bobby Jindal tweeted, “I’m on my way to Lafayette right now. Please say a prayer for the victims at Grand Theatre and their families.”\nLafayette is a city of about 120,000 people 60 miles west of Baton Rouge.\nThe shooting happened days after the conviction of James Holmes in the July 19, 2012, Aurora, Colorado, theater shooting that left 12 people dead and 70 people wounded."}