{"uri": "http://www.whio.com/news/news/crime-law/police-still-investigating-fatal-shooting-in-sprin/njFQZ/", "title": "Police still investigating fatal shooting in Springfield", "dct": "Mon, 24 Nov 2014 00:00:00 GMT", "id": "02811c8e81593a87eced78569c48edf1", "content": "Springfield police continue to investigate the fatal shooting of a Springfield man this weekend and how many other victims may have been involved.\nDavienne J. Lewis, 23, of 218 E. Third St., died at Springfield Regional Medical Center of a single gunshot wound, according to a Clark County coroner’s autopsy report.\nA small memorial of flowers, candles and stuffed animals had formed by Monday afternoon near the spot where Lewis was shot on Rice Street near Clifton Avenue.\nBrittany Ragland left a flower at the memorial Monday and said if someone knows information about who killed her high school classmate, she hopes they go to the police instead of fueling “gossip.”\n“No sense in pointing fingers or the he said, she said,” Ragland said. “That’s not going to get nobody anywhere, it’s just going to end up in more senseless shooting.”\nLewis was found laying on Rice Street about 2:15 a.m. Saturday, police said.\nA 9-1-1 caller told police he heard multiple shots fired and looked outside his home to see Lewis in the road, according to the recording obtained by the Springfield News-Sun. The caller also told police he saw other men running from the scene who were possibly acquaintances of Lewis and may also have been shot, according to the 9-1-1 audio.\nThat caller, who asked not to be identified out of fear for his safety, said he was shocked to see the men leave the scene.\n“If you’re going to get in trouble or not, that’s your friend … you say he’s your friend,” he said. “But when it all boiled down to that night he had no friends, he was left by himself.”\nMarquise McPherson, 25, of Springfield, showed up at Dayton Children’s Hospital with a gunshot wound to his buttocks, police said. At first, he told Dayton police he had been shot in Dayton. But he then told Springfield investigators he was hit by gunfire in the same location where Lewis had been shot and killed, Springfield Police Chief Stephen Moody said.\nTwo other Springfield men showed up at Dayton hospitals with gunshot wounds, but continue to tell police that they weren’t injured in Springfield, Moody said.\nAll three men are expected to recover from their injuries, police said.\nSpringfield police and the Clark County Prosecutor’s Office are continuing to investigate the case together, but detectives haven’t named a suspect in the shooting."}