{"uri": "http://guidrynews.com/story.aspx?id=1000074253", "title": "Houston Police Department", "dct": "Mon, 21 Dec 2015 00:00:00 GMT", "id": "9a1325c8435bab0fbbe7017dc52b13b6", "content": "Houston police are investigating several incidents that took place during the weekend, including a shooting incident on Saturday involving a 3 year old boy.\nInvestigation into Shooting Incident at 10633 Strickland\nHouston police are investigating the shooting of a juvenile male that occurred at 10633 Strickland about 12:30 p.m. on Saturday (Dec. 19).\nThe victim, a 3-year-old boy, of the above address, was transported to Texas Children's Hospital.\nHPD Homicide Division Sergeant K. Tolls and Senior Police Officer R. Cervantes reported:\nThe victim was in the care of his adult aunt when he was accidentally shot by his adult uncle, who has Down Syndrome. The victim was transported to the hospital in stable condition.\nNo charges have been filed at this time as the investigation is continuing.\nInvestigation into Fatal Crash at 5400 Westheimer\nHouston police are investigating a fatal crash that occurred at 5400 Westheimer about 1:05 a.m. on Saturday (Dec. 19).\nThe identity of the male victim is pending verification by the Harris County Institute of Forensic Sciences.\nHPD Vehicular Crimes Division Sergeant T. Trometer and Officer M. Serafine reported:\nThe victim was driving a white Chevrolet Corvette westbound on Westheimer when he made a left turn into the eastbound lanes and was struck by a red Dodge pickup truck traveling eastbound on Westheimer. The driver of the Corvette was pronounced dead at the scene. A passenger in the Corvette was transported to an area hospital with non life-threatening injuries. The driver of the Dodge was not intoxicated and was questioned and released at the scene.\nInvestigation into Male's Death at 5500 Cavalcade\nHouston police are awaiting autopsy results in the death of a man found at 5500 Cavalcade about 2:50 p.m. on Sunday (Dec. 20).\nThe victim, believed to be between 30 and 40 years of age, had no obvious signs of trauma and was pronounced dead at the scene. His identity is pending verification by the Harris County Institute of Forensic Sciences.\nHPD Homicide Division Officers R. Klementich and J. Saldana reported:\nHPD patrol officers responded to a person down call at the above address. Upon arrival, the officer learned witnesses were walking eastbound on Cavalcade when they observed a body floating in the bayou. They then called 9-1-1.\nThe HPD Dive Team was called to the scene and recovered the victim.\nAnyone with information about this case or the identity of the victim is urged to contact the HPD Homicide Division at 713-308-3600.\nInvestigation into Man's Death at 2425 Sage\nHouston police are awaiting autopsy results in the death of a man found at 2425 Sage #157 about 9:10 p.m. on Sunday (Dec. 20).\nThe victim, Cortez Taylor, 31, of the above address, suffered unknown wounds and was pronounced dead at the scene. His cause of death is pending an examination by the Harris County Institute of Forensic Sciences.\nHPD Homicide Division Officers C. Elder and N. Sharp reported:\nFriends of Mr. Taylor became concerned when they hadn't heard from him for a few days and went to his apartment to check on him. Upon entering the apartment, they found him lying on the floor and called 9-1-1. HFD paramedics arrived and pronounced him dead.\nAnyone with information on this case is urged to contact the HPD Homicide Division at 713-308-3600.\nInvestigation into Fatal Crash at 3200 Holcombe\nA man critically injured in a crash at 3200 Holcombe about 8:50 a.m. on December 4 has died.\nThe victim, Justin Lee Campbell, 27, was pronounced dead at an area hospital on Sunday (Dec. 20).\nHPD Vehicular Crimes Division Sergeant G. Lopez reported:\nA witness stated Mr. Campbell was walking in a parking lot of a business at the above address when he was struck by a vehicle, described only as a white Toyota. Paramedics transported Campbell to Ben Taub General Hospital.\nAnyone with information in this case is urged to contact the HPD Hit and Run Unit at 713-247-4065 or Crime Stoppers at 713-222-TIPS."}