{"uri": "http://www.rocketcitynow.com/news/relatives-identify-one-of-two-shooting-victims", "title": "Relatives identify one of two shooting victims", "dct": "Tue, 05 Jul 2016 17:52:00 GMT", "id": "86a3f2cdc3c889983cb8d46b9e81f76c", "content": "HUNTSVILLE, Ala.\nFamily members stood in the pouring rain for hours, waiting to see coroners pull two bodies from a home on Broadmor Dr.\nRelatives tell me one of the victims is Jaylen Cosby.\n\"It was very heart-breaking as well as surprising because normally we haven't had any problems in this neighborhood, \" said Isaiah Robinson.\nRobinson lives a few homes down from where the shooting happened.\n\"These was some young kids, young boys.\"\nRobinson usually takes a jog around 7a.m. which is the time officers say the shootings happened.\n\"Normally I would jog up and down that street and it just so happened I didn't do it this morning, \" said Robinson.\nPolice were out on Broadmor just before the shooting happened, responding to a suspicious person call.\n\"Originally the call we had, there wasn't much to it. We didn't get much. It was suspicious people here, there was a shots fired call and we came back a few moments later, \" said Lt. Stacey Bates.\nInvestigators say one of those killed lived in the Broadmor home. Family members tell me it was Cosby who lived here with his mother. Officers are still working to determine a motive.\n\"We don't know if there is any other people involved or what's going on at this point, \" said Lt. Stacy Bates.\nPolice did search a man at the scene. Officers put him in a car and drove away.\n\"I don't know if those are witnesses or family members maybe from the deceased,\" said Lt. Stacy Bates.\n\"Those kind of things happen and it requires us to be very prayerful and stay prayerful,\" said Robinson.\nNeighbors and relatives hope this double deadly shooting can be a cause for change.\nCopyright 2017 Nexstar Broadcasting, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}