{"uri": "http://www.mlive.com/news/jackson/index.ssf/2016/01/riley_spitler.html#incart_river_home_pop", "title": "'He was acting like James Bond or something, so I did it back' teen charged with open murder says", "dct": "Thu, 14 Jan 2016 07:30:00 GMT", "id": "e0f0b75606e1720cfca97c39edc68c05", "content": "JACKSON, MI -- As he listened to a recording of himself describing the night he fatally shot his brother, Riley Spitler's eyes welled up and he slumped his head into his palms.\nHe regularly looked away from the courtroom's screen as his defense attorney Alfred Brandt consoled him with an arm around his shoulders.\nIn a recording from Dec. 12, 2014, nearly a week after Riley Spitler, 17, shot and killed his brother, Patrick, the teen told officers he would never intentionally shoot his brother or anyone in his family.\nRelated: Live coverage recap: Open murder trial continues for teen accused of killing brother\nThe recording -- an interview between two Blackman-Leoni Department of Public Safety Officers and the defendant -- was presented in Jackson County Circuit Judge John McBain's courtroom Wednesday, Jan. 13.\nPolice responded to the 5000 block of Big Rock Drive in Blackman Township on Dec. 6, 2014, after Riley Spitler called 911 and told dispatchers he shot his brother. Patrick Spitler, 20, was pronounced dead in an upstairs bedroom after several attempts to revive him failed.\n\"We were joking around, I had the real deal .380 (caliber handgun) in my hands,\" Riley Spitler, who faces an open murder charge in connection to the shooting death of his 20-year-old brother, said in the video. \"He had a BB gun; plastic one that shoots tiny little BBs, and I was just, you know, aiming it at him joking around.\n\"I loaded it, cocked it back, thought I de-cocked it, then I pulled the trigger, and it hit him right in the chest.\"\nThe charge of open murder allows a judge or jury to decide on the degree of murder or manslaughter, if the defendant is convicted.\n\"Patrick was on his phone sitting down when he was shot,\" Riley Spitler said in the video. \"Patrick was acting like James Bond or something, so I did it back, and a round went right through his chest.\"\nThe two reportedly had been playing a form of Russian Roulette where they would spin the barrel and check to see if it landed on a bullet or not.\nIn the video, Riley Spitler tells Blackman-Leoni Township Public Safety Detectives Joseph Merritt and Chris Boulter that about two seconds before pulling the trigger, he said to his brother \"let's see if it's your lucky day.\"\n\"He screamed 'Riley, you just shot me,'\" Riley Spitler tells Merritt and Boulter in the video. \"It was the loudest, most terrifying scream you could ever hear.\"\nAfter the fateful shot was fired, Merritt testified the 17-year-old called 911 and ran outside in the cold with nothing but a pair of sweatpants on as he waited for officers to arrive.\nA former classmate of Riley Spitler's, Hayden Slaby, 17, testified that on one occasion at a bonfire, he heard the defendant say, \"I could kill someone and get away with it.\" Slaby said the statement was unprovoked, and everyone paused and carried on with their conversations shortly after.\nThe witness testified he had only heard the 17-year-old say he didn't like his brother once.\nDuring a search of Riley Spitler's room, police found four handguns, a duffel bag containing four separate gallon-sized Ziploc bags and a Mason jar full of marijuana.\nIn addition to the open murder charges, Riley Spitler also faces intent to deliver marijuana and two counts of felony firearm.\nIn the video, Riley Spitler said his brother didn't agree with what he was doing, but he wanted the two to have a bond and be friends. The two had butted heads for most of their lives, he tells the officers in the recording.\nDuring Tuesday's proceedings, Blackman-Leoni Township Public Safety Department Sgt. Steve Stowe said Riley Spitler was \"hysterical\" upon arrival.\nPolice say he punched the glass out of a door as he frantically rushed outside to wait for officers to arrive. Merritt testified that when Riley Spitler was in his patrol car, he was shaking so hard that he thought he might be cracking his head against something in the vehicle.\nIf convicted of first-degree murder, the 17-year-old will receive a mandatory sentence of life in prison without a chance at parole. Using a firearm to commit a felony carries a two-year prison penalty while possession with intent to deliver is punishable by up to four years.\nThursday's proceedings will resume 9:30 a.m. in McBain's courtroom. The prosecution has yet to rest its case.\nFor a full recap of Wednesday's coverage, click here and scroll to the comments section below."}