{"uri": "http://www.nj.com/essex/index.ssf/2016/12/at_least_30_shots_fired_in_attack_that_wounded_6_a.html", "title": "30 shots fired in N.J. club rampage that wounded 6, officials say", "dct": "Wed, 07 Dec 2016 00:53:10 GMT", "id": "ec33a7e017b3cfbc8fe46970642e69dd", "content": "BLOOMFIELD -- The lounge where six people were shot has been temporarily shut down after inspectors found various code violations, officials said Tuesday.\nBloomfield police, working with colleagues from Newark, were making progress in the \"very active investigation\" into the gunfire late Friday at Sports in the City Lounge on First Avenue, according to township Police Director Samuel DeMaio.\nThe six people wounded in the gunfire -- residents of Newark, East Orange and Roselle -- were all treated for non life-threatening injuries, he said.\nDeMaio said investigators believe the shooting was targeted at someone attending an event at the lounge, but declined to comment in detail on a motive for the attack. Ballistics evidence showed three guns were used in the shooting, which occurred as 30 to 40 people were inside the business located near the Newark-Bloomfield line.\nA tipster reported someone was seen putting a gun in a vehicle at the shooting scene, according to DeMaio, who said police obtained a search warrant for the car. That search netted 12 bricks of heroin packaged for distribution and .357 handgun that was not used in the shooting.\nPolice said three different guns were used but did not know how many shots were fired. Nearby residents said they heard between eight and nine loud pops.\nOfficials also conducted an inspection at the business, where they found fire and health code violations, DeMaio added. The business was ordered closed ahead of a court hearing.\nBefore the shooting there was no extensive history of police calls at the business, which allows patrons to bring their own alcohol, but does not serve the drinks, according to the police director.\nDeMaio said no one has been able to provide detectives with a description of the shooters or any suspect vehicles. Police initially reported there were five shooting victims, but later learned another person was grazed in the arm.\nA portion of the shooting was captured in a video shared on the Facebook page of Toni Byrd, a Brooklyn-based comedian who was performing at Sports in the City. (Warning: this unedited video contains profanity)\n\"I was headlining comedy show tonight in Bloomfield NJ. And bullets started flying..I mean they shot the spot up,\" Byrd said in a Facebook post. \"I'm so grateful because a few bullets pass by me. I was able to get on the floor and make it in the back room.\"\nIn a statement on Facebook, Sports in the City responded to \"negative views\" about the establishment and news coverage of the shooting.\n\"We welcomed everyone with a smile, great food, & a good time. Our hearts are very apologetic to those harmed,\" the statement added. \"Ask those who came there for a good laugh, a bite to eat, or to watch their teams play. Everyone was treated as family once entering the business.\"\nCrime Stoppers has offered a $5,000 reward for any information about the shooting that leads to an arrest. Anyone with information can call 973-680-4090.\nYou need to have the Adobe Flash Player to view this content. Please click here to continue.\nNoah Cohen may be reached at ncohen@njadvancemedia.com. Follow him on Twitter @noahyc. Find NJ.com on Facebook."}