{"uri": "http://www.cleveland.com/metro/index.ssf/2016/08/at_least_a_dozen_shots_fired_d.html#incart_river_home", "title": "At least a dozen shots fired during argument at house where Cleveland teen was killed", "dct": "Tue, 30 Aug 2016 17:47:00 GMT", "id": "9989f9e990fa11e9d9d638a349c0494a", "content": "CLEVELAND, Ohio -- At least a dozen shots were fired Sunday at a home where a 16-year-old boy was killed.\nNo arrests have been made in the slaying of Percy Wells at his home in the 4100 block of East 104th Street, off Miles Avenue.\nResidents who called 911 said two men argued about 10 p.m. in front of the home.\nCallers said gunfire erupted, and that it sounded like someone was shooting from an automatic gun. One said they heard about 12 gunshots and another said they heard 20 or more, police reports say.\nOne resident told dispatchers that the house where the shooting happened was a \"big drug house,\" according to police reports.\nPolice records show no calls to the home since the beginning of the year, but court records show people who once lived at the home had previously been convicted of drug dealing.\nInvestigators said the incident began shortly before 10 p.m. Sunday, when two men stole a man's SUV after he went into the Fresh Deli at the intersection of Miles Avenue and East 93rd Street.\nThe man told police that he came out of the store and saw the men pulling out of the parking lot and driving east in his 2007 Lincoln MKX. The man chased the SUV several blocks, before borrowing someone's cellphone to report the theft.\nSeveral minutes later, police say the SUV thieves drove about a half-mile down the road and fired several shots at the East 104th Street home.\nWells was shot in the chest and lower back. A 35-year-old Akron man with a long criminal history that includes several drug trafficking convictions, including with people who at one point lived in the home where the boy was killed, was shot in the right thigh.\nSomeone drove both to Marymount Hospital. The boy died there and the 35-year-old man was flown to MetroHealth Medical Center. Police reports say the man was expected to be treated and released from the hospital.\nPolice followed the stolen SUV from the scene of the shooting. The driver crashed at East 100th Street and Gaylord Avenue and the men inside ran off. They have not been arrested, police said.\nA man at Wells' home Monday who identified himself as Wells' uncle said his nephew was a good kid but declined to speak further.\nIf you'd like to comment on this story, visit our crime and courts comments section."}