{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-man-64-found-shot-dead-on-west-side-20161230-story.html", "title": "Gunfire erupts at robbery on South Side, one of 10 shootings in Chicago", "dct": "Tue, 03 Jan 2017 14:09:00 GMT", "id": "349d909b95d070710a37eeed195c5ab1", "content": "(Eric Clark / Chicago Tribune)\nFour people were killed, including a 64-year-old man, and eight other people were wounded in shootings from Friday to Saturday morning in Chicago, police said.\nOne man was killed and another man was wounded when gunfire erupted during a robbery in the East Chatham neighborhood on the South Side on Friday afternoon, police said.\nThe robbery occurred shortly before 2 p.m. in the 8200 block of South Ingleside Avenue, police said. A 23-year-old man was walking when someone approached, brandished a gun and demanded his property, police said.\nThey started fighting and shots rang out. The 23-year-old was hit in the hip and the robber was shot in the head, police said.\nThe robber was pronounced dead and the 23-year-old was taken to Stroger Hospital, where his condition was stabilized. A gun was recovered, police said.\nThe Cook County medical examiner's office identified the man who died as 19-year-old Andre D. Lacaze of the 13900 block of South School Street in Riverdale.\nAndres Delgado, 39, said he was moving a couch through the front door of The Little People House Daycare at 8238 S. Ingleside Ave. when he heard gunshots and saw a man with a gun running toward him from an apartment complex across the street.\nDelgado ran inside the day care and locked the door. When he looked outside, he saw a man who looked injured trying to jump over the couch, which was now blocking the doorway.\nThe man collapsed. He apparently was the one who survived and was taken to Stroger.\nDelgado said he often works in the area and is aware of the dangers of the neighborhood, but this was the first time he had witnessed a shooting.\n\"It's scary when you see someone and in their hand is a gun,\" Delgado said, shoving his hands into the pocket of his sweatshirt and shivering from the cold.\nDanisha Philpot, 23, was inside the day care with her sister when she heard shots.\n“It was terrifying. It was scary because all I heard were gunshots,’’ said Philpot, a child care assistant who said no children were inside at the time.\nPhilpot’s 24-year-old sister was closer to the door, near the movers, when she heard the wounded man yell that he’d been shot and to call police.\nThe sister threw the man a pink towel to try to help him, and the siblings called police and another family member.\nPolice cordoned off the entrance to the day care and a silver dolly sat unattended in the middle of the sidewalk on the south side of the street. The crumpled pink towel and a brown backpack lay discarded close by.\nIn the Gresham neighborhood about 9:40 p.m. Friday, a 15-year-old boy was found dead in an alley in the 8100 block of South Bishop Street, police said. Officers found him after they responded to the area for a call of shots fired.\nThe victim was shot in the head, and he was pronounced dead at the scene. Authorities identified him as Gregory Livingston III of the 7700 block of South Throop Street.\nEarlier police believed the victim was in his 20s.\nAnother fatal shooting occurred shortly before 12:30 p.m. in the 4800 block of West Ferdinand Street in the West Garfield Park neighborhood, police said. A 19-year-old man, Carlos James, was shot in the chest and was taken to Mount Sinai Hospital, where he was pronounced dead at 1:30 p.m., according to officials.\nA 33-year-old man had gone to the location to buy an item from a website, according to police. When the man arrived, the 19-year-old man, armed with a weapon, announced a robbery. That led to a struggle between the men, and at some point a shot was fired, striking the 19-year-old man in the chest, police said.\nJames lived on the same block where the shooting took place, according to the Cook County medical examiner's office.\nEarlier Friday, a 64-year-old man was killed in the Garfield Ridge community on the Southwest Side. According to preliminary reports, the shooting happened about 9:20 a.m. in the 4200 block of South Keating Avenue, police said. He was identified as Louis Pena, 64, of the 3800 block of West 65th Street, according to the Cook County medical examiner's office.\nPena was shot twice in the head and was pronounced dead at 9:29 a.m. at the scene, authorities said.\nA 35-year-old man was critically wounded early Saturday in a shooting in the Gage Park neighborhood, police said. He was shot in the head while he was driving a sedan just before 3:05 a.m. in the 5600 block of South Albany Avenue. He was taken in critical condition to Mount Sinai Hospital.\nAn officer placed branches on the ground to mark spent shell casings found at the crime scene. About half a mile away in an alley in the 3100 block of West 53rd Street, officers guarded the vehicle that was involved in the shooting. At least one bullet hole could be seen on the side of the car, and one of the rear windows had been shattered by the gunfire.\nIn other shootings:\n• An Uber driver and a 22-year-old man were wounded in a shooting at 3:15 a.m. Saturday in the 2200 block of North Latrobe Avenue in the Hanson Park neighborhood, officials said. A 22-year-old man was approached by two men who began shooting at him. He was shot in the lower back, and his condition was stabilized at Mount Sinai Hospital. A 37-year-old man who was driving by was shot in the left thigh, and his condition was stabilized at Illinois Masonic Medical Center. The Chicago Fire Department said the 37-year-old man, a driver for Uber, had dropped off a customer when he was hit by the gunfire. He drove to the intersection of Fullerton Avenue and Long Avenue to seek help.\n• About 7:30 p.m. Friday, a 33-year-old man was shot in the 700 block of West 73rd Street, in the city's Englewood neighborhood. He was walking when another man approached on foot and fired shots hitting him in the leg and back, police said. The 33-year-old was taken in critical condition to Advocate Christ Medical Center, police said.\n• About 5:30 p.m., a 22-year-old man was shot in the 100 block of North Long Avenue in the city's South Austin neighborhood. The man was wounded in the back and taken to West Suburban Medical Center in Oak Park, where his condition has stabilized, police said.\n• About 4:30 p.m., a 25-year-old man was shot in the back in the 4700 block of South Throop Street in the Back of the Yards neighborhood, police said. He was taken in serious condition to Stroger Hospital.\n• About 10:30 a.m., a 23-year-old man was shot in the West Pullman neighborhood on the Far South Side. Police said the man was walking in the 200 block of West 117th Street when he was struck in the lower left leg. The bullet exited at his hip. He was taken in fair condition to Christ Medical Center, police said."}