{"uri": "http://www.charlotteobserver.com/news/local/crime/article34223289.html", "title": "7-year-old shot, killed in Southwest Charlotte, 3 others injured", "dct": "Sat, 05 Sep 2015 23:29:00 GMT", "id": "edcfbb1139eaa8a520289cdf9c5eeb38", "content": "Charlotte-Mecklenburg police are investigating the death of a 7-year-old boy from an apparent gunshot wound suffered Saturday night in Southwest Charlotte.\nPolice on Sunday identified the victim as Kevin Antonio Calderon Rodas. Due to the chaotic scene and an initial language barrier, police said the victim was initially identified as being a 9-year-old.\nSteele Creek Division patrol officers responded to multiple calls for shots fired in the area of Fieldvale Place and were flagged down by family members with a 7-year-old suffering an apparent gunshot wound, police said in a news release issued early Sunday morning.\nMedic took the the victim to Carolinas Medical Center, and he was pronounced dead at the hospital, police said.\nTwo other adult victims and a second juvenile victim were at the scene suffering from non-life threatening injuries and were treated by Medic, police said.\nOn Sunday morning, a shattered car window and candy from a piñata were visible outside a home on Fieldvale Place where the shooting occured.\n“It’s a sad state of affairs,” CMPD Deputy Chief Jeff Estes said at a news conference from the scene. “We have a lot of soul searching to do when, as a city and as a country, a nine-year old (boy) isn’t safe playing in the front yard.”\nPolice received the initial call for service at 8:51 p.m. Saturday. Detectives are now conducting a homicide investigation in the 6800 block of Fieldvale Place.\nPolice said the Mecklenburg County District Attorney’s homicide prosecution team, as well as the police department’s K-9 and gang units are assisting with the investigation.\nPolice ask that anyone with information about the incident call 704-432-TIPS and talk directly with a homicide unit detective. The public can also call Crime Stoppers at 704-334-1600 or visit the Crime Stoppers mobile app website at http://charlottecrimestoppers.com/."}