{"uri": "http://www.11alive.com/story/news/crime/2015/02/01/bodies-found-lagrange-home/22686703/", "title": "Man charged in murder of 5 makes 1st appearance", "dct": "Wed, 04 Feb 2015 00:00:00 GMT", "id": "a8889860b4b5a6eaef53bf8087c478da", "content": "LAGRANGE, GA (WXIA) – The man accused of murdering five people in LaGrange was escorted back to Georgia late Tuesday night, and back in court by 9:00 Wednesday.\nThe judge read the charges against Thomas Jesse Lee; four of the victims were shot, another asphyxiated. Shelia Burton, 68 years old, was shot. Her husband,69-year-old William Burton was beaten and shot. Sixteen-year-old Bailey Burton was asphyxiated. The other teen, eighteen-year-old Leanna Green, was shot. Thirty-three-year-old Christie Lee, Thomas Lee's wife, was also shot.\nJudge Vicki McWaters said bond was denied, and that it could only be set by a Superior Court judge. Lee's only words: \"Yes Ma'am\" when responding to the judge. Lee's next court appearance will be February 19th.\nLee was arrested in Tupelo, Miss., authorities and immediately extradited to Georgia.\nAuthorities had been searching for Lee, 26, after five bodies were found in a LaGrange, Ga., home Saturday night.\nThe Troup County Sheriff's Office was asked to conduct a welfare check at the home in the 100 block of Woodstream Trail at about 10 p.m., when the bodies were found. Initially, deputies said four bodies had been found, but indicated a fifth victim had been found a few hours later.\nAuthorities said the victims could have been killed as early as last Wednesday. The GBI conducted autopsies on the bodies on Monday.\nThomas Jesse Lee, Christie Lee's husband, had been staying at the house. Police identified him as a suspect in the murders on Sunday.\nAccording to Troup County Sheriff James Woodruff, Lee was found at a bus station in Tupelo, Miss., shortly before 5 p.m. Monday. He was taken into custody without incident. Woodruff said that a church had helped Lee purchase a bus ticket to Opelika, Ala., unaware of his identity.\nAuthorities said that Lee freely gave his name to approaching officers. He was with the dog of the family he is accused of murdering, Woodruff said.\nInvestigators are still looking for the murder weapon used in the case. They are also working to determine a motive.\nLee's vehicle was recovered in Savannah, Tenn., which is between Memphis and Nashville. It was towed back to Troup County."}