{"uri": "http://www.wsfx.com/story/27995317/suspect-wanted-in-connection-to-lagrange-homicides-5-dead", "title": "Suspect wanted in connection to LaGrange murders", "dct": "Sun, 01 Feb 2015 14:01:00 GMT", "id": "c2d7f3e4091c411a06d0ecea3bf30ae2", "content": "LAGRANGE, GA (WTVM) - The search for a suspect wanted in connection to the grisly discovery of five bodies found in a LaGrange home came to an end on Monday.\nThomas Lee is wanted by Troup County Sheriff's officers, following the discovery of five bodies late Saturday. A search of the residence, located on the 100 block of Woodsteam Trail, in the Waters Edge subdivision, by investigators and GBI agents revealed five deceased victims, one male and four female, of an apparent homicide. The names of the deceased are:\nWilliam Burtron, male – age 69\nSheila Burtron, female – age 68\nChristie Lee, female – appx. age 33\nBailey Burtron, female – age 16\nIiaonna Green, female – age 18\nA wellness check on the residents of the home was made after they unsuccessfully tried to contact them. Once the deputies arrived, a forced entry was made into the home.\nLee, 26. He is described as a white male, blue eyes, about 6'3\", 190 pounds. Lee is possibly driving an olive green Mazda Tribute with Georgia tag number BRN0785. He was named as a suspect Sunday afternoon after first being called a person of interest in the case.\nWilliam Burtron's employers, the Walmart Distribution Center in LaGrange, are the ones that asked for a wellness check because he did not show up for work and they hadn't heard from him. The Burtrons were the homeowners, and Christie Lee was their daughter. Bailey Burtron was the daughter of Christie Lee, and Green was a friend of Bailey's who had recently moved in to the home.\nThere are currently no warrants out for Lee's arrest, but he could be charged with five counts of malice murder, a member of Troup County law enforcement told News Leader 9's Tesia Reed.\nThomas and Christie Lee were believed to be married, and had lived in the home for three years, according to Troup County Sheriff's Office Sgt. Stewart Smith. There were never any past incidents of domestic violence or any calls related to that to the home prior to this incident.\nTroup County Sheriff James Woodruff told Reed that along with being the husband of one of the victims, Lee and the family seemed like a nice, friendly, neighborly family, and that neighbors are shocked at the incident. Woodruff said that neighbors would often see Lee cutting the grass at the home.\nAll five bodies have been removed from the home. The GBI will be has suspended the investigation for Sunday, and the crime scene will be secured until some time Monday morning, according to Troup County Sheriff's Office Sgt. Stewart Smith. A deputy will be on the scene throughout Sunday night for the preservation of the scene. The victims have been taken to the GBI Crime Lab in Atlanta for autopsies Monday morning, and a cause of death will not be released until autopsies are completed.\nThis case and crime scene is active and anyone with any information about this case is asked to call the Troup County Sheriff's Office at 706-883-1616 or Crime Stoppers at 706-812-1000.This is a developing story. Stay tuned to WTVM.com for more details.\nCopyright 2015 WTVM. All rights reserved."}