{"uri": "http://www.local10.com/news/south-florida-woman-critically-injured-in-orlando-nightclub-massacre", "title": "South Florida woman critically injured in Orlando nightclub massacre", "dct": "Mon, 13 Jun 2016 13:23:00 GMT", "id": "25ba200122f555bc9783f16eb008c200", "content": "ORLANDO, Fla. - A South Florida woman is among the dozens others who were injured over the weekend during a mass shooting at an Orlando gay nightclub.\nAccording to friends of Laura Vargas, Vargas was shot twice in the back at Pulse Orlando.\nOur Lady of Lourdes Academy in Miami confirmed that Vargas graduated from the school in 2007. She also graduated from Florida International University.\n\"Our thoughts and prayers are with the victims and families of the tragedy in Orlando, especially Laura Vargas '07, who is currently recovering from surgery. #prayfororlando #prayforpeace,\" the school posted on Facebook.\nVargas is in critical condition.\nVargas' friend, Luis Vielma, 22, was with her at the club, but did not survive the shooting.\nAnother South Florida man, Jerry Wright, 31, was killed in the attack. He previously attended Westminster Christian School in Palmetto Bay.\nHis family lives in Pinecrest and is said to have traveled to Orlando to wait for their son's body to be released.\nLocal 10 News reporter Hatzel Vela spoke to one of the survivors Monday, Josean Garcia, who said he was with two women who were killed in the shooting, Mercedez Flores, 26, and Amanda Alvear, 25.\n\"When everybody started reacting, like they started ducking and the lights turned on and music stopped and the bullets just kept going and going -- that's when I noticed it was real and we all threw ourselves on the floor,\" Garcia said.\nGarcia said his friend, Bryan Lopez, was inches from him when bullets started flying.\n\"He was actually shoulder to shoulder with him and he got hit,\" Garcia said. \"The rounds stopped and that was my chance to run. And I ran through a back door and I escaped. When I got up and ran, I didn't look back.\"\nPolice in Orlando said 50 people were killed, including the gunman, who died in a gun battle with a SWAT team early Sunday.\nHe was identified as Omar Mateen, 29, an American-born Muslim who authorities said called 911 from the club to claim allegiance to the Islamic State group.\nPolice said Mateen opened fire inside the club with an AR-15 semi-automatic rifle.\nHe was fatally shot by police after authorities used explosives and a small armored vehicle to punch a hole in a wall and allow dozens of club-goers to escape.\nThe Children's Bereavement Center is a local resource to help families and friends who have lost someone close to them.\nAnyone in need of their services is asked to call 305-668-4902 or visit childbereavement.org for more information."}