{"uri": "http://www.orlandosentinel.com/news/pulse-orlando-nightclub-shooting/la-na-orlando-nightclub-restroom-survivors-20160614-snap-story.html", "title": "Survivor on Orlando gunman: 'He was not going to stop killing people until he was killed'", "dct": "Wed, 15 Jun 2016 00:14:00 GMT", "id": "427d15c56a48c1175bd04ab8286ce369", "content": "As Patience Carter and two friends cowered inside the handicapped bathroom stall, injured and pinned by a crush of bleeding bodies, the gunman who opened fire in the Pulse nightclub kept talking.\n“He said, ‘Are there any black people in here?’ I was too afraid to answer,” said Carter, who is African American.\nCarter continued: “There was an African American man in the stall with us... he said, ‘Yes, there are about six or seven of us.’ The gunman responded back to him saying that, ‘You know, I don’t have a problem with black people, this is about my country. You guys suffered enough.’”\nCarter, a slight 20-year-old NYU student from Philadelphia, had just arrived in Orlando, Fla., for her first night of vacation.\nOn Tuesday she and others who sought refuge in the side-by-side men’s and women’s restrooms during Sunday’s attack recounted how the gunman barked orders, claimed to have accomplices and laughed during the attack, which took 49 lives.\nThey also described how those trapped in the restrooms played dead, reached out to police by phone and tried to arrange their escape.\nCarter and Angel Santiago, a 32-year-old sales consultant, met with reporters at Florida Hospital in Orlando to recount the events that unfolded at the gay nightclub just after 2 a.m. Sunday.\nSantiago, lying atop a gurney, a white sheet draped over his lap concealing his wounds, said he and a friend crammed into a stall with 15 to 20 people as the gunfire rang out.\n“At one point, everyone was just like, ‘Shh, shh. Be quiet, be quiet.’ That’s when bullets started going through the stall wall toward us,” he said.\nSantiago was shot in his left foot and right knee, his friend in the chest. Then the shooting stopped and the gunman moved on.\nSantiago did not hear the gunman say anything, but Carter did. Omar Mateen, who was born in New York to Afghan immigrant parents, spoke in a foreign language, she said. Then he called 911.\n“Through the conversation with 911, he said that the reason why he was doing this was he wanted America to stop bombing his country,” she said. “So the motive was very clear to us who were laying in our blood and other people’s blood who were injured, who were shot — that we knew what his motive was. And he was not going to stop killing people until he was killed, until he felt that the message got out there.”\nCarter and a friend had gone to the bathroom in search of another friend when the shooting began and the trio fled into a stall. A man who had closed the stall door to shield the others was shot. Later, she heard the gunman complain, “Damn! It jammed,” as he fiddled with the gun.\nAs the hours went by, Carter said, the gunman yelled at people to shut off their cellphones. Some phones rang but went unanswered. “We were assuming because they were dead,” she said.\n“Every time a phone would go off or a text message [alert], he would say, ‘Where is it? Give it up,’” and hostages would have to hand over their phones, she said.\nOrlando Torres, 52, one of the promoters at Pulse, was trapped in a neighboring stall of the same bathroom with a friend. Torres said he drew upon his experience as a former auxiliary police officer in Queens, N.Y., and security guard at Orlando Regional Medical Center, where he and other victims would later be treated.\n“Three hours in that bathroom with that gunman, I’m surprised that we don’t have a bullet wound on us. We were protected, we were saved — it was just a miracle,” he said in an interview.\nTorres said the gunman called police to say, “America needs to stop bombing ISIS in Syria. He just wanted to repeat, only to get the message across. They were trying to ask him other questions and he wasn’t liking it. He wasn’t ready to give answers and so he hung up on them.”\nLater, he heard the gunman brag, “Yeah, I have a lot of bullets.”\nWhen Mateen started shooting into the neighboring stall, one of the wounded reached over and knocked Torres and his friend to the floor. They played dead. He felt something tap his pants pocket — it felt like the tip of gun.\n“I figured if I didn’t react, I’d look dead,” Torres said. “I thought he would shoot me after that. But he didn’t.”\nInstead, Mateen washed his hands and used the wall hand drier as they heard police arriving.\n“I’m thinking, when are they going to come in here? It took forever. I’m like, did they forget about us?” Torres said.\nRichard Aiken, 29, was also in the bathroom, and heard the gunman mention the mass shooting that killed nine African Americans at a church in Charleston last June.\n“He was just saying that he doesn’t have a problem with black people. He said, ‘You remember the thing that happened in South Carolina at the AME church?’” said Aiken, who is African American and originally from South Carolina.\nAiken was able to call his mother, then texted a friend at 3:14 a.m. who had escaped and was still outside near police. “What are they doing to get this person?” Aiken texted. “Can you ask? Maybe we could help.”\nAiken relayed what he and Carter had heard: that the gunman claimed he had an explosive vest, that snipers were positioned around the club, that he had a female accomplice playing dead among the wounded, armed with explosives.\n“How many gunmen are they? What they look like? Who is he?” his friend texted back.\n“One person in bathroom with us, sound like he has more than one weapon. We don’t know how he looks,” Aiken replied.\nAround 5 a.m. they heard a boom, and another boom. Aiken heard police on a loudspeaker: “Move as far away from the walls as you can.”\nAbout a minute later, he said, the gunman opened the stall door and looked in.\n“We made eye contact very briefly and I just put my head back down,” Aiken said, describing Mateen as having “a straight face.”\nThe gunman walked away, then quickly returned and fired into the stall, shooting men and women on both sides of Aiken.\n“That’s when the police exploded the wall, and the police and him exchanged gunfire,” Aiken said.\nAiken lost his best friend, Tevin Crosby, 25. He doesn’t understand why police waited to confront the gunman, why the off-duty officer who police said traded gunfire with him didn’t pursue Mateen when he retreated to the bathrooms.\nNorman Casiano, 25, another clubgoer trapped in a restroom, said hostages begged the gunman not to shoot, insisting they did not know who he was and had not seen his face.\n“All I heard was a laugh,” he said. “It was like a happy villain.”\nCarter, meanwhile, could only wait. At one point, she prayed to die.\n“I was just begging God to take the soul out of my body,” she said.\nAs the police broke through the wall, the gunman backed toward the stall, then scooted away.\n“He said, ‘Hey you!’ and shot another person, then another person who I’m told shielded me with their body,” Carter said. “I don’t know who that was, but thank you.”\nShe asked her friend Tiara Parker, 20, if she was shot. She was. So was friend Akyra Murray, who was sprawled on Parker’s lap, unresponsive.\nAs police entered, the hostages warned them about possible snipers, Carter said. A member of the SWAT team dragged her through the grass to an ambulance. A bullet had shattered a bone in her right leg and then entered her left leg. She didn’t realize her left leg was hit until paramedics cut her clothes off in the ambulance.\nWhen the shooting started, she and Murray had been standing in front of an exit and quickly stepped out. She persuaded Murray to go back in to find Parker, and they ended up in the bathroom. Murray, just 18, would die in the attack.\nCarter has spoken with Murray’s mother, who told her, “That’s OK. God has a plan.”\nBut Carter still feels survivor’s guilt. Of the more than 50 wounded, 33 remained hospitalized Tuesday, half a dozen in critical condition.\nAt the hospital Carter wrote a poem in a small notebook. “The guilt of feeling grateful to be alive is heavy,” she wrote, recalling “the other 49 who were not so lucky to feel this pain of mine.”\nShe read it and told the story of those hours in the bathroom without breaking down once. Then suddenly she sobbed uncontrollably as she was wheeled away.\nMORE ON ORLANDO SHOOTING\nHow the Orlando attack could mark a shift for gay Muslims\nA night of terror: How the Orlando nightclub shooting unfolded\nGunman had used gay dating app and visited LGBT nightclub on other occasions, witnesses say\nUPDATES:\n9:14 p.m.: Updated with new details and changes throughout.\nThis article was originally published at 2:37 p.m."}