{"uri": "http://www.wesh.com/news/multiple-shots-reported-at-downtown-orlando-nightclub/40017844", "title": "Orlando nightclub massacre deadliest shooting in modern U.S. history", "dct": "Tue, 14 Jun 2016 20:57:00 GMT", "id": "8a0690ad14f34bf0677f7bd02c7f922e", "content": "ORLANDO, Fla. —\nNew questions now surround what Omar Mateen's wife knew about the massacre plot and when.\nAccording to a NBC report Tuesday morning, Mateen's current wife told FBI she tried to talk her husband out of the Orlando gay club shooting and revealed she drove him to the club once to scope it out.\nAs the investigation into the Orlando mass shooting continues, the FBI is now looking into the possibility that Mateen, the 29-year-old gunman who killed 49 and injured 53 at a gay nightclub in downtown Orlando, planned to target Disney World as well.\nDisney security officials have told the FBI they believe Mateen visited Disney World on April 26 to conduct reconnaissance. A law enforcement official with knowledge of the investigation confirmed that the FBI is investigating.\nInvestigators don't know whether Mateen's wife, who was with him at the time, knew or suspected at the time about her husband's intent, the official said.\nThe massacre is now the deadliest mass shooting in modern U.S. history.\n>>Download the WESH 2 News app for iOS and Android\nMore than 300 people packed the club when Mateen stormed in, armed with a .223-caliber AR-type rifle and Glock handgun at around 2 a.m., federal authorities said.\nIn a video provided to WESH 2 News, more than 20 shots can be heard before the short clip ends.\nA high level law enforcement source told WESH 2 News Monday that an arrest in the shooting is possible.\n\"Everyone get out of Pulse and keep running,\" the club posted on its official Facebook page at 2:09 a.m.\nPolice said an officer working at the nightclub responded as shots rang out, and engaged Mateen in a gun battle. Mateen went deeper into the club, firing more shots.\nThe incident then quickly turned in to what police described as a hostage situation, and Mateen continued shooting inside the club.\nThree hours later, Orlando Police Chief John Mina said a decision was made to enter the building to rescue hostages. At that point, 11 Orlando police officers and three Orange County sheriff’s deputies exchanged fire with Mateen, who was killed.\nApproximately 15 people were held hostage in a bathroom, Mina said. Investigators continue to gather as much forensic evidence as possible.\n“The shooter inside the club is dead,” Orlando police posted on Twitter at 5:53 a.m.\nWitnesses said Sunday was not Mateen's first time in the nightclub. They said he had been a customer numerous times and that he also used a gay dating app.\nThe 11 Orlando officers and three deputies who fired their weapons were relieved of duty pending an investigation, as is standard practice in any officer-involved shooting.\n\"We have some of the most heroic and courageous SWAT team members around. They did a fabulous job and saved many, many lives,\" Mina said.\nMateen, an American citizen living in Florida, legally purchased the firearms within the past week, according to Trevor Velinor, assistant special agent in charge of the Bureau of Alcohol, Tobacco, Firearms and Explosives Tampa Field Office.\n\"This man held multiple security licenses -- he had an armed and an unarmed license. He passed a background check that every single person that purchases a firearm in the state of Florida undergoes,\" gun shop owner Ed Hensen said.\nAccording to ATF Special Agent in Charge Regina Lombardo, the ATF was able to trace the two weapons found at the scene. The weapons were traced to the last known purchaser, which was the shooter, officials said. Another weapon was also found in his vehicle. Investigators are working to trace that weapon, as well, Lombardo said.\nThe FBI has since taken over the shooting investigation.\nAgent Ronald Hopper said Mateen, who is from Fort Pierce, had been investigated by the FBI twice before.\nAccording to Hopper, Mateen made comments to co-workers in 2013 that indicated he had ties to terrorist organizations. In 2014, officials found that Mateen had ties to an American suicide bomber, Hopper said.\nLaw enforcement officials said that shortly before the shooting, Mateen swore allegiance to the leader of ISIS in a 911 phone call, in which he mentioned Boston Marathon bombers Dzhokhar Tsarnaev and Tamerlan Tsarnaev.\nSitora Yusuify, Mateen’s ex-wife, spoke with the FBI about her ex-husband Sunday night. During an interview in Denver, she described Mateen as violent and “very short-tempered.”\nYusufiy said Mateen wanted to be a police officer when they were married.\nMateen was the son of an Afghan immigrant who had a talk show in the United States, the nature of which was not entirely clear.\nHe attended evening prayer services at the city's Islamic Center three to four times a week, most recently with his young son, said Imam Syed Shafeeq Rahman.\nAlthough he was not very social, he also showed no signs of violence, Rahman said. He said he last saw Mateen on Friday.\nFBI director James Comey spoke in a news conference Monday, saying investigators saw no indication that the shooter was part of any kind of network, although Comey said there were \"strong indications of radicalization by this killer.\"\n\"We are so sorry for your loss and your suffering,\" Comey said. He went on to say that investigators are working to determine Mateen's motives and to find details about his life.\n\"You'll notice that I am not using the killer's name and I will try not to do that. Part of what motivates sick people to do this kind of thing is some twisted notion of fame or glory and I don't want to be part of that, for the sake of the victims and their families,\" Comey said.\nSen. Bill Nelson said Islamic State News claimed responsibility for the shooting. Law enforcement officials have not confirmed that information, however.\nPresident Barack Obama addressed the nation Monday, saying, \"We make it very easy for people who are troubled to get violent weapons.\"\nObama called the shooting an \"act of terror\" and an \"act of hate.\"\n\"Today marks the most deadly shooting in American history,\" Obama said.\nObama will travel to Orlando Thursday to pay respects to the victims, the White House said.\nThe president called for flags to be flown at half-staff at the White House and federal buildings until sunset Thursday.\nObama said Mayor Buddy Dyer and the people of Orlando will receive whatever help they need.\nDyer called Sunday “the most difficult day in Orlando history.”\nGov. Rick Scott declared a state of emergency in Orlando, calling the shooting \"heartwrenching\" and praising the efforts of first responders.\nThe Vatican said Pope Francis is expressing the \"deepest feelings of horror and condemnation\" over the mass shooting.\nVatican spokesman the Rev. Federico Lombardi said the pontiff denounces the \"homicidal folly and senseless hatred.\" He added that Francis joins the families and injured in the Sunday massacre in “prayer and compassion.”\nOrlando City Soccer said the following in an open letter to the City Beautiful on Monday: \"Our thoughts and prayers go out to the victims of Saturday’s senseless killings in an Orlando night club. At this time, we must all come together to support the victims’ families and their friends. We must also thank the police, the first responders and our partners at Orlando Health, who did so much to save lives.\" Click here to read the full letter.\nAnyone who believes they have a friend or family member that was inside Pulse during the shooting is asked to go to the Family Assistance Center, which will be located at the Beardall Senior Center on Delaney Avenue Monday. Family and friends can also call 407-246-4357.\nAfter a tragedy like this, there is help available to you. Counselors are on standby, whether you're grieving or just need someone to talk to. Call: 407-822-5036. Counselors are local and ready to talk.\nEvery person killed in the shooting had been identified by Monday night. A list of the victims can be found here.\nBarbara Poma, the owner of Pulse, said in a statement Sunday that she was \"devastated.\"\n\"Pulse, and the men and women who work there, have been my family for nearly 15 years,\" said Barbara Poma. \"From the beginning, Pulse has served as a place of love and acceptance for the LGBT community. I want to express my profound sadness and condolences to all who have lost loved ones. Please know that my grief and heart are with you.\""}