{"uri": "http://www.adn.com/alaska-news/nation-world/2016/06/15/for-orlando-homicide-detective-a-mass-shooting-turns-personal/", "title": "For Orlando homicide detective, a mass shooting turns personal", "dct": "Fri, 01 Jul 2016 00:00:00 GMT", "id": "f3b82870f99088a2b657dc6cb1ed1742", "content": "ORLANDO, Fla. – Nine body bags were laid out on gurneys when Danny Garcia Pagan arrived at the Orange County medical examiner's office. Bag by bag, he zipped them open and looked on the faces of the dead.\nGarcia Pagan, a homicide detective with the Orange County sheriff, had already spent several hours interviewing witnesses to the deadliest mass shooting ever to strike an American city, reliving the horror that had struck a vibrant gay nightclub just before closing early Sunday. Survivors recalled being stalked by the gunman, a 29-year-old security guard who pledged allegiance to the Islamic State. They recalled being struck by bullets, lying on the floor, playing dead.\nThose interviews had taken an emotional toll on Garcia Pagan. But that toll was about to get worse – and much more personal.\nAs he examined the bodies, he reflected on how the mostly Latino victims looked like members of his own family. Then Garcia Pagan came across a woman with purple lipstick and no name. Her personal effects revealed little about her identity.\nGarcia Pagan didn't know it at the time, but he would soon discover that, as is so often true of Latinos in central Florida, only a few degrees separated him from the lovely young woman on the stretcher, clad in her Saturday night dress and jewelry and adorned with a flower tattoo.\nThe rampage at Pulse nightclub killed 49 people in addition to the gunman and left 53 others injured. Hundreds of others witnessed the slaughter, and thousands have had to absorb the loss of a colleague, a relative, a friend. The shooting is also reverberating far beyond central Florida to communities in Puerto Rico, the Dominican Republic, Mexico and other parts of Latin America.\nAnd while the public has been stunned by the enormity of the crime, a vast network of first-responders – doctors, paramedics, victim advocates, crime scene investigators and law officers like Garcia Pagan – has had to work through the horror.\n\"Chaos is our normal,\" said Garcia Pagan, 43. \"We are the people behind the scenes trying to bring normalcy to the chaos for everyone else.\"\nGarcia Pagan had been sound asleep when the first call came at 4:50 a.m. Orlando police were counting bodies when Garcia-Pagan arrived at the scene about an hour later.\nHe was dispatched to the hospital to debrief the injured. Nearly all of them had been shot or injured by shattered glass. Most, like him, were native Puerto Ricans. Many spoke no English. Most of the officers on the scene spoke no Spanish. Garcia-Pagan quickly realized that he would have to interview many of the victims himself.\nAfter 15 years in law enforcement, four of them in homicide, Garcia Pagan said he's seen plenty of stories and talked to dozens of victims. He is usually inured to people's sad stories, listening only for the details that can be added to a crime report, the tiny nuggets of information that could help solve a case.\nOn Sunday, at the hospital, it was \"just a little different,\" he said. These stories were all the same: It was the last song. People by the bar were dancing, hugging, holding hands. The gunshots exploded to the rhythm of the music until people started dropping. They hid in closets, bathrooms and beneath bodies. Someone had to die for them to live.\n\"It doesn't hit you until you see their faces: They all have the same fear,\" he said. \"They are afraid, even sitting there with me in the hospital, that they could still be hurt.\"\nAfter a dozen interviews, Garcia Pagan handed over the information to Orlando police, who were leading the investigation. His next stop was the morgue.\nThe first few identifications were easy enough. He rifled through the pockets of the bodies, found driver's licenses. He took note of facial hair, distinctive jewelry, tattoos. Almost everyone matched up with a name from the list of the missing.\nSeven of the 11 bodies Garcia Pagan helped identify were from Kissimmee, a town known for Disney and all things \"boricua,\" or Puerto Rican. It's a place where streets are named after Puerto Rican icons, where grocery stores specialize in island favorites, where people watch boxing on 50-inch TVs mounted in garages tricked out with mini bars, dominoes tables and extra large Puerto Rican flags.\nThe young woman presented one of the few mysteries. She carried no identification. She matched none of the people who had been reported missing. All he knew about her was what he saw in the bag: A pretty girl in a black dress and a large gold necklace with two tattoos – a date of birth and a flower.\n\"Mary was a fighter,\" said her aunt, Elsa Shiner. \"That is why I cannot believe it. If she was in danger, I know for sure she would have run because she is thinking about her two kids and knows she has to go back home to them.\"\nGarcia Pagan said days like Sunday are hard to forget, and even harder to talk about. Once the bullets stop flying and the scene is cleared, images persist. Many cops, he said, try to bottle it up. But some things are too hard to hide."}