{"uri": "http://www.orlandosentinel.com/news/pulse-orlando-nightclub-shooting/os-pulse-shooting-police-response-20160625-story.html", "title": "Witnesses: Pulse shooter roamed club throughout ordeal", "dct": "Sat, 25 Jun 2016 20:27:00 GMT", "id": "fc6e18b7b2ca23b1ea852792bb6a3f09", "content": "Omar Mateen muscled the muzzle of his assault rifle through a crack in a bathroom door at the Pulse nightclub after shooting through it where Sylvia Serrano and others were hiding.\nSerrano, 49, said she and others tried to keep the door shut with their legs to prevent the gunman from coming in. She called her daughter, in what she thought would be her last goodbye, at 2:28 a.m. That's when the gunfire started again.\nVictims trapped in the gay nightclub said they remember Mateen darting around, pacing between the club's three bathrooms, and opening fire sporadically for as long as 90 minutes.\n\"I don't know why they didn't come in to save us sooner,\" said Serrano, of Deltona, who was rescued about a half hour into the ordeal. \"He just kept shooting and shooting.\"\nTheir accounts of gunfire contradict Orlando Police Department Chief John Mina, who on Friday said it is \"not accurate\" to say there was shooting until 2:30 a.m.\nHe said officers entered the club at 2:08 a.m. and \"methodically searched\" the building, rescuing victims until they encountered Mateen sometime between 2:10 a.m. and 2:18 a.m. near the back bathrooms. They fired at Mateen, and he retreated into the bathroom with hostages, Mina said.\nMina added that none of the witnesses who have given sworn testimony so far have said the shooting lasted until 2:30 a.m.\n\"It's not uncommon for people to have different perceptions of time, different vantage points and other points of view,\" he said.\nAs more survivors share their accounts, questions about the tactical decisions — such as when the operation shifted from an active shooter incident to a hostage situation, and why police didn't follow Mateen into the bathrooms where dozens were gravely injured — remain unanswered.\nAfter repeated requests by the Orlando Sentinel, the City of Orlando would not release OPD's policies and procedures for responding to active shooters, hostages and barricaded subjects, citing a public records exemption for \"any comprehensive inventory of state and local law enforcement resources.\"\nSince the early stages of the investigation, though, Mina has been adamant that no gunfire erupted in the nightclub during the time the situation turned from an active shooter situation into a nearly three-hour hostage situation.\nOrange County Sheriff's Office deputy statements released Saturday offer more detail about what was happening outside the club, but none of the reports came from the 21 deputies who worked with OPD's SWAT team inside, where most of the shooting happened. The incident reports describe a chaotic scene with many casualties and \"individuals running out of the club covered in blood with gunshot wounds.\"\nFurther clarity may not come until the FBI and the Florida Department of Law Enforcement complete their investigations into the shooting that killed 49 people, allowing his department to conduct its own internal review, Mina said.\nAt that time, OPD will release a detailed action report, modeled after the one done by the Aurora Police following the 2012 theater shooting in Colorado.\n'Screaming and moaning'\nIt was another busy evening at Pulse for \"Latin Night,\" a signature event that brought 300 people to dance and drink at the club — until the first shots erupted in the middle of the dance floor right before closing.\nOff-duty Orlando Police Officer Adam Gruler, who was hired by Pulse for a security detail, traded gunfire with Mateen at 2:02 a.m. near the entrance but didn't go inside until more officers arrived at 2:08 a.m. and fired on the shooter.\nJason Cornwell, an officer with neighboring Belle Isle Police Department who was among the first responders, told The Washington Post that he searched for Mateen in those critical moments but couldn't find him and never fired his gun. Another Belle Isle Officer, Justin Lemieux, said he arrived on scene about 2:15 a.m. and heard gunshots.\nLemieux said he heard Cornwell over the scanner about 2:35 a.m. saying Mateen was barricaded in a bathroom.\nA responding officer aiming at Mateen couldn't get a clean shot as the crowd rushed toward him, said security guard Neal Whittleton, who helped rush dozens of people out of the 4,500-square-foot venue through a back door. Patrons streamed out the back patio and trampled a fence.\nPulse regular Chris Littlestar, 25, ran to the bathroom right after hearing gunshots. He said he was shot in the abdomen five times, after Mateen opened fire on the bathroom stall twice, about 15 minutes apart.\n\"[Mateen] went back out toward the dance floor and was still shooting — I'm not sure if it was him or the police, I just know I heard a whole bunch of gunshots more ... half of us were in pain, the other half was dead,\" said Littlestar, who hid under the bodies of those killed in the first round of shooting to shield himself from bullets in the second. \"People were screaming and moaning.\"\nI'm not sure if it was him or the police, I just know I heard a whole bunch of gunshots more ... half of us were in pain, the other half was dead — Chris Littlestar, Pulse shooting survivor\nAnswai Bennett, 25, who was in the same bathroom as Littlestar, said he remembered the gunman entering twice. He wasn't hurt in the first round of shooting but got hit during a second one, which he estimated happened about an hour into the hostage situation. He called his aunt at 3 a.m. to tell her he was hurt, but couldn't recall exactly how much time had passed.\nOrlando Torres, 53, was in a bathroom across the hall from Bennett and Littlestar. He said the gunman shot into a stall at the beginning of the siege and then about an hour and a half in, at about 3:30 a.m. He said he wasn't looking at a clock but was recording some of the events on his phone, which he has since turned in to the FBI.\nSerrano and her friend Katherine Patricio, 32, were lying on the floor of a bathroom on the other side of the club, near the dance floor and patio door. From the bathroom, Serrano said she heard Mateen firing near the dance floor then the sounds of gunshots got farther away after 2:15 a.m., when she made her first phone call to her daughter.\nShe said after the phone call, she heard several people outside the bathroom trying to run out of the club. She heard Mateen return and the club-goers begging for their lives before he shot them. Then she called her daughter again nearly 15 minutes later — to say goodbye.\nTime matters\nThe 1999 shooting at Columbine High School in Colorado marked a paradigm shift in the way police agencies respond to active shooters — from contain and negotiate to respond and confront as quickly as possible, according to a 2014 study by the Police Executive Research Forum, a nonprofit policy organization in Washington D.C.\nPICTURE GALLERY: Orlando residents continue to recover after the mass shooting at Pulse nightclub that left 49 victims dead and another 53 injured. Anti-Westboro Church protestors lined up downtown to block them from family members and friends attending shooting victims funerals.\nThe report distinguishes active shooter situations, in which people \"aim to inflict mass casualties as quickly as possible, usually in a matter of minutes\" from hostage situations, which involve \"threats by persons who have barricaded themselves in a building or protected area but are not actively harming anyone.\"\nFrom 2000 to 2013, there were 63 mass shooting incidents that authorities were able to time — 70 percent of which lasted 5 minutes or less, with 23 ending in 2 minutes or less, according to the FBI. The agency could not determine times in all 160 cases.\nMost of those shootings, however, also ended with the suspect either committing suicide or fleeing the scene before police arrived — unlike the Pulse case.\nIn Orlando, city and state officials have been quick to praise Orlando police officers for their heroic actions. As Mateen barricaded himself, officers went into the club numerous times to rescue wounded victims, piling at least 20 victims into an unmarked police pickup.\nAfter Mateen made threats to strap people with bomb vests within 15 minutes, police decided to breach the bathroom starting at 5:02 a.m., the FBI timeline said. There were calls of shots fired at 5:14 a.m. and Mateen was killed in a firefight with SWAT team members.\nSWAT Commander Mark Canty, who directed the operation, said more answers will emerge after he formally talks to officers involved in the initial response.\n\"I think we are going to look at every aspect of it,\" he said.\"We're going to look at the entire event and kind of critique it … where can we improve and what our strengths were.\"\necherney@orlandosentinel.com; chayes@orlandosentinel.com; or dharris@orlandosentinel.com"}