{"uri": "http://wiat.com/2016/11/18/armed-and-dangerous-suspects-in-shooting-of-6-year-old-girl-identified-still-at-large/", "title": "Suspects in shooting of sleeping 6-year-old surrender to Bessemer police", "dct": "Fri, 18 Nov 2016 16:14:00 GMT", "id": "2f104f5a21b120d228de7fd9b50b7d6f", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nBESSEMER, Ala. (WIAT) — UPDATE: Police say the two suspects surrendered Monday at the Bessemer police department.\nOfficials say the 6-year-old’s condition is improving, and she is scheduled to undergo a second surgery today.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nORIGINAL: Two suspects have been named in the investigation into two shootings this morning that left a 6-year-old girl in serious but stable condition in the ICU.\n6-year-old Alexis Talley was shot in the back while sleeping in a Bessemer home when someone shot into the house.\nWarrants have been obtained for two suspects in the shooting of Alexis as well as another male victim who was shot just before she was. The two suspects are identified as 20-year-old Deanthony Shiquan Billingsley and 21-year-old Cardamien Demun Braxton Cooper of Hueytown. They have warrants for their arrest on two counts of attempted murder and one count of shooting into an occupied dwelling.\nBessemer police Lt. Cortice Miles said both suspects have extensive records with violent-type crimes. He said if you see them, do not approach. He explained they are absolutely still armed, and very dangerous. Both are believed to still be in the area of Jefferson County, but Miles emphasized no matter where they try to hide, “we will find you…if you don’t turn yourself in, we will find you.”\n“They’re trying to hide, but they can’t hide long,” Miles said. Miles seemed especially determined to capture the suspects, who he said were careless and reckless shooting into an occupied home like they didn’t understand that bullets have to go somewhere when you shoot them.\nOfficials believe the two shot the male victim around 11:10 p.m. over a dispute, then shot into the home. Officers were called back to the home around 1:30 a.m.; it appears the child did not wake up when she was shot, and woke up later complaining of stomach pain.Her mother, fearing her child was shot, called 911. She was taken to the hospital in serious condition, and is now stable in the ICU. The male victim’s injuries are not life threatening.\nMiles said police do not believe the shootings to be gang-related, and have an idea of what the dispute is about.\nBoth suspects are armed and considered to be dangerous. Please call 911 or local law enforcement if you see them or know any information about their whereabouts.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}