{"uri": "http://www.wsbtv.com/news/local/atlanta/14-year-old-shot-left-for-dead-outside-abandoned-home/483614439", "title": "14-year-old shot, left for dead outside abandoned home", "dct": "Thu, 12 Jan 2017 08:37:00 GMT", "id": "f347d2d9b0466c10199e31bdb820b443", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nATLANTA - Investigators are trying to figure out who shot a 14-year-old and left him outside a northwest Atlanta abandoned home.\nAtlanta police said they were called to the house along Fairburn Road shortly after sunset Wednesday night.\nPolice said when they arrived, the boy was bleeding profusely as he laid outside the home.\n\"Witnesses say they saw one person running from the scene,\" Sgt. Warren Pickard with the Atlanta Police Department told Channel 2’s Nefertiti Jaquez.\nJaquez talked to the boy's grandmother, Emma Pullins, who said Holley lives with her at a home down the street from the crime scene.\n\"I heard the gunshots and I jumped up,\" Pullins said.\nAt the time, Pullins had no idea it was her grandson someone shot.\nThen seconds later, Pullins said she heard a knock on the door.\nTRENDING STORIES:\n\"He didn't go around messing around or getting into any trouble. He always stayed at home and went to school,\" Pullins told Jaquez.\nBut as the victim made his way back home from running an errand police said someone opened fire on the Forest Hill Academy student.\n\"He's a very quiet child and you don't see him running around with a group of kids,\" neighbor Elaine Allen told Jaquez.\nAs news spread of the shooting, many neighbors said they were stunned that the teen was the latest victim in series of shootings that have happened around the neighborhood.\n\"When we are sitting in our home at 11 o’clock at night and you hearing gunshots, I don't know to drop to the ground or not because bullets have somewhere to go,\" neighbor Christy Kendrick said.\nAs for the victim's grandmother, Pullins said her grandson told her he was allegedly being bullied and harassed by others in the neighborhood.\nAt last check, the boy remained in intensive care, but was alert and talking.\nAnyone with information about the shooting is asked to call police, or call Crime Stoppers at 404-577-8477.\n© 2017 Cox Media Group."}