{"uri": "http://themercury.com/articles/manhattan-man-sentenced-in-april-shooting", "title": "Manhattan man sentenced in April shooting", "dct": "Thu, 12 Dec 2013 00:00:00 GMT", "id": "e50ca58815ad3914010274cfe1eb88e4", "content": "A Manhattan man convicted of murder was sentenced to life in prison Thursday afternoon. Matthew Wilson, 43, was sentenced in Riley County District Court to life imprisonment in addition to consecutive sentences that totaled 310 months, or nearly 26 years.\nWilson was convicted of one count of first-degree murder, two charges of attempted first-degree murder and two charges of aggravated battery for an April 7 shooting that killed one person and injured four others outside an apartment complex at 900 Garden Way.\nWilson was accused by the state of killing Fort Riley soldier Michael Lowery, 23, and shooting the other occupants in 900 Garden Way, No. 9 – Alexya Mailea, Christine Kim, Dustin Ferguson and Joel Solano – as they were leaving a party at Ferguson’s and Solano’s apartment in the early morning hours that day.\nIn October, Wilson pleaded no contest to his charges.\nThe state alleged that at 4 a.m. on April 7, Wilson started shooting at Lowery, Ferguson, Mailea and Kim as they exited the apartment. Solano was asleep in the apartment at the time with his partner and their young daughter.\nProsecuting attorney Barry Wilkerson said in court that Solano accidentally fatally shot Lowery when Wilson barged into the apartment and shot through Solano’s locked bedroom door.\nWilson lived next door to Ferguson and Solano in No. 10 and complained to a witness that he was tired of the men partying.\nThe occupants of No. 9 had gathered the night before to watch movies and hang out with Ferguson.\nWilson tearfully apologized to the victims and their families in a packed courtroom.\nHe said he didn’t remember the shooting and that he didn’t know why he did it.\nHe said he had lost a battle with mental illness and alcoholism, but that he hoped his sentence would satisfy the victims’ need for justice.\nIn addition to his consecutive sentences, Wilson will also pay a restitution of nearly $60,000 with his assets."}