{"uri": "https://usgunviolence.wordpress.com/2013/08/18/mass-shooting-killed-jefferson-rex-rivers-chesterfield-county-sc/", "title": "Mass Shooting – Killed – Jefferson Rex Rivers (Chesterfield County, SC)", "dct": "Sun, 18 Aug 2013 00:00:00 GMT", "id": "71a71fea433c7a3c734494008ce6420a", "content": "CHESTERFIELD COUNTY, S.C. — The owner of a Wadesboro club and pool room, Jefferson “Rex” Rivers, was shot and killed at a night club in Chesterfield County, S.C., early Sunday morning.\nRivers also owned The Twisted Rooster, where he was killed after a fight broke out in the club.\nRivers’ family members told WSOC-TV in Charlotte that after he broke up the fight and threw several individuals out of the club, the men returned with guns and began shooting.\nAnson County Sheriff Tommy Allen said that his deputies were notified of the shooting by the Chesterfield County Sheriff’s Office shortly after 2 a.m. Sunday. The Chesterfield authorities gave a description of a suspect vehicle that could be headed to Anson County. Wadesboro police officers later spotted the vehicle and attempted to stop it.\n“The condition of the other four shooting victims is unknown but not believed to be life threatening,” Sheriff Allen said Monday morning.\nTwo of the other four victims are juveniles; one 15 and one 17. The seventeen year old was shot “through and through the forearm,” said Scott. He has been released from the hospital and was able to return to school in Lancaster County last week. The other juvenile is out of the hospital and has returned to school as well. However, a bullet remains lodged in his back, near the spine.\nThe other two victims, both shot in the forehead, remain in critical condition. They are Malcolm Staton of Polkton, N.C., and Nigel Bivens, 19, of Marshville, N.C.\nhttp://www.ansonrecord.com/news/home_top/2360871/Wadesboro-club-owner-killed-in-S.C.-shooting\nhttp://myfox8.com/2013/08/18/5-shot-1-killed-in-sc-shooting-suspects-sought-in-nc/\nhttp://www.thecherawchronicle.com/news/home_top-news/2382466/Five-victims-five-arrested-in-club-shooting\nhttp://www.wsoctv.com/news/news/local/chesterfield-co-investigators-search-2-shooting-su/nZR5g/"}