{"uri": "https://usgunviolence.wordpress.com/category/where/california/page/64/", "title": "Shot in the USA: Gun Violence After Newtown", "dct": "Tue, 17 Sep 2013 00:00:00 GMT", "id": "58ef227bfd7fbb77070db99696e7a46b", "content": "STOCKTON, CA – A second victim died after being critically injured in a shooting outside a supermarket on Tuesday night.\nFive people were shot outside Danny’s Market on the corner of N. Airport Way and E. Park Street around 9:45 p.m. Tuesday after a suspect walked up to the group in a parking lot.\nAntoine Kelly, 26, died the night of the shooting. The second victim, a 22-year-old Oakland man who was previously listed in critical condition, died from his injuries on Friday night, Stockton police said.\nA 26-year-old Stockton man died in a shooting that left one person in critical condition and three others hurt but listed as stable after several gunmen opened fire outside a market.\nAntoine Kelly died Tuesday night in the Stockton shooting in the 700 block of North Airport Way, near East Park Street.\nPolice said the victims were standing in a parking lot about 9 p.m. at Danny’s Market when three to four people walked into the lot wearing dark hooded sweatshirts and opened fire.\nAt approximately 9:45 p.m., the suspected shooter walked up to a group outside Danny’s Market on the corner of N. Airport Way and E. Park St. and opened fire, Stockton Police Officer Joe Silva said.\nFour other men were taken to an area hospital with gunshot wounds. One of the men, a 22-year-old individual from Oakland, was listed in critical condition, said Silva. The three other gunshot victims, a Sacramento man, 23, an Oakland man, 34, and a Stockton man, 30, are were all listed in stable condition.\nhttp://www.kcra.com/news/local-news/news-stockton/multiple-victims-reported-in-stockton-market-shooting/21992392\nhttp://www.kcra.com/news/local-news/news-stockton/multiple-victims-reported-in-stockton-market-shooting/21992392\nhttp://www.recordnet.com/apps/pbcs.dll/article?AID=/20130919/A_NEWS/309190322/-1/A_COMM01\nhttp://www.news10.net/news/article/258102/2/2nd-person-dies-in-Stockton-supermarket-shooting"}