{"uri": "http://www.courier-journal.com/story/news/local/2016/09/02/man-shot-friday-homicide-tally-reaches-80/89675736/", "title": "Man shot Friday, homicide tally reaches 80", "dct": "Fri, 02 Sep 2016 00:00:00 GMT", "id": "09d32ff92b35d521e365b3bd96a36a8a", "content": "With four months still left in the year, Louisville has reached 2015's decades-high count of 80 homicides.\nThe grim statistic puts the city on pace to top 100 slayings, a level of deadly violence not seen in Louisville since at least the 1970s.\nIn the latest killing, Donald Box, 45, was shot just after 8 p.m. Friday inside his mobile home in the 1300 block of Woodchester Way, said Louisville Metro Police spokesman Dwight Mitchell.\nMitchell on Saturday said police arrested Joshua R. Goodman, 29, and charged him with murder and tampering with physical evidence. He said the police investigation suggested Goodman entered Box's home looking for Box's father, and when he was asked to leave, the two men got into a verbal altercation that led to Goodman pulling a gun and firing.\nA violent August accelerated the homicide tally's growth. Seventeen people were killed last month – the highest monthly total since at least January 2013, police data show.\nA 60th birthday party in the Parkland neighborhood turned deadly Aug. 9 when two were shot and killed. Apparent drugs deals that turned violent claimed two lives.\nA 14-year-old was shot in the back of the head by a friend Aug. 24 during what police called a gang-related drive-by shooting. The next day, two young men were gunned down blocks away near Shelby Park in the middle of the afternoon.\nThe month ended with a couple from Bardstown found shot dead in a car in Beechmont.\nThis year's deadly violence builds on a disturbing jump in homicides last year, which was the deadliest year since 91 homicides were recorded in 1979, police statistics show.\nThe highest homicide count, according to police data on 1960 to the present, came in 1971 when 110 people were killed countywide. The 80 count includes only cases investigated by LMPD. As of Sept. 2, six additional homicides were recorded by other police departments in Jefferson County.\nGun fatalities account for the majority of those killed, about 80 percent. Five were stabbed to death. Eight were beaten. A little boy perished after he was left alone for hours in a hot car.\nCombating the rise in homicides – and shootings, which are up 99 percent over 2014 (year-to-date through July) – won’t fall solely on the shoulders of police, said LMPD Chief Steve Conrad last week when he called for the killings to cease.\n\"… violent crime is not just a police problem,” he said. “It's a community problem and we all must come together and work together to do what we can to resolve these underlying issues that lead young people to become involved in criminal activity.\"\nMore emphatically than he has in the past, Conrad recently publicly linked at least some of the homicides to gangs, as well as the more often-cited narcotics.\n“We do have gangs in our community. Gangs are involved in criminal activity here,” he said. “And they do contribute to at least part of the violent crime that we have seen in our community, particularly here lately.\"\nAnd while saying that many gangs are involved in drug trafficking, he cautioned against linking all drug dealers to gang activity.\nTestifying before the Louisville Metro Council earlier this year on the rising body count, the chief also attributed poverty, easily accessible firearms and the failure of local institutions such as families and churches that were supposed to shield youth.\nEarlier this year, the homicide unit expanded by eight detectives and took over investigations of both fatal and non-fatal shootings.\nThirty-three of this year’s 80 homicides were unsolved as of Saturday.\nReporter Matthew Glowicki can be reached at 502-582-4989 or mglowicki@courier-journal.com.\nAbout the 80\n»Eleven of those killed were juveniles.\n»The majority, 61, were between ages 18 and 44.\n»Nearly three-fourths killed were men. Two of every three people killed were African-American.\n»Almost all of those charged in the killings are men and about three-fourths are black.\n»Almost all of those accused in this year’s killings are 34 or younger, including at least six juvenile defendants.\n»The Shawnee neighborhood has seen the most homicides with seven, followed by Parkland, Shelby Park and Beechmont at five and Russell, Chickasaw and South Louisville at four.\nSources: LMPD data, Courier-Journal analysis"}