{"uri": "http://www.courier-journal.com/story/news/crime/2016/08/24/multiple-people-injured-smoketown-shooting/89311892/", "title": "Teen killed, 2 wounded in Smoketown drive-by", "dct": "Wed, 24 Aug 2016 00:00:00 GMT", "id": "8130871b942876faa10e8e9d49ffce11", "content": "Police aren't yet sure if a 14-year-old killed in a drive-by shooting Wednesday night in the Smoketown neighborhood was an intended target.\nTroyvonte Hurt, a Minor Daniels Academy student, along with a 16- and 24-year-old were shot as they stood on the corner of Clay and Jacob streets around 8:45 p.m. Wednesday.\nHomicide Unit Lt. Todd Kessinger said his detectives haven't determined a motive in the case but noted the shooting took place in a \"well-known narcotics area\" and that drugs were found on the street at the scene.\nAbout 15 to 20 people were on the corner when gunfire – likely from multiple weapons – rang out, witnesses told police.\n“It’s a situation where a 14-year-old gets killed in front of 20 people and when the police get there, nobody saw or heard anything,” Kessinger said at a Thursday news conference.\nHe added that police have received information through some interviews and via the anonymous police tip line but that key witnesses have stayed silent.\nAnd while Kessinger said he understands the sentiment that his investigators ultimately need to solve crimes, he stressed that \"it’s your neighborhood, and you need to help us solve these cases.\"\nHurt died at the shooting site of a single gunshot wound to the head, said deputy coroner Larry Carroll. The teen's death marked the 73rd homicide case investigated by Louisville Metro Police this year, according to a Courier-Journal count.\nThe two others who were shot were taken to the University of Louisville Hospital and are expected to survive. They've spoken to police, Kessinger said, but their accounts weren't detailed.\nHurt was a student at Minor Daniels Academy, a middle-high alternative school in the West Buechel neighborhood, said Jefferson County Public Schools spokeswoman Jennifer Brislin. He had been at the school for a week after previously attending Meyzeek Middle School.\nBrislin said Hurt played basketball at Baxter Community Center, received job skills training for two years from Project One, a Louisville-area summer jobs program, and was involved with programs at the Boys and Girls Club last year.\n“We have grief counselors at both the schools who will be able to assist students and staff who want to talk,\" Brislin said. \"They will be there as long as people need”\nShawn Donigan, president of West End Yellowjackets football team, said Hurt played on the team for four or five years.\n\"He wasn’t a superstar but he really hustled,\" Donigan said. \"He gave his all.\"\nDonigan said he knows the family, which had a \"long history\" with the team.\n\"We are just in shock,\" Donigan said. \"You never would have thought something like this would happen to him.\"\nKessinger didn't release any suspect information or details about the car involved in the shooting.\nAnyone with information is asked to call the anonymous police tip line at 502-574-5673.\nReporter Allison Ross contributed to this report. Justin Sayers can be reached at 502-582-4252 or jsayers@gannett.com. Reporter Matthew Glowicki can be reached at 502-582-4989 or mglowicki@courier-journal.com."}