{"uri": "http://www.pe.com/articles/riverside-817173-condition-woman.html", "title": "Four people shot, one stabbed at Riverside party (UPDATE 2)", "dct": "Thu, 03 Nov 2016 12:07:00 GMT", "id": "dae5e98a4eacf4d63751136a7c048818", "content": "Updates with more details from police, report of stabbing\nOne person was stabbed late Friday night, Oct. 28, and four others were shot early Saturday at a party at a Riverside shopping center, the Riverside police and fire departments said.\nTheir injuries were not life threatening, police said. A 19-year-old woman was initially believed to be in critical condition. The other victims' ages were 19, 24 and unknown, the Fire Department said in a news release.\nA crowd of 75-100 people had gathered in the 3500 block of Madison Street just west of the 91 Freeway, a Riverside police news release said.\nThen just before midnight, Corona police officers were at Corona Regional Medical Center when a stabbing victim was dropped off by someone who then drove off. Police detained the vehicle's occupants and learned that the victim was stabbed at the Madison party, the release said.\nRiverside police then went to the Madison address about 1 a.m., the same time other officers were dispatched to a report of a loud party there, the release said. As officers approached, someone began shooting.\nThe officers were not targeted by the shooters, police Lt. Charles Payne said.\nOfficers found the four victims and detained the partygoers. Officers searched the business where the party was happening and found five hidden guns -- three that were stolen -- as well as what the release described as evidence related to the stabbing.\nRiverside Police Lt. Mark Rossi said one person has been arrested on suspicion of possessing illegal narcotics. He said it was not yet known Saturday night whether that person was involved in the shooting.\nNo one, police Officer Ryan Railsback said, could describe the shooter or stabber.\nStaff writer Alex Groves contributed to this report."}