{"uri": "http://www.santacruzsentinel.com/general-news/20161119/sheriffs-deputy-shoots-kills-knife-wielding-teen-after-two-stabbed-outside-watsonville", "title": "Sheriff’s deputy shoots, kills knife-wielding teen after two stabbed outside Watsonville", "dct": "Sat, 19 Nov 2016 19:25:00 GMT", "id": "a32d051fd962164b7dfaa75f7d896369", "content": "Jan. 5: Howard Atkinson shot to death his sister-in-law, 22-year-old Cherish Villapia of Iowa, in his apartment on the 100 block of Chestnut Street in Santa Cruz, police said. Atkinson, a 35-year-old who recently moved to Santa Cruz from Texas, then fatally shot himself. Police believe it was a murder-suicide, yet no motive has been established.\nAug. 23: Joseph Shuemaker, 24, is shot and killed on the west levee of the San Lorenzo River by an associate during an argument. Nino Ruiz, 27, and Jenessa Kic, 31 were arrested in connection with the shooting four hours later as they emerged from a house on the 300 Block of Leibrandt Avenue. Cristobal Natividad, 41, also was arrested Sept. 20 and charged as an accessory in the homicide.\nSept. 22: Ernesto Leiva, a 23-year-old Santa Cruz man shot in the upper torso on Broadway and Pennsylvania in Santa Cruz.\nSept. 26: Santa Cruz police discover the body of Shannon Magner, 66, of Aptos, in an apartment on the 800 block of Front Street. An autopsy reveals stab wounds to the back of her neck. A possible suspect is identified but remains on the loose.\nOct. 16: A Santa Cruz police officer shoots and kills 32-year-old Sean Arlt in the 200 block of Chace Street after he threatens them with a metal bow rake.\nNov. 19: Santa Cruz County sheriff’s deputies shoot and kill a suspect after two others were stabbed at a house on the 800 block of Amesti Road outside Watsonville. The victim was found on the 300 block of Pioneer Road.\n(Updated 3:25 p.m.) WATSONVILLE >> A 15-year-old boy is dead after an officer-involved shooting early Saturday morning on the 800 block of Amesti Road, outside Watsonville.\nIt is the second deadly shooting by law enforcement in Santa Cruz County in 34 days.\nSanta Cruz County Undersheriff Jeremy Verinsky said at 2:53 a.m., two people were stabbed in the rural neighborhood of Amesti and Pioneer roads. He declined to say what the motive was or if any of the three were related.\nThe victims were found inside a six-bedroom house on the 800 block of Amesti. One suffered critical injuries. Another suffered serious injuries. Both were taken to trauma centers, via air ambulance. One of the victims was described by paramedics as a 60-year-old man. Both are expected to survive.\nThe suspected stabber was at the scene when deputies arrived. He climbed on top of a fire truck where deputies talked to him briefly before he fled the scene, according to law enforcement.\nVerinsky said within 10 minutes deputies, officers from various police agencies found the teen not far from the scene, on the 300 block of Pioneer Road, still armed with the knife.\n“Efforts were made to engage with the suspect to diffuse the situation and various less-lethal weapons were tried,” Verinsky said. “When the suspect advanced on deputies with his knife, he was shot at least once.”\nBy 3:16 a.m., deputies called for a third ambulance for a victim of a gunshot.\nParamedics, who were standing by, treated the suspect, but he died at the scene, Verinsky said.\nThe teen was found with a silver pocket knife.\nSheriff Jim Hart said they tried to subdue the teen with Tasers, more than one weighted foam round and other means of subduing the suspect before a deputy fired one lethal round.\n“These cases are very upsetting,” Hart said.\nHart said he did not know if the stabbing was gang-related and could not release the name of the shooting victim because he had not been able to notify the family.\nHart said an unidentified number of deputies are on paid leave after the shooting but declined to provide further information. He said there is body camera footage from the deputies and he will provide that at some point. In the meantime, Hart said he had turned the case over to the Santa Cruz County District Attorney’s Office.\n“The Santa Cruz County Sheriff’s Office never wants to use deadly force of any kind, but on 11/19/2016 shortly before 3 a.m., a deputy fired his service weapon to protect himself and the community,” Verinsky said.\nAdvertisement\nThe area of the incident is a quiet, rural neighborhood filled with a mix of homes, some in the million-dollar range. It’s located near the popular Four Corners area of Corralitos.\nNeighbors said three men rented the split-level home, all working in construction and are “quiet neighbors.” There were two pickups from Knox Roofing in the driveway.\nOne of the neighbors had dined with the men and called them “respectable.”\nThe men who lived in the house have kids in the area, but the kids don’t live at the house, neighbors said. None of the neighbors heard anything early Saturday morning.\nTim Crandall, a local pastor at a nearby church, said he did not know the men. He said he didn’t hear any gunshots but was roused when his dogs barked.\nNeighbors said, “This is a quiet, peaceful place. Things like this don’t happen around here.”\nNeighbors said they had more questions than answers about what happened.\nThe family who lives at the house on the 300 block of Pioneer Road where the man was shot and killed, said she was asleep when they heard a man run through the front door of their one-story house. He ran through the house and out a side door facing Pioneer Road.\n“The man entered my house about 3:05 to 3:08 a.m. I heard his steps,” she said.\nThe woman who lives at the house said she did not see the man and in fear gathered her family, her three young children and her husband, in the back bedroom.\nThe woman, who spoke Spanish and asked not to be identified, said she thought she heard the police yelling “Look nice.” She then heard the man saying, “OK. OK. OK.”\nShe heard three gunshots next. The first two weren’t loud, she said. “The third was very loud.”\nAfter talking to authorities, she saw the man dead in the grass between her fence and Pioneer Road. She said law enforcement stayed at the scene for about 30 minutes and returned later that morning.\nAnother neighbor on Pioneer Road said he woke up when he heard sirens.\n“It happens. It just happened here,” he said of the normally quiet farming neighborhood.\nSheriff’s deputies remained at the scene Saturday afternoon. Just before 1 p.m., Santa Cruz County sheriff’s office forensics vans left the area.\nThe shooting marks the sixth homicide in the county this year. Five have occurred in Santa Cruz. One in the unincorporated area of the county.\nIn July of 2015, sheriff’s deputies shot and killed a Boulder Creek on teenager after they said pointed a loaded rifle at them. Deputies were cleared of any wrongdoing in the killing of Cyrus Hurtado.\nSANTA CRUZ COUNTY HOMICIDES 2016\nJan. 5: Howard Atkinson shot to death his sister-in-law, 22-year-old Cherish Villapia of Iowa, in his apartment on the 100 block of Chestnut Street in Santa Cruz, police said. Atkinson, a 35-year-old who recently moved to Santa Cruz from Texas, then fatally shot himself. Police believe it was a murder-suicide, yet no motive has been established.\nAug. 23: Joseph Shuemaker, 24, is shot and killed on the west levee of the San Lorenzo River by an associate during an argument. Nino Ruiz, 27, and Jenessa Kic, 31 were arrested in connection with the shooting four hours later as they emerged from a house on the 300 Block of Leibrandt Avenue. Cristobal Natividad, 41, also was arrested Sept. 20 and charged as an accessory in the homicide.\nSept. 22: Ernesto Leiva, a 23-year-old Santa Cruz man shot in the upper torso on Broadway and Pennsylvania in Santa Cruz.\nSept. 26: Santa Cruz police discover the body of Shannon Magner, 66, of Aptos, in an apartment on the 800 block of Front Street. An autopsy reveals stab wounds to the back of her neck. A possible suspect is identified but remains on the loose.\nOct. 16: A Santa Cruz police officer shoots and kills 32-year-old Sean Arlt in the 200 block of Chace Street after he threatens them with a metal bow rake.\nNov. 19: Santa Cruz County sheriff’s deputies shoot and kill a suspect after two others were stabbed at a house on the 800 block of Amesti Road outside Watsonville. The victim was found on the 300 block of Pioneer Road."}