{"uri": "http://www.wcnc.com/story/news/crime/2015/08/09/sheriff-father-shot-killed-2-children-before-attempting-suicide/31370509/", "title": "Sheriff: Man fatally shot 2 sons, botched suicide attempt", "dct": "Mon, 10 Aug 2015 00:00:00 GMT", "id": "64dccb2217621b678db67906b9da5c9a", "content": "STATESVILLE, N.C. -- A man fighting for his life in the hospital will face two first-degree murder charges if he pulls through after deputies say he killed his two sons, each under the age of 5, before shooting himself in the head.\nShawn Fuller, 31, was found outside his Iredell County home Sunday morning by Sheriff's deputies.\nThe whole ordeal is still hard for neighbors like Rogelio Castro to comprehend.\n\"I can't imagine my father doing something like that,\" Castro said. \"To a bunch of kids.\"\nCastro has a 3-year-old brother and 5-year-old sister who each played with the Fuller boys: 3-year-old Josiah and 4-year-old Uriah when the Fuller family would come up the road to their house.\n\"No, he (Shawn Fuller) seemed like a pretty decent guy,\" Castro said. \"Every time he came over we'd shake hands.\"\nBut Shawn Fuller is about to be charged with two counts of first-degree murder. Deputies say he shot his two sons multiple times early Sunday morning before turning the gun on himself.\nSheriff Darren Campbell says it's been difficult for his first responders to deal with.\n\"It's traumatic, it's not something you want to see,\" Campbell said. \"A lot of them are parents and a lot of them have young children. And to see two young children just killed in the manner such as this-- somewhere that they didn't have no option but to be.\"\nFuller is at CMC Main in critical condition. Campbell says if he survives, he'll head straight to jail.\n\"He will not leave the hospital without being in our custody,\" Campbell said.\nCampbell says the weapon Fuller used was his wife's, which she had hidden in the house. She and Fuller's brother were the two who called 911.\n\"Obviously they're upset, especially the mother,\" Campbell said. \"She's in a safe location now.\"\nCastro said his mother used to babysit the two Fuller boys. He says his entire family is in shock.\n\"They're just kids,\" Castro said. \"How can you do something like that?\"\nSheriff Campbell says they did respond to a domestic dispute call to the home back in May."}