{"uri": "http://www.clarionledger.com/story/news/2015/01/20/lowndes-co-man-charged-in-shooting-death-of-boy-4/22073721/", "title": "Lowndes Co. man charged in shooting death of boy, 4", "dct": "Tue, 20 Jan 2015 00:00:00 GMT", "id": "014f42718ca56671bdab07bf6b479fd8", "content": "LOWNDES COUNTY- A Lowndes County man is facing a murder charge after allegedly shooting his girlfriend's four-year-old son with a hunting rifle.\nPatrick Chambers, 27, was taken into custody Tuesday afternoon for his alleged role in the shooting death of four-year-old Brayden Barksdale, according to Lowndes County Chief Deputy Marc Miley. Chambers will officially be charged with murder and possession of a weapon by a convicted felon on Wednesday, Miley said. Miley did not know Chamber's prior felony conviction but said it stemmed from an out of state charge. Chambers is the boyfriend of Barksdale's mother, Amy Richardson, Miley said.\nAn autopsy ruled Tuesday that Barksdale's death was a homicide, according to Lowndes County Coroner Greg Merchant.\nBarksdale died of a single gunshot wound from a .45-70 single shot hunting rifle, Merchant said.\nWCBI-TV in Columbus reported Barksdale was shot once in the head. Merchant declined to elaborate on the location of the wound.\nLaw enforcement responded to a home in Lowndes County just after 8 a.m. Monday morning for a reported accidental shooting, Miley said. Chambers, who was alone with the child while Richardson was at work, ran next door and told a neighbor the child accidentally shot himself, WCBI reported.\nBarksdale was deceased when deputies arrived on scene, Merchant said.\nMerchant said he immediately doubted the shooting was an accident.\n\"I didn't think it was an accident when I got there,\" Merchant said. \"With another gun maybe but that rifle is designed for kids learning how to hunt. It's super safe, super safe. So for them to tell me it was an accident, I don't buy it.\"\nChambers will appear in Lowndes County Justice Court for an initial appearance Wednesday, Miley said. He is currently in the custody of the Lowndes County Adult Detention Center. Jail records list Chambers' address as the same address where the incident occurred.\nA GoFundMe account has been set up to assist with burial expenses.\nhttp://www.gofundme.com/kih7l0"}