{"uri": "http://www.mystatesman.com/news/news/crime-law/neighbors-describe-horrifying-bastrop-shooting-tha/nr4bx/?icmp=statesman_internallink_referralbox_free-to-premium-referral", "title": "Neighbors describe horrifying Bastrop shooting that left 4 dead", "dct": "Sun, 24 Jul 2016 00:00:00 GMT", "id": "122c193f360c2fec79d4c396bb777b2c", "content": "0\nResidents at a Bastrop apartment complex awoke Sunday morning to find the remnants of a bloody shooting the night before still lingering outside their doors — police gloves and crime scene tape on the lawn, glass shattered from a neighbor’s window and four orange markings tracing the spots where the bodies of a man, two women and a small child had lain.\nBastrop police identified the dead as Alejandro Martinez, 20; Erica Rodriguez, 21; Paula Nino, 20; and a 3-year-old boy, all of Bastrop.\nPolice would not release the toddler’s name. Another child had been taken Saturday night to a hospital, but her injuries were not expected to be life-threatening.\nPolice declined to identify the shooter, who initial reports said had committed suicide. Police would not confirm that, saying the investigation was ongoing. The Travis County medical examiner’s office is completing autopsies on the victims.\n“I want to be as confident (with information) as we can be, especially with an incident that is so dynamic and so close to the community,” Bastrop Assistant Police Chief James Altgelt said Sunday.\nThose who live at the complex described three of the dead as a typically happy family — a husband and wife and their young son — the father inclined toward heavy drinking, according to neighbor Sonia McQueen, but hardworking and well-liked.\n“They were always happy,” neighbor Angela Myers said. “Never aggressive.”\nMartha Hernandez, who lives next door, called the child who died the “sweetest little boy.”\nNino was identified by some neighbors as a baby sitter, and they said the child who was hospitalized after the shooting was her daughter.\nHernandez was home Saturday night with her 17-year-old daughter when the sound of gunfire rang throughout their apartment. They walked outside to see the bodies in the grass and called police.\n“It was all blood,” Hernandez said.\nOne woman was found resting on top of a child, as if attempting to shield him from gunfire, residents said. The second child was wandering in tears amid the bodies.\n“I told her to run,” said Myers, who later brought the toddler to a local emergency room. “She kept saying her mom’s dead, her mom’s dead.”\nThe incident, which began shortly after 6 p.m., occurred at the Arbors of Bastrop Apartments in the 200 block of Childers Street, in a busy commercial part of town. Residents described the area as peaceful.\nAt the time, a small group was cooling off in the pool a few yards away. Neighbors said they heard as many as eight gunshots. Officers responded within minutes, they said.\nBastrop police combed the crime scene into the wee hours of Sunday morning, as residents huddled in groups behind a line of crime scene tape. Several said they feared for their safety. However, in a briefing with reporters Saturday night, Bastrop police Detective Vicky Steffanic assured the public that no one was in any danger.\nThe Bastrop County sheriff’s office and the Texas Rangers are assisting police in the investigation. Authorities would not disclose further details about what led to the gruesome deaths Saturday night.\nFor those close by, Sunday was a day of shock.\n“I cried all afternoon,” apartment complex resident Bill Browning said. “It was horrible.\n“When you’re standing right there and looking, it’s one of the most horrible things you’ve ever seen.”"}