{"uri": "http://www.miamiherald.com/2014/06/24/4197904/miami-police-up-to-10-people-shot.html", "title": "Tragedy in Liberty City: 2 dead, 7 wounded in shooting", "dct": "Tue, 24 Jun 2014 06:35:00 GMT", "id": "5f8866041395cf7d120a6b7c5162c93c", "content": "One man was so immersed in the carnage surrounding him that he didn’t realize he had been shot three times. Another victim got blasted in the face. And a 17-year-old girl, barely clinging to life Tuesday, was left with two bullet holes in her chest and three in her leg, family members said.\nMoments before, at a small apartment building across from the Liberty Square housing complex, two men had pulled up in a dark SUV around 2:15 a.m. Tuesday as more than a dozen people were hanging out, talking and drinking. The men climbed out lugging high-powered automatic weapons, and took aim.\nWhen the shooting stopped, more than five dozen shell casings littered the parking lot, sidewalk and street. Two men were killed and seven people were wounded in one of the worst mass shootings in Miami in decades.\nThe body of Kevin Richardson, 30, lay covered by a tarp, partly obscured by a makeshift barricade, as dozens of family members and friends who flooded Northwest 12th Avenue, halfway between 65th and 66th streets in Liberty City, tried to sort through the chaos.\nThe Miami-Dade medical examiner didn’t pick up the body until after 9 a.m. When Richardson was removed, his mother began to shriek, friends holding her upright as she swayed from side to side.\n“He said he was coming back. I want my baby,” cried Hermonya Richardson.\nThe other dead man was identified by police as Nakeri Jackson, 26. The teenage girl in critical condition — the only female shot — and the other victims were not identified.\nPublicly, police said they aren’t aware of a motive.\nBut sources say the two men, carrying an AK-47 and an AR-15, were firing at an intended target who might not have even been in the crowd. The shooters had not been arrested or identified by Tuesday night. Police were tagging beer bottles and other paraphernalia around the crime scene hoping to find DNA matches or other evidence that might help identify the shooters.\n“The motive at this point is still unknown. We’re still investigating,” said Miami police spokeswoman Frederica Burden.\nThe scene was so chaotic that when reports circulated that three men had been arrested in connection with the shooting, police immediately said it wasn’t true. The reality: Three men were detained after tossing a Sponge Bob Square Pants bag that contained weapons.\nTuesday’s shooting spree came a year after Miami-Dade’s last high-profile multiple shooting. In the summer of 2013, Pedro Vargas went on a rampage in Hialeah, killing six neighbors in his apartment complex. Vargas was shot dead by Hialeah SWAT members who broke down a door and fired on him before he could harm two hostages.\nThe Liberty Square neighborhood where Tuesday’s shooting took place and which runs roughly from Northwest 12th to 15th avenues and 62nd to 67th streets, has been plagued by gun violence over the years. Tuesday’s tragedy was at least the 13th shooting since 2009. In February, three young girls were shot by a friend seeking revenge.\nTuesday’s incident was also eerily similar to a January 2009 double murder only nine blocks away. That day, gunmen pulled up to a group of men playing dominoes and opened fire with automatic weapons. Two men died and seven were severely injured. Among the dead were two teenagers.\nThough a man was arrested for the shooting, the case was dropped by state prosecutors after witnesses failed to come forward, and those who did began to contradict each other. The most high-profile of the neighborhood’s shooting deaths happened nearly eight years ago when 9-year-old Sherdavia Jenkins was gunned down in a crossfire at her home less than a block from Tuesday’s bloodbath.\nA park named in her honor now sits on the corner of Northwest 62nd Street and 12th Avenue.\nKevin Richardson’s family spent Tuesday morning consoling each other behind police tape and about 100 feet from his body. One family member, concerned witnesses might remain quiet in fear of retaliation, made a brief statement.\n“If you know anything, come forward and say something because it could be your child,” Richardson’s aunt, Bennae Robinson, said.\nMiami City Commissioner Keon Hardemon, an assistant county public defender, said people should not underestimate the fears of his constituents.\n“The reality is the violence in District 5 is not a game,” Hardemon said. “It’s real life. People have a genuine fear. They have a real fear.”\nFew people were coming forward Tuesday. One woman described the shooting scene to friends, saying she ran into an apartment when the bullets started to fly. But she retreated quickly when a reporter approached.\nAt Jackson Memorial Hospital’s Ryder Trauma Center, where the victims were taken by Miami Fire Rescue, and where friends and family gathered, people sat on the grass chatting and speaking on their cellphones.\nA woman whose 31-year-old son was shot said she lives across the street from the crime scene. She said her son was simply hanging out on a hot summer night, talking and drinking with friends when the barrage began.\n“When the smoke cleared, I just saw bodies,” she said.\nThe woman said when she ran outside she found her son helping victims, and that he didn’t even realize he was one himself until someone pointed out his wounds. She said her son’s friend, who was shot dead, had been planning his child’s first birthday party.\nNow she wants to move.\n“It makes me so scared,” the woman said.\nThe brazen shootings directly across the street from the old Pork ‘N Beans apartments attracted most of Miami’s police brass as well as City Manager Daniel Alfonso, who said he planned to sit down with senior command staff to reevaluate the neighborhood’s needs.\nMiami Police Chief Manuel Orosa said he has bolstered Liberty Square patrols with six additional officers, but there was little they could do at the apartment complex on the east side of Northwest 12th Avenue, across the street. Orosa said an officer on patrol at a nearby school heard the gunfire and rushed to the scene, but it was much too late.\n“It’s a sad situation,” the chief said. “We’ve never had any calls, any problems in this apartment building.”"}