{"uri": "http://www.wbtv.com/story/29369047/four-shot-in-anson-county-shootout", "title": "Pregnant woman among wounded in Anson County club shootout", "dct": "Mon, 20 Jul 2015 21:54:00 GMT", "id": "c0973d65e87b3f48bf690b0d4176b038", "content": "ANSON COUNTY, NC (WBTV) -\nA shootout between two people in Anson County sent four others, including a pregnant woman, to the hospital, according to Anson County deputies.\nAuthorities say two men were arguing in a club called the Boom Boom Room Saturday morning around 2:45 in Morven, NC. When they started shooting at each other, four bystanders were caught in the crossfire. Three people sustained gunshot wounds, another person suffered \"unknown\" injuries.\nNeither of the shooters were injured, according to the Anson County Sheriff's Office.\nAccording to deputies, Consquelo Little, Natasha Leak, Anthony Gaddy, and Joseph Hall were all seriously injured in the incident.\nConsquelo Little is 7-months pregnant and was reportedly shot in the back. Natasha Leak was shot in the mouth, according to deputies. Both were initially taken to Chesterfield General Hospital after the shooting and have since been transported to McLeod Regional in Florence.\nJoseph Hall and Anthony Gaddy were taken to Carolinas HealthCare System's Anson. Gaddy reportedly suffered a gunshot wound to the chest and Hall was being treated for other injuries. He did not suffer a gunshot wound. Hall and Gaddy have been moved to Carolinas Medical Center in Charlotte.\nDuring the investigation, deputies say they were given a description of one of the shooters. Someone fitting that description, later identified as Frank Hall, was picked up by deputies while walking along Highway 52 near Morven.\nDeputies say they found a small caliber pistol on Frank Hall, 22, and later charged him for his alleged involvement in Saturday morning's shooting.\nAnson detectives and the North Carolina SBI say a second shooter, 42-year-old Oscar Willoughby from Charlotte, was arguing with Frank Hall when the shooting happened.\nHall and Willoughby have bother been charged with assault with a deadly weapon with intent to kill, inflicting serious injury charges. Hall was being held in the Anson County Jail under a $400,000 secured bond.\nWilloughby has not been arrested, according to deputies.\nThe small building where the shooting happened, nicknamed the “Boom Boom Room,” is located on the same property as a house where a family lives with their young children.\nCopyright 2015 WBTV. All rights reserved."}