{"uri": "http://www.thenewstribune.com/2015/05/29/3815377/tacoma-teen-arrested-in-death.html#emlnl=Crime_Newsletter", "title": "Tacoma teen, 17, charged in death of friend apparently shot him by mistake", "dct": "Fri, 29 May 2015 15:54:00 GMT", "id": "d2f43cd312d9dfd036a31809dfa3d735", "content": "A teenager killed in a Tacoma parking lot earlier this month was shot mistakenly by an acquaintance who allegedly had been firing at someone else, court records show.\nPierce County prosecutors have charged Treveon Reed, 17, with second-degree murder in the death of Jatarius Tolbert, also 17.\nReed pleaded not guilty Friday during his arraignment in Superior Court. Court Commissioner Meagan Foley ordered him jailed in lieu of $1 million bail.\nTolbert died May 11 near South 93rd and Hosmer streets.\nHe reportedly was hanging out with as many as a dozen other young men about 8:30 p.m. when a Dodge Charger drove past, court records said. Tolbert allegedly had been “having problems” with someone who drove a similar car, the records state.\nSomeone in Tolbert’s group pulled out a revolver and opened fire as the Charger passed, the records state. His acquaintances told police the Charger then drove back by and someone inside fired two shots at the group, causing it to scatter.\nIt was only later that Tolbert’s acquaintances realized he’d been shot, the records show. Police reports indicate he was shot in the back and died at the scene.\nPolice talked to another witness who said no one in the Charger ever fired at Tolbert’s group, the records show.\nReed was arrested three days later on a gun possession charge and booked into the Remann Hall juvenile detention center after police stopped a car he was riding in. They found a revolver jammed between his seat and the center console, court records show.\nReed denied owning the gun but said he’d handled it earlier that day, the records state.\nThe state crime lab later determined the bullet that killed Tolbert was fired from the revolver found with Reed, prosecutors said.\nOn Wednesday, detectives interviewed Reed. He admitted being at the parking lot the night Tolbert died but denied shooting the teen.\n“When confronted with the fact that he had been found with the murder weapon, the defendant claimed that he had switched guns with another member of his group after the shooting,” deputy prosecutor Jesse Williams wrote in a determination for probable cause.\nDetectives talked to Reed again Thursday.\n“The defendant did admit that he had never traded guns after the shooting,” Williams wrote. “The interview was short and the detectives terminated it after it was clear that the defendant was too emotional and despondent over accidentally shooting and killing his friend.”"}