{"uri": "http://www.wrdw.com/home/headlines/3-year-old-girl-in-hospital-after-accidentally-shooting-herself-377668471.html", "title": "3-year-old girl in hospital after accidentally shooting herself", "dct": "Fri, 29 Apr 2016 00:00:00 GMT", "id": "8a6d0cce572645e942ef73c20ead91ff", "content": "AUGUSTA, Ga. (WRDW/WAGT) -- Joe LeonGuerrero and his coworkers though they had a quiet Friday afternoon in store at the Weaver Distribution center in Augusta. But within a matter of seconds, things changed.\n\"While working, I heard a firearm discharge,\" LeonGuerrero says. \"I was previously in the military so I know the sound. And me and a coworker went to see what was going on and we saw a female get out of a vehicle and a child who was crying.\"\nA three-year-old girl had accidentally fired a shot in a car in the parking lot with her mom and five-year-old brother inside. A family friend went inside to pick up car parts, but left his gun in the car.\nThe bullet went through the girl's backside and was lodged inside the car's windshield.\n\"It's a very unfortunate accident,\" LeonGuerrero says. \"Obviously there could have been precautions taken so that this had never occurred.\"\nAn unfortunate accident that's already taken the lives of 176 U.S. kids under the age of 11 in 2016 alone. 798 people across the country have been shot accidentally this year as well, either by someone else or themselves.\nThe shooting also comes on the one-year anniversary of the death of a one-year-old in Augusta after a 115-year-old accidentally pulled the trigger.\nAs a father who's familiar with guns, LeonGuerrero says the gut-wrenching reality is these things happen all the time and there must always be an effort to keep guns out of the hands of children even if they think it's empty.\nFor now, he says he's glad to hear the child is alright. But he says there's always a responsibility when it comes to packing heat.\n\"I have children of my own and you have to take precautions if you want to own a firearm,\" LeonGuerrero says. \"If you're gonna own a firearm, you've got to educate yourself. That's the bottom line.\"\nThe girl remains in the hospital with non-life threatening injuries and is expected to be okay."}