{"uri": "http://www.news-press.com/story/news/crime/2016/08/09/incident-punta-gorda-police-department/88500140/", "title": "Punta Gorda police thought gun that killed woman only had blanks", "dct": "Tue, 09 Aug 2016 00:00:00 GMT", "id": "54143ac2aeb7b99e605da7f3000de6bf", "content": "Punta Gorda police Chief Tom Lewis said his department was unaware it had ammunition for a revolver used during a public demonstration Tuesday night that resulted in the death of a Punta Gorda woman.\nMary Knowlton, 73, died after being shot by a police officer Lee Coel during a shoot or don't shoot scenario at a special Chamber Police Night similar to the department's citizen police academy, the chief said.\nCoel, who was hired by the department on March 17, 2014, has been placed on administrative leave. The 28-year-old had participated in similar public role-playing scenarios presented by the department.\nLewis said he could not talk about the gun used due to the Florida Department of Law Enforcement investigation, but explained that only some officers have access to that weapon and it has been used before at similar events. He said his department believed the gun only had blanks available and was not sure how the gun had real bullets nor how it being loaded was missed.\nThe Punta Gorda Police Department hosted approximately 35 people for the two-hour Chamber Police Night. Participants were selected for the shoot/don’t shoot scenario in which they make decisions using simulated lethal force. Coel was playing a “bad guy” and fired several times at Knowlton, who was supposed to be playing the victim.\nJohn Wright, president of the Punta Gorda Chamber of Commerce who was in attendance, said that at first everyone thought Knowlton was acting.\n“This was out of the blue,” he said. “ A tragic accident. Even when it started to play out people thought it was part of the theater of it. Nobody knew the severity until they told us to move back, about 2 to 3 minutes.”\nWright said witnesses dissolved into tears, hugs, and prayer when Lewis told them that there had been an accident. Knowlton was transported to Lee Memorial Hospital where she was pronounced dead.\n“I am devastated for everyone involved in this unimaginable event,\" said Lewis, who was at the event with several officers. \"If you pray, please pray for Mary’s family, and for the officers who were involved. Everyone involved in this accident is in a state of overwhelming shock and grief.”\nWright said that the victim was a well-known and highly thought-of member of the community.\n“She was a much-revered member of the chamber,” he said. “She had such passion for her causes and her main cause was the library.”\nHe said she was always urging chamber members and others to take part in library meetings and functions.\n\"We are shocked by this horrific accident and are grieving deeply over Mary's passing,\" Punta Gorda City Manager Howard Kunik said.\nLt. Katie Heck, public information officer for the Punta Gorda police, said that the city has contracted with Tidewell Hospice to provide free grief counseling for anyone in the city.\nThere will be a special counseling session on Aug. 17 at Lashley Park for those affected by the shooting and that counselors would also be visiting the Chamber of Commerce office.\nHeck said the department has run the shoot/don’t shoot scenarios as part of it's Punta Gorda Citizen’s Academy program for approximately two years.\n\"This was the first police night hosted by our Chamber of Commerce,\" she said. \"In each session four individuals went through the scenarios with no injuries or incident.\"\nAlecs Dean, owner of International Firearm Safety Inc., in Fort Myers, said the moment he heard what had happened he wondered why live ammunition was being used.\nDean, who has helped operate similar events for the Fort Myers and Cape Coral police departments, said an incident like this is an impossibility. \"It just cannot happen.\"\nHe said there would have to be violations of every single rule of firearms safety in a specific sequence to achieve the same fatal result.\n\"First, there is no live ammunition in the classroom,\" Dean said. \"Second, the minimum number of people to verify a firearm is loaded is two. If more people are there, then more check, visually looking into the action and physically sticking your finger in the action.\"\nLastly there is the golden rule for events of this kind. \"Always keep the gun pointed in a safe direction,\" he said, adding that if the department had followed any one of these then the shooting would not have happened.\nAdditionally, he said, there are specific rules to follow for an event like the shoot/don't shoot scenario. He said the scenario is first discussed in class, then the scenario is pantomimed and lastly a simulator is used with a laser and video screen.\nPads and other protection including a face mask are used and special \"simunitions,\" ammunition using paint not lead, are utilized, Dean said.\nGrief counseling available\nTidewell Hospice will provide free grief counselling for anyone impacted by Mary Knowlton's death. Call 941-894-1794 any time of the day or night.\nRECENT CHARLOTTE COUNTY NEWS"}