{"uri": "http://lubbockonline.com/filed-online/2016-02-16/5-year-old-killed-reported-accidental-shooting-south-lubbock#.VsTIS_IrLcu", "title": "5-year-old killed in reported accidental shooting in South Lubbock", "dct": "Tue, 16 Feb 2016 18:49:00 GMT", "id": "ed463f20bdcafbc02079a2f99c7d0581", "content": "A 5-year-old boy is dead after what was reported as an accidental shooting Tuesday evening in South Lubbock.\nCynthia Flores left her home around 5:10 p.m. to take her kids to dance class.\nShe drove out of her cul-de-sac and noticed two children at the end of the block playing in the yard.\nMore than an hour later, Flores was blocked down the street from her home by police cars and crime scene tape.\nOne of the two kids she’d seen less than two hours before was dead.\nLubbock police responded to a call about a shooting in the 2500 block of 71st Street at 6:03 p.m.\nJason Lewis, LPD patrol sergeant, said a 5-year-old boy had been shot and taken to Covenant Women’s & Children’s Hospital.\n“Doctors worked on the child,” he said, but he did not survive.\nFour people, including the parents and two kids, were home at the time of the incident, he said.\nPolice said the boy was shot with a rifle. Other details, including who shot the child and how the incident happened, were still under investigation Tuesday night, but Lewis said it was believed to be accidental.\nFlores said she’s seen the family of four outside often while going on walks with her own kids. She and her family moved in about four years ago and the family was already there.\nFlores described her neighbors as “sweet” and said she often waves and says “hi” when she’s passing through.\nMelanie Hernandez and Lauren Jackson, both Texas Tech students who live on the street behind the family, said they were on their way to the gym when they noticed all the police cars and saw the EMS trucks pull up.\nA swing set could be seen Tuesday night behind the fenced-in backyard, and a small, red push car could be seen just inside the garage.\nHernandez and Jackson said they always see the kids outside.\n“They would pretend to hammer on the fence,” Hernandez said.\nSylvia Botello was sitting inside Trinity Church just across the street from the scene when she saw the first responders pull up.\n“In the 27 years I’ve worked here, I’ve never seen anything like this,” she said.\nHernandez said she considers it a safe neighborhood and was “shocked” at the news of the child’s death.\nLewis said the incident is under investigation and did not release names.\nellysa.gonzalez@lubbockonline.com\n• 766-8795\nFollow Ellysa on Twitter @AJ_Ellysa"}