{"uri": "http://www.tulsaworld.com/news/state/year-old-arrested-in-choctaw-county-shooting-originally-reported-as/article_3590377c-e5b7-5a08-8ab6-c2f9b46fdc0d.html", "title": "13-year-old arrested in Choctaw County shooting originally reported as accidental", "dct": "Tue, 15 Nov 2016 00:01:00 GMT", "id": "6024dec6c396b3915b4c879d2a1c9774", "content": "FORT TOWSON — A 13-year-old boy was arrested Friday after he fatally shot a friend's older brother while handling a handgun during a sleepover, according to police in far southeastern Oklahoma.\nThe juvenile, whose name has not been released, was taken into custody Friday a few hours after the death of Gavin Freeman, 18.\nChoctaw County Sheriff Terry Park said the boy, who was at the Freeman residence for a sleepover with the victim's younger brother, was playing with a .38-caliber handgun at 5 a.m. and fired a round that struck the 18-year-old.\nThe shooting was reported as an accident; however, the boy was arrested at the request of the Choctaw County District Attorney’s Office.\n\"Five hours after the shooting, the DA advised law enforcement at that time to pick the 13-year-old up and transport him to a juvenile lockup facility,\" Park said.\nHe said the handgun belonged to Freeman's parents.\nChoctaw County District Attorney Mark Matloff declined to comment, citing the age of the suspect. Matloff said he doubts that the juvenile will be tried as an adult.\nFreeman was a quiet student who often kept to himself, said Phil Hall, principal at Fort Towson's junior high and high schools.\nHall said Freeman was not attending the school at the time of his death but that the suspect is a current student. The school district offered counseling services to students and faculty Monday.\n\"I think just because we are small and we are family and the kids know they have the support,\" Hall said, \"small schools like us rally together like a community and remind each other to love one another.\"\nClassmate Haylee Brooke said Freeman was a solitary person but that he surprised those he opened up to with his kindness and intelligence.\n\"He was wise, very wise, for his young age,\" she said.\nFort Towson is in southeastern Oklahoma between Hugo and Idabel and is near the Texas border."}