{"uri": "http://www.local10.com/news/crime/8-year-old-girl-shot-in-head-declared-brain-dead-mother-says", "title": "8-year-old girl shot in head declared brain dead, mother says", "dct": "Mon, 29 Aug 2016 11:44:00 GMT", "id": "2db855f1b8d6c6d8266a6fe45b701d99", "content": "MIAMI-DADE COUNTY, Fla. - An 8-year-old girl who was shot in the head Sunday afternoon while standing outside a northwest Miami-Dade home with her father has been declared brain dead, her mother posted on social media.\nThe child, identified as Jada Page, and her father, James Page, 32, were shot shortly after 5 p.m. outside a home on Northwest 25th Avenue, police said.\nPolice said the man was shot multiple times in the upper torso and the fourth-grader, who just started school at Sea Castle Elementary in Miramar, was shot in the head.\nBoth were taken to Jackson Memorial Hospital's Ryder Trauma Center, where Jada was listed in critical condition. Her father's condition has not been released.\nJada's mother posted a photo on Instagram of herself holding Jada's hand Sunday night in the hospital, saying that doctors had declared her daughter brain dead.\n\"They say my baby brain dead and they taking her off the machines in the morning,\" the woman wrote. \"The doctors say there are miracles and there is reality. But God, I know you have the final say.\"\nThe woman asked people to continue praying for her daughter.\n\"Lord, I’m begging you. Please find breath in my baby's body,\" she wrote. \"Y'all keep praying for my baby! I need a miracle by tomorrow morning.\"\nThe Carter family, who lost their 6-year-old son, King Carter, to gun violence, and who are family friends of the Page's, were among those at the hospital holding out hope that Jada would pull through.\n\"When certain situations and circumstances come knocking on our door we can't question God, but in our heart we still ask why?\" Santonio Carter said.\nNo suspects have been identified in the shooting, but police said two people inside a black Ford -- either a Focus or Fusion -- were responsible.\n\"Please stop what you're doing, bow your head, close your eyes. An 8-year-old baby girl was shot in the head. Unspeakable carnage must end,\" Miami-Dade County Public Schools superintendent Alberto Carvalho tweeted.\nMiami-Dade police distributed flyers in the area of Northwest 101st Street and 25th Avenue Monday afternoon in hopes of finding someone who had information about the shooting.\n\"You're cowards. It's a coward that would just drive by and shoot randomly,\" Pastor Keith Butler said.\nMiami-Dade police Director Juan Perez also called for anyone with information to come forward.\n\"If you know something, say something,\" he said. \"Not only for this one, but the 15-year-old that was shot and killed down the street on 83rd street, at a wake.\"\nAnyone with information about the shooting is asked to call Miami-Dade Crime Stoppers at 305-471-TIPS. A $23,000 reward is being offered for information leading to an arrest.\nCopyright 2016 by WPLG Local10.com - All rights reserved."}