{"uri": "http://miami.cbslocal.com/2016/08/28/father-8-year-old-daughter-fighting-for-life-after-shooting/", "title": "Child Killed, Father Critical After Shooting In Miami", "dct": "Sun, 28 Aug 2016 22:22:00 GMT", "id": "b884fdaabe7b8a117bbac4258c425658", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nMIAMI (CBSMiami) — An 8-year-old girl has died and her father is listed in critical condition after they were shot outside of a home in Miami.\nIt happened at N.W. 25th Avenue & 102nd Street as neighbors said they heard several shots ring out in the middle of a quiet Sunday afternoon.\nPolice said at least two men in a 4-door black Ford Fusion, or Ford Focus-type, rolled by and began shooting at the man as he exited his white Jeep.\nInvestigators believe that 32-year-old father was the intended target — but not his daughter, who was on their home’s porch just feet away.\n“The child that was standing near the front door of the house took a round to the head,” said Miami-Dade Police Director Juan Perez. “And it pains me to be here once again speaking about a small child, an innocent child, that has nothing to do with any criminal activity, has nothing to do with ongoing disputes and took a bullet that was not intended for her.”\nResidents were sitting on their patio relaxing, with their children playing in the yard, when they heard the barrage of gunfire.\n“Imagine you hear these gunshots where you live,” wondered one neighbor. “Can you imagine if they got shot?”\n“As soon as we heard the gunshots, we ran inside,” said his friend.\nAt the hospital, loved ones waited anxiously for news and prayed for the little girl and her father. By nightfall, a relative told CBS4’s Donna Rapado that the child had died.\n“We feel the same way you guys feel, and the rest of this community,” Perez added. “We’re in awe that this happened. These tragic events need to stop. Look around, there’s neighbors standing out here, kids playing in the front yard. Just like the child that was hit. Those bullets could’ve gone anywhere. Senseless violence within our community. It’s been a quiet summer. And now as school starts, we’re gonna start up again. This is ridiculous.”\nAlberto Carvalho, the Miami-Dade Public Schools Superintendent, has been very outspoken and outraged by all the gun violence involving children.\nPlease stop what you’re doing, bow your head, close your eyes. An 8-year old baby girl was shot in the head. Unspeakable carnage must end.\nMiami-Dade Police have upped the reward for information leading to the killers’ capture by $20,000, making the total reward to $23,000.\nIf you know anything, call Miami-Dade Crime Stoppers at (305) 471-TIPS. As always, tipsters can remain anonymous."}