{"uri": "http://www.walb.com/story/28864045/moultrie-vigil-honors-victims-of-crimes", "title": "Moultrie vigil honors victims of crimes", "dct": "Wed, 22 Apr 2015 01:48:00 GMT", "id": "ecc774eb90381fe4c49a22e4bd495503", "content": "MOULTRIE, GA (WALB) -\nA candlelight vigil Tuesday night in Moultrie honored and offered support to victims of crimes.\nThis is the 31st National Crime Victims' Rights Week. Tuesday night family members remembered loved ones lost to crime.\nLola Lee describes the night two years ago when her son Eric Debruce and brother James Key were killed in a drive-by shooting in Moultrie.\n\"I wouldn't want nobody to go through what I went through with losing my son,\" said Lola Lee, Victim.\nKey died that night. Debruce died 17 days later. Antonio Williams was acquitted of murder, but Derek Rushing was sentenced to 20 years in prison. Lee wiped away tears and wore a shirt in honor of her son who has six children.\n\"And he has children too. They want their daddy and their daddy ain't coming back,\" said Lola Lee\nProsecutors say events like this strengthen victims' rights.\n\" Over the years we've had tremendous success with things like guaranteeing their right to be in the courtroom, guaranteeing their right to tell the judge how they feel about the disposition on the case,\" said J. David Miller, District Attorney of Southern Judicial Circuit.\nMoultrie Police Officer Carly Davis became emotional as she told her story of losing her boyfriend in 1999.\n“I lost the love of my life and my soul mate to a person who was speeding and ran a stop sign,” said Carly Davis, Moultrie Police Officer.\nOfficials with the Colquitt County Sheriff's office assured the victims that they do have support.\nLt. Shawn Bostick- Colquitt Sheriff's Office\n\" We don't want you to think that you are in it alone,” said Lt. Shawn Bostick, Colquitt Sheriff's Office.\nMiller says they reached an important milestone for victims this year.\n“We got the amount of funds per person for funeral expenses doubled through the crime victim's compensation fund,” said J. David Miller.\nWork that Lee says she is proud of.\n\" It says a lot for our community,” continued Lola Lee.\nCopyright 2015 WALB. All rights reserved."}