{"uri": "http://www.nbcphiladelphia.com/news/local/5-Year-Old-Shot-Inside-Chester-Home-382048941.html", "title": "'I Turned Him Around and He Had a Hole in His Chest': Mom Recounts Son, 5, Being Hit By Stray Bullet", "dct": "Wed, 08 Jun 2016 02:15:00 GMT", "id": "d1a1a784fd2073090ad17af90f2455de", "content": "A little boy from Delaware County continued to recover Tuesday evening after he was wounded by gunfire in the one place he was supposed to be safe: his home.\nThe 5-year-old boy's mother, Latosha Hayes, shared the terrifying moments she and her family had inside their Chester home when gunfire erupted outside and she realized her son had been wounded by a bullet that made its way inside.\n\"I turned him around and he had a hole in his chest,\" Hayes, who was cooking dinner at the time of the shooting, told NBC10's Tim Furlong.\nThe bullet missed the boy's vital organs by millimeters. The family said they hit the floor in the house when they heard the gunfire, and Hayes said doctors told her when they pulled the boy out of the way, they may have saved his life by making the bullet travel at an angle.\nFamily Speaks Out After Shooting Wounds Boy, 5, in His Home\n\"I thought I was shot,\" the boy's father said. \"He said, 'No, I'm shot.'\"\nThe couple said they've been trying to move out of their home in the Chester public-housing complex where they live for some time -- ever since their car was struck by gunfire.\nThey said it's so violent there that they can't even let their son or their younger children outside to play. But Monday night, that terror came inside.\nHayes said her son is doing well, but is traumatized by what happened to him.\n\"He's a good kid. He's strong,\" she said.\nPolice continued to search for the person responsible for the shooting Tuesday night.\nHayes, who has four children, \"watched the shots tear through her curtains and knock them off the wall,\" according to a news release from investigators.\nNo arrests had been reported early Tuesday evening, and police did not say whether they had determined what motivated the shooting or identified any suspects."}