{"uri": "http://6abc.com/news/5-year-old-shot-in-arm-in-chester/1374479/", "title": "5-year-old shot in arm in Chester", "dct": "Tue, 07 Jun 2016 00:00:00 GMT", "id": "f23fe3fb6e7d510019a5df46c01543d9", "content": "CHESTER, Pa. (WPVI) --\nPolice in Chester are investigating a shooting involving a 5-year-old child.\n\"We shouldn't have to live like this,\" the victim's mother Latosha Hayes said.\nLatosha tells Action News she doesn't want to bring her son, 5-year-old Marc Andrews Jr., back to the place they call home on the 400 block of Whittington Place after he's released from the hospital.\nOn Monday night, bullets came tearing through the rowhome she shares with her husband, son, and three other young children.\nOne of those bullets hit little Marc in the side and traveled to his armpit.\n\"It will still be in him. My little son will still have a bullet lodged inside of him because of this ridiculousness. I am tired. I am so tired,\" Latosha said.\nThe gunfire started in the housing authority complex shortly before 10 p.m.\nHayes had just come home from work and was cooking in the kitchen with her 4-year-old daughter, Marc, and her husband nearby.\nThey heard multiple shots fired. Her 10-year-old and 8-year-old were upstairs.\n\"I grabbed my daughter. She was next to me. I pushed her down. Then, I grabbed Marc and I lay on top of him, then their dad lay on top of me,\" Latosha said.\nMarc cried out that he had been shot.\nHayes' neighbors and relatives are saddened, outraged, and fearful that the ongoing violence in Chester won't soon come to an end.\n\"It's a travesty. People need to start talking. They really do and this violence got to stop. Call the police and report this,\" victim's grandmother Dale Hayes said.\n\"I have great grandkids that live down here and my prayers are going out to the family of the child that got shot,\" Chester resident Dawn Smith said.\nSome neighbors are calling for a state of emergency. At a minimum, they want to see some kind of increased police presence.\nMarc remains at Crozer Chester Medical Center. He's expected to come home Wednesday.\nHis mother says it will be a while before the bullet can be removed because of the swelling."}