{"uri": "http://www.delcotimes.com/general-news/20160607/chester-police-still-investigating-why-5-year-old-wounded-as-bullet-goes-through-home-window", "title": "Chester police still investigating why 5-year-old wounded as bullet goes through home window", "dct": "Tue, 07 Jun 2016 08:56:00 GMT", "id": "f9ea80cf611cd166962486916ba9e1a5", "content": "CHESTER >> Boo-Boo has big plans for his sixth birthday next month.\nLatosha Hayes and her fiancé, Marc Andrews, used the happy theme to distract their son, 5-year-old Marc Andrews Jr., known by all as Boo-Boo, in the hospital after being wounded when a bullet tore through a closed window in the kitchen of their Whittington Place home Monday night.\n“It was a stray. The house was not targeted,” Chester Police Chief James Nolan IV said Tuesday.\nAs of Tuesday night, investigators had no motive or suspects in the drive-by shooting.\nAdvertisement\n“There may have been an exchange of gunfire, we are still looking into that,” Nolan said. “There definitely was a group shooting from a car, but whether anyone returned fire has yet to be determined.”\nMore than 30 shell casings, projectiles and fragments were recovered from the scene in the rear of the 400 block of Whittington Place in the William Penn Housing Development, authorities said. Two cars parked on nearby Frank Young Avenue were hit.\nPart of the investigation will be to try to establish what was happening in the neighborhood, who was outside, prior to the gunfire, Nolan said. Anyone with information is urged to call city detectives at 610-447-7908.\nAccording to Nolan, police on patrol heard shots fired and immediately responded to the area shortly before 10 p.m. Numerous calls to 911 were also made to report the incident.\nOne neighbor likened the sound to “a war zone,” according to published reports.\nHayes, a manager for Fare & Square grocery store in Chester, said she had just arrived home from work about 9:30 p.m. Monday. Her two older children, ages 9 and 8, were upstairs playing. She was in the kitchen preparing food with the two youngest children and Marc Sr. when she heard the first shot, She grabbed Marc Jr. and daughter, 4-year-old Mariya, and dropped to the floor, lying over them. Marc Sr. then lay on top of the three of them, as a shield.\n“I’m looking at my window and bullets are coming through,” Hayes said, noting that the curtains fell to the floor.\n“I’m still seeing it. My son sees it,” she said of the ordeal. “Nobody knows what I am going through.”\nHayes said her son remained hospitalized at Crozer-Chester Medical Center, but he is expected to be released on Wednesday.\n“My little son will have a bullet lodged in him,” she said.\nAccording to Hayes, the bullet struck her son’s left side and traveled, lodging in muscle in his armpit area.\nHis father, she said, has a bullet lodged in his spine from an unrelated incident. It’s not something she wants their son to endure.\nHayes does not want to bring her son home to Whittington Place, their home for three years. She does not feel it is safe and has expressed her concern to both the Chester Housing Authority and the Chester Police Department.\nIn the past when she’s heard gunshots, Hayes said she’s always kept her children inside, out of harm’s way.\nBut this time, the bullets found a way into their home, she said.\n“My son is strong,” Hayes said, noting that he wasn’t even upset until he saw the other children upset.\nWith his birthday on July 21, she said Boo-Boo continues to be a willing conversationalist on the subject.\n“He has a lot planned,” she said.\nLate Tuesday afternoon, Hayes turned to Facebook to extend thanks to family and friends for their prayers and concern.\n‘I thank y’all fro the top and bottom of my heart,” she posted. “I am broken but he will be okay.”\nHayes added that Boo-Boo, a fighter, also says “thank you.”"}