{"uri": "http://www.nbcrightnow.com/story/29471644/adult-child-found-dead-in-car-fire-in-franlkin-county-deputies-investigating-it-as-a-double-homicide", "title": "UPDATE: Deputies Arrest Victim's Boyfriend in Double Homicide Case", "dct": "Fri, 03 Jul 2015 21:02:00 GMT", "id": "5b1dd4707e1037ceb1716012467160cb", "content": "UPDATE: FRANKLIN COUNTY, WA. -- Last Thursday, Franklin County Deputies found a woman and a child dead inside a car that had been set on fire. After a lot of work, detectives think they have finally identified the two people in the car and found their killer.\nAfter 5 days, the Franklin County Coroner identified the two bodies found Thursday as around 18-year-old Maria Guadalupe Cruz-Calvillo and her three year-old-son Luis Lopez-Cruz.\nAround 9 o'clock Thursday night, several witnesses reported seeing a large fire near a remote orchard off Scootney Road and Ridge Road. When deputies investigated the car, they discovered two bullet holes that they believe were fired from the inside. And one of the bullets was found lodged inside the three-year-old's body.\nDeputies also found a charred license plate in the car and that led them to 25-year-old Prudencio Flagos-Ramirez. Ramirez had recently started dating Calvillo and lived within a mile of where the bodies were found. Investigators also discovered 9 millimeter amunition hidden in one of Ramirez's sheds.\nWitnesses told deputies that they saw Ramirez, Cavillo and her son leave Ramirez's house that night but never saw Ramirez return to the home. Ramirez is charged with two counts of first degree murder and is being held on one million dollars bail.\nPREVIOUS COVERAGE:\n-------------------------------------------------------------------------------\nFRANKLIN COUNTY, WA - Franklin County Coroner made a presumptive identification on the two bodies found in a burning car in north Franklin County.\nThe bodies are presumed to be Maria Guadalupe Cruiz-Calvillo Date of Birth not confirmed but fits the profile of an 18 year old woman\nThe child is presumed to be Luis Fernando Lopez-Cruz Date of Birth July 9, 2011.\nIt is believed the child is the three year old son of Marie Guadalupe Cruiz-Calvillo.\nThe Coroner’s office is working on dental records to make a positive identification.\nAs a result of the autopsies manner of death is ruled as homicide. Cause of death is pending toxicology results.\n_____________________________________________\nUPDATE:\nFRANKLIN COUNTY, WA- Sheriff Jim Raymond says 25-year-old Prudencio Flagos-Ramirez, from Connell, knew the adult and child victims found dead inside a burned car on Thursday.\nFlagos is sitting behind bars on two counts of first degree murder. Deputies initially arrested Flagos on unrelated charges hours after the bodies were found by two volunteer fire fighters.\nOnce detectives connected him to the murders, he was booked into the jail. Autopsies for the victims are scheduled for Monday.\n_______________________________________________________________\nPREVIOUS COVERAGE:\nFRANKLIN COUNTY, WA- Franklin County Sheriffs Deputies have a man in custody they believe is connected to a disturbing double homicide.\n25-year-old Prudencio Flagos-Ramirez is sitting behind bars on two counts of first degree murder. Deputies arrested him Saturday morning at his house off Harback Road in the county.\nFlagos had outstanding warrants for his arrest, and will be held at the Franklin County Corrections Center until preliminary hearings next week.\nRight now, detectives are looking at other possible people of interest in the case.\nCONNELL, WA - The Franklin County Sheriff's Office is investigating a double homicide after two bodies were found in a burned out car on Thursday night. Sheriff Jim Raymond said the bodies are an adult and a child and he believes they are from the Othello area but their names are not yet being released.\nVolunteer firefighters spotted smoke on Thursday night around 5:45 in north Franklin County, near Ridge Road and Scooteney Road. The two went down a ravine and found a car completely on fire. Firefighters put the fire out and found the two bodies inside.\nDeputies do have a person of interest. The investigation Sheriff Raymond said it is a difficult investigation because of the remote location and lack of witnesses but said they have several resources out working the case diligently."}