{"uri": "http://www.tri-cityherald.com/news/local/crime/article32231835.html", "title": "Teen mother and son identified as victims of double murder, boyfriend held on $1 million bail", "dct": "Mon, 06 Jul 2015 14:38:00 GMT", "id": "aa65902eb7eeb6a964ad51418ea26833", "content": "Family members suspect jealousy may have led to the gruesome slayings of an Othello teen and her 3-year-old son found shot and severely burned in a remote part of Franklin County.\nMaria G. Cruiz-Calvillo, 18, and Luis F. Lopez-Cruz were identified Monday as the bodies found last week inside a vehicle that was set on fire in a ravine near the intersection of Scootney and Ridge roads.\nLuis likely was still alive when the car went up in flames, according to Dan Blasdel, Franklin County coroner.\nLuis would have turned four years old on Thursday.\n“She was a really good person. She was always smiling,” said Karen Rodriguez, a sister-in-law of Cruiz-Calvillo who spoke for the family. “He was a happy kid. He was really playful and loved to be outside.”\nPrudencio Juan Fragos-Ramirez, 25, of Connell, reportedly had recently started dating Cruiz-Calvillo and is suspected of killing the pair.\nFragos-Ramirez was arrested hours into the investigation at his home less than a mile from where the bodies were found. He appeared Monday in Franklin County Superior Court, where Judge Carrie Runge set bail at $1 million.\nRunge ordered Fragos-Ramirez, who has previous convictions for DUI and driving while suspended, held for up to 72 hours while prosecutors determine what charges to file. Prosecutors say Fragos-Ramirez was deported in 2014 and got back into the country illegally.\nThe sheriff’s office initially spelled his name Flagos-Ramirez, but court records show it’s spelled Fragos-Ramirez.\nFamily members had never met Fragos-Ramirez, though Cruiz-Calvillo talked to her mother about a guy she was seeing, whom she apparently referred to by the nickname “Loco,” Rodriguez said.\n“(The family) thinks she never wanted a serious relationship with him,” Rodriguez said. “It’s jealousy.”\nCruiz-Calvillo and Luis had gunshot wounds, Blasdel said. Tests to confirm whether they were still alive when the fire started have been requested.\nFirefighters found the bodies July 2 as they battled the car fire near a large orchard, court documents said. Franklin County deputies discovered the license plates were registered to an Othello man, who told investigators his niece, Cruiz-Calvillo, drove the vehicle.\nFamily members last saw Cruiz-Calvillo the afternoon of her death as she was leaving Othello with Luis for Pasco to make a car payment, court documents said. She routinely went to Pasco to make car payments.\n“We checked with the bank,” Rodriguez said. “She made the payment at 3:43 (p.m.).”\nTwo neighbors saw Cruiz-Calvillo and Luis arrive at Fragos-Ramirez’s home about 4:40 p.m., court documents said. The neighbors recognized the mother and son because they frequent the house on Hogback Road.\nBetween 10 and 20 minutes later, the neighbors saw the pair and Fragos-Ramirez walking towards Cruiz-Calvillo’s car, court documents said. They didn’t see Fragos-Ramirez return to the house and didn’t see him again until about 7 p.m.\nSmoke was spotted coming from the ravine where the bodies were found about 20 to 30 minutes after the trio was seen leaving the home. It took detectives eight minutes to drive from the home to the spot where the bodies were found.\nDetectives were able to track down Fragos-Ramirez for an interview after Cruiz-Calvillo’s brother, Arturo Calvillo, remembered meeting a man who matched the description of Fragos-Ramirez while at a house on church business, court documents said. Calvillo took Detective Jason Nunez to the house, and Nunez contacted a woman there.\nThe woman told Nunez she had a brother who was at the house when Calvillo came over, court documents said. She called Fragos-Ramirez and handed the phone to Nunez, who then set up an interview.\nFragos-Ramirez told Nunez he last had contact with Cruiz-Calvillo about 2:30 p.m. the day she was killed and had not heard from or seen her since, court documents said. Nunez arrested Fragos-Ramirez on an outstanding warrant and booked him into jail.\nAfter Nunez spoke to the neighbors, he interviewed Fragos-Ramirez again, court documents said. Fragos-Ramirez claimed Cruiz-Calvillo came to his house about 5:10 p.m. to bring him cigarettes.\n“He said he last saw (Cruiz-Calvillo) and her son leaving his property in her vehicle,” Nunez wrote in a probable cause affidavit. “He said her son was in the back seat in a child seat.”\nNunez searched Fragos-Ramirez’s home and found three clean boxes of .9-mm ammunition stashed in a tire in a dusty shed on the property, court documents said. Fragos-Ramirez admitted to recently having a .9-mm handgun, but claimed he sold it to Cruiz-Calvillo three days before the murders for $300 “because he needed the money for a party he was throwing that day.”\nFragos-Ramirez claimed his brother, Isabel Fragoza, had seen him sell the gun to Cruiz-Calvillo, court documents said. Fragoza denied the claim and told Nunez he had seen his brother with a handgun recently, but didn’t know what happened to the gun.\n“(Fragos-Ramirez) remarked that if we found the gun used to kill (Cruiz-Calvillo) and her son, we would find his fingerprints on it,” Nunez wrote in the affidavit.\nAuthorities booked Fragos-Ramirez for two counts of first-degree murder after determining he was seen with the victims shortly before they were killed and that he was unaccounted for when they died.\nProsecutors said in court Monday that Fragos-Ramirez could possibly be charged with aggravated first-degree murder, which carries an automatic sentence of life in prison if convicted.\nRodriguez said her family is having trouble understanding how someone could take the life of a child so violently.\n“They couldn’t explain how that person had the heart to do that,” she said. “It was really shocking. It was really hurtful.”"}