{"uri": "http://www.ksl.com/?sid=40826021&nid=148&title=man-who-shot-and-killed-son-himself-had-domestic-violence-history", "title": "Man who shot and killed son, himself, had domestic violence history", "dct": "Wed, 27 Jul 2016 00:00:00 GMT", "id": "a051addd40a16356a9d9cd7de0fa2f9e", "content": "SALT LAKE CITY — A man who police say shot and killed his 8-year-old son before fatally shooting himself had a history of domestic violence, substance abuse and possible mental health issues, according to court records.\nOn Wednesday, Salt Lake police identified those involved in Tuesday's tragic incident as 8-year-old Xavier Lucero-Waters, and his father, Moses Waters, 46.\nPolice were called by Xavier's mother, who is Waters' wife, to their apartment at 561 N. Center, just after noon. When officers arrived, they discovered that the young boy had been shot with an \"improvised firearm.\" The boy's father was dead.\nXavier was taken to a local hospital, where he died a short time later.\nPolice did not provide more details Wednesday about the weapon used to kill the boy.\nWaters, his wife and their son all lived in the Capitol Hill apartment.\n\"I'm devastated,\" social worker Ashley Hoopes, an advocate for children and the homeless, wrote on her Facebook page. \"Xavier Lucero-Waters was one of my favorite kids in The Road Home shelter preschool. And on the weekends, I loved having him in my playgroup. I was always so impressed with his sweet mother, who lived and breathed for her son.\n\"He was big for his age, but he had the most tender heart. He was my son's age so I'd sneak him in Lego guys. He delighted in doing dress up with the donated Star Wars costumes and making fantastic Play-Doh creations,\" she wrote. \"He so wanted to master the board games with the bigger kids. Xavier taught me so much, like you can't judge a book by its cover.\"\nIn her post, Hoopes also criticized the lack of funding for mental health treatment in Utah.\n\"Our system is broken beyond repair, and the latest casualties are a father who suffered from mental illness and his sweet 8-year-old son and now a mother who has lost them both,\" she wrote. \"This is on us — Utah and on our legislators who refused Medicaid expansion. These are the families who are paying the price for that political game.\"\nAccording to court records, Waters was convicted in 2014 of burglary as part of a plea bargain. In exchange for his guilty plea, charges of aggravated assault and domestic violence in the presence of a child were dismissed.\nWaters, who was estranged from his wife and son at the time, came to their house and told them he was going to kill himself before walking away, charging documents state. His wife followed him and with a friend attempted to help him.\nThey invited him into a friend's apartment to talk. But when he became agitated, they asked him to leave and then locked the door behind him, the charges state. Waters re-entered the apartment by throwing a rock through the window.\nA Salt Lake police officer happened to be nearby and heard the breaking glass and subsequent screams. He arrived to find Waters holding his wife around the neck with a razor to his throat, the charges state.\nWaters refused to let go of his wife and told the officer to shoot him, according to a Salt Lake County Jail report. Police attempted to use pepper spray, but it had no effect.\nWaters continued to hide behind his wife to avoid being hit with a Taser by police, according to the charges. Officers were eventually able to successfully deploy a Taser and arrest him.\nWaters was sentenced to six months in jail and ordered to undergo substance abuse treatment.\nIn July 2014, Waters sent a letter to the judge presiding over his case. The letter included an update about his treatment.\n\"I am addressing my existing mental health issues for the first time in my life with medications, counseling and programs,\" he wrote.\nIn December 2014, the judge lifted the no-contact order placed on Waters, allowing him to see his wife and son again. A 2015 court document listed his address as being the Salt Lake homeless shelter.\nIn 2014, Waters served 10 days in jail for intoxication. A charge of criminal mischief was dropped as part of a plea deal.\nWaters had been married and divorced at least twice before, according to court records. He was charged in 2006 with two counts of aggravated assault, domestic violence in the presence of a child, child abuse and retaliation against a witness. Those charges were later dropped when one of the state's main witnesses twice did not show up for a preliminary hearing.\nHelp for people in abusive relationships can be found by contacting the YWCA's Women in Jeopardy program at 801-537-8600 or the statewide Domestic Violence Hotline at 800-897-LINK (5465).\nPhotos"}