{"uri": "http://www.dispatch.com/content/stories/local/2015/11/23/Three-killed-in-police-shooting.html", "title": "Man who police say shot family of four now dead", "dct": "NODATE", "id": "c791fff9c56d92a8a42d0a88c92deedc", "content": "A Hilltop couple and their 7-year-old boy were killed - and their older daughter critically injured - when they were shot Monday inside their home by a man who police shot and killed. Sgt. Rich Weiner, spokesman for the Police Division, identified the dead in the home as John E. Anderson II, 31, and Christina Chaffin Anderson, 30, and their 7-year-old son, Landon Anderson. Their 12-year-old daughter, Makyleigh, also was shot and was in critical condition at Nationwide Children's Hospital late Monday night.\nA Hilltop couple and their 7-year-old boy were killed - and their older daughter critically injured - when they were shot Monday inside their home by a man who police shot and killed.\nSgt. Rich Weiner, spokesman for the Police Division, identified the dead in the home as John E. Anderson II, 31, and Christina Chaffin Anderson, 30, and their 7-year-old son, Landon Anderson.\nTheir 12-year-old daughter, Makyleigh, also was shot and was in critical condition at Nationwide Children's Hospital late Monday night.\nPolice say the family was shot by Barry Kirk, 50, who lived across S. Terrace Avenue from the green house where the Andersons lived.\nVideo: Police, friend describe shootings\n911 call: Victim pleads for help\nKirk died Monday night at Mount Carmel West after being shot by police after they say he fled the Anderson home.\nAccording to Columbus police, a 911 call was made by a woman shortly after 5 p.m. who said that her husband had been shot by an intruder and that the shooter was still in their home.\nShow more...\nThe call came from the 90 block of S. Terrace Avenue, south of W. Broad Street and north of Olive Street.\nThe dispatcher said that other gunshots could be heard during the call.\nWeiner said that when police arrived, Kirk was running out of the Anderson home and had run back across the street. He was shot multiple times by the side of his house.\nThree officers fired their weapons at him and he was hit multiple times, Weiner said. No officers were injured.\nA neighbor said she heard at least 20 shots fired.\nJohn Hillyard, 46, who lives on S. Eureka Avenue, said he saw the officers converge on the green house.\nThe man, later identified as Kirk, then ran from the house and took off around the north corner of the house with police in pursuit.\nHillyard said he couldn't see what happened next but soon heard multiple shots.\nColumbus police detectives are trying to figure out what caused the fatal confrontation.\n\"We have no motive at this time,\" Weiner said. \"We're still trying to figure it out.\"\nDetectives were able to talk to the 12-year-old daughter, who is expected to make a full recovery, Weiner said.\nStunned family members waited for hours until they were told the grim news.\n\"I was supposed to pick up the grandkids at six o'clock. There was no six o'clock,\" said Kim Cremeans, grandmother of the two children.\nThe distraught Cremeans screamed over and over: \"Why did they shoot my baby? Why would someone go in and murder a family?\"\nShe said she'd just spent a great weekend with the kids. Cremeans said that her son and daughter-in-law were hard-working people who made taking care of their children their priority.\nJeff Drown, 51, is a longtime friend of John Anderson's father, who also is named John.\nDrown said he has known the younger John Anderson since he was a child.\n\"He used to go out with me towing. He had grown up to be a good young man,\" Drown said.\nDuring the past year, the younger Anderson had started his own driveway blacktop business, which was going well.\nA brother, who declined to give his name, said that John Anderson had a number of weapons in the house but police said there was no evidence he'd fired a gun.\n\"He was a damn good dude, definitely,\" his brother said.\njwoods@dispatch.com"}