{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-weekend-shootings-violence-20161219-story.html", "title": "Shootings up nearly 50 percent after another violent weekend in Chicago", "dct": "Mon, 19 Dec 2016 09:19:00 GMT", "id": "2c6e3490f33ce38fc76b879984f6e614", "content": "Four people were found dead and another person was taken to the hospital in critical condition following what Chicago police say was a home invasion Dec. 17, 2016. (Abel Uribe / Chicago Tribune)\nForty people were shot in Chicago over the bitterly cold and snowy weekend, including three attacks in less than 24 hours that each left four or more people wounded.\nShootings normally decline when temperatures go down, but not this year in Chicago. At least 80 people were killed in the city in November alone. The deadliest weekend of the year so far was in late October. January started the year with at least 50 homicides.\nThe result has been one of the deadliest years since the 1990s. The number of homicides this year is more than 750 — about 60 percent higher than over the same period in 2015. More than 4,230 people have been shot in Chicago this year, about 46 percent higher than this time last year.\nAmong the attacks over the weekend was a shooting in Fernwood on the Far South Side where four people were killed and one person was critically wounded, according to police.\nInvestigators believe someone in the home may have been selling drugs. A buyer likely came back to the house Saturday, broke in to rob the place and shot the five people, according to preliminary information from police.\nTwo men and two women were killed. Another woman was hospitalized in critical condition. A 2-year-old child was in the home during the shooting. The child was uninjured but was taken to a nearby hospital for observation.\nOn Friday afternoon on the Southwest Side, someone opened fire outside a Brighton Park taco stand and killed 17-year-old Daniel H. Torres as well as Arturo Zizumbo, a 47-year-old bystander. Two other teens were wounded, one of them critically.\nFour people were found dead and another person was taken to the hospital in critical condition following what Chicago police say was a home invasion on Dec. 17, 2016.\nTwenty minutes later on the West Side, four more people were shot in Lawndale. Three teenagers and a 25-year-old man were shot in the 1300 block of South Kedzie Avenue and made it to Mount Sinai Hospital, police said.\nIn another shooting, a man was wounded while in a car on the outbound Eisenhower Expressway early Saturday. He went to Rush University Medical Center with a gunshot wound to the knee. State police believe he was shot in the outbound lanes of the expressway between Ashland and Racine avenues."}