{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-person-fatally-shot-in-south-austin-neighborhood-on-west-side-20161216-story.html", "title": "5 dead, at least 15 wounded in city shootings", "dct": "Mon, 19 Dec 2016 02:54:00 GMT", "id": "526da54d827b4403abac01debf7c53cc", "content": "Five people were killed, including an innocent bystander, and at least 15 others were wounded in city shootings from Friday to early Saturday.\nThe bystander and a second person who died were among four people shot about 3:30 p.m. near 43rd Street and Rockwell Street in the Brighton Park neighborhood near Shields Elementary School.\nAuthorities said several known gang members were gathered in front of a taco stand on Rockwell when a silver car drove through an alley next to the business and parked across the street at the mouth of an alley.\nThen at least two gunmen got out of the car and opened fire on the group, fatally striking a 17-year-old boy named Daniel H. Torres and a 47-year-old man a short distance away, according to police and the Cook County medical examiner's office.\nAn 18-year-old man suffered a gunshot wound and was taken to Mount Sinai Hospital in serious condition while another 17-year-old boy who was shot in the face and neck was in critical condition at Mount Sinai, police said.\nThe 47-year-old suffered multiple gunshot wounds and was pronounced dead on the scene and Torres, of the 4200 block of South Fairfield Avenue, also suffered multiple gunshot wounds and was pronounced dead at Mount Sinai.\nAt the scene, the body of the bystander, identified by neighbors and Ald. Raymond Lopez, 15th, as \"Arturo,\" was lying in snow underneath a blue covering being dusted with snowfall in a curb outside a corner store called Mercado 43.\nThe man was a well-known figure who could be seen walking with a limp through the neighborhood, a form of therapy for a stroke he suffered several years ago, his close friends said.\n“Arturo was a fixture on that corner, he was just a happy man,\" Lopez said.\nA man who grew up in the neighborhood said Arturo cared about the families who lived there and took a dim view of gang strife that had engulfed the area.\n\"He once told my father 'These gang (expletives) are going to kill us one of these days,'\" the man said at a convenience store across from the elementary school. Neighbors said the man could be found most days walking to the taco stand for a cup of coffee or visiting a nearby business that hosted karaoke.\nLopez called the taco stand a “problem building,” saying it was a well-known hangout for local gang members and that he'd worked with police and different city agencies since August 2015 to have the business shut down but without success.\n“And now because of this, we have an innocent man killed. This is unacceptable,” Lopez said.\nThe alderman said he was further troubled by the use of a “machine pistol” by one of the gunman that he said resembles a handgun, but fires assault rifle ammunition at rapid speeds. A similar weapon was recently recovered in the Back of the Yards neighborhood, another part of Lopez’s ward, but this was the first appearance of the weapon in Brighton Park.\n“There’s no reason for a weapon like this to be on the street,” Lopez said. At least 30 bullet shell casings were found at the scene.\nAside from detectives canvassing the area an hour after the shooting, the block where the shooting occurred was quiet with only one homeowner standing watch as police lights flashed in the distance.\nThe woman, who asked not to be identified, said she'd lived on the block more than 10 years and called it a hotbed of gang activity and the longtime home of the Satan’s Disciples gang. She said neighbors didn't dare linger outside so long after a gang shooting in an area local residents called “Devil's Playground.”\nPrior to Friday, Brighton Park had had 56 shootings this year, according to data compiled by the Tribune, about 11 more than 2015, and eight homicides, doubling last year's total.\n\"This is one of the most dangerous neighborhoods in the city. The snow don’t even be stopping it,\" she said, standing in the snow outside her home, pointing to where a man was killed in front of her home more than a year ago.\n“There's definitely going to be a shooting after this,\" she said. \"They do that very well.”\nIn the Belmont Heights neighborhood, a 28-year-old man was killed after he was involved in an argument at a convenience store, police said.\nJust before 10:10 p.m. Friday, the man was involved in an argument with two other people at a store. The two people then followed the 28-year-old man to the 7200 block of West Grace Street. Someone inside a light-colored SUV pulled up alongside the 28-year-old and shot him in the head.\nHe was taken to Lutheran General Hospital where he was pronounced dead at 10:39 p.m. He was identified as Crispin Coliz, of the 4800 block of Rotary Road in Cherry Valley, according to the Cook County medical examiner's office.\nAs officers searched for evidence, children peeked at the crime scene from the window of one home, and another neighbor shoveled snow in the 3800 block of North Octavia Avenue near where a black SUV involved in the shooting had stopped. One resident described the area as a neighborhood where many city workers live. Blue ribbons, typically a sign of support for police, were tied around several trees in the area.\nKeith Jasch said he was inside his home when he heard, \"Boom, boom, boom.\" Though he is familiar with gunshots because he hunts, he figured the noise he heard was from fireworks. It wasn't until he heard paramedics that he realized what happened.\n\"It's definitely out of the ordinary,\" he said. \"It's usually a quiet neighborhood.\"\nAnother neighbor, Kristen Hansford, was walking home from Target when she came upon the crime scene. She has lived in the neighborhood for less than a year and said the loudest it has ever gotten was when people were celebrating the Cubs' World Series victory.\nAs Hansford and Jasch talked about what happened, they figured the shooting must have stemmed from an incident that happened in another area that then carried over to their neighborhood.\n\"If something happens again, it might raise eyebrows,\" Jasch said.\nEarlier Friday, a 52-year-old man was fatally shot in the head at 8:30 p.m. in the 5100 block of South Long Avenue in the Garfield Ridge neighborhood, police said.\nThe man had just gotten into his car when another man approached him and brandished a gun. The 52-year-old then tried to leave the area in his car, and the other man began shooting at him. The 52-year-old was shot in the head and crashed his car into a parked car. He was pronounced dead at the scene.\nAround 8:40 a.m. Friday, a teen was killed on the West Side. The 17-year-old boy was shot in the chest and hand in the 600 block of North Long Avenue in South Austin, police said.\nThe boy was walking when an unidentified person began shooting at him. The teen ran to a nearby property where he collapsed and was later pronounced dead.\nOther shootings:\n• At 4:30 a.m. Saturday, a man was shot and wounded on the Eisenhower Expressway. He went to Rush University Medical Center with a gunshot wound to the knee.\n• In the Humboldt Park neighborhood, a 44-year-old man was grazed in the shoulder and back at 2:50 a.m. while he was driving in the 4300 block of West Haddon Avenue, police said. Two people who were on the street began shooting at the man as he drove by. He was in good condition at Mount Sinai.\n• A 16-year-old boy was shot in the knee while he was walking home about 1:15 a.m. in the 3500 block of West Roosevelt Road in the Homan Square neighborhood, police said. As the boy was walking, a dark-colored SUV approached and someone inside opened fire. The teen was in good condition at Stroger Hospital.\n• About 11:30 p.m. Friday in Humboldt Park, a 23-year-old man was shot in the buttock during a drive-by shooting, police said. The man was standing in the 1300 block of North Lawndale Avenue when someone inside a passing vehicle began shooting at him. He was taken in good condition to Stroger Hospital.\n• An 18-year-old man was seriously wounded in a shooting at 10:55 p.m. in the Back of the Yards neighborhood, police said. He was walking in the 4700 block of South Wolcott Avenue when someone inside a light-colored minivan shot him in the back. He was taken in serious condition to Stroger Hospital.\n• At 8:30 p.m., a 15-year-old boy was shot in the leg in West Englewood, said Officer Hector Alfaro, a Chicago police spokesman. He was in the 6600 block of South Hoyne Avenue when he was shot in the leg. He went to Holy Cross Hospital and his condition was stabilized. The wound may have been self-inflicted, a law enforcement source said.\n• About 6:15 p.m., a 19-year-old man was shot in the 4500 block of South Wood Street, police said. He was walking when someone shot him in the back. He was taken to Stroger Hospital in serious condition, police said.\n• Another attack that left a 27-year-old man wounded happened shortly before 4:30 p.m. in the 10600 block of South Halsted Street in the Washington Heights neighborhood, police said. He was getting into a car when someone shot him in the left foot, left knee and right wrist. He was taken in fair condition at Advocate Christ Medical Center in Oak Lawn.\n• Shortly before 4 p.m., four people were shot in the 1300 block of South Kedzie Avenue in the Lawndale neighborhood, police said. Three men and a boy were walking to a bus stop when they heard shots and were hit, police said. An 18-year-old man was shot in the arm, and another 18-year-old was shot twice in the groin and three times in the thigh. A 16-year-old boy suffered a wound to the right arm, and a 25-year-old man was shot in the right foot, police said. The victims drove to Mount Sinai, where their conditions were stabilized, police said.\n• Just before 1 p.m., a 20-year-old man was shot in the leg in the 3500 block of West Ainslie Street in the Albany Park neighborhood, police said. He was in good condition at Illinois Masonic Medical Center. Police said he was not cooperating with investigators.\nCheck back for updates."}