{"uri": "http://chicago.suntimes.com/news/police-1-dead-2-wounded-after-brighton-park-shoting/", "title": "2 dead, 2 wounded in Brighton Park shooting", "dct": "Fri, 16 Dec 2016 17:25:00 GMT", "id": "6d4094a68045b8b62cbbed6d5c300591", "content": "Two people were killed and two others were injured in a shooting Friday afternoon in the Brighton Park neighborhood.\nA 47-year-old man, an 18-year-old man and two 17-year-old boys were walking down the street at 3:29 p.m. in the 4300 block of South Rockwell, according to Chicago Police. Two people got out of a silver vehicle parked at the mouth of an alley and opened fired at the group.\nOne of the 17-year-old boys, identified as Daniel H. Torres of the 4200 block of South Fairfield, was shot multiple times and taken to Mount Sinai Hospital, where he was pronounced dead at 4:06 p.m., police and the Cook County medical examiner’s office said\nThe 47-year-old man suffered multiple gunshot wounds and was pronounced dead on the scene, police said. His identity was not released Saturday morning.\nThe other two people were taken to Mount Sinai Hospital. The 18-year-old was shot and listed in serious condition, and the other 17-year-old was shot in the face and neck and in critical condition, police said.\nThe 47-year-old man’s body, covered by a blue sheet, could be seen lying in the street, near the curb on the south side of 43rd Street, just east of Rockwell.\nA young woman, through tears, screamed at police and asked them why his body was still there. An officer approached her at the crime scene tape and told her that there was nothing emergency personnel could do to save his life.\n“He doesn’t even look like a f—— gangbanger,” she yelled.\nAndrew Holmes, a crisis responder and frequent presence at shooting scenes across the city, arrived at 43rd and Rockwell about 5:30 p.m.\nAbout 30 minutes earlier, four people were shot at 13th and South Kedzie, police said.\n“All hell broke loose in the last two hours,” Holmes said.\nAt one point, officers had to jumpstart a police SUV that had died so it could block the man’s body from view.\nA man who lives near the scene, who didn’t want to be identified, said he heard at least 12 gunshots."}