{"uri": "http://chicago.cbslocal.com/2016/12/17/police-4-dead-14-wounded-in-shootings-since-friday-afternoon/?e=jZndkJqQXgCFPQ", "title": "Police: 8 Dead, 27 Wounded In Weekend Shootings Across Chicago", "dct": "Sat, 17 Dec 2016 10:44:00 GMT", "id": "b624acefb521ef0056be6f3d90d69cd5", "content": "CHICAGO (CBS) — At least 35 people have been shot — eight of them fatally — across the city since Friday afternoon, according to Chicago Police.\nFour people were killed in the weekend’s most recent homicide incident Saturday afternoon in the Fernwood neighborhood on the Far South Side. Officers were called at 12:39 p.m. to the shooting scene at a 1 1/2-story home in the 100 block of West 105th Street, police said. Four people were found dead with gunshot wounds — two males and one female found inside the home and one female found outside. A fifth gunshot victim, a female who was also found outside, was taken in critical condition to Christ Medical Center in Oak Lawn. Also in the house was a 2-year-old boy who was unharmed. He was taken to Roseland Community Hospital for observation. Police said the incident may be domestic-related and appeared to be an isolated event. Neighbors said all of those shot are related to each other and lived at that address.\nAbout 10 p.m. Friday, 28-year-old Crispin Coliz got into an argument with two males inside a convenience store in the Belmont Heights neighborhood on the Northwest Side, according to police and the Cook County medical examiner’s office. When Coliz got into a vehicle and started driving away, the two other people followed in a light-colored SUV. They pulled alongside him in the 7200 block of West Grace and opened fire, hitting him in the side of the head. Coliz, who lived in the 4800 block of Rotary Road in Cherry Hill, was taken to Lutheran General Hospital in Park Ridge, where he was pronounced dead at 10:39 p.m.\nLess than two hours earlier, a man was shot to death during a robbery in the Garfield Ridge neighborhood on the Southwest Side. Officers found the 52-year-old man at 8:30 p.m. dead with a gunshot wound to the head in a car in the 5100 block of South Long, police said. Someone walked up to him with a gun as he was getting into his car and opened fire as he tried to drive away. His identity has not been released.\nTwo people were killed and two more wounded in a shooting about 3:30 p.m. Friday in the Brighton Park neighborhood on the Southwest Side. A 47-year-old man, an 18-year-old man and two 17-year-old boys were walking down the street at 3:29 p.m. in the 4300 block of South Rockwell, when two people got out of a silver vehicle parked at the mouth of an alley and opened fired. One of the 17-year-old boys, identified as Daniel H. Torres of the 4200 block of South Fairfield, was shot multiple times and taken to Mount Sinai Hospital, where he was pronounced dead at 4:06 p.m., authorities said. The 47-year-old man suffered multiple gunshot wounds and was pronounced dead on the scene. His identity has not been released. The other two victims were taken to Mount Sinai, where the older was in serious condition and the younger in critical.\nThe weekend’s most recent nonfatal shooting happened early Sunday on a party bus driving on the North Side. An argument erupted at 1:53 a.m. and a male on the bus opened fire while it was traveling in the 500 block of West Irving Park Road, police said. One man, 22, was shot in the head and taken in critical condition to Illinois Masonic Medical Center. Another man, 33, suffered a gunshot wound to the chest and was taken to Northwestern Memorial Hospital, where his condition was stabilized.\nA 31-year-old man, who may have been a shooter, had a gunshot wound to the left hand and was also taken to Masonic Medical Center, police said. The circumstances under which that man was shot were not immediately clear, but he was being questioned by detectives early Sunday. No other injuries were reported.\nAt least 21 more people have been wounded in shootings across the city since 3:30 p.m. Friday.\n(Source: Sun-Times Media Wire © Chicago Sun-Times 2016. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)"}