{"uri": "http://www.mynews13.com/content/news/cfnews13/news/article.html/content/news/articles/cfn/2015/4/3/several_people_shot_.html", "title": "4 Bethune-Cookman students shot at party, suspect sought", "dct": "Sat, 04 Apr 2015 02:43:00 GMT", "id": "40071dce42cc6ac108e7923886d64fc2", "content": "DAYTONA BEACH --\nThe search is on for a man who opened fire and injured four Bethune-Cookman University students early Friday at a house party a few blocks away from the Daytona Beach campus, police said.\nThe incident happened just after midnight on Henry Butts Drive, near the intersection of Orange Avenue, a couple of blocks from the Bethune-Cookman campus.\nPolice are searching for 23-year-old Vincent Tyrone Smith, who is considered armed and dangerous.\nAround 10 a.m., a 911 caller provided information that Smith was at an apartment located along Larche Circle Northeast, in Palm Bay.\nSeveral agencies, including the U.S. Marshals Service agents, Palm Bay police and Brevard County deputies, attempted to verify the information that was called in.\nSeveral attempts to make contact with the man believed to be inside the apartment were unsuccessful, police said.\nA perimeter was set up, and the SWAT team was deployed, as well as crisis negotiators. The Brevard County Sheriff's Office's bomb squad also responded and sent its robot inside, but it was later determined Smith wasn't inside the apartment.\n\"Palm Bay Authorities and U.S. Marshalls went to the address there, however, he had just left,\" said Daytona Beach Police Chief Mike Chitwood. \"His girlfriend somehow found out we were coming and she tipped him off.\"\nDaytona Beach police officials said more than 50 people at the party. Smith was kicked out of the party, police said, and that's when shots were fired.\nInvestigators said there were no shooting victims at the scene when crews arrived, but officers saw drops of blood in the driveway.\nPolice then learned four victims drove to Halifax Hospital with non-life-threatening injuries.\nThe victims have been identified as Reginald Graham, 20, of Jacksonville; Vintonisha Smith, 19, of Mirimar; Frank Thomas, 21, of Jacksonville; and Darian Baker, 21, of Jacksonville.\nThomas and Baker are members of the Bethune-Cookman football team, according to the school's official roster.\n\"This isn’t some neighborhood person coming in or some outsider coming in and creating an issue – these are people who have a direct connection to Bethune Cookman University in these two incidents,\" Chitwood said.\nSmith is believed to be driving an orange-colored 2011 Chevrolet Camaro with Florida tag DGK-D87 or temporary tag BFJ-3044, which may still be on the vehicle.\n\"We believe he’s headed down to Miami,\" Chitwood said. \"That’s where he’s from, that’s where he probably has family and friends that he thinks are going to hide him. But I’ve been doing this for 28 years and I can tell you one thing, you can’t outrun an arrest warrant.\"\nAnyone with information on the shooting or Smith's whereabouts is asked to call Crimeline at 800-423-TIPS (8477).\nBethune-Cookman University released the following statement Friday afternoon:\nThe Daytona Beach Police Department responded to an early morning shooting in the 300 block of Henry Butts Street. The off-campus incident did result in four B-CU students being injured and taken to the hospital. The students are currently recovering and all parents have been notified.\nWhile this unfortunate occurrence did take place off campus, B-CU administrators and the public safety department are proactively involved with this investigation. President Jackson is deeply concerned with the violence within the surrounding communities and will take the necessary steps to quickly address the challenges that pose threats to the safety of the campus and students.\n\"We are proud to be a part of this community. Essentially, it is an extension of our campus. We have a long and rich connection and we want to work together to find healthy alternatives for both our campus and the community,\" says President Edison O. Jackson.\nPresident Jackson and his leadership are continuously strengthening their policies and procedures and have complete confidence in their public safety department to keep their campus and students safe and secure. In addition, the president is looking into creating more opportunities to keep students involved with events and recreational activities on campus. The university is committed to increasing its efforts to eradicate violence and negative influences on its campus and within the community. President Jackson plans to meet with key influencers and policy makers to explore the available resources and to discuss future improvement plans"}