{"uri": "http://www.ktnv.com/news/familys-plea-for-return-of-dead-childs-priceless-possession", "title": "UPDATE: Helmet returned to grieving family of 12-year-old", "dct": "Tue, 16 Feb 2016 00:51:00 GMT", "id": "57cfccbcb322bf25fca2d317ac9ec38b", "content": "Autoplay:UPDATE: Helmet returned to grieving family of 12-year oldCONNECTING...XValley child dies, prized possession stolen\nLAS VEGAS, NV (KTNV) -\nUPDATE: One day later, Sincere Manuel's beloved helmet was found inside the stolen car and it was all returned back to the family.\n\"It just means so much to us,\" said Manuel's sister Jannessa Duran. \"It was my little brother's helmet and he wore it all the time obviously since he was a football player. It's just so, so great to have it back knowing that this was his and he wore it.\"\nPolice called the family Tuesday night to say the car was found in a parking lot near Arville Street and Charleston Boulevard. It was parked in a tow away zone. The family feels this was intentional by the thief so it would be noticed.\nWhen the family got to the car to pick it up, the wallet and new pair of shoes were gone. But the 12-year-old's helmet was there.\n\"I just really really feel that somebody saw this story, the sharing of it, or somebody watching the news,\" said stepmom Maddie Manuel. \"I just really feel it in my heart that they saw it and I just want to thank them. Thank you for having such a big heart and doing what you did.\"\nORIGINAL STORY: A family says a thief took off with one of their son's prized possessions, just days after the 12-year-old died.\nSincere Manuel died in an accidental shooting in his home Saturday evening, said family members. On Monday, his sister's car was stolen along with Manuel's beloved football helmet inside it.\n\"He was just such a good kid,\" said aunt Irasema Cairo. \"He just had a great future ahead of him.\"\nRelatives were downstairs when a bullet flew through the wall around 6 p.m. Saturday. Manuel's dad rushed upstairs and found his son with a gunshot to his head. The child was rushed to the hospital, but he did not survive.\n\"We were so close,\" said stepsister Jannessa Duran. \"I love him so much, I just wish he was here.\"\nWith Manuel gone, siblings are left with only his memories, pictures, and possessions.\nThe 12-year-old was passionate about football. He was a running back for Phase 1 Futures youth football team. His prized possession was his football helmet.\n\"There's a lot more to Sincere than just that helmet,\" said Cairo. \"But the fact that that was a part of him, he carried it with him, and he loved it.\"\nJiovanni Duran said she parked her black 1998 Honda Civic in the Macy's parking lot at Meadows Mall. By 2 p.m., Duran's car and her brother's helmet were gone.\n\"We're not trying to get anybody in trouble. We just want Sincere's helmet back,\" said Cairo.\nThe family is pleading for the helmet to be returned in time for Manuel's funeral on Thursday.\nIf you find the helmet or the car, please contact Crime Stoppers at (702) 385-5555.\nCopyright 2015 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}