{"uri": "http://pittsburgh.cbslocal.com/2016/07/17/child-shot-in-pittsburgh-rushed-to-hospital-in-critical-condition/", "title": "Child Shot In Knoxville, Rushed To Hospital In Critical Condition", "dct": "Sun, 17 Jul 2016 23:49:00 GMT", "id": "8012e3126908f49391aeb7382fd7cedd", "content": "PITTSBURGH (KDKA) — A young child was rushed to Children’s Hospital in critical condition after being shot Sunday night.\nAccording to police, it happened around 11 p.m. near the intersection of Grimes Avenue and Zara Street, in the city’s Knoxville neighborhood.\nThe shooting happened on the front porch of the home and a 6-year-old girl named Isis Allen was shot in the head.\n“We believe [the shots] came from outside the house. We are currently speaking with potential witnesses trying to learn more about what exactly happened here and what led up to the shooting,” Assistant Public Information Officer Emily Schaffer said.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nShe was rushed to Children’s Hospital and was last listed in critical condition.\nAccording to our partners at the Pittsburgh Post-Gazette, the victim’s mother was taken to the hospital by police.\nNo arrests have been made and police have not released any suspect information at this time.\n“It’s a very active scene, we’re currently investigating this and we’re following several leads and information that was provided to our investigators on the scene,” Schaffer said.\nA woman who lives next door has been in the neighborhood for 60 years. She thinks the neighborhood is relatively safe and while she didn’t witness the shooting, she heard some noises last night.\n“I just heard cracking. You know. I didn’t see anything,” she said. “I thought it was a just firecrackers.”\nAmy Wadas: “Do you know the people next door?”\nWoman: “The people next door just to say hello to.”\nShe also said she doesn’t know the child who was shot.\n“That is terrible. I’m sorry to hear that,” the woman said.\nAnyone with information is asked to call police."}