{"uri": "http://www.santafenewmexican.com/news/local_news/police-release-names-of-kids-fatally-shot-in-albuquerque/article_ce527e23-3281-519b-b429-964611e3478b.html", "title": "Police release names of kids fatally shot in Albuquerque", "dct": "Thu, 08 Dec 2016 19:00:00 GMT", "id": "342004e1316618aac76b342cc60f43df", "content": "To view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nCandles and stuffed animals left by neighbors rest Wednesday outside an Albuquerque after a deadly shooting. Authorities said George Daniel Wechsler, shot and killed the three children Monday evening as their mother frantically tried to protect them. Wechsle was an Albuquerque native and the brother of one of the stars of ABC’s Revenge television series. Russell Contreras/The Associated Press\nInvestigators said 5-year-old Elijah Mascarenas, 6-year-old Olivia Mascarenas, and 9-year-old Ian Mascarenas died Monday shortly after the mother’s ex-boyfriend unloaded on the family.\nThat former boyfriend, George Daniel Wechsler, 45, later turned the gun on himself.\nAuthorities said Wechsler had briefly dated the 36-year-old mother, Cheryl Mascarenas, who was wounded in the shooting. Mascarenas is listed in critical but stable condition.\n“Evidence shows the mother fought valiantly to try to save her children and get them out of the house,” Albuquerque police spokeswoman Celina Espinoza said.\nPolice say Cheryl Mascarenas recently broke up with Wechsler and asked him to stop calling. A few days before the shooting, police say Wechsler sought to bring the children Christmas gifts.\nLast month, Wechsler was also transported to the hospital and underwent a mental evaluation after threatening to commit suicide, police said. It was not known if that case was connected to the mother’s demand to leave her alone.\nAccording to court records, Wechsler pleaded no contest in 2003 to misdemeanor stalking and petty misdemeanor assault against a family member. He was also arrested in 2004 for reckless driving, but police say he had no felony record.\nSince the shooting Monday, Albuquerque police had refused until Thursday to release the victims’ names despite requests from national media outlets.\nMedia outlets in Albuquerque have so far honored Albuquerque police request to withhold the names of the mother and the children.\n“The Albuquerque Police Department knows the family from the Stagecoach shooting and we as a community [cannot] fathom this unimaginable tragedy,” police said in a statement Wednesday.\nIn a statement, Mascarenas and her former husband, Joshua, thanked Albuquerque police and other agencies for offering support following the shooting.\n“As the parents, we put our children before anything else in this world,” the pair said in a statement. “While divorced, we have always been a family, raising our children together and actively involved with the daily activities of all three kids.”\nThe former couple then asked for privacy and asked that images of their children not be released.\nNeighbors and friends have placed angel figurines and stuffed animals outside the Albuquerque home."}