{"uri": "http://www.kob.com/albuquerque-news/police-three-children-man-killed-in-stagecoach-lane-shooting-incident/4336926/", "title": "Police: Three children killed in Four Hills, shooter identified", "dct": "Tue, 06 Dec 2016 20:43:00 GMT", "id": "63c4278a36ea5662abd60be9b1f1500a", "content": "Kasia Gregorczyk, Jen French and KOB.com Web Staff\nThree young Albuquerque children lost their lives and their mother remains in critical condition at UNM Hospital after a shooting in the Four Hills neighborhood of southeast Albuquerque Monday night.\nAlbuquerque police have released the identity of the shooter. In a press conference early Tuesday evening, police said Danny Wechsler, 45, shot and killed the three children -- a 5-year-old boy, a 6-year-old girl and a 9-year-old boy-- in an attack on the 1500 block of Stagecoach Lane. Police said Wechsler also killed himself.\nPolice said Wechsler, the mother's ex-boyfriend broke into their home on the 1500 block of Stagecoach Lane and waited for the family. Then he shot and killed the children as their mother desperately tried to fight him off.\nAlbuquerque Police Chief Gorden Eden said during an earlier news briefing late Tuesday morning that one child was found deceased inside the house while the other two died either at the hospital or while being transported, Eden said.\nThe 35-year-old woman may be the only witness in the shooting.\n“We have not been able to talk to her, so you can only imagine why we're being so cautious on the information we're releasing,” Albuquerque Police Chief Gorden Eden said. “As far as we know, she's our only witness.”\nThe tragedy started just before 6:30 p.m. Monday evening. Police say Wechsler broke into the family home and waited to ambush a mother and her three young children. Police said there is physical evidence to show the mother attempted to protect the children from the attacker and get them out of the house.\nPolice said two of the children, as well as their mother, were transported to the University of New Mexico Hospital, along with the suspect. Wechsler died from what appeared to be a self-inflicted gunshot wound.\nAuthorities did not release the victims' names at the request of the family, including the children's biological father. Police believe the shooter had a short-term relationship with the mother.\nKOB will withhold the names of the victims until next of kin has been notified. A news crew reached out to the children’s biological father but was unsuccessful. His neighbors said he is torn and not talking to news outlets at this time.\nThough court records reveal the father and the mother divorced a little more than a year ago, social media photos suggest he saw his children frequently and were the center of his world.\nThe mother's parents, who also declined an on-camera interview, said they are seeking answers as to what caused a man to gun down their daughter and grandchildren.\nAll three children attended Manzano Mesa Elementary School. Grief counselors were on hand Tuesday to talk to classmates. Albuquerque Public Schools is protecting the privacy of the families, saying this is the first time the district has ever lost three children at the same time.\nGov. Susana Martinez released a statement Tuesday about the shooting.\n“I'm heartbroken over this horrible and senseless act of violence that has left all of us shaking our heads and asking why. My heart and prayers go out to the family and the mother who is fighting for her life,” she said. “We as a community have gone through tough times this year. And each time, we've rallied together in unity and in prayer. I ask New Mexicans to stand together and show that same strength they've always demonstrated in times of tragedy.”"}