{"uri": "http://www.koat.com/article/police-on-scene-of-possible-shooting-in-se-albuquerque/8468454", "title": "What we know in quadruple Four Hills shooting", "dct": "Thu, 08 Dec 2016 19:43:00 GMT", "id": "84bde8e877b0afdf1ef572811f550d39", "content": "ALBUQUERQUE, N.M. —\nThe following information is from Albuquerque Police Department.\nWhat happened?\nAround 6:30 p.m. Monday, APD responded to the area after a woman called for help saying shots had been fired. Preliminary investigations show 45-year-old George Daniel Wechsler forced his way into a home and waited for a woman and her children to return home.\nWhere did this happen?\nIn the Four Hills neighborhood near Stagecoach Lane and Speakman.\nWho was shot?\nWhen the family arrived home, Wechsler shot a 5-year-old boy, 6-year-old girl and 9-year-old boy and their 36-year-old mother before turning the gun on himself.\nWho was killed?\nOne child died at the scene, two others died at the hospital. The mother is listed in critical condition and has not talked to police. Wechsler died from a self-inflicted gunshot wound at the hospital.\nWho was the shooter?\nPolice say the shooter is 45-year-old George Daniel Wechsler.\nWhat is his criminal history?\nHe does not have a felony criminal history with the Albuquerque Police Department that investigators have found.\nCourt records show that Wechsler plead guilty to misdemeanor stalking and misdemeanor assault in 2002.\nHe was also transported to the hospital and underwent a mental evaluation after threatening to commit suicide in November of 2016.\nWhat was the suspect’s relationship to the victims?\nPreliminary investigation reveals he was dating the mother of the children. She broke off their relationship and asked him not to contact her or the kids.\nPolice say Wechsler asked to bring Christmas presents to the children days prior to the shooting but the mother did not allow him to do so.\nWho is the childrens’ father?\nPolice have not release the name of the children’s father, but we do know the biological father is alive and has asked APD to not yet release the names of his children.\nAre there any other witnesses?\nNo, it appears that the mother appears to be the only witness and she is still in critical condition.\nOther information…\nPolice said there was evidence that the mother fought to protect her kids and try to get them out of the house. While critically injured she attempting to rescue one of her children.\nThe mother was one of the 911 callers.\nThere is no history of any sort of call-outs to the woman’s residence.\nUndercover officers were the first to respond to the scene because they were already in the area for a holiday property crime operation.\nInvestigators were on scene processing evidence in this case for more than 13 hours."}