{"uri": "http://www.wmcactionnews5.com/story/29744836/bpd-1-killed-11-injured-in-blytheville-shooting", "title": "BPD: 1 killed, 11 injured in Blytheville shooting", "dct": "Sun, 09 Aug 2015 19:16:00 GMT", "id": "fecedcf016fcd87a9a29b9b5af03b480", "content": "BLYTHEVILLE, AR (KAIT) -\nA Blytheville shooting killed 1 woman and injured 11 others Saturday, according to the Blytheville Police Department.\nPolice said a domestic dispute at 833 Anderson St. around 11 p.m. resulted in the death of 19-year-old Adline King of Blytheville.\nKing was pronounced dead at the hospital.\nPolice believe an ongoing feud between King and another individual led to the shooting.\nEMS units transported 4 other victims with gunshot wounds to Regional One in Memphis, including 34-year-old Delushun Greene, 20-year-old Alicia Williams, 39-year-old Lloyd Williams and 31-year-old Darrin Woodard.\nAccording to police, 6 other shooting victims with minor injuries went to Great River Medical Center by private transportation, including 31-year-old Christopher Gunn, 25-year-old Anisha Haley, 25-year-old Candace Jackson, 39-year-old Katresa Parker and two male juveniles.\nAccording to a press release, a fight broke out and a 200-person crowd confronted officers at the hospital Saturday night. Officers described the scene as \"chaotic and emotional.\"\nAdditional officers from the Blytheville Police Department, Mississippi County Sheriff's Department and Arkansas State Police were called in for backup.\nPolice said the final victim, 19-year-old Miracle King, was treated at St. Bernards and released.\nAll victims were from the city of Blytheville.\nPolice said the suspects are still at large.\nOfficers are investigating the incident as a homicide and ask anyone with information to come forward.\nPafford Medical Services, whose crews responded to the shooting, posted the following on its Facebook page: \"Our thoughts and prayers are with the people of Blytheville, Arkansas. Overnight more than a dozen victims were shot, resulting in at least 1 death. Please keep the Pafford EMS Medics, Blytheville Police and Emergency Services and Great River Medical Center staff in your prayers this morning as they have worked together to save as many victims as possible.\"\nHear from King's mother tonight on Region 8 News at ten.\nCopyright 2015 KAIT. All rights reserved.\nRegion 8 News App - Install or update on your: iPhone | Android"}