{"uri": "http://www.latimes.com/local/lanow/la-me-ln-san-bernardino-shooting-victims-htmlstory.html", "title": "San Bernardino shooting victims: Who they were", "dct": "Thu, 17 Dec 2015 09:10:00 GMT", "id": "d8aab2fd10de8be52d6d380eace400a2", "content": "A father of six. A free-spirit who befriended strangers in the grocery store checkout line. A mother of three who fled religious persecution in Iran. A woman who was 8 when she and her mother left Vietnam for a better life. The youngest was 26. The oldest was 60.\nThese are the names and stories of the 14 people killed in the San Bernardino shooting on Dec. 2, 2015. They lived across Southern California, from Los Angeles and Orange counties, in the Inland Empire and the San Bernardino Mountains that tower over the valley where the shooting occurred.\nThe list will be updated as more information becomes available. It also includes information about some of the 21 people wounded.\nRobert Adams, 40\nKTLA\nAs an environmental health specialist with San Bernardino County, Robert Adams often inspected pools and food facilities during the construction phase.\nAdams, 40, and his wife grew up in the Inland Empire and were high school sweethearts, said family friend Jenni Kosse. They had tried to have kids for some time, she said, and he adored their 20-month-old daughter, Savannah. He loved taking her to the park and uploaded new pictures of her to Facebook almost every night.\n\"When you saw the three of them together,\" said a distressed Kosse, \"you just wanted to jump in the middle and think, 'I want to have fun too.'\"\nHe always looked out for others. He could sense when someone was angry or frustrated, she said. He'd smile at them and ask, \"How can I help you?\" Almost always, Kosse said, the person's anger would melt away.\nAdams — who wore bright ties and his beard in a goatee — also spent time helping his parents, who donate doves to Inland Empire families who have lost a loved one, Kosse said. They give them away for free, she said, so families can release them at ceremonies.\n\"To be supportive,\" she said, her voice quivering. By Thursday night, a fundraising page set up by friends, who said they were struggling to \"make sense of what makes NO sense,\" had raised more than $20,000 for the widow and young daughter.\n— Marisa Gerber\nIsaac Amanios, 60\nIsaac Amanios immigrated from Eritrea to California in 2000 to escape violence and repression in his home country, his brother said.\n\"Nowhere is safe,” Abraham Amanios said, standing in front of his brother’s home in Fontana. \"It makes you think that wherever I go in public... there is the chance of being threatened or attacked.\"\nNephew Zeke Gebrekidane heard the news of Isaac Amanios' death late Thursday and drove through the night from Tucson to be with family in Fontana, he said.\n\"I was beyond shocked,\" Gebrekidane said. \"It's a very sad scenario. Whether it's Paris, whether it's Colorado, whether it's San Bernardino, when does it end?\"\nAmanios shared a cubicle with shooter Syed Rizwan Farook, said Chris Nwadike, a coworker.\nNwadike said the two of them spoke what he assumed was Arabic — with Amanios clearly the native speaker, often poking fun at Farook's poor delivery.\nAmanios was a family man who tutored his three children with their school work. All are currently in college, Gebrekidane said.\n“He was looking forward to his kids graduating from college,\" he said. \"He came here so his kids could have a better life. It's not just his family affected, but the entire community is affected by this tragedy.\"\nIsaac Amanios' wife, Hiwet, works as registered nurse at Arrowhead Regional Medical Center. He is survived by his wife, sons, Bruk and Joseph and daughter, Milka.\nOn Twitter, Nat Berhe, safety for the New York Giants, said Amanios was his cousin and \"a great human being.\"\n\"Just got word that one of my cousins was among the 14 killed yesterday, I'm so sick right now,\" Berhe said in one Twitter post. Berhe was born in Fontana and played football at Colton High School.\n\"The true terror is that this keeps happening. I still can't believe it. Take a moment to think of the families hurting right now,\" Berhe also tweeted.\n— Ben Poston\nBennetta Betbadal, 46\nBennetta Betbadal fled to America with her family to \"escape Islamic extremism and the persecution of Christians that followed Iranian Revolution.\"\nShe was 18 at the time, according to statement released by her family. Her first stop was New York but she eventually moved to California, where she met and married Arlen Vedehyou, a police officer.\nBetbadal left her Rialto home Wednesday, eager to deliver a presentation to her colleagues in the San Bernardino County Department of Public Health at their meeting at the Inland Regional Center.\nShe would not return to her husband and their three children, 10, 12 and 15 years old.\nBetbadal, who earned a chemistry degree from Cal Poly Pomona, worked as a health inspector and also led a team of restaurant inspectors, said Mark Russell, a friend who was acting as a spokesman for the family.\n\"It is the ultimate irony that her life would be stolen from her,\" the family said in their statement, \"by what appears to be the same type of extremism that she fled so many years ago.\" Read more »\n— Matt Hamilton\nHarry Bowman, 46\nNobody was home at Harry Bowman's apartment in Upland on Thursday evening.\nA package was tucked neatly under the welcome mat on the concrete landing. It had been sent \"priority express\" by his mother from York, Pa. The postage was $44.95.\nIt was addressed to \"Hal.\"\nBowman's name had been released by authorities earlier in the day, along with the 13 other victims of the mass shooting Wednesday in San Bernardino. He was 46.\nBowman was one of the earliest contributors to CREATE, a USC center that studies national security and terrorism, the director said in an email. Bowman, who left the center for a job with the San Bernardino Unified School District, was an expert in spacial data and mapping.\nNeighbors said they didn't really know much about him, or anybody else at the Stoneridge Apartment Homes for that matter.\n\"There's not a lot of socializing,\" said Gina Lugo, 54, who lives in the one-bedroom next door with her mother. \"People just go to work and come home.\"\nShe said they had talked only once, when he advised her to call the management about a problem with the hot water.\nAcross the hall, Dr. Guillermo Saenz, a 29-year-old medical resident, said he knew Bowman had at least one daughter.\n\"He would come out to the pool and teach her how to swim,\" he said.\nReached by phone in York, Bowman's mother, Marion, said that her son had grown up there and moved to California for work more than 15 years ago.\nHe had two daughters, she said, adding that the family wanted to protect their privacy.\nThe package, she said, contained Christmas presents.\n— Alan Zarembo\nSierra Clayborn, 27\nKTLA\n\"I love hanging out with my friends and I love my blooming career in public and environmental health,\" she wrote on her Facebook page, where her profile photo still has the red, white and blue filter honoring victims of last month's terrorist attack in Paris. \"I am dedicated to enjoying my new life, that God so graciously gave me, so I thank Him… and live life to the fullest. I love my life.\"\n\"I love you more than you ever knew,\" her sister Tamishia wrote Thursday morning in a Facebook post. \"You were taken too soon. My heart is broken. I am completely devastated.\"\nShe was energetic, thoughtful and always smiling, said Mary Hale, manager of the Fontana apartment complex where Clayborn had lived for a year and a half.\n\"When I think of Sierra, only one word comes to mind: She was a lady,\" Hale said. \"That's not a word I use lightly. She was a super, super lady.\"\nHale told The Times that Clayborn had frequently said how much she loved her job. \"She was dedicated to her profession, and she loved the opportunities to meet different people,\" Hale said.\nClayborn shared an apartment with a boyfriend, Hale said.\n— Laura J. Nelson and Louis Sahagun\nJuan Espinoza, 50\nJuan Espinoza, the youngest of 13 siblings, was raised in Sonora, Mexico, his nephew Daniel Castaneda said.\nHe immigrated to Indio when he was in his early 20s and worked at the Department of Corrections to put himself through Cal State San Bernardino. He was hired as an environmental health inspector for the county, a job he loved \"almost as much as working on his back yard,\" Castaneda said.\n\"He always mentioned that having an education is first priority and that an education is a treasure that nobody can take away from you,\" said Espinoza's niece, Zhenia Ponce De Leon.\nFor those who first met him, Espinoza seemed a serious person. But his laugh was contagious, and he lived to make his family happy.\nHe was \"everyone's favorite... and he reciprocated by making every one of us feel like we were his favorite, too,\" Castaneda said.\n\"Tio Juan was a hard-working, loyal, honest, and strict person but at the same time was a loving leader and advisor. He was someone who we could rely on and tell all our secrets with,\" his niece said.\nThe shooters, she said, \"took away a piece of heart of everyone who surrounded him with love and respect.\"\nHe is survived by his wife, a daughter and a son.\n— Laura J. Nelson\nAurora Godoy, 26\nAurora Godoy had a wide smile and an open heart, and at the age of 26, the life she had planned for herself was falling into place.\nShe and her husband, James Godoy, had met in 2003 during a Junior ROTC class at Carson High School, her husband said.\nThey dated for about eight years before eloping in 2012. They bought a home in San Jacinto. She gave birth to their son, Alexander, who will turn 2 in January.\nSpeaking by telephone as his son fussed in the background, James Godoy praised his late wife as a devoted mother.\n\"It was all about him,\" James Godoy said of his son.\nThey did not plan on having more children, he added: \"Oh no, one was enough.\"\nOver the years, Aurora Godoy had attended various colleges and a culinary school, and she was a few credits shy of completing her associate degree.\nFor about three years, she worked for the San Bernardino County elections office.\nSince January, she worked as an office assistant in the county's Department of Public Health. She had joined her co-workers on Wednesday for a meeting at the Inland Regional Center.\nOn Thursday afternoon, following a difficult, daylong wait, authorities informed James Godoy of his wife's death.\nCalls have since flooded in and co-workers have set up a fundraising page. But he said he had not yet processed what happened or how to move forward. No funeral arrangements have been made.\n\"Disbelief is the word,\" he said. \"Disbelief.\"\n— Matt Hamilton\nShannon Johnson, 45\nShannon Johnson's studio apartment in Koreatown is a museum to his life.\nMore than two dozen framed concert posters fill the walls of the main room. \"We had tickets to see Gary Clark Jr. tomorrow,\" his girlfriend, Mandy Pifer, said Friday morning.\nIn the kitchen, portraits of relatives hang over a small, round table.\nJohnson had several of the images tattooed on his body: His first wife, his grand-daddies, his father, who died in a grain silo accident in Georgia when Johnson was a small boy.\nHe wanted Pifer to be his next tattoo. They had recently decided to get married and planned to tell their families this month.\nIn the bathroom, a framed collage of business cards hangs over the toilet, mostly from truck stops across the country.\nJohnson drove 18-wheelers for about a decade — with the CB handle Shannondoah — before he gave up life on the road to finish college and settle down. Around 2005, he started working for the Public Health Department in San Bernardino County.\nAt the office, Pifer said, Johnson enjoyed talking about religion with Syed Rizwan Farook, a fellow restaurant inspector. Farook was a Muslim. Johnson was a Christian who dabbled in Hinduism.\n\"He loved the department because he said it was like working in the United Nations,\" Pifer said.\nPifer, a psychotherapist and longtime member of Mayor Eric Garcetti's crisis response team, met Johnson online about three years ago. Six months later, she moved into the apartment across the hall.\nHe awoke each morning to read the news online and get his caffeine fix. He took his coffee with sugar and creamer. He had to be out the door by 4:45 a.m. to make it to work. He would text Pifer from the train.\n\"Have a great day. I love you,\" he wrote Wednesday morning in their last communication.\nSitting in Johnson's kitchen, she struggled to recall details. \"My memory is damaged right now,\" she said.\nIt's a common phenomenon among trauma survivors.\n\"I've studied it,\" she said. \"I've read about it. I've heard about it from clients. Intellectually I understood it. Experiencing it is something different.\"\nUpdate: When the gunfire began, Johnson shielded his co-worker Denise Peraza telling the young woman: 'I got you.' She was wounded but survived. Read her account>>\n— Alan Zarembo\nLarry Daniel Kaufman, 42\nLarry Daniel Kaufman, 42, considered himself a free spirit. He loved horror movies. He often held up the grocery store checkout line because he talked to everyone he met.\nHe refused to get a driver's license, saying he didn't want to give up the daily rides to and from work from his boyfriend of nearly three years, Ryan Reyes. Reyes was the one who dropped him off Wednesday at his job running the coffee shop in Building 3 at the Inland Regional Center, training the developmentally disabled clients who worked there.\nThroughout the morning the couple traded texts and photos. At 10:37 a.m., Kaufman sent what was to be his final photo — a picture of a friend he had met at a comic book conference.\nAbout an hour later, Reyes, 32, received a text from his sister: \"Hey Ry does Daniel work at the Regional Center in Sb? Check the news.\"\n\"Call me ASAP!\" he texted Kaufman. He left messages and texted repeatedly. There was no reply. After false information that he had been wounded, Reyes and Kaufman's loved ones waited 22 hours for word. Authorities needed a description to compare to the dead bodies still at the facility.\nJust under 6 feet tall and around 195 pounds, Reyes said. Black dress shoes with square toes. Khakis. A black polo shirt — the uniform for Coffee N More. No tattoos. Lots of rings and necklaces and one earring on each side — rainbow bars for gay pride.\nOne minute past 24 hours from the last time Reyes heard from Kaufman, his phone rang. The aunt who adopted Kaufman had news: he was gone. Read more »\n— Alan Zarembo\nDamian Meins, 58\nKTLA\nIn an email sent to employees, Juan C. Perez, director of Riverside County Transportation & Land Management Agency, called Damian Meins a \"bright light\" that had been \"extinguished from our world in a most tragic way.\"\nPerez said Meins had spent 28 years working for Riverside County and had recently returned to a position with the Environmental Health Dept. after retiring in 2010.\n\"I will always remember Damian as a caring, jovial man with a warm smile and a hearty laugh,\" Perez wrote.\nMeins was previously a physical education teacher and helped run after-school programs at St. Catherine's School in Riverside, where he played Santa for the children. He was a graduate of UC Riverside, school spokesman James Grant said.\n\"I just want everyone to know that he was a good man,\" said a woman who answered the phone at his home. She identified herself as his daughter but did not provide her name. \"He was an amazing man.\"\nParents and students gathered with school staff on Thursday to remember Meins. One of those parents, Laurie Lee Nusbaum, posted photos on Facebook of a religious mural he painted at the school.\n\"This is such a tragedy and my 7-year-old daughter has learned a part of life that I wish I could protect her from,\" Nusbaum wrote on Facebook.\nRead more: Victim of San Bernardino terror attack is recalled as 'one of the good guys'\n— Megan Garvey and Zahira Torres\nTin Nguyen, 31\nTin Nguyen was just 8 when her mother fled Vietnam with her child and maternal grandparents. The family toiled and saved their paychecks to rebuild after the war in a country they believed was safe. A place where \"younger people would find their rewards through education.\"\nNguyen graduated from Cal State Fullerton with a degree in health sciences. For more than four years, she had worked as a county health inspector. On the job, she screened plenty of mom-and-pop restaurants, and away from work, she made sure to stay in constant touch with aunts, uncles and nearly 30 cousins ranging from age 3 to 41.\n\"You cannot imagine how caring she is. She had such a big heart,\" Emily Nguyen, 16, said of her cousin. \"She never said no to us and would give you anything you asked.\"\nThe extended family united every Sunday for dinner, according to uncle Phu Nguyen. \"Tin was a huge part of our gatherings. Everyone loves her spirit, she is so cheerful and so wonderful to be with,\" he remembered. \"Just days ago, she was trying on wedding dresses and had so much hope for the future.\"\nNguyen and her longtime boyfriend San Trinh had planned to get engaged next year and to marry in 2017. The day before she was killed the couple toasted his 32nd birthday at a shabu-shabu restaurant.\n\"I work day in, day out, saving money. I intended to buy her a new house. We would move her Mom in to live with us. We talked about everything — our marriage, how many kids we wanted to have,\" the mechanical engineer from Westminster said. \"If I could tell people anything from this experience, I'd say: 'Whatever you're planning, don't push it off. Get it done.' \"\nHer mother Vanessa called her daughter \"such a good soul.\"\n\"Only she can understand me — she understood everything I went through,\" said Vanessa Nguyen, sobbing.\nMother and daughter had planned for a wedding at their beloved St. Barbara's Catholic Church, a few miles from their house.\n\"She promised that no matter what, she would return to have her wedding there and now we're having a funeral,\" her mother said. \"What will become of our lives?\"\n— Anh Do\nNicholas Thalasinos, 52\nJennifer Thalasinos said her husband, Nicholas, was a \"very devout believer.\"\nThe couple, who met online and had been together for 14 years, were Messianic Jews. Nicholas Thalasinos wore tzitzit, traditional fringe tassels, as well as a tie clip with the Star of David.\n\"He became born again a couple of years ago, and because of that I had a very strong faith,\" she said, \"so I know that he's in a much better place.\"\nHe evangelized many, she said. \"He wanted to serve the Lord and bring more people to the Lord.\"\nFriends recalled him as man who was always willing to lend a hand.\nThalasinos said her husband, a health inspector, worked with shooting suspect Syed Rizwan Farook. She said that he was aware Farook was Muslim but had never mentioned that his co-worker had any extreme views. \"If he would have ... my husband would have had something to say.\"\n\"They got along,\" she said. \"As far as I know, [Syed] got along with everybody. That's what's so shocking.\"\nThalasinos said she had heard that before the shooting there may have been an argument at the party. She described her husband as very outspoken about Islamic terrorism, with strong conservative politics.\n\"I'm sure that he went down fighting and protecting people,\" she said.\nThalasinos' last public Facebook post, written just hours before the shooting, mentioned receiving a threatening message related to Israel.\n— Hailey Branson-Potts\nYvette Velasco, 27\nOne of Robert and Marie Velasco's four daughters, the 27-year-old was \"full of life and loved by all who knew her,\" according to a statement issued by her family.\nTo John Velasco, Yvette's younger cousin, she was an important influence. When he was looking to choose a career after high school, he asked her for guidance.\n\"She said to go for what I would love to do,\" he said. \"Go for what you what will make you happy and not for money.\"\nHe took took her advice seriously and today he is a pastry chef.\n\"She was a giving person,\" he said. \"By helping out people who needed it.\"\nSince 2014, the Fontana native had worked as an environmental health specialist for the San Bernardino County Department of Public Health, according to public records.\nYvette's sudden death has stunned her loved ones.\n\"We are devastated about what happened,\" the family statement said, \"and are still processing this nightmare.\"\n— Ben Welsh, Louis Sahagun and Matt Hamilton\nMichael Raymond Wetzel, 37\nCourtesy of the family\nAround Lake Arrowhead, Mike Wetzel was a frequent sight, running errands with his six children in tow, three from his first marriage and three from his second.\nHe loved babies, said family friend Arlene Arenas, 40, and could soothe a colicky infant when no one else could.\nHis first year coaching local AYSO soccer, he led a team of five-year-old girls just learning the sport. Their team had a princess theme.\n\"He was super tall, and the littlest of girls thought he was a giant,\" said Arenas, whose daughter played on the team. \"He had no qualms about letting them follow him around, or walking around like a monster, with the little ones shrieking and hanging off his legs.\"\nWetzel graduated from Rim of the World High School in Twin Peaks, Calif., in 1996.\nLast summer, Arenas said she watched Wetzel and his wife, Renee, hold their baby and dance at a summer concert in Lake Arrowhead Village.\n\"We took those small moments for granted, \" she said.\nIn a post on Facebook on Wednesday, his wife had asked for prayers. \"My husband was in the meeting where the shooting happened, \" she wrote. \"I have not been able to get in touch with him. Please please pray that he is OK.\"\nNote: Friends of the family have created a fundraising site for the Mike Wetzel's family.\n— Laura J. Nelson\nPatrick Baccari, 55\nAllen J. Schaben / Los Angeles Times\nPatrick Baccari got up from his table to use the restroom. He had been there for three hours at a holiday training meeting for San Bernardino County food inspectors.\nIt was just before 11 a.m., before a Christmas luncheon was to begin.\nBaccari was pulling a paper towel from a dispenser when he heard a blast. A puff of plaster dust rose from the wall and shards of the dispenser flew into his face.\nHe turned to the other men in the bathroom, who looked at him as if he had caused the commotion.\nBlood ran into his eyes. Then he saw a hole in the wall.\n\"Get down! Get down! Get down!\" he yelled.\nBullets ripped into the towel dispenser, sending shrapnel into his face, blood spilling into his eyes. The rounds pocked the walls as he dove for cover onto the floor. He and another man pushed the door closed with their legs and waited for police arrive. Read more »\n— Jack Dolan, Paul Pringle and Stephen Ceasar\nAmanda Gaspard, 31\nCourtesy of family\nAmanda Gaspard, an environmental health specialist, had agreed to serve as the emcee for the Department of Public Health's Christmas party.\nWhen the shooters entered the conference room where the party was being held, Gaspard dropped to the floor and hid under a table, her parents said. Then she closed her eyes and lay motionless.\nAfter firing multiple rounds, the assailants came toward Gaspard and shot her.\n\"Even while Amanda was lying there bleeding, she was holding [a co-worker's] hand and praying to God with her,\" Ken and Diane Gaspard said in a statement.\n\"They stood over her and could have easily shot her in the head,\" they said. \"We are so grateful to God that they shot her in the leg and arm instead.\"\nGaspard was shot in the lower arm, upper thigh and knee, among other parts of her body. She has more than 20 shrapnel wounds.\nAfter surgery, she learned from TV news that one of the shooters was her co-worker.\nShe is in a lot of pain, and faces a long recovery, her parents said.\n— Matt Hamilton\nMarcus Yam\nThe final shootout took place about three miles from the Inland Regional Center. There, San Bernardino County Sheriff's Deputy Shaun Wallen exchanged gunfire with the attackers.\nAs he did, San Bernardino city police Officer Nicholas Koahou got out of his vehicle to give Wallen cover and was hit in the left thigh. It felt as if he had been punched in the leg, he said.\nFalling to the ground, Koahou said he heard the gun battle rage as more than 400 shots were exchanged.\n\"At some point, you just stop hearing your shots, he said. \"It was overwhelming.\" Read more »\n— Richard Winton\nAnies Kondoker, 42\nShot three times and now released from the hospital, Anies Kondoker, 42, must now grapple with the death of 14 of her co-workers — her close friends.\n\"She's recovering very well, but still going through emotional trauma,\" said her husband of 17 years, Salihin. They have three kids - ages 3, 13 and 16.\nKondoker was shot in the right arm, left arm and in the stomach. She had been walking from the bathroom into the meeting room, when \"bullets started flying,\" her husband said.\n\"Two bullets flew over her head, missed her head,\" he said.\nHe said that she was shocked to learn from him the identity of the shooter: Anies' shy, quiet colleague Syed Rizwan Farook.\nUntil two years ago, Farook, who grew up in Riverside, attended the mosque where the Kondokers have prayed since they were married, the Islamic Center of Riverside.\nHer mind races with thoughts of returning to work. Most painful is the thought of being there without her best friend, Tin Nguyen, who was killed.\nShe \"keeps on thinking, how is she going to see the office, the empty office, empty cubicles?\" Read more »\n— Soumya Karlamangla\nKevin Ortiz, 24\nKevin Ortiz, a county environmental inspector, was shot twice in the leg and once in the shoulder.\nAmid the chaos, the 24-year-old managed to call his wife of two weeks and father to tell them he was alive.\n\"Kevin said he had been shot three times and that he was in pain but he was all right,\" Dyana Ortiz, 23, said. \"Then he said, 'I love you,' and I said, 'I love you.'\"\nSeconds later, the phone call ended.\nOrtiz's family was not surprised he had found the ability to make these crucial phone calls.\n\"That's Kevin; he's a fighter,\" his brother David Ortiz said. \"Through him, the Ortizes get to shine again.\" Read more »\n— Louis Sahagun\nDenise Peraza, 27\nAssociated Press\nAs bullets rained down, Denise Peraza, 27, felt the arm of her male coworker, Shannon Johnson, 45, wrap around her.\nMore than 65 bullets were fired across the conference room, and Peraza and Johnson huddled under a table, using a fallen chair as a shield.\n\"I got you,\" Johnson told Peraza.\nIt would be the last thing he said. Johnson died, but Peraza, shot once in the lower back, survived.\nPeraza has told friends and family members that the doors of a conference room had opened and two people dressed all in black wearing black face masks entered with \"big ol' guns\" and started shooting randomly.\n\"The guys opened fire for 30 seconds, randomly, then paused to reload and began firing again,\" she said.\nAfter she was shot, the shooters were gone, and everything was silent for five minutes. Then suddenly, the doors were pushed opened again, but this time, it was law enforcement officers. Lots of them, and they yelled out: \"Anyone who can move, leave immediately and find cover behind vehicles.\"\nPeraza said they were then helped into the beds of pickups and taken to a safer location.\n\"While I cannot recall every single second that played out that morning, I will always remember his left arm wrapped around me, holding me as close as possible next to him behind that chair,\" Peraza said in a statement.\n\"I believe I am still here today because of this amazing man. This amazing, selfless man,\" she said. Read more »\n— Louis Sahagun\nJennifer Stevens, 22\nJennifer Stevens was shot in the stomach during Wednesday's attack, but is in stable condition after surgery, according to a fundraising page created by a family friend.\nShe was hired last month as an environmental technician for the County of San Bernardino, according to her LinkedIn page.\nStevens attended Redondo Union High School in Redondo Beach, and graduated from UC Riverside this spring, a university spokesman said. She previously worked as an instructor at a surf camp for adults and children.\n— Laura J. Nelson\nJulie Swann-Paez, a health department inspector, went to the department's holiday party with high expectations. She was set to receive an Employee of the Year award and spend time with colleagues.\nInstead her family got a horrifying text message. \"Love you guys. Was shot.\"\nAttached to the message, sent around 11:20 a.m., was a photo of her face as she lay on the floor.\n\"I thought she was dead,\" said her son Nick Paez, 26.\nWhen they finally tracked her down, they learned she had been shot once in the upper thigh and once in the abdomen and needed surgery.\nA bullet shattered her pelvis, her children said.\nThe family waited for hours to see her, but she was in a post-surgery recovery room. Doctors let them into the room for about five minutes around 10 p.m.\n\"They think it's your co-worker,\" Nick Paez remembered telling his mother.\n\"That doesn't make sense,\" she replied. \"They were congratulating him for having a baby.\" Read more »\n— Sarah Parvini"}