{"uri": "http://www.northjersey.com/news/second-man-arrested-on-murder-charges-in-death-of-paterson-teen-1.1318793", "title": "Second man arrested on murder charges in death of Paterson teen", "dct": "Sun, 26 Apr 2015 09:21:00 GMT", "id": "a92ca89661204eadc65b7cfb04aa53b9", "content": "Kevin R. Wexler/ Staff photographer\nPATERSON PRESS |\nPaterson Press\nPATERSON — City police have arrested a second man on murder charges in connection with the drive-by shooting in the 4th Ward last weekend that took the life of a 15-year-old basketball star and left three others wounded, said Capt. Heriberto Rodriguez.\nThe suspect, 20-year-old Hasmeek Coles, was charged with murder, three counts of attempted murder and receiving stolen property and is being held on $2 million bail, Rodriguez said. The victim, Armoni Sexton, was a freshman who had been the leading scorer and rebounder for the varsity basketball team at Paterson Charter School for Science and Technology.\nColes, a resident of the Riverside public housing complex, had been arrested in a separate case in the city’s 1st Ward on gun-possession charges on March 11, three days after his 20th birthday, according to information previously released by authorities.\nRodriguez said Coles was arrested on the murder charge at police headquarters on Friday. But the captain declined to disclose why Coles was at headquarters.\nLast week, Paterson police arrested 20-year-old Gregory Oliver and charged him with murder and attempted murder in the drive-by shooting.\nA news release issued by the Passaic County Prosecutor’s Office on Saturday night said Oliver allegedly fired several shots toward a group of people near the corner of Rosa Parks Boulevard and Godwin Avenue at 8:37 p.m. on April 18. “Coles is alleged to be an accomplice to Oliver,” the prosecutor’s release said.\nA business at that corner, 230 Liquors, is the basis for the name of one of Paterson’s street gangs, known as “230,” according to law enforcement officials.\nRodriguez declined to say why Coles was charged with having stolen property, while Oliver was not. Rodriguez said the investigation is ongoing.\nThe detectives working on the homicide investigation are Sgt. Ronald VanWolde, Jimmy Maldonado, Ricardo Vazquez, Anthony Petrazzuolo, Audrey Adams and Anthony Aceste of the Passaic County Prosecutor’s Office.\nMayor Joey Torres has said the drive-by shooting was retaliation for a previous incident and part of a violent feud between groups from the city’s 1st and 4th wards.\nOliver’s lawyer, Harley Breite, has said his client was wounded in the forearm in a separate drive-by shooting on Garfield Avenue, near Arch Street, at the same time as the fatal incident on Rosa Parks Boulevard. Breite said the shots were fired from the back of a white Chrysler 300 cruising through the area.\nBut Rodriguez and Lt. Patrick Murray, head of the police department’s CeaseFire Unit that investigates non-fatal shootings, said they received no reports of anyone being wounded in a drive-by incident on Garfield Avenue that night.\n“I’m not surprised,” Breite said when told of the police officers’ statements.\nBreite last week accused Paterson police of engaging in “scapegoat justice” in arresting Oliver, saying he was a convenient target because he lives in the 1st Ward. Breite said authorities lacked evidence in making the arrest.\nWhen asked about Breite’s assertions, Rodriguez said, “The detectives of the Paterson Police Department have a proven track record of acting in pursuit of true justice, not so called ‘scapegoat justice.’ Mr. Briete’s impulsive and unprofessional comments are an insult to all of the men and women of the Paterson Police Department.”\nEmail: editor@patersonpress.com"}