{"uri": "http://www.nydailynews.com/new-york/nyc-crime/4-shot-1-slashed-brooklyn-bar-sources-article-1.2258318", "title": "SEE IT: 4 shot, 1 slashed as violence erupts outside Brooklyn bar", "dct": "Tue, 16 Jun 2015 10:55:00 GMT", "id": "fb198e069d65746c248e636a710c0baa", "content": "He was hanging out at a Brooklyn bar to promote his new clothing line when he was nearly killed in hail of bullets.\nA fight broke out, gunfire cracked and patrons scurried for safety about 2:50 a.m. Monday. Four people were shot — one was stabbed — adding to a troubling rise in the number of gunshot victims in the city.\nEugene Davison, 30, was the most seriously wounded in front of D Avenue Sports Bar on Flatbush Ave. in Prospect Lefferts Gardens. Davison, the youngest of 10 children and the father of three, was shot in the neck, but is expected to survive.\n“My brother was not out there causing problems,” said his sister Dolores Williams, who drove to Kings County Hospital from Lancaster, Pa., after hearing about the shooting. “Eugene didn’t have problems with anybody. ... From what we’ve heard it was a stray bullet.”\nPolice statistics released on Monday show the number of shootings citywide is up 10% through Sunday compared with the same time period last year. The number of murders has spiked an alarming 19% — with 150 people killed this year compared with 126 at this point in 2014.\nThe increase in violence comes even as overall crime is down 6.6% across the five boroughs.\nNo one has been arrested in the Monday morning spray of gunfire in Brooklyn. Video surveillance shows a group of men in their 20s fleeing the scene after a fight began inside the bar and spilled outside. One of the victims appears to stumble back inside for help, the video shows.\nThe bar’s owner, Richard Raphael, 37, said the fight started when a man sucker punched another man on the street in front of the bar.\nThe other victims include Marvin Bland, 34, who was shot in the arm, Eric Rollins, 24, who was grazed in the elbow, and William Cheathom, 30, who was shot in the leg and groin. All were treated at Kings County Hospital. Kadeem Earle, 24, was slashed in the back of the head but did not require medical treatment.\nSources said most of the victims were not cooperating with police.\n“Its getting worse,” said neighborhood resident James Jessmon, 55. “It’s getting bad.”\nFor the week ending Sunday, 55 people were shot across the city in 45 different incidents. In the same week last year, there were 21 shooting incidents. Murders for the week were also up — eight this year, compared with five last year.\nA police source said there has been a spate of shootings involving more than one victim. The numbers have not changed significantly from last year. Records show 1.168 people have been struck in every shooting incident this year, compared with 1.165 last year.\nAbout 45% of the shootings last year were tied to street crews or gangs, police said. And many of the shootings this year have been linked to hardcore criminals suspected in multiple shootings.\nThe NYPD launched its Summer All-Out initiative last week, flooding troubled neighborhoods with additional police. The strategy was successful last year in curbing the rise in violence during warm-weather months.\nON A MOBILE DEVICE? WATCH THE RAW VIDEO HERE AND WATCH THE OTHER VIDEO HERE."}