{"uri": "http://www.bradenton.com/news/local/crime/article51873860.html", "title": "Police identify suspected killer of boy, 7, in Miami drive-by shooting", "dct": "Mon, 28 Dec 2015 11:22:00 GMT", "id": "db543fcca80fe78024055d34b74e1e81", "content": "Miami-Dade police detectives are searching for a 19-year-old man they say is responsible for the drive-by shooting that killed a 7-year-old boy in Richmond Heights.\nDravein “Pop” Duke “should be considered armed and dangerous,” police said in a wanted flier issued Monday.\nAccording to investigators, Duke was one of at least four men in a newer-model Dodge Ram. A gunman in the truck peppered the home on the 15100 block of Jackson Street with gunfire on Sunday afternoon, sending people scattering and killing Amiere Castro as he exited a bathroom.\nHe was pronounced dead at the scene.\nThe child, who lives in Homestead with his mother and older brother, was visiting relatives in Richmond Heights when the gunfire broke out. The family originally hails from Pennsylvania.\nOn Facebook, relatives took to mourning the tragedy, posting photos of the child. “I'm so at a loss for words I'm so broken hearted,” wrote the aunt of Amiere’s mother.\nThe killing – the latest in a string of shootings of children and teens in Miami-Dade County this year – is again drawing outrage from community leaders. On Monday, Miami-Dade County Commissioner Dennis Moss called the killers “community terrorists.”\n“We know who these few bad apples are who are terrorizing our neighborhoods. They are our children, our relatives, our friends and neighbors,” Moss said in a statement. “As long as we stand by and say nothing when we know these crimes are occurring or about to occur we will continue to see 7-year-olds gunned down in our community.”\nDuke, who police say is facing a charge of second-degree murder, recently completed one year of probation for third-degree grand theft, trespassing and improper exhibition of a firearm, according to Miami-Dade court records.\nThe former Killian High student was arrested for breaking into a South Miami-Dade home in January, stealing three caged reptiles — a blood-red corn snake, a bearded dragon and a veiled chameleon. He and another teen were arrested four days later at Snakes at Sunset, a reptile store.\nWhen he was arrested, Miami-Dade detectives found a handgun in his jacket pocket. He was arrested on charges of carrying a concealed weapon. He pleaded guilty in May, records show.\nAnyone with information can call Miami-Dade’s homicide bureau at 305-471-2400, or Miami-Dade CrimeStoppers at 305-471-TIPS."}