{"uri": "http://www.mysanantonio.com/news/local/article/Last-of-three-San-Antonio-men-sentenced-in-deadly-9143815.php&cmpid=artem", "title": "Last of three San Antonio men sentenced in deadly MLK Day shootings", "dct": "Mon, 15 Aug 2016 00:00:00 GMT", "id": "9734c0d01d8d6297734fdabdda19d9e3", "content": "The last of three men charged with capital murder in the gang-related shootings last year at an East Side carwash on Martin Luther King Jr. Day has pleaded guilty to two counts of murder.\nAdrian Perkins, 26, waived his presentencing investigation hearing Friday before state District Judge Kevin O’Connell and was sentenced to 35 years in prison, according to court documents.\nPerkins, Jacquay Howard, 32, and Edwin Joseph, 26, had been charged with capital murder after their arrests in the wake of the shootings, which killed Royal Wylie Willrich, 30, and Vontay Jamar Price, 22. Five other people were wounded.\nThe three were known gang members who saw rival gang members and shot at them in a crowd around 10 p.m. Jan. 19, 2015, at North New Braunfels Avenue and Gibbs, police said. The incident occurred just hours after the city’s annual MLK Day march and celebration, which was held nearby.\nVideo surveillance footage of the shooting helped police identify the men, who used an AK-47-style assault rifle, a .40-caliber handgun and a .380-caliber handgun.\nAccording to court documents, Joseph told investigators that he only shot once into the air after Howard pointed out their targets, told him to park, waited a few minutes and led the trio around a fence to begin shooting.\nCourt records indicate Howard told a detective he fired four or five shots at Price and Willrich because they were the first two people he saw and that he fired in self-defense.\nAfter entering a plea, Howard was sentenced last week to 45 years. Joseph, who reached a plea agreement in July, was sentenced Friday to 25 years, according to court records.\nAll three men pleaded to two counts of murder. They will have to serve at least half of their sentences before they are eligible for parole.\nezavala@express-news.net\nTwitter: @elizabeth2863"}