{"uri": "http://wavy.com/2015/07/19/breaking-four-people-shot-in-suffolk/", "title": "Four people shot overnight in Suffolk", "dct": "Sun, 19 Jul 2015 06:13:00 GMT", "id": "44062224e17991dac3f5d18330f99e72", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nSUFFOLK, Va. (WAVY) – Suffolk Police are continuing their investigation after four people were shot early Sunday morning on the 100 block of North Capitol Street.\nMore than two dozen bullet casings littered the scene at the intersection of North Capitol and East Washington Street.\nMonday, police released the victims names. Karlus Robinson, 37, Latay Darden, 29, Darold Lews, 27, and Leon Hamlin, 26, remain hospitalized, but are all expected to recover.\n“I heard them. They kept on constantly shooting,” said neighbor Audrey White. “I heard people hollering. I got scared because I heard the bullets.”\nWhite says a loud fight woke her up around 2 a.m., but it was the gunshots that followed that sent her running for safety.\n“I ran upstairs so the bullets wouldn’t come in through the window and hit me while I was down there,” said White. “I didn’t know what was going on.”\nWhitney Outland jumped out of bed just as confused as White.\n“I just seen light from the guns when they went off,” said Outland. “The first thing I did was go check on my kids.”\nPolice responded to the call around 2:30 a.m. The shots were fired just steps from where Outland and all seven of her young kids were sleeping.\nOutland says one of the victims is her close friend. She says he was shot in the leg.\nOn Sunday morning, Outland came outside to find blood on one of her vehicles and another hit by a bullet. “The radiator from the bullet, it popped, ricocheted and hit the radiator,” she said.\nPolice are asking anyone with information to call the CrimeLine at 1-888-LOCK-U-UP, submit a tip to www.suffolkva.us/crimelinetips, or by texting CRIMES (274637) with the keyword SPDVATIP. Tipsters can remain anonymous and qualify for a reward up to $1,000 if the information leads to an arrest.\nStay with WAVY.com for details on this story.\nNewport News police have been asking the community to start turning in…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}