{"uri": "https://www.abqjournal.com/902735/police-investigating-large-crime-scene-in-four-hills-neighborhood.html", "title": "Children among 4 victims in Four Hills shooting", "dct": "Mon, 05 Dec 2016 19:05:00 GMT", "id": "5a42e466814783dfe230f04384be9d17", "content": "ALBUQUERQUE, N.M. — A woman and three children were rushed to the University of New Mexico Hospital trauma center after a shooting in Albuquerque’s Four Hills neighborhood Monday night, according to police.\nBut authorities were tight-lipped with details about the shooting, which left the prosperous southeast neighborhood blocked off with crime tape and crawling with officers late into Monday night.\nAround 10:30 p.m., police spokesman Fred Duran addressed reporters and said three children and a woman were “involved” in the shooting. The department later posted on social media that the women and children were all taken to the hospital.\nAlthough the Journal has heard reports from multiple sources that at least one child was killed, police wouldn’t confirm that information.\n“There are children involved, there is an adult involved. However, the status is unknown at this time,” Duran said.\nNeither Duran nor Police Chief Gorden Eden, who briefly answered questions outside the crime tape earlier in the night, would say what condition the victims are in, their ages or how they know each other.\n“We do not have a clear understanding of their relationships (to one another),” Eden said. “We depend on UNMH to treat patients before we start asking them questions.”\nHe said detectives were investigating to gather more information.\n“We have detectives currently at the hospital trying to interview victims as well as detectives that have arrived at the scene and are now interviewing people in the neighborhood,” he said.\nEden wouldn’t clarify whether the suspect had been shot, was dead or was in custody. He told reporters no suspects were at large. Officers were called to the area near Stagecoach and Sagebrush Trail SE around 6:30 p.m. Duran said more than one home on Stagecoach SE had been designated as a crime scene, but he didn’t detail what happened where.\n“There are a couple of houses involved, and we’re trying to figure out everything that is going on,” he said. “The field investigators are investigating the scene right now.”\nMultiple ambulances could be seen leaving the scene around 7 p.m., and shortly after, rescue workers were seen rushing another person into an ambulance that sped away with its lights on. The mobile crime van arrived around 9 p.m. and marked units were posted, blocking the wide curvy streets for hours.\nThe incident appeared to have taken place at a two-story house with a three-car garage on Stagecoach Lane. A black SUV could be seen parked in the house’s driveway with all of its doors open.\nOfficers and detectives were seen going in and out of the garage next door as well.\nPreston Rel, who lives in the area, said he heard several gunshots before police arrived.\n“I heard between 15 to 25 gunshots,” he said. “It sounded like a high-powered rifle.”\nHe said after he heard the shots, he turned on the police scanner and went to check on a friend who lives in the neighborhood.\nSeveral other neighbors milled about the streets and in front of houses decked out with Christmas lights. They asked questions and watched investigators going in and out of the crime scene Monday night, but many said they did not know the family that lives in the house."}