{"uri": "https://www.fbi.gov/memphis/press-releases/2015/alleged-members-of-gangster-disciples-indicted-for-roles-in-five-attempted-murders", "title": "Alleged Members of Gangster Disciples Indicted for Roles in Five Attempted Murders", "dct": "Mon, 28 Sep 2015 00:00:00 GMT", "id": "d8dda721e54e814b913b6db8b8b27a2f", "content": "WASHINGTON—Six alleged members of the violent Gangster Disciples Gang have been indicted by a federal grand jury for their roles in the attempted murders of five teenagers in South Memphis, Tennessee. Three alleged gang members previously had been charged in this case.\nAssistant Attorney General Leslie R. Caldwell of the Justice Department’s Criminal Division and U.S. Attorney Edward L. Stanton III of the Western District of Tennessee made the announcement.\nRanito Allen, aka Nito, 35; Florence Anthony, aka Nikki, 36; Edwin Carvin, aka Ren, 38; Brandon Milton, aka Lil Folk, 30; and Erik Reese, aka E, 35, all of Memphis, Tennessee, were charged in a superseding indictment unsealed today with five counts of attempted murder in aid of racketeering and related firearms offenses. In addition, Candice Wesley, 29, of Memphis, was charged with being an accessory after the fact.\nAccording to the superseding indictment, the defendants are members of the Gangster Disciples, which is a nationally-known organized street gang that originated in the Chicago area and spread to other regions of the United States, including the greater Memphis area. The superseding indictment alleges that members and associates of the Gangster Disciples engaged in acts of violence, including murder, attempted murder and aggravated assault, as well as narcotics distribution and other criminal activities.\nSpecifically, the superseding indictment charges the defendants with participating in the attempted murders of five teenagers in South Memphis on or about June 21, 2014. According to the superseding indictment, the defendants did so for the purpose of gaining entrance to, or maintaining or increasing their positions in, the Gangster Disciples.\nTony Coburn, aka Blue, 26; Robert Mallory, aka Rambo, 33; and Almeda Burgess, aka Big Heavy, 28, previously were charged in this case. Mallory remains charged in the superseding indictment. Coburn pleaded guilty on July 28, 2015, to his role in the shootings, and Burgess pleaded guilty on Sept. 9, 2015, to being an accessory after the fact.\nThe charges and allegations in the superseding indictment are merely accusations, and the defendants are presumed innocent unless and until proven guilty.\nThis case is being investigated by a multi-agency task force consisting of the FBI; the Bureau of Alcohol, Tobacco, Firearms and Explosives’ Memphis Multi-Agency Gang Unit; the Memphis Police Department; the Shelby County, Tennessee, Sheriff’s Office and the Atascosa County, Tennessee, District Attorney’s Office.\nThe case is being prosecuted by David N. Karpel of the Criminal Division’s Organized Crime and Gang Section and Assistant U.S. Attorneys Jerry Kitchen and Sam Stringfellow of the Western District of Tennessee. The Shelby County District Attorney’s Office has provided substantial assistance."}