{"uri": "http://www.nola.com/crime/index.ssf/2013/02/bourbon_street_shooting_suspec_3.html", "title": "Bourbon Street shooting suspects allegedly caught on video released by NOPD", "dct": "Mon, 11 Feb 2013 02:39:42 GMT", "id": "165a9322e0b09748f58107cfc43776c5", "content": "The NOPD on Sunday released a private citizen's video of the Bourbon Street shooting that wounded four people -- three of them innocent bystanders -- during Mardi Gras 2013 festivities Saturday night. Detectives are seeking three suspects wanted in the shooting, according to a New Orleans Police Department news release.\nPolice said the shooting erupted in the packed 400 block of Bourbon Street around 9:30 p.m. after two of the suspects and one of the victims, an 18-year-old man, started arguing. The suspects left, then returned shortly with a third suspect and approached the 18-year-old. One of the suspects then shot the 18-year-old three times, police said.\nThe 18-year-old man was shot in the stomach and listed in critical condition, police said. The spray of bullets hit a 22-year-old woman in the chin and right foot, and a 21-year-old woman was shot in the left leg. A 29-year-old man was shot in the buttocks. The three bystanders were all in stable condition, police said.\nAround 1 minute 40 seconds in, the video shows an eerie moment where gunshots are heard, followed by screams and sounds of chaos. Revelers in beads and costumes can be seen panicking and running.\nPolice described one of the suspects as approximately 18-22 years old, medium complexion, 5 feet 7 inches to 5 feet 8 inches tall, with a slim build wearing a black wool beanie hat with white stripes.\nA second suspect, they said, is 20-25 years old, 5 feet 10 inches tall with a heavy build, beard and mustache, medium complexion with earrings and wearing a black and white bandana around his head.\nPolice said the third suspect was approximately 5 feet 8 inches to 5 feet 9 inches all with a heavy build and a beard.\nPatrick Clay, 21, an LSU student from Mandeville, said he was standing on the corner of of Bourbon Street and St. Louis when suddenly he saw a crowd running and heard shouts that people were shooting.\n\"Everyone immediately started running and the cops immediately started running towards where people were running from,\" Clay said.\n\"I was with a group of about seven people and at that point we all just kind of grasped hands and made our way through the crowd as soon as possible,\" he said.\n\"We were pretty scared, but at that point, I was just more worried about taking care of my friends,\" he said.\nIn spite of the shooting, crowds on Bourbon Street remained strong throughout Saturday night. Many revelers said they were undeterred by the shooting. Others said they were not surprised.\n\"It's kind of been like that. You just hope it doesn't happen to you,\" said Lyle Robelot, 26, of Baton Rouge. \"Maybe for some of the tourists, it would stop them from going. But being from here, it probably doesn't hit us as hard.\"\nA New Orleans man, who declined to give his name, said he and his friends heard about the shooting before they went to Bourbon Street, but decided to go ahead anyway. They discussed their plan of action if they were to hear gunshots, he said.\n\"I referred to the five D's from (the movie) 'Dodgeball': dodge, duck, dip, dive, and dodge,\" he said. \"It's unfortunate that stray bullets hit innocent bystanders, but it's not gonna keep people from going to Bourbon.\"\nAuthorities ask anyone with information on these suspects or this shooting to contact Detective Michael Flores at 504.658.6707 or Crimestoppers at 504.822.1111."}