{"uri": "http://miami.cbslocal.com/2015/07/31/teen-charged-in-accidental-shooting-to-appear-in-court/", "title": "Report: Teens Passed Gun Around Before Deadly Accidental Shooting", "dct": "Fri, 31 Jul 2015 16:18:00 GMT", "id": "2a61b182644811ba05fe3b34040c6ab5", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nFORT LAUDERDALE (CBSMiami) – A South Florida teenager charged with manslaughter in the accidental shooting death of his friend during what’s being called deadly gun play, made his first appearance in juvenile court Friday afternoon.\nThe 14-year-old boy was arrested by Broward Sheriff’s Office deputies Thursday afternoon and charged with manslaughter for the fatal shooting of his friend Charlie Martin, also 14.\nDuring Friday’s court hearing, Broward Circuit Judge Michael Orlando ordered the teen be held at least until an August 13th hearing in order to give prosecutors time to decide how to proceed with the case. Prosecutors need to decide whether he’ll be charged and tried as an adult, according to the judge.\nWhen the hearing was over, the teen’s attorney said he did not intend to cause any harm.\nThe Broward Sheriff’s Office said the teen lives at the home in Cooper City where the shooting happened.\nAccording to a police report, the two 14-year-old boys and the victim’s 16-year-old brother were playing with the gun in the garage of the home when it went off.\nNobody else was home at the time.\nThe report states the boys found the teen’s handgun in a gun box that was inside a cardboard box. When they found the gun, the alleged shooter said he took the gun out and noticed the gun had a magazine in the wall of the gun. A second magazine was also in the gun box, the teen told police, which was loaded with ammunition. The teen said he took the first magazine out of the gun and saw it was unloaded. He then told police that he pulled the slide back on the gun and saw that it didn’t have a round in the chamber.\nThe teen told police he pulled the trigger several times and that the victim’s older brother took the gun from him and also pulled the trigger several times. The alleged shooter said the victim also played with the gun and pulled the trigger. The defendant told police that when he took the gun back from the victim, he pulled the trigger and the gun went off.\nThe victim was shot in the head.\nHe told police he had “no idea how a live round got into firearm.”\nAfter police obtained the gun, according to the report, they determined the magazine was loaded with 14 rounds and the gun had one live round in the chamber. The empty magazine was found on the ground of the garage.\n“It’s with a real heavy heart that we have this tragedy that youngster lost his life,” said Sheriff Scott Israel said Thursday. “Our deputies arrived at the scene and we come in contact with three juveniles. One of whom was tragically deceased. It looks like he died of a gunshot wound,” Sheriff Israel said.\nHomicide detectives scoured through the home on NW 41 St. near Palm Ave. and Stirling Rd. Thursday and interviewed the boys for hours before arresting the 14-year-old and charging him with manslaughter.\nThe homeowner told CBS4 his family is going through a hard time and did not want to talk about what happened.\nPeople who live nearby are torn up by the tragedy.\n“For something to happen to a child is absolutely devastating. I feel for the parents, I feel for the community because this isn’t that type of place,” Karen Kriger said.\nBSO, coincidentally, has been planning to have a firearms safety class next Tuesday in Cooper City. The class will focus on safety lessons for children ages 11 to 14. It will discuss topics like properly securing firearms and the dangers of guns.\nThe victim’s family set up a page to help raise money for funeral costs as well as money for the family to help deal with the tragedy. For information, click here."}