{"uri": "http://www.pjstar.com/article/20151014/NEWS/151019713", "title": "Police make four more arrests in connection to the Tommie Forest slaying", "dct": "NODATE", "id": "0e2e032198f01fc2e21b0d372c746277", "content": "PEORIA - Peoria police say the shooting of four teens, one fatally, in a home invasion last weekend wasn't a random act.\n\"At this point, it doesn't appear that the suspects selected a house at random,\" said Peoria Police Lt. Scott Cook on Wednesday. \"It doesn't appear to be a random act of 'let's go down the street to do a home invasion.'\n\"This was a selected location for some specific reasons,\" he said. \"At this point, I can't go into what those reasons are.\"\nHis comments came as police announced four more arrests in Saturday morning's home invasion that led to the death of 14-year-old Tommie T. Forest III.\nShow more...\nSamuel T. Clay Jr., 20, of Peoria was arrested without incident Tuesday evening, according to a news release issued Wednesday by the police department. Also arrested was Demerious D. Clark, 18, of 823 N. Spring St.\nLater Wednesday, police announced the arrests of Dontarius N. Berdin, 20, and Kainen I. Lacy, 21. They are looking for two more suspects: Kiangelo G. Marshall, 18, and a 17-year-old youth whose name has not yet been released.\nClay was booked into the Peoria County Jail on charges of first-degree murder and home invasion in connection with Forest's death. Clark was in custody on unrelated charges when he was arrested in connection with the fatal shooting. Lacy was taken into custody Wednesday night at the Peoria Police Department. He was booked on charges of home invasion and murder. No further information about his arrest was released.\nForest was found dead early Saturday in the backyard of a home in the 2400 block of North Flora Avenue from a single gunshot to the head. The Peoria High School freshman had been at a sleepover with friends at a neighboring house.\nNo formal charges against either man have been filed in Peoria County Circuit Court in connection with the killing. Both could appear Thursday in court to be formally charged.\nClark, however, was ordered held on $125,000 bond in an Oct. 7 incident in the 700 block of East Corrington Avenue in which he allegedly shot at a person. He was charged Wednesday with aggravated discharge of a firearm and reckless discharge of a firearm in connection with that incident.\nFew details were released in the shooting that occurred in the 2400 block of North Flora Avenue.\nThree other teens were shot in addition to Forest. Two were found in the 2400 block of North Flora Avenue - the same block as where Forest was found - and one was found in the 2400 block of North Ellis Street. All three teens suffered non-life-threatening injuries, according to police.\nSo far, police have not publicly pinpointed the triggerman in the homicide. Another man also has been charged in connection with the homicide. Alex F. Collins, 21, of 2805 W. Wardcliffe Drive, is being held on $2 million bond, charged with first-degree murder and home invasion.\nAndy Kravetz can be reached at 686-3283 and akravetz@pjstar.com. Follow him on Twitter.com/andykravetz."}