{"uri": "http://www.myfoxdc.com/story/29665029/juvenile-shot-southeast-dc", "title": "3-year-old girl accidentally shot and killed by sibling, sources say", "dct": "Thu, 30 Jul 2015 00:45:00 GMT", "id": "6fc23046215c3ca3b41dfe13517654f8", "content": "A 3-year-old girl was shot and killed Wednesday night by one of her siblings who accidentally fired a gun found inside of their apartment.\nThe shooting happened around 8:15 p.m. in an apartment complex in the 600 block of 46th Place in Southeast D.C., police say.\nThe young girl was identified by authorities as Dalis Cox.\n3-year-old girl accidentally shot and killed by sibling, sources say\nSources close to the investigation said the child’s mother, Jasmine Johnson, was cooking dinner on Wednesday night when she heard a pop from her children's bedroom. Her youngest daughter, Dalis, was shot in the chest.\nPolice sources said that either Dalis' 10-year-old sister or 7-year-old brother shot her by accident.\nAccording to their uncles, the two other Cox children are now with their father.\nD.C. police went above and beyond their normal duties Wednesday night. When they got to the scene, they did everything they could do to save the young girl’s life. They didn't even wait for the ambulances and fire trucks to get the complex. They just put her in the back of their car, put lights and sirens on and got her to the nearest emergency trauma center in Prince George's County in Maryland.\nSadly, the police couldn't save Dalis. She died at the hospital.\nThere are many questions in this case as the police investigation continues.\nHow did the children get access to the firearm? Who brought the gun into the housing project? Was Dalis' mother even aware there was a gun in her home?\nDalis’ great aunt is a retired Capitol police officer. After visiting Johnson, Mary Rhone said still doesn't know where the gun came from.\n“I really don't know because Jasmine has a lot of people who come to her house, so I don't know whether somebody brought it in -- you never know.” said Rhone.\nJohnson, who has two other children ranging from six months to 17 years old, was at home with friends and family on Thursday. Her cousin said she was distraught.\n\"At this point, it's about keeping her calm,\" said Johnson's cousin, Deborah Fletcher. \"She's thinking about her other children and the whole thing was getting her calm. She lost her child.\"\nDalis' great aunt is disappointed in how the child was apparently killed.\n“I see people getting guns and they don't know gun safety,” said Rhone. “They have to know gun safety because there are kids around and you have to be aware that kids are everywhere.”\nThere are a lot of questions about whether the gun was legal. No gun in D.C. is legal unless it has been registered with the police department.\nAt a Thursday afternoon news conference, D.C. Police Chief Cathy Lanier said, \"The firearm has been determined to be illegal. It's not legally registered. We do have that firearm, so the investigation will have to figure out where that gun came from, how it got in the house. If there is any criminal liability, somebody will be charged.\"\nIt is illegal to have a gun in public housing. Also, depending on whose gun it was, federal law prevents anyone under the age of 18 from possessing a handgun.\nRight now, the other children, including the one believed to have accidentally fired the gun, are staying with their father.\nRelatives said that counselors and social workers will need to help everyone in this family.\nDalis' uncles have started a gofundme page to raise money for a funeral. For more information, go to www.gofundme.com/4v5dnvxpw"}