{"uri": "http://fox13now.com/2014/03/28/man-sentenced-for-role-in-midvale-triple-murder-apologizes-in-court/", "title": "Man sentenced for role in Midvale triple murder apologizes in court", "dct": "Fri, 28 Mar 2014 22:20:00 GMT", "id": "4a581fff02d587a908f4670e8464ab48", "content": "SALT LAKE CITY -- It was a tearful apology from the man closely connected to a triple murder in Midvale last February.\nDavis Fotu learned his fate Friday during a sentencing hearing. In exchange for his testimony against the accused killer, Davis Fotu is sentenced to serve three years in jail, and three years on probation. With tears in his eyes, Fotu apologized to the victims' family members, but did they believe it was heartfelt?\n\"I'm sorry for even being there,” Fotu said. “It took me a year to find out what happened in that living room, and I'm all over the news about testifying. They asked me, ‘Are you telling?’ and I'm like, ‘Yeah, I'm telling; he killed three people for nothing.’\"\nHe was referring to the man accused of being a cold-blooded murderer: David Fresques, who’s headed to trial for allegedly gunning down three people in a Midvale home last year. The victims were Omar Jarman, Shontay Young and Danielle Lucero. Vicky Myers was also shot in the chest but survived.\nFotu will now serve jail time for obstruction of justice. The plea deal is so Fotu will testify against Fresques. In court, he turned around to address family who lost loved ones during the senseless act of violence.\n\"I'm so sorry for even being there,” Fotu said. “I will do whatever. I will carry that cross until he's convicted. I'm sorry.”\n\"Do I believe we've heard the whole truth? No, but I think we've got enough that I'm just grateful that he made the choice that he did,\" said Cathy Candelaria, who is Omar Jarman's sister.\nThe family of all three victims said closure won't come until justice is served, and even then their wounds will take a long time to heal.\n\"I'm very sad today, happy that this thing is finally moving on,” Andy Lucero said after Fotu was sentenced. “Two down, one to go. I know I'm sad. I don't have the words. Let's hope everything, let’s hope that the state of Utah will be able to prosecute this guy because he's the menace of society, always has been and always will be.”\n\"Once the trial is done and over with, that will be my sense of closure,” said Shontay Young’s brother, Sean Young. “We are taking little steps to try and get there.”\nDavid Fresques pleaded not guilty to the aggravated murder charges he's facing. His trial is scheduled for March of 2015."}