{"uri": "http://www.cleveland.com/lakewood/index.ssf/2016/12/lakewood_shooting_of_muslim_te.html", "title": "Lakewood shooting of Muslim teen may have been targeted, civil rights group says", "dct": "Thu, 01 Dec 2016 17:07:00 GMT", "id": "019c8e0f5e8afc311c67d6a28a13edf0", "content": "LAKEWOOD, Ohio -- A Muslim civil rights organization says that a 16-year-old Lakewood boy was subjected to anti-Islamic slurs and was shot for wearing an Islamic head covering.\nThe boy did not suffer serious injuries after the weekend dispute. The man charged in the shooting, Denzel Johnson, 26, of Lakewood remains in jail.\nThe Cleveland chapter of the Council on American-Islamic Relations said that Johnson called the teen a \"terrorist\" and made reference to the Taliban before the encounter that led to the Saturday night shooting.\nThe Lakewood High School student was wearing a kufi, a traditional Islamic head covering, as he walked home from his part-time job, according to a press release from CAIR-Cleveland. The boy was shot in the arm, and he was treated and released from MetroHealth.\nJohnson was arrested several hours later. He is charged with one count of felonious assault in Lakewood Municipal Court, court records show.\nJohnson's case was bound over to county court, and his initial appearance is scheduled for 10 a.m. Friday, records show.\nLakewood police Sgt. Steve Spaetzel said investigators are not looking into the case as a possible hate crime.\nPolice say that the duo exchanged words, and Johnson fired because he \"felt threatened,\" Spaetzel said. Spaetzel had not heard that Johnson used those terms when speaking to the teen, he said.\nCAIR-Cleveland is requesting that police investigate possibility that the shooting was motivated by anti-Islamic sentiments and intends to ask the prosecution to ask the presiding judge to deny Johnson bail at his Friday appearance, the release says.\n\"According to the alleged victim, there are clear indicators that this crime was motivated by ethnic and religious hatred, and we believe it should be investigated with that possible bias motive in mind,\" CAIR-Cleveland executive director Julia Shearson said in the release.\nIf you'd like to comment on this post, please visit the cleveland.com crime and courts comments section."}