{"uri": "http://www.newsnet5.com/news/local-news/oh-cuyahoga/some-are-calling-the-shooting-of-a-lakewood-teenager-a-hate-crime", "title": "Some are calling the shooting of a Lakewood teenager a hate crime", "dct": "Fri, 02 Dec 2016 17:26:00 GMT", "id": "cfa2565fd04ae85df112190d8c38bc32", "content": "Autoplay:Lakewood teen shotCONNECTING...\nLAKEWOOD, Ohio - Was a Lakewood teenager targeted and shot because he is Muslim?\nThat is what one family and organization is alluding to. The 16-year-old was shot in the shoulder on Saturday, Nov. 26, while walking home from work in Lakewood. The victim says he was targeted because he was wearing a Muslim head-covering called a kufi.\nHe says the man who shot him shouted racial slurs at him and called him a \"terrorist.\" New 5 tracked down a witness to the crime, who is from Miami but was visiting family in Lakewood for Thanksgiving. He was outside when he saw the shooting happen.\n\"I saw like people across the street arguing and they walked in front of me,\" Jack Stanley said.\nStanley said he was out on his family's porch in the 1300 block of West Clifton Boulevard when the incident began. He said he was trying to get better cell reception when he noticed the two men arguing nearby.\n\"They were in a heated argument,\" Stanley said. \"He shot and then he ran.\"\nPolice arrested and charged Denzal Johnson with felonious assault. The victim was a student at Lakewood High School. Stanley said he raced to help him after the shots rang out.\n\"I was telling him, like, 'Are you shot or not?' I took out my flashlight on my phone and I'm like yeah you are, so I grabbed him because he was not walking straight and I sat him down on the balcony and I was telling him to put pressure on his wound,\" he said.\nThe victim is reportedly recovered from the shooting and back in classes at Lakewood High.\nThe Executive Director of the Cleveland chapter of the Council on American Islamic Relations, known as CAIR, wants the shooting to be investigated as a hate crime, Executive Director Julia Shearson said the victim was attacked because of his religion.\nThose details are not in the Lakewood police report and Stanley says he did not hear anyone shout anything that was racist or racially charged.\nAccording to the latest FBI statistics on hate crimes, which date back to 2015, there is a 67 percent increase in the number of hate crimes against Muslims.\nJohnson's bond was upped from $10,000 to $100,000 in court on Friday. A move that members of CAIR are praising."}