{"uri": "http://www.wmbfnews.com/story/32602245/florence-county-deputies-investigate-after-child-reportedly-shot", "title": "Funeral arrangements set for 12-year-old boy killed in accidental shooting in Florence Co.", "dct": "Fri, 05 Aug 2016 05:30:00 GMT", "id": "76e8d885e4ffbabdf85e209f7244d8f2", "content": "FLORENCE COUNTY, SC (WMBF) – A 12-year-old boy was killed and one child was injured after being accidentally shot by another child at a home in the Coward area of Florence County Tuesday evening, according to officials.\nThe child who was fatally shot was identified as 12-year-old Mason Powell, of the Coward area, according to Florence County Coroner Keith von Lutcken.\nAccording to Maj. Michael Nunn with the Florence County Sheriff’s Office, the incident happened in the 4000 block of Circle Drive in the Coward area of Florence County. The Florence County Coroner was on the scene as of 6:40 p.m.\nAt 7:15 p.m., Florence County Coroner Keith von Lutcken confirmed a 12-year-old boy, later identified as Powell, died as a result of this accidental shooting. He said, \"Right now it's in the preliminary stages of the investigation but everything we’ve seen at the scene and examining the child and everything, statements we have taken and everything at this time, it does appear to be an accident.”\nInitial reports from law enforcement officials and the coroner's office indicated the victim was 9 years old. After the coroner obtained a copy of the child's birth certificate, he then confirmed the victim was 12.\nAccording to von Lutcken, the victim was shot by another child in the home. He added a third child was also injured in the incident and taken to an area hospital, where he was in stable condition as of Tuesday night.\nWMBF News talked with the victim's aunt the night of the shooting. Janice Powell said she was checking on the owners of the home where her nephew was killed. She said, \"It was awful, just heartbreaking to find out the little boy that had so much in life ahead of him, had to go so soon.”\nPowell added that the entire family is in disbelief. \"He was a very sweet little boy. He would come to church and everyone loved him. He just, its broken everybody’s heart, their just so broken over it. He would light up your heart, he would,\" Powell said.\nAn autopsy is scheduled for Thursday morning at the Medical University of South Carolina in Charleston, von Lutcken stated.\nA visitation for Powell will be held from 6 p.m. to 8 p.m. Friday, August 5 at the Carolina Funeral Home at 215 E. Highway 378 Bypass, and a funeral service will be held at 11 a.m. on Saturday, August 6 at The Bible Temple, at 195 Gause Canal Road. Details on these services can be found here.\nA GoFundMe page has been set up to assist the family with funeral expenses for Powell. Donations can be made here.\nCopyright 2016 WMBF News. All rights reserved."}