{"uri": "http://www.ksbw.com/news/salinas-double-homicide-victims-suspect-identified/34976328", "title": "Salinas double homicide victims, suspect identified", "dct": "Sat, 29 Aug 2015 00:33:00 GMT", "id": "360ef8544d701a3a062caaa515871f03", "content": "SALINAS, Calif. —\nThe man accused of stalking his estranged wife, attempting to kill her in Salinas, and slaying her aunt and uncle, was identified in court documents Friday morning.\nCourt documents state that the suspected killer is Sammuel Ejaz, 50, of Garden Grove, Calif.\nDocuments also identify the aunt and uncle who were shot to death Thursday morning outside a federal office building as Felicidad Legaspi, 51, of Salinas, and Oliver Legaspi, 64, of Salinas.\nEjaz's 32-year-old estranged wife was not identified. She is recovering in a trauma center from gunshot wounds and is expected to recover.\n\"She’s serious but stable. We know that law enforcement officers have talked to her again today, and she’s able to communicate with them,\" prosecutor Jeanine Paccione said.\nEjaz was booked into the Monterey County Jail on two counts of premeditated murder, attempted murder, and spousal abuse. Jail guards placed him on 24-hour suicide watch.\nPolice Chief Kelly McMillin said Ejaz worked in health care and is of Pakistani descent. The wife and her family are Filipino.\nNeighbors of Felicidad Legaspi and Oliver Legaspi described the Salinas couple as hardworking and pleasant.\n\"I’m shocked, I really am. They're really good people,\" said neighbor Gail Rapacon.\nAt 8:45 a.m. Thursday, two people were murdered and two others critically wounded after a quadruple shooting unfolded outside the U.S. Social Security Administration office on the 900 block of Blanco Circle.\n\"This incident was purely domestic violence,\" Police Cmdr. Vince Maiorana said.\nMaiorana said the husband and wife were having marital conflicts. The woman wanted to get away from her husband, so she drove from their Garden Grove home to Salinas to stay with her aunt, uncle, and cousin, he said.\n\"The wife had come up to Salinas to get away from martial difficulties they were having in Southern California,\" Maiorana said.\nEjaz decided to follow and stalk her, police said. He found her Thursday outside the Social Security office while she was with her family. They argued until Ejaz pulled out a 9mm handgun and opened fire on everyone, according to police.\nThe woman's aunt and uncle died at the scene. Ejaz's wife and her 28-year-old cousin, Alfaro Legaspi, were also shot and rushed to a trauma center in critical condition.\nWitness Mark Keszler told KSBW that the gunman showed little emotion immediately after the shooting.\n\"The scariest part of it was that he was so stoic. He just didn’t have any kind of emotion, anything in his face. That was really chilling. It was like watching a horror film,\" Keszler said.\nMore than 10 people called 911. Officers surrounded and locked down the area. The suspected shooter was pointed out to officers by witnesses, and he was taken to the police station.\n\"Our suspect completely confessed to what he did,\" Maiorana said.\nIf convicted of premeditated murder with special circumstances, Ejaz could face the death penalty, prosecutor Jeanine Paccione said.\n\"We haven’t charged it that way, but we have the opportunity to do that later,\" she said."}