{"uri": "http://www.nbcmiami.com/news/local/Second-Arrest-Made-in-Mass-Shooting-at-Nightclub-278424801.html", "title": "Second Arrest Made in Mass Shooting at Nightclub", "dct": "Wed, 08 Oct 2014 03:25:00 GMT", "id": "83a456e43c6e4f95045e9b4ceebb9455", "content": "A second teen was arrested Tuesday in the shooting of 15 people at a Miami nightclub.\nThe 16-year-old juvenile was charged with one count of accessory after the fact (attempted first degree murder) and 14 counts of accessory after the fact (aggravated battery) for his alleged role in the Sept. 28 shooting at The Spot.\nThe teen told police he was at the club during the shooting but denied knowing the other person charged, 17-year-old Will Campbell, who was arrested Monday, according to the arrest affidavit.\nBut Campbell told detectives Monday that he knew the 16-year-old and that they were both in the club on the night of shooting, the affadavit says. Detectives also said that Campbell’s and the 16-year-old’s Facebook accounts showed pictures of the two together.\nPolice believe Campbell was the triggerman in the mass shooting at The Spot. Campbell is being charged with attempted first-degree murder and 14 counts of aggravated battery with a firearm.\nPolice Chief Manuel Orosa said detectives had been looking for Campbell throughout the weekend before taking him into custody Monday afternoon. Police said Campbell has been talking with detectives with his mother present.\nChief Orosa said the shooting stemmed from a fight at Norland Senior High School.\n“One of his friends got involved in a fight, and when [he] and his friends arrived at The Spot, they found the other person involved in the fight there,\" Orosa said. \"He was told that [another patron] was the other juvenile involved in the fight. So he took out a gun and shot that juvenile, who’s in critical condition at Jackson Memorial Hospital. He also shot at the crowd as he was running away, hitting 14 other people.\"\nPolice said since Campbell is still under 18, he will go through the juvenile justice system for now.\nOrosa said Campbell didn’t have much of an arrest history. The chief said Campbell had arrests for obstructing a police officer and possession of marijuana.\nCampbell was arrested just days after The Spot's manager Tiffany Johnson was arrested and given a notice to appear in court for allegedly selling liquor without a license.\nJohnson, 31, was arrested after agents found bottles of liquor behind the bar during an inspection of the facility. The bar only had a license to sell beer and wine."}