{"uri": "http://www.mcall.com/news/breaking/mc-pa-rockne-newell-ross-township-shooting-guilty-20150529-story.html", "title": "Rockne Newell pleads guilty to killing 3, gets three life sentences", "dct": "Sat, 30 May 2015 02:20:00 GMT", "id": "3f399440d06a7654c51dc2f5114a3492", "content": "STROUDSBURG — A Monroe County man pleaded guilty Friday to homicide for gunning down three people at a 2013 municipal government meeting because he was angry about being forced off his debris-strewn land.\nRockne Newell was sentenced to three consecutive life prison terms, plus 61 to 122 years. Relatives of the victims looked on as he changed his plea three months after a judge ruled that the 61-year-old disabled junk dealer was competent to stand trial.\nJudge Joseph P. Cronin Jr. read a narrative written by prosecutors that detailed Newell's alleged actions, and asked Newell if he agreed. Newell simply said \"yes,\" Monroe County District Attorney David Christine said.\nGiven the chance to speak, Newell began what sounded like an apology to the wife of one of his victims, and then changed course. For the next 40 minutes, he talked about his perceived victimization that led to the shootings, Christine said.\n\"He believed there was a conspiracy to deprive him of his rights, and all he wanted to do was live on his property,\" Christine said.\nIn the months leading up to the shootings, Ross Township officials had condemned Newell's property and then bought it at a sheriff's sale, saying he owed thousands of dollars in fines and had generated complaints that he lived in a storage shed, built an illegal culvert and used a bucket outside as a toilet.\nNewell packed a rental car with guns and ammunition and drove to the August 2013 municipal meeting in Monroe County, authorities said.\nHe used a Ruger Mini-14 rifle to blast a barrage of gunfire through a wall into the meeting room and fired at people trying to flee. When he ran out of ammunition, Newell retrieved a revolver from the car, and returned, but was tackled by two men attending the meeting and shot in the leg during the scuffle, authorities said.\nRoss Township zoning officer David Fleetwood, Gerard Kozic and James LaGuardia died of their injuries. Three others were wounded.\n\"I wish I killed more of them!\" Newell shouted when a state trooper arrived on the scene, the trooper said.\nDuring Newell's preliminary hearing in November 2013, prosecutors played audio of the shooting rampage and its aftermath. In it, Fleetwood told a 911 dispatcher that he'd been shot in the stomach and identified Newell as the shooter.\n\"I can't move. … Please hurry, please hurry,\" he said.\nHe died at St. Luke's University Hospital in Fountain Hill about an hour later.\nLinda Kozic, who was shot in the leg, could be heard urging her 53-year-old husband, Gerard, to breathe and \"stay with me.\"\nIn a jailhouse interview with the Pocono Record newspaper three weeks after the shootings, Newell said, \"I'm sorry innocent people got hurt, though I know 'sorry' doesn't fix anything.\""}