{"uri": "http://www.nbcdfw.com/news/local/19-Year-Old-Man-Dies-Others-Wounded-in-Dallas-Shooting-409147855.html", "title": "19-Year-Old Man Dies, Others Wounded in Dallas Shooting", "dct": "Thu, 05 Jan 2017 04:49:00 GMT", "id": "102b0bff6e3fe13638a584890b2bfeae", "content": "It only took a few hours for the city of Dallas to notch its first homicide of the new year.\nChristian Dawson, 19, was shot and killed in the early morning hours of New Year's Day during a party at the Azure Banquet Hall in the 9200 block of Skillman Street.\nDawson, a sophomore at Langston University in Oklahoma, was visiting family for the holidays.\nHis mother, Audrey Dawson, said the last message his father gave him New Year's Eve was to be careful.\n\"His dad explained to him, you know, just be safe. There's a lot of things that go on New Year's Eve. Be careful,\" she said.\nAs the 19-year-old engineering student partied with friends, his mother and the rest of the family were having a party of their own. The mood quickly changed shortly after midnight when Audrey Dawson noticed she had a missed call. She called back and Christian's friend picked up. He was frantic.\n\"He said, 'Ms. Dawson, Ms. Dawson, Christian got shot,'\" she recalled. \"I just went numb.\"\nChristian's cousin, Amber German, was also at the party, though she stayed upstairs to watch her child. She said she could feel something was wrong.\n\"The atmosphere shifted really quickly,\" German said, recalling the screams that went up inside the home as the news spread. \"It's like a screech that you won't forget, ever.\"\nThe family rushed to the hospital, arriving shortly after the ambulance that carrying Christian arrived. He died soon after.\n\"It's unbearable, you know. Your child is not here. You're just waiting to find out who caused this,\" Audrey Dawson said.\nThe family said police told them a fight between two groups at the party ended in gunfire. Christian was at the wrong place at the wrong time.\nA few days after the murder, German had a surprising message for her cousin's killer.\n\"I don't hate them,\" she said. \"It may not mean much coming from me, but I forgive them.\"\nThe willingness to forgive comes from the family's deep religious faith. That same faith is what gives them confidence that Christian's killer will be caught.\n\"You took someone that was special. You took away someone who had a dream. You took away someone who had a mother, father and a brother,\" Audrey Dawson said, speaking directly to her son's killer. \"I know they will be caught.\"\nOther patrons were also injured and sought treatment for injuries that were not life-threatening.\nAnyone with information about this incident was asked to call Dallas police at 214-671-3682 or 214-671-3632."}