{"uri": "http://www.10tv.com/content/stories/2015/08/11/columbus-ohio-4-year-old-critically-wounds-3-year-old-in-accidental-shooting.html", "title": "4-Year-Old Critically Wounds 3-Year-Old In Accidental Shooting", "dct": "Tue, 11 Aug 2015 16:18:00 GMT", "id": "f818a9e62d41d5c9c43422c150721dc7", "content": "A 3-year-old girl was accidentally shot by her 4-year-old brother at a home on Glenwood Avenue Tuesday.\nPolice say the gun was loaded, ready and sitting out within reach of the children.\n\"It's horrible, I couldn't imagine going through it,” neighbor Amber Litton said.\nLitton woke to flashing lights and emergency vehicles outside her house. They were there to help the 3-year-old girl next door.\n\"My kids play with them all the time,\" Litton said.\nThat's why it was shocking for Litton to learn a gun had been left out and picked up by the little girl's 4-year-old brother.\n\"It's our understanding it was recovered from a common area of the house and was loaded ready at hand,\" Columbus Police Detective Jay Fulton said.\nPolice say the mother, her boyfriend and three kids were staying with the homeowner. The boyfriend was at work. His gun was left out at the home. The little boy got ahold of it and it discharged at close range to his sister.\nDuring the 911 call, the caller can be heard explaining a child was playing with the gun and another child got shot in the back of the neck but the child was breathing and conscious.\nPolice believe the family had the gun ready, fearing for their safety after recent problems. Litton said she’s nervous because she had no idea her children had been around it.\n\"Yes, because she's been over there quite a few times especially in the past three years,\" Litton said.\nPolice think the family narrowly escaped a real tragedy. They hope it's a lesson for all.\n\"Just hope that this can serve as a reminder to keep these firearms secured,\" Det. Fulton said.\nOnce the investigation is complete, detectives will talk with the prosecutor's office about possible charges.\nSafeKids.org offers these tips to keep your kids safe around guns:\nStore guns in a locked location, unloaded, out of the reach and sight of children.\nStore ammunition in a separate locked location, out of the reach and sight of children. Keep the keys and combinations hidden.\nWhen a gun is not in its lock box, keep it in your line of sight.\nMake sure all guns are equipped with effective, child-resistant gun locks.\nIf a visitor has a gun in a backpack, briefcase, handbag or an unlocked car, provide them with a locked place to hold it while they are in your home.\nLeaving guns on a nightstand, table or other place where a child can gain access may lead to injuries and fatalities."}