{"uri": "http://www.jamestownsun.com/news/local/4130460-i-didnt-realize-he-touched-many-people", "title": "'I didn't realize he touched that many people'", "dct": "Thu, 06 Oct 2016 10:16:00 GMT", "id": "ea76358c7c720f1c0ee1951e9323b365", "content": "1 / 4\nSANBORN, N.D.—Amanda Chadwick said her son, Ethan Jerod Chadwick, was always the center of attention and trying to cheer people up when they were sad. Ethan died in an accidental shooting on Sunday night in Sanborn, almost a week before his 13th birthday, Chadwick said.\nThe Barnes County Sheriff's Office is not releasing any information about the shooting death of a 12-year-old boy that occurred in Sanborn on Sunday night, including the identity of the boy who died. Deputy Pat Sand said the incident is still under investigation.\nChadwick said Ethan's death was an accident that happened at his paternal grandparents' house in Sanborn. Ethan and a friend were handling a gun they expected to be unloaded, and \"it got bumped the wrong way,\" she said.\nEthan had been through hunter safety classes and was familiar with gun safety, Chadwick said. She said she wants Ethan's story to show that mistakes can happen to anyone.\nEthan was a seventh-grader at Barnes County North Public School. Chadwick said Ethan was a social butterfly, and he could make friends with anybody. Ethan's classmates made a video with pictures of Ethan, many that his mom said she hadn't seen before.\n\"I knew he was special, but I didn't realize he touched that many people,\" Chadwick said.\nEthan used to get in trouble for talking in class all the time and making other kids giggle, Chadwick said. She said he would get in trouble, but always own up to his mistakes.\nEthan's paternal grandmother, Jeanine Altringer said he was always respectful. When other kids would run away when caught breaking the rules, he would stay.\n\"People would say Ethan was a grown man in a little boy's body,\" Altringer said. \"He was so mature for his age.\"\nAltringer said the Rev. Mark Haines of Our Savior's Lutheran Church in Sanborn said that Ethan was a leader in the church. Ethan would talk with him before church or if he was having trouble with something, Altringer said.\nChadwick lives in Valley City, and Ethan's father, Jerod Altringer, and his parents live in Sanborn. Ethan knew many people in both communities, but Sanborn was home, Chadwick said.\nChadwick said Ethan would walk into J&L Bar and Grill in Sanborn, slap a dollar on the counter and ask for an orange juice. It didn't matter if that was the price of the drink or not.\nSandy Opp, Chadwick's mother, said Ethan learned about football teams just so he could argue with everyone about whichever team was their favorite.\n\"He loved jokes and always had a funny video to show us,\" Opp said.\nChadwick said Ethan wanted to run his paternal grandfather, Bill Altringer's, construction business when he grew up.\nAltringer said Ethan liked to help him with his dozer service, especially running the equipment.\nEthan didn't care what anyone else did, he just did his own thing, Chadwick said. Ethan liked riding his BMX bike, playing basketball and archery. He also participated in go-kart racing in Jamestown. Ethan loved everything about derby cars, Chadwick said.\n\"He had everything figured out,\" Chadwick said. \"He could have been anything.\"\nEthan loved his friends and would spend all day with them if he could, Chadwick said. He was close with all his friends' parents, she said. Ethan and his younger sister, Alexa, were inseparable, Chadwick said.\nThere has been an outpouring of support, Opp said, from social media messages to neighbors visiting.\n\"It helps to have people care and reach out so you don't feel so alone in your grief,\" Opp said.\nChadwick said the family wants the biggest going away party for Ethan, so after his funeral on Friday, people are invited to line Main Street in Sanborn with derby cars, all-terrain vehicles and mud trucks.\nThe funeral service for Ethan will be at 3:30 p.m. Friday at Barnes County North Public School. Visitation will be from 5 to 7 p.m. today at Sacred Heart Catholic Church in Sanborn and one hour before the service at the school on Friday afternoon. A prayer service will be held at 7 p.m. Thursday evening at the church.\nThere will also be a tribute to Ethan at 2:30 p.m. Monday at Barnes County North Public School. Students will release balloons, and there will also be balloons for sale and root beer floats for $1 to benefit Ethan's family."}