{"uri": "http://www.news-star.com/article/20150513/NEWS/150519886", "title": "Child injured after finding gun", "dct": "Sun, 29 Jan 2017 02:45:35 GMT", "id": "89acac4a6ec585612dd722b3ca02c65b", "content": "A Pottawatomie County toddler was hospitalized in Oklahoma City Wednesday for treatment of an accidental gunshot wound after he reportedly discovered a firearm in his mother's purse, the undersheriff reported.\nA Pottawatomie County toddler was hospitalized in Oklahoma City Wednesday for treatment of an accidental gunshot wound after he reportedly discovered a firearm in his mother's purse, the undersheriff reported.\nA state trooper noticed a speeding vehicle with its hazard lights flashing and made a traffic stop, where he discovered the injured child and provided a police escort to St. Anthony Shawnee Hospital.\nPottawatomie County Undersheiff Travis Palmer said the child, an almost 3-year-old boy, got into his mother's purse and found a firearm that discharged, causing an injury to his arm.\nThe incident occurred at a home in the Pottawatomie County panhandle area northeast of Shawnee, Palmer said, prompting the mother to take that child to the emergency room.\nOklahoma Highway Patrol Trooper Troy Thompson was patrolling the general area of SH 18 and was northbound en route to Lincoln County when he saw a vehicle go through the stop sign at Moccasin Trail Road at high rate of speed, he said.\nThe vehicle had its emergency flashers on, Thompson said, so he believed that something was wrong.\nHe initiated a traffic stop and discovered the child with a bleeding arm, he said, and heard from the mother why they were on their way to the hospital.\nThe trooper, who gave the mother a police escort to the Shawnee hospital, helped her get through congested noonday traffic and other areas of construction, he said.\nWorking with his OHP dispatchers while en route, he said hospital personnel were informed about their pending arrival and were ready and waiting for the child.\n\"I was glad to be at the right place at the right time to help,\" the trooper said.\nPalmer said deputies responded to the hospital to take a report on the incident; the child was transferred to an Oklahoma City hospital for further treatment.\nPalmer, who said the child's injuries were not believed to be life threatening, didn't release that child's name or other information about the investigation.\nHe said deputies are looking at this case as a \"terrible accident.\""}