{"uri": "http://www.al.com/news/birmingham/index.ssf/2016/12/man_21_charged_with_capital_mu_1.html", "title": "Man, 21, charged in deadly shooting of teen during 'illegal gun transaction' now in custody", "dct": "Mon, 02 Jan 2017 06:08:47 GMT", "id": "22d8210948b1f06b3d96d82b9879ad01", "content": "A 17-year-old McCalla boy was shot to death during an illegal gun transaction in Hueytown, and now police have filed formal charges against the accused shooter.\nHueytown police Chief Chuck Hagler on Wednesday afternoon announced two capital murder charges against 21-year-old Deion Dewayne Jones, of Dolomite. He is charged in the Tuesday slaying of Colt Coggins. Jones already is wanted for felony assault in an unrelated crime.\nThe charge is capital, Hagler said, because the killing happened in the course of a robbery, and because the shots were fired into a vehicle. It appears, he said, that Jones was planning to rob Coggins during the gun deal.\nJones surrendered to the Jefferson County Jail Wednesday evening. He was booked in at 5:16 p.m. and is being held without bond. Hueytown investigators about 9:30 p.m. were en route to the jail to try to speak with Jones.\nJones was the subject of a massive manhunt overnight, and remained on the run Wednesday afternoon. The U.S. Marshals Gulf Coast Regional Fugitive Task Force has joined Hueytown police in the search, and other law enforcement agencies also are assisting.\nThe shooting happened about 3:30 p.m. in the 500 block of Carver Avenue in Hueytown. Hagler said the victim and several other juveniles were in a car on the dead end street \"There was an illegal transaction involving a firearm,'' the chief said. \"And during the course of the transaction, Mr. Jones shot the victim in the head.\"\nHe did not say whether Coggins and Jones previously knew each other.\nThe shooting happened about 3:30 p.m. on Carver Avenue in Hueytown. The victim's friends then drove him back to a home on Huggins Drive in McCalla, right off of Tannehill Parkway just inside the Tuscaloosa County line.\nCoggins' friends then panicked, and drove him back to Coggins' home on Huggins Drive in McCalla, right off of Tannehill Parkway in Tuscaloosa County. The teen was pronounced dead in the car at the Huggins Drive home.\nHagler said Hueytown officers responded to the shooting on Carver Avenue, but arrived to find everyone had scattered, including the victims and the suspects. They set up a perimeter and began searching for two suspects, both black males, and also issued a lookout bulletin for the car that fled the scene with the victim inside.\nWhile they were searching in Hueytown, they received word from the Tuscaloosa County Metro Homicide Unit that the teen had been brought back to Tuscaloosa County and was in a car matching the description of the lookout bulletin. Once they determined the shooting had happened in Jefferson County, the Jefferson County Coroner's Office and other investigators responded to that scene.\nThe friends of the slain teen were taken in for questioning, and the chief said detectives determined they weren't involved in the homicide.\nHueytown police, joined by Pleasant Grove police and the Jefferson County Sheriff's Office, continued their hunt for the shooters. One of them was taken into custody about 9 p.m., but Hagler declined to say where he was captured for fear it would hurt the ongoing investigation.\nThat suspect, a teen, remains in lockup but has not yet been formally charged. Hagler said they spotted Jones at least three times during the overnight search, but weren't able to capture him. The majority of the search took place in a wooded area in Dolomite.\nCoggins' death is Hueytown's first homicide of 2016. The western Jefferson County city averages about one homicide every 18 months or so.\nThe chief noted that neither the victim nor the suspects lived in Hueytown. \"Nobody involved in the crime lives here,'' he said, adding that crime knows no boundaries. \"Crime in the metropolitan area will reach out and touch all of us.\"\n\"Once again, we have a senseless crime involving a bunch of kids that are way too young to be getting killed or killing people,'' he said. \"It's a sad commentary.\"\nUpdated at 10 p.m. to show that Jones surrendered."}