{"uri": "http://www.thetimesnews.com/article/20130930/News/309309885", "title": "Man sought in Haw River bar shootings turns self in", "dct": "NODATE", "id": "686d66f67b2cfbdb57ba921c0630a188", "content": "Hide caption Parker\nHAW RIVER — A man sought in connection to a shooting at a Haw River bar on Wednesday turned himself in to police Monday morning.\nAvery Clay Parker II, 20, of 726 Ivey Road in Graham, turned himself in just after 8 a.m. at the Alamance County Jail. He was charged with four counts of assault with a deadly weapon with intent to kill inflicting serious injury and with probation violation. Parker was placed under $807,500 secured bond.\nAt 2:09 a.m. Wednesday, officers responded to a shooting at Jet Sports Bar at 1003 W. Main St. and found four people with gunshot wounds.\nAccording to warrants, the victims were Jaheem Watson, Germine Johnson, Kaqunna S. Woods, and Alphonso Macer.\nOne victim was transported to Duke University Medical Center in Durham while the other three were transported to Alamance Regional Medical Center.\nPolice Chief Neal Dickens said Jet Sports Bar is currently closed.\nRodney Beckom, special agent-in-charge with state Alcohol Law Enforcement, said the bar’s ABC commission license has been suspended “in interest of public safety” and based on the investigation following the shooting.\nBeckhom said they had evidence to believe that some gang members attended the bar, and received information that gang members had been present the night of the shooting. He was unable to say whether the shooting itself was gang-related.\nEarlier in September, Parker was convicted of assault pointing a gun and communicating threats for a June incident, according to the state Department of Public Safety. He has been convicted of other misdemeanors in Alamance and Caswell counties, including breaking and entering, larceny, tampering with a motor vehicle and consuming alcohol under the age of 21.\nThe Alamance County Sheriff’s Office, North Carolina State Bureau of Investigation, Graham Police Department, North Carolina Alcohol Law Enforcement and Burlington Police Department assisted in the investigation."}