{"uri": "http://www.fox16.com/story/d/story/magnolia-boy-found-dead-in-apparent-hunting-accide/10924/dVS6X6RH8EOFX1mLUO3wDw", "title": "Magnolia Boy Found Dead in Apparent Hunting Accident", "dct": "Thu, 18 Feb 2016 08:30:00 GMT", "id": "6abf9bc08cbc5f0e63bda7369231a8ca", "content": "Union County, Arkansas -\nUpdate (1 p.m.):\nUNION COUNTY, AR (KTVE) - Union County Sheriff Mike McGough is now saying that the missing Magnolia boy found dead this morning died of a gunshot wound.\nEarlier investigators said Hank Bollen, 9, may have died by drowning.\nSheriff McGough says they're investigating this as a hunting accident and do not believe foul play was involved.\nBollen's body has been sent to Little Rock for an autopsy at the State Crime Lab and the investigation is not yet over.\nFamily members also declined comment. They did say that this was a normal thing for Hank to go out hunting by himself. Hank was out of school Monday due to the Presidents' Day holiday.\nUpdate (11:20 a.m.):\nUNION COUNTY, AR (KTVE) - The Union County Sheriff's Office says the body of a missing 9-year-old Magnolia boy was found this morning.\nHank Bollen was reported missing on Monday. According to the Union County Sheriff's Office, his body was found in a deer camp outside of Marysville around 9 a.m. today.\nInvestigators believe the boy drowned. His body is being sent to the State Crime Lab in Little Rock.\nUpdate (10:15 a.m.):\nUNION COUNTY, AR - The Magnolia Reporter newspaper reports that the search for a missing 9-year-old boy has been suspended after the discovery of a body in a wooded area near the Union-Columbia County line.\nThe Magnolia Reporter says there has been no official statement from the Union County Sheriff's Office but \"people close to the family said the young hunter’s body had been found.\"\nWe'll have more details as they become available.\nUNION COUNTY, AR (KTVE) - Search teams have resumed looking for a missing 9-year-old Magnolia boy.\nHank Bollen was last seen while squirrel hunting with family members Monday morning south of U.S. 82 near Marysville, which is west of El Dorado.\nAccording to the Magnolia Reporter, the Union County Sheriff’s Office, Arkansas Game and Fish Commission, area volunteer fire departments and others were taking part in the search."}