{"uri": "http://www.ky3.com/content/news/Friends-and-neighbors--376785781.html", "title": "Friends say man from Lowry City wouldn't have intentionally harmed baby", "dct": "Fri, 22 Apr 2016 18:45:00 GMT", "id": "d07d43ed0a42f51b52c4b402bbc2a267", "content": "LOWRY CITY, Mo. The community is in shock after a father and his baby boy were found dead in their. While investigators work to determine how they died, friends and neighbors are in disbelief.\nTwo-month-old Isaac Tyson's body was in the living room of his home on a corner of East 7th Street.\n\"It's unclear what caused the trauma,\" says St. Clair County Sheriff Scott Keeler.\nIsaac's father, Curtis Paul Tyson, 43, was dead in the detached garage with what investigators say is a self inflicted gunshot wound.\n\"My office received a phone call from a young teen saying that a body was found in the house,\" Keeler said.\nInvestigators say it was the baby's teenage brother and a friend who discovered the tragic scene as they got home from school.\n\"I can't think of a worse way for it to be discovered,\" said neighbor James Weis.\nNeighbors and co-workers can't imagine Tyson doing anything to harm his son.\n\"I know the baby was only a couple months old. He was a doting father. They all seemed very happy,\" said Weis.\n\"He brought him by to see us yesterday and we passed him around out there like he was a bag of potatoes. He was a little fussy, but he was a cutie. He was a cutie,\" said Dean Jones, Tyson's co-worker and friend.\nJones worked with Tyson at Shelby's Texas Boots and says he got to know him well.\n\"I just can't get my head around it. It just makes no sense whatsoever,\" said Jones.\nHe says Tyson was friendly and calm and a good dad.\n\"He was so crazy about that baby. That's why he brought him in here,\" said Jones.\nJones and Keeler said Tyson had a prosthetic leg because of an accident a few years ago, and had recently fallen with the baby.\n\"It broke his ribs when he fell. He called me the next morning and he was just devastated,\" Jones said.\n\"That was all cleared as far as completely accidental, not an intentional act in any way, shape or form,\" said Keeler.\nJones says baby Isaac had recovered from the fall. Now the small town is filled with questions and heartache.\n\"I believe in my heart that it's just a tragic accident,\" said Weis.\n\"It just makes no sense whatsoever, and we may never know,\" said Jones.\nInvestigators hope an autopsy being performed on Friday will help determine what caused 2 month old Isaac Tyson's death."}