{"uri": "http://www.nydailynews.com/new-york/nyc-crime/accused-driver-red-hook-shooting-possibly-threatened-article-1.2316680", "title": "Suspected driver in Red Hook shooting 'may have been threatened' by gunmen: lawyer", "dct": "Thu, 06 Aug 2015 12:55:30 GMT", "id": "01b21b987002ec5fcc7d1e8113044567", "content": "The accused wheelman in a drive-by shooting that resulted in the death of an unborn baby may have been \"threatened\" by the two gunmen, his lawyer said Thursday.\n\"My client is not the alleged shooter, the people say two others who are running around with guns are involved, it's possible he may have been threatened,\" said Quamari McAllister's attorney, Lawrence LaBrew, during his client's arraignment at Brooklyn Criminal Court.\nMcAllister and Marquise Frederick, both 19, are charged with five counts of attempted murder, three counts of first-degree assault and other charges for a drive-by shooting Monday at the Red Hook Houses that seriously injured four and put five-months pregnant Special-Caijae Houston in critical condition, causing the 19-year-old to lose her baby.\nFrederick and the other accused shooter, Elijah Wells, 19, are believed to be members of the Oww Oww Crew from the Gowanus Houses who had \"beef\" with the Gangsta Money Makers from the Red Hook Houses.\n\"There was a homicide that took place in March 2015 where the defendant's friend was killed and earlier on (Monday) where defendant's cousin was shot, both individuals were members of the Gowanus Crew,\" Assistant District Attorney Wilfredo Cotto read from statements made by McAllister.\nMcAllister also told detectives that he waited on the scene while shots were being fired and sped off in his father’s Green Ford Explorer with Frederick and Wells back to Gowanus, according to the criminal complaint.\nLaBrew questioned the statements given to police and believes McAllister's rights were violated when he was denied an attorney. Prosecutors argued that McAllister turned another attorney away.\nPolice recovered seven .40-caliber shell casings from the scene and obtained video of the car leaving the scene at a high-rate speed, said Cotto.\nLaBrew argued with the judge to set a reasonable bail for McAllister, who is studying social work at Staten Island College, works as a program aide at Public School 32, did volunteer work with special-needs children while at Bishop Ford High School and is the child of a New York State Court officer and MTA Bridge and Tunnel police officer.\nFrederick's attorney, Paul Ascher, argued that only one of six confidential witnesses was able to identify his client in a line-up.\n\"I believe we have the wrong person,\" said Ascher as he urged the judge not to allow Frederick to get photographed in court.\nThe judge remanded both McAllister and Frederick.\nCharges against Wells are pending."}