{"uri": "http://www.daily-journal.com/news/crime/shot-to-death-in-pembroke-township/article_74e4bb47-8f8d-5c1a-97dd-fe651adbdf26.html", "title": "4 shot to death in Pembroke Township", "dct": "Sun, 02 Oct 2016 00:00:00 GMT", "id": "985d4575a234094a4a96092f165b0416", "content": "Kankakee County Sheriff's police say four shooting deaths — including a triple homicide that killed a father and his two sons — in Pembroke Township over the weekend are likely connected, but they would not say exactly how.\nJust before 1 p.m. on Sunday, a family member discovered the bodies of three men, Reginald Neal, 56, and his two sons, Dangelo Neal, 24; and Davante Hopkins, 21, all who had been shot multiple times inside their home on 15500E Road.\nThere were no signs of forced entry, and the victims were found in different parts of the home, sheriff officials said.\n“We think this is something that was targeted because of the way that they were killed,” said Kankakee County Sheriff Mike Downey, adding, “Triple homicides are not something that happen in Kankakee County. I just want the community to know in Pembroke that we are here. We are available. If they see something, say something.”\nAbout 25 people stayed near the police line outside the home until 10:30 p.m. Sunday. \"It's absolutely horrible,\" said one person who asked not to be identified.\nDowney said the triple homicide may be linked to another shooting death that occurred about 36 hours earlier, involving a man that lived with the other three men.\nAt 1:12 a.m. Saturday, deputies responded to a shooting on 17250E Road. There, they found the body of Ralph Ledet, 46, of Pembroke Township, lying in a driveway. Ledet was shot multiple times in the head with what appears to be a 9mm pistol and was pronounced dead at the scene.\nThe four homicides come at a time when the Kankakee County Board, grappling with more budget cuts, is considering laying off 15 deputies. Illinois State Police crime scene technicians, as well as the county's drug unit, assisted at both homicide scenes over the weekend.\n\"We need the public's help,\" Lt. Chad Gessner told the crowd of people Sunday night. \"This is a strong community. If you know something, call Crime Stoppers at 815-93-CRIME.\"\nKen McCabe, deputy chief in the sheriff's department, said this is the first multiple homicide the office has investigated in two decades."}