{"uri": "http://abc7chicago.com/news/police-id-person-of-interest-in-shooting-of-rep-danny-davis-grandson/1615531/", "title": "2 juveniles questioned in fatal shooting of US Rep. Danny Davis' grandson", "dct": "Sun, 20 Nov 2016 00:00:00 GMT", "id": "9a21d8242a234d13541447bc1bcc54c8", "content": "CHICAGO (WLS) --\nTwo juveniles were taken into custody late Saturday in the fatal shooting of the teenage grandson of Congressman Danny Davis, D-Chicago, Friday night, police said.\nAt 9 p.m. Saturday, Chicago police spokesman Anthony Guglielmi tweeted about the two juveniles, adding that first-degree murder charges were expected. Shortly before midnight, no charges had been announced.\nAt about 6:45 p.m. Friday, Davis' grandson, Javon Wilson, 15, was in his home in the 5600-block of South Princeton Avenue when he got into a confrontation with two teens over gym shoes, police said. One of the teens pulled out a gun and shot the victim in the head. He was pronounced dead at the scene.\n\"It has been a very trying, traumatic day,\" said Davis, who who represents Illinois' 7th Congressional district. He and family members went Friday night to the CPD Area South police precinct with family members to speak with investigators. Davis said Wilson was in the home with his siblings and uncle at the time of the shooting.\nOn Saturday, Davis said guns should not be so easily accessible to youth. He said Chicago's gun violence problem has never hit so close to home.\n\"We have to find a way to get some of the guns out of our environment,\" he said. \"I have spoken at many teenage funerals. I have comforted many families but never quite this close.\"\nOutside of Davis' West Side office, a small crowd gathered Saturday afternoon to offer support and prayers.\n\"We want to send a message first of all to the congressman let him know we love you and our hearts go out. Violence can strike anywhere,\" said Kevin Copeland.\nThe death of the congressman's grandson has put Chicago's homicide count back in the national spotlight.\nFormer U.S. House Speaker Newt Gingrich, who is a close campaign advisor to President-elect Donald Trump, tweeted \"Chicagoans are Americans. Their civil rights matter.being killed ends your civil rights. City has failed. State has failed. Need US action\""}