{"uri": "http://wsvn.com/news/local/mother-of-son-shot-pleads-with-community-to-find-sweet-16-shooter/", "title": "Mother of son shot pleads with community to find ‘sweet 16’ shooter", "dct": "Tue, 20 Sep 2016 00:00:00 GMT", "id": "bfcb647e7c60667833f63e2c1b975c71", "content": "SOUTHWEST MIAMI-DADE, FLA. (WSVN) - A mother whose son was shot six times at a “sweet sixteen” celebration is speaking out. Her son was just one of six who were gunned down at the party over the weekend, and the victim’s mother wants the violence to end.\nSome of the victims have undergone multiple surgeries and remain in intensive care. The shooting has become a harsh reality for the families affected.\n“Try not to shut down, but it’s just, it’s breaking me,” said the teen victim’s mother, Tomeka Smith. “It’s really breaking my heart to see my 13-year-old suffer like this for nothing, and it’s the kids, good kids.”\nSmith’s 13-year-old son, Anthony Ellison, was shot six times, including twice in the back, just outside of their home in Southwest Miami-Dade, where they were celebrating his sister’s sweet sixteen. “I’m by his side,” Smith said.\nSaturday night, after 10:30 p.m., Miami-Dade Police said someone inside an SUV opened fire at the teens who were attending the party along Southwest 206th Street and 119th Avenue.\nEllison is a Redland Middle School student. Sixteen-year-old Kiondae Wilson, a student at Westminster Christian was shot, along with his best friend, who attends Southridge High School, 17-year-old Andre Foster. “My heart just sank,” said Wilson’s mother, Kedisha Wilson.\nFoster’s mother said a bullet went through both of her son’s legs, and he was sent directly to the ICU at Jackson South and was taken in for surgery.\nFive of the six injured attend Miami-Dade County Public Schools. “As young as 13, as old as 17, celebrating like any other kid would,” said Miami-Dade Public Schools Superintendent Alberto Carvalho.\nCarvalho announced the launch of a new gun violence prevention initiative for children, days after the drive-by as police continue to search for those responsible.\nFamily members and county officials attended a town hall meeting in Goulds, Tuesday, at 7 p.m., where officials discussed youth violence and possible solutions. Commissoner Dennis Moss and Miami-Dade Mayor Carlos Gimenez were on hand for the meeting, along with Miami-Dade Police officers.\nMiami-Dade Police Director Juan Perez opened the meeting with the news that the three suspects were taken into the custody.”Sometimes we see it and we don’t hear it, but to prove how hard they work, all three gentlemen involved are in custody right now,” he said to tremendous applause.\nMiami-Dade Police Maj. Samuel Bronson, who oversees this particular district of the police department, warned would-be criminals that they would be caught.\nPolice credit tips to the station for helping find the suspects, who were identified as Travonte L. Berry, 20, Dontavious Byrd, 18, and Michael C. Melon, 18. All three are being charged with attempted murder.\nSmith has set up a GoFundMe page for her son’s recovery. If you would like to contribute, go to: www.gofundme.com/2pyrchw.\nCopyright 2017 Sunbeam Television Corp. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}