{"uri": "http://patch.com/new-york/midhudsonvalley/arrest-made-shooting-environmental-police-officer", "title": "UPDATE: Environmental Police Officer in Stable Condition After Being Accidentally Shot", "dct": "Wed, 30 Nov 2016 13:59:00 GMT", "id": "5124b5c1633d7fe2420f8ba305b3a51f", "content": "GALLATIN, NY — The Environmental Conservation police officer who was shot Tuesday is in stable condition in the Intensive Care Unit at Mid-Hudson Hospital after undergoing extensive surgery.\nBasil Seggos, the Department of Environmental Conservation commissioner, said in a statement that he met with Officer James Davey’s wife Nancy, who is a forest ranger at the DEC.\nSeggos said Davey’s family was appreciative of the outpouring of support from the DEC family.\nHe said that Lieutenant Liza Bobseine, who was on patrol with Davey when he was shot, was credited for saving his life.\n“Lieutenant Bobseine was able to quickly apply a compress to the wound while calling for support and keeping the suspects under control a half mile into a field,” Seggos said.\n“It is clear that if it were not for her actions, Officer Davey would not have survived,” he said.\nAlan Blanchard, 55, of Gallatin, was arrested Tuesday and charged with felony assault in the shooting. He is being held in jail without bail.\nDavey, 39, is a 12-year veteran of the force, having graduated from the DEC Basic Police Academy in 2005. His current assignment is to patrol Columbia County.\nDavey is a Division of Criminal Justice Services-Certified Police Instructor, who recently became a certified firearms instructor for the DEC.\nOriginal story:\nGALLATIN, NY — An arrest has been made in the shooting of a state Environmental Police officer in Columbia County.\nState Police said Alan Blanchard, 55, of Gallatin, was charged Tuesday with second-degree assault, a felony.\nAround 5 p.m. Tuesday, state Environmental Police officers Lieutenant Eliza Bobseine and Officer James Davey were investigating a trespassing complaint with shots having been fired in the area of Silvernails Road in the Town of Gallatin.\nPolice said they came across fresh tire tracks leading into a cut cornfield.\nWhile they were walking through the field, Davey was shot with a rifle one time in the area of his pelvis.\nBlanchard, who was the shooter, and his hunting partner, James Brown of Pine Plains, remained at the scene and assisted with rescue efforts.\nAn investigation found that Blanchard’s reckless conduct led to the accidental shooting of the officer, police said.\nDavey underwent surgery and is recovering at a local hospital.\nBlanchard was arraigned in the Town of Livingston Court and sent to the Columbia County Jail in lieu of no bail. He is scheduled to reappear in court Dec. 8.\nState Police were assisted by the state Environmental Conservation Police. The Town of Pine Plains Fire Department Rescue Squad and Northern Dutchess paramedics responded to the scene and provided medical services and transportation to the hospital.\nPhoto caption: Alan Blancard. Photo credit: NYSP."}