{"uri": "http://www.chicagotribune.com/news/local/breaking/chi-chicago-shootings-violence-20150422-story.html", "title": "2 in custody after girl, 5, shot in arm in Englewood", "dct": "Thu, 23 Apr 2015 07:33:00 GMT", "id": "f9cbf459c99b325a0d16c135bf20af71", "content": "A 5-year-old girl was shot in the arm in a home in Englewood on the South Side, and police said it appears she was accidentally wounded by a relative Wednesday evening.\nThe girl was taken to Comer Children's Hospital, where her condition stabilized, according to police and fire officials.\nThe shooting happened at about 8:15 p.m. in the 5900 block of South Peoria Street, police said. Two people were taken into custody, including the person who may have shot the girl by accident, police said.\nTwo guns were recovered from the home, police said.\nThe girl was among at least six people wounded Wednesday in shootings on the South, Far South and West sides of Chicago, officials said.\n• About 6:15 p.m. on the Near West Side, a 32-year-old man was shot in the back in the 100 block of North Western Avenue, said Chicago police spokeswoman Officer Bari Lemmon. The man was taken to Stroger Hospital, where his condition stabilized.\n• Around 5:20 p.m., a 38-year-old man was wounded in a shooting in the Gresham neighborhood on the South Side, according to Chicago police spokesman Officer Hector Alfaro.\nThe man was in a car in the 8000 block of South Ashland Avenue when a blue car pulled up and someone inside fired shots, Alfaro said. The man was shot in the arm and was taken to Holy Cross Hospital, where he was listed in good condition, Alfaro said.\n• Around 3:50 p.m., a 53-year-old man was wounded in a shooting in the North Austin neighborhood on the West Side, Alfaro said.\nThe man was walking on a sidewalk in the 1500 block of North Lawler Avenue when he saw a black car drive by. Someone inside fired shots, striking the man in the thigh, Alfaro said.\nThe man was taken to Loyola University Medical Center, police said. It was not known if the man was the intended target, police said.\n• In the Rosemoor neighborhood, two men, both 22, went to Roseland Hospital after being shot about 12:10 p.m. in the 200 block of East 107th Street, Lemmon said. One was in fair condition with a wound to the eye, the other was in good condition with a wound to the arm.\nThe two were in a car when someone opened fire from a passing car, police said. There was no description of the attackers' car, Lemmon said."}