{"uri": "http://www.fox16.com/news/local-news/sheridan-students-death-ruled-homicide/643708822", "title": "Sheridan Student's Death Ruled Homicide", "dct": "Sat, 21 Jan 2017 12:26:00 GMT", "id": "007ec3994857a3f1be65d8cf674c1078", "content": "Authorities say Austin Moody was shot and killed Thursday at a home on Highway 35 North around 8 a.m.\n\"This is an ongoing, active investigation and we ask if anyone that has any information about the case contact the Grant County Sheriff’s Department,\" Sheriff Ray Vance said in a statement to The Headlight. \"The Grant County Sheriff’s Department asks that everyone continue to pray for this family and friends during this difficult time.”\nSheriff Vance doesn't plan to make additional statements surrounding the details of the homicide while the investigation remains active.\nMoody was a beloved member of the school's football team. He was also a 2008 World Champion in Taekwondo sparring. Moody's family attends First Landmark Baptist Church in Sheridan.\nThe Sheridan School District released the following statement Friday:\n“The Sheridan School District was saddened to learn yesterday of the death of one of its high school students. Our thoughts and prayers go out to his family and friends, and the entire community at this very difficult time. Upon learning of this tragedy, the district responded immediately, mobilizing trained crisis counselors and mental health professionals. Counselors and mental health professionals will be available to meet with students, faculty and staff over the coming weeks. They will provide grief counseling and other resources as needed.”\n“The Sheridan School District wants to respect the privacy of the family and is limiting its comments. Right now, the district is focusing on providing support to this family as well as the entire school community.”\nFuneral services for Moody will be held Wednesday, January 25 at 2 p.m. at First Landmark Baptist Church in Sheridan."}