{"uri": "http://www.denverpost.com/2016/10/10/marijuana-grow-house-slaying-denver-man-arrested/", "title": "Denver man arrested after allegedly shooting, killing teen in marijuana-filled backyard", "dct": "Mon, 10 Oct 2016 14:06:00 GMT", "id": "a742d99eeba1c616102f21e7850da6bd", "content": "Denver police have arrested a 48-year-old man accused of shooting two teenagers who apparently were trying to steal marijuana plants from his backyard. One 15-year-old boy was killed and a 14-year-old was wounded and possibly paralyzed.\nKeith David Hammock allegedly shot the teens with a .22-caliber rifle from a second-story window of a home at 2830 High St. at around 2 a.m. Sunday after the boys climbed over Hammock’s backyard fence, according to an arrest warrant affidavit released Monday. He is being held for investigation of murder, attempted murder and investigation of felony marijuana cultivation.\nThe Denver Medical Examiner’s Office identified the slain teen as Keylin Mosley. It said the cause of death was a gunshot wound, and it classified the case as a homicide.\nPolice received a call from the surviving boy who told a dispatcher he had been shot and was dying and that his friend was dead, according to the affidavit.\nThe mother of the boy said someone shot her son twice: once when he was in Hammock’s backyard and a second time while her son attempted to climb the fence to escape. She said he may be paralyzed from the waist down.\nWhile the boy was still on the phone with the dispatcher, the voice of a second person approaching the boy could be heard.\n“The male victim says that he is sorry,” the affidavit says.\nA second male person makes a comment related to the fence.\nThe boys had climbed over a fence to get into the backyard, which had several marijuana plants growing — some in orange plastic buckets, the affidavit says. Police also followed a trail of marijuana leaves in the alley leading from Hammock’s house to a neighbor’s house on the same block, the affidavit says. Hammock shares the home with his girlfriend, Eleise Clark-Gunnells.\nPolice found the 14-year-old boy and the body of Mosley with a gunshot wound to the chest in the northeast corner of the backyard.\nA black semiautomatic handgun was lying on the ground in the backyard. It’s unclear whether the gun belonged to the boys or if it was one of several handguns belonging to Clark-Gunnells.\nHammock was taken to police headquarters and wrote a statement that he heard an argument and then gunshots. He became alarmed when police called the shooting a homicide. He asked who was killed, the affidavit says.\nDuring a police interview at 4:26 a.m., Hammock said that during the early morning a motion- detector light came on in his backyard. Someone had jumped over his fence. He looked out his window and saw movement or wrestling, the affidavit says. He said he went outside and found two kids on the ground near the compost heap.\nHe said one of the kids had a cellular phone. At that point, he told police he would not give any further statements without an attorney, the report says.\nClark-Gunnells told police she keeps her .22-caliber rifle under her bed and had several handguns.\nBut when police obtained a search warrant for Hammock’s house, they found two rifles, a box of ammunition and four bullet casings in the window sill of an open upstairs window that overlooks the backyard, the affidavit says. They also found a .22-caliber Marlin rifle near a chair.\nThey also “detected a strong odor” of marijuana in the house.\nOn March 10, 1989, Hammock was arrested on charges of marijuana possession, flourishing a weapon, carrying a concealed weapon and obstructing police, according to Colorado Bureau of Investigation records. The record does not indicate the disposition of the case.\nGlendale police arrested him on a misdemeanor drunken-driving charge on March 1, 2000, CBI records indicate.\nSponsored Links\n.\nPrimal Plants Supplement - Gundry MDThis Simple Skin Fix May Surprise YouPrimal Plants Supplement - Gundry MD\nTophatterThe Most Addicting Shopping Site For WomenTophatter\nTruthFinder People Search SubscriptionType in Any Name, Wait 15 Seconds, Brace For ResultsTruthFinder People Search Subscription\nBivvy Survival Sleeping BagThis Sleeping Bag Could Save Your LifeBivvy Survival Sleeping Bag\nLifehackLaneShe Had No Idea Why the Crowd Was CheeringLifehackLane\nDermalMedix Skin CareHow To Fix Cracked FeetDermalMedix Skin Care"}