{"uri": "http://www.nola.com/crime/index.ssf/2016/04/nopd_arrests_12-year-old_accus.html#incart_river_index", "title": "NOPD arrests 12-year-old accused of shooting teenager", "dct": "Wed, 04 May 2016 22:11:48 GMT", "id": "f723fc46e5f7976479bff52885edbcd1", "content": "New Orleans Police have arrested the 12-year-old boy accused of shooting a 14-year-old boy in New Orleans East on Saturday (April 23), although the suspect and victim have given conflicting statements.\nPolice responded shortly after 2 p.m. to the 7600 block of Downman Road, where they found the victim in a driveway with a gunshot wound to the thigh.\nThe victim told police he and two friends were playing with unloaded BB guns while walking along Downman when he realized a BB had struck him. The suspect pulled a gun from a black bag, \"removed and replaced the gun's magazine and chambered a round before threatening the three and firing a single shot, striking the victim in the left thigh,\" an NOPD news release says. The victim told police the suspect fled after tossing the gun underneath an SUV.\nThe suspect told police the victim was firing BBs at him, and that he told the victim to stop. He then pulled out the gun and removed the clip, but the gun fired a bullet when he pulled the trigger. The suspect also said at some point the victim also had possession of the gun and was the one who chambered it.\nThe suspect also said he ran to the victim to see if he was OK after the gun fired.\nThe suspect confessed that he'd taken the gun from his parents' locked bedroom, according to the news release.\nInvestigators at the shooting scene recovered the gun underneath a SUV, as well as what looked like two toy guns from a trash can outside the house.\nThe suspect is charged with aggravated second-degree battery and possession of a firearm by a juvenile.\nStaff writer Jonathan Bullington contributed to this report\nA 12-year-old boy shot another boy in the thigh while playing with a gun Saturday afternoon (April 23) in New Orleans East, police said."}