{"uri": "http://www.wxyz.com/news/region/wayne-county/dearborn-heights-police-man-kills-4-children-shoots-woman", "title": "Police: Father kills 2 children, 2 teens at Dearborn Heights home", "dct": "Wed, 21 Sep 2016 23:21:00 GMT", "id": "b4b7e6699372b696a98b962457968014", "content": "Autoplay:Neighborhood in shock over Dearborn Heights murdersCONNECTING...XFriends talk about murder victims\nDEARBORN HEIGHTS, Mich. (WXYZ) - Police say a man killed four of his children/stepchildren, and shot and injured their mother at a home Wednesday morning in Dearborn Heights.\nA memorial continues to grow outside the home where four children were killed.\nThe home is located on Hipp near Annapolis. Family after family showed up to the doorstep, remembering the victims of Wednesday's killing rampage.\nPolice tell 7 Action News the man called police around 1:20 a.m. and told them he had killed his whole family. When they arrived, officers found him waiting for them on the front porch. He immediately was taken into custody. Sources are telling 7 Action News he is Gregory Green.\nAt the home, police found a horrific scene. Officers say the victims were attacked in various ways.\nTwo teenagers, 17-year-old Kara Allen and 19-year-old Chadney Allen, were found shot and killed inside the home, the two younger children, 4-year-old Kaleigh Green and 6-year-old Koi Green, were found dead in their beds, according to police.\nKiersten Wilcher, a friend of 17-year old Kara Allen says she would spend time at another friend's house, scared of what her stepfather would do. Wilcher told us, \"Domestic violence is real.\"\nPolice say the youngest children died from carbon monoxide poisoning. We're told the man manipulated the tail pipe of a car and killed the children with exhaust fumes. They were then placed back into bed, according to police.\nThe woman is currently listed in fair condition at the hospital. Family has identified her as Faith Green. Police say she was able to speak with investigators. She remains hospitalized after undergoing surgery. She was shot in the foot and cut in the face during the attack.\nPolice say Gregory Green is the stepfather of the two of the children and the father of the other two. Officers believe marriage problems may have been the motive for the murders. The wife had filed for divorce in August. She also filed for divorce back in 2013, but reconciled.\n\"We don't have a lot of instances like this...it is a very tragic situation,\" said Dearborn Heights Mayor Dan Paletko, who is on the scene. \"Words can't explain what took place here.\"\nNeighbors describe the family as quiet and hardworking. We're told they just threw a children's birthday party a few weeks ago.\n\"Just two or three weeks ago, they had a birthday party, balloons and all that stuff out there,\" said neighbor Ronnie Jones. \"They've been working on the house the last two or three months, added doors...garage door they added a bunch of stuff to the house.\"\nSTAY WITH 7 ACTION NEWS AND WXYZ.COM FOR UPDATES ON THIS BREAKING STORY.\nCopyright 2016 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}