{"uri": "http://fox8.com/2016/06/08/13-year-old-in-critical-condition-after-being-shot-in-the-back-by-15-year-old-friend/", "title": "13-year-old in critical condition after being shot in the back by 15-year-old friend", "dct": "Wed, 08 Jun 2016 22:03:00 GMT", "id": "efdaa9c919ac8cd1c85ce811ddc408e7", "content": "BERLIN TWP., Ohio - A 13-year-old Erie County boy was hospitalized in critical condition after investigators said a friend shot him in the back.\nIt happened around 11:30 a.m. Tuesday inside victim Matthew Fluty’s home on the 7900 block of State Route 61 Ceylon Road.\n“I just accidentally shot my friend,” the 15-year-old friend told dispatchers. “We were shooting guns, and I forgot there was a shell in the chamber. I thought I cleared it.”\nAccording to an incident report, the teen told investigators the pair were going to shoot birds in the back yard when he accidentally fired a pump action shotgun loaded with bird shot. It hit Fluty in the back from between six and nine feet away, deputies said.\nThere were no adults home at the time, according to investigators.\nFluty’s grandmother, Carleen Fluty, said she happened to be listening to a police scanner at her home when she heard the dispatch.\n“I heard the Sheriff ask again for the address, and I said, ‘oh my God, that’s my grandson,” Fluty said.\nShe said she rushed to the house, where she saw her grandson on the living room floor being attended to by first responders. He was flown to Mercy St. Vincent Medical Center in Toledo, where he underwent more than five hours of surgery Tuesday. Fluty said several organs were damaged.\n“Obviously it was an accident,” she said. “I don’t even know the full details, but I’m a wreck.”\nErie County Sheriff Paul Sigsworth said detectives met with officials from the Erie County Prosecutor’s Office, but a decision on potential charges will not be made until the investigation is completed.\n“First of all, we have to make every determination we can that it was purely accidental. It certainly appears to be at this time, but we have not been able to get a good detailed statement from the victim,” Sigsworth said.\nSigsworth said the incident is a reminder that guns should always be treated as if they’re loaded, and adults need to supervise children around guns.\n“Weapons should always be secured within the household,” he said. “These guns were not secured within the household. They were accessible to these boys and this is the tragic result.”\nCarleen Fluty said her grandson had experience hunting from a young age, and the guns should’ve been locked up, as there was a gun cabinet in the house.\n“We need all the support we can get, we need prayers for Matthew and his dad,” she said. “His dad is a single father trying to make a living for both of them.”\nThe mother of the 15-year-old declined comment to Fox 8 News."}