{"uri": "http://www.khou.com/news/crime/three-charged-with-murder-of-4-year-old-girl/362139321", "title": "3 teens charged with murder of 4-year-old girl", "dct": "Fri, 02 Dec 2016 00:00:00 GMT", "id": "9888f32cc9ddd133d5d6533ce09a8ef2", "content": "HARRIS COUNTY, Texas – Three suspects have been charged with capital murder for the shooting death of 4-year-old Ava Castillo, according to the Harris County Sheriff’s Office.\nThe suspects have been identified as: 17-year-old Ferrell Dardar; 17-year-old Marco Miller; and 18-year-old Philip Battles.\nA Harris County judge has denied bond for Dardar and Miller. According to probable cause read in court Friday evening, Miller and Dardar helped Battles rob Castillo's mother.\nAva and her 10-year-old sister, Betzida, were helping their mom, 27-year-old Diana Gomez, unload groceries when the suspects ambushed them and tried to grab Gomez’s purse.\nThe shooting happened at the Mission Falls apartments in the 10400 block of Greens Crossing Boulevard.\n(Photo: Courtesy of family)\nThe robbers fired several shots at Gomez and one of the bullets hit Ava, who was in her mother's arms.\nGomez was hit seven times and she spent several days in the hospital. Betzida was also struck. She and her mom are both recovering at home.\nThe stolen vehicle used in the robbery and shooting was later found in northeast Harris County.\nHCSO detectives are working with the robbery division and HPD in the case.\nInvestigators received several good tips on the suspects. One informant said Castillo’s killer goes by the nickname “Kiwi,” according to the probable cause statement.\nAnother tip came from a driver robbed in another case. She tracked her attackers, which led police to Battles’ front door, prosecutors said in court.\n“She used a GPS application on her cellular phone and tracked the telephone to a location in Humble, Texas, which that address goes back to defendant Philip Battles,” the prosecutor said in court on Friday.\nInvestigators said Battles, who was arrested on a separate capital murder charge, admitted robbing the driver and also Castillo’s mom.\nHe also claimed Miller and Dardar helped him, according to prosecutors.\nAll three teens face capital murder charges.\nBattles faces another capital murder charge for the Nov. 7th shooting death of Ignacio Ortega. He was killed during a robbery at an apartment complex.\n(© 2017 KHOU)"}