{"uri": "http://www.wral.com/four-killed-in-wilson-were-from-one-family/16368634/", "title": "No suspect, motive in deaths of four on Christmas Eve", "dct": "Sat, 24 Dec 2016 00:00:00 GMT", "id": "b9d0a0bc37a0732cd158eae1c432100d", "content": "Video Playback Not Supported\nPlay Video\nPlay\nMute\nCurrent Time 0:00\n/\nDuration Time 0:00\nLoaded: 0%\nProgress: 0%\nStream TypeLIVE\nRemaining Time -0:00\nPlayback Rate\n1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptions\nFullscreen\nAutoplay:\nOn / Off\nThis is a modal window.\nThis video is not supported on your platform. Please make sure flash is installed.\nCaptions Settings Dialog\nBeginning of dialog window. Escape will cancel and close the window.\nText Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps\nDefaults Done\nFour people shot and killed in Wilson\nAre you still watching?\nYes, ContinueNo\nWilson, N.C. — The Wilson County Sheriff's Office on Sunday identified the four people shot and killed Christmas Eve as two generations of one family.\nThe dead are Tammy Lynette Pearce, 54, and her boyfriend Selby Gene Outland, 47; and Tammy's son, Paul Shane Pearce, 28, and his girlfriend, Dominique Nicole Privette, 23.\nA family member found the quartet around 1 p.m. on Saturday afternoon at their home in the 2200 block of Banks Lane, but investigators say they could have been killed as early as Friday night.\nFamily members are shocked and mourning the tragic loss. According to neighbors, Paul and his girlfriend were planning to get married, and Selby and Tammy had just returned from a trip to the beach.\nA sheriff's spokesman said investigators believe the shootings to be an isolated incident, but they have not identified a suspect or motive. The crime scene was still active on Monday as officials worked to learn more.\nAnyone with information about the crime is asked to call the Wilson County Sheriff’s Office at 252-237-2118."}