{"uri": "http://chicago.suntimes.com/news/teen-boy-charged-with-shooting-6-year-old-girl-in-logan-square/", "title": "6-year-old girl shot in Logan Square in ‘good spirits’", "dct": "Wed, 08 Jun 2016 22:15:00 GMT", "id": "f2195f468960a6c5403da2fc77ff1e5e", "content": "A 6-year-old girl who was shot Monday in Logan Square is in “good condition and good spirits” Thursday, the same day her alleged shooter is scheduled to appear in court.\nThe 17-year-old suspect, whose name was not released because he is charged as a juvenile, faces one count of aggravated battery with a handgun in connection with the June 6 shooting in the 2100 block of North Bingham, according to Chicago Police. He is scheduled to appear in juvenile court Thursday afternoon.\n“Six year old Jaylene Bermeo was transported to Stroger Hospital on Monday, June 6, with a critical gunshot wound to the chest,” Stroger’s pediatric intensive care physician Dr. Yomi Akintorin said in a statement.\n“She has a long but promising road to recovery ahead of her. We hope to discharge her in a few days,” Akintorin said.\n“Thank you all for your thoughts and prayers as Jaylene recovers,” the Bermeo family said in the statement. “We truly appreciate the support our family has received during this difficult time. Please keep the prayers coming for Jaylene’s full recovery so she can get back to the dance classes she loves so much.”\nPolice allege the teen was driving down the block about 8:10 p.m. when he opened fire, striking the girl in the back. A relative drove her to Presence Saints Mary and Elizabeth Medical Center, and she was later transferred to Stroger Hospital in critical condition.\nNeighbors said they heard eight-10 shots in about 15 seconds.\nA longtime resident said neighbors had called police about a dozen times on the house near the scene of the shooting for gang activity.\nAnother neighbor who lives on the block said she had just returned home from work when she heard the crackle of gunfire—nine shots in all, she said.\n“There were a lot of kids playing outside at the time,” said the woman, who didn’t want her name used. She said her own children were playing in her basement at the time.\nThe woman said the neighborhood has been the scene of a turf war between rival gangs, with each side tagging and re-tagging walls. The woman said the address where Monday’s shooting occurred has experienced at least two other shootings since 2015."}