{"uri": "http://dfw.cbslocal.com/2016/08/15/dallas-drive-by-injures-child-rattles-neighborhood/", "title": "Dallas Drive By Injures Child, Rattles Neighborhood", "dct": "Mon, 15 Aug 2016 18:30:00 GMT", "id": "9d281f9b99ae232faf74a973e3bc17b1", "content": "DALLAS (CBS11) – On a rare, rainy day in August, the swings were still and the benches empty at Oak Cliff’s Glendale Park. But, there’s more than weather at play here. Some parents say there’s worry as well.\n“This is not good,” said Devetta Jackson. Jackson and her children live just down the street from the park and were troubled when police and paramedics blocked the street Sunday evening. So she went to ask why. “The police was telling us that a child had got hit in a drive by!”\nPolice confirmed a 9-year-old was riding in a vehicle that was sprayed with bullets and taken to Dallas Children’s Medical Center in good condition.\n“They were shooting from the park,” said Jackson’s 10-year-old K’Sean. He and friends were playing outside when gunfire shattered the Sunday evening calm. “It sound like a machine gun going back and forth: boom-boom-boom-boom,” while also adding that the gunfire sounded like more than one weapon was involved, as though “people shooting back at each other.”\nSandra Lover, who lives nearby, says she thought the commotion was an auto accident. She’s been a park neighbor for some 30 years and says increased police presence and better lighting have made the park a community asset that most view as safe.\n“Every weekend it’s crowded with people having picnics, birthday parties, just enjoying the area,” said Lover, who adds that she even takes her walks there. Now, she wants answers about what led to a drive by shooting that left a child injured. Who opened fire and why? She’s relieved the child will recover; but, can’t help but hope that the trouble was just passing through.\n“It’s just terrible,” said Lover. “You can’t even let your kids come to a safe place like a park and enjoy the day. It’s senseless.”\n“A bullet does not have an eye and this is broad daylight,” said Jackson, while repeating a call for answers from police. “I want to know what’s going on.”\nDallas Police provided no additional information on the investigation or search for suspects on Monday.\n(©2016 CBS Local Media, a division of CBS Radio Inc. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)"}