{"uri": "http://www.mlive.com/news/saginaw/index.ssf/2016/07/police_identify_buena_vista_te.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+saginaw_news+%28Saginaw+News+-+MLive.com%29", "title": "Police identify Buena Vista teen found fatally shot in street", "dct": "Thu, 28 Jul 2016 10:38:00 GMT", "id": "5961664d50ee2f15853f2978637056bc", "content": "BUENA VISTA TOWNSHIP, MI -- Buena Vista police have identified the teen found fatally shot on South 23rd late Tuesday, July 26.\nJoshua Javen Phillips, 17, of Buena Vista died after he was shot sometime before 10:35 p.m. Tuesday, Buena Vista Police Chief Robert Schulz announced Wednesday.\nA 17-year-old male died late Tuesday, July 26, after suffering at least one gunshot wound, police say. The neighborhood where the shooting occurred, on South 23rd at the border of Buena Vista and the city of Saginaw, was mostly clear of police after 9 a.m. Wednesday.\nPolice were dispatched at about 10:35 p.m. Tuesday to South 23rd between Burt and Cherry for a report of a male down in the road, Schulz stated Tuesday. Upon arrival, officers found Phillips dead in the street, Schulz stated.\nPolice investigation at the scene continued into Wednesday morning, and at one point, the scene was \"very active,\" according to an officer at the scene. Police detained at least two males during that investigation, which included police surrounding 440 S. 23rd. No arrests ultimately were made, Schulz told The Saginaw News.\n\"We determined that the suspect does not live at that home,\" Schulz said.\nPolice in Buena Vista Township continued to investigate a suspicious death near the border of the city of Saginaw Wednesday morning, July 27.\nBuena Vista Police Department detectives are investigating the incident, and the Michigan State Police and Michigan State Police Crime Lab assisted at the scene.\nAnyone who has information pertaining to this incident is asked to call the Buena Vista Police Department at 989-233-2363 or Crime Stoppers at 800-422-JAIL (5245)."}