{"uri": "http://www.kansas.com/news/local/crime/article116870233.html", "title": "Teen shot in southeast Wichita has died, police say", "dct": "Thu, 24 Nov 2016 11:21:00 GMT", "id": "bdd96f1724f22dbe1f2c239cc54e8ffc", "content": "UPDATED 12:10 P.M.: Wichita police say a 15-year-old boy shot early Thursday in the parking lot of the Lost Sock II Laundromat has died.\nA 13-year-old boy told authorities he and the 15-year-old were outside the laundromat at 1902 E. Pawnee when a trio of people confronted them, the police department said in an e-mailed news release. The younger boy told police that one of the suspects that approached pulled a handgun and shot the 15-year-old once at around 1:45 a.m.\nThe 15-year-old and the 13-year-old then ran across the street to Burger King for help. The injured teen collapsed there, police said.\nHe died at the hospital later Thursday, police said.\nPolice are looking for three black males in a silver four-door car in connection with the shooting. Anyone with information about the crime or suspects is asked to call 911.\nORIGINAL STORY: One person was in critical condition early Thursday following a shooting in southeast Wichita.\nThe violence occurred in the 1900 block of East Pawnee, near K-15, shortly before 2 a.m., a Sedgwick County dispatcher said.\nThe victim, a teenage boy, was found lying outside of the Burger King at 1909 E. Pawnee at around 1:45 a.m., according to emergency scanner traffic. Someone called 911, saying the teenager was hurt but they weren’t sure how. Authorities later determined he had been shot in the back in the parking lot of the Lost Sock II Laundromat at 1902 E. Pawnee, which is across the street from Burger King, according to emergency scanner traffic.\nThe teen was taken to a local hospital for treatment, the dispatcher said. He was in extremely critical condition at the time. His current condition is unknown.\nAuthorities were looking early Thursday for at least one suspect who may have left the shooting scene in a silver car.\nAmy Renee Leiker: 316-268-6644, @amyreneeleiker"}