{"uri": "http://www.insidenova.com/headlines/four-charged-in-gang-related-shooting-in-manassas-area/article_9f21a9ae-d367-11e6-bbf6-d3cb04d5de3c.html", "title": "Four charged in gang-related shooting in Manassas area", "dct": "Thu, 05 Jan 2017 00:00:00 GMT", "id": "b2841c2719d3b6c287600f336bd5c693", "content": "Four suspects have been arrested in connection with a Wednesday afternoon shooting in the Manassas area that police said was gang-related.\nOfficers responded to the area of Rixlew Lane and Ashton Avenue in Manassas at 3:41 p.m. on Jan. 4 to investigate the shooting, Prince William police spokesman Sgt. Jonathan Perok said in a news release.\nWhen officers arrived, they located two victims, a 17-year-old Manassas boy and a 16-year-old Woodbridge boy, by a wooded area in that location, Perok said.\nOne of the victims had been shot in the upper body and the other had a minor, non-gunshot-related head injury, police said. Both were taken to area hospitals with non-life threatening injuries.\nPolice said the victims were walking on a wooded path in the area when two men, identified as Jonathan Leonel Aviles and a 17-year-old Manassas boy, approached them. Aviles brandished a handgun and struck both victims, Perok said, and at some point, the 16-year-old victim was shot in the upper body.\nThe suspects then fled in a vehicle occupied by two other men, identified as Steven Joseph Roldan and Diego Martinez, police said.\nThree schools in the area, Stonewall Jackson High School, Ellis Elementary School, and New Directions, were on secure-the-building mode briefly as a precaution only while police responded to the scene, police and school officials said.\nDetectives from the police department’s gang unit determined that the suspects were connected to the criminal street gang South Side, Perok said in the news release.\nOfficers located the vehicle involved in the shooting on the 7900 block of Community Drive later Wednesday evening. Police then located and detained the suspects in the same area, police said.\nPolice said the suspects and victims knew each other “and the incident was not random,” Perok said in the news release.\nAviles, 20, of Community Drive in Manassas and a 17-year-old Manassas boy were charged with one count of aggravated malicious wounding, one count of malicious wounding and two counts of gang participation. Roldan, 18, of Bruston Parrish Court in Manassas, and Martinez, 18, of Hidden Spring Drive in Manassas, were charged with one count of conspiracy to commit malicious wounding and one county of conspiracy to commit gang participation. Aviles, Roldan and Martinez are being held at the Prince William Adult Detention Center without bond and the juvenile suspect is being held at the Juvenile Detention Center, police said."}