{"uri": "http://www.spokesman.com/stories/2017/jan/11/arrest-made-in-monday-shooting-of-teen/", "title": "Dakota Runge, the teen shot Monday in east Spokane, battles for life", "dct": "Thu, 12 Jan 2017 07:30:00 GMT", "id": "5c1a14e633a62c2029565abba87011e1", "content": "Dakota Runge turned 17 years old in his hospital bed Wednesday, hooked up to machines as doctors treat him for a gunshot wound to the back of the head.\nRunge was shot just after midnight Monday morning outside the Bel-Air Motel at 1303 E. Sprague Ave. On Wednesday police confirmed they arrested a man suspected of shooting Runge.\nRunge’s aunt, Shelley Ethrington, said Runge was born and raised in Spokane and was surrounded by an extended family.\n“He’s just a beautiful kid,” she said.\nRunge has been in an induced coma since the shooting, but doctors started bringing him out of it Wednesday so they could test his brain function. Ethrington said the bullet is still lodged in her nephew’s brain.\n“The bullet did some severe damage,” she said. “He was murdered. Let’s just say it out loud.”\nThe teen had attended North Central High School before dropping out a little more than a year ago but was working on his GED diploma, Ethrington said. He loved to rap and wanted to be a music producer. “He always told us he was going to be rich and buy us a house up on the hill,” she said.\nA few dozen family and friends turned out for a vigil for Runge Wednesday night, praying and sharing stories about Runge. Many of them centered on the teen’s voracious appetite. The Rev. Jose Ceniceros, a West Central youth pastor, spoke of having Runge over to dinner often and having to fully stock his fridge ahead of time.\n“This is something none of us expected,” Ceniceros said. “I want this room to be like Dakota, strong and resilient.”\nIn an interview before the vigil, Ceniceros said he’d known Dakota for the last six years and described him as a good kid who had a “rough life.” Dakota was homeless and couch surfing with his mother at the time of the shooting, Ceniceros said.\n“It’s the first kid I’ve lost,” Ceniceros said. “Honestly it hurts. It really hurts. As a pastor you don’t expect kids to go out like this. Especially this violent. It’s just horrible.”\nDespite Runge’s condition, the family is trying to be hopeful and praying for a miracle, Ethrington said.\n“We’re going to believe,” she said. “That’s all we can do right now.”\nA witness staying in the Bel-Air Motel at the time of the shooting told police that they heard two shots and looked outside so see a car driving away on Sprague and a person lying in the motel’s driveway. The shooting occurred directly across the street from the Hells Angels Club House and may have been captured on their video surveillance cameras, according to court documents. Police have obtained a search warrant to retrieve the video.\nPolice spokesman Officer Shane Phillips said further details on Wednesday’s arrest will be released on Thursday, including the suspect’s name. “It is still developing,” he said.\nSpokane County Jail records show that Brice W. Bailey, 43, was arrested Wednesday morning on suspicion of attempted first-degree murder. Phillips wouldn’t say if Bailey’s attempted murder charge relates to Runge’s shooting.\nBailey also faces a charge of first-degree assault. The charge comes from shooting at Seventh Avenue and Thierman Road just after 11:40 p.m. Sunday, Phillips said.\nBailey’s previous criminal history includes multiple convictions for possession of drugs and drug paraphernalia.\nStaff reporter Eli Francovich contributed to this report."}