{"uri": "http://www.wbiw.com/local/archive/2016/11/one-iu-student-shot-in-face-another-in-jail.php", "title": "One IU Student Shot In Face, Another In Jail", "dct": "Fri, 11 Nov 2016 07:32:00 GMT", "id": "c43523304196ea2fc620534b57bc5fba", "content": "(BLOOMINGTON) - A 20-year-old man is seriously hurt and his roommate is in jail after shooting him in the face with a handgun.\nBoth are Indiana University students.\nPolice were called to an apartment in the 500 block of South Junya Street, off Patterson Drive near West Third Street, just before 10 p.m. after the injured man's girlfriend called police to report the incident. The 20-year-old woman told police the three had been drinking throughout the day.\nShe and the accused shooter were outside on a deck, applying pressure to the injured man's face with a towel, when rescue workers arrived.\nAccording to Bloomington Police Department Capt. Steve Kellams, Trenton Kirchmeier was transported to IU Health Bloomington Hospital, then flown by medical helicopter to IU Health Methodist Hospital in Indianapolis. He was listed in critical condition Thursday afternoon.\nPolice arrested his roommate, 21-year-old Jason Cox, on preliminary charges of aggravated battery and criminal recklessness with a deadly weapon. His bond was set at $15,000 surety, $500 cash.\nAccording to the girlfriend, she and Kirchmeier had stepped outside to smoke a cigarette when they noticed, as they looked through a gap in the window blinds, that Cox had out a .40-caliber Smith & Wesson handgun, waving it around.\nShe told police her boyfriend got close to peer inside, and that she suddenly heard a shot and saw a flash of light. Kirchmeier had been shot in the mouth, and he fell to the ground.\nShe told police Cox ran outside, apologizing, saying he had not intended to fire the weapon. She told police Cox had pointed the gun in a joking manner, as if his friend were an intruder.\nKirchmeier's girlfriend told officers, Cox \"was always waving the gun around at people.\"\nCapt. Kellams says police found a Stevens .12-gauge shotgun concealed in a couch and also \"lots of evidence of illegal drug use,\" including pipes and bongs.\nCox is expected to appear in court next week to be formally charged.\nHave a question or comment about a news story? Send it to comments@wbiw.com"}