{"uri": "http://www.kltv.com/story/31628867/police-identify-constables-wife-as-shooter", "title": "Police: Wife arrested after shooting constable", "dct": "Mon, 04 Apr 2016 03:52:00 GMT", "id": "60bc9d0166610f51232c367c668576f6", "content": "TYLER, TX (KLTV) -\nThe Tyler Police Department says they obtained arrest warrants for Meraland Taylor Jackson, wife of Constable Henry Jackson. She's charged with two counts of aggravated assault with a deadly weapon, family violence after police say she shot her husband.\nThe shooting happened around 7:30 p.m. Saturday in the 3200 block of Chandler Hwy.\nLaw enforcement officials say that Smith County Constable Precinct 1 Henry Jackson was shot one time in the side of his chest by his wife, 66-year-old Meraland Jackson. Police say the shooting was a result of a family disturbance between Jackson and his wife.\nJackson's 5-year-old granddaughter was shot in the ankle. They were both transported to ETMC by ambulance.\nHospital officials have listed Constable Henry Jackson in Fair condition at this time. His granddaughter was treated at the hospital Saturday and released on Sunday.\nMeraland Taylor Jackson was taken to the Smith County Jail. Her bond was set at $500,000 and was released Sunday evening after posting bond.\nConstable Jackson does have a history of legal trouble, dating back to 2008 while he was in office. That year, an investigation into Jackson's private security business began after several deputy constables were reported working for him in county uniform and, possibly, on county time.\nIn May of 2008, Jackson was pulled over and arrested in Canton by DPS after being followed by a private security bureau, also involved in the investigation.\nA grand jury then returned 10 indictments against Jackson, including three counts of official oppression. Those indictments alleged there was false information in applications that he had submitted to the state for people to become security officers.\nThose charges were later dropped and Jackson pleaded no contest to one count of simple assault and tampering with a government record, but was allowed to continue as constable.\nWe spoke over the phone with Juanita Anderson, his campaign treasurer, who says she found out about the shooting this morning.\n\"I know that she is not that kind of a person. He is not that kind of a person, it's just devastating I mean you know, to know that this happened and not knowing why. You know, I'm just appalled,” says Anderson.\nPolice say no charges are expected to be filed against the constable in connection to the domestic disturbance before the shooting.\nCopyright 2016 KLTV. All rights reserved."}