{"uri": "http://www.dispatch.com/content/stories/local/2016/05/12/hilliard-child-shot.html", "title": "Grandmother tries to save 10-year-old boy shot in head in Hilliard home", "dct": "NODATE", "id": "01bbbe05d6a8647e7647af3c0b55bcc4", "content": "The woman calling from the Hilliard home was distraught and frantic as she told the 911 dispatcher Thursday afternoon that her 10-year-old grandson had shot himself in the head. \"Please hurry,\" the woman said. Colin Lucas Fraley was unconscious and not breathing, she said, adding, \"I think he's gone.\"\nThe woman calling from the Hilliard home was distraught and frantic as she told the 911 dispatcher Thursday afternoon that her 10-year-old grandson had shot himself in the head.\n\"Please hurry,\" the woman said. The boy was unconscious and not breathing, she said, adding, \"I think he's gone.\"\nThe woman was performing CPR on Colin Lucas Fraley when Hilliard police and Norwich Township Fire paramedics arrived at the home in the 5100 block of Scioto Darby Road shortly after the call came in at 4 p.m.\nColin was rushed to Nationwide Children's Hospital, where he was pronounced dead soon after. Hilliard Police Chief Robert Fisher said that officers still need to investigate and search the home before they could say what happened.\nDuring the 911 call, the grandmother said she was outside, heard a gunshot and ran inside to find Colin mortally injured.\nShe said the boy had accidentally shot himself with his stepfather's gun. County records show the home is owned by Trisa Sauber, Colin's mother, and her husband, Benjamin Sauber. They weren't home when the shooting occurred, though Colin's 7-year-old sister was. She was unhurt.\nColin was a fifth-grader at Scioto Darby Elementary School, just down the road from his home.\nAcross the street early Thursday evening, 8-year-old Izabella Thomas kneeled on her lawn and prayed for her young neighbor.\nHer mother, Christina Trago, said she wasn't home when the shooting occurred across the road.\n\"It's unbelievably sad,\" Trago said."}