{"uri": "http://nbc4i.com/2016/05/12/hilliard-police-investigating-after-child-shot-in-head/", "title": "Police: 10-year-old Hilliard boy dead after shooting", "dct": "Thu, 12 May 2016 16:58:00 GMT", "id": "bc68322cec8ac80f8b30962b3947cec9", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nHILLIARD, OH (WCMH) –Neighbors sat on stoops and stood around Thursday afternoon, watching police officers at 5145 Scioto Darby Road, where a shooting took place.\nHilliard Police said Colin Fraley, 10, died as a result of a gunshot. Medics said Thursday that he was shot in the head.\nIn a 911 call, the boy’s grandmother told the operator that her grandson had accidentally shot himself in the head. But police couldn’t immediately confirm whether that was the case Thursday, telling NBC4 it was still an open investigation.\nPolice said when they arrived to the house, they found the grandmother giving Fraley CPR. An officer assisted her in giving CPR. Fraley was taken to Nationwide Children’s Hospital, where he was pronounced dead.\nAngie Ely’s daughter Kearsta was a friend and classmate of Fraley’s at Scioto Darby Elementary School. Ely said Fraley wanted to be a videogame designer when he grew up.\n“Certainly very emotional for anyone involved and it’s just a tragic situation,” Hilliard Police Chief Robert Fisher said.\nJames Webster, who lives down the street, said his nine-year-old daughter goes to the same school as Fraley.\n“It hits home,” Webster said. “It does, because I mean, it could have been her just as easily. She could have been down there playing or whatever.”\nAcross the street, Richard Harden said he didn’t know the family but often saw the children playing outside.\n“It’s a tragedy for them, and of course I feel sorry for the grandmother and the family and of course I feel sorry for the little boy,” Harden said.\nPolice say there’s no risk to the public and no person of interest in mind. Still, the investigation continues.\n“Young kids are smarter than you give them credit for,” Harden said. “So, someone’s got to be to blame there. Someone’s got to be to blame.”\nIn a letter to families Thursday evening, Scioto Darby Elementary School principal Tamar Campbell-Sauer wrote:\nDear Scioto Darby Families,\nIt is with a heavy heart that I inform you that Colin Fraley, one of our fifth grade students, passed away today. According to the Hilliard Police the circumstances are still being investigated.\nWe are all deeply saddened by this event. Please take this opportunity to inform your student about this situation and share any information about your family’s personal beliefs and preferences related to Colin’s passing. Death is a difficult topic for many adults and also children handle this stress in a variety of ways. It is natural for them to ask questions or to display behaviors such as:\n· clinging close to adults;\n· displaying regressive behaviors;\n· repetitively re-enacting the event in play activities;\n· appearing not to be affected;\n· thinking about it privately;\n· appearing frightened, agitated or angry;\n· experiencing difficulty sleeping; and,\n· complaining of stomachaches or not feeling well.\nIt is important to listen to your child, help them understand what has happened and return to normal every day activities.\nWe are currently working out details to support students, staff and families during this difficult time. We will have counselors available should students or staff need additional support. While each of us will handle this news in a different manner, it is important that we are supportive of each other as we return to a normal routine.\nPlease keep Colin’s family in your thoughts and feel free to contact the school office if needed.\nSincerely,\nTamar Campbell-Sauer\nScioto Darby Elementary School Principal\nKeep checking NBC4i.com for real-time updates on this story. To get alerts for breaking news, grab the free NBC4 News App for iPhone or Android. You can also sign up for email alerts.\nWhat others are clicking on:\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}