{"uri": "http://www.mlive.com/news/jackson/index.ssf/2016/07/gas_station_shooting_and_monda.html", "title": "Gas station shooting and Monday night drive-by related, police say", "dct": "Tue, 12 Jul 2016 18:43:00 GMT", "id": "7f617b5fd817d4f59146e7f58b86677a", "content": "JACKSON, MI - A drive-by shooting that occurred on Summit Avenue Monday night and a shooting at a Francis Street gas station Tuesday afternoon are believed to be related, according to Jackson police.\nPolice continue to investigate the two connected shootings -- a drive-by shooting that sent four to the hospital with gunshot wounds to their heads Monday, July 11, and a shooting at a Sunoco gas station that left one man with a gunshot wound to the leg Tuesday, July 12.\n\"We are making an assumption that the two shootings are related,\" said Jackson Police and Fire Services Director Matt Heins. \"The shooting that had just occurred on Francis Street may have been retaliatory in nature.\"\nAt 12:51 p.m. July 12, police responded to a shooting at the Sunoco gas station on the 1400 block of Francis Street.\nA man was shot and injured while pumping gas at a station on Francis Street Tuesday afternoon, July 12.\nThe victim, a 23-year-old Jackson man, was standing in the parking lot when a vehicle pulled up on Wall Street and began shooting out of the passenger window at the man, striking him in the leg, police said.\nPolice secured surveillance footage at the gas station that they said shows the shooting victim pulled out a handgun and returned fire before fleeing in a white Chrysler north on Francis Street.\nOfficers stopped the vehicle near the intersection of Cooper Street and Hupp Avenue and found the man with the gunshot to his leg, police said.\nThe man was transported to Henry Ford Allegiance Health for treatment, police said.\nThe victim's name has not yet been released, but Heins said he is a known felon and will be charged for possessing a firearm.\nThe gas station shooting victim's name appeared repeatedly in police investigations of a shooting that occurred on Griswold Street in May, police said. And it is also believed he is involved in Monday's Summit Avenue shooting, Heins said.\nPolice responded to a home on Griswold Street, May 31 after reports of shots fired there. Police said they discovered the home had been shot and there were no injuries reported, police said.\nPolice said there were six people in or around a car parked in the 500 block of Summit Avenue at about 9 p.m. Monday, July 11 when an unknown vehicle opened fire on the group, hitting four in the head.\nPolice are investigating a drive-by shooting on Summit Avenue that sent four individuals to the hospital with gunshot wounds to the head Monday evening.\nThe victims of the Summit Avenue shooting have been identified by police as Michael Fowler,25, Miacha Tillman, 19, and London Truman-Arnold, 20. The name of the 16-year-old victim will not be released, police said.\nPolice have released the names of the victims injured in a drive-by shooting that occurred on Summit Avenue Monday night.\nHeins said rumors that there was an incident at Henry Ford Allegiance Health following the Summit Avenue shooting were false. It is standard protocol to lock down the hospital when there is a shooting victim being treated and there is no shooter in custody, he said.\nThe violence gripping the city is more than a police issue, it is a community issue, Heins said.\n\"We run into too many situations where people won't talk to us,\" Heins said. \"The problem is not going away. It is getting worse. We need the community's support.\"\nNo arrests have been made and the investigation suggests both incidents are gang related, police said.\nPolice are searching for a blue Honda Accord involved in the Francis Street shooting.\nA witness described what appeared to be a black GMC Envoy SUV drive northbound on Summit Avenue around the time of the Monday evening shooting, but police could not confirm if the vehicle was involved in the shooting.\nAnyone with information on either incident is asked to contact the Jackson Police Department Detective Bureau at 517-768-8726 or Crime Stoppers of Mid-Michigan at 855-840-7867."}