{"uri": "http://www.mlive.com/news/jackson/index.ssf/2016/07/police_investigating_drive-by.html#incart_river_home", "title": "Investigation continues into drive-by shooting in Jackson that injured four", "dct": "Tue, 12 Jul 2016 17:38:00 GMT", "id": "c4a91e52e70de7b760a28f5eb4b86367", "content": "JACKSON, MI - An investigation continues today into a drive-by shooting on Summit Avenue that sent four people to the hospital with gunshot wounds to the head Monday evening.\nPolice said there were six people in or around a car parked in the 500 block of Summit Avenue at about 9 p.m. Monday, July 11 when an unknown vehicle opened fire on the group, hitting four in the head.\nOne of the victims, a 20-year-old male, was listed in critical condition with a gunshot wound to the head, police said. He was in surgery at Henry Ford Alliance Health at about 11:45 p.m. Monday. His current condition was not immediately known.\nThe other three victims, a 16-year-old girl, a 19-year-old man and a 25-year-old man were treated and are in stable condition, police said.\nFour victims are being treated at Henry Ford Allegiance Health after all were shot in the head while sitting in a parked car outside of a house on the 500 block of Summit Avenue, Police say.\nJackson Police Deputy Chief Elmer Hitt said the 16-year-old girl, who was the only shooting victim at the scene when police arrived, was shot in the back of her head and was conscious and talking at about 9:07 p.m.\nShortly after being dispatched to the shooting, police were called to Henry Ford Allegiance Health after being alerted that other three males struck by gunfire were driven by one of the victims to the hospital.\nA witness described what appeared to be a black GMC Envoy SUV drive northbound on Summit Avenue around the time of the shooting but police could not confirm if the vehicle was involved in the shooting, police said.\nPolice had been called to the same area recently to investigate reports of shots fired. At 2:17 a.m. June 11, officers were dispatched to the 500 block of Summit Avenue for the report of shots fired.\nTheir investigation determined a residence was struck as well as three vehicles. The people police believed to have been shot at in the incident were not forthcoming with information, police said.\nAnyone with information is asked to contact the Jackson Police Department Detective Bureau at (517) 768-8726 or Crime Stoppers of Mid-Michigan at (855) 840-7867."}