{"uri": "http://www.effinghamdailynews.com/news/local_news/prosecutor-fatal-shooting-of-teen-was-an-accident/article_971bdb3c-7781-11e5-a4d7-3bf42d40eaf5.html", "title": "Prosecutor: Fatal shooting of teen was an accident", "dct": "Tue, 20 Oct 2015 00:00:00 GMT", "id": "2c8fbfdcc7404dd47a2aca8f8cc3b846", "content": "EFFINGHAM — The weekend shooting death of teenager Kaylee N. Jacob was unintentional, a prosecutor said Tuesday.\nEffingham County State's Attorney Bryan Kibler said a juvenile court proceeding has been initiated for one of the two boys arrested after 16-year-old Jacob was shot Sunday evening in the 3200 block of South Banker Street.\nKibler said he could not discuss specifics of a juvenile case, but noted that authorities were proceeding as if it stemmed from an unintentional shooting.\n\"I can assure the people of Effingham County that this shooting was not done in cold blood,\" Kibler said. \"There was no intent to kill or hurt anyone.\"\nKibler would not comment on the possibility of trying the case in adult court, though he said Monday that a transfer was possible.\n\"Everything is still under investigation,\" he said on Tuesday.\nJacob, an Effingham High School junior, was pronounced dead at HSHS St. Anthony's Memorial Hospital early Sunday evening. Police had been called to the shooting scene at 6:15 p.m. The gun involved in the shooting had been reported as stolen, police have said.\nKibler praised Effingham city police for a diligent investigation.\n\"The city police have done a phenomenal job with this investigation,\" he said.\nFriend Jesse Tucker said Tuesday that the findings don't change the fact that Jacob has passed on so tragically.\n\"Yes, it's a terrible situation and the boy will have to live with it the rest of his life,\" Tucker said. \"But it doesn't change the fact that she is gone and her family and friends will miss her every single day.\"\nFuneral services are scheduled for 10 a.m. Friday at Bauer Funeral Home in Effingham, with burial in Oakridge Cemetery. Visitation is from 4 p.m. to 7 p.m. Thursday evening at the funeral home.\nJacob was born in Mattoon in 1999, the daughter of Steve and Crystal (Hale) Jacob, according to her obituary. Her mother lives in Mattoon and her father in Effingham. She is also survived by five siblings.\nBill Grimes can be reached at 217-347-7151, ext. 132, at bill.grimes@effinghamdailynews.com, or on Twitter @EDNBGrimes."}