{"uri": "http://www.sfgate.com/crime/article/2-arrested-for-shooting-4-people-outside-San-6717634.php", "title": "2 men could face hate-crime charges in San Leandro shooting", "dct": "Wed, 23 Dec 2015 00:00:00 GMT", "id": "f2e0f1ac53f746ea265ea91a4179a47f", "content": "Two men were arrested on suspicion of attempted murder with a hate-crime enhancement Tuesday after they allegedly shot four people outside a San Leandro nightclub Monday morning because some of the people in the group were gay, police said.\nThe suspects were identified Wednesday as Carlos Cervantes and Salvador Lopez Aguilera, both 28, said Lt. Robert McManus, a police spokesman.\nThe victims, three men and a woman, were all between 28 and 34 years old, and are from Oakland and Livermore.\nOfficers responded to reports of the shooting in the parking lot of Club Caliente on the 14500 block of East 14th Street just before 2 a.m. on Monday, McManus said.\nThe incident started inside the club, where the victims met to go dancing. They were confronted by Aguilera and Cervantes at the bar, and an exchange of words ensued.\nMcManus said Cervantes and Aguilera followed the group to the parking lot where they began making disparaging remarks about them due to their sexual orientation.\n“At one point, Aguilera told Cervantes to shoot them, and he pulled out a high-powered handgun and opened fire,” McManus said.\nFour people were injured, all hit by gunfire, McManus said, but none of their injuries was life-threatening. All were taken to nearby hospitals for treatment and were released, but none of the victims was identified.\nAfter the shooting, the suspects fled in Aguilera’s van, which had been parked across from the club at East 14th Street, but was later found in front of an East Oakland home, police said.\nAbout noon Tuesday, undercover San Leandro detectives caught Aguilera leaving a residence in the 1100 block of 82nd Avenue in Oakland, where he was arrested.\nMcManus said when Cervantes was arrested, he appeared to be making plans to leave the Bay Area or possibly the state.\nDetectives started trailing him in a car that left a home in the 3100 block of Berlin Way in Oakland, then continued to follow the car along Interstate 580 to San Leandro.\nThe car stopped at MacArthur Boulevard and Dutton Avenue around 6 p.m. Tuesday, where Cervantes was identified and arrested. Investigators were continuing to look for the gun used in the shooting, described as a high-caliber semi-automatic pistol.\nBoth suspects were being held at Santa Rita Jail in Dublin. Their arraignment in Alameda County Superior Court is set for 2 p.m. Thursday.\nKale Williams is a San Francisco Chronicle staff writer. E-mail: kwilliams@sfchronicle.com Twitter: @sfkale"}