{"uri": "http://www.startribune.com/mpls-rapper-behind-huge-party-south-of-metro-where-4-people-were-shot/382750861/", "title": "Mpls. rapper behind huge party where 4 people were shot", "dct": "Wed, 15 Jun 2016 00:00:00 GMT", "id": "e7ef5f58e44ad29b80a50df99ec73d6b", "content": "A Minneapolis rap musician who put together a big bash on the edge of the south metro where four people were shot said Monday that the weekend bloodshed compels him to disavow violent messages through his music “from this day forward.”\nThe statement from Tavonte Woods follows the mayhem that broke out early Saturday at the Summer Kick Off Mansion Party, an informal, under-the radar gathering staged on rural property in northern Rice County.\nHundreds of people were at the party, where admission was charged and alcohol served without a license, when gunfire erupted shortly before 3 a.m. Saturday. The party was at a 43-acre property in Webster Township, about 45 minutes south of the Twin Cities. The violence drew personnel from seven law enforcement agencies.\nA woman was shot in the chest, and three men were also wounded. All four were said to be in stable condition. No arrests have been made.\nAttendee Angela Williams, 19, said “everybody was dancing and the music was a little loud when some stuff happened at the front gate.” She said there were people inside a big shed fighting. “That’s when the DJ said everyone had to clear out.\n“One guy came out of the house with an AR-15 and started shooting in the air and said, ‘Everyone has to go,’ ” Williams said. Then she heard more gunfire.\n“Everyone was running around like chickens with their heads cut off,” she said.\nWilliams said she came upon the woman who was shot, and “I was trying to help her. She said, ‘I have kids.’ ”\nThe Mansion Party web page did not reveal the location of the gathering until an RSVP was submitted for the 18-and-older event. “Security will be strictly enforced,” the web page declared. “Leave all drama & weapons at home.”\nWilliams said there was security at the front gate, and a handful of men in black T-shirts patrolled the property. She said she saw one of them with a shotgun.\nPeople clearly too young to drink alcohol were being served, she said. The bar was charging $4 for shots of whiskey, vodka and other forms of hard liquor, she said.\nCounty Commissioner Jeff Docken, whose district includes Webster Township, said, “We knew [afterward] there was alcohol involved and the possibility of minors drinking involved. Whatever they were doing was against the law.”\nAnthony Webster, who lives in Prior Lake and is an acquataince of the property's owner, said Sunday said he was aware of the party and that it was arranged by his stepson. He then declined to say more to the Star Tribune.\nDunn asked that anyone with information or audio or video contact the Sheriff’s Office at 1-507-334-4391."}