{"uri": "http://wane.com/2016/06/21/1-critically-hurt-in-overnight-shooting/", "title": "Victim killed in overnight shooting ID’d as 14-year-old boy", "dct": "Tue, 21 Jun 2016 05:04:00 GMT", "id": "6d27e829ac736d4f8659ddcce2755f1b", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nFORT WAYNE, Ind. (WANE) The victim of an overnight fatal shooting on the city’s southeast side was a 14-year-old boy. The Allen County Coroner’s Office says Nicholaus Scroggins’ II cause of death was gunshot wound(s) and the manner of death is homicide.\nHis death marks the 15th homicide in Allen County this year. Scroggins was found shot in the middle of the 5200 block of Lillie Street around 4:20 a.m. Tuesday morning.\n“To do something like that to a baby is unheard of, it’s unreal, it’s unimaginable,” Scroggins’ Cousin, Vanessa Collins, said.\nFort Wayne police were called to the block after several people in the area reported gunshots and called 911. There, first responders found Scroggins down in the roadway, suffering from a gunshot wound. He was taken to a local hospital in critical condition, where he later died.\nFort Wayne Police Department Public Information Officer Jason Anthony said earlier that two houses and a pickup truck were struck by bullets in what appeared to be a hail of gunfire. More than 50 evidence markers could be seen in the roadway.\nAnthony said detectives were interviewing neighbors and Crime Scene Technicians were processing the scene and collecting evidence. There’s no suspect information, according to Anthony.\nAnyone with information is asked to call the Fort Wayne Police Department at 427-1222 or Crime Stoppers at 436-7867.\nScroggins is the second city teen to be killed by gunfire in less than a week. On Thursday, 15-year-old John Bennett Jr. was found shot in an alleyway near the intersection of Avondale Drive and Baxter Street. Neighbors told police they heard shots fired and found the teenager down.\nFort Wayne Police Office Michael Joyner said he’s calling on parents to help solve this problem.\n“You have to know what your children are involved in, who they are hanging out with,” Joyner said. “You can’t have them roaming the streets at three or four in the morning. You have to take some responsibility.”\nFort Wayne Mayor Tom Henry issued the following statement in response to the deaths of young people to gun violence.\nPublic safety is a top priority of my administration. I’m concerned by the recent violence involving young people in our City. It’s vital for us to come together united as individuals, families, and neighborhoods to communicate and share information with law enforcement. I have full confidence in the Fort Wayne Police Department and the outstanding work they do each day to serve and protect our community. We will find those responsible for these acts of violence.”\nTuesday morning’s shooting was the latest in a rash of violent crime on the city’s south side, and came hours after at least two minors were shot Monday night blocks away. Joyner said Tuesday that those victims were both shot at Oxford Street and South Park Drive and one was found at Weisser Park Avenue and the other at Holton Avenue. Last week, a woman was shot in a drive-by shooting.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}