{"uri": "http://www.sfexaminer.com/june-jordan-high-school-lockdown-due-police-activity/", "title": "UPDATE: Four injured, one critically, in shooting outside June Jordan high school", "dct": "Tue, 18 Oct 2016 15:50:00 GMT", "id": "f54f2b463f68181afcec809720415010", "content": "Multiple students were injured in a shooting at an Excelsior District high school parking lot in apparent targeted violence that briefly left the school on lockdown Tuesday afternoon, according to police.\nPolice received calls from staff at June Jordan School for Equity around 3:20 p.m. and rushed to the school for what was thought to be the scene of an active shooting.\nThe shooting left a female student in critical condition, and, according to the school, three other bystanders also suffered injuries. Police confirmed two male students were hospitalized along with the female student, and a fourth victim walked into San Francisco General Hospital with injuries.\n“This was not just a random shooting,” said San Francisco police spokesperson Carlos Manfredi. “We believe one of the victims may have been the initial target.”\nA statement on the school’s website reiterated that the shooting did not appear to be random.\n“We want to reassure you that this was an isolated incident outside of the school building where one student was being targeted by outsiders,” the statement reads.\nSoon after the shooting, four men believed to be the suspects ran away west along Brazil Street. They remained at large as of Tuesday night.\nStudents and staff in the school were told to lock class room doors and shelter in place until police had cleared every room in the school.\n“Active shooter scenes happen very quickly,” said Manfredi.\nSince three of the victims entered the school after the shooting, officials initially thought the incident occurred inside the school and that a shooter may have remained inside.\nHours after the shooting the neighborhood remained full of police who had set up a perimeter. Students and staff coming from the school after the incident said they saw people run and followed or were told to shelter in place and were then released.\nSan Francisco Unified School District spokesperson Heidi Anderson said the school will be open Wednesday but with increased security.\nThree of the victims, two males and a critically injured female, were taken to a hospital for treatment soon after the incident. The district later confirmed that a fourth student was\nalso injured.\nShamann Walton, vice president of the Board of Education, said he knows several students at the school but the names of the students injured have not been released.\n“Anytime of course an incident happens like this the whole school community is concerned,” Walton said. “Right now, my main concern is everyone being safe and anyone who was injured being taken care of.”\nWalton said the school district will respond by making sure there are support services like counselors available for students and faculty to talk with.\nActive-shooter training is also important in terms of the school district’s response to incidents like this, but violence-prevention teams and law enforcement relationships with the community are also important, he said.\nStevon Cook, a candidate for the Board of Education who knows a teacher at June Jordan, said the incident is “alarming.”\nCook called the teacher after the incident, who told him he was safe.\n“He said everything is fine,” Cook said."}