{"uri": "http://chicago.suntimes.com/news/five-wounded-in-gary-shootings-but-two-of-them-shot-themselves/", "title": "Five wounded in Gary shootings, but two of them shot themselves", "dct": "Mon, 11 Apr 2016 16:36:00 GMT", "id": "a1ceca3741ce38d8ee3e9c87473e9f06", "content": "Five people were shot – two of them accidentally – in separate incidents in northwest Indiana on Saturday.\nIn the most recent shooting, a 17-year-old girl was talking to a friend in the 500 block of Madison Street at 11:15 p.m. when she heard shots and realized she’d been hit in the leg, according to Gary police. Her friend took her to Methodist Hospitals Northlake campus in Gary, police said.\nAfter investigating the shooting, police said Monday the teen accidentally shot herself and falsified reports “to avoid prosecution.”\nAt 10 p.m., officers responded to a call of shots fired in the 1700 block of East 7th Avenue, and found a 37-year-old woman with a gunshot wound to the torso. She was also taken to Methodist Northlake for treatment, police said.\nThe woman told officers she was leaving her house with her boyfriend when they saw two males “acting suspicious” by a vacant garage. The pair went back inside and waited several minutes before going back outside, where the two males shot at them, striking the woman, police said.\nAn hour earlier, a 20-year-old man was shot in the stomach near 5th Avenue and Porter Street about 9 p.m. The man was with friends when a male wearing all black walked up and fired shots, police said.\nHis friends took him home to the 700 block of Ralston Street and called police. He was taken to Methodist Northlake for treatment.\nAfter investigating the shooting, police said Monday that man also shot himself accidentally and falsified reports “to avoid prosecution.”\nAt 6:30 p.m., officers responded to Methodist Northlake for a 32-year-old man who was shot multiple times in the hand and hip. The man told officers he was walking in the 2000 block of Massachusetts Street when he was shot. A motorist stopped to help and took him to the hospital, police said.\nIn the first shooting of the day, a 26-year-old man was shot several times in the left side of his body in the 800 block of Ohio Street at 11:40 a.m. The man was taken to Methodist Northlake for treatment, police said.\nThe man told officers an unknown person shot him, but police have a person of interest in custody.\nAnyone with information about any of the incidents should call Sgt. Michael Barnes of the Violent Crimes Unit at (219) 881-7434."}