{"uri": "https://www.dnainfo.com/chicago/20160817/bronzeville/man-charged-incident-where-officer-was-grazed-face-by-bullet-cpd", "title": "Man Charged With Shooting Police Officer In His Face, Police Say", "dct": "Thu, 18 Aug 2016 08:29:00 GMT", "id": "7505600b2c185a9ed7e0b5044270a5a8", "content": "BRONZEVILLE — Chicago Police Supt. Eddie Johnson said Wednesday a man has been charged in the Tuesday incident that left an officer grazed in his face by a bullet.\n\"Last night was a perfect example of good police work and a sobering reminder of dangers officer face on a daily basis,\" Johnson said. \"This is a reminder of what I've said for too long about brazen offenders who think they can shoot at the police after stealing a vehicle.\"\nCharles Lawson, 24, of the 10700 block of South Wentworth Avenue, was charged with:\n• Four counts of Attempted Murder\n• Aggravated battery\n• Possession of a stolen vehicle\n• Aggravated hijacking\n• Aggravated fleeing and eluding\nLawson is \"the perfect example of what we've been saying. The same guys committing the same crimes over and over again,\" Johnson said. \"This guy doesn't believe we're serious. Law enforcement is being scrutinized all over the country for everything they do but they didn't run away from this, they ran to it.\"\nAround 10 p.m. on Tuesday, officers were trying to pull over a car in the 600 block of East 100th Place when Lawson began to shoot at them, grazing one officer in his face with a bullet, police said.\nWhile officers returned fire, Lawson was not hit, police said. But he crashed the car and tried to run away, police said. He was taken into custody a short time later, Johnson said.\nThe wounded officer was taken to Advocate Christ Medical Center with \"non-life threatening injuries.\"\nLawson was on parole after serving prison time for armed robbery, police said. He had been convicted of armed robbery and attempted armed robbery without a gun from 2011 and was sentenced to 7 1/2 years, according to the Illinois Department of Corrections. He was paroled in April 2015.\nThe officer who was wounded was recently lauded by the department after helping an elderly woman buy groceries in Washington Heights, Johnson said.\nThe police also released dashcam video from the shooting. This video was released as part of the criminal investigation into Lawson.\nIPRA will conduct its own investigation into the shooting since officers fired at Lawson, said Anthony Guglielmi, a Chicago Police spokesman.\nFor more neighborhood news, listen to DNAinfo Radio here:"}