{"uri": "http://www.wmcactionnews5.com/story/29280648/scso-investigates-shooting-on-egyptian-cove", "title": "4-year-old dies after finding gun, pulling trigger", "dct": "Wed, 10 Jun 2015 00:00:00 GMT", "id": "be50d910a8c5eea1ed3446da6178caef", "content": "SHELBY COUNTY, TN (WMC) -\nShelby County Sheriff's Office deputies and the Department of Human Services are investigating an accidental shooting that killed 4-year-old Aabriel Jones Jr. on Tuesday night.\n(WMC) - The average number of kids injured in the Mid-South each year from gunshots is 47. Since 2003, 15 children have died from gunshot wounds.\nFive of the young boy's siblings were inside the house in the 4300 block of Egyptian Cove when the gun went off just before 7 p.m.\nThe boy's father, Aabriel Jones Sr. told deputies he was outside working in the yard when he heard a gun go off. He ran into the house and called 911 as soon as he saw his injured son. He told deputies his son was lying unresponsive on his parents' bed.\n\"Apparently, a 4-year-old had found a gun in the house and picked it up and inadvertently shot himself. He has since died,\" SCSO spokesman Chip Washington said.\n\"I just can't imagine myself in his [father's] shoes, none whatsoever,\" said neighbor Robert Parker.\nParker said he used to have a gun, but got rid of it to avoid potential risk around children.\n\"I love kids,” he said. “I do a lot with kids. That's just horrifying to think about that. I wouldn't want to imagine myself in that type of situation.\"\n\"You know, 4-year-old around a gun, you got to hide it from them,\" Memphian Jackson Lawrence added. \"You got to teach them early that it's dangerous.\"\nFamily and friends of the victim did not want to comment on the shooting; they say the situation is too painful.\nJones Sr. told deputies that his son must have been playing in his parents' room when he found the gun.\nNo charges have been filed yet since the case appears to be an accident. However, SCSO says the District Attorney's office will make the final call. It is still under investigation.\n\"Anytime you have something like this and the child is the victim, it's very tough,\" Washington said.\nHidden camera experiment tests kids and knowledge about gun safety\nIn 2014, WMC Action News 5's Lauren Squires conducted a hidden camera investigation with several parents who volunteered to put their kids to the test.\nWith the help of Covington Police Department and a participating day care, a fake gun was hidden among the toys. Hidden cameras were placed around the room so parents could see how their kids would react when they found the gun. Would they heed their parents warnings about the dangers of guns? Would they touch it? Pull the trigger?\nWhat the kids did was shocking to the kids' parents, who then had to re-evaluate how they approached the topic of gun safety with their kids.\nWe hope sharing this investigation with you can help you talk to your kids about gun safety and hopefully prevent other tragedies from happening in our community.\nCopyright 2015 WMC Action News 5. All rights reserved."}