{"uri": "http://www.sacbee.com/2014/07/13/6553124/five-people-shot-one-dead-in-early.html", "title": "One dead, 4 wounded in early-morning shootout in Sacramento", "dct": "Sun, 13 Jul 2014 09:54:00 GMT", "id": "3386be68341bbaaaa65f9b028026a8f0", "content": "A predawn shootout in the parking lot of a hookah bar and a liquor store on Fulton Avenue north of Alta Arden Expressway early Sunday killed one and wounded as many as four others, Sacramento sheriff’s deputies reported.\nAround 1:15 a.m., at least 60 people – most of them in their teens and 20s – gathered in front of The Hookah Lounge and 1 Stop Liquor and Wine, said sheriff’s Detective Scott Swisher. The confrontation claimed the life of a 20-year-old man who police believe was an innocent bystander.\nA tearful Angelo Mares, who was present when the shooting broke out last night and returned to the scene Sunday, said the victim was a close friend who was killed by a stray bullet. He said his friend, whose name hasn’t been released by authorities, had attended Rosemont High School and recently had started working at Job Corps.\n“He got caught in the crossfire. He got hit in the back of the head,” Mares said. “We were both smoking cigarettes. People were just arguing and we were watching them fight, and three or four other guys brought out guns.”\nAcross the street from the strip mall, about 20 people were waiting for crime scene investigators to open the area so they could get to their cars parked in front of half a dozen establishments inside the yellow police tape. Investigators said they found blood splatters from the corner of Fulton and Alta Arden to the middle of the block in front of the the BMW dealership.\nThose involved in the shootout scattered before police arrived, and detectives have not yet determined the motive for the shootout or whether the parties involved were linked to one another, authorities said.\n“A couple of groups of people got into an argument in the strip mall, and several were shot,” Swisher said. “There were dozens of shots fired.”\nLea Waterman said she and several friends had just arrived at the packed Hookah Lounge to celebrate her 19th birthday when she heard bursts of gunfire. “I just dropped to the ground,” she said. “I heard about 12 shots, and then I stopped counting.”\nAnother person who had been waiting all night to get to her car, Latisha McGhee, 19, said she and her friends arrived at 1:15 a.m. “When we got there, there was just a big ol’ fight and they started shooting. I took off running – I was focused on keeping my life.”\nEli Habibeh, who owns the Blow and Tell smoke shop nearby, said “an argument involving kids” ages 19 and up erupted as a crowd gathered in front of the Hookah Lounge and the nearby 1 Stop Liquor and Wine. The business center also includes a pizzeria and a transmission and smog shop.\nHabibeh said the parking lot is a draw for crowds of young people. “Too many people hang out there,” he said. “People being loud, arguing, all outside the place.” This time, he added, “People started shooting,” and the shooting continued at a nearby convenience store. Habibeh, who also had spent the night waiting to get to his car, said he saw police arrest three or four people after the shootout.\nZak Nayagkh, who said his son owns The Hookah Lounge, said the argument started across the street in the parking lot of Target and then moved to the strip mall.\nFulton Avenue was closed for some 200 yards in each direction as detectives processed the crime scene late into the afternoon.\nAnyone having information on the shootout is asked to call the Sheriff’s Department at (916) 874-5115, or (916) 874-8477 to provide information anonymously."}