{"uri": "http://www.sacbee.com/news/local/crime/article113649774.html", "title": "North Natomas family grieving after 17-year-old boy found fatally shot in garage", "dct": "Wed, 09 Nov 2016 08:49:00 GMT", "id": "66b1339aa38ccb84c8d16f88bb937633", "content": "A 17-year-old Inderkum High School senior was found shot to death in the garage of a family member’s home late Tuesday, rattling a quiet North Natomas neighborhood.\nSacramento police responded to a report of a shooting around 10:40 p.m. Tuesday on the 5700 block of Kandinsky Way. Once there, they found Gurnoor Singh shot inside the garage. Singh was pronounced dead at the scene.\nOfficer Matthew McPhail, a Police Department spokesman, said detectives have not determined a motive for the shooting.\n“This one seems like a bit of a head-scratcher,” McPhail said. “I don’t think we have a clear indication at this point what led up to this young man’s death.”\nMcPhail said there was not a large gathering at the home before the shooting and that detectives have found no evidence that the homicide was gang-related.\n“It was in the middle of the week in an upper middle class residential neighborhood,” he said. Kandinsky Way is a short street of newer homes near a neighborhood park, just east of East Commerce Way.\nSingh is the sixth teenager killed in Sacramento County this year.\n“Particularly when you’re dealing with young people, we feel a burden to ensure that their death is not in vain,” McPhail said. “We feel particularly motivated to find some sort of closure or resolution in the case.”\nSeveral family members and mourners gathered at the home where the shooting occurred Wednesday, as well as at a neighboring home where relatives of the victim also live. Family members declined to speak with reporters, saying they were too distraught. Loud cries of grief could be heard coming from the home’s backyard.\nDanny Phung, who lives a block away on Da Vinci Way, said he was inside his home watching coverage of the election when the neighborhood was suddenly flooded with police cars and a helicopter began hovering overhead. He said intruders had broken into a home on his street a few weeks ago and the neighborhood is even more nervous now that an unsolved homicide has taken place there.\n“It’s very unsettling,” he said. “It’s scary, especially with a lot of kids living around here.”\nThe neighborhood is full of well-kept and large houses. The home where the shooting took place sold in July for $535,000, records show.\nNatomas Unified School District spokesman Jim Sanders said in an email “this is a difficult day for Inderkum and a sad time for the Natomas community.”\n“We extend our sympathy to his family and friends, and we’re reaching out to provide support,” Sanders wrote. “We sent a team of trained mental health professionals to Inderkum (Wednesday) to assist family members, classmates and staff as needed. Our team will remain on campus tomorrow.”\nAnyone with information is asked to call Sacramento police at 916-264-5471.\nRyan Lillis: 916-321-1085, @Ryan_Lillis"}