{"uri": "http://www.cbs7.com/content/news/Apparent-active-shooter-reported-at-Alpine-High-School-392737491.html", "title": "NEWS BLOG: Tragedy in Alpine", "dct": "Thu, 08 Sep 2016 09:28:00 GMT", "id": "63fd3fb3d9bc6074cafbc6785da9468a", "content": "ALPINE -- UPDATE 1:50PM FRIDAY: Alpine High School will be open from 3 p.m. to 5 p.m. for students to be able to pick up their belongings.\nStudents must meet at the foyer entrance, where they will be escorted by a teacher.\nBand students are asked to meet at the rear band hall door to pick up any items left at the band hall.\nUPDATE 12:30PM FRIDAY: The federal agent remains in fair condition.\nUPDATE 10:29PM: Officials with Medical Center say the male federal agent is now listed in fair condition.\nUPDATE 7:20PM: The Brewster County Sheriff's department is still sifting through leads after a series of threats called in following the shooting.\nUPDATE 6:15PM:\nSul Ross State University has been cleared by law enforcement after a search of the campus.\nUPDATE 5:00PM:\nAll schools will be closed on Friday following Thursday's shooting.\nCouncilors and clergy will be available at the schools to talk to students.\nAll Alpine ISD staff will have a meeting at 9:30 a.m. at the Alpine High School auditorium for training to help students cope with the tragedy.\nA parent and community forum will be held on Sunday at 1:30 p.m. at the Alpine Civic Center.\nUPDATE 4:15PM:\nThe Brewster County Judge has released this statement on the shooting at Alpine High School:\nOn behalf of Brewster County, it is with heavy heart and extreme sadness that I want to reach out to our community during this difficult time. While the events of the day are truly tragic, we all know they could have been much worse. I would like to thank all first responders, AISD, teachers and administration, as well as students whom may have helped prevent the situation from escalating. Our thoughts and prayers are with all those directly affected by today's events. Rest assured, the community at large feels your pain and the healing process will be a community wide initiative.\nRespectfully here to serve you,\nJudge Cano\nUPDATE 2:40PM:\nHomeland Security confirms that the agent injured in the apparent accidental shooting at Alpine High School has been transported to Odessa Medical Center Hospital in stable condition.\nUPDATE 2:00PM:\nThe Alpine High School shooter has been identified as a 14-year-old freshman female, though her name has not yet been released.\nAccording to a Brewster County Sheriff's Office Press Conference, a deputy was near the school when the shooting and was able to enter through the back door of the band hall where he found the shooter and recovered her weapon.\nA further search by the Alpine Police Department and BCSO cleared the school, during which a victim was found with a gunshot wound to her lower backside. The shooter's injury was determined to be self-inflicted.\nThe school does not have a resource officer on campus.\nLaw enforcement from Midland, Odessa, Pecos, Fort Stockton, and Pecos immediately arrived in Alpine to help clear the school and assist with the investigation.\nDuring that clearing a federal officer fired his weapon, injuring another federal officer. Though the shot was believed to be accidental, it is currently under investigation. The officer that was injured was transported to Odessa Medical Center Hospital in stable condition.\nBrewster County Sheriff Dodson states that a 'nut' has taken advantage of the tragic situation by calling in bomb threats across the area, stretching law enforcement thin.\nA note was found that read \"If you thought what happened at the school was bad, wait to see what happened at Sul Ross\".\nThe threats are all believed to have come from the same person, who law enforcement believes is a male. The bomb threats are not believed to be connected to the shooting.\nThe FBI has been called in to assist with an investigation of the threats. Bomb-sniffing dogs are being flown in to assist with the search.\nThe suspect, if arrested, would face federal charges.\nDeputies with the Pecos County Sheriff's Office were able to assist in clearing and securing the Big Bend Regional Medical Center.\nAuthorities are also on scene at Sul Ross State University, using the help of school faculty and bomb dogs.\nUPDATE 12:50PM:\nThe Big Bend Regional Medical Center confirms they treated two patients -- one was treated and released, one was treated and transferred.\nAccording to Brewster County Sheriff Ronny Dodson a girl shot another girl before turning the gun on herself.\nThe alleged shooter's grandfather told Sheriff Dodson \"We don't know what would provoke this.\"\nAlpine Police responded to the school Thursday morning after hearing reports of a shooter.\nThe shooter reportedly entered the band hall bathroom, where she shot another female student in the lower backside.\nWhen officers arrived on scene they heard more gunshots before finding the alleged shooter in the bathroom with an apparent self-inflicted wound.\nShe was also found to be armed with a semi-automatic pistol and 'plenty of ammunition', according to Sheriff Dodson.\nMultiple law enforcement agencies responded to the scene and assisted in clearing the school. During this time a U.S. Marshal accidentally fired at a Homeland Security Investigations officer, wounding him. According to Sheriff Dodson this was considered accidental.\nAfter being placed into critical lockdown, all Alpine schools are releasing their students to parents.\nMarfa ISD's superintendent tells CBS 7 that all Marfa schools have been placed under shelter in place as a precaution.\nPecos ISD's superintendent tells CBS 7 that all Pecos schools are under a soft lockdown as a precaution. All extracurricular activities for the schools have been cancelled for Thursday.\nSul Ross State University is also under lockdown at this time for a bomb threat, according to the Alpine Police Department.\nBrewster County Sheriff Dodson reports that someone called the sheriff's office and said \"Y'all better leave me alone,\" and made threats against Sul Ross State University.\nAlpine Police Department initially confirmed that there was an active shooter at Alpine High School.\nHigh school students were moved to the local Jehovah's Witness church until an all-clear was given.\nCBS 7 will continue to update this story as more information is released.\nReported active shooter at Alpine High school. Students at high school are being evacuated. All schools remain on lockdown. Please stay tuned for more (Avalanche photo by Gail D Yovanovich)."}