{"uri": "http://kdhnews.com/news/crime/accused-shooter-appears-in-court/article_b26a5bbe-61a8-11e5-93d3-bb4b806efc68.html", "title": "Accused shooter appears in court", "dct": "Wed, 23 Sep 2015 04:30:00 GMT", "id": "76fa76fc0c4405b62f4ab340a0044ad2", "content": "Rico Doyle, 36, was indicted Sept. 2 on two counts of aggravated assault with a deadly weapon. He also was arraigned on a charge of murder in April, but has not been indicted on the murder charge.\nHowever, prosecutors and police indicated Doyle could be charged with capital murder in the future.\nWhen he appeared briefly in Judge Fancy Jezek’s 426th District Court on Tuesday, Doyle pleaded not guilty to the two counts of aggravated assault with a deadly weapon, setting the stage for what could be a lengthy trial.\nAccording to an arrest affidavit, Killeen police responded to Gilmer Street on April 21 to find multiple victims had been shot.\nPolice later identified Kysha D. Edmond-Gray, 42, and Deanna Louise Buster, 38, as the two women who were killed in the shooting.\nPolice searched for Doyle for three days after the shooting before he was arrested April 24.\nThe shooting took place about one year after Doyle completed his parole in the 2007 shooting death of Tyrone Haskins, an 18-year-old Killeen High School student.\nAccording to previous Herald reports, Haskins was shot outside a home in the 4400 block of Alan Kent Drive after an argument.\nDamiee Kendrick Johnson, 19, of Harker Heights, and Doyle were charged with Haskins’ murder. But Doyle took a deal in which he pleaded to a lesser charge of criminally negligent homicide, unlawful possession of a firearm by a felon and a cocaine charge and was sentenced to four years in prison in 2008.\nJail records revealed Doyle only served two years before he was released and he successfully completed his probation April 26, according to previous Herald reports.\nAs charges may still be pending, prosecutors have been tight-lipped about the case.\n“Because this is a pending case, we can’t comment on that,” said Paul McWilliams, Bell County’s first assistant district attorney, in April.\nDoyle is housed in the Bell County Jail, where he awaits trial on more than $1.2 million in bonds."}