{"uri": "http://www.washingtontimes.com/news/2013/may/23/dc-police-make-second-arrest-north-capitol-street-/", "title": "D.C. police make second arrest in North Capitol Street drive-by shooting", "dct": "Thu, 23 May 2013 00:00:00 GMT", "id": "053da99a778051cb75b7bf50597f3774", "content": "D.C. police arrested a second person in connection with a drive-by shooting on North Capitol Street that injured 13 people outside a Northwest apartment complex in March and said two other people face charges in the case.\nAndrew Davon Allen, 19, of Southeast was arrested Thursday on charges of assault with intent to kill and conspiracy to commit a crime of violence. The arrest was the second in the case and came as police announced that two additional suspects face the same charges. Police previously had identified only two suspects in the case, but Thursday’s announcement brought to four the total number of people facing charges.\nOne person, identified only as a “male suspect,” is in jail on unrelated charges in another area jurisdiction, police said. They identified the other person as Keith Deangelo Bobb, 21, of Northeast. Police described him as being about 5 feet, 10-inches tall, weighing about 145 pounds, and having a light to medium complexion with hair worn in long dreadlocks.\nA motive for the shooting remains unclear.\nSurveillance video captured the incident, which occurred around 2:10 a.m. March 11 outside Tyler House, a 284-unit affordable housing complex at the corner of the busy intersection of New York Avenue and North Capitol Street.\nTwo dark-color vehicles were seen driving past the complex. As the first car passed and the shots were fired, a crowd that gathered near the front entrance tried to flee inside the doorway or duck and run. Six of the 13 victims were women, and the youngest was a 17-year-old male, according to a police report.\nCraig Wilson, 19, turned himself in days after the shooting and is expected to have a preliminary hearing in the case Friday.\nCourt papers indicated he was wearing a court-ordered electronic ankle bracelet at the time of the incident and that he had circled the Northwest apartment complex that was fired upon in a car for nearly an hour beforehand.\nThe documents said the video showed “repeated muzzle flash coming from the passenger sides of both vehicles” and that shell casings from two 9 mm handguns were found in the street. Casings from two .40 caliber handguns were also found in the area, though they were recovered from the sidewalk, a possible indication that someone fired back at the cars.\nCopyright © 2017 The Washington Times, LLC. Click here for reprint permission.\nSponsored\nWe were unable to load Disqus. If you are a moderator please see our troubleshooting guide.\nRecommending means this is a discussion worth sharing. It gets shared to your followers' Disqus feeds, and gives the creator kudos!\nRead full terms and conditions\nYes, ni==66==ers are truly subhuman animals.\nWhere did they get the guns, chief? Why is that little tidbit always left out?\nWill it detract from the leftist narrative of gun show loopholes?\nDupont Circle, by using the n word in such a despicable way, makes you unhuman!! What about white folks like jeffrey Damher, Timothy McVeigh, Ted Bundy, etc. who have committed horrific crimes... they are the ones who are classified as subhuman animals!!\nSponsored\nClick to Read More\nClick to Hide"}