{"uri": "http://www.eastidahonews.com/2016/03/accidental-shooting-by-toddler-in-rigby/", "title": "UPDATE: Man accidentally shot by toddler not at fault, police confirm", "dct": "Thu, 31 Mar 2016 17:17:00 GMT", "id": "fd781f8494632b27bb87829e2ec5a4ba", "content": "UPDATE:\nRIGBY — The man who was shot in the foot Saturday after a toddler found a gun in a Rigby home says he was not at fault.\n“This wasn’t my house, this wasn’t my gun, I was helping a friend move,” Travis Sorensen, 25, said Thursday. “I have gotten so much negative feedback from this, even death threats from people.”\nRigby police spokesperson Carol Shackelford confirmed Sorensen’s version of events. She said he’s “absolutely the victim here.”\nSorensen told EastIdahoNews that another man who was helping move had placed the gun on the floor.\n“I don’t know why he did that,” Sorensen said. “Maybe he didn’t know it was real.”\nAt one point, Sorensen went into the basement to take a nap. Later he was awoken by a loud noise and pain in his foot.\nA child in the room above Sorensen fired the gun into the floor.\n“I just want people to know that I had nothing to do with this gun being placed on the floor, I knew nothing about it,” Sorensen said. “I just want it to be clear that I was the victim of circumstances, not at fault for negligence.”\nORIGINAL STORY:\nThe following is a news release from the Rigby Police Department.\nRIGBY — On March 26, Rigby Police Chief Keith Hammon was informed by the Eastern Idaho Regional Medical Center’s (EIRMC) officer on duty, of a patient that had come in with a gunshot wound.\nThe victim, Travis Sorensen, 25, of Idaho Falls, was lying on a couch in the basement of a home at 330 W. First South, when he was shot in the left foot.\nWitnesses at the home say they were in the process of helping the family move, when a bed was broken down and a gun was found between the mattresses. The gun was placed on the floor and later picked up by a 3-year-old. The toddler discharged the weapon into the floor, the bullet ricocheted off of a window sill and struck Sorensen in the left foot. Sorensen has been treated at EIRMC for his injury.\nNo charges have been filed and police consider the incident closed.\nThe Rigby Police Department remind residents to keep all guns safely secured, and locked, especially those homes with small children.\nSponsored Links\nMelania Trump's IQ Is Pretty Unnerving (Brain Smuggler)(Brain Smuggler)\nKim Stuns In Dress, Proving That Kanye Is A Lucky Man (StyleBistro)(StyleBistro)\nHow To: Fix Aging Skin [Watch] (Dermal Repair Complex Skincare Supplement)(Dermal Repair Complex Skincare Supplement)\nTrump's IQ Is Pretty Unnerving (Majorten)(Majorten)\nHow To Fix Cracked Feet (DermalMedix Skin Care)(DermalMedix Skin Care)\nThe Most Addicting Shopping Site For Women (Tophatter)(Tophatter)\nHow Car Dealers Get Rid of Unsold Inventory (Auto Deals Ace)(Auto Deals Ace)\nMy Heart is Beating Really Fast, What Does This Mean? (About.com)(About.com)"}