{"uri": "http://www.mlive.com/news/grand-rapids/index.ssf/2016/08/teens_drive-by_shooting_hit_4-.html#incart_gallery", "title": "Teens head to trial for drive-by shooting that injured 4-year-old girl", "dct": "Fri, 05 Aug 2016 10:32:01 GMT", "id": "262dd337e0167ec3e79d983d202eac27", "content": "GRAND RAPIDS, MI -- Despite claims that it was someone else who pulled the trigger, two teens accused of a shooting that injured a 4-year-old girl have been ordered to stand trial in Kent County Circuit Court.\nDereontae Foster, 17, is charged with two counts of attempted murder and felony firearm for the June 30 shooting that injured another teen as well as the young girl who was walking with her family.\nFoster and his co-defendant, Louis Curry, were in Grand Rapids District court on Thursday, Aug. 4, when a judge decided there was enough evidence to send the case to trial.\nCurry, 16, allegedly was driving the car at the time of the shootings. He is charged with two counts of attempted murder, felony firearm and accessory after the fact to a felony.\nPolice allege the suspects were behind the afternoon drive-by shooting that inadvertently injured a 4-year-old girl, Naomi Fahim, as she walked with family members along a Leonard Street NE sidewalk. She was grazed in the knee by a bullet.\nA 17-year-old riding a bike and not associated with the Fahim family, Eugene Kamarri Williams, also was shot in the arm at Leonard Street and Houseman Avenue.\nBoth Curry and Foster were arrested the evening of June 30 at a home in the 300 block of Pine Avenue NW.\nBecause of threats that have been made against witnesses in this case, Judge Jennifer Faber order the court cleared during Thursday's testimony, except for immediate family members.\nOne of those witnesses was Elijah Alridge, 16, who was arrested in connection with the shooting. He was a key witness for the prosecution and was being held on a material witness warrant until his testimony was given Thursday. He was in the car at the time of the drive-by, but isn't facing any charges.\nAlridge, wearing handcuffs while testifying, said he was in a different gang from Williams.\nHe said the two had a \"beef\" stemming from a previous fist fight.\nAlridge, who described himself as a friend of Curry, said he was aware the car the teens were driving in June 30 was stolen, but he wasn't aware there was a gun in the car.\n\"We didn't make that decision (to shoot Williams).\" Alridge said. \"It just happened. I didn't know it was going to happen.\"\nScott Pederson, a newly-appointed attorney for Foster, accused Alridge of being the shooter, saying he was the person initially identified by Williams, using a nickname \"Lile Guod.\"\n\"You are the only who had a beef with Williams...Isn't it true you shot him?\" asked Pederson, as Foster nodded in agreement behind him.\nGrand Rapids Police Detective Thomas Heikkila said he interviewed Williams at the hospital. The teen said he was shot by Curry and \"Lile Guod,\" and directed the detective to a Facebook photo. Williams later identified Foster in a photo lineup at the hospital.\nPederson, referring to notes from Foster's July 1 arraignment, said Williams pointed out Curry, but said he didn't know Foster.\n\"What happened is transference because Williams is afraid of (Alridge),\" he said, adding that Alridge's story didn't make sense. \"He is saying my client just stepped up and shot a guy. There was no plan.\"\nFoster was sitting in the back seat behind Curry, who was driving. Alridge was in the front passenger seat.\nThe teens had hung out at Knights Inn on Plainfield Avenue with others for most of June 29 and 30 before heading to the house of Curry's sister around 5:30 a.m. to sleep.\nThat group included Autumn Young, a Muskegon woman who testified to hanging out with the teens in the hours before and after the shooting. She said she heard Curry and another person talking about \"needing to get more bullets\" but didn't see a gun.\nKlear Davis, a friend of Young, said he saw a black gun in a back room of the house of Curry's sister where the teens slept the morning of June 30 after leaving the hotel.\nCurry's attorney, Freeman Haehnel, argued for the charges of aiding and abetting to be dropped, saying his client had no idea there would be a shooting.\nAssistant Prosecutor Greg Boer said Curry's driving indicated involvement because he slowed down right before the shooting, and then sped away afterward.\nIn court Thursday, Curry wiped away tears after the judge ordered the case against the defendants bound over to Circuit Court. He is being held in the Kent County Juvenile Detention facility, even though he has been charged as an adult in this case.\nHaehnel previously asked for the placement at the juvenile facility because Curry looks young.\nHe said he's concerned that it \"probably wouldn't bear well for him\" if he's sent to the jail.\nCurry's criminal record includes 2015 charges for third-degree home invasion, larceny under $200, and retaining or stealing a financial transaction device.\nJudge Faber declined to set bond for Foster, who has no juvenile record in Kent County. Foster remains in the Kent County Jail."}