{"uri": "http://www.kristv.com/story/29685031/family-of-samuel-toomey-sues-city-and-county", "title": "Family of Samuel Toomey sues City and County", "dct": "Sat, 01 Aug 2015 02:33:00 GMT", "id": "38a42fb759e0f4b12a1710f4c8fc6dd7", "content": "CORPUS CHRISTI -\nThe family of a suspected killer is suing the City and the County, claiming Samuel Toomey was assaulted by police then allowed to commit suicide at the county jail.\nThe lawsuit filed Friday also sheds new light on the shooting in the Flour Bluff trailer park, as well as Toomey's interaction with law enforcement in the hours that followed.\nIt says Toomey called police at least five times from his home in the hours leading up to the shooting, complaining about altercations with his neighbors, but officers threatened to arrest him, so when a neighbor allegedly came out with a knife hours later, Toomey decided not to call police.\nAccording to the lawsuit, \"Mr. Toomey was frustrated and did not know where to turn so he took matters into his own hands and the situation escalated. Mr. Toomey grabbed his gun and shot at the neighbor that was threatening him, hitting three innocent bystanders.\"\nToomey shot and killed three people and injured a child who survived.\nA CCPD patrol car dashcam was recording when officers arrived.\nIt captured officers piling on top of Toomey and later slamming his head against the front of a patrol car.\nBut the lawsuit claims there was more abuse.\nAccording to the filing, \"After Mr. Toomey was in the vehicle he was transported to an undisclosed location where (the officers named in the lawsuit) met up and decided to beat Mr. Toomey and cause numerous injuries to his body.\"\nWhen Toomey appeared in court the following day, his face was clearly battered and bruised.\nToomey later hanged himself at the jail, and his family believes the staff there is responsible.\nThe lawsuit reads, \"When he was processed Mr. Toomey stated that he was going to kill himself to the intake clerk. The staff at the jail was informed and aware that Mr. toomey was suicidal.\"\nBut his family claims the staff \"failed to supervise Mr. Toomey or they just didn't care if Mr. Toomey actually followed through on his threat causing Mr. Toomey to commit suicide as they idly stood by.\"\nFollowing the death, Sheriff Jim Kaelin told Kris 6 News that Toomey never made any outcry of being suicidal, and hanged himself between the required half hour checks.\nFormer CCPD officer Daniel Jimenez was allowed to resign instead of being fired for his role in the forcible arrest of Toomey.\nAnother officer, Michael Smotherman, was suspended and later returned to work, but resigned earlier this month for unspecified reasons.\nThe lawsuit doesn't specify how much money the family is seeking."}