{"uri": "http://www.kiiitv.com/story/26535326/man-accused-in-flour-bluff-triple-homicide-magistrated-in-court", "title": "Man Accused in Flour Bluff Triple Homicide Magistrated in Court", "dct": "Mon, 22 Sep 2014 00:00:00 GMT", "id": "c2a05e02e1b5d5896b2f37de553fe39c", "content": "63-year old Sammuel Everett Toomey, the man accused of going on a shooting rampage resulting in three dead and one injured child Sunday evening in Flour Bluff, was magistrated in court Monday morning.\nToomey is currently being held in the Nueces County Jail and is charged with capital murder of multiple persons.\nThe shooting took place around 7 p.m. Sunday inside the Marina Village RV park on Sailfish Court and Albacore, near Naval Air Station-Corpus Christi. Three people were shot and killed outside different homes in the RV park.\nThe three victims were identified by the Nueces County Medical Examiner Monday afternoon as 63-year old Pamela Kay Rhodes, 56-year old Ricky Ray Collier and 32-year old Laura Elaine Ogden. A 10-year old male was also shot and was taken to an area hospital. On Monday it was reported that the boy is expected to survive and has since been transferred to Driscoll Children's Hospital.\nPolice were at the scene of the shooting until about 5 a.m. Monday collecting evidence. According to investigators, Toomey not only knew his victims, but they were his intended targets.\nPolice said Toomey confessed to killing all three of his neighbors and wounding the boy. The handgun police believe was used to shoot the victims from across the street has been recovered.\nToomey is a longtime resident of the mobile home park and did own several weapons, police said, adding that the incident stemmed from an ongoing dispute between the neighbors.\n\"Based on the preliminary investigation, the victims were actually intended victims of the suspect,\" said Captain Michael Alanis of the Corpus Christi Police Department. \"All stemmed from disputes with the neighbors, ongoing for some time.\"\nAccording to RV park management, Toomey had issues with the couple living across the street from him, and with the young mother that lived next door. Management also said that he young mother had recently moved in with her two children and her fiance, and that she was loved by everyone. She leaves behind two children.\nIn court Monday, Toomey was reminded of his rights. He showed clear signs of injury, and whether the injuries were sustained before, during or after he was arrested, his attorney wants to know.\nAccording to attorney Jim Lawrence, Toomey told him that \"when police arrived, he raised his hands and followed their instructions to lay on the ground, nose to the ground, and he complied.\" Lawrence then said that \"that's when his head was subdued, his arms wrenched back and he was severely beaten.\"\nToomey then told his attorney that \"officers then picked him up and one of them slammed his forehead into the patrol car, where sustained a severe laceration that required multiple stitches.\"\nLawrence said Toomey has severe contusions on his face, two black eyes, his right ear is encrusted with blood and he has even said he cannot hear out of that ear."}