{"uri": "http://www.kctv5.com/story/30054160/kansas-city-man-22-faces-murder-charges-in-triple-slaying", "title": "Kansas City man kills 2 teens then allegedly shoots his baby for crying", "dct": "Thu, 17 Sep 2015 14:41:00 GMT", "id": "a30f9529b00e6a88a5ee061c24d22a96", "content": "KANSAS CITY, MO (KCTV) -\nA 22-year-old Kansas City man faces murder charges after two teens and a 1-year-old boy were found slain inside a south Kansas City home.\nThe man allegedly killed the baby for crying. Family and friends tell KCTV5 that the baby was the son of the suspect.\nJoseph L. Nelson faces three counts of first-degree murder, three counts of armed criminal action and one count of burglary. He is being held on a $1 million bond.\nThe victims were 17-year-old Raytown South High School senior Bianca Fletcher, her baby JoJo and her 18-year-old boyfriend Shannon Rollins Jr. JoJo celebrated his first birthday on Aug. 18.\nKCTV5's Jeanene Kiesling reported that Nelson is an ex-boyfriend of Fletcher and was the father of baby JoJo.\n\"It's sickening. I can't imagine,\" Rebecca Fletcher said about the brutal deaths of her sister and baby nephew.\nJackson County Prosecutor Jean Peters Baker refused to say whether Nelson was the baby's father. She would only say there was \"a relationship,\" but refused to elaborate.\nIt was Bianca Fletcher's 16-year-old brother, Brandon, who found the three victims dead inside a home at East 84th Street and Hillcrest Road, located just west of Interstate 435 last Tuesday night. Brandon Fletcher identified Nelson as a possible suspect that night, according to court records.\nRebecca Fletcher said Nelson was possessive toward her sister.\n\"Her and Joseph had problems together. I just figure he was jealous,\" she said.\nThere were no signs of forced entry at the Fletcher home, no shell casings found and some of the victims’ personal belongings were missing, according to court records.\nNelson walked into a police station the next afternoon following the shooting and reported two firearms, magazine and ammunition stolen from his vehicle, a 1999 Buick four-four.\nBaker said witnesses stepped forward and told police that Nelson shot Fletcher.\nOne witness said Nelson arrived at his home on 11:30 p.m. the night of shooting and saw him standing over a grill with flames coming from it. Nelson said he had robbed a nearby store and he was burning his clothes, court records state.\nThere were no armed robberies in the area that day, police said.\nNelson also told another witness that he had gone to Fletcher's home to \"chill.\" He said he had an argument with her, and she threw a diaper at him. He went on to say he shot her and said, \"I was there and saw it, so other things had to be done.\"\nAccording to court records, two other people were with Nelson inside the home at the shooting of the shooting.\nNelson allegedly claimed that one of those two people had shot Fletcher, but that person would tell police that he wasn't inside the home. That person who is identified as \"Witness #4\" said Nelson told him, \"I did something bad. I did something I don't think I can live with.\"\nWhen Witness #4 asked why he shot the other two, he allegedly replied, \"Witnesses.\" He said the baby was crying and he didn't want the neighbors to hear.\nA person identified in court documents as \"Witness #5\" admitted he was with Nelson and saw the shootings. He claimed that Nelson barged in on the teen couple.\nNelson allegedly ordered Witness #5 to help him pick up the shell casings. Witness #4 claimed that Nelson gave him a bag with 14 shell casings.\nThe murder weapon was quickly sold, according to court documents. It's unclear whether authorities have been able to track it down.\nAnother witness told police of how Nelson showered several times and washed his hands with bleach and sold the gun used in the shootings.\nAccording to court documents, Nelson said he spent the day of the slayings sleeping and only left his residence briefly that evening to pick up a relative. He denied any involvement in the murders.\nRollins' mother, Yale Washington, said her son and Nelson got in a fight about a week before the murders.\nRebecca Fletcher is trying to come to grips with what happened.\n\"Nobody hated Bianca,\" she said. \"She was loving.\"\nWashington said the outpouring of support is appreciated.\nRichard Fletcher, the father of Bianca Fletcher and grandfather of JoJo, thanked police for their quick action to bring justice to all.\n\"That’s what I can say. This is for all. Not just my family. My daughter and grandson were precious. We are hurting and angry but we are grateful justice is being sought for my daughter and grandson. Regarding Shannon, as a father, I approved of Shannon - he was a very good influence on my daughter. We will miss him. I praise God that the police acted so quickly,\" Richard Fletcher said.\nThe parents of Shannon Rollins issued the following statement Thursday morning after Nelson was charged:\n“Shannon was our heart. Our child was a wonderful young man, full of life. He loved everyone. He tried help those he could. Each of us needs to teach our kids how to solve problems without senseless violence, without resorting to a gun. Shannon was determined, he was talented – he wanted to be a dancer. The loss is unbearable for us, but we will find strength in God. And the light of the world is just a little more dim because Shannon’s light no longer burns. “\nCopyright 2015 KCTV (Meredith Corp.) All rights reserved."}