{"uri": "http://kdvr.com/2016/11/22/former-adams-county-deputy-arrested-in-connection-with-shooting-death-of-2-year-old-boy/", "title": "Former Adams County deputy arrested in connection with shooting death of 2-year-old boy", "dct": "Tue, 22 Nov 2016 13:23:00 GMT", "id": "ccf463b62257a782082147645e0a2053", "content": "FAIRPLAY, Colo. -- A former Adams County deputy has been arrested in connection with the shooting death of a 2-year-old boy in Park County.\nJason Belmont, 45, is now in custody in Chaffee County. He is being held for investigation of child abuse, child abuse causing death knowingly or recklessly and negligence.\nThe boy's mother, Stephanie Wray, was taken into custody by the Jefferson County Sheriff's Department. She is being held for investigation of child abuse/child abuse resulting in death and is due in court Nov. 25.\nThe little boy, identified as John Paul Gaudreau III, was shot some time before 9:15 p.m. on Nov. 13, according to the arrest affidavit. He was known as \"Chunk,\" according to his obituary.\nWhen deputies arrived at the home, the boy's body was in a bathtub in the master bathroom, the affidavit states. A pump-action shotgun was found lying partially on the rim of the tub.\nA deputy who talked to Wray quoted her as saying \"It happened in the bathroom. The shotgun was on a shelf and another child was climbing on the shelf and the shotgun fell and went off.\"\nAccording to the affidavit, there were several young children in the home at the time.\nWhen deputies interviewed the surviving children, they all said they did not see the boy get shot and did not know how he was shot.\nThe children told a victims advocate that Wray was sleeping or falling asleep when the gun went off.\nThe deputy who interviewed Wray after the shooting said she kept \"dozing off\" and fell asleep.\nRead the full affidavit here.\nThe affidavit states that Belmont and Wray knowingly stored a loaded shotgun in a \"child's play area\" in the home.\nInvestigators stated that they found several other guns in the home, including a .38 pistol with a live round in the chamber and a loaded magazine in a nightstand in the master bedroom. Investigators stated that it was \"easily in the reach of all the children in the residence.\"\n\"It also appears all of the other children living in the this home were subjected to conditions threatening their life and health,\" the affidavit states.\nAn investigator who searched the home the next day said \"Upon entry I was immediately overpowered by a strong odor of what I believed to be feces and urine... The walls in the hallway where the laundry machines are located had numerous brown and dark brown smears and stains on them.\" Some of the stains were blood, presumptive testing showed.\nThe investigator said the area where the child was shot had \"so much dirty clothing, trash and other household items lying on the floor\" that it was hard to walk through.\nThe funeral for the little boy is Wednesday in Wheat Ridge.\nAccording to the obituary, \"Chunk\" is survived by his father and mother and seven siblings.\n\"Chunk was a very bright light with a contagious smile. He will always continue to live in our hearts,\" the obituary states."}