{"uri": "http://fox59.com/2016/02/22/six-year-old-accidentally-shoots-kills-father-in-bartholomew-county/", "title": "6-year-old boy accidentally shoots, kills father in Bartholomew County", "dct": "Mon, 22 Feb 2016 23:22:00 GMT", "id": "7950f63f3c72ff0165a6766dddaab93c", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nBARTHOLOMEW COUNTY, Ind. (February 22, 2016) – A 6-year-old in Bartholomew County accidentally shot and killed his father.\nThe Bartholomew County Sheriff’s Office received a report of a person shot around 9:15 p.m. Sunday in the 200 block of Clinton Street in Hartsville.\nOn arrival, deputies found James Lonaker, 62, with a gunshot wound to his upper body.\nLonaker was flown by helicopter to Methodist Hospital, but he died en route.\nInvestigators believe Lonaker’s 6-year-old son accidentally shot his father when he picked up an unsecured .38 caliber revolver and fired a shot.\n\"You hate to hear about like that. It's a sad story,\" explains Kurtus Konrady, a neighbor.\nLonaker’s wife and one-year old infant child were also in the house, but they were not injured. Neighbors tell us Lonaker was in the process of fixing up the home for his family.\n\"Just didn't think that would happen. I just saw them outside playing the other day,\" explains Robyn Hyatt, a neighbor.\nSheriff Matt Myers calls the shooting a tragic accident.\n“This is a tragedy that is told and retold all across the country and a tragedy that is easily avoided. I urge every responsible gun owner and parent to take this tragedy to heart,” said Sheriff Matt Myers. “Many firearms accidents in the home can be prevented simply by making sure that firearms are kept unloaded and safely stored, with ammunition secured in a separate location. Please keep your guns in a secure location out of reach of children.\"\nLonaker's family members say he was a generous and caring man that will be missed.\nInvestigators don't expect any charges to be filed in this case. Free gun locks are available at the front desk of the Bartholomew County Sheriff's Office."}