{"uri": "http://www.wthr.com/article/impd-on-the-scene-of-a-fatal-shooting-on-citys-nw-side", "title": "UPDATE: Neighbors concerned after shooting at northwest side apartment complex", "dct": "Sat, 17 Sep 2016 05:22:00 GMT", "id": "0c1e2ec9046746feab1bbc140243c868", "content": "INDIANAPOLIS (WTHR) - IMPD investigators are working a double homicide at an apartment complex on the city's northwest side. Two other people were shot and wounded.\n\"I just heard gunshots like firecrackers and a lot of them,\" said a resident of the complex who did not want to be identified.\nThe sirens and flashing lights soon followed and when she looked out her apartment window? \"I's just crazy. He was just laying out there. You would never think it would happen in your backyard.\"\nThe mother of three, who didn't want to be identified, lives at the Viewpointe apartments on the city's northwest side where police would find two people apparently shot to death and another with a gunshot wound to the hand.\nThey would also be directed to a fourth victim, who collapsed outside this nearby gas station.\n\"So in a period of 18 minutes, we had two dispatches on runs that ended up with four people shot, two of whom are deceased, two of whom have non-life-threatening wounds.\" explained IMPD Deputy Chief Valerie Cunningham.\nMaking things challenging for police? The heavy downpour, which made it hard to preserve evidence and the lack of witnesses other than the two surviving victims.\n\"It is kind of scary,\" said Emanuel Robinson, a father of six who says there are a lot of kids in the complex.\n\"It's people's attitudes and anger out here, they need to find another way to get round it,\" he explains.\nIt's not just what happened but what's been happening across the city that has people worried. With these two deaths Indianapolis has now reached 109 homicides for the year.\nEverybody's trying to come up with solutions. It help but people still have their ways and attitudes. I just don't know how to solve any of it. You try to move into a nice neighborhood for a good community and good schooling and it's just like it's everywhere,\" said the unidentified mother.\n_______________\nPolice were called to the Viewpointe on Westlane Apartments, 2000 block of W. 76th St., about 12:45 a.m. Saturday. Officers discovered one shooting victim dead inside an apartment building. A second deceased victim was found lying in the parking lot adjacent to the building. A third gunshot victim was found inside an apartment with a non-life-threatening gunshot wound.\nA fourth shooting victim was found at the Shell gas station, 7200 Michigan Rd. Police believe the victim was also shot at the Viewpointe Apts., and managed to get to the gas station where they collapsed in the lot. The victim had suffered a gunshot wound to the shoulder, according to a police investigator."}