{"uri": "http://www.mlive.com/news/saginaw/index.ssf/2016/07/scene_of_buena_vista_suspiciou.html", "title": "Suspicious death of 17-year-old in Buena Vista declared a homicide", "dct": "Wed, 27 Jul 2016 12:31:00 GMT", "id": "7fb2d2ba785684a3ab32a0357f07733f", "content": "BUENA VISTA TOWNSHIP, MI -- A 17-year-old male died late Tuesday, July 26, after suffering at least one gunshot wound, police say.\nThe neighborhood where the shooting occurred, on South 23rd at the border of Buena Vista and the city of Saginaw, was mostly clear of police after 9 a.m. Wednesday.\nThat was two hours after the scene, between Burt and Cherry, was described by one officer as \"very active\" and included Buena Vista police, Bridgeport Township police, Michigan State Police troopers, and Saginaw County sheriff's deputies surrounding the area.\nPolice in Buena Vista Township continued to investigate a suspicious death near the border of the city of Saginaw Wednesday morning, July 27.\nShortly after the scene was cleared, Buena Vista Police Chief Robert Schulz issued a press release stating police were investigating a homicide of a 17-year-old male.\nSchulz stated that Buena Vista police were dispatched to South 23rd about 10:35 p.m. for a report of a male down in the roadway. When officers arrived, they found the body of the teen shooting victim, Schulz stated.\nPolice are withholding the name of the victim pending notification of his family, Schulz said.\nBuena Vista police \"are actively investigating the incident,\" Schulz stated. State police investigators, including the Crime Lab, are assisting, the chief said.\nAbout two dozen people were seen standing in the area while police conducted an investigation late Tuesday night and very early Wednesday morning. Police were also observed searching the area with a K-9.\nAs of about 7 a.m. Wednesday, the police tape surrounding the area was gone, but several police vehicles remained in the area of 24th and Burt. An officer at the scene at that time described the scene as \"very active.\"\nSaginaw County Central Dispatch just before midnight Tuesday, July 26, reported that Buena Vista police were investigating a suspicious death on South 23rd between Cherry and Burt.\nPolice shortly after 8 a.m. conducted a traffic stop on a red Chevrolet SUV that left a home in the area that police were observing. Police detained two of the vehicle's male passengers but did not detain the female driver after speaking with her. It was unclear whether the traffic stop was related to the shooting investigation.\nSoon after, a sheriff's medic Jeep arrived at the scene. Multiple officers and at least one medic wearing body armor also were observed at the scene. Other officers wearing tactical gear approached the back of 440 S. 23rd. Shortly after, police cleared the scene.\nOne neighborhood resident told The Saginaw News he may have heard gunshots Tuesday night.\nLifelong Buena Vista resident Roger Johnson, 55, said he's lived in the neighborhood for 40 years. He was surprised to hear police were investigating a suspicious death near his home.\n\"This is a total shock to me, because it's always quiet,\" he said.\nMLive multimedia specialist Jeff Schrier contributed to this report."}