{"uri": "https://riverheadnewsreview.timesreview.com/2016/11/77506/riverhead-blotter-man-was-accidentally-shot-in-right-leg/", "title": "Riverhead Blotter: Man was accidentally shot in right leg", "dct": "Sat, 12 Nov 2016 09:00:00 GMT", "id": "2d1899302f6965b01d1aafd16fdab303", "content": "A man received an accidental gunshot wound to his right leg last Wednesday afternoon on West Main Street in Riverhead, according to police.\nThe victim was taken to the emergency room at Peconic Bay Medical Center, where the bullet was removed by trauma staff.\nTown detectives had been investigating the case but later turned it over to Suffolk County Sheriff’s Office pistol licensing investigators, according to police.\n• A Riverhead man was arrested Monday on a bench warrant issued by town Justice Court, according to police.\nAngel Cortez-Nicolas, 20, was arrested at police headquarters, processed and turned over to the Suffolk County Correctional Facility.\nHe was facing charges including aggravated driving while intoxicated, moving from a lane unsafely, failure to keep right and a host of other vehicle and traffic law violations stemming from an Oct. 15 arrest.\n• Daniel Bills, age and address unavailable, was charged with seventh-degree criminal possession of a controlled substance and unlawful possession of a hypodermic instrument last Tuesday night at the Riverhead train station.\n• Diego Alvarado-Pinola, age and address unavailable, was charged with aggravated driving while intoxicated following his arrest Monday morning on County Road 105 in Riverhead.\n• A woman told police Sunday that an unknown person had used her credit card to make more than $1,200 worth of unauthorized purchases at Tanger Outlets Oct. 22, according to police.\n• A leaf blower valued at $600 was reported stolen from PSEG on Doctors Path Saturday afternoon, according to police.\n• Riverhead Toyota called police Monday morning to report that 20 New York State inspection stickers had been removed from cars there during the period of Oct. 24 to Nov. 7, according to police.\n• An unknown person broke the glass on an east side kitchen door at a home on Northside Road in Wading River Friday afternoon and unlocked the door, according to police. The occupant of the home told police that nothing appears to be missing.\n• Someone broke two windows on a car parked on Marcy Avenue in Riverhead Saturday morning, according to police.\nThose who are named in police reports have not been convicted of any crime or violation. The charges against them may later be reduced or withdrawn, or they may be found innocent."}