{"uri": "http://news.asiantown.net/r/28306/no-death-penalty-for-kong-meng-vue-in-drive-by-shooting-case", "title": "No death penalty for Kong Meng Vue in drive-by shooting case", "dct": "Sun, 10 Feb 2013 05:21:00 GMT", "id": "c6a488cd9d58659e46406a6f7759f773", "content": "Linda man charged with killing one person and injuring three in a drive-by gang shooting faces life in prison without parole if convicted, prosecutors said.\nYuba County prosecutors said they would not seek the death penalty against Kong Meng Vue.\nVue, 25, is the suspected triggerman in the death of Teng Yang on Sunday, however authorities are still searching for others involved in the Linda shooting.\n\"There are other suspects still at large,\" said Mike Byrne, deputy Yuba County district attorney.\nKong Vue, 25\nProsecutors charged Vue with one count of first-degree murder, three counts of attempted first-degree murder, shooting at an inhabited dwelling and criminal street gang participation, along with numerous special allegations and circumstances.\nVue made his first appearance on Friday in Yuba County Superior Court, but did not enter a plea. Instead, he asked Judge Julia L. Scrogin for time to hire a private attorney.\n\"I\"m trying to do that now, but I\"m not sure, yet,\" Vue told the judge.\nScrogin agreed to continue Vue\"s arraignment until Monday.\n\"If you don\"t have an attorney by then, I\"ll appoint the public defender,\" Scrogin said.\nProsecutors asked for time to redact witness names from court documents and reports from the Yuba County Sheriff\"s Department.\n\"We have some witness issues and safety concerns,\" Byrne said.\nYia Yang, the victim\"s brother, was disappointed to hear prosecutors would not seek the death penalty.\n\"A life sentence without parole for shooting four people and one death, it\"s not enough, it\"s just not enough,\" Yia Yang said.\nTeng Yang, 20, was shot dead in the driveway of his home in the 5800 block of Poplar Avenue during a family Super Bowl party. Yang\"s brother, Tou Yang, and his sister, Xong Yang, were also shot, along with family friend Yang Vue.\nTou Yang remains hospitalized, but is in good condition, family members said Friday. Xong Yang and Yang Vue have been treated and released from area hospitals.\nAuthorities said Yang Vue and the suspected gunman are not related.\nKong Meng Vue used a .9mm semi-automatic handgun, killing Teng Yang, according to a probable cause statement. He was arrested Wednesday as he was leaving his brother\"s home in Linda.\nSheriff\"s deputies obtained a search warrant for the home of Kong Meng Vue\"s brother, Tong Vue, and seized numerous firearms, which Tong Vue, an ex-felon, was not allowed to have, Undersheriff Jerry Read said.\n\"Right now, there\"s no tie between (Tong Vue) and the homicide,\" Read said.\nTong Vue posted a $50,000 bail bond and was released.\nYia Yang puts his hands together at a shrine set up in honor of his brother Teng Yang at the family\"s home in Linda"}