{"uri": "http://www.iberianet.com/news/man-shot-in-the-leg-by-two-assailants/article_ca8835a0-a567-11e6-82c3-47d31c580812.html", "title": "Man shot in the leg by two assailants", "dct": "Tue, 08 Nov 2016 00:00:00 GMT", "id": "8220d34e72798faebefafec3d34527be", "content": "Two men wearing black hoodies approached a group of men staying out of Monday’s drizzling rain under the awning at the old Genesis building at the corner of Lombard and Hopkins streets.\nMoments later, according to Iberia Parish Sheriff’s Office Public Information Officer Capt. Wendell Raborn, the two men began shooting, wounding an 18-year-old man who was shot in the leg.\n“We received an anonymous call at 11:25 a.m. saying there had been shots fired,” Raborn said. “A second anonymous caller said someone had been hit.”\nRaborn said Acadian Ambulance took the shooting victim to a local hospital, where he was treated for non-life threatening injuries.\nThe IPSO spokesperson declined to release the victim’s name because of the ongoing investigation into the shooting.\n“After the shooting, the two men in hoodies ran away from the scene on foot,” Raborn said.\nWhen asked about the close approach and relatively light injuries, Raborn said that, rather than having bad aim, some shooters purposely aim for the legs.\n“You can’t be charged with attempted murder if you hit them in the leg,” Raborn said. “When they are intent on staying out of jail, they will aim lower so if it goes to a district attorney, they can try to plea bargain down.”\nThe shooting is the latest of several in the West End neighborhood. Aaron Francisco, 24, was killed on Oct. 27 on Field Street, within sight of Monday’s shooting.\nRaborn said there was no known motive for Monday’s shooting at this time. He also said the intersection of Hopkins and Lombard is a central location for known gangs in the area.\n“You have the Hill Gang, the guys on Anderson Street, the one over on Mississippi Street, then Ann Street,” Raborn said, pointing in various directions as he rattled off the names. “This is a common area, along the border of their territories.”\nInvestigators were questioning someone in the shooting, Raborn said, but they have no suspects at this time.\n“There was a lot of confusion, with some witnesses said the two men approached this way, and others saying they came that way,” Raborn said."}