{"uri": "http://www.newson6.com/story/32830242/tulsa-police-arrest-two-in-citys-latest-shooting-death", "title": "Tulsa Police Arrest Two In Shooting Death Of 17-Year-Old", "dct": "Wed, 24 Aug 2016 13:32:00 GMT", "id": "71293ee8a3370bc80e6c80c4fec88639", "content": "TULSA, Oklahoma -\nZaire Ross and Chrishun Smith were arrested after bringing a 17-year-old shooting victim to a Tulsa hospital where he died.\nHomicide Sergeant Dave Walker said police were called to the 1600 block of 125th East Avenue around 8:15 p.m. on a call of shots fired. Two people at that address told police people in a silver SUV opened fire on them then took off.\nShortly after that, police learned three men in a silver Equinox brought a wounded teenager to St. Francis hospital where he was pronounced dead. Police took the men in for questioning and eventually arrested two of them for murder.\n\"Throughout the night we were able to piece together what occurred,\" Walker said in a news release.\nRoss told police one of the people on 125th East Avenue had attacked him in the recent past, the release states. Ross and Smith, the 17-year-old murder victim and his brother went looking for the other people Tuesday night, according to police.\n8/23/2016 Related Story: Tulsa Police Investigating Sixth Homicide In Two Days\n\"Ross and Smith each were armed with different caliber weapons and from the Equinox took shots at the two who were walking in the neighborhood,\" Walker said. \"All shots missed the two people walking in the neighborhood.\"\nWalker said someone - whose identity has not yet been determined - fired two shots at the Equinox as it drove away. One went through the back of the SUV and hit the 17 year old in the back.\nPolice said the two murder suspects first went to Perry Elementary School where Ross reportedly hid their guns on school grounds then went to St. Francis. The two guns have been recovered.\nAn arrest report states they were a .40 caliber handgun and .22 caliber rifle.\n\"Ross and Smith were arrested for felony murder claiming their actions by shooting at the two walking in the neighborhood caused someone to shoot at the Equinox,\" Walker said. \"The round fired by an unknown person hit the Equinox and killed the 17 year old.\"\nThe teenage murder victim has not yet been identified.\nWalker said one of the people at the shooting scene was arrested on outstanding warrants as well.\nSome of the information in this news story may have been provided by law enforcement with the request News On 6 inform the public of, and/or assist in locating a person in connection with, a police investigation. News On 6 can make no independent verification of the accuracy of the information, photographs and/or video provided to it by police or other law enforcement agencies."}