{"uri": "http://www.chieftain.com/news/crime/2896247-120/chavez-girl-gun-girlfriend", "title": "Cause found on gun owner in child shooting", "dct": "Sat, 13 Sep 2014 00:00:00 GMT", "id": "92fcafdf8c7fc0733195963173e644e5", "content": "A preliminary hearing for a man accused of leaving a gun unattended that a 5-year-old boy used to shoot a 3-year-old girl was held Friday where a trio of witnesses were interviewed and questioned about the facts in the case.\nThe majority of the hearing was spent with the prosecution and defense interviewing Detective Richard Reyes with the Pueblo Police Department. Reyes participated in the investigation.\nOn the morning of Aug. 4 a 5-year-old boy shot and wounded a 3-year-old girl in the backyard of a home on the 3200 block of Colfax Avenue using a gun Adrian Chavez, 22, allegedly left unattended in a backpack in a basement of the home while he and his girlfriend were sleeping. Chavez’s girlfriend is the mother of the infant who was shot.\nOnce Chavez and his girlfriend woke up to find the girl had been shot, Chavez initially attended to her then is accused of hiding the weapon and leaving the scene. He also allegedly hid handcuffs at a relative’s house that were used to handcuff the girl who was shot with another infant.\nChavez was charged with child abuse resulting in serious bodily injury. He also had a no-bond warrant for failure to appear. He was taken into custody the same day of the incident.\nReyes, the detective who helped investigate, detailed aspects of the case including where the children found the gun in the home, that Chavez and his girlfriend were sleeping at the time of the incident, where the gun and handcuffs were eventually found and the injuries the girl sustained. The defense noted Chavez was cooperative in helping police find the gun and handcuffs.\nThe girl is out of the hospital after about a two-week stay and suffered scarring, Reyes said in his testimony.\nA probation officer and another police officer also were interviewed.\nAt the end of the hearing, 10th Judicial District Chief Judge Deborah Eyler found that based on the testimony presented there is probable cause to believe Chavez committed the offenses.\n“Certainly there is more than sufficient evidence to lead a reasonable person to believe the defendant committed those charges,” she said.\nChavez’s attorney asked the court to consider reducing his bond but that request was denied. He’s being held at Pueblo County jail in lieu of $200,000 bail.\nAnother preliminary hearing for Chavez regarding a motion submitted recently relating to a tampering charge was scheduled for Sept. 23 at 2 p.m."}