{"uri": "http://www.krdo.com/news/3-year-old-girl-shot-in-pueblo/27299558", "title": "Police: 5-year-old accidentally shoots 3-year-old", "dct": "Tue, 05 Aug 2014 16:49:00 GMT", "id": "e59a08d710079854eaf794e24651340e", "content": "PUEBLO, Colo. - Pueblo police say a three year old girl is in critical condition after being shot by a five year old in an apparent case of kids playing with guns.\nThe incident happened in the 3200 block of Colfax Ave. just after 10 a.m. on Monday, August 4, 2014.\nPolice say that a nine year old was able to get hold of a handgun that was inside the home. They say the nine year old was in the backyard with other children and was able to manipulate the gun.\nInvestigators say a five year old then got hold of the gun, and accidentally shot the three year old.\nThe little girl was flown to Memorial Hospital in Colorado Springs where she underwent surgery. She is in critical but stable condition.\nNeighbors say today's tragedy didn't surprise them.\n\"None whatsoever,\" neighbor Michelle Hernandez said. Her husband agreed.\n\"We thought it would more likely be a kidnapped kid or a kid getting run over in the street,\" Matthew Hernandez said.\nThe Hernandez's say it was common to see the kids running around, unsupervised for hours. The couple was so concerned about them that last week they say they contacted the Department of Social Services.\n\"I don't know if it was naïve to think that OK, I called the Department of Social Services, I emailed a director, surely something will happen…they'll step in the house, they'll intervene,\" Matthew said.\nBut they say they never saw a caseworker pull up to the home. So when they saw police today, there were regrets.\n\"I think we should have called the police. I regret not doing that first to have them do a welfare check,\" Michelle said.\nPolice say the girl's mother and her boyfriend, Adrian Chavez, 22, were at home when the shooting happened. Chavez ran from the house. Police say he had a warrant for failure to appear. He was arrested at around 3:15 p.m.\nPueblo Police say the five year old will not be charged in this case, but that Chavez will be charged with child abuse resulting in serious bodily injury because of the gun that was left unattended.\nPolice say the nine year old told investigators that he learned how to manipulate the handgun by playing video games."}