{"uri": "http://wpde.com/news/local/bennettsville-teen-shot-and-killed", "title": "Mother of victim speaks out after teenage son shot and killed in Bennettsville", "dct": "Thu, 17 Mar 2016 00:00:00 GMT", "id": "fa4a62ad3770275859f4891282fab7fc", "content": "Kenshia Rhaiema Spears, who has been charged with murder in the shooting death of Alexander Malachi on March 17. (Marlboro County Detention Center / WPDE background)\nA 16-year-old Bennettsville boy died from a gunshot wound to the lower chest area early Thursday morning following an incident in a car outside a home on Spencer Street in Bennettsville, according to Lt. John B. Hepburn with Bennettsville police.\nHepburn said they got a call from Cheraw police saying a teen had been brought to the hospital there where he died from gunshot wounds at around 12:30 a.m.\nMarlboro County Coroner Tim Brown identified the victim in deadly shooting as 16-year-old Alexander Malachi.\nKenshia Rhaiema Spears, 22, is charged with murder in Malachi's death, according to Hepburn.\nHepburn said Spears said he was handling a gun and accidentally shot Malachi one time.\nMalachi's mother said she doesn't believe it was an accident.\n\"Obviously, the police didn't believe that he had been telling the truth because he's been charged with murder. So, I feel like, so far, justice is being played out,\" said Patricia Malachi.\nMalachi said she still longs to hear her son's voice. She said he had a bright future ahead of him and didn't deserve to die in the way that he did.\n\"He basically just started living in a sense, you know. He hadn't even started living, really. He'll never go to college. He'll never work. He'll never do none of this stuff,\" said Malachi.\nShe added she's left with only memories of her son. Malachi said it was hard telling her younger children that their beloved brother is dead.\n\"I got to go in his room, and I got to put his stuff away. And then my baby ask me when was he coming back. And I had to tell her he's not coming back. So, it's just not easy,\" said Malachi.\nSpears is being held in the Marlboro County Detention Center.\nAn autopsy is being performed to determine Malachi's exact cause of death.\nWe will bring you more information on this as it becomes available."}