{"uri": "https://usgunviolence.wordpress.com/2013/04/06/mass-shooting-killed-male-teen-malik-padgett-greenwood-sc/", "title": "Mass Shooting – Killed – Male Teen – Malik Padgett (Greenwood, SC)", "dct": "Sat, 06 Apr 2013 00:00:00 GMT", "id": "24a920a1ea814eb01951b95c084361e0", "content": "GREENWOOD, SC (FOX Carolina) –\nGreenwood police said they arrested a suspect in the fatal shooting of a 15-year-old at a birthday party Saturday night.\nDayterrius White, 17, was charged with murder in the death of Malik Birshon Padgett, of Columbia.\nGreenwood police were investigating the fatal shooting after Malik died and four others were injured during the shooting along Tabor Street.\nOn April 6th, police responded to a shooting at a block party in the 600 block of Tabor Street.\nOfficers say they found four people wounded and 15 year old Malik Padgett was killed.\nPolice arrested 17 year old Dayterrius White and charged him with murder. They believe White did not act alone.\nAccording to a release from the police department, officers were at the Greenwood Detention Center when they heard gun shots in the area.\nJust before 10pm, officials say they were approached by someone who was shot in the arm. Police then headed to Tabor Street where they found a large crowd gathered for a birthday party.\nAccording to the release, during the party several shots were fired from an unknown number of people. Five people were shot, including a 15-year-old boy.\nHe was taken to Self Regional Healthcare where he later died from a gunshot wound to the chest.\nThe Greenwood County Coroner says Malik Rashap Padgett from Columbia died from a gunshot wound to the chest. Padgett’s autopsy is scheduled for Monday.\nThe other gunshot victims did not have life threatening injuries.\nhttp://www.foxcarolina.com/story/21900867/police-one-arrested-for-teens-murder-in-greenwood\nhttp://www.wspa.com/story/21900526/teen-killed-others-injured-at-birthday-party-shootout\nhttp://www.gwdtoday.com/main.asp?SectionID=2&SubSectionID=27&ArticleID=24854\nhttp://indexjournal55.1upprelaunch.com/main.asp?SectionID=4&SubSectionID=40&ArticleID=17961\nhttp://www.blythfuneralhome.com/obituary/Malik-Virshon-Padgett/Columbia-SC/1196180"}