{"uri": "http://magicvalley.com/news/local/crime-and-courts/man-sentenced-to-at-least-years-in-prison-for-killing/article_563fc553-cac0-572a-a9bb-841f6a7c1b83.html?oCampaign=email", "title": "UPDATE: Man Sentenced to at Least 7 Years in Prison for Killing Girlfriend", "dct": "Tue, 09 Jun 2015 00:00:00 GMT", "id": "1d413542fda96db28c5c3d6c365725bb", "content": "IDAHO FALLS (AP) | A Pocatello man who accidentally shot and killed his girlfriend has been sentenced to 20 years in prison.\nThe Post Register reports that 25-year-old Kevin McQuilliams received the sentence Monday in 7th District Court and must serve seven years before becoming eligible for parole.\nMcQuilliams pleaded guilty in April to involuntary manslaughter, unlawful use of a weapon by a convicted felon and aggravated assault with a deadly weapon in the Jan. 1 shooting death of 34-year-old Annarae Ponce.\nDistrict Judge Joel Tingey said he believed McQuilliams had true remorse for causing the death of his girlfriend.\n\"There are no winners here,\" Tingey said. \"You lose a young mom who will never have a chance to raise a son.\"\nIn exchange for the guilty plea by McQuilliams, prosecutors dismissed enhancement charges of use of a deadly weapon in commission of a felony, and commission of a felony with intent to promote gang activity.\nWho are you to judge? You don't know him or what he has been through and can't relate so why leave a dumb comment?! And his son will know him because he sees him and will continue to til he gets out. And he will remember his mom because his family will make sure he doesn't forget her. .....Can't you read? He ran because he was shocked and scared and all he could think was to get his son safe. His dad and grandparents are in Cali. So that is where he headed. And the only ones who know if he was a good boyfriend or not is him & Ana. Obviously he was trying and obviously she loved and stayed with him so he couldn't have been terrible. Maybe not the best, but nobody is perfect and he obviously had tried to man up for his family! And he made some bad choices and has to live the rest of his life with what the outcome was. Plus he's doin prison time! So maybe you should read more carefully instead of being so negative and bitter. Who are you to speak on this anyways?! There are enough haters in the world - we don't need another one and to leave awful comments about people who aren't even around to defend themselves and have just been through a major tragedy."}