{"uri": "http://www.myrecordjournal.com/news/wallingford/wallingfordnews/9795589-154/police-responding-to-shooting-at-oakdale-theatre-in-wallingford.html", "title": "Wallingford Police identify two New Haven men killed during shooting after Oakdale Theatre rap concert", "dct": "Sat, 31 Dec 2016 21:30:00 GMT", "id": "9618ff94cb76b963f40ee94b1676489d", "content": "By Mike Savino, Bryan Lipiner, and Lauren Sievert Record-Journal staff\nWALLINGFORD — Police identified two New Haven men fatally shot after attending a rap concert at the Oakdale Theatre on Friday night.\nPolice also said two unidentified men suffered non-life threatening injuries in the shooting, which occurred after a performance by the rapper Meek Mill, and were released from the hospital Saturday. No arrests have been made.\nPolice Lt. Cheryl Bradley identified the two deceased victims as Travis Ward, 31, and Jacquan Graves, 20, and said local police continue to investigate with the assistance of the State Police Major Crime Unit. She asked anyone with information to contact Wallingford police at 203-294-2800.\nPolice were called to the Oakdale Theatre, 95 S. Turnpike Road, around 11:12 p.m. Friday for a report of gunshots in the parking lot as spectators were reportedly outside waiting for Meek Mill to leave the venue.\nA spokesman for Meek Mill couldn’t be reached for comment on Saturday.\nMeek Mill posted a short video on Instagram early Saturday morning calling reports that two people died in the shooting “a lie.” The video was later removed.\nJames Bozzi, head of marketing in Connecticut for Live Nation, which owns the Oakdale, said the venue has no plans to postpone or cancel its next show, scheduled for Jan. 18, but otherwise deferred comment to police.\nPolice locked down the Oakdale and nearby roads as part of their initial response, and also closed a nearby entrance to Route 15. Cheshire, Meriden, North Haven and state police departments sent officers to help with the investigation.\nNeighbors of the Oakdale interviewed Saturday, though, said they were largely unaware of the panic occurring outside the venue late Friday night. Janice Pascarelli said she was sleeping and never heard any of the noise. Her husband heard noise, but told her it sounded like the situation was quickly under control.\nDavid Phipps, meanwhile, was unaware of the shooting altogether until approached by a reporter Saturday morning. He said heard sirens but assumed the emergency vehicles were responding to either Skyview Center, a nearby nursing home, or an accident involving people leaving the venue.\nAnother couple, who declined to identify themselves, said they initially thought the gunshots were fireworks, but then heard sirens shortly after. They also said it appeared by the noise that the scene was under control quickly.\nNeighbors also said they were surprised by the shooting.\n“To me, I’d have to consider it a one-time incident,” Phipps said. “We’ve had absolutely no problems up here” related to concerts at the Oakdale.\nPascarelli said she’s been in her home for 20 years and can’t recall any shootings or other notable incidents of violence after shows at the venue. She said neighbors’ biggest complaints with the Oakdale Theater are the noise from the concerts and the relationship between the property owners and the town.\n“The public safety is not an issue to me right now, and it just seems like a one-time” incident, Pascarelli said.\nBradley described the scene late Friday night upon police arrival as “chaotic, as you can imagine.” Police also responded to at least one hit-and-run crash following the shooting in which a vehicle fled after striking another vehicle outside the venue.\nVideo taken outside the concert venue captures at least one shot being fired. A voice can be heard saying “look there’s Meek” as the camera points toward the front of the venue when a shot can be heard. A gasp erupts from the crowd and people begin running. A security guard approaches the person capturing the video and advises the individual to stay down before they flee the area."}