{"uri": "http://www.nydailynews.com/news/national/king-black-teen-james-means-killed-remorseless-white-man-article-1.2884929", "title": "KING: Black teen James Means shot and killed by white man who called him ‘another piece of trash’", "dct": "Wed, 23 Nov 2016 12:05:05 GMT", "id": "48e3636f1dfd2cb4594230408d4adc80", "content": "James Means.\nYou will know this name. Tragically, it now belongs in the ever-increasing roll call of unarmed black victims of racial violence.\nOn this past Monday evening, outside of a Dollar General Store in Charleston, West Virginia, 15-year-old James Means, was shot and killed by William Ronald Pulliam, 62, police said.\nMeans, like Emmett Till and Jordan Davis and Trayvon Martin before him, did nothing to ever even warrant a confrontation from Pulliam. Witnesses claim that what set Pulliam off was that Means accidentally bumped into him while entering the store.\nAfter Pulliam left the store, the two exchanged words a second time, and Pulliam shot the teen twice in the abdomen, leaving him to die, then proceeded to go home, eat dinner, then go hang out at a friend's house, according to a criminal complaint.\nIn 2012, when Michael Dunn shot and killed teenager Jordan Davis because the music in his friend's car was too loud, he did virtually the same thing. Dunn, a 47-year-old white man, after firing 10 rounds into the car full of teenagers, went back to his hotel room, watched television, ordered pizza, and poured himself some drinks.\nAfter Pulliam's arrest on Tuesday morning, police said that he expressed no remorse whatsoever for killing the teen, but simply said, \"The way I look at it, that's another piece of trash off the street.\"\nPulliam had a previous run-in with a Hispanic teen, according to local reports, and when the boy called the police on Pulliam, they were simply told they needed to stay away from him.\nBut here we are.\nA young boy, described by family as being able to \"light up a room, even on the darkest of days\" is dead.\nWhile I commend local law enforcement for this speedy arrest, you must forgive my skepticism. I have seen far too many young black boys die like this, only to have their families be denied any semblance of justice.\nNow, instead of preparing for a Thanksgiving together, the family and friends of James Means find themselves struggling to make sense of how truly ugly our country can be."}