{"uri": "http://www.tristateupdate.com/story/33766575/one-person-injured-following-shooting-in-charleston", "title": "Man facing murder charges in shooting death of teen", "dct": "Tue, 22 Nov 2016 03:11:00 GMT", "id": "53ee8f245bfbcbff7cd3e2c026ac2132", "content": "8:45 a.m. Tuesday, November 22nd, 2016: An arrest has been made after a teenager was shot and killed on Charleston's East End.\nAccording to Lt. Steve Cooper with the Charleston Police Department, 62-year-old William Ronald Pulliam, is being charged with 1st degree murder in connection to Monday night's shooting on Washington Street East.\nThe 15-year-old was shot in the abdomen and later died at the hospital.\nPulliam is being held in the South Central Regional Jail without bond.\nStay with 13 News on air and online at tristateupdate.com for the latest developments in the case.\n11:58 p.m. Monday, November 21st, 2016\nOfficers have confirmed that the victim succumbed to their injuries earlier this evening.\nThe victim was a juvenile and underwent surgery following a shooting that occurred near Nancy Street and Washington Street East in Charleston, WV.\nPolice are still looking for the suspect in the attached photo and are asking for your help in identifying them.\nWe will continue to update you as more information becomes available.\n10:55 p.m. Monday, November 21st, 2016\nDetective Cooper of the Charleston Police Department confirmed that the victim was shot in the abdomen.\nThey are currently undergoing surgery.\nThis is following a shooting that occurred around 8:45 p.m. between Nancy Street and Washington Street East in Charleston, WV.\nIf you recognize the suspect in the photo, please contact police immediately.\nStay with 13 News for the latest information.\nORIGINAL:\nThe Charleston Police Department is investigating a shooting with injuries that occurred in Charleston at 8:45 p.m. on Monday, November 21st, 2016.\nMetro 911 received information that one person had been shot on Charleston's East End, between Nancy Street and Washington Street East.\nDispatch had no information regarding the extent of injuries sustained or the status of the victim.\nNo arrests have been made at this time.\nStay with 13 News as we continue to update this ongoing investigation."}