{"uri": "http://www.wvgazettemail.com/article/20161122/GZ0118/161129859", "title": "Teen shot on Charleston’s East End dreamed of running own business", "dct": "Tue, 22 Nov 2016 00:00:00 GMT", "id": "d907c19e8341190cdcdcc508030915be", "content": "James Means dreamed of someday running his own business and getting married.\nA freshman at Capital High School, the 15-year-old was particularly interested in cars and mechanics.\nMeans’ life was cut short Monday night after 62-year-old William Pulliam allegedly shot him twice in the abdomen on the sidewalk in the 1500 block of Washington Street East on Charleston’s East End.\nThe boy’s mother, Nafia Adkins, and aunt, Teresa Means, gave statements to reporters on Tuesday evening at Grace Bible Church, describing Means’ vibrant personality while trying to hold back tears.\n“James could put a smile on anybody’s face, no matter the situation,” Teresa Means said. “Whether he was mad [or] you were mad, he could make you smile. He was funny, he was smart, and he was loved.”\nAdkins asked that community members not hold grudges and leave the investigation to law enforcement.\n“We know that justice is going to succeed in this matter. We’re just not going to put it in our hands, we’re going to let the law put it in their hands,” she said. “We all have to forgive and let everything take its place.”\nThe family also asked people to refrain from posting negative comments about the suspect or incident on social media.\n“We don’t want anyone posting any type of hatred or revengeful words on Facebook, because James wouldn’t want it. And we don’t want it,” the teen’s aunt said.\nMeans recently had started attending weekly meetings held by the local nonprofit Dreams Community Development Corporation at the West Virginia State Economic Development Center.\nIt was at those meetings, known as Sunday Sit-Down, where director Obi Henderson first got to know Means.\n“It was only his second time coming to Sunday Sit-Down,” Henderson said. The meetings teach local youths, dubbed “Dream Chasers,” about developing their communication skills and “soft skills,” and other career development tools.\n“He wanted to create an auto-mechanic shop,” Henderson said.\nHe recalled a recent event where Means got to experience an electric car for the first time, then excitedly told his friends how the car worked.\nHis life’s goals were “very attainable,” he added.\n“James was a nice, respectable, fun-loving guy,” Henderson said. “The type of kid that didn’t start any trouble, he just wanted to go with the flow of what’s going on.”\nAccording to the criminal complaint released by the Charleston Police Department on Tuesday, Means and Pulliam exchanged words after bumping into each other in front of the Dollar General at 1555 Washington Street East on Monday night.\nAfter the argument, Pulliam went into the store while Means joined friends on the porch at the home of one of their grandmothers. When Pulliam left the store, the complaint says he walked past the house where the youths were sitting.\nAs another verbal dispute ensued, Means crossed the street to approach Pulliam, who then allegedly shot Means twice in the abdomen with a .380 caliber revolver.\nWhen former East End resident Douglas Evans saw a GoFundMe account created Tuesday for Means’ funeral expenses, he immediately recognized the teen from an interaction they had last winter.\n“I got my car stuck on one of the snow banks and my wheels were spinning,” Evans said. “James and three or four of his friends, without being asked, came up, got behind my car and pushed my car out.”\nAs of 5 p.m. Tuesday, the GoFundMe account for Means had already raised more than $2,600. To donate, visit https://www.gofundme.com/james-means-funeral-expenses.\nReach Elaina Sauber at elaina.sauber@wvgazettemail.com, 304-348-3051 or follow @ElainaSauber on Twitter."}