{"uri": "http://www.theroot.com/articles/news/2016/11/w-va-white-man-arrested-in-fatal-shooting-of-black-teen-another-piece-of-trash-off-the-street/", "title": "W.Va. White Man Arrested in Fatal Shooting of Black Teen: ‘Another Piece of Trash Off the Street’", "dct": "Wed, 23 Nov 2016 12:48:00 GMT", "id": "e3af07b01662096a4b8d9bc83d31d6cb", "content": "A West Virginia man who is accused of fatally shooting an unarmed teenager on Charleston's East End on Monday night was not permitted to have a gun because of a previous domestic violence conviction, the Charleston Gazette-Mail reports.\nWilliam Ronald Pulliam, 62, allegedly shot 15-year-old James Harvey Means twice in the abdomen with a .380-caliber revolver, the news site notes. According to police, Pulliam showed no remorse, acknowledging his part in the shooting and quipping, “The way I look at it, that’s another piece of trash off the street,\" a criminal complaint shows.\nAfter the shooting, Pulliam reportedly went to dinner and then went to a female friend’s home. Authorities later found the gun allegedly used in the shooting at the friend's home.\nCharleston police have asked federal authorities to rule on whether the killing meets the standard for a hate crime.\nAs the Gazette-Mail notes, James was shot after encountering Pulliam outside a Dollar General store Monday evening. The two reportedly exchanged words after bumping into each other on the side walk. After the argument, Pulliam went into the store while James joined his friends on the porch of a home belonging to a friend's grandmother.\nWhen Pulliam left the store and walked past the porch where James and his friends were, the two argued again. James reportedly got up and crossed the street to confront Pulliam, at which point the older man allegedly shot the teen twice.\nJames died shortly after.\nPulliam was taken into custody near the scene around 10 p.m. Monday. On Tuesday morning, he was arraigned on a murder charge. He could face life in prison if convicted."}