{"uri": "http://newsok.com/manhunt-continues-for-suspect-in-shooting-rampage-that-injured-two-officers-left-two-dead/article/5523828", "title": "Manhunt continues for suspect in shooting rampage that injured two officers, killed aunt and uncle", "dct": "Mon, 24 Oct 2016 23:17:00 GMT", "id": "0213cb82909e8792eb804c110b88da14", "content": "WELLSTON — The suspect who shot two Wellston police officers Sunday made a Facebook video afterward, saying, “This is more intense than what I thought it was going to be,” authorities said.\nBleeding from the shoot-out, the suspect fled in an officer's pickup, carjacked a getaway vehicle at a Lincoln County trailer park and then drove to the home of his aunt and uncle near Luther, authorities said. He brutally killed them both, almost severing his uncle's head, then stole their car, authorities said.\nThe last known sighting of the suspect was early Monday after he attempted to steal a motor home at a truck stop along Interstate 40 near Sayre in western Oklahoma.\nThe suspect in the crime spree was identified as Michael Dale Vance Jr., 38, of Chandler, who already was facing a child sexual abuse charge.\nVance remained at large Monday while being sought by federal, state and county agencies. Rumors of his return east to Lincoln County circulated Monday afternoon.\n\"We just want to get this guy,\" said Charles Dougherty, the Lincoln County sheriff. \"He's on a mission to hurt people. It would break my heart if he killed someone over a set of car keys.\"\nSunday, 6:30 p.m.\nThe wounded officers were identified as Jim Hampton and Shawn Stewart.\nHampton, one of two full-time officers with the Wellston Police Department; Stewart, a certified reserve officer, and Alfred Hancock, a reserve in training, responded to a call about 6:30 p.m. Sunday in rural Lincoln County, along with a sheriff's deputy.\nThe lawmen approached a group of six to nine people who had guns displayed in the bed of a pickup. All went smoothly until the officers asked for IDs.\nWellston Police Chief Tim Estes said that's when Vance started shooting, first with a .22 and then with an AK-47-style weapon.\n\"This was a full-out gunfight. You don't see that often,\" said Estes, who likely would have been on the scene himself had he not been returning from a hunting trip in rural northwest Oklahoma.\nVance shot Hampton in the foot, said Estes. Vance also shot Stewart. The officers are recovering from wounds to \"their lower extremities\" and are said to be “doing well and will be recovering at home soon,\" authorities said.\nEstes said officers couldn't return fire initially as Vance stood behind a group of people, including women. But Hampton pulled out his service weapon, a 9 mm, and shot Vance in the shoulder before Vance fled in a Wellston police pickup.\nAnother man, identified as Tony Heavner, was apprehended a short time later, an investigator with the Oklahoma County Sheriff's Office reported in a court affidavit.\nAuthorities said Vance drove the police pickup into the adjacent neighborhood, a mobile home community called Bear Creek.\nJohnathan Chouinard, 28, had just driven himself and his four-weeks pregnant wife Jamie, 27, home from dinner with her father. Chouinard recognized the police pickup as Hampton's and wondered what the officer might want. The pickup ripped ahead of the couple's car and skidded to a stop diagonally in front of it. Chouinard didn't recognize the man who got out of the pickup but briefly thought the man, who bled from the shoulder, was an undercover officer who had been in a shoot-out.\nAuthorities say the man was Vance.\nHe came up to the driver's side of the couple's 1996 Lincoln Towncar holding what looked like an AK-47 with a scope and laser, pointing it toward the ground. He told Chouinard \"Get the f--- out,\" Chouinard recalled.\nThe couple got out and tried to take cover behind a mobile home; Chouinard saw a green laser on the white trailer as they moved away. The car stalled; the man asked Chouinard if it worked.\nChouinard assured the man his car worked and told him to turn the key again.\nOn the way out, Chouinard said, the man in the car shot two times at a trailer, injuring a woman inside.\nSheriff Dougherty said he thought Vance shot at the mobile home on the way into the community. Either way, the bullet hit an item and shrapnel injured a woman at the property. She refused medical treatment.\nLooking back, Chouinard said he is thankful he and his wife got away.\n\"We are blessed,\" he said.\n9:30 p.m.\nReports came in that the same Lincoln Towncar stolen from the mobile home community was at a rural Luther residence, which prompted Oklahoma City police to send a helicopter over the home at 17110 NE 206, the residence of Vance's uncle. From the air, authorities spotted a body, according to court documents.\nLaw enforcement sent a bomb robot onto the property and police confirmed a man there was dead.\nAuthorities found a second dead victim inside, identifying the victims as Vance's aunt and uncle, Valerie Kay Wilkson, 54, and Ronald Everett Wilkson, 55, Oklahoma County sheriff's office spokesman Mark Opgrande said.\nAccording to the affidavit, Ronald Wilkson was shot once with ammunition traditionally fired from an AK-47 style rifle. Valerie Wilkson suffered multiple stab wounds, the investigator reported. Both victims reportedly had large cuts to their necks.\n\"Wounds were found on R. Wilkson consistent with an attempt to sever his head,\" according to the affidavit. \"V. Wilkson, too, had a large cut on the side of her neck similar to the wound witnessed on R. Wilkson.\"\nThe investigator also reported that based on a large cut to Valerie Wilkson's shoulder, it appeared \"Vance was trying to remove V. Wilkson's arm.\"\nAuthorities reported Vance stole from the residence a gray or silver 2007 Mitsubishi Eclipse, with Oklahoma license plate 943 LQQ, and left in an unknown direction.\nA man, who only identified himself as a son of the victims, told The Oklahoman outside of their home on Monday \"all we know is our parents were killed … we've got people still coming in from out of town,” and refused further comment.\nMonday, 2:38 a.m.\nAt 2:38 a.m. Monday, the Sayre Police Department and Beckham County deputies responded to reports of a shooting at a gas station off Interstate 40. The Oklahoma State Bureau of Investigation said in a news release that a man drove into the parking lot of the Flying J truck stop near Sayre and attempted to steal a motor home. Authorities reported the suspect shot the vehicle's owner twice in the leg during the altercation but was unable to gain access to the motor home.\nThe victim, Randy Frost, 47, was taken to a hospital before being transported to an Oklahoma City hospital.\nAccording to the Beckham County sheriff's office, Vance, who is still considered to be armed, was last seen driving westbound on Interstate 40 from the gas station in the 2007 Mitsubishi Eclipse.\nSuspected slayer posts to Facebook\nIn a video obtained from Vance's Facebook account by an Oklahoma City television station, Vance can be seen just after the shooting inside the Wellston officer's patrol vehicle, saying “it hurts, let me tell you it hurts, it sucks,” referring to being wounded in the shoot-out with officers.\n“This is more intense than what I thought it was going to be, to say the least. … I'm about to steal another car, like right now, this ... is going to be intense. Watch this people,” Vance says as the video fades to black.\nA second video, shot inside a different vehicle, shows Vance point the camera to a gun and say “Look, this is real, see that's a … gun, that's the real deal, this … ain't a joke, this ain't a prank, I'm going live if you want to know what's up next, stay tuned to your local news.”\nVance can be heard talking about being set up and thanking an unknown person for their support, and that “I know we didn't get the vest, but it will be all right.”\nThe video ends with Vance describing being shot as painful and ignoring a phone call, saying “I love you sis, I'm not answering the phone, it's too late now.”\nVance was charged in July in Lincoln County with child sexual abuse, after a former felony conviction. He is accused in the sexual abuse charge of an offense against a 15-year-old girl at a house in Chandler in July. He told police he did not do anything because he was asleep, according to a court affidavit. The prior conviction is a bogus check offense from 2001.\nHe is described as 5 foot, 11 inches tall, weighing about 210 pounds and has “a medical condition and may try to spread disease,” according to the Oklahoma Highway Patrol.\nIn a statement released Monday morning, Opgrande said Vance may have returned to the Oklahoma City or Lincoln County area and \"others may be in danger.\" He said Vance might attempt to carjack or steal another vehicle.\nAnyone with information on Vance's whereabouts is asked to not approach him and should call 911.\nHeavner had not been charged and it was unclear if he was still being held Monday evening.\nCheck NewsOK.com for updates.\nContributing: Staff Writers Nolan Clay, Kyle Schwab, and Ben Felder."}