{"uri": "http://www.fox2detroit.com/news/local-news/45467269-story", "title": "Police: Child finds gun in car, shoots self in Kroger parking lot", "dct": "Fri, 06 Nov 2015 23:36:00 GMT", "id": "e5e49a6e3004b322dc6314ec1bdaf5b5", "content": "TROY, Mich. (WJBK) -\nA 3-year-old was hospitalized Friday after accidentally shot himself inside a vehicle in a grocery store parking lot in Troy.\nThe toddler was in the front seat of the family car around 1:45 when he found his mom's gun. He picked it up and it somehow went off and shot the Rochester Hills boy in the leg. He was taken to a nearby hospital and is listed in stable condition. According to Troy Police Capt. Bob Redmond, he is expected to be okay.\n\"The mother and her two sons had been in Kroger shopping, when they came out the 4-year-old climbed into the into backseat of the car,\" Redmond said.\nPolice said the boy was in the front seat while his 10-year-old brother helped mom load groceries into the trunk at the Kroger at South Blvd and Crooks. The young boy reached into the front center console, took out his mom's 9 MM handgun and shot himself. Police say the bullet exited his thigh.\n\"He pulled the trigger on the gun, shooting himself in the upper right area, (it) exited out the right thigh,\" Redmond said.\nPolice say several people in the busy lot reported hearing the gunshot. One of those was a retired Warren police officer who was walking by. He immediately ran over to help.\n\"Having the right people at the scene at the right time is always a plus for us. In this case, having a good witness to have,\" Redmond said.\nPolice say the little boy's mother is a CPL holder. They said she's devastated by what happened and is by her son's side in the hospital but could face serious charges.\n\"The purpose of a CPL is so you can carry a handgun, then carry it. Don't store it in a car.\"\nPolice are still questioning her. She could face charges of careless, reckless, or negligent use of a firearm.\nTroy Police initially told FOX 2 the child was left alone in the vehicle while the parent went inside, but no longer believe that is what happened."}