{"uri": "http://www.philly.com/philly/news/Man-kills-self-after-shooting-girlfriend-and-her-son-in-Gloucester-County.html", "title": "Man kills self after shooting, wounding girlfriend and her son in Gloucester County", "dct": "Fri, 25 Nov 2016 00:00:00 GMT", "id": "3009e174676861542e2a59f3c7ce816a", "content": "A Gloucester County man shot his girlfriend and her 9-year-old son, wounding both early Friday before apparently killing himself with the handgun, officials said.\nThe Gloucester County Prosecutor’s Office said the shooting grew out of an argument Thursday between Robert Long, 48, and Melissa Cakmak, 41, in their home on Poplar Lane in Monroe Township.\nAccording to officials, Cakmak asked Long to leave and he went to another home in the township, where he got into a physical fight.\nHe left before police arrived but was later stopped by a Monroe police officer and served with a warrant for driving while intoxicated, the prosecutor’s office said in a statement. He was released in the care of a relative.\nAbout 1:30 a.m. Friday, Cakmak awoke to find Long there, the statement said. He pulled out a handgun and fired twice, hitting the woman in the torso and grazing the boy’s hand.\nThe mother and son fled the house, leaving Long in the house. They were taken to Cooper University Hospital in Camden and are expected to survive.\nIn the meantime, police from Monroe and neighboring towns responded to a report of shots fired and surrounded the house.\nUnsure of Long’s whereabouts, the Gloucester County Special Weapons and Tactics unit was called in and entered the house about 5 a.m.\nInside they found Long dead with the handgun nearby.\nIt appears SWAT teams may have busted the glass door out front before they found Robert Long dead from self-inflicted gunshot wound pic.twitter.com/nZOstVKna3\n— Michael Boren (@borenmc) November 25, 2016\nBlood dotted the front porch and shattered glass from a storm door had been swept into a pile Friday afternoon at the home where the shooting occurred.\nA green child's bicycle rested against the porch, and a basketball hoop stood on the street out front.\nTony DiLeonardo, 48, who lives several houses down, said he woke up to go to the bathroom early Friday when he saw SWAT teams outside.\n\"It was just cops everywhere,\" he said.\nHe said a SWAT truck drove through the corner of his front lawn and ran over a Chinese maple tree, as officers tried to get closer to the house where Long was found. Tire tracks could be seen Friday next to the tree, which was leaning toward the ground."}