{"uri": "http://www.providencejournal.com/article/20141118/News/311189975", "title": "Providence gang member sentenced in murder of 12-year-old girl, shooting of 3 women", "dct": "NODATE", "id": "7f07e7714e3d1ce676bd05b2e8cc68c1", "content": "Hide caption Angel Valerio, 19, pleads guilty on charges he was involved in a shooting that killed Aynis Vargas, 12, last year. His attorney William Dimitri is left. FRIEDA SQUIRES\nPROVIDENCE -- He didn't fire the gun, but a young man who was with a fellow gang member who murdered a 12-year-old girl and injured three women was sentenced Tuesday to 15 years for being involved.\nAngel \"Young Cyph\" Valerio, now 20, was in a minivan with four other Harriet Street gang members the night of June 15, 2013, when they drove to the Hartford Park housing complex seeking retaliation over a broken van window and the murder of a friend.\nThe Hartford Soldiers weren't out that night, just women and children at a high school graduation party. Yet, one of the gang members took the gun to the party and opened fire, killing 12-year-old Aynis Vargas and wounded Vilma Tineo, Elaine Devargas, and Eugelyn Cabrera-Martinez.\nValerio called the shooting \"inexcusable,\" and wrote that he was sorry for what happened and \"deeply sorry\" for the death of Aynis. \"Her life was just beginning,\" Valerio wrote in his letter.\nValerio has had little support in his young life, Dimitri said. Valerio's father left when he was six. His mother left when he was 13. He has seven half-siblings, but none were part of his life, Dimitri said.\nBut Valerio has been mainly on his own, Dimitri said. \"He became a product of his environment,\" Dimitri said later. \"Abandoned by his parents and turned to the streets.\"\nAssistant Attorney General James Baum urged the judge to issue a sentence that punished Valerio and deterred others from gang violence and retaliation, \"to further send a message that this is not a drama.\nThe gunman, 22-year-old Branden Castro, pleaded guilty in April to charges of murder, assault and conspiracy and is serving consecutive life sentences, plus 50 years. Ricardo Vasquez, 21, who drove the minivan to Hartford Park, pleaded guilty in September 2013 and is serving a life sentence. Luis \"Didi\" Gonzalez, 19, has pleaded guilty to assault and conspiracy charges, while his 24-year-old brother Luis \"Fat Boy\" Gonzalez - who told Castro to \"bang the party\" -- was found guilty by a jury in June of several assault and gun charges. Both are awaiting sentencing.\nJudge Krause sentenced Valerio to 15 years, with 12 years to serve at the Adult Correctional Institutions. One year for every year of Aynis' life."}