{"uri": "http://www.unionleader.com/crime/update-mass-teen-fatally-shot-in-derry-remembered-as-outgoing-magnetic-20160721", "title": "Mass. teen fatally shot in Derry, remembered as outgoing, magnetic", "dct": "Thu, 21 Jul 2016 13:58:00 GMT", "id": "c3d8fb341a67462ef8411abb80a4d354", "content": "DERRY — A 17-year-old from Lowell, Mass., was shot and killed on a quiet residential street Wednesday night in an apparent drug deal gone wrong, according to friends and residents.\nCole Kinney, who would have been a senior at Greater Lowell Technical High School, had already died on North Shore Road near the intersection of Island Pond Road by the time police responded about 11:19 p.m. Wednesday.\nNeighbors who went outside after hearing gunshots described a scene of panic after the gunman fled, and Kinney’s companions dialed 911.\nThursday around noon, after the scene was cleared and the road reopened, several of Kinney’s friends who composed a makeshift memorial described him as an outgoing and magnetic football player whose death came as a shock.\nThe New Hampshire Attorney General’s Office is investigating, along with state and local police.\nAn autopsy has been scheduled for 8 a.m. Friday in Concord.\nAssistant Attorney General Geoffrey Ward said Thursday night that the autopsy will be conducted by the Medical Examiner’s office and the results will likely be released on Friday.\nOfficials said there is no danger to the community.\nAuthorities said multiple people were involved in the incident but they have not released additional details.\nCurtis Lonergan, 22, who lives nearby on North Shore Road, said he was home watching a Boston Red Sox game with his family Wednesday night when they heard what sounded like a firecracker. Moments later they heard sounds of yelling and a vehicle backing up and stopping.\nWhen they went outside to investigate, Lonergan said, he saw four teenage boys: two walking around, one sitting in the road and the fourth lying across him with his shirt up, his chest smeared in blood.\nLonergan, a pre-med student at the University of Maine, said he wanted to help the teen, but it was apparent from the wound that he only had moments to live.\n“As I got closer, I could tell that the bullet hole was right where the heart was,” he said.\nThe other teens told Lonergan that the shooter, a white male whom they’d met only once before, had taken off on foot toward nearby Island Pond Road, he said.\n“They were talking about a drug deal going wrong,” specifically citing marijuana, Lonergan said.\nMichael Riley, another neighbor, said firecrackers are not infrequent in the rural area, so he thought nothing of the initial sounds he heard Monday night. But when he went outside to check, he found the group of teenagers, who seemed unfamiliar with the area, he said.\nThe vehicle’s driver said, ‘Hey, my buddy got shot,’ and ‘Where am I?’” Riley recalled.\nRiley said the gunman had apparently taken off through the woods.\nThursday around noon, some of Kinney’s friends laid flowers at the site and spray-painted messages on the street in bright blue: “Coles World,” and “R.I.P Cole.”\nThey left the bottle of spray paint for others to contribute.\nSpeaking to reporters through tears, the friends said Kinney’s community was grieving his loss. They said he wasn’t involved with gangs and didn’t run with the wrong crowd.\n“He had just nothing but smiles,” said Jocy Frechette. “Even if there was no party, he was the life of the party. ... He was very known for pushing the envelope.”\n“No one had anything bad to say about him,” added Rachael Fast, 17.\nThe friends, most of whom knew Kinney from school, said he had been a boxer for some time, but more recently had focused on playing football for the high school.\n“He was just a wicked down-to-earth kid,” said Bryan Janeczko, 18, of Pelham. “Everyone wanted to be around him.”\nNo specific memorial plans had been made as of early Thursday afternoon.\nA GoFundMe page set up to support Kinney’s family with funeral expenses had already raised more than $16,000 by 8:30 p.m. Thursday.\nOn the page, his sister, Tayla Leigh Kinney, called it the worst day of her life.\nShe said Cole Kinney was exactly two months away from turning 18, when he planned to get his mother’s name as his first tattoo.\n“His positive vibes and humble self would move mountains,” she wrote. “He was going somewhere in life. He loved boxing, sports, and most of all FAMILY.”\nOfficials are asking anyone with knowledge of the crime to contact State Police Sgt. Brian Strong at (603) 223-8568 or brian.strong@dos.nh.gov.\nUnion Leader Correspondent Hunter McGee contributed to this story.\n."}