{"uri": "http://www.egcitizen.com/news/elk-grove-police-k-two-suspects-injured-in-shooting/article_6fd139c4-d5d0-11e6-beae-eb187d8fb5f2.html", "title": "Elk Grove Police K9, two suspects injured in shooting", "dct": "Sun, 08 Jan 2017 00:00:00 GMT", "id": "116f82605f74d7bf8c4d2ad36ffbf67f", "content": "Two suspects and an Elk Grove police K9 were injured during an officer-involved shooting incident in Laguna last night. The dog and the two suspects suffered non-life threatening injuries, Elk Grove police reported.\nLuther Foster, 45, of Sacramento and a 17-year-old boy were arrested for allegedly assaulting the police and robbing a store. Police also arrested Shantel Williams, 41, of Elk Grove for allegedly driving the suspects' getaway car.\nAuthorities said the two suspects were armed robbers who targeted the Jamba Juice store around 8:30 p.m. at the 9100 block of West Stockton Boulevard in Laguna. They reportedly confronted employees before closing time and ordered them to open a register. The suspects then stole an undisclosed amount of cash and fled.\nElk Grove police spokesperson Christopher Trim reported that officers arrived to the store a few minutes after the call and they soon searched for the suspects.\nOne officer and a K9 were on West Stockton Boulevard when they reportedly saw two pedestrians who matched the descriptions of the suspects, Trim said. The suspects then reportedly ran toward a parked car on Dunisch Road when the officer tried to contact them. Trim said the officer then deployed the K9 to stop them.\nTrim reported that the suspects opened fire and shot the dog twice. They then allegedly fired at the officer who then returned fire. Police said the suspects ran on westbound Dunisch Road. Authorities arrested Foster near the scene.\nOfficers from the Sacramento police, Sacramento County Sheriff's Department, the Folsom police, and the California Highway Patrol soon arrived to help the Elk Grove police find the second suspect. They later found the 17-year-old suspect near the corner of Dunisch Road and Wooded Brook Drive. Trim said that investigators discovered two loaded handguns that were thrown away by the suspects.\nThe wounded K9 was taken to a veterinary hospital for treatment, while the injured suspects were treated at a local hospital. Foster and Williams were booked into the Sacramento County Main Jail and the teenage suspect was sent to juvenile hall.\nTrim said that the Elk Grove police officer who was involved in the shooting was placed on administrative leave, as per police department policy."}