{"uri": "http://www.khou.com/story/news/crime/2015/10/01/hpd-three-questioned-in-deadly-drive-by-shooting/73131664/", "title": "Two men charged in fatal drive-by shooting of boy", "dct": "Fri, 02 Oct 2015 00:00:00 GMT", "id": "768db44af2764d920535932106d4ed05", "content": "HOUSTON - Two men have been charged with murder in last week's drive-by shooting that killed a 6-year-old boy and seriously injured his 11-year-old brother.\nMoises Jiminez died in his bed last Friday morning. His brother Manuel was shot through the chest and is still in the hospital.\nA gunman fired up to 14 shots into the side of their house early Friday morning.\nA security camera from a home across the street captured a four door sedan speeding by three times, someone firing at the house on that third pass.\nHouston Police say 24-year-old Alexis Arturo Cuapio confessed he fired from the backseat and was aiming for the boys' older siblings. Police also reported 20-year-old Oscar Ollervides admitted he was the driver. Both are charged with murder.\nWe're told Ollervides bonded out of jail on a $50,000 bond Thursday evening. A third suspect that was in the car is still being questioned by police.\nAs for the motive, police say it was an ongoing dispute between the shooter and the older teenage brothers in the Jiminez family, but nothing that should have elevated to a cowardly barrage of gunfire into the outside walls of a home with 11 family members inside, 7 of them children.\n\"They did express a little remorse that one was deceased, one was struck,\" said Officer Travis Miller of the suspects under arrest. \"But it doesn't negate the fact that they were still reckless in their acts and reckless in the discharge of that weapon.\"\n\"I would venture to say that anything that would lead to something like this is absolutely stupid,\" said Lt. John McGalin. \"For an 11 year old to be in the hospital and his 6 year old brother to be dead, I can't think of any reason. So you ask me whether it's stupid or not, yes, it's stupid.\"\nCharges against the third suspect are pending. Police say they have recovered the car used in the shooting. The suspects also led them to a gun that is being tested to confirm it was the murder weapon.\n11-year-old Manuel Jiminez, who earlier this week received a surprise hospital visit from the Texans star defensive end J.J. Watt, is still in the hospital recovering from a bullet that passed through his chest. The funeral for 6-year-old Moises Jiminez is scheduled for Friday afternoon."}