{"uri": "http://www.khou.com/story/news/crime/2015/09/25/drive-by-shooting-reported-at-home-in-se-houston/72787566/", "title": "Search for motive underway after boy killed, another wounded in shooting", "dct": "Fri, 25 Sep 2015 00:00:00 GMT", "id": "9e5326b658d81febb476fc01ea3dc631", "content": "HOUSTON – A 6-year-old boy was fatally shot and his 11-year-old brother was critically wounded in a drive-by shooting at their southeast Houston home.\nThe crime doesn't make sense to the family now grieving the loss of a son and praying that his older brother makes it. Neither had time to escape the gunfire because they were sound asleep in a front bedroom of their home.\nMoises Jimenez died in his bed.\n\"He just never woke up after going to bed,\" said Mary Banda, the victims' aunt. \"He just never woke up. He never got to see another day -- never got to go to school and be with his friend, never got a chance to grow up.\"\nMoises just started the first grade at Southmayd Elementary.\n\"Moises didn't deserve what happened to him, he's just an innocent child,\" said Banda.\n\"I only want to know why they did this\" said the boys' father, still covered in blood. \"Why would they do this to my two sons?\"\nThe victim's older brother, 11-year-old Manuel Jimenez, was shot twice in the chest. Both bullets missed his heart. Manuel is in the intensive care unit at Memorial Hermann Hospital but loved ones say he is already showing improvement.\nThe drive-by happened in the early-morning hours Friday in the 6600 block of Narcissus. Up to 14 shots were fired.\nThe majority of the gunfire was directed toward a bedroom where Moises, Manuel and two other children were sleeping.\nHouston Police homicide investigators believe the shooting might be connected to an earlier altercation involving the victims' teenage brother.\nThe children's grandmother says she has been worried for her six grandchildren who live at the home ever since bricks were hurled at the family's home about three years ago.\n\"I told my daughter, 'if this thing has happened already why do you put the kids in that bed? In that window?' I told her many times don't put them in there it's too dangerous,\" said Julia Garcia.\nFor now, police will focus on surveillance video that investigators have from neighbors. Police say it shows a gold or tan-colored sedan speeding by the house three times around 3:30 a.m. You can see a muzzle flash as shots were fired into the house. Another car followed and police believe the occupants of both cars may have been involved in the shooting.\n\"These were innocent children doing nothing but sleeping at the time, waiting to be awoken up to go to school. This is incredibly tragic,\" said HPD Investigator Brian Evans.\nCall Houston Police Homicide at 713-308-3600 or Houston Crime Stoppers at 713-222-TIPS if you have any info in the case.\nThe family has set up a gofundme,com account to help with funeral questions."}