{"uri": "http://abc13.com/news/relative-6-year-old-killed-11-year-old-shot-in-se-houston-drive-by-shooting/1001264/", "title": "Mom of boy killed in drive-by shooting: 'Turn yourself in. You took my son away'", "dct": "Sat, 26 Sep 2015 00:00:00 GMT", "id": "f3e0802832c3dc3f458876c0c361ceba", "content": "HOUSTON (KTRK) --\nA southeast Houston family is dealing with unimaginable grief. A six-year-old boy is dead and his 11-year-old brother in a hospital after someone started shooting at their house early Friday morning.\nBy Friday evening, a memorial was growing outside the home and the boys' mother was pleading for those responsible to come forward.\n\"Turn yourself in. You took my son away. You took my baby,\" said Elizabeth Garcia. \"Why did you have to do this? He didn't deserve this. He was just a baby.\"\nDaniel Jimenez, the boys' father, spoke with Eyewitness News. His T-shirt was stained with the blood of his 6-year-old son.\n\"And the shots, and my boy calling, 'Daddy, Daddy,'\" he said.\nMoises Jimenez was asleep in a bed in his mother's room. His older brother tells us Moises was shot and killed almost instantly.\nManuel Jimenez was sleeping in the home when one of those bullets hit him, too.\nCLICK OR TAP HERE TO VIEW RELATED GALLERY\nSix-year-old Delilah lost her twin brother.\n\"I don't know why they had to shoot my brothers,\" she said.\nThe Jimenez family is counting on police to figure out who did this.\n\"I don't know too much English, but the police, the police are good,\" said Daniel.\nInvestigators initially told us the shooting could be gang-related, but later said that's not the case. They did say there's something strange about the gun the shooter used.\n\"It's an unusual caliber,\" said Brian Evans with HPD homicide. \"It's not something we come across ordinarily. It's one of the biggest questions we have at this time.\"\nEvans said the house was fired upon 14 times. The children were not the intended targets, but the victims. The shooting, he said, may have been in retaliation for an incident that happened a few months ago, but that's all he would say.\nAt a news conference Friday afternoon, police released vehicles captured on surveillance video that are believed to have been involved in the shooting. In the video, an extended cab Chevy Pickup truck is first seen driving by. Then, a minute later, a gold or beige sedan-possibly a Honda accord-drives by. Someone inside is firing as debris flies.\nAnyone with any information is urged to call HPD Homicide Division at 713-308-3600 or Crime Stoppers at 713-222-TIPS.\nThis Facebook post is no longer available. It may have been removed or the privacy settings of the post may have changed.\nA GoFundMe account has been set up to help the family. You can donate by clicking or tapping here."}