{"uri": "http://www.springfieldnewssun.com/news/news/crime-law/family-mourns-bar-shooting-victim/nWwmT/", "title": "Family mourns bar shooting victim", "dct": "Mon, 18 Mar 2013 00:00:00 GMT", "id": "7c64fc8c5adf403aa13dccf6e072ad76", "content": "...\nSPRINGFIELD —\nSeeing the stranger accused of killing her husband at the Nite Owl Bar, Alicia Edwards said she wanted to look into his eyes.\nBut at his arraignment Monday, he never glanced her way.\n“He wouldn’t look at me, not at all,” she said. “It was harder than I actually expected it to be, just to have to sit there and not say anything (and) just have to look at him.”\nJulian A. Johnson, 29, of Dayton, was arrested Friday at an apartment complex in Trotwood by U.S. Marshals. He’s been charged with one count each of murder and having a weapon under disability and is accused of killing 34-year-old Ernest Edwards at the Nite Owl, 601 W. Main St., on Jan. 26.\nJohnson pleaded not guilty and asked for a public defender during his arraignment Monday. His bond was set at $510,000.\nClark County Assistant Prosecutor Greg Morris indicated his office intends to indict Johnson and plans to present the case to a Clark County grand jury next week.\nPolice are still looking for a second shooter at the Nite Owl bar. A warrant on a complicity to commit murder charge has been issued for Walter Baker Jr. Anyone with information about Baker or the shooting is asked to call the Springfield Police Division at 937-324-7716.\nEdwards was trying to exit the rear door of the bar after a fight broke out. A Springfield police report alleges Johnson went out the front door, retrieved a semi-automatic handgun from his car and began firing at the back door, reportedly killing Edwards and injuring three others.\nHis widow said Monday it’s devastating to know her husband’s decision to play pool that night cost him his life.\n“My son is 10 years old,” Alicia Edwards said. “He will never see his father again.”\nEdwards’ family sat in the front row during Johnson’s arraignment in Clark County Municipal Court on Monday, wearing T-shirts in memory of the man they lost.\nAlicia Edwards said her family members have fasted every Thursday and prayed daily for police to make an arrest in the case. When she received the news Friday, she said she was “screaming and hollering and thanking God.”"}