{"uri": "http://www.wlwt.com/article/young-girl-man-shot-in-avondale-police-say/8612912", "title": "9-year-old dies, father injured in Mt. Auburn double shooting", "dct": "Thu, 19 Jan 2017 23:45:00 GMT", "id": "f0da82ce502ee9a1802f5a4e82df9b2d", "content": "CINCINNATI —\nA young girl was killed and her father was injured Wednesday in a shooting in Mount Auburn.\nAuthorities were called just before 6 p.m. to a home to the 2200 block of Burnet Avenue on reports of a shooting.\nPolice said they found a 39-year-old man and his 9-year-old daughter with multiple gunshot wounds inside of the home.\nThe girl, identified as Alexandrea Thompson, was taken to Cincinnati Children's Hospital, where she died, authorities said.\nThompson was a student at Mount Auburn International Academy.\nAuthorities said the man was underwent surgery at UC Medical Center. He is listed in critical condition.\n“She was a shining star and we all knew it,” said Freeman McNeal who lives just across the street.\nMcNeal said Alexandrea was called “Sissy” by everyone in the neighborhood. She was like a granddaughter to him.\n“That spirit, that fight and that love that she love she had, that tenderness -- it’s gone,” McNeal said.\nSenora Ware, a neighbor, saw the aftermath of the shooting as she walked in the area to go to the store.\n\"I saw the lady run out waving her hand and all the police cars coming by,\" Ware said.\nWare said the scene made her emotional.\n\"I have young kids, and I just couldn't imagine something like that happening to my children,\" she said.\nInvestigators told WLWT that the man was hit in his upper torso. An officer said the man was also hit in his side.\n\"To have an occurrence where we have a small child, 9 years old ... it weighs on you,\" Cincinnati assistant police Chief Paul Neudigate said Wednesday evening.\nPolice said they are looking for three or four men who were seen running from the scene, but would not speculate about why they were at the home or why shots were fired.\n“He said he doesn’t know why they targeted him, and that’s his words,” said Peterson Mingo, a pastor who talked to the father in the hospital.\n“He said he had seen one of the guys around but he didn’t know who they were,” Mingo said.\n\"Any cooperation from anybody that knows anything about this horrendous act, we need them to ... call us. Give us information. Somebody needs to be held accountable for this,\" Neudigate said."}