{"uri": "http://www.nbcdfw.com/news/local/Five-Family-Members-Found-Dead-In-Navarro-County-224807262.html", "title": "2 Adults, 3 Children Dead Investigated as Murder-Suicide: Sheriff", "dct": "Wed, 12 Feb 2014 18:24:00 GMT", "id": "db44cea5d08aebe809b35320e3cd2239", "content": "The discovery of the bodies of five family members inside a home in a small Texas town is being investigated as a murder-suicide, law enforcement officials confirmed.\nThe Navarro County Sheriff's Office identified the victims as Israel Alvarez; his wife, Guadalupe Ronquillo-Ovalle; and their three sons, ages 10, 8 and 4. A family friend said the boys were Misael, Cain and Israel Jr., respectively.\nThe bodies were found at a home in Rice, about 40 miles southeast of Dallas.\nNavarro County Sheriff Elmer Tanner said a Spanish-speaking man called 911 at about 7 p.m. Sunday to report that several members of his family were dead at a home in Rice.\nEmergency medical personnel arrived on scene shortly after and confirmed the deaths of five people.\n\"I don't care where you are, any time there's five losses of lives in one location, that's shocking and traumatic,\" said Tanner. \"It doesn't make any difference where you are. It's a horrible, horrible thing to see, witness or be a part of.\"\nThe sheriff said Monday that all five had gunshot wounds to the upper torso and a .22 caliber semi-automatic long rifle was recovered from the scene.\nThe sheriff said the last time anyone reported seeing the family was on Thursday and that the children were not in school on Friday. Two of the boys attended Rice Elementary School and one of the boys attended Rice Intermediate Middle School.\n\"It's so sad for everybody. Everybody's in shock. We cannot believe this. We really need God and family,\" said family friend Maria Franco.\nThe death investigation is confined to inside the home.\n\"As far as looking for a suspect, what I'm saying, at this point in time, is that we are concentrating our efforts on the investigation at the residence,\" Tanner said. \"We have not seen anything yet that makes us think we need to go outside this location.\"\nOn Monday, the sheriff said deputies had been to the home four times since 2010, including an instance in 2010 when children called 911 while playing with the phone and times in both 2011 and 2012 for trash-dumping complaints.\nOn Sept. 11 of this year, deputies were called to the home on a family violence call. The sheriff said Alvarez shoved his wife and was arrested on a Class C assault family violence charge. Alvarez spent two days in jail, paid a $367 fine and was released from custody.\n\"We are good friends. We cannot imagine this thing could happen,\" said Franco. \"I think it was a good relationship they're building their house together. It was very normal.\"\nThe sheriff said the medical examiner's office would rule on the manner of death at a later time.\nLate Monday afternoon, the Rice Independent School District released the following statement on the shootings:\nRice Independent School District would like to express its heartfelt condolences to the family and those affected by last night's tragedy. The emotional well-being of our students and faculty is our utmost priority at this time. We have solicited additional resources and counselors to help us through this grieving process. We will continue to offer these services as long as our students and teachers need them. Please respect the privacy of the family involved, as well as our students and faculty, as we are all dealing with the loss of members from our school family.\nJudith Pritchett\nSuperintendent\nRice Independent School District"}