{"uri": "http://www.ajc.com/news/news/gbi-ex-habersham-deputy-killed-wife-man-before-amb/nkHQD/", "title": "Ex-Habersham deputy killed ex-wife, man before shooting ex-cohorts", "dct": "Mon, 23 Feb 2015 00:00:00 GMT", "id": "e3d4b149d18f5516a1a3f629c14393bf", "content": "A former Habersham County deputy ambushed his former sheriff and a colleague after investigators believe he killed his ex-wife and another man at her Clarkesville home, the GBI reported Monday.\nHabersham County Sheriff Joey Terrell, Deputy Bill Zigan and another deputy responded to a 911 call from a 16-year-old girl around 7:30 p.m. Sunday that her father, Anthony Giaquinta, was attacking her mother “and gunshots were being fired,” said Rusty Andrews, deputy director of investigations for the Georgia Bureau of Investigation.\nThe 16-year-old daughter and her boyfriend escaped the subdivision, which is about 85 miles northeast of Atlanta. Her 18-year-old sister was away at college, Andrews said.\nThe 41-year-old Giaquinta apparently initially tried to escape but then returned to confront Terrell and his deputies. When the patrol cars arrived at the entrance to the subdivision, they were confronted by a black Crown Victoria speeding at them. The car spun out when trying to escape, and Giaquinta fled on foot into some woods, Andrews said.\nTerrell knew Giaquinta because he terminated him in 2013 after a domestic violence investigation. The case, however, was not prosecuted, so Giaquinta still had “many guns,” Andrews said. Guns are often confiscated after a domestic violence conviction.\nAfter briefly looking for Giaquinta, Terrell and his deputies went to the house in the 200 block of Lower Pond Court, where they found Kathy Giaquinta Smith dead on the garage floor. Terrell posted Zigan outside to watch for Giaquinta while he and the other deputy searched the house.\nBut Giaquinta, a former police dog trainer and handler, hid in some trees and shot Zigan with a 9mm Glock pistol, fracturing his collarbone and gouging his face, before Zigan managed to crawl into the garage and take cover, Andrews said. Giaquinta then moved up to the garage and shot Terrell in a bicep when he stepped into the garage to help Zigan.\nThe unnamed deputy then exchanged gunfire with Giaquinta, who was later found dead in the backyard, Andrews said. There was no evidence of a self-inflicted gunshot wound. A state medical examiner will make the official determination.\n“We believe he was killed by return fire,” Andrews said.\nZigan is still recovering in Northeast Georgia Medical Center from non-life-threatening injuries and may need plastic surgery, Andrews said. Terrell has been released.\nSWAT teams from the Georgia State Patrol and Habersham and Hall counties arrived. SWAT gassed the house after Terrell and his deputies escaped in case Giaquinta had barricaded himself in the home, Andrews said.\nThey later found him in the backyard. Steven Thomas Singleton, 45, of Flowery Branch, was discovered dead from “multiple gunshots” in a side yard, Andrews said.\nSingleton was described as a very close friend of Smith, although Andrews was uncertain whether the two were in a romantic relationship.\nGiaquinta was also a former officer at the Gainesville Police Department and had worked overseas in Kabul, Afghanistan, as a contractor, as did many people with law-enforcement training.\nHis Crown Victoria was a former police car, but its ownership had not yet been determined as of Monday, Andrews said.\nThe GBI is investigating whether police or deputies responded to more 911 calls regarding domestic violence involving Smith and Giaquinta in the past, Andrews said.\nInvestigators have only confirmed the one in 2013 until the 911 call Sunday, he said."}