{"uri": "http://www.wsbtv.com/news/news/local/2-deputies-shot-habersham-county/nkGwC/", "title": "3 dead in shooting spree that injured Habersham Co. Sheriff, deputy", "dct": "Sun, 22 Feb 2015 20:45:00 GMT", "id": "f9e9305a221e90304a872240fc662d9f", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nHABERSHAM COUNTY, Ga. - A former police officer shot his ex-wife, her friend, a local sheriff and a deputy on Sunday before he died, Georgia Bureau of Investigation agents said.\nThe Georgia Bureau of Investigation said in a news conference Monday that the shooter, identified as Anthony Giaquinta, worked in and out of law enforcement for many years.\nHe was once an employee of the Gainesville Police Department, GBI officials said. They said he was employed by the Habersham County Sheriff's Office until his termination on June 15, 2013, after allegations of domestic violence. He was never charged for the alleged domestic violence, police said.\nThe Sheriff’s Office was called to Giaquinta's home because of a domestic dispute shortly before 7:30 p.m. Sunday.\n“Upon their arrival, they found a female who was deceased in the garage. They made entry to see if any other victims were inside. Upon entry, it appears they were ambushed,” GBI Deputy Director of Investigations Rusty Andrews said.\nHabersham County manager Phil Sutton told Channel 2 Action News that the gunman shot Habersham County Sheriff Joey Terrell and deputy Bill Zigan.\nPolice said Giaquinta and another man found outside the home died, in addition to Giaquinta's ex-wife, whose body was found inside the home.\nTerrell and Zigan were taken to Northeast Georgia Medical Center in Hall County.\nTerrell was released Sunday night. Zigan remained hospitalized.\n“They're two very tough, professional gentlemen,” Sutton said.\nFernandes asked Sutton why he thought the sheriff responded to the call.\n“Probably because he knew the person who was involved in the incident,” Sutton said.\nSutton told Fernandes that the sheriff showed up at the domestic incident because he thought he could calm down Giaquinta.\n\"I think all of us who work with the Sheriff’s Department, (who) work with Sheriff Terrell and Deputy Zigan, can breathe a sigh of relief,” Sutton said.\nWatch Channel 2 Action News starting at 4 for new information on this developing story."}