{"uri": "http://www.macon.com/news/local/crime/article30172629.html", "title": "Macon man sentenced to 15 years in shooting", "dct": "Wed, 11 Feb 2015 14:28:00 GMT", "id": "2672d169f346cad422ccf84a5f81c772", "content": "A Macon man indicted in two Bibb County shootings was sentenced to 15 years in prison Wednesday, followed by 20 years on probation.\nAdrian Fletcher, 28, pleaded guilty to one count of aggravated assault and to violating Georgia’s Street Crime Terrorism and Prevention Act during a hearing in Bibb County Superior Court.\nProsecutor Sandra Matson said Fletcher and Thomas Holston had been in an ongoing argument before Holston spotted Fletcher following him in traffic on Jan. 12, 2014. After arriving at a house on Roy Street, Holston saw Fletcher on the porch as he fired a dozen shots inside, striking Holston and two other men, Matson said.\nHolston was shot in the side and suffered severe internal injuries, she said.\nFletcher’s lawyer, Paul Christian, said his client has changed and now realizes “having a gun doesn’t make you tough. ... Standing up to influences does.”\nHe described Fletcher as a warm, soft-spoken family man.\nAdditional charges relating to the case were dismissed as part of the plea bargain.\nFletcher also was charged with eight counts of aggravated assault stemming from a Feb. 24, 2013, shooting at a “party house” in the 2800 block of Mercer University Drive.\nThose charges also were dropped.\nDuring a Monday hearing, Matson said Fletcher and his brother, 29-year-old Frank Fletcher Jr., were at an alleged Crips gang hangout on Mercer University Drive Feb. 24, 2013, when an argument began. A fight ensued and shots were fired, striking multiple people.\nFrank Fletcher pleaded guilty to one count of aggravated assault in connection with that shooting and was sentenced to seven years in prison followed by eight years on probation.\nInformation from Telegraph archives was used in this report. To contact writer Amy Leigh Womack, call 744-4398."}