{"uri": "http://www.ledger-enquirer.com/news/local/crime/article31734141.html", "title": "Police: Gun used in apartment shooting 'readily accessible' to children", "dct": "Fri, 21 Aug 2015 13:08:00 GMT", "id": "83a362a4202aa6ffce402e9185cf1372", "content": "The Columbus mother accused of lying to police about the apartment shooting that injured her 19-month-old son appeared in Recorder's Court this morning.\nDakina Fortson, 20, pleaded not guilty to false report of a crime and reckless conduct charges issued in the case. Judge Michael Joyner ordered her held in Muscogee County Jail under bonds totaling $2,750.\nColumbus Police Detective Jason Brown said authorities were called to Elizabeth Canty Apartments at 201 20th Ave. Wednesday evening to investigate a shooting.\nResponding officers found Fortson's 19-month-old boy suffering from a gunshot to the right hand. He was rushed to Midtown Medical Center.\nBrown said the toddler is going to be okay.\nFortson first told police she was watching her 5-year-old son when an unknown gunman traveling in black Honda shot her younger son in front of the building, Brown testified.\nSoon after, investigators found compelling evidence that led them to believe that the 6:35 p.m. shooting actually happened in her apartment, Brown said.\nOfficials found a .357 Magnum revolver and .380 Keltec under a mattress in the home and three bullet holes in the wall. Brown said it also appeared as if someone moved the furniture around the residence to cover up the crime scene.\nPolice questioned Fortson about the incident a second time.\nShe then admitted that her 5-year-old son retrieved the Magnum from underneath her mattress and was playing with it when he accidentally shot his younger brother's right finger, according to Brown.\nAccording to police, Fortson said she tried to cover up the evidence by moving the furniture and the firearms. She said she normally keeps the guns between her mattress and box spring, Brown testified.\nFortson said she lied, because she \"was scared and she didn't want to get into trouble,\" according to the detective's testimony.\nBrown said the reckless conduct charge is based on the fact that the the weapons were \"readily accessible\" to the children.\nFortson, who police said is pregnant, didn't testify in court.\n---Sarah is a crime and safety reporter at The Ledger-Enquirer. You can contact her on Twitter at @SarahR_92."}