{"uri": "http://www.mysanantonio.com/news/local/crime/article/Police-Two-children-7-and-5-on-life-support-7959803.php", "title": "Police: One of two girls, 7 and 5, critically shot Wednesday has died in San Antonio", "dct": "Thu, 02 Jun 2016 00:00:00 GMT", "id": "be142c0a4cc8daa3d5ab6f7e6e55c36c", "content": "SAN ANTONIO — One of two children under the age of eight critically wounded in two separate shootings late Wednesday night has died, according to a release from the San Antonio Police Department.\nA bullet struck a 7-year-old girl, Iris Rodriguez, in the back of the head as she walked with her family in the 5500 block of San Fernando Street on the West Side after 10 p.m. She was taken to the hospital in critical condition and pronounced dead about 6 p.m. Thursday.\nThe family of three was walking away from Cuellar Park near Don Jose just after 10 p.m. when two people shot at them, according to the San Antonio Police Department.\nThe girl’s mother was also hit in the arm, police said.\nOfficers said both victims were taken to University Hospital, and noted that the girl was unresponsive when officers arrived.\nInvestigators said there had been a fight on the basketball court at Cuellar Park, but it was not clear if the family of three was involved.\nNeighbor Rosario Pagan heard the shots and saw the family in the street.\n\"I heard the gunshot and asked myself 'Is that what I heard?'\" she said.\nThe mother, believed to be in her 20s, was cradling her daughter, Pagan recalled seeing. She said she saw the girl drifting in and out of consciousness.\n\"It's terrible to see something like that,\" Pagan said. \"She's just an innocent child; she was just a baby. It's horrifying to see.\"\nRELATED: Police release photo of person of interest in stabbing death of 11-year-old Josue Flores\nAbout an hour after that incident, another bullet struck a 5-year-old girl who was sleeping in a front bedroom of her East Side home in the 800 block of Pecan Valley after two gunmen opened fire outside.\nPolice said that two men backed into the driveway of the home and began arguing with a man who came outside thinking they hit his car.\nBoth men pulled out handguns and fired several rounds, striking both the man and the house behind him, according to SAPD.\nOne bullet entered the house and hit the child in the head.\nThe suspects took off after the shooting, but were later spotted in a vehicle by patrol officers, who chased them until they crashed in the 400 block of Briarglen.\nOne of the suspects was immediately detained by authorities, while a second was found by a K-9 unit about an hour after the incident, according to police.\nThe first suspect, identified by police as Murjan Issack Abdi, 20, was booked on a charge of aggravated robbery and an unrelated outstanding warrant. It is unclear whether the other has been charged.\nPolice confirmed Thursday afternoon that both children were on life support, along with the man who was shot on Pecan Valley.\nThe woman who was shot on San Fernando was listed in stable condition.\nTwitter: @MDWilsonSA"}