{"uri": "http://triblive.com/news/allegheny/10688717-74/rifle-caliber-shelton", "title": "Gun theft investigation may yield link to Wilkinsburg massacre", "dct": "Fri, 24 Jun 2016 11:00:00 GMT", "id": "09dc1f11cd1bac24edb9ab1b877a7f12", "content": "With the two weapons believed used in the Wilkinsburg massacre still missing, authorities are trying to determine whether a pistol stolen in Fayette County last year is connected to the case.\nPennsylvania State Police in Uniontown have released to the Tribune-Review a list of firearms and ammunition allegedly stolen June 14, 2015, from a house along Mayflower Drive in South Union. It included a .40-caliber Heckler & Koch M&P pistol.\nAuthorities suspect that Robert “Milhouse” Thomas, 27, kicked off the March 9 backyard ambush by firing four shots with a .40-caliber pistol into LaMont Powell. Allegheny County police detectives say Powell, 24, whose street name is “Murder,” was the apparent target of the slaughter.\nPowell survived, but detectives say the second shooter, Cheron “C-Wiz” Shelton, 29, opened fire on the more than 20 panicked picnickers fleeing toward the house and him with a semi-automatic rifle that resembled an AK-47. Shelton killed five adults and an unborn child in one of the worst episodes of gun violence in Allegheny County history. Four of the adults were Powell's relatives.\nDetectives strongly believe Shelton is linked to the Fayette County gun heist.\nOn March 12, detectives serving a search warrant on Shelton's childhood home on Nolan Court in Pittsburgh Housing Authority's Homewood North public housing complex found a semi-automatic Colt rifle designed to resemble the M-4 military carbine.\nShelton allegedly had left a partial thumbprint on the rifle. The weapon's serial number was that of a rifle stolen from the South Union gun collection.\nDetectives also seized from Shelton's apartment ammunition magazines and drums that contained .22-caliber and 7.62 mm-caliber rounds, a drum of 12-gauge shotgun shells, a bulletproof vest, and a black bag containing miscellaneous live rounds, a rifle scope and gun parts.\nBesides the recovered Colt .22-caliber rifle and the still-missing .40-caliber pistol, the Fayette County burglary included:\n• A Remington 870 Tactical ATC-S 12-gauge shotgun with pistol grip\n• A Mossberg MVP .223-caliber Patriot rifle\n• A Ruger LCR .38-caliber pistol\nThe rifle Shelton allegedly wielded shot 7.62 mm rounds — similar to those recovered in the Nolan Court search.\nBallistic tests tracked the gun to a semi-automatic rifle that resembled an AK-47. It had been used previously in the 2011 New Year's Eve slaying of Donald Russell, 23, in Pittsburgh's Arlington neighborhood.\nDana Javon Johnson was found guilty of first-degree homicide in that case, though the weapon was never recovered.\nThe federal Bureau of Alcohol, Tobacco, Firearms and Explosives' Philadelphia field office didn't return several calls from the Tribune-Review. ATF is still offering a $20,000 reward for any information that helps authorities prosecute those responsible for the Wilkinsburg killings.\nState troopers urge anyone who has any information about the 2015 burglary — including the whereabouts of any of the missing firearms — to contact the Uniontown barracks at 724-439-7111.\nCarl Prine is an investigative reporter for the Tribune-Review. Reach him at cprine@tribweb.com or 412-320-7826."}