{"uri": "http://www.wtae.com/news/death-penalty-sought-in-wilkinsburg-cookout-ambush-that-killed-5-unborn-child/41398382", "title": "Death penalty sought in Wilkinsburg cookout ambush that killed 5, unborn child", "dct": "Sat, 27 Aug 2016 16:55:00 GMT", "id": "2b28283fc0f3932d9e98ca1b2380c665", "content": "PITTSBURGH —\nProsecutors say they plan to seek the death penalty against two men charged in an ambush at a cookout that killed five adults and an unborn child.\nThe Allegheny County district attorneys' office filed notice Friday that it would seek capital punishment if Cheron Shelton, 29, and Robert Thomas, 27, are convicted of first-degree murder.\nProsecutors said the death penalty would be warranted because of the defendants' previous convictions, the multiple felonies alleged and the grave risk posed to others.\nDefense attorneys say the men are innocent. Shelton's lawyer, Randall McKinney, called the decision to seek capital punishment \"disheartening,\" but said it didn't shake his belief that his client's name will be cleared at trial.\nThe men are each charged with six counts of criminal homicide in the March 9 cookout in Wilkinsburg, a suburb of Pittsburgh. Prosecutors suspect a man wounded at the cookout had killed Shelton's best friend in 2013, and they are looking for that man.\nProsecutors allege Thomas fired 18 shots from a .40-caliber pistol into a group of about 15 partygoers, prompting them to run toward a rear porch where authorities say Shelton was hiding behind a fence. Prosecutors allege Shelton peppered the fleeing crowd from 5-feet away with 30 shots from a rifle similar to an AK-47.\nBrittany Powell, 27, who was renting the home, was killed as were her siblings Chanetta Powell, 25, and Jerry Shelton, 35. The county medical examiner ruled Chanetta Powell's unborn son died because of her death. The siblings' cousin, Tina Shelton, 37, and their friend, Shada Mahone, 26, also died in the attack.\nThe two men also face charges of criminal conspiracy, aggravated assault and reckless endangerment. Authorities say bullets pierced the walls of the residence, wounding three other people. Three children were in the house at the time but unharmed."}