{"uri": "http://pittsburgh.cbslocal.com/2016/04/08/report-police-find-possible-getaway-car-used-in-wilkinsburg-mass-shooting/", "title": "Report: Police Find Possible Getaway Car Used In Wilkinsburg Mass Shooting", "dct": "Fri, 08 Apr 2016 12:30:00 GMT", "id": "40fb395c9b7ef53ef21923bf65600ec1", "content": "PITTSBURGH (KDKA) – Investigators looking into last month’s ambush shooting in Wilkinsburg are making progress in the case.\nAccording to our news partners at the Pittsburgh Post-Gazette, police found a possible getaway car and collected DNA samples from at least two people.\nWhile no one has been arrested, police have someone who is considered to be a suspect in the case.\nOn Thursday, Robert Thomas, 27, was in court for a bond hearing on unrelated charges.\nA detective testified that Thomas has been informed that he’s a suspect in the Wilkinsburg shootings, and was a flight risk.\nThe judge revoked Thomas’ bond, and said he was a danger to the community.\nEarlier this week, Thomas, 27, and three others were arrested on various charges, including possession of narcotics with intent to deliver and receiving stolen property in the form of firearms.\nThe bond hearing directly involved the drug and weapons case in which Thomas is accused of having access to both heroin and six weapons, including an assault weapon.\nThomas is among four people questioned this week about the Wilkinsburg shootings, including Cheron Shelton, 29, who was questioned a week ago and again this week.\nPolice went to an apartment in Wilkinsburg to serve some warrants, including one for Shelton.\nWhen they went inside the home and searched the residence, they found various guns in the front bedroom including an assault rifle, various handguns and a revolver. They also found ammunition.\nIn the middle living room, police say they found $8,402 in cash and a prescription. In the kitchen, police found heroin and drug paraphernalia.\nAt the end of March, Shelton was arrested for charges stemming from a March 12 search of a home in Homewood in which weapons and ammunition were seized.\nPolice have not called Shelton a suspect in the Wilkinsburg case, but are still investigating whether or not he’s connected.\nFive adults and an unborn child were killed back on March 9.\nStay With KDKA.com For More Details"}