{"uri": "http://www.post-gazette.com/local/east/2016/06/25/Wilkinsburg-mass-shooting-survivor-reflects-on-moment-that-left-him-paralyzed/stories/201606250052", "title": "Wilkinsburg mass shooting survivor reflects on moment that left him paralyzed", "dct": "Sat, 25 Jun 2016 00:11:00 GMT", "id": "c6fec4cba39b294497b59c96ae37267a", "content": "There are a lot of things that still don’t make sense more than three months after John Ellis was paralyzed in a Wilkinsburg mass shooting.\nWhy did so many people have to die? What happened during the moments he doesn’t remember?\nPerhaps most baffling: Could one of the suspects have been friends with one of the victims?\n“I wouldn’t think one of my homies would come and shoot up a cookout I’m at,” Ellis said Friday, propped up in the basement of his parents’ Pittsburgh home.\nEllis, 47, learned from reporters Thursday that police had arrested Cheron Shelton, 29, of Lincoln-Lemington, and Robert Thomas, 27, of Homewood, in the March 9 shooting that left five adults and an unborn child dead. Three others, including Ellis, were injured.\nPlay Video\nPlay\nMute\nCurrent Time 0:00\n/\nDuration Time 0:00\nLoaded: 0%\n0:00\nProgress: 0%\n0:00\nProgress: 0%\nStream TypeLIVE\nRemaining Time -0:00\nPlayback Rate\n1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptions\nAudio Track\nFullscreen\nThis is a modal window.\nCaption Settings Dialog\nBeginning of dialog window. Escape will cancel and close the window.\nTextColorWhiteBlackRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentBackgroundColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentTransparentWindowColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyTransparentSemi-TransparentOpaque\nFont Size50%75%100%125%150%175%200%300%400%\nText Edge StyleNoneRaisedDepressedUniformDropshadow\nFont FamilyProportional Sans-SerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall Caps\nDefaultsDone\nShelton and Thomas are being held in the Allegheny County Jail without bail while they await a hearing on charges of homicide, conspiracy and other crimes.\nEllis said he’d lived next door to the home where the shooting occurred for more than a year and, during that time, came to know some of the people who lived there. He said he saw photos online prior to the shooting that included Shelton and one of the women who died that night.\nHe hopes the detectives charged the right people. If they didn’t, “I feel sorry for the two that they got because they’ve gotta spend the rest of their life in jail now,” Ellis said, adding that he planned to attend every court hearing so they see him in his wheelchair.\nOfficials have said they suspect Shelton and Thomas targeted surviving victim Lamont Powell, 24, who was a suspect in the 2013 killing of Shelton’s friend Calvin Doswell. The Doswell case remains unsolved.\nCourt records indicate that Shelton and Thomas spent part of that day communicating with each other via text or phone calls. At some point, police said, they received a call from someone who saw an online photo from the cookout and noticed Powell was there.\nEllis wasn’t even thinking about the cookout.\n“I was making plans on going down to my friend’s house,” he said.\nHis roommates went next door to join in the fun, and Ellis told them to take over some food to put on the grill. He joined them between 7:30 and 8 p.m.\nHe shared his music, which played in the background. He had a Hennessy, the drink of choice at the party, and then switched to beer, which he prefers.\n“After a couple drinks, I was somewhere else,” he said. “I didn’t even know I got shot, that’s how much drinks I was drinking.”\nEllis’ friends told him he was sitting in a chair when the first shot hit him shortly before 11 p.m. He felt the second one.\n“I got up and ran. I fell on the side of the house. As I laid there, I played like I was dead. I was not moving no more after them gunshots.”\nThe next thing he remembers is that a police officer found him lying on the ground. A medical crew took him to UPMC Presbyterian, where he remained until early May.\nAlmost everything is different now. He used to be able to walk places. He used to have girlfriends. Now, he’s paralyzed from the waist down.\nHe spends most of his days with his parents. Nurses or physical therapists sometimes visit. The doctors told him they doubt he’ll walk again.\n“They said I’m not, but in my mind, I’m going to.”\nLiz Navratil: lnavratil@post-gazette.com, 412-263-1438 or on Twitter @LizNavratil."}