{"uri": "http://triblive.com/news/adminpage/10210773-74/powell-chanetta-police?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29", "title": "Man wounded in Wilkinsburg mass shooting arrested after release from hospital", "dct": "Sat, 26 Mar 2016 09:06:00 GMT", "id": "fc62d25c2e40b8785166374c752d0380", "content": "One of the surviving victims of the mass shooting this month in Wilkinsburg was released from the hospital last week and promptly arrested on an outstanding warrant.\nLamont Powell, 24, was badly wounded in the March 9 ambush that killed six people: three of his siblings, an unborn nephew, a cousin and a close family friend.\nTwo others were wounded when at least two gunmen attacked the backyard barbecue on Franklin Avenue.\nAllegheny County spokeswoman Amie Downs declined to say when Powell was released from the hospital but said he'd been at the Allegheny County Jail on Friday on a warrant related to a December assault on an Indiana County man at his sister Chanetta Powell's home.\nChanetta Powell, 25, was killed in the March 9 shooting, along with her unborn child; Jerry Shelton, 35; Tina Shelton, 37; Brittany Powell, 27; and Shada Mahone, 26.\nCourt records show Lamont Powell posted $30,000 bond Friday and was released the same day. He did not have an attorney listed. He is scheduled for a preliminary hearing April 7.\nAccording to the criminal complaint, police went to Chanetta Powell's Marshall-Shadeland home the morning of Dec. 5 for a report of domestic violence and found Daniel Coates with a cut on his forehead and blood running down his face.\nCoates told police he was there to pick up the child he had with Chanetta Powell when they got into an argument. Lamont Powell came downstairs with a pistol, yelled at Coates to leave, then pointed the firearm at him and forced him to his knees before punching and kicking him in the face, the complaint said.\nCoates told the Tribune-Review on March 11 that he hardly knew Chanetta's brother or the rest of the family.\nLamont Powell was not there when police arrived; Pittsburgh police obtained a warrant for him on one charge each of aggravated and simple assault.\nCheron Shelton, 29, of Homewood North has been questioned about the shooting but hasn't been charged.\nMatthew Santoni is a staff writer for Trib Total Media. He can be reached at 412 380 5625 or msantoni@tribweb.com."}