{"uri": "http://www.dnainfo.com/chicago/20140728/east-garfield-park/fight-before-summer-school-may-have-led-shooting-death-of-13-year-old", "title": "Fight Before Summer School May Have Led to Shooting Death of 13-Year-Old", "dct": "Mon, 28 Jul 2014 14:02:00 GMT", "id": "211dc2237f8dc945c7a7cf68ce65569b", "content": "BRIDGEPORT — A shooting that left a 13-year-old boy dead and six others wounded over the weekend may have stemmed from a summer school fight, Chicago Police Supt. Garry McCarthy said Monday.\nThe apparently gang-related shooting happened about 6 p.m. Friday in the 700 block of South California Avenue in East Garfield Park, police said.\nSamuel Walker, 13, of the 3000 block of West Flourney Street was pronounced dead on the scene at 6:22 p.m., according to the Cook County Medical Examiner's Office.\nFive other shooting victims — including three 14-year-olds and a 15-year-old — were hospitalized with gunshot wounds.\nMcCarthy said the shooting may have been linked to a fight the teens got into on their way to summer school, and that police have video footage that could help them. Several people also witnessed the shooting that was done \"in the light of day\" and their recounts are helping the case progress quickly, he added.\n\"We actually have parts of the incident that were recorded on video not the actual shooting, but we do have some video evidence that's going to help us in the investigation,\" McCarthy said.\nThe shooting came less than a week after 11-year-old Shamiya Adams was killed by a stray bullet that shot through the window of a friend's home during a sleepover, and two days after Darren Foggey, 16, was fatally shot through a window while sitting with a friend.\nDarren's death was the result of a neighborhood dispute, according to reports. Shamiya was killed after an alleged gang member, Tevin Lee, 18, shot at a crowd in retaliation for an earlier fight between two 14-year-olds, police said.\nIn announcing charges against Lee Thursday, Chicago Police Supt. Garry McCarthy decried the easy access to guns that exists in Chicago.\n\"And now we have another child murdered,\" McCarthy said. \"At the end of the day, you introduce a gun into a fistfight and this is what happens.\""}