{"uri": "http://www.denverpost.com/news/ci_28878448/mesa-county-prosecutors-charge-hunter-14-year-olds", "title": "Mesa County prosecutors charge hunter in shooting death of 14-year-old boy", "dct": "Fri, 25 Sep 2015 08:12:00 GMT", "id": "ca4c1d836df0aacb8933292f3c3bf590", "content": "Mesa County prosecutors Friday filed felony charges against a man who authorities say fatally shot a 14-year-old boy this month while hunting on national forest land in western Colorado.\nGuy Pohto, 59, faces allegations of reckless manslaughter and carelessly hunting wildlife, said Dan Rubinstein, a county prosecutor. Pohto will be issued a felony summons and is due in court Oct. 22.\nJustin Burns, of Palisade, died Sept. 13 of a gunshot wound to his chest at Big Creek Reservoir in the Uncompahgre National Forest, the county coroner’s office said. Justin was bow hunting with his father when he was shot, the sheriff’s office said.\nJustin’s death has been ruled a homicide.\nAuthorities say Pohto was a licensed hunter.\nArchery and muzzleloader season for various big game was in effect in Colorado at the time of the shooting. Bear rifle season also was active across the state.\n“Justin was an avid outdoorsman who loved nothing more than spending his time in the mountains with nature and his family,” his obituary says. “He loved hunting, hiking, camping, fishing and 4-wheeling.”\nThe teen was a student at Palisade High School. Justin is survived by his brother, sister and parents.\nRecreational shooting on national forest land in Colorado has come under intense scrutiny since the July slaying of Glenn Martin, 60, who was shot by an apparently errant bullet in the Pike National Forest.\nFamily said Martin was waiting to roast marshmallows with his grandchildren when he was struck.\nThe Forest Service has introduced a plan for the Arapaho and Roosevelt national forests that it hopes will cut down on the mounting tension between shooters and other recreationists. Affected lands would span Boulder, Grand, Clear Creek, Gilpin, Jefferson, Larimer and Park counties. Implementation is slated for late 2016.\nThe proposal aims to eliminate shooting on lands that are less than a half-mile from homes or in areas of highly concentrated recreational use. It also calls for at least one designated shooting range in each of the seven counties where the forests lie.\nJesse Paul: 303-954-1733, jpaul@denverpost.com or @JesseAPaul"}