{"uri": "http://abc11.com/news/charleston-sc-police-respond-to-shooting-at-church/791511/", "title": "Charleston church shooting suspect caught in North Carolina", "dct": "Thu, 18 Jun 2015 00:00:00 GMT", "id": "6122ee497aa944ba2c593a4b0c55b1f5", "content": "CHARLESTON, S.C. (WTVD) --\nCharleston church shooting suspect Dylann Storm Roof was captured in Shelby, North Carolina in a traffic stop Thursday morning. Officials said he put up no resistance when he was pulled over.\n\"I can confirm that there is a subject in custody in relation to the shootings in Charleston from last evening,\" U.S. Attorney General Loretta Lynch said at a news conference. \"And, of course, this moves us into a different phase of the investigation, which will be pursued as vigorously and with as complete cooperation as the apprehension of this individual.\"\nPolice said Roof, 21, was arrested about 250 miles north of Charleston. A citizen saw the suspect's car and reported it to police, who responded and made the arrest. Roof cooperated with the officer who stopped him, according to police.\nHe waived an extradition hearing and was taken back to South Carolina via plane. Roof also waived his right to counsel, meaning he will either represent himself or hire his own lawyer. He is expected in court Friday at 2 p.m.\nRAW VIDEO: Accused shooter in custody\nOfficials said they believe Roof acted alone. They did not discuss a motive.\n\"I am so pleased we were able to resolve this case quickly,\" Charleston Police Chief Gregory Mullen said at a news conference.\nInvestigators said Roof opened fire during a prayer meeting inside a historic black church in downtown Charleston on Wednesday night, killing nine people, including the pastor, in an assault that authorities described as a hate crime.\nIn a statement Thursday afternoon, President Obama identified the pastor as South Carolina State Senator Clementa Pinckney, who he said he knew along with other members of the congregation.\n\"To say our thoughts and prayers are with them and their families and their community doesn't say enough to convey the heartache, and sadness, and the anger that we feel,\" said Obama.\nRAW VIDEO: President Obama speaks about church shootings\nThis shooting \"should be a warning to us all that we do have a problem in our society,\" said state Rep. Wendell Gilliard, a Democrat whose district includes the church. \"There's a race problem in our country. There's a gun problem in our country. We need to act on them quickly.\"\nObama spoke to this, saying that \"at some point, we as a country will have to reckon with the fact that this type of mass violence does not happen in other advanced countries.\"\nPinckney 41, was a married father of two who was elected to the state house at age 23, making him the youngest member of the State House at the time.\nRelated: Remembering the victims\n\"He never had anything bad to say about anybody, even when I thought he should,\" State House Minority leader Todd Rutherford, D-Columbia, said. \"He was always out doing work either for his parishioners or his constituents. He touched everybody.\"\nThe other victims were identified as Cynthia Hurd, 54; Tywanza Sanders, 26; the Rev. Sharonda Singleton, 45; Myra Thompson, 59; Ethel Lance, 70; Susie Jackson, 87; the Rev. Daniel Simmons Sr., 74; and DePayne Doctor, 49.\nMullen said Roof attended a meeting at the Emanuel AME Church and stayed for almost an hour before gunfire erupted.\nPHOTOS: 9 dead after Charleston church shooting\nCharleston Mayor Joseph P. Riley called the shooting \"the most unspeakable and heartbreaking tragedy.\"\n\"The only reason that someone could walk into a church and shoot people praying is out of hate,\" Riley said. \"It is the most dastardly act that one could possibly imagine, and we will bring that person to justice... This is one hateful person.\"\nA friend of Roof said Roof told him a few weeks ago he had \"a plan.\"\nJoseph Meek Jr. said he was drinking vodka with Roof when Roof made the remark while he was railing against blacks.\nRoof didn't elaborate on the plan, but Meek said he was worried. He said he knew his friend had a \"Glock\" - a .45 caliber pistol - in the trunk of his car.\nMeek said Roof told him he bought the gun with money he got from his parents for his birthday.\nWith the way Roof was carrying on, Meek said he took the gun from the trunk of Roof's car and hid it in his house, just in case.\n\"I didn't think he would do anything,\" he said.\nBut the next day, when Roof was sober, he gave it back.\nMeek's brother, Jacob, said he recalled something else. As they were driving to a lake on Wednesday, Roof said he should be careful moving his backpack in the car because of the \"magazines.\"\nBut Jacob said he thought Roof was referring to periodicals - instead of a device that stores ammunition.\n\"Now it all makes sense,\" he said.\nRoof wasn't known to the Southern Poverty Law Center in Montgomery, Alabama, and it's not clear whether he had any connection to the 16 white supremacist organizations operating in South Carolina, but he appears to be a \"disaffected white supremacist,\" based on his Facebook page, said the center's president, Richard Cohen.\nRoof had been to jail: State court records show a pending felony drug case against him, and a past misdemeanor trespassing charge.\nRoof displayed a Confederate flag on his license plate, Konzny said, and in a photo on his Facebook page, he was wearing a jacket with stitched-on flag patches from two other defeated white-ruled regimes: Rhodesia and apartheid-era South Africa.\nThe attack came two months after the fatal shooting of an unarmed black man, Walter Scott, by a white police officer in neighboring North Charleston that sparked major protests and highlighted racial tensions in the area. The officer has been charged with murder, and the shooting prompted South Carolina lawmakers to push through a bill helping all police agencies in the state get body cameras. Pinckney was a sponsor of that bill.\nIn a statement, Gov. Nikki Haley asked South Carolinians to pray for the victims and their families and decried violence at religious institutions.\n\"We'll never understand what motivates anyone to enter one of our places of worship and take the life of another,\" Haley said.\nSoon after Wednesday night's shooting, a group of pastors huddled together praying in a circle across the street.\nCommunity organizer Christopher Cason said he felt certain the shootings were racially motivated.\n\"I am very tired of people telling me that I don't have the right to be angry,\" Cason said. \"I am very angry right now.\"\nEven before Scott's shooting in April, Cason said he had been part of a group meeting with police and local leaders to try to shore up relations.\nThe Emanuel AME church is a historic African-American church that traces its roots to 1816, when several churches split from Charleston's Methodist Episcopal church.\nOne of its founders, Denmark Vesey, tried to organize a slave revolt in 1822. He was caught, and white landowners had his church burned in revenge. Parishioners worshipped underground until after the Civil War.\nRelated stories\nReport a Typo"}