{"uri": "http://www.lbreport.com/news/sep13/187nlbros.htm", "title": "UPDATE: Two Men Killed In NLB Quadruple Shooting (6500 block Rose) Are Identified; Two Women Wounded Are In Serious But Stable Condition; LBPD Says They Were At Birthday Celebration When Suspect Approached On Foot And Shot At Them", "dct": "NODATE", "id": "5aa76803f0dda05656d350a513093e41", "content": "(Sept. 21, 2013, 5:02 p.m.) -- In an updated release, LBPD says the four victims in last night's (Sept. 20) NLB shooting (6500 block Rose Ave.) were with friends celebrating a birthday when a suspect approached on foot and shot at them while they were sitting in an alcove beside the home.\nLBPD's updated release identifies the two deceased victims as Sophon Kao, 26 and Jerry Chim, 24, both of Long Beach. Two women (adults) wounded in the shooting survived; they are reported in \"serious but stable condition.\" [LBPD isn't releasing their identities; they are surviving victims of a violent crime.]\nThere's no suspect information at this point. Below is the text of LBPD's updated release. LBREPORT.com will update this story as we learn more.\nOn September 20, 2013, at approximately 9:54 PM, Long Beach Police Officers were dispatched to a report of gunshots in the 6500 block of Rose Avenue.\nOfficers arrived and discovered two male adult victims. The male victims had apparent gunshots wounds to the torso and died at the scene. Two female adult victims also had apparent gunshot wounds to the torso and were transported to a local hospital. The female vicitms are in serious but stable condition.\nThe deceased male victims have been identified as 26 year-old Sophon Kao and 24 year-old Jerry Chim. Both victims are residents of Long Beach. The surviving adult female victims' identities will not be released.\nThe investigaion reavealed the victims were with a small group of friends celebrating a birthday. The suspect approached on foot and shot at the victims who were sitting in an alcove beside the home. Reports of an involved vehicle have not been confirmed.\nIf you have information regarding this incident, please call Homicide Detectives Mark McGuire and Greg Krabbe at 562 570-7244.\nAnonymous tips may be submitted by calling 1-800-222-TIPS (8477), texting TIPLA plus your tip to CRIMES (274637), or visiting www.lacrimestoppers.org.\n(Sept. 21, 2013, 8:30 a.m.) -- LBPD has issued a release on last night's four-victim shooting in NLB that left two men dead and two women wounded:\nOn September 20, 2013, at approximately 9:54 p.m., Long Beach Police Officers were dispatched to a report of gunshots in the 6500 block of Rose Avenue.\nOfficers arrived and discovered two male adult victims. The victims had apparent gunshots wounds and died at the scene before officers arrived. Two female adult gunshot victims were transported to a local hospital.\nThe Los Angeles County Coroner's Office will confirm the victims' identities. If you have information regarding this incident, please call Homicide Detectives Mark McGuire and Greg Krabbe at 562 570-7244.\nAnonymous tips may be submitted by calling 1-800-222-TIPS (8477), texting TIPLA plus your tip to CRIMES (274637), or visiting www.lacrimestoppers.org.\n(Sept. 21, 2013, 12:45 a.m.) -- LBRPEPORT.com has learned (very early information) that FOUR people were shot at a single NLB crime scene in the 6500 block of Rose Ave. on Friday night (Sept. 20). Two of the victims were pronounced dead at the scene and two others were transported to a hospital.\nInitial information is very sketchy. LBPD Public Information Officer Sgt. David Marander says that at about 9:54 PM, officers responded to a shots call in the 6500 block of Rose Ave.\nTwo victims were found shot and deceased at the scene. Two other gunshot victims were transported to a local hospital.\nThis story will be updated with further information as we learn it on LBREPORT.com\nSponsored Links\n.\nPrimal Plants Supplement - Gundry MDThis Simple Skin Fix May Surprise YouPrimal Plants Supplement - Gundry MD\nHome Solar QuotesThinking About Going Solar In 2017? Read This FirstHome Solar Quotes\nEnergy Bill Cruncher QuotesWill Trump Urge Homeowners To Go Solar in 2017.Energy Bill Cruncher Quotes\nOil Change OffersOil Change Keeps Your Car Running Smoohtly. Get Your Deal Now.Oil Change Offers\nTophatterThe Most Addicting Shopping Site For WomenTophatter\nTruthFinder People Search SubscriptionIt's Scary What This Site Knows About You, Enter Your NameTruthFinder People Search Subscription"}