{"uri": "http://www.jsonline.com/news/regional-news-briefs-b9924216z1-209817861.html", "title": "Quadruple shooting under investigation", "dct": "Sat, 01 Jun 2013 00:00:00 GMT", "id": "d6d9cc415f4876aab76b89dffaea6cc9", "content": "Milwaukee police are investigating a quadruple shooting in the 4100 block of N. Teutonia Ave., police said Saturday.\nThe four victims have been hospitalized for non-life threatening injuries, Capt. Donald Gaglione said. The motive for the shooting is under investigation, he said.\nThe incident happened overnight Friday into Saturday. A news release from Milwaukee police did not indicate a specific time of the shooting.\nLake Superior water level jumps in May\nA new report says the level of Lake Superior has made a big jump.\nThe International Lake Superior Board of Control reported Friday that the level of Lake Superior jumped 9 inches in May. That's more than twice the normal monthly increase and the second most for any month since 1918.\nLake Superior usually rises only about 4 inches each May. But thanks to late snow and a cold spring that held back runoff, May more than made up for the difference.\nThe lake now sits just 7 inches below its long-term average for June 1. It is a full 3 inches above the level at this time last year.\nThe Duluth News Tribune reports Lakes Huron and Michigan also continued their rise from near-record lows in late winter.\nDeath of toddler probed in West Allis\nWest Allis police late Saturday were investigating the death of a 21-month-old child.\nPolice were called to a mobile home in the 10300 block of W. Greenfield Ave. at 4:15 p.m. for an unresponsive child.\nAttempts to resuscitate the child were unsuccessful.\nPolice and the Milwaukee County medical examiner's office are investigating.\nNo other details were provided.\nPolice arrest man for making threat\nA 39-year-old man accused of making a threat to a Greenfield resident was taken into custody Saturday by Oak Creek police.\nThe alleged threat was made about 10 a.m. Police said the man ran into a residence in the 2100 block of W. College Ave. and refused to comply with orders from Oak Creek police officers.\nAfter contacting the man on the phone, officers persuaded him to come out of the house.\nHe was taken into custody and will be medically evaluated, police said.\nThe Milwaukee County district attorney's office will review the case to determine if charges are warranted.\nFree swim lessons offered at Wilson Park\nThe Milwaukee County Park System and the Southwest Aquatic Team's Swim America Program are offering free Milwaukee County pool open swim summer passes for the first 200 swimmers who register for lessons at the Wilson Park Pool, near W. Howard Ave. and S. 25th St. in Milwaukee.\nThose who sign up will also get a free swimming cap and a free pair of goggles.\nDale Schrank, the program's director, said he hopes the lessons at Wilson Park Pool will encourage minority youths to learn swimming, as African-Americans and Hispanics are disproportionately represented in drowning deaths. He said Swim America would like to offer lessons at more locations attracting minorities.\nParents who would like to register their children can send checks to SWAT Swim America, P.O. Box 138, Muskego, WI 53150. Alternatively, they can register in person on June 4 or June 6 at the Wilson Park and Recreation Center from 5:30 to 7:00 p.m. For more information on the lessons, email swatt@execpc.com or call (262) 971-1658.\nIllinois firm to provide cream puff ingredient\nWisconsin State Fair-goers may be surprised to learn the main ingredient in a favorite fair treat no longer comes from the dairy state.\nThe Wisconsin Bakers' Association has turned to an Illinois company to provide the cream that makes the fair's cream puffs so popular. Prairie Farms Dairy of Carlinville, Ill., won a contract to supply the cream after Golden Guernsey went out of business in Wisconsin.\nThe Bakers' Association found no Wisconsin company could handle the daily demand of 1,200 gallons of cream.\nState Fair spokeswoman Kristi Chuckel told WISN-TV that Prairie Farms has pledged to work with Wisconsin dairy farms to supply the cream. But, for fairgoer Jeff Fink, it just leaves a bad taste in his mouth.\nFink equates it to the Packers moving to Illinois. He says \"there's something just not right about it.\"\nTraffic stop reveals heroin, drugs in car\nA Milwaukee woman faces felony drug charges after her car was stopped for a traffic violation in Racine County, where police say they found marijuana, pills and about $4,500 worth of heroin in her car.\nThe 27-year-old woman — who was a passenger in her vehicle, being driven by someone else — was not identified in a news release from Racine County Sheriff's Office. She is being held in the Racine County jail on charges of possession of marijuana, possession of a controlled substance and possession of heroin with intent to deliver.\nAccording to the release, a deputy stopped the car on northbound I-94 early Saturday for an unspecified traffic violation. The deputy smelled burned marijuana, searched the vehicle and found the drugs.\nThe driver was not charged and was released.\nDeSoto campsites closed temporarily\nDeSoto — A southwestern Wisconsin park is offering only limited camping this weekend due to minor flooding.\nThe U.S. Army Corps of Engineers said Blackhawk Park near DeSoto has extremely wet conditions.\nIn addition, the Corps will close sites 40 to 73 of the West Loop Camping Area Monday through Thursday to do maintenance work.\nThe Corps said with the flooding and this closure, the number of campsites at Blackhawk Park will be limited. Campers should contact park staff before planning a camping trip.\nThe Corps plans to reopen the West Loop for next weekend and other sites as river levels recede and conditions improve.\nJournal Sentinel staff and wires"}