{"uri": "http://www.courierpress.com/news/crime/police-robbery-attempt-sparked-shootings-that-injured-five-2315a1b2-f470-7b24-e053-0100007f6187-337606071.html", "title": "Police: Robbery attempt sparked shootings that injured five", "dct": "Tue, 27 Oct 2015 00:00:00 GMT", "id": "5b25990ca9e26015ea4d55b763b18dd8", "content": "The chain-reaction incident inside an Evansville apartment building that ended with five people shot started as a robbery attempt gone awry, police said Tuesday morning.\nNone of the injuries sustained Monday appeared to be life-threatening, officials said.\nAmong the five people injured were three of the four men accused of trying to rob an Evansville apartment in the 700 block of East Virginia Street about 8:40 p.m.\nThe group targeted an apartment in the same building as the 711 Tavern. On Tuesday, Evansville Police Department Sgt. Jason Cullum said the group is believed to have targeted the apartment because there were drugs and money inside.\n\"We don't believe that these (four) individuals were randomly targeting anyone and were a threat to the entire community,\" Cullum said. \"They were specifically looking for these individuals and the drugs and the money that were inside that apartment.\"\nThe four men police say were involved in the robbery were identified as Marquell Jackson, 22; Jarvice Sears, 19; Diego Thomas, 21, and Oneil Bruin, 20. All but Jackson suffered gunshot wounds and are currently hospitalized. Jackson and the group's alleged getaway driver, Corey J. Cain, 21, were arrested and taken to jail.\nBoth men face several preliminarily charges including robbery causing serious bodily injury, burglary and criminal recklessness while armed with a deadly weapon. They were each booked into the Vanderburgh County jail early Tuesday and are initially being held without bond, according to online jail records.\nSears was shot in the chest, while Bruin was hit in the lower leg and shoulder, according to police affidavits filed in the case. Diego Thomas was shot in the buttocks.\nCullum said all five men will face the same charges, and the three injured suspects will be arrested once they are released from medical care.\nThe other two men injured Monday night, identified as Logan Orth, 22, and Cameron Kendall, 27, allegedly exchanged gunfire with the group on two separate occasions.\nOrth was one of several people inside the targeted apartment when the group — all of whom were reportedly wore masks and were armed — came in and tried to carry out the robbery, Cullum said.\nNone of the other eight people inside that residence were injured. Orth was visiting the apartment and was not a resident there, Cullum said.\nAccording to the police affidavit, Orth was shot in the neck and the chest after grabbing a gun and firing at the group during the attempted robbery.\nThen, as the group was trying to flee the building, police say the men encountered a neighbor who had opened the door and they shot at him.\nThat man — Kendall — grabbed his own weapon and shot back at the group. Kendall's abdominal wound required surgery, according to investigators.\nPolice said they are unsure who was injured by what gunfire.\nDuring the subsequent investigation into the shootings, police discovered both drugs and money inside the targeted apartment. No arrests have been made in connection with that part of the incident, but the investigation is still ongoing, Cullum said.\n\"We did recover a large amount of cash and drugs from inside the apartment,\" he said.\nCullum said the initial indications are that Kendall acted within his rights as a legal gun owner when he confronted the group. Cullum also said there has no information that links Kendall to possible drug activity inside the neighboring apartment.\n\"His actions are believed to have been justified,\" he said."}