{"uri": "http://www.14news.com/story/30356421/epd-5-hurt-after-shooting-behind-711-tavern", "title": "Third suspect in custody following shooting at Evansville apartment", "dct": "Tue, 27 Oct 2015 02:13:00 GMT", "id": "e5a310b48df1c1d2499f86f08f5cfc0d", "content": "EVANSVILLE, IN (WFIE) -\nA third suspect is in custody following a robbery and shooting that injured five people in Evansville.\n21-year-old Diego Thomas was booked into the Vanderburgh County Jail after he was released from the hospital on Tuesday.\nThomas is facing a long list of charges, including robbery with a deadly weapon.\nThe shooting happened around 8:30 p.m. Monday at an apartment above the 711 Tavern on East Virginia Street.\nWitnesses told police that four armed men wearing masks tried to rob nine people in the apartment.\nOne person in the apartment opened fire on the suspects. He was shot twice, in the neck and chest.\nPolice say, as the suspects were leaving, they fired at a neighbor who had opened his door to see what was going on. The neighbor was shot in the stomach, but was able to return fire.\nThree of the five suspects are now in jail.\nIn addition to Thomas, police have charged 22-year-old Marquell Maurice Jackson and 21-year-old Corey James Cain, both of Evansville. Investigators say Jackson was one of the masked men and Cain was the getaway driver.\nWe're told the other two suspects, 19-year-old Jarvice Sears and 20-year-old Oneil Bruin, will be arrested when they are released from the hospital.\nAccording to the police report, the neighbor who exchanged gunfire with the suspects told officers \"I shot all those m***** f******.\"\nWe're told the neighbor, 27-year-old Cameron Kendall, and the other victim, 22-year-old Logan Orth, are expected to survive.\nInvestigators believe Kendall's actions were justified. They do not anticipate filing any charges.\nPolice say they recovered a large amount of cash and drugs from the scene. They believe the apartment was being used for selling drugs. The investigation into the illegal drug sales is ongoing.\n\"People are tired of their neighborhoods being run by the criminals,” said Sgt. Jason Cullum. “They are tired of seeing their neighbors make life choices that bring the criminal element to them. If these folks aren't selling drugs out of the apartment, these robbers don't show up at the door.\"\nAnyone with information about what happened is asked to call 911 or the WeTip Hotline at (800)-78-CRIME.\nFollow us online at 14NEWS.com and on Twitter. Text NEWSAPP to 51414 or click here to download our 14 News mobile app to get breaking news alerts and the latest headlines from around the Tri-State.\nCopyright 2015 WFIE. All rights reserved."}