{"uri": "https://www.flashalert.net/news.html?id=1095", "title": "Salem Police To Continue Specialized Patrols", "dct": "Tue, 24 Jan 2017 00:00:00 GMT", "id": "369b4873a58744273c3f8d078ed91900", "content": "A woman contacted the Salem Police Department to report she received a telephone call Tuesday morning from someone purporting to be an employee of the Salem Police Department. The caller told the woman she had a warrant for her arrest and unless she made immediate payment, she faced being arrested. The caller had \"spoofed\" a legitimate number for the Willamette Valley Communications Center, the dispatch center for Salem PD. Fortunately the woman called the telephone number listed and spoke with a dispatcher who assured her that it was a scam. The public is reminded that under no circumstances will a law enforcement agency telephone someone and solicit money.\nSalem Police Officer Involved in On-duty Shooting - 01/14/17\n***** UPDATE: January 14, 2017, 8:25 am *****\nThe suspect in last night's officer involved shooting has been identified as 33-year old Casey Duane Howe of Salem. He was transported to a Portland area hospital during the night where he remains in stable condition.\nFurther media releases on this incident will be through the Marion County District Attorney's Office and/or the Oregon State Police.k\n***** UPDATE: January 13, 2017, 11:00 pm *****\nA Salem Police officer was involved in an on-duty shooting at about 7:25 pm on Friday evening, January 13, 2017.\nCorporal Jake Pratt was responding to a report of a wanted person and made contact with a subject on the east side of the Applebee's Restaurant at 2625 Liberty St NE. Preliminary information indicates the suspect was armed with a knife and a confrontation ensued with Cpl Pratt. Cpl Pratt fired his handgun and struck the suspect. A knife was recovered at the scene.\nThe suspect, who is not being identified at this time pending notification of his family, was transported to Salem Health. His current condition is unknown. Cpl Pratt was not injured in the incident and will be placed on administrative leave as common procedure following an incident of this nature.\nThe Salem Police Department has requested the Oregon State Police investigate this incident, and the investigation will continue in conjunction with the Marion County District Attorney's Office as is standard procedure for incidents of this nature.\nFurther information will be released as it becomes available.\nAnyone with information regarding this investigation is asked to call the Oregon State Police at 1-800-452-7888.\nLt Okada will be available at the scene on the west side of the Applebee's restaurant at 11:20 pm.\n***\nA Salem Police Officer has been involved in a shooting on duty. The officer is not injured.\nThe condition of the suspect is not available at this time. More information will be released as it becomes available.\n- 01/11/17\nThe Salem Police Department will be continuing with specialized patrols to target those who are Driving Under The Influence of Intoxicants.\nThe overtime patrols shifts, funded by Oregon Impact, will continue to focus on the very dangerous issue of driving while impaired. During the holiday period between December 15, 2016 and January 2, 2017, officers working on these focused patrols arrested nine people for Driving Under the Influence of Intoxicants and issued one citation for a Minor In Possession of Alcohol. They also issued 49 citations and warnings for other violations.\nAs an agency, Salem Police officers arrested 46 people for Driving Under the Influence of Intoxicants in the month of December, issued 128 citations for Driving With a Suspended License and issued another 1,338 citations and warnings for various other offenses.\nThe Salem Police Department and our partners such as Oregon Impact are committed to keeping our community safe through traffic safety enforcement and education.\n###\nSalem Police Investigating Fatal Crash of Vehicle Into a Residence (Photo) - 01/10/17\nThe Salem Police Department Traffic Control Unit is currently investigating an incident of a vehicle crashing into a residence, leaving a 36-year old mother deceased.\nThe incident occurred at approximately 9:25 pm on January 9, when 54-year old Alan Patrick Jacobs was driving his 2015 Mercedes SUV southbound on Volcano St SE. Volcano St is a steep downhill street that ends at Sussex Ave SE. Sussex Ave runs to the east at that point, forming an L shaped intersection. Jacobs' vehicle continued southbound instead of turning to the east on Sussex, running into and almost completely through the residence at 502 Sussex Ave SE.\nAs Jacobs' vehicle went through the residence, 36-year old Srabonti Haque was asleep in a bedroom of the residence and was struck by the vehicle. She was deceased at the scene. Haque's husband and two young children were also in the residence at the time but were not injured.\nNo arrests have been made at this time and the incident remains under investigation. Anyone with information on this case is asked to call the Salem Police Department Traffic Control Unit.\nPhotos are attached.\nAttached Media Files: photo2.jpg , Photo1.jpg\nSeveral People Struck By Vehicle Following a Disturbance-Suspect Arrested, vehicle still sought - 01/04/17\n*** UPDATE January 4, 2017, 1.40 pm ***\nSalem Police detectives have arrested a suspect in the incident that occurred at 2:15 am on New Year's morning where a suspect struck three people in a north Salem parking lot with a vehicle and fled the scene.\nDetectives contacted and arrested 31-year old Logan Alphonso Boucher of Salem on Tuesday evening. Based on the investigation, he was arrested and lodged in the Marion County Corrections Facility on three counts of Attempted Murder, three counts of Assault in the First Degree and Reckless Driving. He will also be charged with Failure to Register as a Sex Offender.\nAll three victims in this case have since been released from the hospital.\nDetectives are still attempting to locate the vehicle involved in this incident. The vehicle is a black 2005 Audi, Model A4 and may have damage to the front section and windshield areas. Photos of a similar vehicle are attached.\nThe investigation is ongoing, and anyone with information is asked to contact the Salem Police Department.\n***\nThe Salem Police Department responded to a disturbance in the parking lot of Fred Meyer, 2855 Broadway St NE, at about 2:15 AM Sunday morning. The fight had spilled over from the Shack Bar & Grill, 2865 Liberty St NE. One of the persons got into a dark sedan, circled the crowd a couple of times, then drove through the people fighting, striking at least three people.\nSelma Musser, 51 years of age, sustained critical injuries when she was struck. She was transported by medics to Salem Hospital. Two others received less severe injuries when they were struck. They are Christopher Musser Jr., 22 years of age; and Armondo Perez, 22 years of age. All of the victims live in Salem.\nThe suspect vehicle was last seen eastbound through the Fred Meyer parking lot. The Criminal Investigations Section of the Salem Police Department will be continuing the investigation. Anyone with information concerning this crime is asked to telephone the Salem Police Department.\n###\nAttached Media Files: Audi_pics.docx\nSalem Police Welcomes New Deputy Police Chief (Photo) - 01/04/17\nThe Salem Police Department welcomed a new Deputy Police Chief on Tuesday morning during a swearing in ceremony at the Salem Library.\nChief Jerry Moore presided over the ceremony before a room packed with Salem Police personnel, dignitaries from several other police agencies, friends and family of new Deputy Police Chief George Burke.\nDeputy Police Chief Burke began his law enforcement career in 1989 with the Forest Grove Police Department before moving to the Portland Police Bureau in 1992. While at the Portland Police Bureau, he worked in several assignments to include patrol, drugs and vice investigations. He rose to the rank of Commander and was most recently in command of the Portland Police Bureau North Precinct.\nDeputy Police Chief Burke will not be the first member of his family to be a Salem Police Officer, as his son, AJ, is also an officer with the department. Deputy Police Chief Burke will be in command of the Investigations Division of the department.\n###\nAttached Media Files: Burke.jpg\nMan Drowns Attempting to Escape Salem Police - 01/01/17\nAt approximately 12:40 Sunday morning, a Salem Police officer observed a vehicle westbound on Mission St driving at a high rate of speed near Winter St. The officer observed the vehicle turn northbound onto High St SE, then westbound on Oak St SE, then northbound on Liberty St SE. The officer located the vehicle parked in the 500 block of Liberty St SE and initiated a traffic stop. As he was approaching the vehicle on foot, the vehicle took off and crashed at Liberty and Mill St. The driver fled from the vehicle on foot. Officers established a perimeter and began searching for him.\nHe was located in Mill Race near Trade and High St SE hiding under the High St bridge, which has very little vertical clearance. The suspect refused to get out of the water. Officers negotiated with the subject for approximately 20 minutes before he submerged. An officer immediately jumped into the water and pulled him out. Officers began CPR and he was transported to Salem Hospital by medics. He was subsequently pronounced dead at the hospital.\nDetectives with the Oregon State Police Major Crimes Unit were called out to assist in the investigation. An autopsy is planned for Monday at 9:00 AM. The decedent has been identified as 34 year old Christopher Free of Salem. Next of kin have been notified."}