{"uri": "http://www.latimes.com/nation/bs-md-korryn-gaines-tuesday-20160802-story.html", "title": "Woman killed by Baltimore County police ignored pleas from boyfriend to surrender, mother says", "dct": "Tue, 02 Aug 2016 18:01:00 GMT", "id": "f1e9543d785a08824636c576464feb7f", "content": "Baltimore County Police Chief Jim Johnson gives details about the hours-long standoff and eventual shooting between the police and Korryn Gaines on Monday, August 1, 2016. (Kim Hairston & Amy Davis, Baltimore Sun video)\nThe mother of the woman killed during a standoff with Baltimore County police said her daughter ignored pleas from her boyfriend to surrender.\nRhonda Dormeus said she was on a Facebook call Monday with her daughter, Korryn Gaines, 23, as Gaines sat with her 5-year-old son on the floor of her Randallstown apartment with a shotgun in her hands.\n\"I could hear her boyfriend telling her it wasn't worth it, to just come on out,\" said Dormeus, 49.\n\"At that time the phone went dead,\" she said.\nAn hours-long standoff ensued, ending when Gaines was killed by police after she pointed her gun at officers and threatened to kill them, authorities said. Police said an officer fired one shot and missed, prompting Gaines to fire back twice, missing the officers. Police then shot three more times, killing Gaines, police said.\nGaines' son, Kodi, was shot in the arm and is recovering at Johns Hopkins Children's Hospital in good condition, police said Tuesday. Dormeus said Kodi had bullet fragments in his face and damage to his right elbow but is expected to be released Wednesday.\nPolice said they are still investigating whether the boy was shot by the officers or his mother.\nPolice on Tuesday provided additional details about the shooting and the events leading up to it.\nOfficers were attempting to serve two warrants at the apartment in the first block of Sulky Court in Randallstown — one to Gaines for failing to appear in court on a March traffic violation and other charges, and the other to her boyfriend, Kareem Kiean Courtney, 39, who was charged with second-degree assault in connection with an alleged altercation with Gaines on June 28.\nThe following video excerpts depict a confrontation between Baltimore County Police and Korryn Gaines during a traffic stop on March 10, 2016.\nPolice knocked on the door at 9:20 a.m. Monday and announced themselves. After hearing conversations inside, officers then obtained a key from building management. They tried to open the door, but it was secured by a chain. Through the opening, the officers could see Gaines sitting on the floor aiming a Mossberg 12-gauge pistol grip shotgun at them, police said.\nGaines purchased the gun legally last year, police said.\nOfficers then took cover and called in tactical reinforcements and crisis negotiators, police said.\nAbout 25 minutes later, Courtney carried a 1-year-old child out of the apartment, police said. Courtney was arrested and later released on his own recognizance.\nDormeus said she arrived at the scene later but wasn't allowed to speak to Gaines during the negotiations, which she felt would have helped calm her daughter and might have ended the situation peacefully.\n\"I do feel like they didn't want to hurt her,\" Dormeus said. \"But I don't feel like they exhausted all the means of negotiation.\"\nPolice Chief Jim Johnson defended the officers' decision to shoot, saying they were concerned for their own safety and her son's. He did not say whether Gaines had threatened her son.\nThe officers' names have not been released.\nNegotiators described Gaines' demeanor during the standoff as \"up and down, extremely excitable at times, calm at others; and there were periods of silence,\" police said.\nGaines, meanwhile, was shooting cellphone video and posting it to her Facebook and Instagram accounts, police said. During the standoff, Baltimore County police commanders filed a request with Facebook to temporarily deactivate both accounts.\n\"We did in fact reach out to social media authorities to deactivate her account,\" Johnson said, \"in order to preserve the integrity of the negotiation process with her and for the safety of our personnel, her child.\"\nHe said that as Gaines was posting video of the standoff as it unfolded, followers were encouraging her not to acquiesce to negotiators' requests to comply with orders that she surrender peacefully.\nJohnson said the content has not been deleted. He said investigators are in the process of obtaining search warrants for the videos.\n\"We don't have the ability or the authority to deactivate social media accounts on their own,\" he said.\nPolice can make the request to Facebook, which also owns Instagram, during exigent circumstances to deactivate accounts, he said.\nIt took about an hour for the accounts to be deactivated, police said.\nGaines' Instagram account has since been reactivated, and her videos also have been posted by others on other social media sites.\nNone of the officers involved in the shooting were wearing body cameras, the department said. The department launched a body camera program to equip more than 1,400 officers with cameras one month ago. The department has been training and equipping about 10 officers per week.\nPolice said Gaines became angry and irritated as Monday afternoon wore on and hung up the phone on negotiators. The standoff ended in the shootout about 3 p.m., police said.\nPolice released documents Tuesday related to their March 10 traffic stop of Gaines in Randallstown that led to the warrant being served Monday. They also released a copy of the domestic-violence report involving Courtney.\nGaines was stopped when patrol officers noticed a rectangular piece of cardboard with the words \"Free Traveler\" in place of her license plate. Gaines told police she rejected their authority to pull her over and ask her questions, and she repeatedly told them they'd have to \"murder\" her to get her out of the car.\nShe recorded that interaction, and posted it in several videos on her Instagram account.\n\"I promise you, you will have to murder me,\" she told an officer in one of the videos. \"So go ahead and get ready to do that. You will have to kill me.\"\nPolice said another cardboard sign on her car read: \"Any Government official who compromises this pursuit to happiness and right to travel will be held criminally responsible and fined, as this is a natural right or freedom.\"\nGaines' social media posts also showed a deep distrust of government and the police, shaped in part by recent videos of black people being killed in confrontations with police officers.\n\"Don't be afraid,\" she told her son in one of the video clips filmed during the traffic stop. \"You see what they do to us, right? You fight them. They are not for us. They want to kill us, and you never, ever back down from them.\"\nHer mother said Gaines held political views that \"weren't for everybody.\"\n\"Not all of her beliefs I agreed with,\" Dormeus said. \"Her heart was in a good place, she loved her black people, and she just wanted them to see things for what she felt it really was.\"\nShe said her daughter was forthright, outspoken and could split opinions.\n\"She's always been extremely friendly, outgoing,\" Dormeus said. \"I can sum it up like this, either you're going to like her or you wouldn't.\"\nGaines graduated from Baltimore City College in 2010, and attended Morgan State University for the fall semester that year, majoring in political science, officials said.\nIn 2012, Gaines filed a lawsuit in Baltimore alleging lead paint poisoning against the owners of two homes where she lived and frequently visited on West Belvedere Avenue in Central Park Heights, which her attorneys said caused her to have elevated lead levels.\nAs a result of the exposure, her attorneys have argued that she suffered \"neurological impairments\" and lost \"significant IQ points as a result of that exposure.\"\nThe suit, which is pending, seeks $918,000 in damages.\nA report by a pediatrician, which was included in the suit, said \"Korryn had a history of problems with anger and impulsive behavior and had several sessions with her school counselor.\" It also noted Gaines had trouble concentrating in school and still has trouble concentrating.\nThe report by the pediatrician said Gaines dropped out of Morgan State when she got pregnant and was working as a hairdresser to support herself.\nHer father, Ryan Gaines, had worked as a police dispatcher, according to depositions of Gaines' family in the suit. She also has a 32-year-old sister and 26-year-old brother.\nSanchel Brown, 23, said she and Gaines were friends and high school classmates who danced together and were involved in the same extracurricular activities.\n\"She had a huge heart,\" Brown said. \"And she was a woman who just wanted the best for her family and for her children.\"\nNo one answered the door Tuesday at the city address listed for Courtney in court records or at the apartment where the shooting took place.\nBaltimore Sun reporters Kevin Rector, Erica L. Green, Carrie Wells and Maya Earls contributed to this article.\ntwitter.com/cmcampbell6"}