{"uri": "http://www.fox10phoenix.com/arizona-news/31439414-story", "title": "1 dead, 3 wounded in shooting at Northern Arizona University", "dct": "Fri, 09 Oct 2015 11:03:00 GMT", "id": "972b1ad2cc3d41f3a748cfc8fcee55df", "content": "FLAGSTAFF, Ariz. (AP) -- An overnight confrontation between two groups of students escalated into gunfire Friday when a freshman at Northern Arizona University killed one person and wounded three others, authorities said.\nUniversity police chief Gregory T. Fowler identified the shooter as 18-year-old Steven Jones and said he used a handgun in the shootings at about 1:20 a.m. Friday. Jones was booked into jail and charged with one count of 1st degree murder and three counts of aggravated assault.\nJones appeared in court and was arraigned on the charges filed against him. He was tearful when the judge listed each count. Jones was represented by Phoenix attorney Burges McCowan via telephone. A judge set bond at 2 million dollars.\n>>LIVE COVERAGE ON FOX 10 NEWS NOW: https://youtu.be/3mq5hrUDoYo\nThe university in a statement identified the student who died as Colin Brough. The victims being treated at Flagstaff Medical Center are Nicholas Prato, Kyle Zientek and Nicholas Piring. The hospital said it couldn't release any information on conditions.\n\"This is not going to be a normal day at NAU,\" said school President Rita Cheng. \"Our hearts are heavy.\"\nShe called it an isolated and unprecedented incident and said classes would go on as scheduled Friday.\nThe parking lot where the shooting happened is just outside Mountain View Hall dormitory on the Flagstaff campus, which provides housing for many of the campus' sororities and fraternities.\nIowa City, Iowa-based Delta Chi Fraternity said Delta Chi members were involved, but Executive Director Justin Sherman said in the statement that the organization doesn't have detailed information about the identity of the victims.\nAlex McIntosh, a friend of Zientek, said he worked part time at the High Country Conference Center while attending the school full time.\n\"He's very calm, very respectful, has a great manner, calm demeanor and you'd never expect him to be caught up in something like this,\" McIntosh said.\nFreshman Cameron Sands, 18, said he had pledged at a fraternity and was supposed to move into Mountain View Hall on Friday.\n\"It's crazy. You don't think this stuff happens. When I think of Flagstaff, I think safety,\" he said.\nStudent Maria Gonzalez told The Associated Press that she at first suspected firecrackers when the shooting happened.\n\"I was studying for an exam so I looked out the window and see two people running, and that's when I realized they weren't fireworks they were actually gunshots,\" she said.\nThe gate to the dorm's main entrance was closed Friday, and police had the surrounding area taped off.\nArizona political leaders voiced support for the university and surrounding community, with Gov. Doug Ducey calling the shooting heartbreaking. He said the state stands ready to help in the investigation and response.\nRep. Ann Kirkpatrick, who lives in Flagstaff, expressed confidence that the city \"will only grow stronger in difficult moments like these.\"\nThe Flagstaff shooting comes on the same day that President Barack Obama is scheduled to visit Roseburg, Oregon, where eight students and a teacher were shot and killed last week at Umpqua Community College. The gunman in the Oregon shooting wounded nine others before turning the gun on himself.\nNAU is a four-year public university that has more than 25,000 total undergraduate students at the campus in Flagstaff, a city about two hours north of Phoenix that is surrounded by mountains and ponderosa pines.\nNAU officials have set up a Family Assistance Center in the ballroom of 1899 Bar & Grill, located at 307 W. Dupont Avenue. Long-distance parents may call 928-523-0007. Counseling Services will be open Saturday, October 10 from 10:00 a.m. to 4:00 p.m. in the Health and Learning Center.\nArizona Senator John McCain released the following statement on the tragic shooting at Northern Arizona University early this morning:\n“My thoughts and prayers are with families of the person who was killed and the three others who were wounded in the horrific shooting on the campus of Northern Arizona University in Flagstaff early this morning. I appreciate the efforts of all state and local law enforcement officials, first-responders and school administrators, and continue to pray for the recovery of the injured, as well as all those in the NAU community who have been impacted by this terrible tragedy.”\nArizona Governor Doug Ducey tweeted, \"Praying for @NAU and the victims of this morning's shooting. All Arizonans have the #Flagstaff community in their hearts today.\" He later issued a statement: \"I join Arizonans from all across our state in praying for the victims of this morning’s tragic shooting, their families and the entire Northern Arizona University community. This heartbreaking incident will impact many of our fellow citizens, and I ask all Arizonans to keep them and the family of the individual lost in their thoughts and prayers as they cope with this tragedy. The state stands ready to assist local law enforcement and first responders in any way needed to ensure the recovery of those injured and the continued safety of NAU and the Flagstaff community.\"\nArizona Rep. Ann Kirkpatrick stated, \"Those of us who call Flagstaff home know that NAU is the heart of our community. And today, our hearts are hurting from the news of a fatal shooting on campus. I've lived here for over three decades, raised two daughters, and built a life in this wonderful place. And I can say without a doubt that Flagstaff will only grow stronger in difficult moments like these. Today, my thoughts are with the victims and their families and our entire community. And I offer my gratitude and full support to the university and local officials as they deal with this tragic situation.\"\nArizona Senator Jeff Flake tweeted, \"Joining the entire state in sending thoughts & prayers to the victims of the tragedy at @NAU, their families & the #Flagstaff community.\"\nPress conference regarding shooting on campus scheduled for 6 a.m. at NAU's High Country Conference Center. Details: http://t.co/eOmA1U6aAO\n— NAU (@NAU) October 9, 2015\n#NAUAlert: Details confirmed 4 victims, 1 fatality, 3 wounded. Shooter is in custody. Situation is stabilized. Campus not on lockdown.\n— NAU (@NAU) October 9, 2015\n#NAUAlert: Details confirmed 4 victims, 1 fatality, 3 wounded. Shooter is in custody. Situation is stabilized. Campus not on lockdown.\n— NAU (@NAU) October 9, 2015\n#NAUAlert Reported shooter situation is stabilized and the shooter is in custody. Details to follow.\n— NAU (@NAU) October 9, 2015\nReported shooting at NAU Flagstaff campus. Shooter in custody. Mtn View Hall residents stay indoors. More details to follow.\n— NAU (@NAU) October 9, 2015\n1 dead, 3 wounded in shooting at Northern Arizona University"}