{"uri": "http://juneauempire.com/local/2016-12-01/defying-odds-19-year-old-gunshot-victim-recovers", "title": "Defying odds, 19-year-old gunshot victim recovers", "dct": "Thu, 01 Dec 2016 00:00:00 GMT", "id": "2e7485b370763f7cf43c7f6e1753f22d", "content": "When 19-year-old Geneva Anowlic-Okitkon was shot in the head in mid-October, the prognosis wasn’t good.\n“Originally, it was whether she was even going to live; that was it,” said Megs Testarmata, a member of Anowlic-Okitkon’s extended family.\nPolice officers, medical professionals, family members — nearly everybody who was familiar with the situation — feared the worst. About a month and a half after the shooting, Anowlic-Okitkon is making a recovery that nobody expected.\nFrom her room inside Providence Alaska Medical Center in Anchorage, Anowlic-Okitkon is slowly regaining strength, according to Testarmata who visits her regularly.\nAnowlic-Okitkon’s motor skills are slowly returning. She’s able to move her arms, but typing and finer movements are still difficult. In a recent phone interview Testarmata joked that Anowlic-Okitkon’s grip is as strong as ever.\n“She’s always pinning me down in thumb wrestling,” Testarmata said, laughing.\nIt’s still too early to tell the extent of any brain damage. It’s also too early to say when or if Anowlic-Okitkon will be walking again. But she’s getting better all the time.\n“Last night, for the first time in a long time, I heard her voice,” Testarmata told the Empire on Wednesday. “She could only whisper, but it was wonderful. I was so excited.”\nAnowlic-Okitkon has been able to comprehend and communicate nonverbally with visitors and hospital workers for several weeks. Until Tuesday, she didn’t have a voice to speak back. Anowlic-Okitkon isn’t yet able to talk any louder than a whisper, and it’s “a faint whisper” at that, according to Testarmata. But it’s progress.\n“I think we’re all thrilled because this is way more than we could hoped when we were worried if she was even going to live,” she said.\nPolice investigation\nWhile Anowlic-Okitkon recovers in Anchorage, the Juneau Police Department is investigating the shooting that landed her there.\nJust before noon on Oct. 14, Anowlic-Okitkon was on the first floor of the Coho Park Apartment where she lived when somebody on the second story fired a gun pointed at the floor. The bullet traveled through the ceiling above Anowlic-Okitkon and struck her in the top of the head, according to police.\nShe lived in the apartment with her fiancé Michael Flores, 20; his father, Rafael, 51; and Rafael’s significant other Katherine Milton, 46, all of whom were in the apartment at the time of the shooting. Police have not said who fired the gun.\nAfter the shooting, the police department put out a release seeking the whereabouts of Milton and Rafael Flores. After finding and questioning the them, JPD released the couple the next day.\nPolice haven’t yet charged anybody connected to the shooting with a crime, and whether they will remains to be determined, according to JPD spokesperson Lt. David Campbell.\n“It’s a fairly complicated case, and the detective is working pretty hard on it,” he told the Empire in a phone interview Tuesday afternoon. “Whether there are going to be charges or not is still up in the air.”\nAccording to Juneau District Attorney James Scott, accidental shootings require an “extremely highly fact specific analysis.” Charges, Scott said, can vary in these cases depending on whether the shooting is deemed to be negligent, reckless or intentional. The outcome of the shooting also plays an important role in determining the severity of the charge.\nIn late August, a Juneau man accidentally shot a school bus carrying students after he “dry fired” a loaded handgun in his home. The bullet went through his front door and shattered a bus window. Nobody was injured, but JPD recommended to prosecutors a charge of shooting a firearm within a quarter mile of the road, a class B misdemeanor. Had a child on that bus been injured or killed, those charges could have been more severe.\n“These shootings run the gamut from no charge to serious charges, and what we need to know is exactly how the firearm was being used and under what circumstances,” Scott said.\n• Contact reporter Sam DeGrave at 523-2279 or sam.degrave@juneauempire.com."}