{"uri": "http://www.myajc.com/news/news/local/whos-responsible-when-small-children-shoot-themsel/npbqx/", "title": "Who’s responsible when small children shoot themselves?", "dct": "Thu, 03 Dec 2015 00:00:00 GMT", "id": "a7532e5a0445d5f833021b7cfb1d3f91", "content": "0\nThe children’s tragic deaths, just one month apart, were eerily similar and totally preventable.\nLast Saturday morning, 6-year-old Ja’Mecca Smith discovered a loaded gun between two sofa cushions in her family’s Peoplestown apartment. Her father, Demarqo Smith, four of her siblings and another adult were home at the time, but no one saw the little girl with the gap-tooth smile point the gun at her head and pull the trigger.\nOn Oct. 27, 2-year-old Waylon Dennington found his father’s semi-automatic handgun resting in a holster on his parents’ bed. His father, Grant Dennington, was in the bathroom when the gun discharged, killing Waylon on the scene.\nThe similarities end there. Though the gun did not belong to him, Demarqo Smith was charged with involuntary manslaughter and reckless conduct for placing the firearm under the sofa cushion, Atlanta police said.\nGrant Dennington, meanwhile, will not be charged, Acworth Police Chief Wayne Dennard told The Atlanta Journal-Constitution.\n“There’s nothing specific in Georgia law that guides us when it comes to bringing criminal charges,” said Cobb County District Attorney Vic Reynolds.\nAdults are criminally liable in Georgia only when they intentionally or knowingly provide a child access to a handgun. Fourteen states, and the District of Columbia have laws prohibiting negligent storage.\nAccording to the Centers For Disease Control and Preventon’s public health database, 69 children under the age of 15 died from unintentional gunfire in 2013, the latest year for which such data is available.\nIn the past six weeks alone, four children have died in or near metro Atlanta from unintentional gunshot wounds.\nOn Oct. 17, 8-year-old Sharia Lynch was killed inside her family’s Paulding County home. Her mother, Marsha, told investigators a handgun had fallen and discharged when it hit the floor, striking Sharia in the head. A Paulding police spokesman said the case will be taken before a grand jury next month.\nLast month, Jayden Jamar Clay was shot and killed after finding a .45-caliber handgun while playing with his twin brother inside their Butts County home. His mother’s boyfriend, Christopher Dwayne Askins, was later charged with second-degree cruelty to children and possession of a gun by a convicted felon.\nHad it not been illegal for him to possess a gun, Askins would likely not have been charged, said Vivian Goldenberg of the Georgia chapter of Moms Demand Action for Gun Sense in America, which advocates “common-sense gun reforms.”\n“When there are charges it’s usually because of other circumstances,” Goldenberg said. “We are giving gun owners a special privilege. Negligence is a form of child abuse.”\nThe National Rifle Association has consistently opposed safe storage laws, arguing they compromise a gun owner’s security by providing criminals a clear advantage in home invasions.\nGrant Dennington, according to Chief Dennard, was a responsible gun owner. What happened Oct. 27 at his Acworth home was a tragic exception, Dennard said.\nDennington had just picked up his two sons who were staying with a relative. He went to the bathroom right after they returned home, placing his gun on his bed.\n“We’re talking a minute or two,” Dennard said. “We spent a lot of time talking to the dad, interviewing other family members. This was not routine on his part. He always took the necessary precautions.”\nAtlanta police would not discuss their reasoning for charging Demarqo Smith, currently being held in Fulton County Jail. After the shooting Smith briefly left the home, about a mile from Turner Field, but returned to speak with detectives. Public records revealed no convictions that would prohibit Smith from owning a gun.\n“It’s often comes down to a judgment call,” Reynolds, the Cobb DA, said. “You’ve got to lay all the facts on the table and determine was this behavior rising to reckless conduct or just a tragic mistake.”\n“There’s a human element involved, too,” he said, referencing the Dennington case. “What good can come from prosecuting this father?”\nBut Goldenberg said there should be consequences to parental negligence.\n“There needs to be a way to hold people accountable or this situation is going to continue to repeat,” she said."}