{"uri": "http://www.ctpost.com/local/article/Trial-begins-in-gang-shooting-spree-case-8343116.php", "title": "Trial begins in gang shooting spree case", "dct": "Wed, 06 Jul 2016 00:00:00 GMT", "id": "06cdab3f267ca621cbdc1ef341457286", "content": "BRIDGEPORT - It was chaos.\nGunfire seemingly came from everywhere as dozens of people enjoyed a summer evening in the parking lot of the Trumbull Gardens housing project last year, witnesses testified in court Wednesday.\nBut none of the witnesses could identify Jamal “MooMoo” Hamilton as the shooter who killed one person and wounded eight others.\n“We were just talking, hanging out, drinking liquor,” Kimberly Miranda recalled under questioning by Senior Assistant State’s Attorney Michael DeJoseph.\nThen, Miranda said, she heard the gunshots.\n“I turned to Vahn (Savonie “Vahnnie” McNeil) and Vahn told me to run and duck, and I hid between two cars,” Miranda continued. “I got up to check if Vahn was OK and Vahn was on the ground, he was lifeless and bleeding from the head. I got scared, I screamed and I told him we were going to be OK.”\nMiranda didn’t realize until a short time later that she had been shot twice.\n“Shauna told me to sit on the curb because I had a bullet sticking out of my stomach,” she testified. “It was total chaos, massive noise, people screaming.”\nHamilton, 24, is facing a 12-member jury. He is charged with murder and eight counts each of first-degree assault for the June 11, 2015, shooting spree. The trial began Wednesday morning.\nIt’s a case that arguably propelled Joe Ganim to the mayor’s seat.\nThe shooting came the same day Bill Finch was to announce his re-election bid, armed with a claim that his administration was responsible for a decrease in violent crime in the city.\nInstead, Finch was forced to postpone his announcement, giving Ganim — who announced that day the opening of his own police substation just outside the Trumbull Gardens housing project — the upper hand.\nBruce Nelson testified Wednesday that he was shot in the right hip and right leg.\n“At first I thought it was a firecracker, until people began running,” he said.\nA bullet broke Jared Fleming’s left leg but he was reluctant to talk about it in front of the jury.\n“No offense to my friend Vahnnie,” he added under questioning by DeJoseph.\nUnder cross examination by Hamilton’s lawyer, Michael Riley, neither Fleming nor Nelson, both who grew up with Hamilton, recalled seeing him at the shooting scene. Neither they nor Miranda said they saw the shooter.\nEllen Payton testified she didn’t see anything. She had been taking a shower in her second-floor bathroom when a bullet came through the wall and struck her in the leg.\n“I can’t sleep and I’m afraid,” she told the jury.\nPolice Detective Thomas Harper was the first police officer on the scene.\n“It was one of the most chaotic scenes I have been on,” he testified. “There was a large crowd of people who were screaming and yelling.”\nHarper said he found McNeil, 37, of Shelton, lying on his back between two parked cars, with a gunshot wound to the head.\n“I requested more officers and ambulances to the scene, and then I started going to other victims,” Harper said.\nTestimony is to continue Thursday morning."}