{"uri": "http://www.ctpost.com/news/article/Feds-to-assist-investigation-of-Bridgeport-6323343.php", "title": "Feds to assist investigation of Bridgeport shootings", "dct": "Fri, 12 Jun 2015 00:00:00 GMT", "id": "51c6154e2d24429db4afab1193170d33", "content": "BRIDGEPORT — Police Chief Joseph Gaudett said that although there was little police presence Friday morning on Trumbull Avenue, “things are happening that may not be visible. When we need to be seen, we’ll be seen.’’\nThe avenue had been flanked with cruisers, unmarked cars and the department’s mobile crime unit nearly all day Thursday following an after-midnight shooting that killed one man and injured eight other people at the Trumbull Gardens apartments.\nThere are security cameras on some of the buildings, but police would not say whether any usable images had been captured.\nA young man with a gun isn’t a rare sight at the housing complex, so when one in a hoodie brushed past her in the early morning darkness Thursday, Rhonda Jones wasn’t alarmed.\nIt was only seconds later, when she heard a series of about 20 shots in rapid succession and people screaming, that Jones knew what was happening. The gunfire shattered what had been a night of partying outside the apartments.\n“He had the gun pointed down at the ground and he was walking really fast when he went by me,’’ Jones, who writes poetry under the name “Spiritual Gangsta,’’ said of the shooter.\nA Shelton man, 37-year-old Savonie “Vahnnie” McNeil, was killed. The wounded included Ellen Payton, 59, who wasn’t at the party but in her second-floor bathroom several yards away, taking a shower.\n“Because of the water running I didn’t hear anything but I felt a burning in my leg,’’ Payton said Friday from behind her screen door. “There are a lot of bullet holes in here. People fire guns and the shots pass right through.’’\nJones agreed. “The walls are sheetrock but they’re very thin,’’she said. “It’s always been a problem up here.’’\nShe pointed to several bullet holes in the apartment that McNeil’s grandmother, known as Miss Zany, lived in before her recent death.\n“That’s what Vahnnie was doing up here; they was moving her stuff out,’’ Jones said.\nThe U.S. Marshals Fugitive Task Force, which includes members of the Bridgeport Police Department, is assisting in the investigation, officials said.\nU.S. Sen. Richard Blumenthal, D-Conn., said he would work to secure more federal funding for the neighborhood and for Bridgeport — including more cameras, more manpower, program support and other resources.\n“I am on the Judiciary Committee. I have a direct line to U.S. Attorney General Loretta Lynch,’’ Blumenthal said. “The federal government stands with Bridgeport, and we’ll get them the resources they need. But we’ll take our cue from the city on what the needs are.’’\nBlumenthal and Mayor Bill Finch said the most important step is closing the loophole that allows the purchase of weapons without a background check at gun shows. A federal gun law that mirrors Connecticut’s, with bans on assault weapons and high-capacity magazines, is also key, the men said.\nAlthough such a measure proposed after the Sandy Hook school shootings was defeated, Blumenthal noted that it took nearly 10 years for the so-called Brady Bill, another piece of landmark gun-control legislation, to pass.\nLee Byers, executive director of the Bridgeport Housing Authority, said an increase in U.S. Department of Housing and Urban Development funding is needed to upgrade security cameras in the sprawling public housing complex.\nMeanwhile, there was glass from several shot-out cars in the Trumbull Gardens parking lot from Thursday’s shootings, including a large chunk of windshield. Jones said that police dug seven spent shells out of her friend’s car, which had been parked in a handicapped spot at the edge of the parking lot.\nTwo victims who were brought to Bridgeport Hospital after the incident remained in fair condition Friday, spokesman John Cappiello said. Another was treated and released on Thursday.\nThe victims still being treated at St. Vincent’s Medical Center were in stable condition Friday, spokeswoman Caryn Kauffman said. She would not say how many victims are still in the hospital.\nPolice are investigating a dispute in Norwalk that might be related to the shooting. The U.S. Marshals Fugitive Task Force, which includes members of the Bridgeport Police Department, is helping with the investigation, officials said.\n“Literally dozens of detectives are following leads, interviewing witnesses and visiting area businesses to determine if security video exists that will bring us closer to finding these gunmen,” Gaudett said. “Investigators are working non-stop and won’t rest until we identify these gunmen and bring them to justice.”\nHe asked anyone with information to contact Detective Ada Curet, the lead investigator, at 203-581-5236.\nfjuliano@ctpost.com; @FrankJuliano"}