{"uri": "http://wtnh.com/2015/06/11/nine-shot-1-dead-at-bridgeport-housing-complex/", "title": "9 shot, 1 fatally, at Bridgeport housing complex", "dct": "Thu, 11 Jun 2015 06:17:00 GMT", "id": "d95d24d7599b4de406999098166d5667", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nBRIDGEPORT, Conn. (WTNH) — Nine people were shot, one fatally, at a Bridgeport apartment complex on Trumbull Avenue early Thursday morning.\n“They were all just hanging out, having a good time talking to each other when all of a sudden, hell broke loose,” said Bridgeport Police Captain A.J. Perez.\nPolice say 37-year-old Savonnie McNeil of Shelton, a father of four, was killed when at least two gunmen opened fire on a group of people in the Trumbull Gardens affordable housing complex parking lot around 1 a.m.\n“They waited for a while and then they said he was pronounced dead,” said a woman who had a child with McNeil. She and their 18-year-old daughter went straight to the hospital when they heard about the shooting.\n“She was sad,” said the woman said. “She loved her dad.”\n“He was a good guy,” she continued. “Caring, loving.”\n“How can you take my first born child?” said McNeil’s mother, Beilinda McNeil. “He didn’t do anything to anyone. He was a very gentle soul.”\nThey say eight other victims, five men and three women ranging from 27- to 59-years old, were also shot. All of them were described as being in serious “but guarded” condition earlier Thursday. Most needed surgery.\nOne of the victims, an elderly woman, wasn’t out in the parking lot, but still was shot by a stray bullet.\n“(She) was in her home taking a bath and the bullet went right through the wall and hit her in her back area,” said Capt. Perez.\nShe’s the only one expected to be released from the hospital Thursday.\n“This is the worst single act of violence in our city in recent memory,” former Bridgeport mayor and current mayoral candidate Joseph P. Ganim said.\nPolice are still looking for the suspects in the act of violence, who were last seen running behind the complex.\n“Literally dozens of detectives are following leads, interviewing witnesses and visiting area businesses to determine if security video exists that will bring us closer to finding these gunmen,” said Bridgeport Police Chief Joseph Gaudett said in a release. “Investigators are working non-stop and won’t rest until we identify these gunmen and bring them to justice.”\n“We have developed leads that we are pursuing, but we need the community’s assistance,” he added.\nAnyone with information about the shooting is asked to call Detective Ada Curet at (203) 581-5236.\nWinfrey will be teaming up with the brand, Kraft-Heintz to sell her own…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}