{"uri": "http://www.wsoctv.com/news/news/local/authorities-investigate-2-deaths-anson-county/njFWX/", "title": "Anson Co. Sheriff: Registered sex offender killed 2-year-old girl, self", "dct": "Mon, 24 Nov 2014 20:14:00 GMT", "id": "5079578773a59046246489a32f91f038", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nANSON COUNTY, N.C. - Anson County deputies said the man who killed a 2-year-old girl and then himself in a murder-suicide was a convicted sex offender from Kentucky.\nInvestigators came to the home on Horne Store Road Monday around 5 p.m. Monday after someone called 911.\n\"Yes, I need some help over here ... Anson County, I need y'all help. Please hurry,\" said the 911 caller.\n911 CALL: Anson county murder-suicide\nShe said her brother-in-law had committed suicide. Investigators discovered George Rufus Harris, 33, shot to death in a shed behind the home. Inside a bedroom, they found the body of that 2-year-old girl and they found a suicide note.\n“He admitted he killed the child regretted it and was going to take his own life,” said Sheriff Tommy Allen.\nOfficers didn’t have a motive, but said Harris was a registered sex offender who was wanted for a probation violation and failing to report. Eyewitness News checked and found he was convicted of sexually abusing a 14-year-old.\nIMAGES: Scene of apparent murder-suicide in Anson Co. where 3-year-old killed\nOfficers said he was dating the little girl’s mother and living in the house with her, several adults, and four other children.\n\"I never thought he'd do anything like that,” said Lena Tanner, the girl’s great-aunt.\nOfficers said they believe the girl’s mother knew Harris was a sex offender. They said the district attorney would decide if she’ll face any charges.\nThe Department of Social Services has also been asked to investigate whether any other children in the home have been abused.\nThey also said the home was found in deplorable conditions. They asked the health department to investigate whether the home should be condemned.\nRead more top trending stories on wsoctv.com:\nPolice: Man killed 3-year-old girl, self in Anson Co.\nRock singer electrocuted by microphone on stage in Argentina\nFerguson businesses torched in overnight protests\nRallies planned in Charlotte following Ferguson decision\nCops: Flea killer put in mother-in-law's wine"}