{"uri": "http://www.wbaltv.com/news/police-several-people-shot-in-east-baltimore/33129870", "title": "Police: 5 people shot in east Baltimore", "dct": "Thu, 21 May 2015 23:59:00 GMT", "id": "825a1cb1336e22339ea29fbb2fc89224", "content": "BALTIMORE —\nThere was an increased police presence in the east Baltimore neighborhood on Thursday after a barricade situation unfolded and five people were shot the day before.\nThe victims were four adults and one 17-year-old boy. Officials said one of the adult male victims was shot in the head and was taken to a hospital. Authorities said he was pronounced dead at 10:10 p.m.\n\"There were at least two to three locations that the victims ran to and they weren't the same location, so that's why you have blood at different locations,\" Baltimore police Maj. Osbourne Robinson said.\nIt started just before 4 p.m. Wednesday, when officers on patrol in the area heard a gunshot and then saw a person fire another shot.\n\"At that time, they engaged that person and was able to take that person into custody. At least three others ran. They pursued one, they were able to get another one in the alleyway. At least two got away from them,\" Robinson said.\nOne of the people who ran barricaded himself in a house on the 800 block of Linwood Avenue for a few hours with children inside. The children were not injured.\n\"The guy finally came out, he had a little gunshot wound to his left arm, he gave up and put his hands up and he got down on his knees and they cuffed him,\" a witness said.\nPolice said the person who surrendered ended up being one of the five people shot.\n\"He just came on out and he let the kids go. He came on out and they put him in an ambulance. That was it,\" a witness said.\nClose to a dozen blocks in east Baltimore were covered in police tape and officers in tactical gear.\nPolice said a vehicle was used in the incident and the victims were shot in multiple locations.\nPolice said they have two persons of interest in custody in connection with the shooting. Authorities said homicide detectives are investigating the incident.\nThose with information on the shooting can contact police at 410-396-2100.\nRefresh wbaltv.com and our app, and watch 11 News for late-breaking updates."}