{"uri": "http://www.mlive.com/news/muskegon/index.ssf/2015/06/double_murder_charges_filed_in.html", "title": "Double murder charges filed in Charity Lodge shooting deaths during 2013 melee", "dct": "Wed, 10 Jun 2015 11:58:00 GMT", "id": "75578d0f5001e41a8916dec4bcdc912b", "content": "MUSKEGON, MI - More than a year and a half after the deadly melee at the former Charity Lodge on Ottawa Street, a man identified early on as a suspect has been charged with two counts of open murder.\nJamel Kawon Quinney, 20, who already was in jail on charges related to the September 2013 incident, was arraigned Tuesday on the murder charges.\nDogged detective work by the Muskegon Police Department and statements from previously uncooperative witnesses helped break the case, said Muskegon County Prosecutor D.J. Hilson.\nDupree Johnson, 20, and Ja'Colby Brown, 20, were killed in the shoot-out at the Charity Lodge, 149 Ottawa St., that involved multiple weapons. Jalisa Love, 20, also died after being struck by a fleeing vehicle. At least four people were injured.\nWhile Hilson would not say whether shots fired by Quinney actually killed Johnson and Brown, the prosecutor said Quinney was the instigator.\n\"We believe and allege that Mr. Quinney was the catalyst of this entire event,\" Hilson said. \"His actions created the domino effect that created the mass chaos at the scene.\"\nQuinney emerged early on as a key suspect, but witnesses weren't willing to testify, he said. As more evidence was gathered, the witnesses realized the police had a pretty good idea of what happened and became more cooperative, said Muskegon Public Safety Director Jeffrey Lewis. Muskegon Police Detective Keith Stratton was credited with playing a key role in the investigation.\n\"We didn't quit investigating this,\" Lewis said. \"We stayed on it.\"\nAlso helping the case was the use of investigative subpoenas that compelled some uncooperative witnesses to give statements to investigators while under oath, Hilson said.\nQuinney originally is from Detroit and is known by the street name \"Michigan Mel.\" He has been in jail for the past several months both here and in Wayne County, Hilson said. His preliminary examination on the two open murder charges has been scheduled for June 23. Bond was denied at his arraignment.\nLast July, Quinney pleaded no contest to carrying a concealed weapon and lying to police in connection with the Charity Lodge case. Antonio Keshawn Raglin was also charged with a weapons violation at the Charity Lodge melee and was convicted by a Muskegon County jury.\nLamarcus Deshon Calvin was convicted of a felony charge of failing to stop at an accident scene in connection with Love's death. Prosecutors have said Calvin was fleeing bullets when he struck Love, and that he knew he struck someone and didn't report it to police.\n\"There were bullets flying, and bullets don't have brains,\" Hilson said.\nLewis said the charges against Quinney will help bring \"peace to the streets.\" There no longer is the threat of retribution or retaliation for the Charity Lodge shootings, Lewis said.\nHowever, Hilson said the investigation remains open and he urged those who have information about the melee to contact the Muskegon Police Department at 231-724-6750 or Silent Observer at 231-722-7463. Tips can be called or texted in to 231-846-8477.\nSome tips may qualify for cash rewards, Lewis said.\nLynn Moore covers the city of Muskegon for MLive Muskegon Chronicle. Email her at lmoore8@mlive.com and follow her on Twitter and Facebook."}