{"uri": "http://www.nbcnewyork.com/news/local/Boy-15-Dies-in-NJ-Shooting-Paterson-300593881.html", "title": "15-Year-Old Basketball Star Dies in Drive-By Shooting in New Jersey", "dct": "Mon, 20 Apr 2015 16:44:00 GMT", "id": "49439af42f599cd3af0b2b26b565f46f", "content": "Police have made an arrest in the death of a 15-year-old basketball star who was gunned down in a drive-by shooting in New Jersey.\nGregory Oliver, 20, has been charged in the death of Armoni Sexton, an 8th grader at Paterson Charter School for Science and Technology, who died Sunday morning after being shot on Rosa Parks Boulevard in Paterson at around 8:30 p.m. the night before, according to police.\nThree others, two males and a female between 15 and 20 years old, were injured in the shooting and are expected to survive.\nOliver is also charged with two counts of attempted murder and criminal possession of a weapon. It was not immediately clear if he had an attorney.\nHundreds of students released balloons Monday in memory of 15-year-old Armoni Sexton days after the basketball star was gunned down in a drive-by shooting in New Jersey. A candlelight memorial also stands by the spot where the shooting occurred.\nSchool officials said Sexton, who already stood at an impressive 6 feet 7 inches, was not only a star player, but a role model to other students.\n“I will remember him as a kid who really, really tried both on and off the court and who served as an example to everyone else at Paterson Charter School,” said Dean of Students James Bacote.\nSexton was among the top basketball players in his age group in the country. Just 10 days ago, his team the NJ Playas won a National Championship in Virginia, and the team has another national tournament this week.\n“It’s rough, really rough,” said coach Kiela Brevard. “He wouldn’t want us to sit around, he would want us to play this weekend.”\nBrevard, who said he started coaching Sexton when he was 12 years old, had a dream to go to college and one day buy his mother a home.\n“He was a good child, always tried to do right,” said his great-grandmother Marie Jacobs.\nHis coach says he will always be a part of the team.\n“He will be with us at every tournament we go, every practice we are at. He’s with us when we go to sleep, when we wake up. He’s here with us right now,” Brevard said.\nAnyone with additional information on the shooting is asked to call Paterson Police at 973-321-1120 or to send a text via PatersonPD.com."}