{"uri": "http://wnct.com/2016/12/24/at-least-one-dead-in-shooting-in-wilson-county/", "title": "Victims identified in Wilson County Christmas Eve shooting", "dct": "Sat, 24 Dec 2016 14:44:00 GMT", "id": "65fc6b3f8ac24b527b8dfbdf95105e07", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nWILSON, N.C. (WNCN) — A Christmas Eve shooting at a Wilson County home left four people dead.\nThe incident was reported just before 1 p.m. Saturday in the 2200 block of Banks Lane East, which is off N.C. 42 just east of Wilson. All four victims lived at the home and have been identified as Tammy Lynette Pearce, 54, Paul Shane Pearce, 28, Selby Gene Outland, 47, and Dominique Nicole Privette, 23.\nOfficials did not release any other information.\nPeople living in the neighborhood had many questions as they tried to wrap their minds around what happened.\n“It’s Christmas Eve. It’s shocking,” said a woman named Brenda, who did not want to give her last name. She said her mom, who just recently moved onto Banks Lane, knew one of the victims and is concerned. “It upsets her anytime something happens to somebody even if she doesn’t really know them. She knew one of them too. He worked in the house for the landlady.”\nNeighbors described the area as quiet.\n“What could’ve happened,” asked Michael Taylor, who lives in the area. “What could’ve made a person be so crazy to do some things like that? This is a good area. A very good area. Quiet. You don’t hear any bad things going on.”\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}