{"uri": "http://abc11.com/news/four-people-shot-and-killed-in-wilson-county/1671884/", "title": "Deputies still search for motive in Wilson County murders", "dct": "Mon, 26 Dec 2016 00:00:00 GMT", "id": "cff22d8bed1e657f7eeb40fd9b23a890", "content": "WILSON COUNTY, North Carolina (WTVD) --\nA mother and her son along with their significant others were shot and killed in Wilson County. A member of the family said they are devastated from the Christmas Eve events.\nIt happened in the 2200 block of Banks Lane East, just east of Wilson. Deputies responded just before 1 p.m. Saturday. The Wilson County Sheriff's Office said the shooting may have happened late Friday night or early Saturday morning.\nThe four victims were found by an elderly relative.\nStay on top of breaking news stories with the ABC11 News App\nA family member identified the mother as Tammy Pearce, 54, along with her boyfriend, Selby Outland, 47. The other two victims are Shane Pearce, 28, and his fiance, Dominique (Nikki) Privette, 23.\nFIRST LOOK: Four victim's shot, killed on #ChristmasEve. Mother and son murdered--along w/ their significant others per family. #ABC11 pic.twitter.com/ByzT9uNlY7\n— Tim Pulliam (@TimABC11) December 24, 2016\nOn Monday, Jessica Taylor, Tammy's daughter and Shane's sister, spoke to ABC11. She said they did not deserve what happened.\n\"Some heartless person went over there and killed every last person in that home,\" Taylor said.\nTaylor said her brother and Privette had just recently been engaged.\nPeople in the area are in shock over the Christmas Eve violence.\n\"It's crazy, and one of them we know. One of them does work for my momma's landlord. He was just working on her house the other day,\" one neighbor said.\nDeputies are investigating but have not released a motive for the shooting. They said it does not appear to be a domestic situation. Authorities said they believe it was an isolated incident.\nOfficials have not released any information on possible suspects.\nA GoFundMe account has been set up to help with funeral costs. Click here to learn more.\nAnyone with information should contact the Wilson County Sheriff's Office at (252) 237-2118."}