{"uri": "http://foxsanantonio.com/news/local/teen-girl-shot-in-the-head-while-visiting-friends-at-northwest-side-home", "title": "Key evidence missing from Tuesday night shooting", "dct": "Wed, 29 Jun 2016 00:00:00 GMT", "id": "0ef763d71a96b2844954651c96546c31", "content": "SAN ANTONIO - A key piece of evidence is missing from the scene where a teen is accused of shooting and killing a 14-year-old girl Tuesday night.\nPolice have one person in custody in the shooting that happened on Star Creek Drive near Culebra and Westover Hills.\nMelody Cuerros' family said she was a normal teen, and they're now planning her funeral.\n\"She suffered a gunshot wound to the head,\" said Officer Douglas Greene. \"EMS arrived on scene, attempted life saving measures, but were unable to resusitate her.\"\nThe teens were at a garage party, the homeowner told police he didn't know they were there until a gunshot went off.\nWitnesses said Ryan Rodriguez, 19, was holding the gun.\n\"It was his understanding the handgun was not loaded,\" said Officer Greene. \"He pointed the handgun at the victim and pulled the trigger and the gun went off.\nPolice arrested Rodriguez during a traffic stop, and are still trying to put the pieces together.\n\"We're still looking to recover that weapon,\" said Greene.\nThe family set-up an account for funeral costs, click here, to donate.\nA teenage girl was killed when she was shot in the head at a home on the Northwest Side late Tuesday night.\nThe victim, Melody Cerros, 14, was at a home in the 8600 block of Star Creek Drive when someone pointed a gun at her head and fired.\nShe was hit in the head and killed. Investigators say she did not live at the home, but was visiting two teen girls who live there.\nThe homeowner told investigators he was asleep on the couch and did not realize there were teens that were 'partying' in his garage. The sound of gunfire woke him up and he told police he saw the teens running from the garage.\nSome of the teens were rounded up by police. Ryan Rodriguez, 19, was later charged with manslaughter.\nThe teens told officers they were playing with the gun and did not realize it was loaded.\nView image on TwitterView image on TwitterView image on Twitter\ndarlene dorsey @darlenedorseyTV\nSAPD: Teenager shot in the head. Police say she & others were hanging out at a NW side home--around midnight.\n5:07 AM - 29 Jun 2016\n3 3 Retweets 2 2 likes\nA teenage girl was killed when she was shot in the head at a home on the Northwest Side late Tuesday night.\nThe victim, Melody Cerros, 14, was at a home in the 8600 block of Star Creek Drive when someone pointed a gun at her head and fired.\nShe was hit in the head and killed. Investigators say she did not live at the home, but was visiting two teen girls who live there.\nThe homeowner told investigators he was asleep on the couch and did not realize there were teens that were 'partying' in his garage. The sound of gunfire woke him up and he told police he saw the teens running from the garage.\nSome of the teens were rounded up by police. Ryan Rodriguez, 19, was later charged with manslaughter.\nThe teens told officers they were playing with the gun and did not realize it was loaded."}