{"uri": "http://www.baltimoresun.com/news/maryland/crime/bs-md-ci-vigil-shooting-20160711-story.html", "title": "Gunman opens fire on crowd at candlelight vigil in West Baltimore", "dct": "Mon, 11 Jul 2016 23:25:00 GMT", "id": "c6c42758b0326079bbc5bae164e7c5a6", "content": "To view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nA gunman opened fire minutes into a vigil Monday evening for a homicide victim in West Baltimore, wounding five people.\nFour women and one man were shot, police said, before the gunman ran away. The crowd scattered into the North Avenue traffic; it was about 6:30 p.m. The five victims, shot in their legs and feet, one woman grazed in her stomach, were all expected to survive.\n\"I thought it was balloons bursting,\" said Keith Bailey, a florist across the street. \"When I looked up, I saw people running. It was hard to see.\"\n\"Imagine a crowd of 20 to 30 people and gunshots rang out — pandemonium,\" police spokesman Donny Moses said.\nThe vigil was for Doreen Scofield's 24-year-old son, who was killed Sunday.\n\"We only wanted to celebrate my son, and they're shooting at us,\" said Scofield, whose family escaped without injury. \"What else is it you want? What else do you want? You got my son ... and you're still shooting at us because we have a candlelight vigil? When will it end?\"\nHer son, Jermaine, was shot to death in the 1800 block of W. North Ave. about 1:15 a.m. Sunday. He had two children.\n\"I'm tired. I'm tired,\" his mother said after the vigil. \"It's innocent people being shot. Enough is enough.\"\nPolice have not announced any suspects in Scofield's killing. After the shooting Sunday, his mother said she has forgiven the killer, and asked her family not to retaliate.\nPolice wrapped yellow crime tape around the block Monday evening, around the scattered candles and the balloons.\nA 27-year-old woman was shot in her ankle, a 48-year-old woman was grazed in her stomach, a 31-year-old man was shot in his foot, a 24-year-old woman was shot in her shin, and a 20-year-old woman was shot in her thigh, police said.\nWhat else is it you want? What else do you want? You got my son ... and you're still shooting at us because we have a candlelight vigil? When will it end? — Doreen Scofield\n\"There's no rhyme or reason,\" Moses said. \"It can't be explained.\"\nAcross the street, Bailey the florist watched the detectives. Too many times this summer, he said, he's been hired to arrange carnations, roses and tiger lilies, another casket spread for another grieving mother.\n\"Every week, I do a funeral for some baby that's been shot,\" he said. \"I'm in the funeral home 24 hours a day.\"\nA total of 344 people were killed in Baltimore last year, 301 of them by gunfire. This year has seen more than 130 shooting deaths to the city — enough to make a florist pack up, Bailey said.\n\"I haven't slept good,\" the 62-year-old said. \"I'm so tired of this.\"\nIn September, he plans to retire and leave his stretch of West North Avenue, his block for three decades.\n\"I'm going to go to the ocean and sit by the water, to try and see some new sights.\"\nHe watched the detectives, watched the yellow crime tape, the abandoned red and silver balloons, and tealight candles strewn on the sidewalk."}