{"uri": "http://6abc.com/news/man-charged-in-shooting-death-of-4-year-old-girl-in-north-philly/1411319/", "title": "Man charged in shooting death of 4-year-old girl in North Philadelphia", "dct": "Sun, 03 Jul 2016 00:00:00 GMT", "id": "231843a3b1d7dbe0fe78b2da366b601d", "content": "NORTH PHILADELPHIA (WPVI) --\nA man has been charged in connection with the shooting death of a 4-year-old girl inside a North Philadelphia home.\nDemetrius Williams has been charged with involuntary manslaughter and a host of other charges.\nPolice say Williams, who is the mother's boyfriend, was the one who left a loaded handgun inside an upstairs bedroom of the home.\nThe little girl, identified as Sani Holmes, fired the bullet directly into her eye socket while sitting inside the closet, police say.\nHolmes' mother, Shakeya Holmes, is charged with third-degree murder, and is accused of trying to cover up the incident.\nThe incident happened before 12:30 p.m. Thursday inside a home in the 1800 block of North 20th Street.\n\"She was hysterical crying. She just kept saying, 'save my baby, save my baby, save my baby,'\" said Margie Malavet of North Philadelphia.\nMalavet says she had just walked outside a nearby medical clinic in North Philadelphia when she saw Holmes frantic, desperately trying to find help, to find someone who could save her 4-year-old girl.\n\"I said, 'What happened?' She said she got shot. The kids were playing upstairs, and the next thing you know she said she found her baby laying on the floor like that and ran outside,\" said Malavet.\nThe girl was rushed to Hahnemann University Hospital. She was pronounced dead at 1:01 p.m.\n\"I seen the cops rushing down here. I said, 'Why are they coming this way? And I ran to the door and I cross the street and I seen the baby and I start crying,' \" said Cathy Wilson of North Philadelphia. \"I couldn't take it and I ran back into the house.\"\nPolice say the girl's 3-year-old sister was inside the home as was Holmes, who was taken to police headquarters to be interviewed.\nInvestigators weren't sure if there was anyone else there at the time of the incident.\nNeighbors say they would often see this little girl playing outside with her sister, described as \"sweet and kind\". pic.twitter.com/nYJFzCLqzd\n— Katherine Scott (@KScott6abc) June 23, 2016\n\"I see them all the time. Sometimes I sit out here,\" said neighbor Felicia Roussaw. \"I see the kids running up and down the block, playing. The mother sits out there sometimes with them.\"\n\"It's a shame. It's a little angel,\" said Malavet. \"And to see her little sister bent over, seeing her like that...\"\nMalavet says the doctors and nurses from the nearby medical clinic ran over to help before the medics arrived.\n\"I ran into the clinic and got the security guard, and all the nurses came out running over here, and the girl was just gasping for air,\" said Malavet.\nDetectives obtained a warrant to collect evidence from the home. They also surveyed the bedroom where it happened.\n\"We have a 4-year-old little girl that's dead here so that's our number 1 priority is finding out how this happened,\" Philadelphia Police Lt. John Stanford said as police carried out evidence and cleared the scene.\nThe investigation is ongoing."}