{"uri": "http://www.baltimoresun.com/news/maryland/crime/blog/bs-md-ci-overnight-shooting-20151227-story.html", "title": "Man killed, girl, 11, shot in Baltimore", "dct": "Sun, 27 Dec 2015 23:13:00 GMT", "id": "6899b974ff7ea71adb5dd3d5bec9f48b", "content": "Five people, including an 11-year-old girl, were shot and one person was killed Sunday in incidents across Baltimore, police said.\nAt around 8:50 p.m. police were called to the 2300 block of Orleans St. in East Baltimore for a shooting. Officers found a man shot multiple times. He was taken to a nearby hospital, where he later died from his injuries.\nThe man is the 339th homicide victim in 2015, the city's second deadliest year on record after 1993, when there were 353 killings but also about 100,000 more residents.\nPrior to the latest killing, police responded to multiple shootings on Sunday.\nAt around 7:30 p.m. police were called to the 1200 block of W. North Ave. for a shooting report. Officers found three victims: a 47-year-old man shot in the back, a 20-year-old man shot in the shoulder and an 11-year-old girl who suffered a \"graze wound to her arm,\" police said.\nAll three were transported to nearby hospitals and were expected to survive, police said. The juvenile victim did not appear to be the target of the shooting, police said.\nAbout 45 minutes earlier and three blocks away, police responded to a shooting in the 2100 block of Druid Hill Ave. At around 6:45 p.m. officers found a 44-year-old woman shot in the leg. She was transported to a nearby hospital for treatment.\nAnd around 1:10 a.m., a 31-year-old man was shot in an attempted robbery in Northwest Baltimore, police said.\nOfficers found the man shot in the stomach in the 7000 block of Surrey Drive in Fallstaff, police said.\nHe was taken to a hospital, where he was treated for his injuries. His condition was not released.\nAnyone with information may call Metro Crime Stoppers at 1-866-7LOCKUP.\ntwitter.com/cmcampbell6\ntwitter.com/DougDonovan"}