{"uri": "http://www.mlive.com/news/muskegon/index.ssf/2013/12/muskegon_county_sheriff_workin.html", "title": "Muskegon County sheriff: shooter at large; different person held on charges", "dct": "Mon, 23 Dec 2013 11:11:00 GMT", "id": "ffec380745d4efc0d1ec8339bb47582d", "content": "MUSKEGON, MI – The Muskegon County Sheriff’s office is working to identify a suspect in fatal shooting Saturday morning at a Fruitland Township house party.\nAs part of the ongoing investigation, one person who attended the party is being held on charges, but authorities don't suspect that person to be the shooter.\nOne man, Gary Lee Ogreen, was killed in the shooting and three others were injured. The shooting was reported 3:30 a.m. Saturday after a group of uninvited guests showed up to a house party in the 2300 block of West McMillan Road in Fruitland Township.\nMuskegon County Sheriff Dean Roesler said Monday that the shooting appears to be the work of a single gunman. Officers are seeking to identify a suspect who remains at large.\nRoesler said they are trying to identify everyone who was at the party and conduct interviews.\n“Part of the process is identifying everyone who was there,” he said. “We’re getting some cooperation from some people … very little from others.”\nOne person at the party, who is not suspected of being the shooter, is being held on other charges, Roesler said.\nNo funeral arrangements have been announced for Ogreen, who died at the scene of the shooting.\nThree other men were injured in the shooting:\nCody James Sharlow, who was shot in the stomach and hip area, has been upgraded from critical to fair condition, Mercy Health Muskegon spokeswoman Joan Kessler said Monday morning.\nNicholas Aaron Gifford, shot in the right thigh, has been upgraded from serious to fair condition, Kessler said.\nMedical staff as of Sunday had treated and released Julius Scott Pamer, who was shot in the buttocks.\nRoesler said that every indication so far in the investigation is that the shooting arose out of a confrontation between the uninvited guests and those already at the house party. The argument escalated to a physical confrontation. The indication so far is that one member of the uninvited group became upset and pulled out a handgun, Roesler said.\nRelated - Muskegon County Sheriff: 1 dead, 3 injured at Fruitland Township house party"}