{"uri": "http://www.latimes.com/local/lanow/la-me-ln-paramount-shooting-mistake-20161202-story.html", "title": "Los Angeles County sheriff's deputy accidentally shoots arson suspect in the buttocks", "dct": "Fri, 02 Dec 2016 17:35:00 GMT", "id": "649a84569507e67c78d1c851128cd799", "content": "A Los Angeles County sheriff’s deputy accidentally shot an arson suspect as the man fought with deputies in front of his burning home in Paramount, authorities said Friday.\nWhen county firefighters pulled up to Rodolfo Martinez’s home Thursday afternoon, the house was engulfed in flames and Martinez was refusing to leave the building, officials said.\nArmed with a fire extinguisher, Martinez, 32, used it to fight off the firefighters trying to put out the blaze, said sheriff’s homicide Lt. John Corina, who is investigating the incident because a deputy fired a weapon.\nMartinez hit one firefighter with the extinguisher and sprayed its contents at the others until they retreated and called sheriff’s deputies for backup, according to a news release.\n“He’s taking medication, he’s been depressed and can’t find work,” Corina said of Martinez, who was living with his parents at the home in the 6500 block of San Luis Street.\nAuthorities allege Martinez lit four fires inside the home while his parents were away. His parents told authorities he had never been suicidal and the motive for the fires was under investigation, Corina said.\nWhen deputies arrived to help, Martinez grabbed his father’s walker and fought them, according to a news release.\nIt took three deputies — two women and a man — to wrestle Martinez to the ground, Corina said.\nWhat happened from there came in quick succession, authorities said.\nMartinez managed to grab at a gun of one of the female deputies that was unclasped from its holster, so a firefighter jumped into the melee to help, Corina said. Meanwhile, At the same time, the male deputy stepped back and pulled out his gun to possibly shoot Martinez, Corina said.\nBut before the male deputy fired, a fourth deputy ran up with a Taser to use on Martinez, so the male deputy decided to holster his weapon, Corina said.\nBut the weapon discharged, Corina said. The gunshot struck Martinez in the buttocks, but the wound was not noticed in the commotion, he said.\nMartinez was ultimately subdued and taken to the hospital, where the gunshot wound was discovered. Martinez is expected to survive and was booked on suspicion of arson, assault on a peace officer and firefighter, and attempting to disarm a peace officer. He is being held on $350,000 bail.\nThe deputies were treated for smoke inhalation and released. The deputy who mistakenly shot Martinez was put on paid administrative leave pending an investigation.\nInvestigators plan on testing all the deputies’ guns to verify that it was the male deputy who fired, Corina said.\nFor breaking California news, follow @JosephSerna on Twitter."}