{"uri": "http://www.abc-7.com/story/24325491/two-juveniles-shot-in-lehigh", "title": "Two teens arrested in Lehigh shooting", "dct": "Mon, 30 Dec 2013 17:21:00 GMT", "id": "af6f2c437c00e0877a65226139e3a1e6", "content": "LEHIGH ACRES -\nDeputies have arrested two teenagers in connection to a Sunday night shooting that injured two other teenagers in Lehigh Acres.\nDeputies say shots were fired just after 9 p.m. near the corner of Douglas Lane and Hightower Avenue South.\n19-year-old victim Marquita Hill tells us she was standing outside her home when she and her brother Martavis Hill felt the first shots.\nThe gunman was armed with a shotgun and fired off multiple rounds. His victims believe his intent was sinister.\n\"He came to kill me last night,\" said Marquita.\nShe says she remembers seeing what looked like a shot gun and felt what she thinks were pellets fired from the shot gun.\n\"They started shooting, and they heard my mother say she was calling the police, and he said, 'oh you can call the police, I'm still gonna shoot,' and he started shooting,\" she explained.\nWhen deputies arrived they set up a perimeter near the area. K-9 units led deputies to an apartment complex along Gretchen Avenue, where the two suspects reportedly live.\nDeputies say 16-year-old Arvis Brown and 18-year-old Jahleel Potts were arrested after surrendering.\nMarquita and her brother were treated at a local hospital for non-life threatening injuries, but have since been released.\n\"They were all bleeding the same. The little bullets were inside my leg. The hospital had to push them all out,\" said Marquita.\nMarquita tells us Brown is her ex-boyfriend. The mother of a four-year-old says he showed up without warning. The two had not spoken in five months.\n\"He's not getting the attention he wants from me anymore,\" said Marquita.\nBrown and Potts were charged with aggravated battery with a deadly weapon.\nAt their first appearance Monday morning, a judge sentenced the pair to 21 days in a detention center.\nPotts, who turned 18 on Monday, is being treated as a juvenile because he was 17 during the time of the crime.\nAfter the sentence is complete, the State Attorney's Office will determine if either of the suspects will face adult charges.\nAs for the victims, Marquita says what scared her the most is the idea of leaving her 4-year-old son without a mom.\n\"That's why I'm thankful to still be here, to know he still has his mother alive with him,\" she said."}