{"uri": "http://www.pjstar.com/news/20160729/17-year-old-found-shot-to-death-in-yard-of-east-bluff-home", "title": "17-year-old found shot to death in yard of East Bluff home; youth was looking forward to becoming a father", "dct": "NODATE", "id": "93477214aa4fcd9707a1ad9aa3e9e7da", "content": "PEORIA - Family of an East Bluff man shot to death late Thursday night say he wanted to be a structural engineer and was loved by \"thousands.\"\nA testament to that was the crowd of about 300 that attended a candlelight vigil Friday evening for 17-year-old Aubrae M. Harper Jr. on East Republic Street, said Harper's mother, Keyiana Jackson.\n\"He knew everybody, and everybody knew him,\" said Dumaruria Wilson, 17, Harper's cousin. \"He was loved.\"\nAnthony Barlow, Harper's grandfather, said the teen was planning on again enrolling at Peoria High School after spending last year at Woodruff Career and Technical Center, 1800 NE Perry Ave. He wasn't the type of kid to get involved with street violence, Barlow said, a thought reiterated by Harper's great-great-uncle Kenneth Hill Sr.\n\"We have five generations here,\" he said, looking over at Harper's home, 901 E. Republic St., where several people had gathered earlier to pay their condolences. Cars kept driving up to the house, located across the street from Glen Oak Community Learning Center. People would get out, walk up and give out hugs. \"We aren't about that, here. We have all worked. Dooie (Harper's nickname) was working since he was 11, when he would take trash for seniors.\"\nAubrae M. Harper Jr., 17, was shot to death Thursday night and found in a back yard in the 400 block of East Republic Street. Police have asked that if anyone has information regarding this incident, please call 673-4521 or Crime Stoppers anonymously at 673-9000.\nPeoria Community Against Violence will hold a Murder Stand Down for Peace at 6 p.m. Sunday at the Gateway Building, 200 NE Water St. Residents are encouraged to attend to show support for the family and come together in solidarity as a community to express the need to end these acts of violence.\nFor more information on Peoria Community Against Violence, go to www.peoriacommunityagainstviolence.org.\nPeoria police said Friday they hadn't made any arrests in the fatal shooting that occurred apparently near a vacant house at 405 E. Republic St. Four placards marked spots on grass-patched driveway where shell casings had fallen. Harper was found in a back yard in the 400 block of East Republic with multiple gunshot wounds, said Peoria County Coroner Johnna Ingersoll on Friday. An autopsy was planned for Friday afternoon, but the coroner said Harper suffered a gunshot wound to his chest that likely contributed to his death.\nWilson and Bryan Williams, 18, said they became friends with Harper before they even realized he was their cousin, calling him a very family-oriented man.\nHarper was going to be a father in a few months, said Williams, who recently became a father himself.\n\"He was excited,\" he said of Harper, who had been coming to him with questions about parenting, like how often to change diapers.\n\"Even though he's gone, he still loves that child, boy or girl,\" said Wilson, who remembered recently sitting on his porch with Harper until 2 a.m., talking about life.\nIngersoll said a resident had let out her dog about 10:20 p.m. Thursday when she noticed Harper, who was located lying on his back near the rear of her fenced-in yard. It wasn't clear how Harper had gotten into the yard or if he knew the resident. Ingersoll said Harper's family had told a member of her office that he had friends who lived in the 400 block of East Republic.\nEarlier Thursday, about 8:48 p.m., a ShotSpotter gunfire detection alert summoned officers to the same block. But police found nothing then that would indicate a crime scene. They went back to the area after the resident who found Harper in her yard called 911. He was pronounced dead at the scene, Ingersoll said.\nThat fit with accounts from neighbors who said they heard several \"booms\" about 8:45 p.m. The police came, they said, but didn't \"look hard\" and didn't go into the backyards. One woman, who asked not to be named, said she saw four teens run from the area of the vacant house at 405 E. Republic and into an alley across the street. She said she didn't see the shooting.\nAbout an hour before the ShotSpotter alert, East Bluff residents voiced concerns about gun violence and the quality of life in the neighborhood to Peoria Police Chief Jerry Mitchell and other local figures.\nThe meeting was held at the East Bluff Community Center, two streets south of where Harper's body was found hours later.\nBarlow said his grandson had left the house at about 8:45 p.m. on his bicycle. He said police told him that Harper was shot while on his bike, and had hopped a fence into the backyard of 409 E. Republic, where he was found.\n\"He laid there for an hour and a half before they found him,\" said Barlow, who added that Harper wasn't involved with any gangs. He knew of no one who would have wanted Harper dead.\nWilliams said Harper, employed at McDonald's, was working hard to live the best life he could so he could take care of his future family.\nHe said his friend's death still feels like a dream.\n\"It's too early,\" he said. \"I feel like this came out of nowhere. He was never a trouble maker.\"\nHours after the candlelight vigil, a couple hundred people still were gathered at the family's home.\nJackson said the community has been incredibly supportive so far.\n\"I just want him to rest in peace,\" she said.\nAndy Kravetz is the Journal Star public safety reporter. He can be reached at 686-3283 and akravetz@pjstar.com. Follow him on Twitter @andykravetz. Anna Spoerre can be reached at 686-3296 and aspoerre@pjstar.com. Follow her on Twitter @annaspoerre."}