{"uri": "http://www.mlive.com/news/flint/index.ssf/2016/02/flint_man_faces_trial_for_sexu.html?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+flint_journal_news+%28Flint+Journal+News+-+MLive.com%29", "title": "Man accused of sexually assaulting and shooting toddler son to stand trial", "dct": "Wed, 24 Feb 2016 15:00:00 GMT", "id": "0c3a22be0b0725ec4670ba277b7644ab", "content": "FLINT, MI - A Flint man accused of sexually assaulting his toddler son and then shooting him in the face with a pellet gun has withdrawn his no contest plea and will proceed toward trial.\nGenesee Circuit Judge Geoffrey Neithercut granted a motion Monday, Feb. 22, from Dustin Edward Griffin asking to remove his no contest plea in the attack on his 15-month-old son. Griffin entered the plea in November to sexual assault, child abuse and assault charges.\n\"I need to go back to therapy, I don't need jail,\" Griffin allegedly told police, according to court records. \"I don't need to be in my own little cell for eight hours a day. I'm not that kind of person. I'm not a monster.\"\nA no contest plea is not an admission of guilt but is treated as such during sentencing.\nGriffin's attorney, Donald Shaw, argued Griffin, while being represented by a different attorney, was not made aware of all the particulars of his case, including not having received reports and statements that could have been in his favor if the case would have proceeded to trial.\nShaw could not be reached for comment.\nHowever, prosecutors argued that Griffin waived any potential defense when he entered his plea agreement.\nGenesee County Prosecutor David Leyton declined to comment on the judge's decision.\nGriffin, 22, was arrested after his son was injured April 23 and taken to the hospital.\nCourt records show Griffin's son was transported by ambulance to Hurley Medical Center after he sustained a pellet gunshot wound to the face. He was listed in critical condition after the pellet was found lodged against a vertebrae.\nDuring a medical evaluation at the hospital, a nurse discovered evidence of a possible sexual assault on the child.\nFlint Township police questioned Griffin, who initially told them that he was feeding his dog when the pellet gun was struck by the animal and fell to the ground, possibly causing it to discharge, according to court records.\nHowever, police continued to question Griffin on the shooting and eventually confronted him with the evidence regarding the alleged sexual abuse.\nAfter some time, Griffin admitted to sexually assaulting his son and recanted the story about the pellet gun's fall, according to court records.\nGriffin told police he was playing with the pellet gun and pointed it at his son to make him laugh, according to court records. He told police he then pulled the trigger, thinking the gun was empty, because it makes a loud noise, court records show. The gun discharged and struck the child.\nGriffin pleaded no contest to multiple charges, including two charges of first-degree criminal sexual conduct, first-degree child abuse and assault with intent to murder, are all punishable with up to life in prison.\nA jury trial is scheduled for April 19. He faces up to life in prison if convicted."}