{"uri": "http://www.mlive.com/news/flint/index.ssf/2016/07/flint_man_gets_prison_for_sexu.html#incart_2box_news_flint", "title": "Flint man gets prison in sexual assault of toddler who was shot in face", "dct": "Tue, 12 Jul 2016 11:15:00 GMT", "id": "842b542dda54b05e59b336d13ee428cc", "content": "FLINT, MI - Dustin Edward Griffin stood silently Tuesday waiting for a judge to sentence him on accusations he sexually assaulted his toddler son and shot him in the face with a pellet gun.\n\"It's easy to say the whole community is appalled by what you did,\" Genesee Circuit Judge Geoffrey Neithercut told Griffin July 12 before ordering him to serve 25-40 years in prison.\nNeithercut's sentence came after Griffin pleaded no contest to two counts of first-degree criminal sexual conduct, first-degree child abuse and assault with intent to murder. The judge added a 5-10 year prison sentence for a charge of second-degree child abuse.\nA no contest plea is not an admission of guilt, but it is treated as such during sentencing. All of the sentences will run concurrently.\nGriffin previously pleaded no contest in the case, but withdrew his plea in an attempt to stand trial on the accusations. However, a new plea agreement was reached the day before the trial was scheduled to begin.\n\"You're not safe around children,\" Neithercut told Griffin. \"You're dangerous.\"\nA Flint man accused of sexually assaulting his toddler son and then shooting him in the face with a pellet gun has withdrawn his no contest plea and will proceed toward trial.\nThe charges carried the possibility of up to life in prison.\nGriffin, 23, of Flint, was arrested after his son was injured April 23, 2015, and taken to the hospital.\nCourt records show Griffin's son was transported by ambulance to Hurley Medical Center after he sustained a pellet gunshot wound to the face. He was listed in critical condition after the pellet was found lodged against a vertebrae.\nDuring a medical evaluation at the hospital, a nurse discovered evidence of a possible sexual assault on the child.\nFlint Township police questioned Griffin, who initially told them that he was feeding his dog when the pellet gun was struck by the animal and fell to the ground, possibly causing it to discharge, according to court records.\nHowever, police continued to question Griffin on the shooting and eventually confronted him with the evidence regarding the alleged sexual abuse.\nAfter some time, Griffin admitted to sexually assaulting his son and recanted the story about the pellet gun's fall, according to court records.\nGriffin told police he was playing with the pellet gun and pointed it at his son to make him laugh, according to court records. He told police he then pulled the trigger, thinking the gun was empty, because it makes a loud noise, court records show. The gun discharged and struck the child.\nNeithercut was told by a woman currently caring for the child that doctors were unable to remove the pellet, and the child continues to face medical problems related to the incident.\n\"I'm just glad that I can give him the joy he's experiencing now,\" the woman told the judge."}