{"uri": "http://www.theintelligencer.net/page/content.detail/id/612546.html", "title": "Four Shot, One Stabbed Sunday", "dct": "Mon, 22 Sep 2014 00:00:00 GMT", "id": "eec1735901aebb818d4f2cce0419c9d0", "content": "EAST LIVERPOOL – An early-morning shooting Sunday in the East End of East Liverpool left five people injured, four with gunshot wounds and one reportedly with a stab wound.\nPolice responded at 4:53 a.m. to the area of First Avenue and the nearby railroad tracks for reports of shots fired. There, several witnesses gave descriptions of vehicles driven by people reportedly involved in the shootings.\nPatrolman Chris Green located a vehicle matching one of the descriptions and found people inside who were injured, although the specific nature of those passengers’ injuries was not reported.\nOfficers called for an ambulance but then decided to allow the victims to drive themselves to the hospital since it would be quicker than waiting for an ambulance to arrive, according to police.\nMeanwhile, Patrolman Kelsey Hedrick was searching for other victims and found multiple shell casings on the street in front of a house at 440 First Ave.\nWalking up onto the porch, Hedrick discovered more spent casings of a different caliber than those he had found on the street, and the officer called for backup.\nAt the rear of the house, Hedrick reported finding an open door and more spent shell casings. When he entered, he found no one inside the house.\nSome witnesses reported seeing a gun battle with shots fired from the house and from the street, Hedrick reported, also saying one man was shooting from the front and rear porches.\nMeanwhile, Patrolman Greg Faulkner located two additional victims of the alleged firefight on Ohio Avenue, although it was not clear from initial reports whether they were in a vehicle or on foot.\nOne of the women involved, who officers said is in her 20s, suffered a gunshot wound to the face, and they learned later in a phone call from her, a gunshot wound to the arm. She was flown to a Pittsburgh hospital and is expected to recover, Detective Greg Smith reported Sunday night.\nThe other woman reportedly received a stab wound when she and another of the women were fighting. It was unclear whether she received medical treatment.\nOne man went to a Pittsburgh hospital by ground ambulance for a gunshot wound.\nPolice said one victim declined medical treatment.\nThe names of those involved have not been released by police due to the ongoing investigation.\nSmith said it is believed a fight broke out between some of the parties at the Chrome Nightclub in Hancock County in West Virginia, which “boiled over to here,” resulting in the shootout. He declined to say whether the incident could be drug-related.\nActing Captain Fred Flati interviewed some of the victims at East Liverpool City Hospital, and Smith said they gave “a minimal amount of information” at that point, adding “they wouldn’t divulge pertinent details” about the incident.\nSmith said it was too early to determine whether charges will be filed due to the limited amount of information being given by the victims.\nIn addition to the spent shell casings, officers recovered a .40-caliber pistol from the yard outside the house. Bullet holes were found in various parts of the house as well as having struck the front of a home about 200 feet away across the railroad tracks, although they did not penetrate the interior wall. A resident inside was checked by police and found to be unharmed. Bullet holes were also found in a commercial building across the street.\nSmith said several of the victims reside at the First Avenue home, which is owned by Joe Marva Williams of Maine Boulevard, according to the county auditor’s website.\nIn 1999, police had responded to the same house when Williams’ son, Homer, was arrested for aggravated murder after the death of his wife. He ultimately pleaded guilty to involuntary manslaughter in that case.\nAnyone with information about the incident is asked to contact police at 330-385-1234."}