{"uri": "http://www.thomasfamilyfuneralhome.com/view-obituary?obituary=3738", "title": "Alexander Lutes", "dct": "Fri, 14 Nov 2014 15:00:00 GMT", "id": "b7e5f1e89db07cdd6b3e390251d00f6a", "content": "A LIVE webcast of Alexander\\'s service will be available at www.firstlutheran.tv Please paste this link into your web browser\\'s address bar to view. It will not work by simply selecting the link.\nAlexander Ian Stauss Lutes, 15, Minot died on Saturday near Butte, ND.\nAlexander was born on September 8, 1999 at Tripler Army Medical Center in Honolulu, Hawaii to Albin III and JoNell (Getzlaff) Lutes. He was reared and educated at Hickam Air Force Base in Honolulu (1999 - 2003); Buechel Air Base near Bitburg Germany (2003-2007); Fairchild Air Force Base near Spokane WA (2007-2010); Spangdahlen Air Base near Spangdahlem Germany (2010 -2013) before moving to Minot in 2013 where he was presently a student at Central Campus of Minot High School.\nAs a student at Central Campus Alex was active as the President of Key Club and as a student guide and member of the Student Council. Away from school he enjoyed videogames with his friends, softball games with his family, traveling, dancing, singing, woodworking, coin collecting and collecting World War II and car memorabilia.\nAlex loved helping people, animals, traveling Europe, hanging out with his friends, telling jokes, laughing, cooking, but most of all he loved his family and friends.\nAlex’s loving family includes his parents: Albin III and JoNell Lutes of Minot; brothers: Austin and Derek Lutes of Minot; grandparents: Phyllis Getzlaff of Bottineau, Rebecca Lutes and Albin Lutes Jr both of New Castle PA; aunts and uncles: Lynette (Mark) Tungland of Papillion NE, Juliene (Jeff) Mowan of Minot, Curt (Marlene) Getzlaff of Bottineau and Wendi (Matt) Pezzone of Pulaski PA; cousins: Kristin (Jason) Kremer and son Cole, Joshua (Kelsey) and Jenna Tungland, Ryan (Leah) Mowan and son Ezra, Darin Mowan (fiancé Kacie) and son Trevin, Ashley (Shane) Trulson and sons: Kyren and Krue, Kaley (Casey) Mills, Darwin (Kayla) Getzlaff, Madison Taggart, Alexandra, Lucas and Dominick Pezzone and numerous great aunts and great uncles and his extended military family that he loved very much. Also, he is survived by his beloved pets Sophie and Maggie (Yorkshire Terriers) and the “Triplets” (Goldfish).\nAlex was preceded in death by his maternal grandfather Darwin Getzlaff and great grandmother Marilyn Morris.\nBooksigning: Thursday from 2:00 p.m. until 6:00 p.m. in Thomas Family Funeral Home - Minot.\nMemorials are preferred to Souris Valley Animal Shelter of Minot or Piper’s Promise at 4620 Wayne Memorial Dr, Goldsboro, NC 27534.\nSpecial Note: Attendees are invited to bring a canned good food item to the service or booksigning for a food drive in his honor and to wear something red in memory of Alex.\nDownload PDF of Flowers Received"}