{"uri": "http://fox59.com/2015/03/25/family-member-of-quadruple-homicide-victims-enough-is-enough/", "title": "Family member of quadruple homicide victims: ‘Enough is enough’", "dct": "Wed, 25 Mar 2015 18:18:00 GMT", "id": "388f56327079d427912987036fa67993", "content": "INDIANAPOLIS, Ind. (March 23, 2015) - The bodies of four people sat inside a near northwest side home as Gene Taylor waited to have his worst fears confirmed. His sister, Sherry Taylor and niece Tiara Turner were killed. He knew all four homicide victims and describes the others as his cousins.\n\"This is my family, I want to find out who did this whoever did this is still out there and they're going to do it again if they're not caught and I know somebody out there knows something I just wish they would have the courage to step forward,\" said Gene Taylor.\nIndianapolis Metro Police detectives are on the search for suspects after four people were shot and killed in a near northwest side Indianapolis home Tuesday morning. Police were called to the scene in the 3100 block of N. Harding Street shortly after 9 a.m., when the homeowner came home and found four people dead inside.\nThe identities of three of the four victims were made public Wednesday morning. The Marion County Coroner has positively identified the victims as 32-year-old Tiara Turner, 41-year-old Terri Betties, 48-year-old Sherry Taylor and 18-year-old Davon Whitlock.\nWhitlock is the son of Betties, Turner is the cousin of Betties and Taylor is a family friend.\n\"It's senseless, there was no cause for this. Somebody had it in their mind that they were going to take somebody's life,\" said Taylor.\nPolice say there was forced entry into a side door of the home. The house was ransacked, everything was thrown around, and TVs were flipped. All victims had multiple gunshot wounds.\nTen Point Coalition, an anti-violence group, spent Wednesday passing out flyers for a peach march. Volunteers handed out flyers in the neighborhood where the murders happened and urged residents to take a stand against recent violence. The peach march will take place at Pilgrim Baptist Church on March 29. Anyone is invited to attend the march beginning at 1:30 p.m. The church is located at 1060 W. 30th Street.\n\"This crime out here is horrible I mean somebody has got to step up somebody knows something,\" said Taylor.\nIt is not known if police were looking for a single suspect or several suspects.\nIMPD is asking anyone with information to call Crime Stoppers at 317-262-TIPS."}