{"uri": "http://www.usatoday.com/story/news/nation/2015/03/24/4-dead-indianapolis-home/70374450/?utm_source=feedblitz&utm_medium=FeedBlitzRss&utm_campaign=usatodaycomnation-topstories", "title": "4 shot dead in Indianapolis home", "dct": "Tue, 24 Mar 2015 00:00:00 GMT", "id": "d2ca7f0d62936171aea1e37d7aaeee42", "content": "INDIANAPOLIS — Indianapolis Metropolitan Police detectives are investigating the deaths of four people who were found shot multiple times in a home that was broken into and ransacked.\nThe owner of a home called police around 9:45 a.m. Tuesday after she discovered the four victims, three woman and one man, officer Chris Wilburn said.\nTelevisions were toppled over in the home, which Wilburn said was \"ransacked.\" He said there were signs the suspect or suspects forced their way into the residence.\nPolice did not immediately say who the victims are or how they are connected to the female homeowner.\nA crowd of people gathered in the neighborhood throughout the morning and afternoon waiting for information about the victims. Some cried and appeared anguished. One woman vomited on the street.\n\"Please bear with us,\" Police Chief Rick Hite told the anxious group at one point.\nHite said investigators were treating the case as they would if the victims were their own family members, and slowly and carefully combing the home for clues.\nComforting his family members on the street, Charles Richardson said his sister was the person who discovered the victims. He said he was called to his sister's house Tuesday morning, unsure of what he would find.\nPolice allowed him to cross the crime scene tape to be with his sister, who he said was distraught.\n\"I comforted her,\" Richardson said, standing outside on his sister's street.\nBut she couldn't elaborate on what she saw, he said. Like the rest of the group, Richardson said he was waiting to learn who the victims are.\n\"We are praying,\" he said.\nPolice initially described the shootings as \"execution style,\" but Hite later said that description was not accurate.\nInvestigators said each victim was shot multiple times, but would not say where they were hit.\n\"There were a significant amount of shots,\" Wilburn said.\nHite said detectives were \"pursuing information.\"\nHite did not say whether police had any suspects, but he said investigators believe the incident was not a random act of violence.\nThe neighborhood is near one of six focus areas highlighted by the police department last year for extra attention because of their disproportionate amount of violent crime.\nMichael Coleman, a resident of the neighborhood, said North Harding Street appeared normal Tuesday morning until police rushed to the area.\nHe said he was rattled by the police activity.\n\"I'm trying to get out of here in the next month,\" said Coleman.\nOther neighbors echoed his sentiment.\nStanley Brown, a 59-year-old lifelong Indianapolis resident, said he recently invested in vacant lots in a nearby neighborhood, hoping it would pay off if the neighborhood becomes targeted for redevelopment.\nBut he is now wondering if that investment was a mistake.\n\"I don't know if I should try to hold onto it or sell it,\" Brown said.\nOn Saturday less than a half mile away, a man shot and killed his brother because he believed he was shooting an intruder."}