{"uri": "http://www.cleveland.com/metro/index.ssf/2014/11/one_off-duty_akron_police_offi.html", "title": "One off-duty Akron police officer killed, second wounded in bar shooting", "dct": "Mon, 17 Nov 2014 11:54:32 GMT", "id": "04adde6ff612fdc7a8e72963c1b9ae49", "content": "AKRON, Ohio -- The first time Kenan Ivery walked into Papa Don's Pub late Saturday night, police said he was unruly. When he came in a second time, he pulled out a gun and eventually shot five people, killing one off-duty Akron police officer, wounding another, and seriously injuring three customers, police said.\nJustin Winebrenner, 32, died after he was shot in the torso trying to escort Ivery from the bar about 2 a.m. Sunday, Akron police Chief James Nice said at an afternoon press conference.\nThe shooting\nWinebrenner went to a fundraiser earlier that evening. He made a brief pit stop before going to Papa Don's Pub, Nice said.\nIvery, 35, also went to the fundraiser, but Nice said investigators do not believe Ivery followed Winebrenner to the bar. Nice declined to provide details about the fundraiser or elaborate on the extent to which the men knew one another.\nToward the end of the night, Nice said Ivery, 35, came into the Papa Don's and was being unruly. The bar's management asked Ivery to leave, and he did. But he returned a short time later and drew a gun.\nFrightened, the bar's customers looked to Winebrenner -- who was engaged to an employee there and therefore a familiar face -- for help.\nWinebrenner approached Ivery to \"deal with him as a law enforcement officer,\" Nice said without going into more detail. Ivery opened fire, hitting Winebrenner, the second off-duty Akron officer, and three customers.\nNice said investigators do not yet know how many shots Ivery fired, or if Winebrenner returned fire at any point.\nNice declined to release the names of the others injured, including the second officer. The three customers injured suffered potentially life-threatening injuries, and the second officer sustained very minor injuries.\nIvery fled the bar on foot, and Akron police officers launched a manhunt for the 35 year old. K-9 officers sniffed him out a short time later lying down in an empty field by a rail yard less than a mile from the bar, Capt. Daniel Zampelli said.\nDetectives also recovered what they believe was the gun Ivery used in the shooting, police said.\nThe officer\nWinebrenner, a Wadsworth native, came from a family of law enforcement. His father, Robert, is a retired Barberton police officer.\nWinebrenner was hired onto the force in 2007. He was assigned to the patrol division's fourth platoon on the 7 p.m. to 3 a.m. shift, Nice said.\n\"He was a big, strong kid,\" Nice said. \"He was good-natured. He was a well-liked officer.\"\nWinebrenner pulled a man from a burning car in 2011, and has received a department award for a drunken driving arrest, Nice said.\nJessi Ison, who was outside the bar Sunday evening signing a poster board full of good-bye wishes, said she's known Winebrenner since he was six years old.\n\"He was an ugly little kid with big buck teeth,\" Ison said laughing. \"Now he grew up into this handsome, strong police officer.\"\nIson said Winebrenner and his fiancee, whose family owns the restaurant, were planning their wedding together before the shooting. Winebrenner also leaves 4-year-old daughter, who is shown beaming at his side in several Facebook posts.\n\"He was a great guy who loved his daughter to death,\" Ison said. \"You would never expect something like this to happen to him.\"\nWinebrenner is the first active-duty Akron police officer killed since 1994, when a drunk driver ran a red light and struck a patrol car, killing officer George Knaff.\nThe accused\nIvery, of Akron, is charged with aggravated murder and five counts of felonious assault with a weapon. He is scheduled to be arraigned Monday morning in Akron Municipal Court.\nThese are the latest in an adulthood full of charges, including drug and weapons charges ranging from 1997 to May of this year. Nice said this incident underscores criticism he's long lobbed at Ohio lawmakers over the state's law barring convicted felons from owning a gun.\nHe said he's \"disappointed\" that Ohio law doesn't consider breaking the law a \"violent\" crime, which would make punishment more harsh for offenders.\n\"The typical person in Summit County arrested for having an illegal firearm does not do a day in jail,\" Nice said. \"As chiefs, all we can do is keep arresting people.\""}