{"uri": "http://www.nydailynews.com/news/crime/2-arkansas-cops-shot-gun-wielding-suspect-not-custody-article-1.2745617", "title": "Deputy killed by Arkansas gunman who shot two officers during mobile home standoff", "dct": "Wed, 10 Aug 2016 18:39:00 GMT", "id": "de45da660602f31d2f4279f8f2e95f3a", "content": "An Arkansas deputy was killed by a gunman who shot two officers before barricading himself inside his mobile home for an hours-long standoff, police said.\nSebastian County Sheriff Bill Hollenbeck confirmed that 15-year veteran Deputy Bill Cooper, 65, died Wednesday afternoon after being hit in the neck.\nHe said that Cooper and Hackett Police Chief Darrell Spells were shot by 34-year-old Billy Jones when they arrived at his home around 7:15 a.m. for a 911 call from the suspect's father that said his son had pulled a gun.\nSpells was grazed on the forehead and released from a local hospital, Hollenbeck said. A police dog was also shot and has not yet been found.\nJones locked himself inside his trailer and continued firing as more than 200 officers from different agencies arrived and surrounded the property near the Oklahoma border.\nWhile the bullets prompted cops to retreat, the gunman didn’t injure any other officers.\nAfter hours of negotiations, the suspect surrendered shortly before noon. Police swiftly took him into custody.\nAerial video from KHBS showed an explosion near Jones's home early Wednesday afternoon, though it was not immediately clear what caused it.\nHackett Police Chief Darrell Spells is expected to make a full recovery. He was one of two officers shot today. pic.twitter.com/2SPYCyucWF\n— Katelynn Zoellner (@5NEWSKatelynn) August 10, 2016\nHollenbeck said Wednesday afternoon that a bomb squad had found explosive material in Jones' home, but did not elaborate on what it was.\nJones’ criminal history dates to at least 2007, when he was arrested in a police raid of a marijuana growing operation. He was charged with suspicion of manufacturing marijuana, possession of marijuana with intent to distribute, possession of drug paraphernalia and simultaneous possession of drugs and firearms.\nHe was also arrested earlier this year on gun and drug charges, KFSM reported. He had a court date in nearby Fort Smith on Wednesday about whether his suspended sentence should be revoked.\nHollenbeck said during his afternoon press conference that Jones had a rifle and was wearing body armor. He said investigators were looking into whether the attack on officers had been planned.\nThe emotional sheriff began tributes to the fallen officer, also a Marine veteran.\nHe praised the deputy's love of his community, saying \"He was dynamic. He loved his job.\"\nSebastian County is about 150 miles west of Little Rock. Hackett, one of eight cities in the county, has a population of 812."}