{"uri": "http://www.wave3.com/story/31558342/child-grazed-by-bullet-while-playing-outside", "title": "Child grazed by bullet while playing outside", "dct": "Sun, 08 May 2016 22:24:00 GMT", "id": "5807f76b25e2a465cf95a4faf3569ab7", "content": "LOUISVILLE, KY (WAVE) - A 5-year-old boy was grazed by a bullet while playing outside. The shooting happened on Wednesday around 4:15 p.m. at 10th and Magazine Streets in the City View Park housing complex.\nThe child was taken to Kosair Children's Hospital with non-life threatening injuries. Louisville Metro police said he is in good condition and was not the intended target for the shooting.\nResidents who live at City View are outraged that violence is impacting innocent children. One woman said the little boy was visiting family at City View when the shooting happened near a playground. People who live in the area said the boy was playing on a bike when gunshots rang out.\nOTHER NEWS\n+Arrest made after shooting at Russell neighborhood business\nDeborah Todd has lived at the City View Park housing complex for 30 years, she even works at the office. She considers the children in her neighborhood her babies. Todd said the boy was playing on a bike when he was shot.\n\"He was playing and some fools got to shooting,\" Todd said.\nAnother resident said she heard several gunshots. A man who works at City View said bullets were flying and you could see where the bullets hit the trees.\nOne of the bullets could have gone straight through Todd's office window.\n\"Thank God that tree was there or it would have hit my office window,\" she said.\nA woman, who wished to remain anonymous, said her 12-year-old son was at the scene playing when the shooting happened. Not only did the shooting happen near a playground, but also a nursing home, a library and a YMCA. It's also near the scene of another hot spot for crime: Esquire Alley. The site of two shootings over the weekend.\nAll this crime is leaving parents uneasy about letting their kids outside.\n\"It's going to be spring break,\" the concerned parent said. \"What do we do with our children for spring break if they can't come outside and enjoy the nice weather? We as parents are scared for their lives.\"\nPolice have not made any arrests in this case. Anyone with information is asked to call (502) 574-LMPD (5673).\nCopyright 2016 WAVE 3 News. All rights reserved."}