{"uri": "http://www.wlky.com/news/child-injured-in-shooting-in-russell-neighborhood/38659068", "title": "5-year-old injured in Russell neighborhood shooting", "dct": "Thu, 24 Mar 2016 11:09:00 GMT", "id": "98448b5dcd4c4dd8450165c8a0c8de0d", "content": "LOUISVILLE, Ky. —\nThose living along South 10th Street are shaken after gunfire erupts outside an apartment complex there.\nA 5-year-old was grazed by a bullet and rushed to Kosair Children's Hospital. Officials said the child is expected to recover.\nOne witness said a school bus had just pulled up when the shooting started.\n“And then next thing I know, it's just ‘pop, pop, pop, pop, pop,’ and I saw this little boy just dive on the ground,” the witness said.\nThe witness, who does not want to be identified, works at a nursing home just steps from the City View Apartment Complex where shots rang out sometime after 4 p.m.\nShe said she and some of the residents were in the activities room when they heard something unsettling.\n“We were looking at something on the TV and all of a sudden I heard like ‘pop, pop, pop’ and then one of the residents said, it sounds like gunfire,” the witness said.\nCome to find out, it was gunfire.\nNeighbors claim to have heard more than 20 shots.\n“I mean, who would just open fire with kids getting off the school bus? I mean, people just don't have respect or morals about anything anymore,” the witness said.\nMany in the area were glad to learn that the child was not seriously hurt, and likely only grazed by a bullet.\nStill, as investigators work to figure out what happened, some residents shared their outrage, although they wished to remain anonymous.\n“It's very frustrating because you don't know if you can even come out at night. Because you don't know who they looking for or who they going to shoot,” a neighbor said.\nOne man was the most upset that an innocent child got caught up in someone else's problems.\n“This is senseless. The shooting needs to stop,” he said.\nPolice said the child was driven to the hospital in a private vehicle.\nAs far as we know, the 5-year-old was the only one hurt as a result of the shooting.\nAt this time, police do not have any suspects in the case.\nHowever, neighbors said they saw a large group of people standing outside just before the shooting."}