{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-dupage-fatal-police-shooting-20170102-story.html", "title": "DuPage deputy involved in fatal shooting placed on leave; 911 recordings released", "dct": "Wed, 04 Jan 2017 15:30:00 GMT", "id": "013a65f80ec218bfe0be72dd6668f32a", "content": "A 17-year-old was shot to death late Jan. 1, 2017, by a DuPage County sheriff's deputy after the two got into a fight when the deputy responded to a domestic call. (Antonio Perez/Chicago Tribune)\nA DuPage County sheriff's deputy involved in a shooting Sunday night near Villa Park that killed a 17-year-old has been place on paid administrative leave, the sheriff's office said Wednesday morning.\nIn a one-sentence statement, the sheriff's office said the deputy was placed on leave \"per department policy.\"\nThe deputy was not identified.\nThe 17-year-old, identified by his family as Trevon Johnson, was shot to death late Sunday by a sheriff's deputy after the two got into a fight when the deputy responded to a domestic call involving violence, county officials said.\nThe shooting took place after deputies were called about 11:45 p.m. Sunday to a \"report of a violent domestic\" at a home near Standish Lane and Ardmore Avenue in an unincorporated area near Villa Park, according to a sheriff's department news release.\nThe first deputy to arrive got into a fight with the teen, leading to the \"officer-involved shooting,\" according to authorities.\nJohnson was taken to Elmhurst Hospital and later pronounced dead there. The 17-year-old died of multiple gunshot wounds, the DuPage County coroner's office said Tuesday.\nThe incident is being investigated by Illinois State Police.\nThe announcement that the deputy was placed on leave came after the sheriff's office on Tuesday night released recordings of what it said were 911 calls made from the house, prompting police to go there.\nThe sheriff's office released recordings of three calls. In two lengthier calls, callers portray a scene at the house that is chaotic and violent. One caller said Johnson had \"knives\" and other weapons. In a shorter third tape, a person indicates the situation is under control, but loud voices can be heard in the background.\nLarry Rogers Jr., an attorney representing the family, said earlier Tuesday Johnson was unarmed. Rogers had criticized investigators for releasing information about the shooting without providing any evidence, such as 911 tapes or dispatch calls.\n\"It's obviously very early, but this seems to me to clearly be an unjustifiable shooting of a 17-year-old young man who was celebrating the holidays at home with his family,\" Rogers said Tuesday afternoon after meeting with the family.\nRogers declined to say who else was in the home when the shooting occurred.\nJohnson's uncle, Alfonzo Singletary, who said he is pastor of the Tabernacle of Hope Church of God in Christ in Chicago, also said his nephew was unarmed.\n\"I know that the state has already given a narrative, the police department, on what happened, but we want you all to wait until you hear our side, our narrative, before anybody makes any decision or any judgment on what happened,\" he said outside the family home.\n\"It's a difficult time, but we are a strong-knit family, a faith-based family. Through prayer we know that we'll make it through it.\"\nWhen asked if the situation was mishandled, he said, \"Well, I'm gonna let you be the judge. We've got a person who was unarmed, and now he's dead. So you be the judge of that.\"\nHe said Johnson \"was a very important part of our family. He was a young guy, full of energy, had a lot to live for.\"\nState police investigators were investigating at the request of DuPage officials, said Master Sgt. Matt Boerwinkle, a state police spokesman. The sheriff's office said it was not releasing further details until state police completed at least their initial investigation.\nSingletary said his nephew was \"pleasant to be around.\"\nHe said the teen was attending school and also working part time, though he did not know the school or where he was employed.\nSingletary said the family was asking for privacy \"while we go through this period of mourning.\"\nHe said Johnson is survived by his mother and siblings.\nFreelance reporter Clifford Ward contributed.\nlford@chicagotribune.com\nmwalberg@chicagotribune.com"}