{"uri": "http://abc7chicago.com/news/deputy-fatally-shot-teen-during-dupage-county-domestic-call/1684701/", "title": "Deputy fatally shot teen during DuPage County domestic call", "dct": "Tue, 03 Jan 2017 00:00:00 GMT", "id": "eda18a24840617e895d44f02b5eb056a", "content": "VILLA PARK, Ill. (WLS) --\nA DuPage County sheriff's deputy fatally shot a teenage boy after responding to a domestic violence call early Monday in unincorporated suburban Villa Park.\nJust after midnight, the first deputy to arrive at the townhouse near Standish Lane and Ardmore Avenue got into an altercation with 17-year-old Trevon Johnson, prompting the deputy to open fire, according to a statement from the sheriff's office.\nJohnson's family said the teenager and his siblings were squabbling, but had stopped before the sheriff's deputy entered the home.\nPolice released a 911 call made just before deputies responded. The caller can be heard telling the operator Johnson had a butter knife, but no longer has it during the call.\nJohnson was taken to Elmhurst Hospital, where he died.\nFamily said Johnson was a student who had a job and regularly worshipped at his uncle's church.\n\"This 17-year-old is the victim, make no mistake about it. He should not have been shot and killed in his home,\" said Larry Rogers Jr., the Johnson family's attorney.\nIn response to the claims made by the DuPage County sheriff's office, Rogers Jr. released a statement on behalf of the Johnson family.\n\"Our preliminary investigation suggests that this is an unjustified shooting of a 17-year-old kid who was at home celebrating the holidays with his family. He was not mentally handicapped. He was unarmed and was not in an altercation with the officer or anyone else when he was shot. He was doing as he was told when the officer opened fire. This shooting is completely unjustified and this officer should be held accountable for his actions.\"\nThe incident is the first deadly shooting by a deputy there in over 20 years.\n\"We have a person who was unarmed, and now he's dead, so I'm going to let you be the judge of that,\" said Rev. Alfonzo Singletary, the boy's uncle.\nPolice are withholding the name of the deputy who shot Johnson.\nJohnson died of multiple gunshot wounds, according to the DuPage County coroner. His death has been ruled a homicide.\nIllinois State Police are investigating.\nSun-Times Media Wire contributed to this report."}