{"uri": "http://www.wandtv.com/story/34064885/springfield-police-identify-1-in-december-14-shooting", "title": "Springfield police identify 1 in December 14 shooting", "dct": "Thu, 15 Dec 2016 17:51:00 GMT", "id": "787c2d373ae3c398c7e7406834d0c99f", "content": "SPRINGFIELD - The Springfield Police Department says detectives have identified an individual responsible for the December 14 shooting death of an 18-year-old male on the city's northeast side.\nSpringfield police say officers were dispatched to a home in the 2000 block of East Lawrence at about 10:41 a.m. for a report of a shooting. Upon arriving, officers found an 18-year-old male with an apparent gunshot wound to the chest. Emergency responders arrived on scene, and advised officers that the victim had died. Springfield police investigated witnesses, and a search warrant for the home was sought.\nSangamon County Coroner Cinda Edwards identified the victim as Romello Snow, 18. Edwards says preliminary autopsy results revealed that Romello died of a gunshot wound.\nAs a result of the investigation into the shooting, Springfield Police Detectives say they identified Jermaine Snow, 19, as a individual responsible for the shooting death. However, detectives say they believe the shooting was accidental, and will consult with the State's Attorney's Office to determine potential charges.\nSpringfield police say Snow was arrested on December 14 in connection with an unrelated December 11 incident, during which officers say Snow, along with two other males, allegedly forced a 31-year-old man into the back seat of a truck and demanded money. Detectives say Snow allegedly pointed a gun at the victim, and that the victim grabbed the gun, resulting in a struggle for the weapon and the gun being fired once. Detectives add that the other two males jumped out of the truck and ran from the scene, while Snow allegedly drove off in the truck and crash on Outer Park Drive.\nSnow is currently facing preliminary charges of armed robbery, aggravated vehicular hijacking, aggravated discharge of a firearm, and aggravated unlawful use of a weapon.\nWe will provide more information as it becomes available."}