{"uri": "http://miami.cbslocal.com/2017/01/10/ft-lauderdale-woman-daughter-found-dead/", "title": "Ft. Lauderdale Woman Kills Daughter In Tragic Murder-Suicide", "dct": "Tue, 10 Jan 2017 18:15:00 GMT", "id": "7f34f424ca551ef9a72b2fa41280ee34", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nFT LAUDERDALE (CBSMiami) – A heartbreaking scene played out Tuesday morning as the body of a young girl was wheeled out of her home on a gurney by a member of the medical examiner’s office, the body of her mother was not far behind.\n“I heard the like a pop, something like a gunshot,” said neighbor Annie Powell.\n“All of a sudden I heard this, this like explosion and I didn’t look at the time, or anything like that, and I thought well that couldn’t be a gunshot because it had a muffled sound to it,” said another neighbor Joel Gresham.\nWhat made the gunfire sound muffled is that the house was closed up tight, all the hurricane shutters were closed. Neighbors said they saw the woman who lived there, Ericka Joseph, outside in the wee hours of the morning.\n“This shutter right here, she was like closing it up, making sure it was locked and everything and my boyfriend said, “What is she doing, a hurricane is not coming,” said Chaunecia Gresham.\nNow they know.\nThe family said Joseph’s daughter, 9-year-old Akili, lives with her father in Colombia but was visiting her mother for the holidays. According to the family Akili was supposed to return home on Tuesday with her dad.\n“He was here to pick her up because he has custody because he was actually, he has custody of her to stay with him, therefore picking her up. They were supposed to be on a plane at this time,” said Joseph’s brother Tony Williams.\nWhen Akili’s father arrived and received no answer when he knocked on the door, he knew something was wrong. He contacted the family who went inside and made a horrific discovery – mother and daughter dead in a bedroom. The family believes Ericka, an ex marine, may be responsible.\nAuthorities later confirmed that the tragic shooting was indeed a murder-suicide.\n“Apparently she might have been battling something was unbeknownst to the family at this time, which caused now, a great tragedy,” said Williams.\nThe family said there has never been any kind of issue when it came to custody between Akili’s parents.\nAkili would have turned 10 in April."}