{"uri": "http://www.nj.com/hudson/index.ssf/2016/05/teen_accidentally_shoots_himself_while_firing_shot.html#incart_river_index", "title": "Teen shoots himself while firing shots in Jersey City, official says", "dct": "Sun, 29 May 2016 12:26:00 GMT", "id": "c8f181a1f8d63080fe3195a074880feb", "content": "JERSEY CITY -- A 16-year-old shot himself in the leg early this morning after firing shots near a bar on West Side Avenue, a city official said.\nAt about 2:30 a.m., the Belmont Avenue teen was dropped off at Jersey City Medical Center-Barnabas Health with a non life-threatening gunshot wound to his calf, city spokeswoman Jennifer Morrill said.\nPolice investigating the shooting near Gautier Avenue determined the teen shot himself while firing shots, Morrill said. It is not clear who or what the teen was firing at.\nThe teen was charged with possession of a weapon for an unlawful purpose, unlawful possession of a weapon, and possession of a firearms by a minor.\nThe victim of Stegman Street shooting last night remains in critical condition, while many residents say they are beginning to feel uneasy after an uptick in shootings this week.\nJersey City has seen an uptick in gun violence over the past several days:\nThe next day, a man was treated for a gunshot wound at JCMC.\nAt about 11 p.m. on Thursday, a 28-year-old man was fatally shot at Audubon Park and a second victim was critically injured on Stegman Street.\nEarly Friday morning, a man was shot with a BB gun on Woodlawn Avenue.\nAt about 11 p.m. on Friday, a 20-year-old man was shot in the leg near Virginia Avenue and Martin Luther King Drive.\nTwo hours later, shots were fired near Lexington and Bergen avenues. Officials said no one was injured during the gunfire.\nOne woman said residents have been \"jumpy\" after multiple shootings have been reported since the weather has warmer. Jersey City Public Safety Director James Shea told The Jersey Journal on Friday that the city will continue to use \"a large increase in overtime\" this summer."}