{"uri": "http://nbc4i.com/2016/11/22/victim-in-very-critical-condition-after-shooting-near-west-side-wendys/", "title": "Two men shot, one killed in shooting near west side Wendy’s", "dct": "Tue, 22 Nov 2016 18:41:00 GMT", "id": "5923ebdb307a694db5d38c8eac0e3ae0", "content": "COLUMBUS (WCMH) — One person died and another was injured following a shooting near a Wendy’s restaurant in west Columbus.\nMedics were called out to the restaurant on West Broad Street Tuesday evening. The two men were taken to Mount Carmel West, where one of them, Edwin Guerrero, was pronounced dead at 6:49pm. Columbus Police Sergeant Stan Latta said the other victim, whose name is not being released at this time, was in stable condition.\nSgt. Stan Latta said it started as an altercation in the west side parking lot. Shots were fired in both directions between several people.\nColumbus Police say the investigation is ongoing as they work to determine what roles the known and unknown individuals had in the incident.\nThe glass doors to the restaurant were riddled with bullet holes. One Wendy’s employee told NBC4 she was thankful she hadn’t been working that night.\n“In this kind of neighborhood, you never know what you’re going to get,” Lanel Haywood said.\nHaywood, who lives nearby, said she got a call from a coworker and came to the restaurant to find out what happened.\n“It was spooky,” she said. “I never expected something like this to happen where I work at.”\nThe restaurant and its parking lot were surrounded by police tape as detectives cased the scene.\nKelly Sturms was on her way to pick up her niece, who works at the restaurant, when she saw all of the flashing lights of the police cruisers. She called her sister to find out was going on.\n“It just freaked me out,” Sturms said. “Then when I heard that there was [a] shooting, the first thing that came out my mouth: ‘Is she OK?'”\nAs detectives continue to investigate what led up to this, Lanel Haywood is just grateful all her coworkers are safe and glad that she wasn’t there.\n“I don’t know if I would have been able to handle this kind of situation,” Haywood said.\nEarlier Tuesday evening, police said there were three suspects, last seen running down an alley. Police said security cameras could play a major role in tracking down anyone who fled the scene.\nPolice don't know yet what fight was about. Restaurant was hit by shots fired from outside. Some evidence found inside. @nbc4i\n— Olivia Fecteau (@oliviafecteau) November 23, 2016\nNot releasing any suspect info right now – police still trying to figure out who's a suspect vs. a victim. Self-defense possible @nbc4i\n— Olivia Fecteau (@oliviafecteau) November 23, 2016\nKeep checking NBC4i.com for real-time updates on this story. To get alerts for breaking news, grab the free NBC4 News App for iPhone or Android. You can also sign up for email alerts."}