{"uri": "http://www.wdbj7.com/content/news/Shooting-reported-on-Campbell-Ave-in-Roanoke-398317061.html", "title": "Roanoke police identify FreightCar America shooter", "dct": "Tue, 25 Oct 2016 19:08:00 GMT", "id": "7ce5ade6ae6894a8ce37ad074324e0aa", "content": "ROANOKE, Va. (WDBJ7) The man who opened fire at FreightCar America on Tuesday morning has been identified by Roanoke police.\nInvestigators have identified 53-year-old Getachew Fekede as the shooter. He is from Kenya.\nPolice say Fekede killed one person, wounded three others, and then killed himself. One of the victims has been released from the hospital. Another victim is in serious condition, and the third victim is in good condition. Two of the victims suffered wounds to their lower extremities. A bullet grazed a third person's chest.\nRoanoke police say Fekede fired around 10 rounds from a 9 mm semi-automatic handgun.\nFekede last worked at FreightCar America in March. Police said he stopped showing up to work. Fekede arrived at the building by bicycle on Tuesday morning, police say.\n\"They had no previous contact with him until today's event, and all indications were at the time he was there a hard worker, so we have no true indication as to what might have led to him taking these acts of violence out on this location,\" Roanoke City Police Chief Tim Jones said.\nRoanoke police received a call about shots fired shortly after 6 a.m. Tuesday.\nFekede came to Virginia in 2011 as part of a refugee program.\nPolice believe the shooting was an isolated attack.\nFreightCar America opened in Roanoke in 2005. The company invested more than $5 million, bringing the old East End Shops back to life.\nWithin one year, FreightCar America employed more than 400 people, producing 12 aluminum coal cars a day. But in 2009 a difficult market forced FreightCar America to cease production in Roanoke and lay off workers. That changed two years later when a Norfolk Southern $100 million order brought back hundreds of jobs.\nORIGINAL STORY\nTwo people have died and three others have been hurt in an early morning shooting at FreightCar America in Roanoke.\nAt 6:08 a.m., the reports came in about a shooting on the 800 block of Campbell Ave. at FreightCar America.\nThe shooter is one of the two dead. Police believe the shooter took his own life. They also say he was either an employee or former employee.\nThree victims were taken to Carilion Roanoke Memorial Hospital. One is in good condition, one is in fair condition and the third is in serious condition.\nThe search of several FreightCar America buildings has ended. No suspicious devices were found. Police are now focusing on the investigation into the incident. There will be a 3 p.m. news conference, which WDBJ7 plans to live stream. Click here at 3 p.m. to watch the news conference live.\nRoanoke police say there is no indication of further threats to the public at this time.\nThere were no officers involved in the shooting.\nThere was one known witness who hid in a bathroom during the shooting.\n\"As soon as we started work it said active shooter - we all hid and did everything we were supposed to - we got organized and they took care of it,\" FreightCar America employee Michael Ewing said. \"I was pretty close. I didn't get to see anything but i was about a minute away from it -- from actually being in there.\"\nAuthorities swept the area to check for possible explosive devices, but nothing was found. They believe that the major threat has been neutralized.\n\"We do know that there was an active shooter on scene. We do not know names. We have two fatalities that we can confirm at this time. There are several other people – two, possibly three – that have been transported to local hospitals with gunshot wounds,\" Roanoke City Police Chief Tim Jones said. \"Again, the active shooter, we believe at this point, took his own life after shooting several people. This is a very large facility. It is an active investigation.\"\nDozens of Norfolk Southern and FreightCar America employees were waiting at Tazewell Ave. and 8 1/2 Street alongside media. Norfolk Southern employees were allowed to enter and exit the locomotive shop sometime after 10 a.m.\nCommunity High School will be closed on Tuesday.\nThere is heavy police presence in the area. State police are also on the scene. Police expect to be on scene for several more hours.\nThe road is blocked off. Police pushed back the original perimeter to Tazewell Ave.\nThe victims have not been named at this time.\nCarilion is a level one trauma center, which means they train and prepare all the time for situations like this.\nCarilion says they handle this kind of situation the same way they would a multiple-casualty situation.\n\"It's not infrequent for us to have two patients come in at the same time -- sometimes three,” said Andi Wright, director of trauma service for Carilion. “We have had as many as seven come in at one time and that certainly does tax us in terms of resources, whether it's staff equipment and so forth. It doesn't mean that we don't have it. It just might not be handy right here and we have to get it from another place. But again, those are the kinds of things that we're trained for that we prepare for.\""}