{"uri": "http://www.southbendtribune.com/news/elkhart-police-investigate-shooting-of--year-old/article_07d6f63e-7186-11e4-920f-23042feba925.html", "title": "Boy, 3, dies following shooting in Elkhart", "dct": "Sat, 22 Nov 2014 00:00:00 GMT", "id": "baa942cfbae058994ecb29b2f03e624a", "content": "ELKHART — There remain more questions than answers a day after a 3-year-old Elkhart boy reportedly shot himself in the head once and died.\nElkhart police Sgt. Chris Snyder said officers were called to a house in the 2100 block of Morton Avenue shortly before 7:30 p.m. Thursday. When they arrived, they found the boy, Jeremiah Ross, suffering from a single gunshot wound to his head.\n\"The officers arrived within about a minute of receiving the dispatch,\" Snyder said. \"They got there and they were able to provide first aid to that child until the medics from the Elkhart Fire Department arrived.\"\nRoss was taken to Memorial Hospital of South Bend and arrangements were being made to transfer him to Riley Hospital for Children in Indianapolis, Snyder said. As doctors attempted to stabilize Ross, he died from his injuries late Thursday at the hospital in South Bend, police said.\nSnyder said he was unable to get into many specifics surrounding the circumstances of the shooting, including where the gun was and how the boy was able to get a hold of the weapon. Investigators are also still attempting to determine who is the registered owner of the gun. Police would not say what type of firearm was involved in the incident.\n\"I can't talk about any of the details,\" Snyder said. \"Like I said, right now it's still under investigation. Our detectives will determine where the gun was and how it became accessible to him.\"\nSnyder said the boy was home with one of his parents at the time of the shooting. He declined to elaborate on who was home with the boy.\n\"Especially when a child's involved with something like this it's hard for everybody that's involved, the officers that were first on the scene, the detectives that have to go out there,\" Snyder said. \"It's certainly a very difficult time and a very difficult case for us to have to deal with.\"\nSnyder said gun owners need to take every precaution to ensure their weapons are secure, particularly when children are present.\n\"You definitely want to keep your firearms locked up. You want to keep them out of the reach of children, gun locks, lock boxes that are up in high places,\" Snyder said. \"It's also important when children are old enough to speak to them about gun safety so that they know what can happen and the responsibilities that come with being the owner of a gun.\"\nNo charges have as yet been filed stemming from the incident. Any charges would come following a review of the case by the Elkhart County Prosecutor's Office, Snyder said.\n@BobBlakeSBT"}