{"uri": "http://www.tennessean.com/story/news/local/robertson/2017/01/09/clarksville-boy-11-killed-sunday-robertson-hunt/96334442/", "title": "Clarksville boy, 11, killed during Robertson hunting trip", "dct": "Sun, 08 Jan 2017 00:00:00 GMT", "id": "7f35a8df1b9c4371668019a8741c7cd0", "content": "The Robertson County Sheriff’s Office is investigating the Sunday shooting death of an 11-year-old boy, killed during a hunting trip in Cedar Hill.\nEmergency officials were called to the Three Feathers Hunting Preserve on Smith Road at about 2:45 p.m. in reference to an “accidental gunshot,” according to Robertson County Emergency Management Services (EMS) Assistant Director Russell Gupton.\nInitial reports indicated the victim was a 12-year-old male, but records from Robertson EMS say the child was 11 years old and resided in Clarksville, Gupton said.\nAdams Fire Chief Ray Brown was among the first on the scene, he said during a Monday morning phone call.\n\"There were two people doing CPR, one was a woman and I heard her say she was a nurse at the hospital,\" Brown said. \"The boy's daddy was holding him ... It was one of those deals where everything was 'let's go, let's load the victim and get him to the ambulance.'\n\"It was bad.\"\nThe boy, who remained unidentified as of Monday morning, had been shot in the side by a 20-gauge shotgun, Brown said.\nIt was not immediately clear how the shooting had taken place.\n\"He wasn't holding the gun, but it was close by,\" Brown said. \"Once we got him to the paramedics, they continued CPR a little longer, and then they called it. There was nothing we could have done. It was just a bad episode.\"\nRobertson County Sheriff's Office Spokesman Ryan Martin confirmed Monday that an investigation was underway, but did not release any additional details.\nAn autopsy is pending “as is normal procedure in this type of situation,” Gupton said.\nA veteran firefighter of nearly 30 years, Brown described the situation as a horrible accident and said he felt awful for the boy's father.\n\"This is not the first time we've seen something like this, and you have your own ways of dealing with it,\" he said. \"We kind of all get together and talk about it.\"\nThree Feathers has been open in Cedar Hill, near the Kentucky border, since 2004, according to its website.\nThe preserve is situated on 40 acres of a working farm that produces tobacco, wheat and hay, and it specializes in private hunts for game birds, such as quail, pheasants and chukar, a kind of partridge, the website said.\nThis is a developing story. Check back for additional details as they become available."}