{"uri": "http://www.chicagotribune.com/suburbs/lake-county-news-sun/crime/ct-lns-waukegan-student-slaying-arrest-st-0106-20170105-story.html#nt=oft13a-1gp1", "title": "Man wanted in fatal shooting of Waukegan High School student arrested in Tennessee", "dct": "Thu, 05 Jan 2017 16:16:00 GMT", "id": "34e22c48dbead1d2bb3dd7168a46a5c4", "content": "A man wanted in the November killing of a Waukegan High School student was arrested in Tennessee this week and brought back to Lake County, where his bail was set at $3 million Thursday.\nWillie C. Jackson, 18, of Waukegan, had been the subject of an outstanding arrest warrant for murder in the Nov. 11 fatal shooting of Dayviontay Jackson.\nJackson is currently charged with two counts of first-degree murder and was in the custody of the Lake County Jail early Thursday.\nWaukegan Police Cmdr. Joe Florip confirmed Thursday that Willie Jackson, who is not related to the victim, was arrested in Tennessee and brought back to Lake County by Waukegan officers this week.\nFlorip said further details on the arrest would be issued at a later time.\nJackson appeared in Lake County Circuit Court Thursday morning, where authorities said his bond was set at $3 million, the same amount specified in the arrest warrant. A status of attorney hearing for Jackson was scheduled for Jan. 10, according to Lake County Circuit Court Clerk records.\nWaukegan police announced Dec. 1 that a murder warrant had been issued for Jackson in the shooting death of Dayviontay Jackson. According to police, an argument escalated into the shooting of Dayviontay Jackson by Willie Jackson.\nWaukegan investigators had previously said they believed Willie Jackson had fled the greater Chicago area after the shooting.\nDayviontay Jackson was a senior and former JROTC cadet at Waukegan High School, according to school spokesman Nicholas Alajakis.\nIn a previous interview, his mother, Shukeitha, said her son had just left their house less than two hours before the shooting on the night he was killed.\n\"He wanted to be a Navy SEAL and was going to join the Navy after school,\" she said. \"He was a family guy, a good guy. He had a lot of friends. He was a real sweetheart.\"\nTwitter @jimnewton5"}