{"uri": "http://www.nbcbayarea.com/news/local/7-Year-Old-Boy-Shot-in-Chest-During-Target-Practice-22-Caliber-Georgetown-273560031.html", "title": "7-Year-Old Boy Struck in Chest During Target Practice: Sheriff", "dct": "NODATE", "id": "72809febd6582e9d701a86a0f1f109f6", "content": "A 7-year-old boy from the Bay Area was flown to the hospital after he was injured while target practicing with a .22-caliber rifle as his father stood nearby.\nBut the San Mateo County boy was released from UC Davis on Sunday - the day after the injury - according to El Dorado County Sheriff's Sgt. Chris Felton, who spoke to NBC Bay Area by phone on Tuesday.\nFelton declined to say what city the boy lived in, or release many other details, including exactly how the boy received his chest injury. \"The detectives just got the case,'' he said. \"We don't know if it was a bullet fragment, or a piece of the target, or anything else.\"\nThe boy was wounded Saturday while out shooting with his dad at the wooded family property on Bottle Hill Road in Georgetown, near Auburn. At some point, the sheriff's department said the boy began to complain of chest pain. When his dad went to check, he saw his son had a hole in his T-shirt, the sheriff's department said, and he was bleeding.\n7-Year-Old Boy Struck in Chest During Target Practice: Sheriff\n\"The parents were watching,\" Lt. Tim Becker told NBC affiliate KCRA in Sacramento. \"His dad was right there.\"\nBecker did not state who fired the bullet that struck the boy. Sources told KCRA it seemed like pieces of a bullet apparently ricocheted into his chest, but Felton did not confirm that. He added it was possible the sharp object that pierced the boy's chest was something altogether.\nThe boy's injury comes a week after another high-profile shooting involving a young child. On Aug. 25, a 9-year-old girl at a shooting range outside Las Vegas accidentally killed her instructor when she lost control of the Uzi he was showing her how to use. The sheriff in that case said no citations would be issued and no charges would be filed because the shooting range is a licensed, legal operation.\nThe girl's accidental shooting reignited a debate for some about how old people should be when they pick up a firearm.\nThere are laws on the books that already dictate that.\nIn California, minors are allowed to use handguns or live ammunition, as long as they are accompanied by a parent or guardian and the child is \"actively engaged in a lawful recreational sporting, ranching or hunting activity.\" The Attorney General's Office states it's even OK if the minor has written consent from an adult. Federal law states people can possess a handgun if they are younger than 18, as long as they are using the weapon for recreational shooting or target practice.\nCalifornia, however, is one of 29 states that also has \"child access prevention laws,\" where laws impose possible criminal liability on adults who give children unsupervised access to firearms, according to the Law Center to Prevent Gun Violence.\nThere are 21 states, including Arizona, that have no laws restricting the access of guns to minors under 18, as long as there is adult supervision. And 14 states prohibit someone from \"intentionally, knowingly, and/or recklessly providing some or all firearms to children,\" the center reports.\nIn both the Arizona and California, the children were supervised by either a guardian or a parent.\nIn El Dorado County, sheriff's deputies received a call from Cal-Fire that the boy had been injured while shooting targets at a range the family had constructed on their wooded property.\nHe and his dad were shooting targets positioned about 40 yards away, the sheriff's department said in a statement. Many relatives were watching father and son. The boy had a single shot .22 caliber bolt action youth rifle, and his father was shooting a \"larger caliber rifle,\" the sheriff's statement said. There is no law that prohibits children from target practice, Felton said.\nWhen the father saw his son bleeding from the chest, he immediately took his son to the Georgetown fire station, were he was picked up by a helicopter and transported to UC Davis Medical Center near Sacramento, the sheriff said.\nBecker said that \"preliminarily the deputies that went out there said that the guns weren't being pointed at anybody. There was plenty of supervision there. They had a pretty good range set up.\"\nStill, Becker said that while it all looked \"relatively safe, firearms are tools, just like any tools. People get hurt by tools and accidents happen.\"\nNBC Bay Area's Shelby Hansen and Kinsey Kirakos contributed to this report."}