{"uri": "http://ktul.com/news/local/family-speaks-out-over-alleged-road-rage-death-of-teen", "title": "Family speaks out over alleged road rage death of teen", "dct": "NODATE", "id": "a3f12d761ced99fd5e1a16c857514b15", "content": "TULSA, Okla. (KTUL) —\nTulsa police suspect road rage may be the motive behind a shooting that killed 17-year-old Daniel Carter and left a 16-year-old girl in critical condition.\nPolice say the car the teens were riding in Tuesday pulled up at a stop sign at North Madison and Virgin. The driver honked the horn in an effort to get a car stopped at the intersection to move.\nPolice say the driver of the stopped car got out and fired a gun. Carter was shot in the chest and died of his injuries.\nThe teen was known as a basketball player and a jokester, but his father says Carter was troubled.\n\"I talked to him like three days before this incident happened and he was crying out to me. And I told my wife, I said, 'Babe, let's just go get him, let's do something different,'' said Gerald Fryar, who said he had been in trouble with the law and wanted to save his son.\nFryar says he packed up his family in Las Vegas and started the 17-hour trip to surprise Carter.\nWhen they arrived late Tuesday night, he received news that his son had been killed.\n\"He loved life, and somebody snatched it from him over a horn, a honk of a horn. It's that serious? You took a life and now a little girl is fighting, too?\" said Wendy Fryar, Carter's stepmother.\nPolice say a 16-year-old girl was also injured in the shooting.\nSergeant Dave Walker says road rage is the only motive police have at this time.\n\"We have dead guy, a 17-year-old kid dead, a 16-year-old fighting for her life, for a horn honking. That is absurd,\" said Walker, who suspects the shooter may have been under the influence, which might have triggered the shooting.\nCarter's family wishes they'd arrived just a little earlier to truly save the teen.\nGerald Fryar says he will never forget the last time he saw his son because of the picture they took together.\n\"He said, 'Dad, can I take a picture with you?' But I didn't know that would be my last picture with my son,\" said Fryar.\nPolice are looking for up to two suspects who were in a light-colored, larger vehicle in the Lacy Park area Tuesday night. Police believe the shooter might have been acting irrationally, on drugs or under the influence.\nAnyone with information is asked to call Crime Stoppers at (918) 596-COPS."}