{"uri": "http://www.localmemphis.com/news/local-news/victim-shooter-identified-in-southaven-murder-suicide", "title": "Victim And Shooter Identified In Southaven Murder-Suicide", "dct": "Mon, 24 Oct 2016 17:54:00 GMT", "id": "e4814cab7b4dae87b3f124f75f876cc2", "content": "Error loading player: No playable sources found\nSOUTHAVEN, Miss. (localmemphis.com)\nSouthaven police say a 13-year-old girl shot in a murder suicide has been identified as Nathidia Hernandez. They say 25-year-old Travis Carnez, Jr., who was also found dead, was the shooter.\nIt happened around 5:00 p.m. Sunday evening at a home in Colonial Hills in the 2200 block of Cedar Point Cove.\n\"It's horrible to think what happened in this quiet neighborhood,” says neighbor Betty Greenslade.\n\"It was a black couple. And Mexican lady with her two children,” says Bill Greenslade.\nNeighbors say Hernandez was shot and killed by her mother's ex-boyfriend, Travis Carnez, Jr., before he killed himself.\n\"What I know is they've had problems with this guy before,” says another neighbor, Justin. “He's already broken into some of the homes they've lived in the past, stalked them. But just honestly it was just shocking for me to hear that, to see it. I don't know how to comprehend it honestly.\"\n\"Domestic issues are a big problem,” says Lt. Mark Little of the Southaven Police Department. “You never know when something like this is gonna happen. And it's very tragic.”\nSouthaven police are still trying to put the pieces together, but it appears Hernadez’s family had a restraining order against Carnez. The family had moved in with a couple in Southaven two or three months ago.\n“I walk every day. Until it got so hot this summer. And I walk with the black lady some and I know her and she's real nice. And her husband works for Comcast and I've met him once,” says Bill Greenslade.\nThe teenage victim was an 8th grader at Southaven Middle School, where additional counselors were called in to assist and comfort staff and students. A spokesperson for DeSoto County Schools released a statement which expressed sympathy for the family and that the teen was a good student and well-liked.\nCopyright 2017 Nexstar Broadcasting, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}