{"uri": "http://www.whio.com/news/crime--law/woman-shot-head-after-thanksgiving-fight/dlRIOzy0tLz5DnYKTE58dO/", "title": "Woman shot in head after Thanksgiving fight", "dct": "Thu, 24 Nov 2016 00:00:00 GMT", "id": "01155a1b6148d548aebb06ce0bc5082e", "content": "UPDATE @ 1:07 p.m. (Nov. 25):\nA Springfield woman was shot in the temple after a fight during Thanksgiving dinner Thursday.\nKathleen Upshaw, 45, of 2106 Erie Ave., was found bleeding from the head after police were called to the home. Witnesses at the scene said her friend who resided with her and a family member started to argue after the family member brought an uninvited guest over for Thanksgiving dinner, according to a police report.\n“(The friend) told (the family member) that his friend was not invited and he needed to leave,” Springfield police wrote in the report. “An argument then ensued between the two.”\nThe family member then brandished a firearm, according to the police report.\n“Ms. Upshaw stated that she was asleep in her bed when she woke up to the two arguing,” the report says. “She then heard a loud ‘pop’ and immediately felt pain to the right side of her head.”\nThe family member hadn’t been arrested as of Friday afternoon, according to police.\nUpshaw was transferred to Springfield Regional Medical Center and then Miami Valley Hospital. She remained in the Dayton hospital in fair condition Friday afternoon. The police report states that she is expected to survive.\nUPDATE @ 10:05 p.m.: The victim in the shooting on Erie Avenue is a female and a Springfield police officer said, “she is doing well.”\nNo other information was given.\nFIRST REPORT\nSpringfield police are investigating a shooting in the 2100 Erie Avenue.\nPolice were dispatched about 9:18 p.m.\nWe have a unit on the way. We’ll update this developing report as we get information.\nMeantime, click here to download our free mobile app for breaking news and news updates."}