{"uri": "http://wivb.com/2016/06/29/sources-11-year-old-shot-in-the-head-in-buffalo/", "title": "Humason Ave. shooting victims identified, both in critical condition", "dct": "Wed, 29 Jun 2016 21:00:00 GMT", "id": "b73b0891aff45ce4cb8317987d9bb4ed", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nBUFFALO, N.Y. (WIVB) – In a suspected gang related shooting, Buffalo police commissioner Dan Derenda said an 11-year-old boy was shot in the head, and a 20-year-old man was also shot, on Humason Avenue on the city’s east side. Both victims are at ECMC. Witnesses are being interviewed. Mayor Brown said he met with the 11-year-old boy’s family.\n“We cannot tolerate this kind of behavior in our city. It’s just nonsense. There is no excuse, it’s just unbelievable that an 11-year-old has to be shot. Does not make sense whatsoever,” Commissioner Derenda said.\nThe shooter hasn’t been caught yet. The 11-year-old has been identified by his family as Juan Rodriquez and the 20-year-old was identified by sources as Datavion Magee.\nNews 4’s Rachele Mongiovi spoke with Juan’s brother at the hospital. He told us, “It’s just heartbreaking. We’re all angry, because he didn’t do anything wrong. He is 11 years old, he is a really good kid and we just ask that anyone who has information to come forward because it’s not right, if this was their child or their relative they would want somebody to come forward,” said the 11 year old’s brother who wanted his identity protected.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nAPP USERS | Tap here to enable both videos.\nNews 4 sent a crew to the scene. Police tape was blocking off the street, which is not far from Schiller Park and Cheektowaga Town Park.\nAs of Thursday morning, both victims were in critical condition, according to police\nFollow us on Twitter @news4buffalo for breaking updates.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}