{"uri": "http://www.news-journalonline.com/news/20160718/mother-boy-killed-in-accidental-port-orange-shooting-was-visiting-from-jacksonville", "title": "Mother: Boy killed in accidental Port Orange shooting was visiting from Jacksonville", "dct": "NODATE", "id": "90b70da68685245a2cde4c7789f98265", "content": "Hide caption Christopher Scurry Jr.\nThe 8-year-old Port Orange boy who fatally shot himself did so with a stolen gun, police said.\nThe family of an 8-year-old boy who police said accidentally fatally shot himself in Port Orange is trying to raise money for the funeral just nine months after the boy's father succumbed to cancer.\nChristopher Scurry Jr. of Jacksonville died Friday afternoon after shooting himself in the right side of his torso, just under his armpit, Port Orange police said.\nChristopher's mother, Davina Gooden, said her two sons were visiting their grandmother, Sabrina Potter, in Port Orange for the summer.\n\"He was a beautiful kid,\" Gooden said through pained sobs. \"He was my boy and he loved me more than anything.\"\nThe 34-year-old said all she knows about her son's death is what police have told her.\n\"I talked to him Thursday night and everything was fine,\" Gooden said. \"I don't know what happened.\"\nPolice released the incident report Monday, but wouldn't release supplemental reports as the case remains under investigation.\nThe report states the 9 mm gun Christopher shot himself with was reported stolen out of South Daytona.\nSouth Daytona police said it was one of 43 firearms stolen from SCCY Industries in 2009 by former employees of the firearms producer.\nGooden said as far as she knew, her mother legally owned a gun and would visit the shooting range, but she didn't know anything about the gun in question.\nPotter couldn't immediately be reached Monday afternoon.\nRecords show Potter owns the home at 829 Hudson Lane, which police were dispatched to just after 11:45 a.m. Friday after a neighbor called 9-1-1.\nEric Salviolo called for help after Christopher's 12-year-old brother showed up at his house covered in blood \"screaming that his brother had been shot,\" according to the report. Salviolo, 61, was giving Christopher chest compressions when officers arrived.\nChristopher was found lying in a pool of blood in the living room/kitchen area, according to the report. The black firearm was found in the back, northernmost room of the home.\nThe boy's 80-year-old great-grandfather also was said to have been in the home at the time of the shooting, but the report makes no mention of him.\nThe GoFundMe account set up for Christopher's funeral service stated the boy, known as \"Lil Chris,\" loved God and football and that he'd lost his father to cancer just nine months earlier.\n\"He missed his dad a whole lot,\" Gooden said. \"They were two peas in a pod.\"\nShe said Christopher, who loved to read and excelled at math, was a smart, straight-A elementary school student whose grades only slipped a little bit after his father's death.\n\"You would've thought he was a grown man the way he spoke,\" Gooden said.\nShe said Christopher and his father both had loved football, but the 8-year-old wanted to give baseball a try next.\nGooden said her son aspired to be a rapper, his favorite artist being the late Notorious B.I.G.\nAn emotional Gooden said she isn't a gun owner but cautioned people who do to make safety a priority."}