{"uri": "http://www.dallasnews.com/news/crime/headlines/20140803-three-lucky-to-survive-rampage-at-dallas-drug-house-police-say.ece", "title": "Three lucky to survive rampage at Dallas drug house, police say", "dct": "Thu, 28 Aug 2014 00:00:00 GMT", "id": "42a9646a58f5c585a46d1b701fd5bed3", "content": "The carnage of a triple slaying Saturday could have been even worse if not for an empty gun, a botched hit-and-run and a wounded woman who played dead, Dallas authorities say.\nPolice Maj. Jeff Cotner said three witnesses who survived the gruesome scene at a southeast Oak Cliff drug house quickly led police to arrest a 21-year-old college junior who once served as an ambassador at a youth mentoring conference.\n“We were very fortunate that the outcome was not worse,” he said. “He was trying to take six lives.”\nJustin Pharez Smith, who was found at a house in Grand Prairie, has confessed to the killings, police say.\nSmith, of Pine Bluff, Ark., was charged with capital murder and is being held at Lew Sterrett Justice Center with bail set at $1 million.\nThe dead were identified as Tyteanna Brown, 21; Kimberly Montgomery, 36; and Demarcus Walton, 37.\nWalton lived at the house on Wynell Street, near Ledbetter Drive and Lancaster Road, where the slayings occurred early Saturday.\nThe names of the people who survived the attack were not released.\nPolice say Smith, an agronomy major at the University of Arkansas at Pine Bluff, tried systematically to eliminate every witness in his rampage.\nPolice say he had gone to the drug house on Wynell Street about 6:40 a.m. and got into a dispute that led to the fatal shootings.\nSmith then confronted a woman who had been sleeping in another room, Cotner said.\n“The female begged for her life, saying she had babies,” he said. “Smith left the room momentarily but then returned and shot the woman in the head as she was curled up in a fetal position.”\nAfter gathering some items in the house, Smith returned to the woman and kicked her to see whether she was dead, Cotner said.\n“She played possum and fortunately survived,” he said.\nSmith shot at another man who was outside the home and then chased after him as he tried to fire again, police say.\n“The witness reported hearing the gun click, click, click several times as they fought,” Cotner said.\nSmith was trying to reload his handgun when a woman came upon the scene, police said. He pointed the gun at her as the man he’d shot at before tried to flee.\nSmith got into his car and sped after the man, “striking him intentionally in an attempt to kill him,” Cotner said. The man wasn’t critically injured.\nSmith then drove to his mother’s house in Arlington and hid his guns and clothes, police say. After showering, he went to get a haircut.\nHe eventually “sought refuge with his mentor at a residence in Grand Prairie,” Cotner said.\nPolice have not released that person’s name.\nSmith’s family released a written statement expressing condolences to the victims’ families.\n“We are stunned to hear about the incidents surrounding Justin’s arrest,” the statement said. “While we don’t condone the allege[d] acts, he is still a member of our family and we love him. Our hearts go out to the families of everyone involved. We pray that in time we all will make sense of this tragedy.”\nCotner said the suspect’s relatives have been cooperating with police.\nAlthough his mother lives in Arlington, Smith has said he grew up with his grandparents in Pine Bluff.\nIn a video interview conducted by an English professor at his university, Smith talked about his goal to help that Arkansas town develop a more sustainable economy.\nIn the interview, Smith spoke fondly of attending Barraque Baptist Church while growing up in Pine Bluff.\n“It’s a person that you would not stereotypically place in street narcotics sales,” Cotner said of Smith, a Kappa Alpha Psi fraternity member. “But none of that takes away his culpability. ... That person is also the person who is responsible for three deaths, and he also tried to take three other lives.”\nAn aspiring rapper, Smith delivered a rousing anti-drug, anti-violence spoken-word performance at a youth mentoring summit in Washington, D.C.\nWhen asked in the video interview about the large numbers of young blacks in prison, Smith pointed to the shortage of role models.\n“There’s not too many people that’s right there in our face, that’s our age, that’s doing the right things, that’s doing it the right way, and that’s showing us a positive example of who to be and how to be,” he said.\nStaff writer Robert Wilonsky contributed to this report."}