{"uri": "http://crimeblog.dallasnews.com/2014/08/dallas-police-three-dead-following-saturday-morning-shootings-in-south-oak-cliff.html/", "title": "Update: Dallas police say suspect in Saturday morning's triple homicide has been taken into custody", "dct": "Thu, 28 Aug 2014 00:00:00 GMT", "id": "8dff2bb2198a28bfcb433d270b7fd72c", "content": "Update at 12:21 p.m. August 3 by Robert Wilonsky: Dallas police have scheduled a 3 p.m. press conference to discuss the arrest of Justin Pharez Smith for Saturday morning's triple homicide. More details concerning his apprehension and Saturday's slaying will be provided then. But, says Maj. Max Geron, a Dallas PD spokesman, via Twitter: \"Yesterday's triple homicide could easily have been 6 dead.\"\nUpdate at 11:35 a.m. August 3 by Jeff Mosier\nI've been unable to reach capital murder suspect Justin Pharez Smith's grandparents in Arkansas. Smith, an aspiring rapper, grew up in Pine Bluff and is an agriculture student at the University of Arkansas at Pine Bluff.\nA YouTube video interview featuring UAPB English professor and minister Antony Hobbs and Smith gives no hints about his upcoming legal troubles following his apprehension in Grand Prairie this morning.\nAsked about the plight of young black men, who are going to prison in large numbers:\n\"I would say lack of an immediate and direct guide…There’s not too many people that’s right there in our face, that’s our age, that’s doing the right things, that’s doing it the right way, and that’s showing us a positive example of who to be and how to be,” Smith said.\nProjections for what he plans to do in the next five years:\n“My plan is to do as much research as possible to help Arkansas have a sustainable income and a sustainable economy,” Smith said. “Right now, Pine Bluff is not in the best position, where it needs to be. And we’re looking forward to, within the next few months, actually beginning development on several research projects that’ll get us where we need to be.”\nUpdate at 7:38 a.m. August 3 by Robert Wilonsky: Dallas police say they have arrested 21-year-old Justin Pharez Smith, the suspect in Saturday morning's shootings.\nDetails remain scant at present. Maj. Max Geron, spokesman for the department, says Smith was apprehended Sunday morning at around 6 in Grand Prairie by the Dallas-Fort Worth Fugitive Apprehension Strike Team, out of the United States Marshals Service. Geron says more details will likely be provided later Sunday.\nAccording to the arrest warrant affidavit made public early Sunday morning, witnesses identified Smith as the man who shot and killed 21-year-old Tyteanna Brown, 36-year-old Kimberly Montgomery and 37-year-old Demarcus Walton Saturday morning in Walton's Wynell Street residence. Police say the slain trio, along with Smith and other unnamed witnesses, were in the living room Saturday morning at around 6:40 when Smith opened fire.\nWitnesses say they knew Smith -- \"for a few months,\" anyway. The affidavit doesn't provide further details, only that Smith \"shot and killed\" Brown, Montgomery and Walton; \"attempted to kill the unnamed witnesses\"; took something from the house; and drove off in a blue Dodge. Witnesses identified the shooter as Smith, say police; the fourth victim, taken to Baylor, picked his photo out of a six-picture line-up.\nHe will be charged with capital murder.\nUpdate at 6:49 p.m. by Julie Fancher: Dallas police have identified the three victims as Demarcus Walton, 37; Tyteanna Brown, 21; and Kimberly Montgomery, 36.\nPolice did not release any other information and said the investigation is ongoing.\n[Editor's note: This item has been updated since it was originally posted. Last updated at 12:50 p.m.]\nDallas police are investigating a triple homicide at 5125 Wynell Street, near S. Lancaster Road and E. Ledbetter Drive.\nSenior Corporal DeMarquis Black, the DPD spokesman at the scene, says two women and one man were found shot to death in a residence shortly after 6:40 this morning. No names have been released and police are still in the process of notifying next of kin. The victims were young adults in their 20s.\nBlack says a fourth person who \"encountered the suspect while [the] suspect was fleeing\" was also shot and has been transported to Baylor University Medical Center. That person's condition remains unknown. The names of the victims will be released once their families are notified.\nPolice are looking for a black male suspect who they believe was known to the victims.\nInvestigators, currently going door-to-door in the neighborhood, believe the shooting was drug-related. Says Black, \"There is evidence to believe the offense location is a point of sale for narcotics.\"\nOur Charles Scudder, now at the scene, reports that just after 9 this morning, a man in his late 20s sped up in a blue Ford convertible and charged the police crime-scene tape. He began fighting with officers, then collapsed in tears. Officers took him away in a squad car. Police would not say why.\nThroughout the morning, as many as 75 friends and family began stopping by the scene, trying to get more information. Many came speeding up in cars, falling to the ground in tears as they heard the news."}