{"uri": "http://fox43.com/2017/01/02/police-reveal-details-in-new-years-eve-shooting-death-of-teenager/", "title": "Police reveal details in New Year’s Eve shooting death of teenager", "dct": "Mon, 02 Jan 2017 16:43:00 GMT", "id": "63f48083429ab902adaf6a794f16ece4", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nGREENCASTLE, FRANKLIN COUNTY, Pa. -- A New Year's Eve shooting in Franklin County, killed one teenager while another teen is in jail, charged with pulling the trigger.\nThe shooting left neighbors shocked and saddened.\nNeighbor Gabrielle Zbyszinski said \"it just made me sad for that family, that it happened in their house, and just that the family lost their child. I've just been praying for them, so, it's sad honestly.\"\nPennsylvania State Police said it was just before 10 o'clock Saturday night when 15-year-old Taylor Nelson allegedly shot and killed 17-year-old Matthew Mitchell at Nelson's Greencastle apartment.\nPennsylvania State Police Cpl. Ryan Lawrence said \"it does appear that there was some horseplay, with the firearm prior to that. It was brandished a few different times.\"\nThe criminal complaint states Nelson admitted to being mad at Mitchell for picking on him, and that he got the gun from his father's night stand to scare the older teen.\nLater, Nelson chambered a round in the gun. At some point, he put it down on the floor of the apartment. Ten minutes later, he dropped the magazine out of the firearm, pointed it at Mitchell's head and pulled the trigger.\nCourt documents state Nelson told police he didn't realize the gun was loaded and didn't intend to kill Mitchell.\n\"Unfortunately, this isn't the first incident that I had to be involved with that involved someone that had been shot, and possibly wasn't knowing the gun was even loaded,\" Cpl. Lawrence said.\nAn incidents like this one, is why state police have a few words of advice.\n\"If you do own a firearm, or if there are firearms in your residence, to make sure that they're kept away from juveniles or people that are unfamiliar with firearms,\" Cpl. Lawrence said.\nMeanwhile, the community copes with a sense of loss.\n\"It was absolutely tragic. I mean I'm a teacher, so that's really sad just to hear the loss of a life so young. I just feel really bad for the family, for both families,\" Zbyszinski said\nPennsylvania State Police charged Taylor Nelson with criminal homicide. The Franklin County District Attorney's office said Nelson will be tried as an adult."}