{"uri": "http://www.publicopiniononline.com/story/news/2017/01/01/teen-charged-homicide-new-years-eve-shooting/96055210/", "title": "Update: Teen charged with homicide in New Year's Eve shooting", "dct": "Sun, 01 Jan 2017 00:00:00 GMT", "id": "6b57653920971750c89eaca721348eda", "content": "GREENCASTLE - A 15-year-old boy charged with homicide following a fatal shooting at a West Baltimore home on New Year's Eve is being held in Franklin County Jail without bail.\nTaylor Alan Nelson was arrested by Pennsylvania State Police, Chambersburg, following the shooting and charged with criminal homicide. He was denied bail by Magisterial District Judge Jody Eyer this morning.\nA preliminary hearing in the case is scheduled for Jan. 10 in Franklin County Central Court. Court records do not list an attorney for Nelson.\nThe shooting happened when Nelson and a 17-year-old were looking at a handgun at a home in the 400 block of West Baltimore Street in Greencastle Saturday night. Police have not identified the 17-year-old, who was killed when the gun discharged.\nThe Greencastle Police Department called in state police at 9:55 p.m. Saturday to investigate a reported shooting at the West Baltimore Street residence, according to a PSP news release.\nPolice said the two teens were inside the residence when the 15-year-old produced a handgun and showed it to the other teen. The first teen was handling the weapon and at one point pointed it at the 17-year-old. The gun discharged, striking the 17-year-old in the head, according to police.\nThe victim suffered a fatal head wound and was pronounced dead at the residence. PSP said in an earlier news release that both boys were 15, but Franklin County Coroner Jeff Conner later verified the victim was 17.\nPolice did not provide the names of either teenager, but online court records name Nelson and confirm that he was charged with criminal homicide New Year's Day and is in being held without bail in Franklin County Jail.\nPolice said their investigation into the shooting is ongoing.\nPolice were assisted at the scene by the coroner's office and Greencastle Police Department.\nVicky Taylor, 717-881-5373"}