{"uri": "http://www.kansas.com/news/local/crime/article6655236.html", "title": "2 arrested in fatal gang shootout at 2013 warehouse party", "dct": "Thu, 15 Jan 2015 12:42:00 GMT", "id": "121beb52c7d0c8bef69f124bdf619dcc", "content": "Two people have been arrested in connection with the death of a man in a gang shootout, culminating an investigation that stretched for more than a year.\nMarquel Dean, already in prison on unrelated crimes, was arrested this week on suspicion of first-degree murder in the July 14, 2013, killing of 27-year-old James Gary, said Lt. Jeff Gilmore, head of the Wichita Police Department’s gang unit.\nA second suspect, Shane Landrum, 32, was arrested in Texas in connection with Gary’s death. He was booked into the Sedgwick County Jail shortly before 8 p.m. Wednesday on suspicion of first-degree murder and is being held on a $500,000 bond.\nDean, 28, was booked into the Sedgwick County Jail shortly before noon Wednesday following his transfer from the prison in Hutchinson. He is being held on suspicion of first-degree murder and being a felon in possession of a firearm. His bond is also $500,000.\nThe shootout occurred at about 3:20 a.m. July 14 in the 800 block of East 11th Street, during an after-hours warehouse party at an auto repair shop. The owner was renting the warehouse out for parties held after the clubs in Old Town close.\nGary died in the shooting. Four other people were injured, two critically.\n“It is a gang-related homicide case,” Gilmore said Thursday. “It has been a very long and complex investigation” involving several different law enforcement agencies.\nGilmore called the arrests “very gratifying … very satisfying.”\n“To get sufficient evidence took a lot of work, a lot of interviewing numerous, numerous witnesses,” he said.\nThe shooting was the byproduct of a long-running gang feud, Lt. James Espinoza said.\nDean, Landrum and Gary are all “hard-core, documented gang members,” he said.\n“I cannot comment enough on the relentless hours that investigators worked on this,” Espinoza said.\nDean has a criminal history that includes convictions for aggravated assault, aggravated battery and aggravated assault of a law enforcement officer, according to the Kansas Department of Corrections. His earliest possible parole date is Nov. 15, 2029.\nReach Stan Finger at 316-268-6437 or sfinger@wichitaeagle.com. Follow him on Twitter: @StanFinger."}