{"uri": "http://ksn.com/2013/07/14/one-dead-several-injured-in-central-wichita-shooting/", "title": "One dead, four injured after shooting near downtown Wichita", "dct": "Sun, 14 Jul 2013 08:50:00 GMT", "id": "624dc69ade28667d69fdcc69d98f9d4f", "content": "WICHITA, Kansas – Several Wichita investigators returned to the crime scene near 11th Street and Mead following a shooting that left one person dead and four others hurt early Sunday.\nPolice say multiple shots were fired into a crowd of as many as 80 people in an industrial district.\n“Police said an after party was going on and probably a fight broke out,” said Robert, former auto body shop owner.\nEmergency crews transported four people to the hospital. Two victims were in critical, one was in serious, and the fourth victim had minor injuries.\n“When officers arrived, they found multiple victims suffering from gun shot wounds, and there appeared to be a large disturbance in the area,” said Sgt. Jeff Swanson, Wichita Police Department.\nPolice believe there was a large gathering going on. They’re not sure if it was carried over from another location or if it was gang related.\nFormer business owners nearby say they’re not surprised by the gathering and that this wouldn’t be the first time.\n“There were a few people coming through breaking into cars, partying, and I was like okay,” said Robert. “I kept watching and sure enough there are after parties and all that stuff so I wouldn’t doubt it.”\nRobert adds, “I truthfully hope they find out who did this just because it’s not a bad area of town when all that elements is eliminated,” said Robert. “I like to see it eliminated and in fact I’ll come back and rent again if it’s all eliminated.”\nSeveral cars were left behind at the crime scene. Police say at this time they’re working to identify the owners of about 12 cars so they can talk to them to see if they know anything about what happened.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}