{"uri": "http://www.thedailymail.net/news/article_d3f5199c-c316-11e6-b0fe-572e3338d31e.html", "title": "Man fires gun in Home Depot", "dct": "Thu, 15 Dec 2016 17:35:00 GMT", "id": "0dece147110297cc1902423abce74453", "content": "A man was arrested Tuesday after he allegedly fired a shot at the Home Depot store in Catskill.\nSteven Weiner, 70, of Catskill, was arrested Tuesday afternoon after he allegedly discharged a round while standing in the checkout line at the home improvement store. The bullet struck the floor near the cash register and ricocheted, but no one was injured, police said.\nWeiner, who has a valid concealed carry license, allegedly was carrying the weapon, a .38-caliber handgun, unholstered in his jacket pocket when it went off at around 2:30 p.m., police said.\n“It appears he was simply handling the weapon in his pocket when it went off,” state police Senior Investigator Pete Kusminsky said Thursday.\nAn investigation by state police and the Greene County Sheriff's Office concluded that the shot was unintentional, state police said.\n“It seems like he was just trying to buy a couple items,” Kusminsky said.\nStore employees immediately called police after the alleged shot was fired, but Weiner left the scene, state police said.\n“He didn’t run out of the store, but he definitely didn’t have any intention of hanging around and waiting for us to get there,” Kusminsky said.\nWeiner was found at a residence in Catskill and taken into custody, state police said.\nThe Home Depot cashier at the register where Weiner allegedly fired the shot complained of hearing loss and was taken to a local urgent care facility for treatment. Police did not release the name of the cashier.\nWeiner was charged with reckless endangerment, a class A misdemeanor, and issued a ticket to appear in Catskill Town Court on Dec. 22.\nThe alleged incident occurred because Weiner was carrying his weapon in an “unsafe manner,” police said.\n“[The shot was fired] because the way he was carrying it resulted in the discharge of the weapon,” Kusminsky said. “Had he had it in a holster the whole thing never would have happened.”\nIf convicted, Weiner’s pistol permit could be revoked, state police said.\n“His permit was issued a long time ago in Columbia County,” Kusminsky said. “It would be sent over to the agency that issued his permit for review, and it would be up to a Columbia County judge.”\nKusminsky said accidents such as Tuesday’s alleged incident in Catskill could be avoided if gun owners follow proper safety guidelines for transporting and carrying loaded weapons.\n“If you’re going to carry a loaded firearm, it should be carried in an appropriate holster,” Kusminsky said."}