{"uri": "http://www.wdrb.com/story/22227360/police-over-night-quadruple-homcide-in-waynesville", "title": "POLICE: Quadruple homicide in Waynesville", "dct": "Sun, 12 May 2013 09:16:00 GMT", "id": "3ec42b8f9c0b652ccec7976cc77d7f2a", "content": "LOUISVILLE, Ky. (WDRB) -- The Bartholomew County Sheriff's office says there is still no one in custody in relation to a quadruple homicide outside Columbus, IN.\nPolice say four dead bodies were found in a home on East Main Cross Street in Waynesville, IN late Saturday night.\nPolice identify the victims as 53-year-old Kathryn Burton, 39-year-old Thomas W. Smith, 41-year-old Aaron T. Cross, and 41-year-old Shawn L. Burton. All four victims suffered gunshot wounds.\nPolice say 27-year-old Daniel Burton, the son of Kathryn Burton, returned home that night and found two men dead in the living room. Authorities say he then went to his mother's room, but he couldn't get in. At around 10:40 p.m., he called 9-1-1.\nWhen police arrived on scene, they performed a protective sweep of the house. They found three men in the living room, and the woman deceased in her bed. All had suffered gun shot wounds, but authorities would not conclude a cause of death until autopsies were complete.\nPolice say Thomas Smith lived at the home with Kathryn Burton and her son.\nPolice say Shawn Burton is not related to Kathryn.\nThe Bartholomew County Sheriff's Department say the fatal shootings took place at a home on East Main Street, just off of South Wayne Street. Waynesville is an unincorporated town south of Columbus, IN and about an hour north of Louisville.\nOfficials are not saying yet if the shooting was a home invasion or a murder suicide.\nThey say this is an ongoing investigation. At this time, they are following leads in the case, but have no suspects in custody.\nAutopsies are scheduled for Monday morning in Seymour.\nStay with WDRB News for more information details on this quadruple homicide as they become available.\nCopyright 2013 WDRB News, All Rights Reserved."}