{"uri": "http://www.nydailynews.com/news/crime/indiana-cops-hold-suspect-drug-related-quadruple-murder-article-1.1375677", "title": "Indiana police have suspect in custody in drug-related quadruple murder", "dct": "Tue, 18 Jun 2013 11:20:00 GMT", "id": "549167cc0061accb24e26bf55c9ab6d7", "content": "An Indiana man who was the last to see his friends alive told a local newspaper last week he didn’t commit the horrendous quadruple murder.\nBut police in Bartholomew County now say Samuel Earl Sallee, 55, killed the four people in Waynesville last month in what appears to be a drug-related crime.\n“Sallee quickly developed from a person of interest, into our prime, and only suspect at this time, for the murder of Shawn L. Burton, Aaron T. Cross, Thomas W. Smith and Katheryn ‘Kathy Burton,” county Sheriff Mark Gorbett wrote in a news release Tuesday.\nThe accusation comes days after Sallee told the Indianapolis Star he was not the killer. In an hour-long interview, Sallee, held in a local jail on an unrelated charge since just days after the May 11 murders, told The Star a detective was trying to frame him for the slayings which he insisted he did not commit.\n“He’s chasing me,” Sallee said. “And the person who did this is probably still out there. He’s barking up the wrong damn tree.”\nPolice recently questioned Sallee about the crimes. All four victims were found shot to death. The three men were found in the living room while Katheryn Burton was found in a bedroom. Burton’s son happened upon the crime scene and called the cops.\nPolice said methamphetamine was found in the house.\nSallee reportedly knew Katheryn Burton since the two were in elementary school and had gotten to know the other three victims. During his interview with the newspaper, Sallee gave a detailed account of his day, admitting he’d met with the victims at the house where they were murdered.\n“If I had hung around there longer,” Sallee said, “I would have been the fifth person killed.”\nPolice say that’s not the case. Sallee was arrested May 13 for failing to appear in court on an unrelated charge. He was held until police made their case in the murders and announced they had their man on Tuesday.\nSallee has yet to be formally charged with the murders.\n“I’m just glad,” Misti Murray, an ex-girlfriend of victim Shawn Burton, told the newspaper. “It's not over, but the stress and mourning and all that’s over. Now it’s just the trial, arraignments, court date and all that. We'll be there in the courtroom every day.”"}