{"uri": "http://triblive.com/news/adminpage/10227348-74/pleasant-burnsworth-gustafson?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+tribunereview%2Fwestmoreland+%28Westmoreland+News%29", "title": "Mt. Pleasant teen's attorney wants shooting death case moved to juvenile court", "dct": "Wed, 30 Mar 2016 10:33:00 GMT", "id": "067cc14c9f503403541e311d69ed34a3", "content": "The attorney for a Mt. Pleasant teen charged as an adult in the fatal shooting a 13-year-old friend as he played with a handgun said he will seek to move the case to Westmoreland County Juvenile Court.\n“I think everyone here this morning believes that's the best place for it,” said Richard McCague, the attorney for John Burnsworth, 14, of Mt. Pleasant.\nBurnsworth waived his right to a preliminary hearing Wednesday before Norvelt District Judge Roger Eckels.\nBorough police said Burnsworth was holding the handgun at a South Church Street apartment on March 20 when it discharged, killing James Robert “J.R.” Gustafson. The boys were classmates in seventh-grade at Mt. Pleasant Area Middle School.\nPolice found Gustafson lying on the floor with a gunshot to the face, according to the affidavit of probable cause. He was pronounced dead at the scene.\nBurnsworth was charged with homicide and illegal possession of firearm by a minor. He is being held without bail in the Westmoreland County Juvenile Detention Center.\nRelatives of both families were at Eckels' office for the scheduled proceeding.\nBurnsworth's mother, Bertha Lint, said both families are devastated about the shooting.\n“My heart goes out to the (Gustafson) family. This is a tragic situation for everyone involved,” Lint said as she left the office, comforted by family members at her side.\nThe victim is the son of volunteer firefighter Mark Gustafson and his wife, Leah Smith-Gustafson.\nAssistant District Attorney Tom Grace, who is prosecuting the case, declined to comment or say whether prosecutors would oppose a transfer to juvenile court.\nBy state law, if Burnsworth is adjudicated as a juvenile, he could be detained under court supervision only until his 21st birthday. A conviction of first-degree murder in adult court carries a mandatory sentence of life imprisonment.\nMt. Pleasant police Chief Douglas Sam has said an 18-year-old female baby sitter was in the home watching the resident's three young children when Gustafson, Burnsworth and a third teen stopped by. Sam said witnesses told police that “the teens were handling the handgun” in the kitchen when it discharged.\nInvestigators haven't revealed who owns the gun or details about how the teenagers came into possession of it.\n“I can tell you there will be additional charges filed in this case. We're still awaiting more information before we file the charges,” Sam said.\nPaul Peirce is a Tribune-Review staff writer. Reached him at ppeirce@tribweb.com or 724-850-2860."}