{"uri": "http://www.wtae.com/article/teen-charged-with-shooting-killing-friend-wants-case-moved-to-juvenile-court-1/7479394", "title": "Westmoreland teen charged with killing friend pleads guilty in juvenile court", "dct": "Fri, 02 Dec 2016 22:44:00 GMT", "id": "3476e64ea899db0f56941a0297933740", "content": "GREENSBURG, Pa. —\nA 14-year-old Westmoreland County boy entered the juvenile equivalent of a guilty plea Friday for two misdemeanors in connection with killing his friend while he played with a gun.\nWTAE is not identifying the defendant, who has been in a juvenile-detention facility since his arrest. He pleaded guilty to involuntary manslaughter and a gun charge.\nPolice said the victim, James Robert \"J.R.\" Gustafson (pictured, above), was fatally shot on the evening of March 20 in Mount Pleasant.\n\"I gotta face the facts that I'll never see my son again,\" said Mark Gustafson, the victim's father. \"For me to see my son, my family, we gotta go to a cemetery and look at a tombstone. All because of one person.\"\nAfter an April hearing, the suspect said \"Yes\" when he was asked if the shooting was an accident and if he missed his friend.\n\"People need to lock their guns up because there's more and more going on. It's horrible,\" said the victim's mother Leah Gustafson. \"No one knows it's going to happen until it does. I just want all the justice for my son.\"\nPolice and emergency medical technicians responded to a 911 call reporting that someone had been \"shot in the face\" at a home on South Church Street, just blocks from police headquarters. Authorities discovered Gustafson lying on the kitchen floor, dead of an apparent gunshot wound.\nSomeone told police that the weapon was on the front porch of the home, and an officer found the gun there and secured it, according to the criminal complaint.\nThe defendant told police that he was \"playing with the gun when it went off and he shot his friend,\" the complaint said.\nThe criminal complaint said there were several witnesses, including one who told police about hearing a bang, looking in its direction and seeing the 14-year-old lowering the gun.\nPolice confirmed that an 18-year-old live-in babysitter was home at the time with Gustafson, the suspect, an unidentified teen and the gun owner's three children.\nPolice confirmed that the gun didn't have a magazine in it, but there was a live round in the chamber.\n\"I'm hoping he gets placed back in the community as quickly as possible. He's been in custody for nine months. It was basically an accident,\" said defense attorney Richard McCague.\nThe defendant's disposition hearing will be scheduled at a later time.\n\"I think he has, actually, a very low likelihood of reoffending,\" McCague said. \"As long as people don't put guns in his hand that are loaded, to everybody's surprise, then I don't think he's likely to hurt anyone else.\""}