{"uri": "http://triblive.com/news/adminpage/10606068-74/hudec-burnsworth-handgun?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+tribunereview%2Fwestmoreland+%28Westmoreland+News%29", "title": "Owner of handgun used in Mt. Pleasant teen's shooting held for trial", "dct": "Thu, 09 Jun 2016 01:18:00 GMT", "id": "8e603dceba947e1e27c48b12dc1f2ae5", "content": "A few hours after a teen fatally shot his 13-year-old friend March 20 in the kitchen of a Mt. Pleasant home, the owner of the 9 mm handgun nervously approached a Westmoreland County detective outside and asked, “How much trouble am I in?' ”\nThe detective testified about the conversation during a preliminary hearing Thursday.\nAfter listening to an hour of testimony from Detectives Will Brown and Frank Galilei, Norvelt District Judge Roger Eckels ruled there is sufficient evidence for Joshua Hudec, 31, of Mt. Pleasant to stand trial on five counts of child endangerment and reckless endangerment and a count of possession of a firearm by a minor.\nHudec formerly lived at 151 S. Church St., where police say John Henry Burnsworth, 14, shot James Robert “J.R.” Gustafson. The boys were seventh-grade classmates at Mt. Pleasant Area Middle School.\nBurnsworth is charged as an adult with homicide and illegal possession of a firearm by a minor.\nHudec was not home at the time of the shooting, but the unregistered handgun was kept loaded in his bedroom, Brown testified.\n“After he approached me ... it was cold outside, and I invited (Hudec) into my car to talk. He told me he kept the handgun loaded, stuffed between his bed and the nightstand,” Brown said under questioning from Assistant District Attorney Thomas Grace.\n“He told me only the baby sitter and his three young children knew its location,” Brown said.\nHudec, an emergency medical technician with Mutual Aid Ambulance, was working that night in New Stanton and heard about the shooting on his radio, Brown testified.\nThe baby sitter, Brooke Nelson, 18, of Mt. Pleasant waived her right to a preliminary hearing on identical charges.\nKristopher Lewis, 44, of Mt. Pleasant, who is accused of transferring ownership of the handgun to Hudec without filing required paperwork, waived his right to a preliminary hearing. He is charged with a firearms violation.\nNelson was in the house with Hudec's children, ages 7 to 10, on the day of the shooting, Galilei testified. The full-time baby sitter told investigators that only she and the children knew where the gun was kept, along with a rifle stored in a closet.\nUnder questioning from Grace, Galilei testified the handgun “was unsecured.” He said the case it was purchased with “had a lock ... but it was kept loaded and tucked between the bed and his nightstand.”\n“Was it secured in any way?” Grace asked.\n“No, it was not,” Galilei replied.\nBrown said detectives and borough police later discovered the “unsecured and loaded” rifle in Hudec's bedroom closet.\nGalilei said investigators learned that 14-year-old Burnsworth had stayed at the home the two previous nights while Hudec was working and slept in Hudec's bedroom.\nHowever, Galilei said under cross-examination by Hudec's attorney, William Wiker of Greensburg, that both Hudec and Nelson told investigators that Burnsworth did not know the handgun was next to the bed.\nAfter the hearing, both detectives said the reason Burnsworth stayed at the house is unknown and remains under investigation.\nThe detectives said Nelson invited Burnsworth and Gustafson inside when the two stopped to visit at 6:48 p.m. March 20.\nNelson told detectives she wanted Gustafson to leave, “but she did not want to be the one to tell him to leave,” according to the affidavit of probable cause.\nBurnsworth and Nelson devised a plan for Burnsworth to get the handgun from Hudec's bedroom to scare Gustafson into leaving, the detectives said.\n“Nelson further stated that John Burnsworth removed the clip from the firearm and told Ms. Nelson, ‘I'll scare him with this,' ” according to the affidavit. “Moments later, Burnsworth pointed the handgun at the victim and pulled the trigger, causing it to discharge.”\nAlthough Burnsworth allegedly removed the clip, there was a live round in the chamber, detectives said.\nGustafson was found on the floor with a gunshot to the face. He was pronounced dead at the scene.\nHis parents, volunteer firefighter Mark Gustafson and his wife, Leah Smith-Gustafson, attended the hearing.\nWiker asked Eckels to dismiss the felony charge of firearm possession by a minor because there was no evidence that Hudec “intentionally delivered or provided” Burnsworth with information on the handgun's location as required by the law.\nGrace countered that evidence shows the firearm was not secured.\n“Obviously, the gun was made available to these kids. ... In fact, both detectives said the defendant in interviews said it was always loaded,” Grace said.\nEckels ordered Hudec to stand trial on all charges.\nAfter the hearing, Wiker said Hudec remains “remorseful and devastated” by the shooting.\n“This has been a tragic, terrible thing ... anytime a parent loses a child,” he said.\nBurnsworth is being held without bail in the Westmoreland County Juvenile Detention Center.\nPaul Peirce is a reporter for the Tribune-Review. He can be reached at 724-850-2860 or ppeirce@tribweb.com."}