{"uri": "http://www.wtae.com/news/13yearold-boy-shot-and-killed-in-mount-pleasant/38612520", "title": "Boy, 14, charged with killing 13-year-old in Mount Pleasant", "dct": "Wed, 30 Mar 2016 16:24:00 GMT", "id": "961efbb1b9778f6b3cf576ba6e95ca70", "content": "MOUNT PLEASANT, Pa. —\nThe attorney for a 14-year-old boy charged with killing his 13-year-old friend while they played with a gun wants the case moved to juvenile court.\nAttorney Richard McCague tells the Pittsburgh Tribune-Review that's why he waived his client's preliminary hearing on criminal homicide and weapons charges Wednesday.\nVIDEO: Watch Janelle Hall's report\nThe victim, James Robert Gustafson, was fatally shot on the evening of March 20. The suspect is charged as an adult but is being held in a juvenile detention facility.\nMcCague said that \"everyone here this morning believes\" juvenile court is the \"best place\" to resolve the case.\nPolice and emergency medical technicians responded to a 911 call reporting that someone had been \"shot in the face\" at a home on South Church Street, just blocks from police headquarters. Authorities arrived to discover Gustafson lying on the kitchen floor, dead of an apparent gunshot wound.\nSomeone told police that the weapon was on the front porch of the home, and an officer found the gun there and secured it, according to the criminal complaint.\nThe suspect told police that he was \"playing with the gun when it went off and he shot his friend,\" the complaint said.\n\"My reaction is brokenhearted. I feel the children are victims. Both children are victims,\" Mount Pleasant resident Kathleen Ceroni said.\nThe criminal complaint said there were several witnesses, including one who told police about hearing a bang, looking in its direction and seeing the 14-year-old lowering the gun.\nAshley Hudec said the shooting happened at her ex-husband's house while he was at work as an EMT. She said their three children, ages 10, 8 and 7, were inside the home but weren't hurt.\n\"They didn't say much. My oldest was crying, my youngest was crying. My middle one, I don't think he knew how to process it. He was in shock,\" Hudec said.\nPolice confirmed that an 18-year-old live-in babysitter was home at the time with Hudec's children, Gustafson, the suspect and an unidentified teen. Hudec said the suspect and Gustafson went to the house to play with her oldest son. Hudec said the babysitter approached her on Monday morning to explain what happened.\n\"She told me the father of my children might get in trouble for all this. She told me my daughter was downstairs when it happened. She's very sorry and I feel so badly for her for having to deal with all this,\" Hudec said. \"She told me (the suspect) went up and got it from under the mattress. How he knew about it or how she knew about it, I still don't know.\"\nPolice confirmed the gun didn't have a magazine in it, but there was a live round in the chamber. Hudec said she didn't know her ex-husband had a handgun inside the home.\n\"He's a hunter. I knew he had a rifle in the house with them but he assured me it was locked up. I did not know about the handgun at all until the babysitter came over and talked to me,\" Hudec said. \"It all could have been solved so easily. Now a child's life is taken, a 14-year-old child's life is ruined and my three older ones, I don't know how they're going to get over it. I don't.\"\nFamily who answered at the suspect's home on March 21 said it was a tragic accident and that their prayers are with everyone involved.\nGustafson was known as \"JR\" in the community. His grandmother, Elizabeth Griffin, said he loved hockey, hunting and basketball. Mount Pleasant Mayor Jerry Lucia said Gustafson aspired to be a volunteer firefighter like his father and older brother.\n\"All he talked about was, 'When do I get my application?' We were really excited about him joining because of the energy he could have brought to us,\" Lucia said. \"JR's dad is our Easter Bunny. He sat there and had kids on his lap all afternoon, taking pictures, not knowing the circumstances from the whole day and how it would end.\"\nLucia said the borough would likely make Gustafson an honorary firefighter once what would have been his 14th birthday arrives in June.\nNeighbors were saddened and expressed sympathy for the boy's parents.\n\"The guy that rents over there -- nice guy, good dad,\" said Scott Radford, who lives on South Church Street.\nDownload the WTAE app for your phone or tablet to stay updated with breaking news throughout the day. (Free in your app store.)"}