{"uri": "http://www.chron.com/news/houston-texas/houston/article/Report-Active-shooter-on-Weslayan-Street-near-9284493.php", "title": "Several questions remain after mass shooting in SW Houston", "dct": "Wed, 28 Sep 2016 00:00:00 GMT", "id": "1caa68a784b3263c2a640692b1920260", "content": "A lawyer who opened fire on commuters for no apparent reason during the morning predawn rush hour in a Houston neighborhood Monday, wounding nine people, was wearing a vintage military uniform and had Nazi emblems on him, police said.\nThe rampage on a quiet street near West University Place began in the predawn darkness and lasted 20 minutes before the gunman, who police identified as Nathan DeSai, 46, was shot and killed by officers.\nSix of the wounded were transported to area hospitals. The other three were treated at the scene and released.\nActing Houston Police Chief Martha Montalvo said at a news conference Monday afternoon police did not yet know exactly what caused DeSai, described as a lawyer struggling to keep his small law practice alive, to do what he did.\n\"At this point we are very open-minded in terms of motive,\" Montalvo said, adding the department was working with the FBI to find answers.\nHandgun used in attack\nPolice said DeSai used a .45-caliber handgun during the assault and they later found 2,600 rounds of ammunition and a Thompson semi-automatic rifle in his car, a black convertible Porsche parked near where he was killed.\nDeSai lived in a condominium complex near the scene of the shooting at Weslayan and Law streets.\nA search of his home turned up additional weapons and several pieces of military regalia and other items going back to the Civil War. The .45-caliber handgun was bought in 2011. The Thompson submachine gun was purchased in 2009.\nOfficials would not say specifically what type of uniform he was wearing. Photographs of his body show DeSai apparently wearing military-style spats strapped over his boots. He was lying face up. His dark shirt was over his face.\nPolice said Nazi emblems were found in his clothing.\n\"We did find some old Nazi emblems about some of his personal effects, and I understand there were some in where he lived,\" said Houston Police Capt. Dwayne Ready. \"To what extent that played … I don't know, because there was also other, what I would refer to as historic or vintage military stuff in the apartment, going back to the Civil War.\"\nCalls about a possible shooter started coming into police about 6:30 a.m., about the time Eduardo Andrade was heading to an LA Fitness gym in his Audi A3.\n\"As I was driving by Law Street, I suddenly heard a big explosion,\" Andrade said. \"I covered myself, accelerated and tried to get out of there. I did not know if someone was following me or trying to shoot me.\"\nTwo bullets struck his car, with a large piece of one lodged between his dashboard and windshield.\n\"It is so random,\" he said. \"If I were going a little faster or a little slower, the bullet would have had a different trajectory.\"\nHouston, Bellaire and West University Place police departments responded and exchanged gunfire with DeSai.\n\"Multiple officers engaged with the suspect who was shooting randomly at passersby and anyone he could put his sights on,\" Ready said.\nOfficials did not say how many times DeSai, who died at the scene, was hit.\nAt least 75 spent shell casings were collected from the scene and a bullet slug was pulled from the couch on the second floor of a nearby home.\nHouston Police cordoned off the area, and later searched DeSai's condo and car as well as used a robot to check his body for explosives.\nVictims sent to hospital\nLate Monday, in a statement, Memorial Hermann Red Duke Trauma Institute and Memorial Hermann Southwest Hospital said they had received five patients from the shooting. Three were discharged, two remained hospitalized, both in good condition. A sixth victim was in serious condition at Ben Taub Hospital.\nAmong the wounded was the adult son of local lawyer, R.P. Cornelius. He was treated and released and was resting at home Monday night.\n\"My son is fine, thank you,\" Cornelius said. \"We are moving forward and do not wish any interviews.\"\nPolice confirmed that all those who were shot during the spree were adults.\nThe names of the victims were not released.\nMayor Sylvester Turner, who was on a trade mission to Cuba, said he had been advised of the situation by Montalvo and other officials.\n\"We wanted to make sure in view of what's happening across the country and what's been happening recently, that this was not some act of terrorism,\" Turner said, \"but one certainly can see when one has an incident of this kind it certainly creates terror on so many levels.\"\nHe said authorities were interviewing DeSai's friends, family and associates.\nThe night before he died, DeSai went by his parents' Houston home. He was in a hurry and took his dinner to go, recalled his father Prakash DeSai, a retired geologist.\nHe said his son had been upset for months over troubles at his work, chiefly trying to attract clients.\n\"We are not getting any business,\" he recalled his son saying. \"Who wouldn't be worried?\"\nDeSai parted ways last year with his law partner, Kenneth McDaniel.\n\"I'm reading stuff online talking about how he was possibly a fired employee that was disgruntled,\" said McDaniel, a civil attorney. \"That's the farthest thing from the truth.\n\"Our partnership dissolved in February of this year - it was simply a matter of economics.\n\"We couldn't afford to operate as a partnership anymore.\"\nMcDaniel said he had worked with DeSai for about 12 years.\nFormer law partner\nHe declined to discuss DeSai's personal life, saying he didn't know him outside the office.\nDeSai held a bachelor's in psychology from the University of Houston and a law degree from the University of Tulsa, where he graduated in 1998, according to the Texas State Bar Association.\nDeSai was in good standing and there was no history of disciplinary trouble or complaints pending against him.\nHe specialized in criminal, business and family law, according to the bar association.\nHis former law office, off the Katy Freeway, was empty Monday aside from a few trash cans.\nLettering on the glass door read, \"McDaniel and DeSai LLP.\"\nFriendswood lawyer Troy Ted Tindal met DeSai briefly in the summer of 2015 when he took over a federal employment case from him.\nDeSai had contacted him to see if he was interested and said he had filed the federal lawsuit, but wanted to pass it off to someone who knew about governmental immunity.\nTindal said he spoke with him on the phone a few times and met with him when he handed over the files for the case.\n\"He was just exactly like anybody else,\" Tindal said. \"There was nothing odd about him, nothing aggressive, nothing that would give you the idea that he had any sort of inclination for a mass shooting incident. He seemed like a completely normal guy in the summer of 2015.\"\nCliff Saunders, a KTRH Radio reporter who lived near DeSai said he avoided him.\n\"I knew enough to stay away,\" he said of the man who seemed to have anger issues and would regularly barrel through the condominium parking lot.\nBut far more troubling was a phone call he got from his wife this summer about him.\n\"My wife called me and said, 'Don't go home, there is a guy walking around with an AR-15,' \" he said.\nHe asked her who it was and she said, \"the guy with the black Porsche.\"\nDeSai was apparently angry at some roofers or construction workers who had awakened him. It is unclear if police responded.\nHouston Police said officers had never previously encountered DeSai.\nHarrowing ordeal\nAt the scene of the shooting Monday, Alan Wakim, who lived near DeSai, was wiping dots of blood from his face as he embraced his wife, Jennifer Molleda in the parking lot of a strip shopping mall.\nThey stood by his Mustang. Two bullets had come through the windshield. One landed near the driver's headrest.\nMolleda said she had seen DeSai before, but said that he kept to himself.\n\"He's very secluded, we've seen him take out the trash a few times,\" Molleda said. \"You normally say hi to neighbors, but when neighbors don't say hi back, you tend to mind your own business.\"\nStill, Molleda said she would have never expected him to go on a shooting spree.\n\"He's an attorney for God's sake, driving a Porsche,\" Molleda said. \"He's a prominent individual; you don't expect this from someone like that.\"\nCarolyn Allen, 76, was driving on Law when a bullet came through the windshield of her Lincoln Navigator.\nThough cut on her stomach, legs and face, the retired schoolteacher kept driving until she thought she was safe, she said, recalling, \"I'm not sitting here like a sitting duck.\"\nAs DeSai's father learned on the news early Monday that there was a shooting near Law, he was immediately concerned for his son's safety, but had no idea he would turn out to be the predator.\nHe had immediately called his cellphone and left a message: \"There is a shooting in your area. I am worried.\"\nLindsay Ellis, Brian Rogers and Gabrielle Banks contributed to this report."}