{"uri": "http://www.citizen-times.com/story/news/crime/2016/05/12/police-investigating-suspicious-death-near-ira-b-jones/84271460/", "title": "Updated: Woman found dead, child critical near school", "dct": "Thu, 12 May 2016 00:00:00 GMT", "id": "0ab64228c2949eb388420d1c90a8876f", "content": "ASHEVILLE - A woman's body and an injured child were discovered by an early morning jogger Thursday at Jones Park near Ira B. Jones Elementary School.\nPolice identified the woman as Candace Elaine Pickens, 23, who was dead when officers arrived at the scene, said Asheville Police Department spokeswoman Christina Hallingse.\nPickens was shot in the face and died from the wound, according to Dr. Harold Schutte, a state medical examiner. He estimated she was shot sometime in the early morning hours on Thursday.\nThe child was identified as Pickens' 3-year-old son, Zachaeus Latese Waters, Hallingse said. He was transported to Mission Hospital with life-threatening injuries around 6:20 a.m..\nZachaeus was shot in the head, and the shooter and weapon have not been identified, Schutte said.\nThe boy was stable but remained in critical condition around 12:30 p.m. Thursday.\nNeighbors who gathered outside Pickens' apartment complex in East Asheville on Thursday afternoon were upset but declined to comment.\nA woman found the two victims lying next to each other in the grass near Ira B. Jones School Road on the backside of the playground at Jones Park while she was running at 6:15 a.m., according to the 911 audio recording.\nShe described one victim as \"very small\" and told a dispatcher, \"He looks like he's injured.\"\nThe woman who found the victims said she was \"freaked out,\" according to the audio recording.\nWhen officers arrived at the scene they taped off Jones Park and blocked two roads, but Jones Elementary officials made the decision to keep the school open, said spokesman Charlie Glazener with Asheville City Schools.\n\"For the most part it’s a normal school day for the students, and they are going about their business,\" he said.\nPolice told school officials that the school was not threatened, Glazener added.\nJones Park, which is owned by the school, is on the south end of campus and used for both school and public use, he added.\nNo outdoor activities took place Thursday as a result of the investigation, Glazener said.\nPolice removed Pickens' body around 11 a.m. and the park was reopened, Hallingse said.\nA state medical examiner will complete an autopsy Friday.\nInvestigators are working to complete a preliminary forensic analysis and follow-up on leads, she added.\nAnyone with information is encouraged to call Buncombe County Crimestoppers at 828-255-5050 or the Asheville Police Department at 828-252-1110.\nCheck back at CITIZEN-TIMES.com for updates."}