{"uri": "http://www.citizen-times.com/story/news/local/2016/05/13/asheville-man-arrested-ohio-after-homicide-park/84319172/", "title": "Asheville man arrested in Ohio after homicide in park", "dct": "Fri, 13 May 2016 00:00:00 GMT", "id": "3f644cdffa5403e2fafdffcd9a4e70c0", "content": "Police in Ohio arrested a 24-year-old man Friday on charges he killed a woman and critically injured her son in a shooting at an elementary school park in Asheville.\nNathaniel Elijah Dixon, of Asheville, has been charged with first-degree murder in the death of Candace Elaine Pickens, 23, and attempted first-degree murder and child abuse resulting in serious bodily injury for injuries sustained by her 3-year-old son, Zachaeus Latese Waters.\nAccording to the Buncombe County Medical Examiner's Office, Pickens was also pregnant.\nDixon fled to Columbus, Ohio, and was arrested there, according to a statement issued Friday by Asheville police spokeswoman Christina Hallingse. He was put into custody at the Franklin County jail and was awaiting extradition.\nColumbus police arrested Dixon at 12:38 a.m. at a duplex after receiving an email from APD saying “that they had reason to believe Dixon was possibly in Columbus,” said Columbus police spokeswoman Denise Alex-Bouzounis.\nSWAT officers found Dixon with a 21-year-old woman, whom he was keeping hostage, Alex-Bouzounis added. Police released no information on whether that woman suffered injuries.\nThe woman’s identity and connection to Dixon was also unknown, Alex-Bouzounis said.\nAdditionally, police would not say why Dixon fled to Ohio as it is part of the ongoing investigation, Hallingse said. Tips from the public aided in his arrest, she said.\nA jogger discovered Pickens and her son in Jones Park, near Ira B. Jones Elementary School, shortly after 6 a.m. Thursday morning. Pickens had been shot in the face and was declared dead at the scene. Her son was also shot and taken to Mission Hospital with life-threatening injuries.\nHe remained in critical but stable condition Friday.\n“He’s hanging in there,” said Keith Knox, a family member. “He’s a fighter. He’s doing very well, and he’ll turn around. But it’s going to be a long roller coaster ride to recovery.”\nPickens grew up in Asheville and had Zachaeus with a former boyfriend, according to his sister, Shecara Mitchell. The two were co-parenting the toddler and had a good relationship even though they were no longer dating, Mitchell said.\n“They both loved that baby and didn’t deserve what happened,” she said.\nWhen police arrived at the park Thursday morning, Pickens was found dead in the grass and her son was lying next to her, according to Dr. Harold Schutte, a state medical examiner. According to the jogger, both victims were unresponsive when she found them.\nPickens sustained a gunshot to the right side of her face in the area of her cheek, he said. The victims had no other injuries.\nIt also appears that Pickens and Zachaeus were shot at Jones Park, Schutte added. An autopsy in Winston-Salem was completed on Friday by a state medical examiner.\nMany family members were in disbelief when they heard the news about Pickens and her son.\n“That’s the worst news I could have gotten,” Mitchell said. “It’s unexplainable, and I just want everyone to continue to pray for (Pickens’) family, the baby and my brother.”\nAccording to Knox, Dixon and Pickens had been dating and but recently had a dispute.\nFamily, friends and community members gathered at the Hill Street Baptist Church and joined in prayer Friday for families of the victims and the community.\n“It was heartbreaking,” said Torre White, one of Pickens’ cousins. “I hung up the phone when I heard the news.”\nWhite said she was close to her cousin and described her as “loving, funny, and outgoing.”\nCandace also always had a smile on her face, her aunt Irene Pickens said.\n“She was the sweetest girl growing up,” she said. “She had two twin brothers who she acted like a mother to and once Zachaeus came along they had a really strong bond. She was a very good mother to him.”\nMany family members described Zachaeus as a smart, sweet, happy and well-behaved boy who loved his mother.\n“You couldn’t get him away from his mother,” said Barbara Ann Pickens, who was Candace's aunt. “He loved her and she loved him.”\nAnother vigil was planned for community members to pay their respects to Pickens and her son, according to a Facebook page. A GoFundMe page has also been set up to support Zachaeus.\nThe vigil is scheduled for 8 p.m. at Jones Park on Saturday.\nA teacher at Ira B. Jones Elementary school felt compelled to help organize the vigil for Saturday night.\n\"We just want to honor her,\" said Melissa Officianalis.\nAs the investigation continues, family is taking steps to plan a service for Candace Pickens and is continuing to spend time in the hospital while Zachaeus recovers.\n“We’re taking it one step at a time to get everything together,” Irene Pickens said.\nFamily members also want justice for Candace Pickens, White said.\n“I just want my cousin to be remembered for who she was,” she said.\nCheck back at CITIZEN-TIMES.com for updates."}