{"uri": "http://www.nbcmiami.com/news/local/1-Killed-5-Wounded-in-Miami-Shooting-264363991.html", "title": "2 Killed, 7 Wounded in Miami Shooting", "dct": "Wed, 25 Jun 2014 03:28:00 GMT", "id": "e63239d3835518e08cde3c7578da5296", "content": "Two people were killed and seven more people shot, a teen girl critically, when somebody sprayed dozens of rounds at a Miami apartment complex early Tuesday, in one of the city's worst mass shootings.\nKevin Richardson, 30, died at the scene, and Nakiel Jackson, 26, died after he was taken to Jackson Memorial Hospital, Miami police said.\nMan Falls Into Wood Chipper, Dies\n“I had my back turned,” said shooting victim Devon McNeal from his hospital bed. “I was gettin’ up and walk away. I was getting ready to leave and I got shot in the back.”\nThe barrage of gunfire — police estimate between 50 and 60 shots fired — left a trail of bullets and blood stains throughout the apartment building at NW 12th Avenue and 65th Street around 2 a.m.\nPolice have not said what may have prompted the shooting, saying it was too soon to speculate.\n“We are not too sure at this point what it was, whether it was a drive-by or someone walked up or someone was on an actual bike,” said Miami police spokeswoman Frederica Burden.\nThe injured victims were rushed to Jackson Memorial, among them a 17-year-old girl named Jessica who was in critical condition with life-threatening gunshot wounds. The girl’s sister told NBC 6 the teen was shot four or five times.\nOne of the teen’s friends, Sharon Saint Fluer, said late Tuesday that the teen is “doing good” and that, “she realizes just how easily she could have lost her life.”\nMcNeal was taken to the hospital in serious condition. Earlier in the day, his uncle said McNeal was shot four times. McNeal said enough is enough with the shootings.\n“Some changes need to be made,” McNeal said Tuesday night. “Something needs to be done.”\nIt was a message that Saint Fluer also shared with McNeal.\n“It seems as if this is just like a revolving door,” Saint Fluer said. “Not until it actually hits home and its somebody personal; it’s just like we getting used to it. You watch the news every day, it’s like okay, here we go again.”\nAlso in the hospital were Kenneth Mintz, whose condition is unknown, and another man whose family refused to identify him.\nAccording to the Miami Herald, the shooters were two men carrying an AK-47 and an MR-15. Both stepped out of a dark SUV and began firing, the Herald reported.\n\"If someone's seen anything, I wish you guys [would] come forward. He was somebody's son, he was somebody's father,\" said Bennae Robinson, Richardson's aunt.\nAnyone with information is asked to call Miami-Dade Crime Stoppers at 305-471-TIPS."}