{"uri": "http://www.12news.com/story/news/2015/10/09/shooting-at-nau-campus/73639266/", "title": "1 dead, 3 wounded in NAU shooting; Suspected shooter held on $2M bond", "dct": "Fri, 09 Oct 2015 00:00:00 GMT", "id": "5a4d44021fe7cc88cb06568342238505", "content": "(Photo: 12 News)\nAn emotional Steven Jones, 18, the man accused of shooting four Northern Arizona University fraternity brothers -- one fatally -- early Friday appeared before a judge via video for an afternoon appearance that lasted less than 15 minutes.\nTo get breaking news sent to you when it happens, download the 12 News app: iPhone | Android\nJones, who is not a full-time student and does not work, cried as the judge read the four felony charges he will face -- 1st-degree murder and three counts of aggravated assault.\nJones' defense attorney claimed he is a life-long resident of Arizona and a student, who has no criminal history besides traffic offenses. The attorney said Jones has no other place to go and he is not a flight risk. He requested a third-party release to Jones' parents.\nAccording to the proceedings, after a verbal confrontation with another fraternity turned physical, Jones retrieved a .40 caliber handgun from his car then went back to the fight.\nAccording to one of the witnesses, Jones admitted to the shootings that left one man dead, one in critical condition, and two others wounded.\nThe shooting took place \"a substantial distance away\" from where Jones retrieved the gun, the prosecutor said before asking for a bond in excess of $1 million.\n\"He killed my best friend, and I watched him die in front of me,\" student Nico Keintek said. \"He should think about what he did.\"\n\"He killed my son,\" the father of fatally-shot student Colin Brough told the judge. \"He should stay in custody.\"\nJones' next court appearance is scheduled for Thursday, Oct.15 at 10 a.m.\nThe judge set Jones' bond at $2 million.\nShots rang out in the quiet hours of the early morning in Flagstaff on the campus of NAU, leaving one person dead and three others wounded after a confrontation between two groups of students on Friday, according to authorities. NAU identified the students injured in the campus shooting as Nicholas Prato, Kyle Zientek and Nicholas Piring, all members of the Delta Chi fraternity. The student killed has been identified as Colin Brough, the university said.\nNAU Police Department Chief Gregory T. Fowler said at a 6 a.m. news conference that the shooter was identified as 18-year-old freshman Steven Jones, who is in custody. According to authorities, Jones did not flee after the incident; he waited for police to arrive.\nJones, who is believed to live on campus, shot multiple people with a handgun after a clash between two groups of students, Fowler said, adding that it was not clear whether Jones was armed during the confrontation or if he left to get the gun and returned.\nJones, who was homeschooled when he graduated, has a profile in a senior high school graduation ceremony program for Arizona Families For Home Education, that lists competitive pistol shooting among his interests:\n\"Throughout Steven's school years, he has enjoyed learning about many things. He excelled in guitar and keyboard, competitive pistol shooting, and chess and has participated in bands, clubs and competitions. During high school, he developed a love for cars which he continues to cultivate. Steven is interested in photography, which he also continues to learn about.\"\nCampus police responded to a call of shots fired at about 1:20 a.m. in the area outside of Mountain View Hall on the northeast end of campus. The wounded were taken to Flagstaff Medical Center. The Medical Center is the major trauma unit in northern Arizona, and it is located a mile or two from campus.\nAfter multiple students complained about either not receiving a campus alert after the early morning fatal shooting or receiving it late, NAU released an official letter that reads, in part:\n\"An error during the deployment of the NAU Alert system resulted in limited distribution of the initial alerts, which were sent as a precautionary measure to notify campus of the situation. A final all clear message was sent to the entire campus at 2:52 a.m.\n\"The investigation is ongoing.\"\nShortly after 3 a.m., NAU tweeted: \"Details confirmed 4 victims, 1 fatality, 3 wounded. Shooter is in custody. Situation is stabilized. Campus not on lockdown.\"\nMembers of the Delta Chi fraternity were involved in the incident, the fraternity's national chapter confirmed in a statement:\n\"Delta Chi Fraternity was made aware of a shooting that took place early Friday morning allegedly involving some of our members. We have investigated this matter and can confirm that there were members involved.\nWe do not have any information on the victims nor do we know if the deceased individual is a member of the Fraternity. At this time, we can confirm that this incident had no ties to the chapter.\nOur thoughts and prayers are with the friends and family of the victims as well as the entire community in Flagstaff.\"\nThe NAU Delta Chi president confirmed that all three of the men wounded in Friday's shooting are members of the fraternity.\nThere is no word yet on whether Colin Brough, who was killed, was a member of the fraternity.\nNAU public relations director Cindy Brown said the shooting occurred in the parking lot outside Mountain View Hall dormitory. Mountain View is where NAU's fraternities and sororities reside. It is the dorm which looks out over the track and field stadium on campus, Brown said.\nNAU has set up a Family Assistance Center in the ballroom of 1899 Bar & Grill, 307 W Dupont Avenue. Long-distance parents may call 928-523-0007.\nIn a public letter, NAU President Rita Cheng wrote that classes will go on as scheduled. Click here to read Cheng's and other related official statements.\nAt 5:24 a.m., Arizona Gov. Doug Ducey tweeted out: \"Praying for @NAU and the victims of this morning's shooting. All Arizonans have the #Flagstaff community in their hearts today.\"\nOn Twitter, the hashtags #NAUShooting and #NAUStrong were trending Friday, which indicate the amount of attention given to this incident on social media.\nU.S. Senator John McCain (R-AZ) released the following statement on the tragic shooting at Northern Arizona University early this morning:\n\"My thoughts and prayers are with families of the person who was killed and the three others who were wounded in the horrific shooting on the campus of Northern Arizona University in Flagstaff early this morning. I appreciate the efforts of all state and local law enforcement officials, first-responders and school administrators, and continue to pray for the recovery of the injured, as well as all those in the NAU community who have been impacted by this terrible tragedy.\"\nThis shooting happened eight days after a mass shooting on the campus of Umpqua Community College in southern Oregon."}