{"uri": "http://www.lex18.com/story/32405710/authorities-911-caller-ambushed-shot-officer-in-georgia", "title": "Authorities: 911 Caller Ambushed, Shot Officer In Georgia", "dct": "Sat, 09 Jul 2016 01:34:00 GMT", "id": "14c1fb786d11aba1625629cb8b2ec87e", "content": "VALDOSTA, Ga. (AP) - A man who called 911 to report a car break-in Friday ambushed a south Georgia police officer dispatched to the scene, sparking a shootout in which both the officer and suspect were wounded, authorities said. Both are expected to survive.\nThe shooting in Valdosta, just north of the Georgia-Florida state line, happened hours after five police officers were killed Thursday night in an ambush in Dallas. Despite saying the officer was lured to the scene by the gunman, the Georgia Bureau of Investigation said there was no immediate evidence that the shootings were related.\n\"We're putting pieces together to understand what happened and why, developing witnesses,\" said Scott Dutton, spokesman for the GBI, which is handling the case at the request of local police. \"There's nothing to indicate there's a connection to that.\"\nOfficer Randall Hancock was shot multiple times as he responded to a 911 call about a car break-in outside the Three Oaks Apartments just after 8 a.m. Friday, Valdosta Police Chief Brian Childress said at a news conference.\n\"The officer called out on the radio screaming for assistance,\" Childress said, and officers from multiple law enforcement agencies swarmed the apartment complex.\nThe GBI later identified the suspected gunman as 22-year-old Stephen Paul Beck and said it was Beck who also placed the 911 call. Both Childress and Dutton described Beck as an Asian male. Charges against Beck were pending Friday as he was being treated at a Florida hospital, Dutton said.\nDutton said one gunshot hit the officer in the abdomen, just below his protective vest. Other shots hit Hancock's vest. The officer, who is white, fired back and wounded the suspect.\nFriends and neighbors of the suspect said they were stunned Beck would be accused of such violence. He had moved to Valdosta years ago from metro Atlanta to check into a live-in treatment center for people with chemical dependencies, but several people who knew Beck said he had turned his life around.\n\"He's one of the kindest, most gentle people, just genuinely so,\" said Taki Zambaras, who ran the treatment center when he met Beck about three years ago.\nWhen Beck arrived, Zambaras said, he was \"an angry, insubordinate, very confused kid who wanted to leave every day.\" But he said Beck worked hard in the center's kitchen and at maintaining the long clay road leading to its doors.\n\"He left us in pretty good shape emotionally, physically and spiritually,\" Zambaras said. \"He kept in touch with us after he left and even came back and volunteered his time with guys who were going through the program.\"\nAt the time of the shooting, Beck lived at the Three Oaks Apartments where the gunfire erupted Friday. Residents recalled seeing Beck smoke on his balcony, or occasionally engaging in casual talks with him.\nDarius Sheffield, who moved into the complex five months ago, said he would regularly see Beck outside his apartment. He said they recently talked about the NBA Finals and had discussed current movies.\n\"The entire thing is kind of weird,\" said Sheffield, who was at work when the shooting occurred. \"It doesn't seem like him. ...It's shocking to everyone.\"\nHancock underwent surgery at a local hospital and was stable Friday as he rested with his family by his side, Childress said. The suspect's condition was also stable, he said.\n\"I'm relieved that my officer is fine,\" Childress said. \"I am also equally relieved that the offender is going to make it.\"\nThe police chief said Hancock was wearing a body camera, and its video footage had been turned over to the GBI.\nSteven Bowers, a 21-year-old apartment resident, said he had just awakened Friday when he heard three pops of what he thought were firecrackers. But then, he said, a bullet ripped through the siding of his unit, whizzed by his roommate's head and bounced off the wall to land on a bed.\nBowers, who did not know Beck, said he grabbed his own gun and looked outside when the shooting stopped. He saw the officer on the ground. He said he did not see Beck until he was placed on a stretcher and saw that there was blood on his face.\nBefore Beck moved into his current apartment, he had been roommates with Jason Sobczak in Valdosta. Sobczak said he last saw Beck at a meeting about three months ago and he seemed happier and healthier than ever.\n\"He was adopted, but he came from a good family,\" Sobczak said. \"At heart he's a teddy bear. Stephen had really turned his life around. He was very active, pro-active and he looked good.\"\nJ.C. Cunningham, who owns a Valdosta painting business, said he hired Beck for several months while he was in treatment.\n\"He was a good kid ...really remorseful I think about some of the troubles he had gotten into in the past,\" Cunningham said. \"One thing I do remember him saying a couple of times is he didn't want to go back home because he didn't want to be back around the same crowds.\"\nIt was not immediately known if Beck had an attorney. There was no answer Friday evening at the door of an address listed for Beck's parents in Kennesaw, north of Atlanta. A message left at a home phone listing for the family was not immediately returned.\nChildress declined to comment on any possible motive when asked about his officer being shot so soon after the Dallas attacks. The Dallas officers were shot during a protest over the recent killings of black men by police in Minnesota and Louisiana.\n\"You start to wonder,\" the police chief said. \"But any motive of why this happened this morning, it would be speculation.\"\n___\nBrumback reported from Atlanta. Associated Press writers Russ Bynum in Savannah, Georgia, and Jeff Martin in Kennesaw, Georgia, contributed to this report.\n(Copyright 2016 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.)"}