{"uri": "http://www.mynews13.com/content/news/cfnews13/news/article.html/content/news/articles/bn9/2016/1/6/shooting_being_inves.html", "title": "Sheriff Judd to triple-homicide suspects: 'We're coming after you'", "dct": "Wed, 06 Jan 2016 00:00:00 GMT", "id": "b1db024456543adca21ae57b080282c4", "content": "Sheriff Grady Judd is asking the public for help in a shooting that left three people dead and one critically injured.\nFour people were shot at a home at 2314 East Magnolia St. at 6:45 a.m. Wednesday.\nJudd said three of those people - David Washington, 24; Eneida \"Stacy\" Branch, 31; and Angelica Castro, 23 - were killed in a violent \"slaughter that left blood throughout the house.\"\nFelix Camps, 18, was shot in the face. He was transported to Lakeland Regional Hospital, where he is in critical condition.\nJudd said the house where the shooting took place was known as a \"one-stop shop for drugs.\"\n\"You could buy marijuana, pills, heroin, cocaine,\" he said. \"Whatever you needed, they had.\"\nJudd said whoever broke into the house knew what they were looking for. He said preliminary evidence suggests the suspects may have also taken drugs, possibly money and other items.\nWashington's sister, Danielle Williams, knew everyone who was killed.\n\"Such innocent people that would do anything for anybody,\" she said. \"Why? That's my only question.\"\nNo suspects have been named.\n\"We don't have any idea who the suspect or suspects may be at this time,\" said Judd, who quickly added, \"Certainly, we will develop more information.\"\nJudd said that in the meantime, they are asking the public to help find the perpetrators of \"this heinous crime\" so they can be taken into custody, \"the sooner the better.\"\nAs for the suspects, Judd has a message:\n\"For those of you who are the suspects, we're coming after you, we're gonna find you, we'll put you in jail, and we're ultimately gonna send you to prison for the rest of your life, or send you to the death chamber.\"\nThat's little comfort for Williams, though, who said she is heartbroken.\n\"It's like my son,\" she said. \"It's like I'm losing a child because I practically raised him. I used to get him dressed for school every day. That’s my only brother.\"\nJudd asked anyone in the community with information about the shootings to contact the agency at 863-297-3029 or to call Heartland Crime Stoppers at 1-800-226-TIPS."}