{"uri": "http://www.dnainfo.com/chicago/20151105/auburn-gresham/police-give-update-on-tyshawn-lees-murder-this-afternoon", "title": "Tyshawn Lee, 9, Was 'Targeted, Lured To This Spot and Murdered': McCarthy", "dct": "Fri, 06 Nov 2015 09:49:00 GMT", "id": "7a61f4fa3aa5e0bb1d4b89826498ab21", "content": "CHICAGO — Chicago Police Superintendent Garry McCarthy said 9-year-old Tyshawn Lee was lured into an alley and executed, likely because of his family's gang ties.\nMcCarthy joined community activists on Thursday at a news conference near the scene of the shooting at 8000 S. Damen Ave. where he also slammed Tyshawn's father Pierre Stokes for refusing to cooperate with police.\n\"This is an innocent child. This is a 9-year-old child, targeted, lured to this spot and murdered,\" McCarthy said. \"We're dealing with cowards. I don't even have words for this quite frankly.\"\nListen to McCarthy's remarks from the press conference:\nTyshawn was killed Monday in an alley behind his grandmother's house in Auburn Gresham.\nA \"person of interest\" in the case had turned himself in to police Wednesday night but was released by Thursday, according to media reports. McCarthy said that person did not make any formal statements to police, and was not charged.\nMcCarthy said police believe Tyshawn was lured into the alley and \"assassinated\" because his father has ties to a gang that is currently feuding with another gang, though he did not want to reveal which ones.\nMcCarthy characterized the situation that led to Tyshawn's death as \"two gangs that are going at it.\n\"They are mutual combatants. They are criminals, and they are combatants.\"\nDeputy Police Chief Fred Waller described seeing the crime scene as \"something that you could not even dream of.\"\n\"The frustration is unbelievable,\" Waller continued. \"In almost 30 years as a policeman I've never seen anything like this ... The [Gresham] District is my home and I've never seen anything like this. So the frustration runs deep.\"\nMcCarthy said Stokes, Tyshawn's father, has gang ties and has not cooperated with police. \"We've tried to interview him at least twice. I can't even tell you what he said\" because Stokes used language \"you can't say on TV,\" McCarthy said.\n\"I'm a father, many of us here are fathers, and my reaction would be a little bit different,\" McCarthy said. \"My reaction would be very clearly different.\"\nBut immediately after the news conference, Stokes denied any gang affiliation and insisted that he has no knowledge of who killed his son.\n\"I've been answering all the questions [police] have asked me, and I keep telling them I don't know anything,\" Stokes told reporters. \"I would never do anything to hurt my son.\"\nSaying \"I don't have any enemies,\" Stokes promised that no further retailiation would come from his son's death.\n\"It ends here,\" Stokes said. \"Right now there's nothing for me to do but to lay my son down peacefully.\"\nFather Michael Pfleger and his St. Sabina congregation coordinated the pledging of reward money for information on the case, which had reached $35,000 as of Thursday afternoon, according to a police announcement.\nAt the news conference, Pfleger offered to personally pay to relocate someone if they came forward with information leading to an arrest.\n— Fr. Michael Pfleger (@MichaelPfleger) November 5, 2015\n\"There comes a point when your fear is either going to paralyze you, or your fear is going to motivate you,\" Pfleger said. \"We've got to get to a point where our conscience overrides our emotions.\"\nMcCarthy reiterated the call for people with information to come forward, acknowledging that they might be afraid of the gangs involved, but asking them to speak up anyway.\n\"It takes courage to do the right thing sometimes, and at the end of the day, when good people stand up, we're going to win,\" he said. \"That's what's going to happen. We're going to solve this crime, by the way. There is no doubt in my mind that we are going to make this case.\"\nAll week, police have maintained a heavy presence in the neighborhood, which angered Tyshawn's father who claimed police were harassing him.\n\"There used to be a street code. Lines were drawn. If you did [kill a kid], the streets took care of you,\" Pfleger said Monday. \"That line has been removed. We're here today putting the line back.\"\nMcCarthy said the city's gun problem allows \"cowards\" to be violent criminals.\n\"It doesn't take a big man to hold a gun, versus to use their hands, or something along those lines,\" McCarthy said. \"It's cowardly. And that's what we're dealing with: we're dealing with cowards.\"\nStokes gathered with about 15 to 20 others at a vigil for Tyshawn at 6:30 p.m. Thursday at the corner of 81st Street and Marshfield Avenue.\n\"Everyone wants to know what happened, but so do I ... I don't know where it came from or who did it,\" Stokes said to the crowd, which eventually swelled to nearly 50 people, not including media.\nAbout 20 to 30 police officers observed the vigil or patrolled nearby as the mourners attempted to light candles and displayed signs and balloons at the corner.\n\"I woke up at 7 a.m. [the day Tyshawn died] to walk him to school,\" Stokes said, adding that he does it every morning. That was the last he saw of his son, who went to his grandmother's house directly after school and was gunned down there.\n\"My house is destroyed, now I have nowhere to stay because police came and took all of my money,\" he said.\nStokes spoke at length about how the nonstop police and media attention affected him: \"How would you feel if something like this happened to your son and there were cameras in your face?\"\n\"I don't want nothing but justice. That's all I care about,\" he said.\nFor more neighborhood news, listen to DNAinfo Radio here:"}