{"uri": "http://www.dnainfo.com/chicago/20151102/auburn-gresham/8-year-old-boy-killed-after-being-shot-south-side-alley-officials-say", "title": "9-Year-Old 'Executed' in South Side Alley: 'We're Living in a Horror Movie'", "dct": "Mon, 02 Nov 2015 17:26:00 GMT", "id": "ff5848942d12c31471be0c84425f177c", "content": "CHICAGO — A 9-year-old boy was killed in a daytime shooting in a South Side alley, authorities said.\nThe incident occurred near the corner of 80th Street and Damen Avenue in Auburn Gresham at 4:15 p.m., according to police and fire officials.\nThe boy was not taken to a hospital after being shot in the back of his head, according to Fire Cmdr. Curtis Hudson.\nA group was standing in the alley when \"some type of argument\" erupted, \"followed by gunfire,\" police Chief of Detectives Dean Andrews said at a news conference Monday night. The shooter or shooters then ran off, and police discovered the boy shortly thereafter, Andrews said.\nThe boy was identified as Tyshawn Lee, according to the Cook County Medical Examiner's office. The Tribune said a basketball that the boy carried to school every day was found near his body.\n\"WHAT HAVE WE BECOME CHICAGO ...... when a 9 yr old Boy can be executed in an alley at 4 p.m. in the afternoon,\" anti-violence activist Rev. Michael Pfleger said in a Facebook post Tuesday. \"What kind of creature can look at a 9 yr old and execute him? What has happened to our Homes, Blocks, Churches, Neighborhoods, City...where we raise such a person???? Have we lost all boundaries, are there no longer no 'Non Acceptables'...What have we become Chicago???\"\nPolice don't know whether the shooting was \"a targeted incident or a tragic case of someone being in the wrong place at the wrong time,\" Andrews said, but detectives will be \"working around the clock\" to scour the neighborhood in search of a possible motive or suspects.\nPrecious Morris, who lives in the 8000 block of South Damen Avenue, was returning home from work when she heard \"five or six\" gunshots from near Dawes Park across the street.\nAlmost immediately, police swarmed to the scene \"from every direction,\" she said. When she tried to approach, she said, a fire commander told her to steer clear, saying \"a little boy was shot in the head and there was stuff everywhere.\"\nRaynetta Tyler, who lives in the 1900 block of West 80th Street, said she wasn't home when the shooting happened, but witnessing the aftermath next to her street made her fear for her young son and three grandchildren.\n\"It feels like 'The Purge' — like we're living in a horror movie. Seems like every two weeks I hear about someone else we lost,\" Tyler said. \"I can't ever let my babies come outside around here. It's like we're lucky if we all see another day.\"\nTyshawn's mother Karla Lee took to social media to express her heartbreak — and her friend set up a Go Fund Me page to ask for help burying her son.\n\"On today November 2, 2015 my friend lost her only reasons for living which was her son,\" the page says. \"They took her baby away from her to a senseless act of gun violence ... she was a single mother who do her best to raise her child to give him the best life possible she wasn't planning on losing her child so we asking family and friends to help her in her time of need with any small donations to help her lay her son to rest.\"\nPfleger said he and other community members will be distributing fliers with reward information at noon Tuesday near 80th and Damen.\nAnyone with information on the shooting is asked to call detectives at 312-747-8271.\nFor more neighborhood news, listen to DNAinfo Radio here:"}