{"uri": "http://www.knoxnews.com/story/news/crime/2016/12/21/boy-13-charged-brothers-murder/95698818/", "title": "Boy, 13, charged with 12-year-old brother's murder", "dct": "Wed, 21 Dec 2016 00:00:00 GMT", "id": "da2485ec545d4d5209026562fb94e31e", "content": "Paul Efird\nKnoxville Police Chief David Rausch said Wednesday that a 12-year-old boy found dead in his bedroom Tuesday night was killed by his 13-year-old brother.\nThe brother has been charged with first-degree murder. He is being held at the Richard L. Bean Juvenile Detention Center. Both are students at Northwest Middle School.\nThe News Sentinel contacted Knoxville attorney Gregory P. Isaacs and asked if he represented the 13-year-old boy.\n“I will confirm that our firm has been retained to represent a juvenile,” Isaacs responded. “It is not permitted under Tennessee law to publicly disseminate information regarding prosecutions of a juvenile under the age of 14.\n“We intend to ask the Juvenile Court to enter a gag order at the first hearing of this matter.”\nHe declined to say when that hearing will be held.\nUnder state law, however, the hearing must be held within the next 48 hours.\nThe News Sentinel spoke with the boys' mother. She said the family has \"no comment at this time.\"\nThe boys were home alone at the time of the shooting. Rausch did not say where the parents were at the time. He added that two other children live in the home at 2101 Needham Drive, off Merchant Drive.\nRausch said the 13-year-old made a phone call from the home to the parents, who in turn contacted police. Police responded to the E-911 call at 7:14 p.m.\nInvestigators initially believed the boy had died as a result of a self-inflicted gunshot wound.\nAs the investigation continued overnight and additional evidence was examined, Rausch said it became apparent the boy died as the result of a homicide.\nInvestigators conducted multiple interviews throughout the night, and early Wednesday the brother was charged.\nDue to the ongoing investigation the names of the victim and suspect cannot be released at this time, Rausch said.\nRausch also declined to offer an explanation as to how the boy gained access to the firearm, and he said the motive is under investigation.\nHe also declined to say if the boys' parents might be charged. He said the investigation is continuing.\nA reporter who visited the Needham Drive home did not get an answer to a knock on the door. There was a kid’s bicycle in the driveway and a swing set and trampoline in the back yard.\nRausch said this is the third year in a row the city has had a tragedy right before Christmas. On Dec. 2, 2014, two Sunnyview Primary School students and a teacher’s aide were killed in a bus crash. On Dec. 17, 2015, Zaevion Dobson was fatally shot in the 2700 block of Badgett Drive.\n“This is unfortunately something that is becoming all too common,\" he said. \"Our hope is that as a community we can come together and try to figure out solutions to deal with these horrible tragedies, and stop putting small children in graves.”\nKnoxville Mayor Madeline Rogero called the homicide a \"terrible tragedy.\"\n\"I think it is hard for any of us to imagine or to understand the pain that this family is going through right now,\" she said. \"Our thoughts and prayers are with them and all the students, teachers and parents of the Northwest Middle School community.”\nKaren Loy, principal of Northwest Middle School, released a statement regarding the brothers.\n“We are deeply saddened by the tragic event that occurred Tuesday night involving two of our students,\" Loy said. \"Our hearts are heavy as we offer our thoughts and prayers to the family during this very difficult time.”"}