{"uri": "http://www.pal-item.com/story/news/crime/2016/07/30/off-duty-impd-officer-shoots-detective-flees-ohio/87767164/", "title": "IMPD officer charged with attempted murder in shooting of detective", "dct": "Sat, 30 Jul 2016 00:00:00 GMT", "id": "0ba76c7c3660540f0988938b5864d6e2", "content": "Michael Anthony Adams / IndyStar\nUPDATE SATURDAY 10 A.M.: Police have identified the Indianapolis Metropolitan Police Department officer accused of shooting and injuring a fellow officer as Adrian Aurs. The 42-year-old officer is charged in an arrest warrant with attempted murder.\nAurs was taken into custody in Cincinnati after police there stopped his vehicle on I-75 near mile marker 1.1. He surrendered after an hour-long standoff with police, according to a news release from IMPD. Police will extradite Aurs to Indianapolis.\nAurs himself was shot while on duty in 2003, according to IndyStar news reports. He exchanged gunfire with a 23-year-old man who was killed. Aurs was struck, but his bullet-proof vest saved his life, the reports say.\nAurs has a drunken-driving conviction on his record. In 2005, he pleaded guilty to a misdemeanor count of operating while intoxicated and was sentenced to probation, court records show.\nIn 2012, Aurs was involved in a fatal crash while he was off-duty. Aurs had a small amount of alcohol in his system when his vehicle collided with a car carrying a Greenwood couple, according to IndyStar reports. However, prosecutors found that the amount of alcohol was below the legal limit, and the crash was the fault of the other driver. The office declined to bring charges. A 78-year-old Greenwood man was killed in the crash.\nDetectives have collected Aurs' police badge and ID in light of his suspension in the latest incident, and termination has been recommended.\nEARLIER:\nAn off-duty Indianapolis Metropolitan Police Department officer shot an IMPD detective Friday night who was investigating a report of domestic violence involving the off-duty officer and his estranged wife, and then he fled to Ohio.\nThe wounded detective, a veteran of the department, police said, was shot at least once in the elbow, and possibly a second time in his side.\nHe is expected to survive his injuries.\nThe shooting, police said, stemmed from an investigation into the off-duty IMPD officer, who was involved in \"some type of domestic incident\" Friday with his estranged wife in an apartment near Emerson Avenue and Southport Road on the southeast side.\nAt about 8:30 p.m.. southeast district officers were called to the 6700 block of Valley Brook Way in the Overlook at Valley Ridge apartments, regarding the disturbance. Since the incident involved an IMPD officer, the department's special investigation unit was requested to handle the case.\nAs the SIU detective began his investigation at about 10:30 p.m., police said the off-duty officer, who also is an IMPD veteran, returned and began shooting inside the apartment.\nThe detective, who was struck at least once, returned fire, but didn't hit the off-duty officer, police said.\nAfter the shooting, the off-duty officer fled the scene in his personal vehicle. The wounded detective was rushed to IU Health Methodist Hospitalwith injuries to his elbow and back, where he remains in good condition.\nPolice were able to track the off-duty officer to Cincinnati, where he was taken into custody, \"without incident,\" by Cincinnati Police Department officers, said IMPD Major Rich Riddle.\n\"Our detectives are on their way to Cincinnati to continue their investigations,\" Riddle said early Saturday morning. \"(The off-duty officer) will be facing criminal charges here in Indianapolis once our investigation completes.\"\nAt the time of the domestic disturbance, and the shooting that followed, police said, the off-duty officer's two children were inside the apartment. They were not injured.\nIt was unclear early Saturday morning what exactly happened between the off-duty officer and his wife before police were called, but Riddle said the circumstances were \"serious enough of a criminal nature to call in our SIU detectives.\"\nFriday's incident marks the second time an IMPD officer has been shot this week. On Monday, an officer was shot in the ankle while pursuing a suspect who fled a traffic stop at a gas station at 71st Street and Georgetown Road.\nThe off-duty officer involved in Friday's shooting, who is assigned to southwest district, has been immediately suspended without pay, pending termination from IMPD, police said.\nThe names of the officers involved in the incident have not been released. Both have at least 18 years of service on the force.\nCall IndyStar reporter Michael Anthony Adams at (317) 444-6123. Follow him on Twitter: @michaeladams317."}