{"uri": "http://www.wthr.com/article/impd-officer-arrested-in-cincinnati-after-impd-detective-gets-shot-in-indy", "title": "LATEST: IMPD officer under arrest for attempted murder", "dct": "Sat, 30 Jul 2016 12:07:00 GMT", "id": "84de9355bedd5cb80abbf45a469b3099", "content": "Detectives have been granted an arrest warrant issued from Marion County charging the suspect, identified as 42-year-old Adrian Aurs of Indianapolis, with Attempted Murder.\nOfficers with the Cincinnati PD observed the vehicle on I-75 at mile marker 1.1 and initiated a felony traffic stop, and after an hour long stand-off with police the suspect surrender without further incident. Detectives will begin the process of extraditing the suspect back to Indianapolis to be processed at the Arrestee Processing Center. In addition, detectives are also securing a search warrant for the suspect's personal vehicle.\nA veteran Indianapolis Metropolitan Police Department investigator is wounded after following-up on a alleged domestic violence call involving off-duty IMPD Officer Adrian Scott Aurs.\nSources tell Eyewitness News IMPD Officer Adrian Aurs made cell phone calls to people including his Mother while fleeing to Cincy threatening to commit suicide.\nAurs reportedly shot an IMPD Detective responding to a domestic violence call involving Aurs & his estranged wife.\nThe veteran detective suffered a non life threatening injury and is expected to recover.\nThe return gunfire did not strike Officer Aurs who fled away in his vehicle.\nAurs reportedly called a fellow officer sources say who tried to talk him into not doing anything to himself nor any other harm to other police officers.\nDuring his ride to Cincy in his personally owned vehicle, Aurs also called his mother sources say who reportedly made some headway with him in their conversation after he threatened to harm himself.\nA little after 8:30 p.m. on Friday evening, officers responded to the 6700 block of Valley Brook Way (Overlook at Valley Ridge Apartments) on a domestic violence call involving off-duty officer Aurs & his estranged wife. When officers and an on-duty supervisor arrived the involved officer Aurs was not on-scene.\nThe on-duty supervisor notified IMPD's Special Investigations Unit, standard for incidents involving criminal allegations involving public safety officials with the city of Indianapolis, for appropriate follow-up.\nAt around 10:30 p.m., the same day, an SIU investigator responded to the incident location to begin his investigation. While the investigator was inside the apartment conducting his follow-up Aurs entered the apartment and reportedly shot the investigator injuring him. The investigator did return fire, but Aurs was not struck.\nAurs estranged wife and kids were inside the apartment at the time of the shooting, but they were not injured.\nAurs fled, and the injured investigator was able to call for help. The injured investigator, a 20-year veteran of IMPD, was taken to IU Health Methodist Hospital in stable condition with an injury to his elbow and back.\nThe injured investigator was upgraded to good condition with what are described to be non-life-threatening injuries. It was quickly determined that the suspect who shot the investigator was the involved officer from the earlier alleged domestic violence call.\nDetectives were quickly able to determine Aurs was traveling toward Cincinnati and notified officials there. Members of the Cincinnati Police Department were able to take Aurs into custody, at an unknown location, without further incident. Aurs drove his personally owned vehicle and did not use his assigned police vehicle.\nDetectives from IMPD are currently traveling to the Cincinnati area to begin the process of bringing Aurs back to Indianapolis to face criminal charges.\nDetectives will consult with the Marion County Prosecutor's Office to determine what charges Aurs will face.\nHis assigned police vehicle and duty belt have already been recovered.\nAurs is immediately suspended (without pay), pending termination of employment from IMPD.\nNo word if Aurs will face charges in Cincinnati."}