{"uri": "http://www.journal-news.com/news/news/crime-law/teen-involved-in-hamilton-shooting-arraigned/nmWd9/", "title": "Teen involved in Hamilton shooting arraigned", "dct": "Thu, 04 Jun 2015 00:00:00 GMT", "id": "760c9ca178b1a93271b5c3b13a9c7515", "content": "Greg Lynch\nHAMILTON\nA 16-year-old boy appeared in juvenile court Thursday morning on multiple charges stemming from the shooting of a 14-year-old allegedly during gun play at a Hamilton home.\nThe teen was arraigned by Magistrate John Bruewer on charges of misdemeanor assault, tampering with evidence, a third-degree felony, and discharging a gun in the city limits, also a misdemeanor. Bruewer ordered the boy to remain housed in the county juvenile detention center until a pre-trial hearing scheduled for June 11 before county juvenile Judge Kathleen Romans.\nPolice and emergency medical crews were dispatched around 1:30 p.m. Wednesday to 767 Fairview Ave., in the Lindenwald neighborhood where Gabriel E. Mejia had been shot in the head. According to police, Mejia was transported by medical helicopter to University of Cincinnati Medical Center. No information was available Thursday about his condition from police or the hospital.\nMejia, 14, of Pleasant Avenue, is a Garfield Middle School student who just graduated the eighth grade, according to Joni Copas, spokeswoman for Hamilton City Schools.\nAn investigation revealed the teenagers were playing with a gun at the house, according to police. The gun was accidentally discharged, striking the victim in the head, police said.\nSgt. Ed Buns said Thursday the investigation was continuing, including how the teens got possession of the weapon.\nThe 16-year-old left the residence before police and emergency units arrived, but was taken into custody a short time later. The gun was also recovered.\nA woman called 911 and reported a person shot, saying it was an accident.\n“He was shot in his head,” the woman told dispatchers. “There is a big knot in the front of his head, but there is nothing coming out, so I think the bullet is still in his head.”\nThe woman yells at the young man to “stay awake … stay with me.”\n“If you don’t hurry he is going to die,” the woman cries to the dispatcher.\nNeighbors told the Journal-News they have been concerned about activity at the home for quite sometime and have previously called police to investigate.\nNeighbors, who didn’t want their identities revealed, said they heard multiple shots fired — anywhere between three to five — come from the home. One neighbor said he believed “business” was being conducted in the house, referring to illegal drug dealing.\nHamilton police Officer Kristy Collins said police have been called to the residence three times since 2011: once for a missing person; once for a theft; and once for vandalism. She said calls about criminal activity are often made anonymously and become part of ongoing investigations."}