{"uri": "http://www.mlive.com/news/detroit/index.ssf/2016/05/child_shooting_cases_2005.html#10", "title": "Comment on \"These 11 kids were shot with guns found at home\"", "dct": "Wed, 25 May 2016 19:06:45 GMT", "id": "01eee03e41697ba4812608f12f32fb58", "content": "Location: 15000 block of Lappin St. in Detroit\nStatus: Ivan Berrien pleaded guilty to second-degree child abuse and felony firearm. He was sentenced to 2 to 10 years in prison after pleading guilty in relation to the shooting death of Cirilla Bingham.\nDetails: The prosecutor's office states that the victim was friends with Berrien's then 14-year-old son and the two were hanging out after school. When Berrien went to pick up a pizza, the two children went into a bedroom, found a gun and started playing with it. During this time, the gun discharged and a bullet fatally struck Cirilla in the forehead.\nLocation: 11200 block of Roxbury St. in Detroit\nInformation: Tony Campbell was killed when a 14-year-old discovered a gun in his uncle's home, where the two were playing hide-and-seek, and the gun allegedly accidentally discharged.\nStatus: Clifton Shortie, the homeowner and uncle of the 14-year-old boy, pleaded guilty to second-degree child abuse. He will spend the next 2, and as many as 10 years, in prison.\nInformation: Vasalee found a gun on the floor of Eugene Archer's Detroit home. The 2-year-old girl then shot the television in Archer's home, which resulted in no injuries.\nStatus: Archer, who is the boyfriend of the child's maternal grandmother, pleaded guilty and was sentenced to 12 months in the Wayne County Jail and five years of probation.\nInformation: Latasha Lum, the victim's mother, allegedly fell asleep with a holstered gun. Jaylen then picked up the gun and shot himself in the leg, according to the prosecutor's office.\nStatus: Lum pleaded guilty to second-degree child abuse and was sentenced to five years probation.\nDetails: Patricia Johnson, Robert Richardson and Harvey Witcher lived together in a Detroit home where they kept a fully-loaded gun underneath a bed. Johnson was watching Jamel, her grandson, and left them in the care of Richardson, who was on oxygen and \"heavy\" cancer medication. During this time, Jamel's 4-year-old cousin found the loaded rifle and fatally shot him in the chest.\nStatus: Johnson pleaded guilty to involuntary manslaughter, felony firearm and was sentenced to two years in prison. Richardson pleaded guilty to involuntary manslaughter and was sentenced to three years probation. Witcher pleaded guilty to involuntary manslaughter and felony firearm and was sentenced to two years in prison."}