{"uri": "http://www.mlive.com/news/detroit/index.ssf/2016/07/felon_whose_nephew_was_killed.html#incart_river_home", "title": "Felon says unsecured gun that killed nephew wasn't his", "dct": "Thu, 21 Jul 2016 19:28:19 GMT", "id": "af06d0e56712729e3b5ae3adab1ba3b4", "content": "DETROIT, MI -- A Detroit man with prior felony convictions is headed to prison after accepting a plea deal in connection with the fatal shooting of his nephew.\nThe Wayne County Prosecutor's Office said 10-year-old Tony Campbell was in his Uncle Cliford T. Shortie's care when a 14-year-old in the Detroit home found Shortie's loaded, unsecured rifle in the basement. While the children were playing, the rifle accidentally discharged and killed Tony.\n\"The gun wasn't mine,\" Shortie said when offered the chance to speak at his sentencing hearing Thursday. \"That's about it.\n\"I feel sorry about what happened to the victim. He didn't deserve it. That's about it.\"\nOriginally charged with manslaughter, punishable by up to 15 years in prison, second-degree child abuse, weapons charges, Shortie struck a plea deal with Wayne County Prosecutor Kym Worthy's office.\nHe pleaded no contest to the charges of manslaughter and felony use of a firearm. In exchange, prosecutors dismissed the second-degree child abuse and felon in possession of a firearm charges.\nWayne Circuit Judge Mark Slavin on Thursday sentenced Shortie to a minimum of five years in prison.\nShortie will. serve at least three for the manslaughter charge, in addition to two years for felony use of a firearm.\n\"There is no winners in this case, there are only losers,\" Slavin said before imposing sentence. \"An your negligent actions -- reckless actions -- have caused both families a lot of pain an grief and sorrow that they'll never get over.\"\n\"Absolutely unforgivable\" is how Slavin described the negligence Shortie exhibited by allowing two teens and Tony to play in the proximity of a loaded gun.\nWorthy in May held a press conference to draw public attention to a rash of accidental shootings involving Detroit children and unsecured guns in recent years. The Tony Campbell case is one of those she cited.\nBecause Shortie has a prior felony conviction for carrying a concealed firearm, he was legally forbidden from possessing a gun.\nThere are also felony charges pending against Shortie stemming from a 2015 assault in Highland Park. The case has not been resolved.\nThe following slides contain data provided by the prosecutor's office, which highlights Wayne County child shooting case data since 2014.\nIn a similar case, Christopher Head, 45, was found guilty of manslaughter and second-degree murder by a jury in July.\nHis daughter, then 10, found Head's shotgun in his bedroom closet. She testified she was mimicking a violent video game her brother, 9-year-old Daylen Head, was playing in the bedroom and the gun accidentally fired, striking and killing Daylen almost immediately.\nHead, who is also a convicted felon and forbidden from owning firearms, is scheduled to be sentenced by Wayne Circuit Judge Dana Hathaway at 9 a.m. Monday."}