{"uri": "http://www.clickorlando.com/news/1-dead-6-injured-in-orlando-shooting", "title": "Video released of car fire in Orlando pool hall shooting", "dct": "Sat, 17 Sep 2016 07:21:00 GMT", "id": "657c014b45c84a6bedb4f5f90532979c", "content": "ORLANDO, Fla. - Orlando police have released pictures and videos of a vehicle involved in the fatal drive-by shooting outside of an Orlando pool hall.\nPolice said the culprits in a gray Hyundai Sonata opened fire on a crowd of people, killing Dwayne Antoine Stuart, 37, who is not believed to not been the target of the shooting.\nThe Sonata was reported stolen to Orlando Police Sept. 1 and was found burning on Sept. 17 just after 4 a.m. in the 100 block of N John St in Orlando, just minutes after the drive-by shooting, according to police. The culprits then got into another vehicle, possibly a Dodge Charger, and police are urging the driver to come forward.\nThe shooting was reported around 3:35 a.m. in the 3900 block of Columbia Street.\nOrlando police said the shooting took place in the road near Sam's Supermarket at 3930 Columbia St. as patrons were leaving a neighboring pool hall.\nTwo of the other six victims were released from the hospital, police said. The other four are in stable condition, according to police.\n\"Right now, we do not have a suspect description to provide,\" police said in an email.\nResidents who live nearby told News 6 that they woke up to hearing numerous gunshots.\n\"It was going through all night. Just shots. Pop, pop, pop. That's all you could hear,\" Kay Fedd said.\nPolice blocked off Columbia Street for hours as it was covered in shell casings and bullet-riddled cars.\n\"It's always something happening here, but not like this. This was over the extreme,\" Fedd said.\n\"I just saw people running inside and running outside,\" said \"Mr. C,\" who works security at the pool hall and added that Stuart was his friend.\n\"He's a real good person. He worked. He's not a bad guy. He doesn't do nothing. He's got kids,\" he said.\nAs the sun came up, more family and friends gathered across the street and cried, watching as investigators took pictures and gathered evidence in an effort to figure out who pulled the trigger.\n\"Something has got to be done. It's too much, you know. There's a lot of hard-working people and they come home like me -- I come home and I'm scared to go back out,\" Fedd said.\nWatch News 6 and stay with ClickOrlando.com for more on this story.\nCopyright 2016 by WKMG ClickOrlando - All rights reserved."}