{"uri": "http://www.detroitnews.com/story/news/local/detroit-city/2016/05/27/girl-critical-shooting-detroit/85052800/", "title": "Girl, 2, shot in argument, declared brain-dead", "dct": "Fri, 27 May 2016 00:00:00 GMT", "id": "da8fdd1b64ac57d60ad96f0c6432c6ae", "content": "Makanzee Oldham will not live to see her third birthday, according to relatives.\nThe 2-year-old girl, who was shot in the head during a reported argument over spilled Kool-Aid, was declared clinically brain-dead at 5:10 p.m. Friday, although the family will keep her on life support until Sunday so her organs can be harvested, according to her great-uncle.\n“There was a complete brain shutdown, and the doctors said if they kept her on life support, she’d have been a vegetable,” Makanzee’s great-uncle, Michael Oldham, said Friday evening. “They’re going to donate her organs, so they’ll keep her on the machine until Sunday.”\nThe Wayne County Prosecutor’s Office on Friday announced charges against three men from Detroit in the shooting of Makanzee, whose birthday would have been June 13.\nShe is the latest child to fall victim to Detroit’s violence. The charges were for assault with intent to murder, although because she died, the charges will likely be amended.\nIn the past two months, eight youths have been injured or killed by gunfire.\nIn a second tragic incident involving a child this week, an autopsy has been completed on 2-year-old Aaron Minor, but the cause of death hasn’t been determined, Wayne County Medical Examiner spokesman Lloyd Jackson said.\nPolice are trying to determine whether Aaron’s death is a homicide.\nHis mother, identified by family as Deanna Minor, was hospitalized May 16, leaving Aaron alone in their west side apartment for nine days before a maintenance man found his body Wednesday, a police source told The Detroit News.\nThe police source said neighbors dialed 911 to report the boy’s mother was outside her apartment having difficulty breathing. An EMS crew arrived and took the woman to a Detroit hospital without going inside her apartment, the source said.\nMinor was then taken to Ann Arbor, released Tuesday and entered psychiatric treatment, police said.\nAaron likely was dead by his third birthday Monday, the source said. Meanwhile, Makanzee’s relatives held out hope she’d make it to her third birthday.\nInstead, the family will plan a funeral. A GoFundMe page has been set up to help with expenses.\n“It’s just a shame,” Oldham said. “I don’t understand how a child can be put in a situation like that. It’s a total nightmare. It’s even worse that she’s got a birthday coming up in two weeks. A little girl should be allowed to celebrate her third birthday.”\nPolice on Thursday arrested Cleveland Smelley, 30, in connection with Makanzee’s shooting. A citizen tip led police to an Oak Park motel where Smelley was hiding, police said.\nProsecutor Kym Worthy said in a press release Friday she had charged Smelley; a relative, Antoine Smelley, 32; and Deonta Bennett, 21, with eight counts each of assault with intent to commit murder.\n“It is alleged that Antoine Smelley was at a home in the 16400 block of Fairmount,” Worthy said in the release. “He poured juice over the head of a woman who was getting ready to leave the house to go to a prom.\n“Antoine Smelley pulled out a handgun and threatened the young woman and her friends.”\nWorthy’s office said that a short time later, Cleveland Smelley and Bennett drove over to the house and met with Antoine Smelley and a fight broke out with several other people.\n“During the fight, it is alleged that Bennett gave a handgun to Cleveland Smelley, who shot at seven people in a car,” including Makanzee.\nIn addition to the assault charges, Cleveland Smelly is charged with felony firearm, second offense. Bennett was also charged with felony firearm, and Antoine Smelley was also charged with felonious assault and felony firearm.\nThe three were expected to be arraigned at 11 a.m. Saturday in 34th District Court in Romulus.\nOldham said it’s disheartening to hear of children being hurt.\n“This violence has to stop. Not just what happened to my family; it’s a lot of families. You see it way too much. These kids didn’t ask to be put in the middle of these situations.”\nGHunter@detroitnews.com\n(313) 222-2134\nTwitter: @GeorgeHunter_DN"}