{"uri": "http://www.13newsnow.com/story/news/2014/09/09/14817524/", "title": "Guadalajara Town Center closing after shooting", "dct": "Thu, 27 Jun 2013 00:00:00 GMT", "id": "9eb0b359ac13aaf6665fd76555de0a79", "content": "VIRGINIA BEACH -- Guadalajara will close at the end of its business day Sunday, June 30, a week after a shooting near the restaurant killed one person and left others hurt.\nThe shooting, which happened about 1:30 a.m. June 23 near the stairwell of a parking garage near the restaurant led to the death of Rashawn Dukes. Virginia Beach police said Dukes lived in North Chesterfield, Virginia.\nLouis S. Haddad, President & CEO of Armada Hoffler said in a statement, 'In due consideration of the events that took place last weekend, Armada Hoffler and the management of Guadalajara have mutually decided to close the restaurant at the end of this week. Although we have no knowledge of what factor, if any, the establishment played in the tragedy, we are taking this action in the best interest of the Town Center community.'\n'This opportunity will be used to bring a new and exciting concept to Town Center in the not-too-distant future. We will have no further comment on this matter,' said Haddad.\nJerry Rodriguez, Owner of Guadalajara Restaurant said in a separate statement, 'I support and appreciate Armada Hoffler's decision to close Guadalajara's Restaurant effective at the end of business this coming Sunday night. In the aftermath of last week's incidents, I had already decided to stop operating a dance club at the establishment.'\n'I am disappointed for our 40 employees who have worked very hard to make Guadalajara's an outstanding Mexican restaurant. I will do all I can to help them find new jobs,' Rodriguez said in the statement. 'Although there is still no evidence that Guadalajara's or its customers had any involvement in last Sunday morning's tragedy, I understand that change is necessary. As a restaurateur for the past two decades, I want to continue to be part of the Virginia Beach business community and to share my skills and talents with those patrons from across Hampton Roads who enjoy dining in Town Center on a daily and nightly basis.'\n'It's just really unfortunate that an isolated incident that had nothing to do with us, you know, is pretty much the downfall of this place,' said bartender Dean Kohler. 'We've done, and Jerry had done, and the management and staff, we've all done a more than superb job of making sure that, you know, this is not only a family place but a place where young people like myself can come out and have a good time.'\n'It's a great restaurant, a family atmosphere, and I think it's a sad thing for them to close and the employees to lose their jobs,' Melody Sumpter told 13News.\nSumpter is a Guadalajara regular.\n'Anything can happen anywhere, and it's because, I think, they've focused on this being particularly a nightclub and the after hours that they've put blame over here whether it really is their fault or not, and it's the only restaurant that's going to be affected, that's closing, and that's sad,' shared Sumpter.\n'I was surprised it happened as fast as it did. I didn't know if maybe they would change something, add some security,' said Nichole Hamilton who moved to Town Center in January. 'As a resident here, I'm kind of glad to see it, because, you know, we have a really great group of people here.'\n'The shooting didn't actually happen inside of the establishment, and I think that is unfair to the establishment and the business owner,' said Andrea Washington who lives in Norfolk.\nWashington also shared her concern about what happened.\n'As a mother and a family person, I don't want my children and family involved in any type of shooting or crime in a nice community that we have here. This is something that Virginia Beach really built up for the community,' Washington said, 'so I do understand.'\nPolice have not made any arrests connected to the shooting."}