{"uri": "http://boston.cbslocal.com/2016/12/28/hunter-accidental-shooting-orange-hunter-richardson-recovery/?e=upbO673BSwLuGA", "title": "Hunter Takes Responsibility After Accidentally Shooting Himself While Testing Ice", "dct": "Wed, 28 Dec 2016 18:13:00 GMT", "id": "69d1c4d916b8172a3e4b72b7ccfc35f6", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nWORCESTER (CBS) – Hunter Richardson was enjoying his holiday break back home in Orange after his first semester at Keene State.\nBut he spent Christmas — and the days since — lying motionless in the Intensive Care Unit at UMass Memorial Hospital in Worcester with his family at his bedside.\n“It’s horrible,” says his mother Lee Anna Richardson with tears streaming down her cheek. “There’s really no other way to say it.”\nThe 18-year-old went out deer hunting on Christmas Eve with his father, younger brother, and cousin – in the woods off Tully Road near the Athol line.\nThat’s where Hunter smacked his rifle butt on an icy pond to see how thick enough to support his weight. But the muzzleloader fired — ripping into his chest.\n“I never in a gazillion years thought I’d be in the ICU with my son,” says his Mom, “hoping he’d just survive.”\nHis dad — a retired Marine — stopped the teen’s bleeding out in those woods, and a stranger at a nearby tree nursery used his tractor to clear a path for first responders.\nFortunately, the bullet missed Hunter’s heart and a major artery, but it tore through his left lung and shattered his shoulder blade.\nDoctors haven’t yet decided if they should try to remove the bullet fragments. That’ll come later.\n“You survive off of everybody’s prayers and love,” his mother says.\nAnd there’s been plenty of that. Friends have ferried in meals as the Richardson’s keep a ’round the clock vigil at the hospital.\nBut the family has also been stung by the online venom of some people who have sarcastically jabbed Hunter for his lapse in judgment — even though the teen has owned it from the start.\n“Before he was sedated, he said he took responsibility for it,” Lee Anna Richhardson laments. “It was his fault. He screwed up. That doesn’t mean he’s a bad person or irresponsible. He just made a mistake.”\nState Environmental Police point to the incident as a somber reminder for all hunters to always make sure the muzzle of their rifles is pointed in a safe direction.\nNow, Lee Anna Richardson says she’d much rather focus on her son’s recovery, and the GoFundMe page aimed at helping out with the mounting medical bills.\n“If you would be kind enough to donate that would be wonderful,” she says. “If not, a prayer works just as well.”\nAt this point, it’s baby steps for Hunter, as he faces at least two weeks in the ICU — and a long recovery.\nFollow\nFollow Ken on Twitter Ken MacLeod is a general assignment reporter and substitute anchor at WBZ-TV News. Before joining the Boston-based station, MacLeod worked at WKMG-TV (CBS) in Orlando, Florida where he co-anchored the station’s mo...\nMore from Ken MacLeod"}