{"uri": "http://www.mlive.com/news/kalamazoo/index.ssf/2016/02/6_people_dead_in_multiple_shoo.html#incart_river_home", "title": "6 people dead in multiple shootings: Man 'shooting to death innocent people'", "dct": "Sun, 21 Feb 2016 13:33:54 GMT", "id": "8e3bc2adc677b76987d418ee2677ec07", "content": "UPDATE: Names of victims released\nUPDATE: Suspect was an Uber driver\nUPDATE: 10 Kalamazoo mass shooting details from the police news conference\nUPDATE: Police at 2:50 a.m. confirm a seventh shooting victim has died, but later said that victim is still alive in critical condition.\nUPDATE: Police at 12:40 a.m. take a suspect into custody on the north side of Kalamazoo.\nUPDATE: Police at 12:30 a.m. confirmed they responded to multiple reports of shots fired at OP and 6th Avenue in Texas Township. No victims were found, police said.\nKALAMAZOO, MI -- Seven people were dead Saturday night after multiple shootings around Kalamazoo County, and authorities say the person responsible seemed to be shooting \"at random.\"\nThe suspect is described as a white male in his 50s, driving a dark blue Chevy HHR.\nFive people were shot in vehicles outside the Cracker Barrel on 9th Street in Texas Township. Police say that shooting is tied to another at a Seelye car dealership in Kalamazoo, and another shooting at the Meadows Townhomes complex in Richland Township.\n\"It appears we have someone driving around and doing nothing but shooting to death innocent people at random,\" Kalamazoo County Undersheriff Pali Matyas said from the scene at Cracker Barrel.\nMatyas said the first shooting occurred at the townhomes complex, 5066 Meadows Blvd. around 6 p.m. There, a woman was shot in the parking lot. Matyas said she is in serious condition.\nA second shooting occurred at Seelye Ford, 4102 Stadium Drive, shortly before 10:30 p.m., where two people were shot and killed in the parking lot.\nKalamazoo Public Safety Chief Jeff Hadley told WWMT that the two killed at the dealership were both male, and are believed to be a father and son who were looking at a vehicle.\nAround 10:30 p.m., five people were shot in vehicles in the parking lot of Cracker Barrel, 5581 Cracker Barrel Blvd., off of 9th Street in Oshtemo Township. Four died at the scene, and a fifth died later at Bronson Hospital. Matyas said he didn't have any more specifics on the victims' genders and ages.\nEmily Monacelli is a reporter for MLive.com. Contact her at emonacel@mlive.com or follow her on Twitter."}