{"uri": "http://www.nbcnews.com/news/us-news/show-it-all-charting-week-s-top-stories-n521801", "title": "Show It All: Charting the Week’s Top Stories", "dct": "Fri, 19 Feb 2016 18:33:00 GMT", "id": "b50db674745459f81e1398f1d08ae156", "content": "In a week of clashes, Apple fought the FBI, while Donald Trump went head-to-head with the pope.\nHere's a look back at those stories and other highlights — in the form of five handy charts:\nScalia, the bench's ideological conservative known for his fiery comments in and out of the courtroom, was found dead Saturday morning at the age of 79. Scalia's casket is on view Friday in the Supreme Court's Great Hall, allowing the public to pay their respects. The justice, who served on the nation's highest court for nearly three decades, will be laid to rest on Saturday. President Barack Obama has vowed to nominate a successor — even though some in the Senate have vowed to block his nominee or said that the next president should be given the responsibility.\nMusic's biggest night was full of drama, during and after the main event. Adele's performance was marred by rogue microphones, David Bowie's son didn't dig Lady Gaga's tribute to his dad and Sir Paul McCartney was denied entrance to an after-party. The awards portion of the evening was not to be ignored, though. \"Uptown Funk,\" the hit track from Mark Ronson and Bruno Mars, won Record of the Year, and \"1989,\" by Taylor Swift, won Album of the Year.\nA federal judge on Tuesday ordered Apple to give investigators access to encrypted data on the iPhone used by one of the San Bernardino shooters. Apple is fiercely opposing the order, accusing the federal government of an \"overreach\" that could potentially breach the privacy of millions of customers. Apple's response in court was originally due Tuesday, but is now due on Feb. 26.\nThe pontiff has a message for Donald Trump — building a wall on the Mexican border is \"not Christian.\" Trump responded: \"No leader, especially a religious leader, should have the right to question another man's religion or faith.\" But Trump later blamed the media for misrepresenting the Pope, insisting what he said was actually softer than what was reported. He said the pope was a \"wonderful guy,\" and added he \"doesn't like fighting with the Pope.\"\nA new NBC News/Wall Street/Marist poll shows that Donald Trump's lead in Saturday's South Carolina primary has declined from 16 points to five. The NBC/WSJ/Marist poll in advance of South Carolina's Democratic primary — which will be held on Feb. 27 — Hillary Clinton leads Bernie Sanders among likely voters by 28 points, 60%-32%. Eyes will also be on Nevada this week, where Democrats will caucus on Saturday and Republicans will caucus on Tuesday."}