{"uri": "http://www.ktnv.com/news/crime/1-dead-in-shooting-in-apartment-complex", "title": "UPDATE: Family, friends remember teen killed in shooting", "dct": "Mon, 11 Jul 2016 20:19:00 GMT", "id": "92de5e26dc759bcacc46d140ad663731", "content": "Autoplay:Family remembers teenage shooting victimCONNECTING...XFamily, friends remember teen killed in shooting\nUPDATE: The teen shot and killed at an apartment complex Monday evening has been identified as 17-year-old Robert Joseph Bustos II. A GoFundMe has been set up for his funeral expenses.\n\"He's not another story on the news,\" said cousin Sam Paul. \"He had a family that loved him, he had a bright future, and it was taken from him.\"\nBustos was preparing to start his senior year at Spring Valley High School.\n\"So athletic, he did wrestling, football,\" said Paul.\nMore than a hundred people gathered at a memorial to honor the slain teen Tuesday night. Friends were in tears as they remembered the peaceful bright-eyed young man.\nA witness tells 13 Action News she heard three people were arguing right before the gun shots.\nTwo men were trying to convince the third to get out of his car.\n\"They were just saying you need to unlock this door,\" said the witness who was too afraid to be identified.\nPolice are still looking for the two suspects. Anyone with information is urged to contact police.\nORIGINAL STORY:\nLAS VEGAS (KTNV) -- A man is dead in a shooting Monday evening.\nThe shooting occurred around 6:30 p.m. at an apartment complex near Rancho Drive and Decatur Boulevard. Police responded to a report of shots fired and found a man with two gunshot wounds in front of an apartment.\nHe was transported to University Medical Center where he was later pronounced dead.\n#BREAKING @LVMPD homicide on scene after person shot/killed in parking lot Alterra apts. @KTNV pic.twitter.com/78nS5VOXql\n— Mahsa Saeidi (@MahsaKTNV) July 12, 2016\nOne of the suspects was described as a Hispanic man in his 20s with a black baseball hat and a ponytail, according to Lt. Dan McGrath. He was seen running from the scene. Another Hispanic man with a beard was also seen.\nMcGrath did not comment on a motive but expressed frustration over the shooting.\n\"Whatever the motive is, it's probably going to be something that's absolutely not necessary and senseless and didn't need to get shot over,\" he said.\nLas Vegas Metropolitan Police Department homicide detectives are investigating."}