{"uri": "http://www.cincinnati.com/story/news/courts/2014/07/25/fatal-teen-shooting/13155789/", "title": "13-year-old takes plea deal in fatal shooting of friend", "dct": "Fri, 25 Jul 2014 00:00:00 GMT", "id": "e85f331ce038fa473dd7f59245f03cd3", "content": "A 13-year-old boy accused of accidentally shooting his 13-year-old friend to death with a stolen gun took a plea deal to avoid being charged as an adult, juvenile court officials say.\nThe teenager has agreed to plead guilty to reckless homicide and theft. He will be sentenced Aug. 18.\nJuvenile Court administrator, Curt Kissinger, said the teenager faces a maximum sentence of commitment to the Ohio Department of Youth Services until his 21st birthday.\nGreen Township police say the teen stole the gun from a friend's grandfather sometime June 29, and then brought the .357-caliber Magnum revolver over to his friend's house on Marie Avenue, where he and the boy he shot played with it.\nThe boys spun the cylinder around in the gun, according to Lt. Jim Vetter, which hit the trigger, and the gun went off, fatally shooting the suspected shooter's 13-year-old friend.\n\"These are 13-year-olds and I don't think they understood the dangers of the situation,\" Vetter said. \"It's just a horrible tragedy for all parties involved. Nobody's intention was for anyone to get hurt.\n\"I can't imagine what the (teen suspect) is going through. I hope we all learn something from this as we move forward.\"\nOne message police want to stress is for gun owners to lock up their weapons, particularly if youth are in the house. Vetter said the stolen gun was not locked up; it was hidden under a mattress.\n\"I would advise anyone to re-evaluate where they keep their weapon,\" Vetter said. \"If you have kids in the house, you better lock (your guns) up.\"\nA woman called 911 from a home in the 5500 block of Marie Avenue about 2:15 p.m June 29 and said the victim was shot in the head, according to a recording of the call.\nShe told the dispatcher she had medical training and gave the boy CPR.\n\"Keep breathing. I mean it, you are not going anywhere,\" she pleaded with the dying boy. \"Keep breathing. I know you can hear me, stay with me.\"\nGreen Township paramedics took the teen to Mercy West Hospital, where he was pronounced dead."}