{"uri": "http://www.latimes.com/local/lanow/la-me-ln-shooting-southwest-la-20161015-snap-story.html", "title": "'A bloody scene': 3 killed, 12 wounded in gun battle at West Adams restaurant", "dct": "Sat, 15 Oct 2016 17:50:00 GMT", "id": "41c1f1fc12272e6c052b87df77dba118", "content": "Los Angeles police are searching for several suspects in connection with the mass shooting at a restaurant in the West Adams district that left three people dead and 12 others wounded.\nDetectives are searching for at least three suspects in the shooting, said LAPD Capt. Peter Whittingham. Police took into custody two “persons of interest” — a man and a woman, who was among those injured — but neither has been formally arrested.\n\"We have street names for these suspects but we don't know who the killers are yet,” he said. “The people shot either don't know the killers or aren't telling us what they do know.\"\nAs for the motive, Whittingham said it may have been more than a simple argument that erupted at the eatery, but detectives could not say for sure. A gun was recovered from the scene.\n\"It may be a narcotics-related dispute … a dispute between parties over business transactions,\" Whittingham said.\nDetectives believe the shooters killed their primary target with a hail of bullets.\n\"We believe there was return fire,\" Whittingham said.\nThere were at least 50 people inside the restaurant in the 2900 block of Rimpau Boulevard at the time of the incident, Sgt. Frank Preciado said.\nThree men left the restaurant, returned with firearms and began shooting, police said. Others at the restaurant also opened fire, and some diners were caught in the crossfire, Preciado said.\nThe shooting continued in the driveway of the restaurant, which is located in a house on a residential block, police said.\n“When we got there, there were three people dead and people running everywhere,” Preciado said. “We had multiple people with gunshot wounds.”\nNumerous officers from across Los Angeles were sent to the scene, which Preciado called “really devastating.”\n“It’s a bloody scene with shell casings everywhere,” he said.\nOfficers spent much of Saturday canvassing the neighborhood looking for witnesses.\nSome of the wounded were taken by ambulance to hospitals, while others drove themselves, authorities said.\n“The injured are scattered across Los Angeles hospitals.” Preciado said.\nDeputy Chief Bill Scott, head of the LAPD’s South bureau, said his officers were still trying to piece together what happened.\n\"This is real tragic. We have a lot of sorting out to do. When the shooting started, everyone scattered,” he said. “Our detectives are getting a better picture of what unfolded.”\nThe owner of the Jamaican eatery, who identified himself only as Dilly, told The Times on Saturday that he runs a catering business out of the house, not a restaurant. He said that he was hosting a birthday celebration when the shooting occurred.\n“I do catering, that’s all I do,” he said. “Except on Saturdays when people come over and I cook food for them.”\nThe man, 63, said he has operated his business out of the house for more than a decade. He said another shooting occurred at the location in 2011.\n\"The guy that died in that shooting was my friend,\" he said.\nA neighbor, who lives on nearby Westhaven Street and did not want to be identified, said she was putting her dog to bed at about midnight when she heard what at first sounded \"like fireworks.\"\nThere was a momentary pause, she said, then: \"It was just pop, pop, pop, pop, pop. It didn't stop. It just kept going.... Really loud.\"\n\"It was a series [of gunshots] first, like really fast, then a pause, almost like someone reloaded,\" she said. \"It was specific, as if someone was pointing at people.\"\nShe estimated she heard about 20 gunshots in total. She ran to the window and watched people run by her house, screaming. Some held beer bottles, she said. Many jumped in their cars and sped off, she said.\nWithin minutes, police helicopters appeared overhead and fire trucks and police cars were parked on the street, she said.\nPaul Elen, 64, who was visiting his brother in the neighborhood, said he “heard about 15, 20 shots.”\n“First it was two shots,” he said. “Then they started firing again.”\nHe said he saw people running down the street. “I seen somebody fall so I said, ‘It's time to go in the house,’” he said. \"I heard a lot of screaming.”\nEarlier, Elen said, he and his brother had gone over to the house where the party was to ask that a car be moved from his brother’s driveway. He said there were more than 100 people in the house and yard and that a DJ was playing music.\nShortly after he left the party, Elen said, he heard the gunshots.\n“My brother thought it was fireworks,\" he said. \"I said, \"No, ain't no smoke in there. Them ain't fireworks, them gunshots.”\nThere were two shots and then a break, he said, “like someone shot back.\" Elen walked to the end of the driveway and saw people running down the street.\n\"I never witnessed nothing like that over here before,\" Elen said. \"Last night was new for everybody.\"\nThe neighbor who did not wish to be identified said that at least 50 people fled throughout the night and that things didn't calm down until 2 or 3 a.m. Many more streets were blocked off overnight, she added, and at least 40 police cars were in the area at one point.\nBlair Hamilton, who lives one block from the scene of the shooting on Westhaven Street, said he came out of his house and saw people \"running every which way.\"\n\"Total chaos,\" said Hamilton, 58.\nHe saw an older woman sitting on the curb with a bloodied face. Two other women sat next to her, at least one whom also appeared to be injured, he said.\nThere was also a girl lying across the curb, Hamilton said. She was moving and being attended to by another girl, he said.\nMeanwhile, police were escorting people out of the house, he said.\nNeighborhood residents say they have grown accustomed to gatherings and parties on the block. The closest neighbors said they can often smell grilled chicken and hear music.\nSome of the parties are larger and louder than others, but in general, they said they did not find the previous gatherings disruptive; neighbors described some of those who attended the parties as very nice.\nAlvin Fortier has lived on Rimpau Boulevard for 10 years and said he knows the people at the house where the shooting occurred.\n\"They're friendly with me,\" he said."}