{"uri": "http://6abc.com/news/teen-dead-in-mayfair-triple-shooting/1549155/", "title": "Teen killed in Mayfair triple shooting identified", "dct": "Tue, 11 Oct 2016 00:00:00 GMT", "id": "9ca0e46724d91b705e9b3b19f98cebf3", "content": "MAYFAIR (WPVI) --\nFamily members have identified the teenage boy shot and killed Monday night in the Mayfair section of Philadelphia.\nSeventeen-year-old Quantico Brunson-Moton was shot along with a 16-year-old boy and a 21-year-old man after gunfire erupted around 9:10 p.m. Monday on the 3100 block of Stirling Street.\nHe died late Monday night at Aria Health/Frankford.\nSurveillance video shows Quantico, the two other victims and two more people standing outside the corner grocery store Monday night.\nA white car pulled up, and a man dressed in all black got out and walked down Hawthorne Street. A little while later, the group followed in that direction.\nPolice say it was there, in a nearby alley, that shots were fired. Quantico was shot in the torso, as was a 16-year-old victim. A 21-year-old shot in the neck, and ran to the 15th District for help.\nBack on the surveillance video, you can see the man run back to the idling white car outside the corner store.\nQuantico was killed. On Tuesday, his father washed away the blood left at the scene.\n\"We kept our son close, and we kept his friends close. They call us 'mom' and 'pop' all day\" said Nasir Wideman, victim's father.\nSurveillance video shows Quantico inside the corner store just before the shooting that would claim his life. His parents said he excelled in sports and was well-liked.\n\"He was silly all the time. He was just silly all the time\" said Wideman.\nPolice found a revolver and a shoe at the scene, along with shell casings from at least two weapons. Police hope the video helps identify the shooter or shooters. Quantico's parents want justice.\n\"You took the wrong person's mom and dad's son\" said Shantice Moton-Wideman, victim's mother.\n\"We know for a fact there was definitely people out there that saw and know what happened, but we need them to contact us\" said Philadelphia Police Capt James Clark.\nPolice tell action news there are rumors circulating that there may be a fourth gunshot victim who has yet to come forward. A young man who didn't show up for school on Tuesday. They are working to determine if that is true, and to establish a motive for Monday night's deadly motive."}