{"uri": "http://augustacrime.com/friends-remember-13-year-old-augusta-boy-killed-by-gun/", "title": "Friends Remember 13-Year-Old Augusta Boy Killed by Gun", "dct": "Sat, 08 Oct 2016 00:00:00 GMT", "id": "6ebaeaaddc25cde21517339e6fbdbe38", "content": "Friends are remembering 13-year-old Michael Caleb McNatt and sharing photos of him after he was accidentally killed Friday while he and some friends were playing with a gun.\n“I loved him very much,” said Alicia Watkins, who calls herself Michael’s best friend at school. She also sent us the picture at right.\n“He called me his sister. … He would always make jokes and everyone at school would laugh with him. And I loved when he would always make a beat in class.”\nMichael, a seventh grader at Pine Hill Middle School, was shot at a home on Dove Roven Road in Augusta. He was rushed to the hospital but died. Sheriff’s Lt. Allan Rollins said the shooting was a result of several young people playing with a gun and the gun going off while someone else was playing with it. No charges have been filed.\nA GoFund me page has been set up to help the family with funeral expenses as well as medical bills from the efforts to save his life. The page includes the picture at right. You can get to the page here: https://www.gofundme.com/calebmcnatt\n“No family ever expects to lose a child,” the page says. “In our time of grief and sorrow, we could use your help to cover the expense that follows a tragedy like this one.”\nThe page also tells more about Michael: “He loved swimming and video games like many young boys. Kind, and always polite, he was the best of us all. He leaves behind a little Brother Colden Ray, Mother Stacy Cook, Grandparents Donna and Roscoe Cook.”\nThe grandmother of Emma Bartlett sent this photo at right of Emma and Michael during one of their happy times. She said they were boyfriend and girlfriend for awhile.\n“He was a good boy,” the grandmother said. “I am so sad for his family.”\nThe grandmother also sent the photo above of Michael hugging a friend.\nAnother message from Antonio Hoffman and Karina Cruz says they knew Michael because they used to play Xbox together.\n“He was a really nice kid and we loved talking to Michael,” they said. “He will always be in our prayers and memories.”"}