{"uri": "http://wthitv.com/2016/10/24/terre-haute-man-accused-of-accidently-shooting-himself-with-stolen-gun/", "title": "Terre Haute man accused of accidently shooting himself with stolen gun", "dct": "Mon, 24 Oct 2016 13:36:00 GMT", "id": "890fc11b19cde92a2149b1c96310a1b8", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nTERRE HAUTE, Ind. (WTHI) – A Terre Haute man accidentally shot himself after police say he stole a gun.\n27-year-old Robert Doss Jr. faces multiple charges, including carrying a handgun without a license and theft of a firearm.\nPolice said on October 17th, Doss shot himself in the hip.\nAccording to the police report, Doss was in the 12-Points area buying drugs.\nPolice say Doss and a woman named Amanda Roberts asked someone to drive them to Hollywood Avenue to buy K2 and weed.\nDoss allegedly stole a gun from a truck outside of the home.\nThe group went to the gas station at 25th and Lafayette.\nWhile inside the gas station, Roberts told police someone came in and told her Doss had been shot.\nShe says when she went out to Doss, he told her to throw the holster in the trash.\nWhen police arrived, Doss told them he was shot by an unknown person that left the scene.\nRoberts told police his gunshot wound was because he was mishandling the gun.\nWhile at the hospital Doss was interviewed and arrested.\nHe is currently in the Vigo County Jail.\nIt’s the fifth day of a student sit-in at Purdue’s Hovde…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}