{"uri": "http://localusnews.com/2013/06/26/violence-is-not-ok-in-beach-at-town-center-or-anywhere-else/", "title": "Violence is not OK in Beach – at Town Center or anywhere else", "dct": "Wed, 26 Jun 2013 12:25:00 GMT", "id": "38a89735414287d53011d7b61d22a66a", "content": "Here's something you may not know about Virginia Beach: Violent crime is apparently tolerated in some sections of the city and not so much in others.\nTake Town Center, for instance.\nThere's something special about that shiny faux downtown, where skyscrapers jut incongruously into the air and the landscape is peppered with chain restaurants. A shooting there this past weekend grabbed everyone's attention.\nEspecially the mayor's.\n\"These things don't happen at Town Center,\" Mayor Will Sessoms huffed this week. \"We're going to have police making sure something like this doesn't happen again.\"\nHear that, hairballs? Take your weapons elsewhere. No shooting on the streets of this public-private Shangri-la.\nFact is, things like this do happen at Town Center, and the mayor knows it. The presence of a Cheesecake Factory doesn't create an invisible shield that wards off gunfire.\nWhat's implied in the mayor's declaration – intended or not – is that crime may be a fact of life in parts of the rapidly urbanizing Beach, but it will not be tolerated at Town Center.\nAccording to police, five people were shot near a Town Center parking garage early Sunday, and another person was grazed by a bullet. One man, Rashawn R. Dukes, 25, of North Chesterfield, died. The others are recovering.\nJudging from Sessoms' reaction, you'd assume this was the first shooting ever at Town Center. You would be wrong.\nIn fact, another one made a much bigger splash. That was in June 2010, when a reveler at Michael Vick's Guadalajara birthday bash was shot in the leg around the corner from the popular Town Center night spot.\nThe most mysterious thing about that outburst of violence was that, despite lots of people in the vicinity, no one seemed to see what happened. It was as if a phantom fired the shots at Vick's dogfighting co-defendant, Quanis Phillips, and then vanished.\nNo arrest ever was made.\nThat shooting put Town Center on the national news, making headlines everywhere from CNN to USA Today to ESPN.\nNow, according to a story by The Pilot's Elisabeth Hulette, the mayor is worried that last weekend's shootings could spook business owners who are contemplating a move to Town Center's newest tower when it's complete.\nFrankly, the effect the shootings might have on commerce ought to be the least of our concerns. Every act of violence in town should be treated as an affront to civilized society. Every killing ought to be regarded as a tragedy.\nNo matter where the crimes are committed.\nPolice say that 21 people were killed in Virginia Beach last year. This year, there have been nine homicides.\nDoes anyone recall the mayor shaking his fist in anger in early May when 35-year-old Ronald Jamall Green was found shot to death near Witchduck Road?\nDid he declare that \"these things don't happen behind the Witchduck Exchange shopping center?\"\nTo be fair, it's not only the mayor. The Pilot slapped this Town Center shooting on the front of Tuesday's Hampton Roads section. When Green was killed, a much shorter story ran inside the section.\nA double homicide at Rally's on Lynnhaven Parkway in January got heavy media coverage, but most of the other 2013 fatal shootings have received far less.\nFact is, folks who live, work and socialize in less swanky sections of Virginia Beach deserve the same concern from the mayor – and the newspaper – as the swells who cruise to Town Center on a Saturday night in the Mercedes.\nIt's not the address of the crime that matters. It's that it happened at all.\nKerry Dougherty, 757-446-2306, kerry.dougherty@cox.net\nRead more from source:\\”Hampton Roads\\”\nviolence is not ok in beach at town center or anywhere else\nAnd here is for the eye:Images from around the web about violence is not ok in beach at town center or anywhere else, hope you like them. Keywords: violence is the last refuge of the incompetent, violence is not the answer, violence is golden, violence is never the answer, violence is the answer, violence is usually the answer, violence is, violence is always the answer, violence is the answer patch, violence island, violence is not ok in beach at town center or anywhere else .\nviolence is not ok in beach at town center or anywhere else related images"}