{"uri": "http://www.readingeagle.com/news/article/sinking-spring-man-killed-family-self-investigators-say", "title": "Sinking Spring man killed family, self, investigators say", "dct": "Tue, 16 Aug 2016 00:01:00 GMT", "id": "ddae746d86a48361462bda7072814481", "content": "Reading Eagle: Tim Leedy | The house in Sinking Spring where the Short family was found dead Aug. 6.\nReading Eagle: Ben Hasty | Berks County District Attorney John T. Adams announces that Mark Short killed his family and himself in their Sinking Spring home on Aug. 6.\nReading Eagle: Natalie Kolb | Berks County District Attorney John T. Adams announces that Mark Short killed his family and himself in their Sinking Spring\nReading Eagle: Natalie Kolb | Berks County District Attorney John T. Adams announces that Mark Short killed his family and himself in their Sinking Spring\nOn July 18, as his marriage disintegrated, Mark Short bought a .38-caliber revolver and ammunition from a Lancaster County gun dealer.\nInvestigators said Monday that the five-shot revolver was the weapon they found next to Short's body three weeks later after he killed his family, their dog and himself in their Sinking Spring home.Mark Short legally purchased the gun the day after Sinking Spring police were called to their home in the Brookfield Manor development on the northeastern corner of the borough for a domestic dispute, investigators said at a news conference Monday.\nListen to the press conference:\nYour browser does not support the audio element.\nHis wife, Megan, called 9-1-1 during the domestic argument, officials said. Her husband left before police arrived, and he couldn't be located, Police Chief Lee Schweyer said.Megan Short told officers that she feared her husband, and they instructed her how to get a temporary protection-from-abuse order, Schweyer said.Megan Short never followed through with applying for a PFA, he said.A week later, however, she leased an apartment in Yardley, Bucks County, and started moving her belongings there, Berks County Chief Detective Michael J. Gombar said.On Aug. 5, Mark Short took the three children to Hersheypark as part of a family day sponsored by his employer, investigators said. About 7:30 p.m. that night, investigators said, a neighbor saw Megan Short park her car in the driveway of their home directly behind her husband's parked vehicle.About four hours later, Megan Short posted a Facebook message on her page, investigators said.On Aug. 6, her mother and other relatives waited at the Yardley apartment for her to arrive with the children, investigators said. When they couldn't reach her on her cellphone or home phone, her mother phoned a neighbor to check if anyone was home at the Short house.The neighbor got no answer at the door, but reported both family vehicles were in the driveway.Alarmed, Megan Short's mother, Jacquelyn Massott Campbell, called police to do a welfare check.Officers broke a kitchen window to gain entry and discovered the awful scene.On the living room floor, investigators said, police found the bodies of 33-year-old Megan Short, 40-year-old Mark Short and the couple's three children: Liana, 8; Mark Jr., 5, and Willow, 2, all dead of a single gunshot wound each. The family dog also was found dead.Dr. Neil W. Hoffman, a forensic pathologist, determined after an Aug. 8 autopsy that Mark Short died of a self-inflicted gunshot wound to the head from the revolver found next to his body, investigators said.The children and Megan Short appeared to have been sleeping in the living room before they were shot because they were found in pajamas under blankets, Gombar said.Investigators would not specify the order of the killings, but said Mark Short fired a total of six shots, one of which killed his dog.Detectives with the district attorney's office took over the investigation from Sinking Spring police and seized several items for forensic analysis.District Attorney John T. Adams said police did everything they are legally permitted to do to help a woman who reports abuse by an intimate partner.“This was a very, very unfortunate incident,” Adams said. “I don't know that anything can be learned other than when leaving an abusive relationship it's often a very dangerous time for a victim, so we urge anyone who's in a similar situation to develop a safety plan and contact their local domestic violence agency for assistance.”Adams added: “We want to express our deepest sympathy to all family members affected by this tragedy. Our heartfelt thoughts and prayers go out to them during this difficult time.”Adams also thanked the numerous first-responder agencies that assisted at the scene and its aftermath.The press conference in the auditorium of the county agricultural center in Bern Township was the first time officials publicly identified the killer.“At no time did we want to jump to conclusions,” Adams said.Detectives analyzed a fingerprint from a live round of ammunition in the handgun and it was matched to Mark Short, Adams said.Investigators believe the bullet was placed in the gun after he reloaded in the basement following the killings.Police also found a one-page note handwritten by Mark Short. Adams said the suicide note included a confession that he killed his family.At the family's request, authorities are not giving more details on the contents of the note.On the day of the slayings, Adams said, Mark Short was going to rent a moving van to help his wife move out. She was going to take the children with her.Adams said Mark Short had no known mental health issues, but he was clearly distraught over the breakup of his marriage.He had been demoted at his job, a mortgage company, in part due to poor attendance, he said.“I don't think we know specifically as to why this relationship had disintegrated,” Adams said. “We don't have specific answers for that.”The family was featured in an October 2014 story in the Reading Eagle. Willow, then 5 months old, had undergone a heart transplant at 1 week old, and her condition had been improving.Megan Short was active in raising awareness for congenital heart disease, regularly promoting it on her Facebook page. She also wrote for Phillyatheart.com, a website associated with the nonprofit Mended Hearts Inc. that shares the stories of families battling congenital heart defects.The oldest child, Liana, was to be a third-grader at Wilson School District's Green Valley Elementary School.“This is a very tragic incident that took place in our community and we hope we can heal,” Adams said.Contact Steven Henshaw: 610-371-5024 or shenshaw@readingeagle.com.\nToys, candles and flowers sit outside the Short family home. Investigators say Mark Short killed his wife, Megan, and their three kids.\nMegan Short and her three kids were killed the day she planned to move them out. Experts urge victims of abuse to have a safety plan.\nFamily of five was found shot to death in their home on Aug. 6.\nA neighbor describes Facebook exchanges with Megan Short, in which she hinted at abuse, her plan to move out the day of the murder-suicide.\nWelcome guest! | subscribe | log in"}