{"uri": "http://www.wral.com/four-people-shot-behind-church-in-rocky-mount/13334346/", "title": "Teen in critical condition after shooting at Rocky Mount basketball court", "dct": "Tue, 28 Jan 2014 00:00:00 GMT", "id": "888c24bd9cb913224f538e1ed0913365", "content": "Video Playback Not Supported\nPlay Video\nPlay\nMute\nCurrent Time 0:00\n/\nDuration Time 0:00\nLoaded: 0%\nProgress: 0%\nStream TypeLIVE\nRemaining Time -0:00\nPlayback Rate\n1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptions\nFullscreen\nAutoplay:\nOn / Off\nThis is a modal window.\nThis video is not supported on your platform. Please make sure flash is installed.\nCaptions Settings Dialog\nBeginning of dialog window. Escape will cancel and close the window.\nText Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps\nDefaults Done\nFour people shot in Rocky Mount\nAre you still watching?\nYes, ContinueNo\nRocky Mount, N.C. — A 12-year-old was in critical condition Tuesday after he and three others were shot on a Rocky Mount basketball court.\nFour teens, the 12-year-old was the youngest, were shot on the court behind Word Tabernacle Church on Edwards Street at about 6 p.m. Monday evening, police said.\nThe other victims, ages 13, 17 and 19, were treated for minor injuries and released Monday night from Nash General Hospital.\nPolice had only a vague description of the shooter, whom they said ran to a light blue, small SUV parked nearby and fled the scene.\nAnyone with information about the shooting is asked to call the Rocky Mount Police Department at 252-972-1411 or Twin County Crime Stoppers at 252-977-1111. Tips can be texted to RMPOL (76765). Include the word \"crimes\" in the message.\nThe church held a community information session and prayer vigil Tuesday at noon, and was planning a public forum on gun and gang violence and other related issues. That forum has yet to be scheduled.\nIn a statement, church leaders said the teens were not church members, but that the public courts were provided as a safe place to play for for the community.\n\"It is regrettable to us as a faith community that this trust has been violated. We are actively ministering to every family involved and are continuing to work closely with these families, law enforcement and city officials,\" the church's statement said."}