{"uri": "http://www.joplinglobe.com/news/update-names-of-shooting-victims-released/article_4eb7fb98-6167-11e6-b649-e781be5fb980.html", "title": "UPDATE: Names of shooting victims released", "dct": "Sat, 13 Aug 2016 00:00:00 GMT", "id": "5a2fc008bd07c0852f75c67bbadd94f8", "content": "Three members of Immanuel Lutheran Church in Joplin who were on their way to St. Louis for a meeting were among those shot early today in Joplin, according to a statement released by the Joplin Police Department.\n• Kenneth Eby, driver of the Immanuel Lutheran Church van, received multiple gunshot wounds and is in critical but stable condition at a Joplin hospital.\n• Karen Mech was riding in the back seat of the van and sustained shrapnel injuries and cuts. Her injuries are listed as minor.\n• Heidi Gustin, who was riding in the back seat of the church van, received a gunshot wound in the arm and her injuries were listed as serious but not life threatening.\nThe three were on their way to St. Louis for a meeting about the church's Comfort Dog ministry. The two dogs in the van were shot as well. A bullet grazed one dog while the other was sustained a gunshot wound and is currently in surgery.\nThe two other victims of the shooting were:\n• Donal Pugh, the driver of a truck at 32nd Street and Texas Avenue, who received multiple gunshot wounds and is listed as being in serious but stable condition.\n• Debbie Pugh, a passenger in the truck, who received sharpnel injuries and cuts and her injuries are listed as minor.\nPolice responded to a call at 5:08 a.m. today about a possible shooting at a duplex at 1810 S. Connecticut Ave. Police said there were no victims at the scene. The suspect, Tom S. Mourning II, 26, was driving south on Connecticut Avenue when police prepared to stop his vehicle.\nAs the suspect drove, he allegedly fired shots at a van from Immanuel Lutheran Church that was stationed near 32nd Street and Connecticut Avenue.\nThe suspect also allegedly fired multiple shots at an oncoming white pickup truck with two adults inside near 32nd Street and Texas Avenue, police said.\nThe suspect made a U-turn and eventually turned north on Pearl Avenue. He surrendered to police near 30th Street and Pearl Avenue and was arrested at 5:22 a.m. without resistance, police said.\nAccording to Jason Glaskey, others from the church ministry also were in the van as well, but were not hit.\n\"This came out of the blue and all of a sudden people were shot and going to the hospital,\" said Glaskey, head of the church's comfort dog ministry and director of Christian education at Immanuel Lutheran Church, 2616 Connecticut Ave.\nHe said he was not aware of any one at the church who knew the suspect, adding: \"It was random.\"\n\"Our dogs were also injured. One of them has been released and the other one is receiving medical care,\" he said, referring to Louie and Jackson.\nComfort dogs go into schools, communities, hospitals and nursing homes, and deploy after disasters, \"to help people with spiritual and emotional care.\"\nThe story has been updated to correct information the Joplin Police Department provided.\n***************************************\nJoplin police are trying to determine the motive of a 26-year-old man who was arrested early this morning following an active-shooter situation, which resulted in three crime scenes and five people injured.\nPolice responded to a call at 5:08 a.m. about a possible shooting at a duplex, 1810 S. Connecticut Ave. Police said there were no victims at the scene that they have found. The suspect, Tom S. Mourning II, 26, was driving south on Connecticut Avenue when police prepared to stop his vehicle, they said during a press conference this morning.\nAs the suspect drove, he allegedly fired shots at a van from Immanuel Lutheran Church that was stationed near 32nd Street and Connecticut Avenue. Police said four people were inside the van: three adults and one juvenile. The van was stopped at a stoplight.\nPolice said the adults in the van were taken to local hospitals as result of direct fire or shrapnel. One victim is listed as critical but stable, another is serious but stable and the third victim was released.\nThe suspect also allegedly fired multiple shots at an oncoming white pickup truck with two adults inside near 32nd Street and Texas Avenue, police said. The driver was in stable condition, while the passenger was released, police said.\nPolice said there have been no fatalities from this incident so far.\nThe suspect made a U-turn and eventually turned north on Pearl Avenue. He surrendered to police near 30th Street and Pearl Avenue and was arrested at 5:22 a.m. without resistance, police said.\nA rifle and handgun allegedly were found in his vehicle, police said. Charges haven't been submitted to the Jasper County Prosecutor's Office, so the suspect has not been charged yet.\nPolice said a motive for the shootings has yet to be determined. There appears to be no relation between the suspect and the victims, and the shootings appear to be \"random,\" police said.\n\"As rounds were being fired, they (police) continued to stay with that suspect, continued to pursue that suspect even though they knew the suspect was actively firing his weapon,\" Police Chief Matt Stewart said.\nAlthough closed for some time, 32nd Street has reopened to traffic, police said.\n\"We are very grateful that these victims do not appear to have life-threatening wounds because of this act,\" Mayor Mike Seibert said at the press conference.\nThe investigation is ongoing. This story will be updated at joplinglobe.com with more details as they become available.\n******************************************\nJoplin police arrested a 26-year-old man early this morning following an active-shooter situation, which resulted in multiple crime scenes and victims.\nPolice responded to a call at 5:08 a.m. about a possible shooting at a duplex, 1810 S. Connecticut Ave. The suspect, Tom S. Mourning, 26, was driving south on Connecticut Avenue when police prepared to stop his vehicle, they said during a press conference this morning.\nAs the suspect drove, he allegedly fired shots at a van from Immanuel Lutheran Church that was stationed near 32nd Street and Connecticut Avenue. Police said four people were inside the van: three adults and one juvenile. Police said the adults in the van were taken to local hospitals.\nThe suspect also allegedly fired shots at a white pickup truck with two adults inside near 32nd Street and Texas Avenue, police said. The driver was in stable condition, while the passenger was released, police said.\nPolice said there have been no fatalities from this incident so far.\nThe suspect surrendered to police near 30th Street and Pearl Avenue and was arrested at 5:22 a.m. A rifle and handgun allegedly were found in his vehicle, police said. He hasn't yet been formally charged.\nThe investigation is ongoing. This story will be updated at joplinglobe.com with more details as they become available."}