{"uri": "http://www.cbs46.com/story/26474728/2-year-old-shot-in-stone-mountain", "title": "2-year-old shot and killed in Stone Mountain, aunt and uncle arrested", "dct": "Mon, 08 Sep 2014 14:39:00 GMT", "id": "20dfb4916ff3f0217cb89f7c92f668a6", "content": "STONE MOUNTAIN, GA (CBS46) -\nA 2-year-old child was shot and killed in Stone Mountain. His aunt and uncle have now been charged in connection to his death.\nStone Mountain police received a call to a house on Third Street shortly after 10 Monday morning.\nThat's where they found 2-year-old Kamarri Lewis dead.\nKamarri's aunt and uncle have been arrested and charged in connection to the crime.\nPolice arrested 23-year-old Alexia Thomas and charged her with cruelty to children, possession of cocaine and reckless conduct.\nDetray Shivers, 25, also faces the same charges, as well as tampering with evidence.\nPolice said they found the weapon involved, a semi-automatic handgun, outside in a storm drain.\nPolice said Shivers was the one who threw the gun in the storm drain.\nOne family member, who did not want to be identified, couldn't believe how quickly Kamarri's life slipped away.\n\"My little brother played football with him yesterday. He was like I was just playing with him. He's not here anymore.\"\nOfficers said Thomas found him inside the home, but he'd already passed. She told police she was sleeping when the child was shot.\n\"I've never seen a weapon inside the home,\" said Thomas. \"I don't know how to respond. I'm still in shock. This is crazy. I don't know how to respond.\"\nPolice said a single gunshot took the child's life, and unfortunately took the entire neighborhood by surprise.\nCopyright 2014 WGCL-TV (Meredith corporation). All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}