{"uri": "http://www.kcra.com/news/local-news/news-stockton/2yearold-grazed-by-bullet-while-sleeping-in-manteca-home/40056910", "title": "Toddler wounded when Manteca home targeted in shooting", "dct": "Wed, 15 Jun 2016 06:49:00 GMT", "id": "497d4087320a66519b7bf58dee7c923b", "content": "MANTECA, Calif. (KCRA) —\nA 2-year-old girl was shot while sleeping in Manteca home early Tuesday morning, police said.\nThe shooting happened around 2:50 p.m. in the 300 block of Lincoln Court. Patricia Medina’s family was jolted from their sleep by the gunfire.\n“I said, ‘the house has been shot! Somebody shot the house and the baby’s shot!” Medina recalled.\nThe baby is her daughter’s sister-in-law’s daughter, who was visiting the family.\n“I start seeing blood and I got all hysterical and I said, ‘Where’s the blood who’s bleeding?’ And they said, ‘The baby, the baby’ and I said, ‘Please, Lord,” Medina said.\nA 2-year-old girl was grazed by a bullet on her right wrist and is expected to be okay. She was taken to the hospital to get treatment. No one else was injured in the shooting.\n“They were just holding her wrist because everyone was scared to see what damage it was,” Medina said, adding that she helps care for the child. “Police said, if it was inches closer, it could have gotten her more serious.”\nMedina said the home was struck by five bullets, two of which shattered the window of the little girl’s bedroom.\nManteca police said the home was specifically targeted and the shooting could have been a drive-by.\n“We don’t know why or who would do something like this why?” Medina said. “We don’t bother nobody.”\nThe 2-year-old was released from the hospital later Tuesday, and her family isn’t sure if they feel comfortable sleeping in their own home tonight.\n“We don’t know if we’re going to stay here or go,” Medina said. “No one feels safe no more. My daughter doesn’t feel safe with the kids here at the house.”\nPolice are asking for the public’s help with the investigation. If you have information you’re urged to call the Manteca Police Department at 209-456-8223 or CrimeStoppers at 209-823-4636."}