{"uri": "http://www.masslive.com/news/index.ssf/2016/04/springfield_police_17-year-old_1.html", "title": "Springfield police: 17-year-old punched holes in walls after shooting 15-year-old girlfriend, before fleeing in a panic", "dct": "Sat, 09 Apr 2016 15:45:00 GMT", "id": "91892658344c42d7e14a7e592026dda1", "content": "SPRINGFIELD - A 17-year-old who may have accidentally shot his 15-year-old girlfriend on Thursday night punched holes in the walls before fleeing her Plainfield Street home, according to a police spokesman.\nDaneyshkalis \"Daney\" Davila died of a single gunshot wound to her stomach on Friday, after her condition was initially listed as serious, but stable. Police believe the shooting may have been accidental, based on witness accounts.\nSgt. John M. Delaney, spokesman for the police department, said Davila's 13-year-old brother called 911 after witnessing the shooting, which occurred on the third floor of the home. The victim's mother and several other children also were in the house, but not in the room where the gunfire erupted, Delaney said.\n\"I can tell you there was virtually no crime scene because there wasn't a drop of blood in the room,\" Delaney said.\nPolice and an ambulance were summonsed to the house around 2 p.m. on Friday, after Davila's mother became overwrought when she learned her daughter had died, according to Delaney.\nA makeshift shrine with dozens of candles, floral bouquets and hand-written messages of sorrow and support dominated the front steps of Davila's home on Saturday. While dozens gathered for a vigil on Friday evening, the house was largely quiet on Saturday morning but for a few friends who came to pay their respects.\n\"Today an angel got her wings. Beloved by friends and family. Surely missed but never forgotten by friends and family. Strong, she was, kind and quiet too,\" one sign on the front steps read.\n\"Daney's world,\" read another.\n\"There was virtually no crime scene because there wasn't a drop of blood in the room.\" Police Sgt. John Delaney\nThe 13-year-old brother told investigators the 17-year-old boyfriend - who has not been named because he is a juvenile - was spinning the loaded chamber of a revolver when the cylinder snapped shut and the gun went off.\nDelaney refused to comment on the weapon or whether investigators had recovered the gun.\nPolice arrested the boy at a family member's home Friday after he ran from the scene, Delaney said, adding that he believed the boy took off in a panic.\nThe boy was arraigned Friday in Hampden County Juvenile Court and may face additional charges, police said.\nIt is unclear whether Hampden District Attorney Anthony Gulluni will pursue adult charges against the alleged shooter. Gulluni declined comment on Saturday, citing the ongoing investigation.\nIn 2013, former Gov. Deval L. Patrick signed a new law that categorized 17-year-olds as juveniles in the criminal courts, as opposed to adults, as the law stood previously.\nMassachusetts was the 39th state, along with the federal system and the District of Columbia, to classify defendants younger than 18 as juveniles in the courts."}