{"uri": "http://kdhnews.com/news/crime/killeen-man-who-shot-girl-gets-probation/article_ab9748be-0a51-11e5-ae98-f7893a7bb715.html", "title": "Killeen man who shot girl gets probation", "dct": "Thu, 04 Jun 2015 04:30:00 GMT", "id": "180e46f4faa4d55316e9e97606f18409", "content": "Audley Burrell, 42, of Killeen, was indicted in August on a charge of injury to a child with serious bodily injury.\nAccording to an arrest affidavit, the victim’s mother called police July 26 after “she heard a pop, then her daughter began to complain her arm hurt.”\nThe mother found dime-sized hole in the victim’s arm and a hole in the ceiling of the apartment, according to the affidavit.\nWhen police interviewed Burrell, he told them “he was drinking for several hours when he passed out,” the affidavit said. “Audley Burrell stated he woke up and grabbed his firearm, and due to him drinking, he dropped the weapon on the floor, causing it to discharge.”\nIn a sentencing hearing Wednesday in Judge John Gauntt’s 27th Judicial District Court, prosecutors said the bullet fired from Burrell’s weapon passed through a tendon in the girl’s arm, requiring surgery to repair the damage.\n“We’ve got a little girl with a messed-up hand,” Suzanne Wohleb said. “She’s probably going to be dealing with that for the rest of her life.”\nBurrell, a medically retired soldier, spent at least 54 days in the Bell County Jail before spending at least 125 days in VA substance abuse, post-traumatic stress disorder counseling and other programs. Burrell’s defense said hospital staff reported a general improvement in Burrell’s state of mind during that time.\nBurrell’s defense also called his sister, Sophia Johnson, to the stand. She said Burrell would have a support network of family ready to take him into their Florida home if Gauntt would grant Burrell probation.\nThe prosecution asked for a five-year prison sentence, but the defense asked for probation, calling the shooting accidental.\nAfter a short deliberation, Gauntt ordered Burell placed under 10 years of adjudicated probation and transferred his case to Fort Lauderdale, Fla., where he will be living with family.\nBurrell also must pay $550 in restitution and a $1,500 fine."}