{"uri": "http://www.katu.com/news/local/Hospital-Boy-14-dies-2-week-after-Marysville-school-shooting-282006201.html", "title": "5th teen dies following Marysville high school shooting", "dct": "NODATE", "id": "384feac8927980074e1faaa0f88a0c5e", "content": "SEATTLE (AP) - A fifth teenager has died as a result of a Washington state high school shooting two weeks ago that began when a student opened fire in the cafeteria.\nHarborview Medical Center in Seattle said 15-year-old Andrew Fryberg died Friday evening of his wounds.\nZoe Galasso, 14, was killed during the shooting Oct. 24, by a popular freshman at Marysville-Pilchuck High School.\nGia Soriano, 14, died Oct. 26 at Providence Regional Medical Center in Everett and 14-year-old Shaylee Chuckulnaskit died Oct. 31 at the Everett hospital.\nThe shooter, Jaylen Fryberg, died of a self-inflicted wound.\n\"We express our thanks for the amazing support from the community, as well as from everyone around the world that have been praying for us all through this tragic event,\" Andrew Fryberg's family said in a statement released by the hospital. The family also thanked \"all the amazing staff\" who cared for the boy in Harborview's pediatric intensive care unit. The relatives asked for privacy.\nAndrew Fryberg was the last wounded student still hospitalized.\nOn Thursday, 14-year-old Nate Hatch was released from Harborview and returned home. He had been shot in the jaw.\nMore than 200 friends and family gathered along the road leading onto the Tulalip Indian Reservation north of Seattle to welcome Hatch home. He was driven past the crowd in a black tribal police vehicle.\nAndrew Fryberg and Nate Hatch were cousins of the shooter.\nIn a statement Friday night, the Tulalip Tribes said they and Marysville \"will be forever changed as a result of the senseless and tragic incident that took place on the morning of Oct. 24 and know that healing will not happen overnight. We remain committed to taking this journey together, step by step, holding up the families most impacted and helping our communities heal.\"\nThe school 30 miles north of Seattle reopened Monday after being closed for a week. Hundreds of people lined the entrance. Well-wishers waved at returning students and many held candles. People cheered as buses and cars entered the school campus.\nThe school day started with an assembly. Students ate lunch in the gym because the cafeteria where the shooting took place remains closed.\nSnohomish County Sheriff Ty Trenary told reporters last week that Jaylen Fryberg invited his victims to lunch by text message, shot them at their table, then killed himself.\nThe sheriff said detectives were digging through reams of text messages, phone and social media records as part of an investigation that could take months.\n\"The question everybody wants is, 'Why?'\" Trenary said. \"I don't know that the 'why' is something we can provide.\"\nJaylen Fryberg, a football player who was named a prince on the school's homecoming court a week before the killings, was a member of a prominent Tulalip Tribes family. He seemed happy although he was also upset about a girl, friends said. His Twitter feed was recently full of vague, anguished postings, like \"It won't last ... It'll never last,\" and \"I should have listened. ... You were right ... The whole time you were right.\"\nNate Hatch was still hospitalized when he posted a message of forgiveness on Twitter.\n\"I love you and I forgive you jaylen rest in peace,\" he wrote. A friend confirmed the feed's authenticity to The Associated Press."}