{"uri": "http://www.cleveland.com/crime/index.ssf/2016/11/cleveland_man_accidentally_sho.html", "title": "Cleveland man accidentally shot while group mourned friend's fatal shooting", "dct": "Wed, 16 Nov 2016 15:51:00 GMT", "id": "434e6c150983c93e7dad2c3b6110130a", "content": "CLEVELAND, Ohio -- A man accidentally shot his friend Tuesday while they were paying respects to a man shot and killed earlier this year in Cleveland's Clark-Fulton neighborhood, police said.\nThe friend, an 18-year-old Cleveland man, suffered a gunshot wound to his back about 5 p.m. at West 43rd Street and Clark Avenue.\nThat intersection was the site of the fatal shooting of 22-year-old Jose Reyes on March 9.\nReyes' brother picked up the 18-year-old and another friend on Tuesday, then drove to the intersection \"to smoke weed in remembrance of\" Reyes, a police report stated.\nThe gunshot victim said the group had been paranoid that the man who killed Reyes might be following Reyes' brother around. Before the group exited their car to pay respects, they were looking around and keeping an eye out for the killer, the report stated.\nIt was then the victim, who was in the front passenger's seat, heard a shot go off. The friend, who was in the rear passenger's seat, had accidentally fired his gun, the report stated.\nThe man who fired the round hopped out of the car and began screaming \"I shot him, I shot him,\" according to the report.\nThe trio then rushed to MetroHealth, where the backseat passenger exited the car and ran off. Hospital staff said he was carrying a gun in his waistband, police said.\nWhile undergoing treatment for the gunshot wound, the 18-year-old told police he didn't want to get anyone in trouble for the accident.\nInvestigators later found what appeared to be a bullet hole in the front passenger's seat, police said.\nNo charges have been filed in the accidental shooting case.\nPolice have accused Carlos Garcia-Toro, 26, of East Cleveland, of killing Reyes. A warrant for aggravated murder was issued against him back in March, but Garcia-Toro remains on the loose.\nU.S. Marshals arrested a man they believed to be Garcia-Toro in June, but later walked that announcement back, saying they'd actually arrested his cousin.\nGarcia-Toro has been wanted on murder charges in Puerto Rico since 2012, and has been living in Cleveland under the name Peter Marquez Marquez, according to authorities.\nIf you would like to comment on this story, please visit Wednesday's crime and courts comments section."}