{"uri": "http://www.wpbf.com/news/fort-myers-nightclub-issues-statement-on-fatal-shooting/40867674", "title": "Fort Myers nightclub issues statement on fatal shooting", "dct": "Mon, 25 Jul 2016 23:06:00 GMT", "id": "31f5171c617ca05edcf34c2e10e26614", "content": "FORT MYERS, Fla. —\nTwo teenagers were killed early Monday morning at a Fort Myers nightclub.\nClub Blu Bar and Grill posted the following statement on their Facebook page Monday morning about the fatal overnight shooting at the Fort Myers nightclub:\n\"We are deeply sorry for all involved. We tried to give the teens WHAT WE THOUGHT WAS A SAFE PLACE TO HAVE A GOOD TIME. Ages 12-17. There was armed security as well as full security,inside and out. As the club was closing and parents were picking their children up.....that's when all this took place. There was nothing more we could of done as you see it was not kids at the party that did this despicable act.\"\nDownload app: iOS | Android\nSean Archilles, 14, and Stef'An Strawder, 18, were shot to death in the club's parking lot, Fort Myers police said. Up to 16 were injured in the early-morning gunfire at Club Blu Bar and Grill.\nPersonnel from the bar and grill weren't the only people who released a statement about the shooting.\nA press conference was held at 2 p.m. Monday at Fort Myers Regional Operations Center at 4700 Terminal Drive in Fort Myers. Speakers included Mayor Randall P. Henderson, Jr., Interim Fort Myers Police Chief Dennis Eads, Lee County Sheriff Mike Scott and a representative from Lee Memorial Health System.\nScott said authorities suspect the gunfire was gang-related and not an act of terrorism.\nScott changed his plans Monday after he was informed about the shooting. The governor canceled a scheduled appearance Monday in Fort Lauderdale to meet with law enforcement officials in Fort Myers.\n\"While we are still learning the details about what happened this morning, we know that some of the victims of this terrible incident were children,\" Scott said in a prepared statement.\nScott called the fatal shooting at a teen nightclub in Fort Myers \"horrific, tragic news.\" \"This state believes in justice. So those that have been involved in this, they will clearly be held accountable,\" he said.\nScott released the following statement below about the shooting:\n“Following the horrific news of a shooting at a nightclub in Ft. Myers, I spoke with Ft. Myers Mayor Randy Henderson, Lee County Sheriff Mike Scott and Ft. Myers Interim Police Chief Dennis Eads to offer any assistance from the state. I have cancelled my scheduled events today to meet with law enforcement and local officials in Ft. Myers. While we are still learning the details about what happened this morning, we know that some of the victims of this terrible incident were children. We will continue to pray for the victims and their families.”\nThe City of Fort Myers has created Together Fort Myers Fund, a fund for victims, families and those affected by the Club Blu shooting where 100 percent of funds donated will provide assistance and service to victims and families.. For more information, go the website: http://bit.ly/2a9wvrK"}