{"uri": "http://www.reuters.com/article/us-florida-shooting-idUSKCN1050U0", "title": "Suspects sought in Florida nightclub shooting that left two teens dead", "dct": "Tue, 26 Jul 2016 00:17:13 GMT", "id": "842a1b9ef22d23cdd9f22e65b1a718df", "content": "This video requires an up to date browser.\nFlorida police said on Monday they had taken three people into custody but were searching for additional suspects in connection with a shooting outside a nightclub just after midnight that left two teenagers dead and more than a dozen people wounded.\nThe shooting took place shortly after 12:30 a.m. EDT (0430 GMT) on Monday in the parking lot of Club Blu, which was hosting an event open to teenagers, the Fort Myers Police Department said.\nPolice said Stef'An Strawder, an 18-year-old high school basketball star, and Sean Archilles, 14, were killed. Two other people were critically wounded.\nPolice officials in Fort Myers, located on Florida's Gulf Coast, said terrorism was not a factor in the state's latest outburst of gun violence this summer, but provided no details about a possible motive.\nThe three young men were arrested after fleeing the scene in two vehicles and were charged in connection to that pursuit, according to the Lee County Sheriff's Office said in a statement posted on Facebook.\nAccording to the statement Derrick Church, 19, was charged with assault on a law enforcement officer after accelerating his vehicle toward a sheriff's deputy. Church was shot in the stomach by the deputy during that altercation, but was treated and had been released from a hospital, the sheriff's department said.\nDemetrius O'Neal, 19, and Tajze Battle, 22, were taken into custody on suspicion of resisting arrest, according to the statement.\n\"This was not a terrorist act,\" Fort Myers interim Police Chief Dennis Eads said at a news conference.\nHe said officers responding to the shooting found chaos at the scene.\n\"No one really knew what was going on or what happened,\" Eads said.\nOfficers provided first aid to victims, bandaging some with tourniquets to stop bleeding, he said. Paramedics took some victims to the hospital while others drove themselves.\nAt least 19 people, ranging from 12- to 27-years-old, were treated at local hospitals, said Lisa Sgarlata, chief administrative officer for Lee Memorial Hospital.\nThree patients remained hospitalized at Lee Memorial as of Monday afternoon, two of whom were in critical condition.\nThe shooting came six weeks after a massacre at a nightclub in Orlando, in central Florida, where a gunman who sympathized with Islamist extremist groups killed 49 people in the deadliest mass shooting in modern U.S. history.\nDespite the recent violence, Florida Governor Rick Scott said the state's crime rates were at a 45-year low.\nFort Myers, about 150 miles southwest of Orlando, was the scene of another shooting incident last October when one person was killed and several wounded by gunfire at a festival that attracts thousands of people in zombie costumes.\nALL-AGES PARTY\nBefore the latest shooting, Club Blu, located in a partially vacant strip mall, was hosting a \"swimsuit glow party\" for people of all ages, according to a flyer posted on Twitter by television station WINK.\nThe nightclub said on its Facebook page that the shooting occurred when the venue was closing and parents were picking up their children. The page later appeared to have been removed.\n\"We tried to give the teens what we thought was a safe place to have a good time,\" the nightclub's post said, adding that armed security guards were present inside and outside the club. \"It was not kids at the party that did this despicable act.\"\nJean Archilles, 37, the father of the 14-year-old killed, said his son loved sports, especially basketball.\n\"It happened for a reason. I don't know what the reason is,\" he said in a telephone interview, adding that he had not been told details about his son's death.\nSean Archilles was due to enter eighth grade at Royal Palm Exceptional Center, while Strawder was to start his senior year at Lehigh Senior High School, according to the Lee County School District.\nStrawder's mother, Stephanie White, told the News-Press newspaper that her son was shot in his right shoulder as he walked out of the club and was pronounced dead at the hospital. His 19-year-old sister survived a gunshot wound in the leg, White said.\nPolice said shots were also fired at a nearby residence, where there was one minor injury.\nIn a video interview, Syreeta Gary said her daughter and a friend ran for cover. Her daughter escaped unscathed, but a bullet struck a friend in the leg.\n(Additional reporting by Letitia Stein in Tampa, Florida, Colleen Jenkins in Winston-Salem, North Carolina, Frank McGurty and Laila Kearney in New York and Mary Milliken and Dan Whitcomb in Los Angeles; editing by Leslie Adler and G Crosse)"}