{"uri": "http://www.wmcactionnews5.com/story/33744655/man-arrested-in-birthday-party-mass-shooting", "title": "8 people shot, 1 killed at 2-year-old's birthday party", "dct": "Sat, 19 Nov 2016 04:35:00 GMT", "id": "c3c5c75cb64260b5e6c49af2f0570d9a", "content": "DYERSBURG, TN (WMC) -\nA man is charged with first-degree murder in the shooting that killed a woman and injured seven others at a birthday party Thursday.\nThe shooting happened in Dyersburg, TN, just after 6 p.m.\nShanice Amerson, 21, was throwing a outdoor birthday party for her son when a man walked up from the street and opened fire on the crowd.\nAmerson was killed and a 6-year-old boy was taken to Le Bonheur Children's Hospital with multiple gunshot wounds. Lakisha Rollin, 38, is in the hospital being treated for her injuries. Five others, Mazie Jacobs, 37, Diley McVay, 32, Charles Jackson, 23, Latonia Hunt, 22, and a 12-year-old boy, were treated for injuries and released.\nAmerson's friend Sharaven Clinton is still in disbelief that her friend is gone.\n\"I cried coming down this street,\" Clinton said. \"I sat on the porch, looked around.\"\nShe looked at all the birthday decorations on the porch--decorations that were supposed to be for a happy event that turned tragic.\nThey're decorations that remind Clinton that a 2-year-old is now left without his mother.\n\"He don't know what's happening. He don't even know that his momma gone,\" Clinton said.\nFamily members from out of state came to help console Amerson's mother and mourn the loss of the 21-year-old.\n\"I ain't going to say she's gone. She's going to always be on my side,\" Clinton said.\n\"Because as of right now, my nieces and nephews don't have a mother. And we're going to make sure, if possible, they are well taken care of,\" Jones said.\n\"Thanksgiving is right around the corner, and nobody suspected to be having this type of tragedy at this time of the month,\" family member Rosevelt Jones said. \"I know it's going to be hard. It's going to be hard for us to do that. At this moment in time, we're not going to go out for no retaliation on nobody. We're going to stand up as a family, as a whole, and we're going to get through this.\"\nDyersburg Police Chief Steve Isbell said law enforcement had been called to the house earlier in the afternoon.\n\"Officers did respond to the same residence earlier in the day, around 4:15 p.m., in reference to a disturbance where weapons were involved. Responding officers were advised by residents that a white vehicle with multiple occupants had just left the scene and that one of the subjects was armed with a handgun,\" Chief Isbell said. \"Officers did locate the suspect's vehicle a short time later and were granted consent to search. No weapons were located and only one of the original suspects was present at that time. This incident does remain under investigation.\"\nOne of the men believed to be in that white vehicle is Torius Russell, who is now charged with first-degree murder. Russell was arrested around 3 a.m. on Friday. Investigators believe he went back to the birthday party a few hours later and started shooting.\n\"We feel comfortable, based on the progress of last night's investigation by our detectives and multiple interviews, that the person of interest is the only individual who was involved in the actual shooting event,\" Isbell said. \"Barring any further developments, the Dyersburg Police Department does not foresee any additional people being charged in this incident.\"\nCity leaders and community members alike are devastated that this type of violence happened in their community.\n\"We are sad for what occurred in our community last night. This is not normal for our town. I give all the credit to the police department who worked through the night to develop a suspect then make an arrest at 3 a.m. We as a community must come together and pick back up and support one another during this tragic time,\" Dyersburg Mayor John Holden said.\n\"I just want to express also our sincere concern for the families affected. Obviously, any time we have violence that occurs in the community, it's alarming. When you have children involved, it's very disturbing,\" Isbell said. \"It started out as a celebration for a 2-year-old child's birthday and now this child will celebrate no more birthdays with his mother and that's something that should be upsetting to us all.\"\nChief Isbell said Dyersburg Police Department is not prepared to discuss a possible motive for the shooting.\n\"This is still an active investigation even with the arrest of Russell,\" he explained. \"There is still a lot of work to be done on this and to try to connect the dots. At this time, we are not in position to discuss a possible motive.\"\nRussell was arraigned Friday and remains in jail on a $2.5 million bond. He is scheduled to appear in court again on November 28.\nSurvivors speak\nThe 6-year-old boy who is recovering at Le Bonheur Children's Hospital thanked everyone for their prayers in a video his family posted to Facebook.\nThe boy is doing already after he was airlifted to Regional Medical Center from Dyersburg. When he arrived, they discovered how serious his gunshot wounds were, and he was taken to Le Bonheur for emergency surgery.\nHe is one of several children who were in the line of fire Thursday night.\nOne parent said his child is alive because a man at that party shielded the little girl as bullets flew.\nAntoine Ware's two small daughters are best friends with Shanice Amerson's two children. He said his two girls were at the party when the shooter opened fire.\n“Not even two minutes after my babies walked out of the house, I heard gunfire and I come running from my house and up to the front of their house,” Ware said. “When I found my kids, got them from out the back door. Got them home safely and came back over. I found out she was hit and laying in the front.\"\n\"Actually her uncle or brother or one of the two had actually saved my baby's life,\" Antoine Ware, family friend, said. \"He jumped on the porch and throw my baby on-off the porch and landed on top of her.\"\nWare's two small daughters were best friends with Amerson's two children.\nLatonia Hunt was standing behind her close friend Shanice when the man opened fire.\n\"We were over here enjoying ourselves at Kymarie's birthday party, and we were all dancing on the porch... and she was standing in front of me,\" Hunt said.\nShe survived, and six others survived, but Amerson did not.\n\"They started shooting. Everybody, basically everybody on the porch got hit,\" Hunt said.\nLatonia was shot in the leg and now has to walk with crutches, but she is expected to be OK. She said the pain she feels is not physical, but overwhelmingly emotional for her lost friend.\n\"She didn't do nothing to nobody,\" Hunt said. \"She didn't deserve it and neither did her kids deserve it neither.\"\nWhile he mourns the loss of a friend, he is grateful that his daughters were saved.\n“I thank God every day. I thank God that my babies didn't get hurt.\"\nVigil\nDespite the cold rain falling Friday night, Amerson's family and friends gathered to hold a vigil and remember the young mother who lost her life. The vigil was held at the home where Amerson was celebrating her child's birthday when gunshots rang out.\nNow, they have a message. They want gun violence to end.\n\"Put these guns down and stop the violence,\" Roosevelt Jones said. \"Stop the violence. Please stop the violence.\"\n\"This young lady has died and left behind two children, two young children,\" Jones said. \"They don't have a mother now. So we got to stop.\"\nBut, Jones also had a message for the one who pulled the trigger.\n\"To the young man who did this shooting, if you are watching this today, I have no grudges against you,\" Jones said. \"But, what I ask you is to go to God and ask for your forgiveness.\"\nAs tears flowed, Amerson's loved ones held on to each other for comfort. They also released balloons at the very site where Amerson's life came to an end.\nCopyright 2016 WMC Action News 5. All rights reserved."}