{"uri": "http://wjla.com/news/local/family-and-friends-mourn-the-lose-of-shooting-victim-gunned-down-in-aspen-hill", "title": "Family and friends mourn the loss of shooting victim gunned down in Aspen Hill", "dct": "NODATE", "id": "5f3786594d9f17043b6b405562228702", "content": "ASPEN HILL, Md. (ABC7) —\nFlowers, balloons, and tears, were all part of an emotional vigil for shooting victim Claudina Molina.\n\"We are suffering,\" said family member Jason Tastaca. \"It's a giant loss, it's very tragic. And my family is all torn apart about it.\"\nDozens of people came to pay their respects to Molina, gunned down in the parking lot of an Aspen Hill food store Friday.\n\"To come--another tragedy like this, like the sniping shooting. It hits home, its scary,\" said Gina Crim, who dropped off flowers at a memorial in the parking lot Saturday afternoon.\nMolina, a 65-year-old mother of two from Silver Spring, was one of three people killed during 22 terrifying hours of gun violence in the area.\n\"I heard gunshots. Bang bang bang bang,\" recalled gas station Manager Robert Dianat.\nDianat says he ran outside, into a Westfield Mall parking lot and saw three people shot, down on the ground.\n\"It was very terrible to see such things,\" Dianat says. \"And I'm sorry for people you know. The innocent people that get involved in it.\"\nOne of the shooting victims, identified by family members as 45-year-old Malcolm Winffel, of Boyds, was pronounced dead at the hospital.\nFamily and friends held a vigil for Winffel Saturday night.\nA GoFundMe page by the family says Winffel lost his life when \"a stranger approached a woman and opened fire on her.\"\nMontgomery County Police said during a Saturday press conference that Winffel ran to the woman's aid. Police also saying Winffel's heroic act is what \"makes this a great community\".\nThe accused gunman, 62-year-old Eulalio Tordil, now faces multiple murder and weapons charges.\nThree other people were also wounded during the shootings.\n\"The neighborhood is really safe. We don't really lock the doors so, you know, this is really shocking,\" says Richard Tsai, who lives nearby.\nTordil's dramatic capture by police took place in the same plaza where the D.C. snipers first opened fire back in 2002.\nWhile under police surveillance, Tordil ate at the same restaurant where John Allen Mohammed and Lee Boyd Malvo also had a meal.\n\"How do you shoot your wife, come to the mall--shoot three people, go to Aspen Hill, shoot a person and then go get lunch?\" asked Gerald Mimms, a postal worker who often has meal breaks in the mall.\nTordil, a federal security officer, is also accused of shooting his estranged wife Gladys outside High Point high school in Beltsville.\nShe had a court protection order out against Tordil at the time of her death.\nHe is now held in jail without bond, and faces multiple murder, attempted murder, and weapons charges.\nMeanwhile, Molina's family is still numb with grief. They say she was a a certified nursing assistant, due to retire in just eight months.\nThe family has started a GoFundMe account to help pay for funeral expenses.\n\"It's sad, I mean, what happened in Westfield Shopping Center was terrible also. It's scary to go anywhere now. I mean, nobody is safe anywhere,\" Tastaca said."}