{"uri": "http://www.baltimoresun.com/news/maryland/crime/bs-md-ci-memorial-shooting-20160531-story.html", "title": "Baltimore police arrest victim following five-person Memorial Day shooting", "dct": "Tue, 31 May 2016 10:59:00 GMT", "id": "97688024cc4898b0ea1713ba2605aa7c", "content": "Taiquan Moss, 20, a victim from the earlier quintuple shooting in the 500 block of 43rd Street, was charged with handgun violations after he returned to the scene with a handgun in his waistband Monday evening.\n(Courtesy Baltimore Police / Baltimore Sun)\nPolice on Tuesday identified a man arrested Monday night when he returned with a gun to the scene of a five-person shooting at a Memorial Day cookout in North Baltimore.\nTaiquan Moss, 20, was one of five victims of the Monday afternoon shooting in Wilson Park. He was spotted on the block of the shooting by police around 7:45 p.m. with a gun. Police were in the area to gain information on the shooting when they picked up Moss, and charged him with various handgun violations.\nThe shooting occurred in front of a two-story rowhouse on the 500 block of 43rd St. where a car approached the house and opened fire, police said. Five people, including Moss, were shot, and police have yet to announce a suspect or suspects for the shooting.\nMoss and a 25-year-old were both shot in the arm, a 59-year-old man was shot in the buttocks and his 60-year-old wife was shot in the face, police said. None of the injuries appeared to be life-threatening, according to police.\nThe street of the shooting borders two neighborhoods, Wilson Park and Pen Lucy. It was the first shooting this year in Wilson Park. There have been three in Pen Lucy, according to police data through May 21. One of the shootings was a homicide.\nFive people were shot at a North Baltimore cookout Monday, police said. Read more.\nMoss, of the 800 block of Cator Avenue in Pen Lucy, was carrying a loaded .38 caliber revolver in his waistband, according to a police report. He will face a court commissioner for the gun charges, police said.\ntwitter.com/AndrewE_Dunn"}