{"uri": "http://www.nola.com/crime/index.ssf/2016/08/man_killed_in_incident_that_le.html", "title": "Man killed in incident that left state trooper shot, police search for 2 others involved: NOPD", "dct": "Tue, 23 Aug 2016 23:01:00 GMT", "id": "e5c8f1789e9522be6f39c327048c6f84", "content": "A man was shot and killed in an incident that left a Louisiana State Police trooper with a gunshot wound in the 7th Ward on Sunday afternoon (Aug. 21), and police were hunting for two other men involved who fled the scene on foot, NOPD said.\nPolice set an \"active perimeter\" in the area, blocking several blocks as SWAT team members searched homes. (See map of the area below.)\nWitnesses said the men and law enforcement officers exchanged gunfire, with two witnesses saying more than a dozen officers were involved and more than 20 shots were fired.\nUpdate: Officials say the incident began with a traffic stop. Two suspects were still at large as of Sunday evening. Click here for more.\nNew Orleans Police said the trooper was shot in the arm at the corner of Law and New Orleans streets. The trooper was taken to a hospital. State Police spokesman Trooper Melissa Matey said the officer was in stable condition.\nLouisiana State Police car speeds to UMC emergency ramp after trooper shot in 7th Ward. https://t.co/r544pfu3kc pic.twitter.com/DdgNcY3rk6\n-- Emily Lane (@emilymlane) August 21, 2016\nOne person was seen later on the ground behind police screens at the site where police said the trooper was shot. That person was put into an ambulance and taken away. The person's identity and condition, including whether the person was dead or alive were not clear.\nA woman, 58, who declined to give her name for safety reasons, said her 85-year-old mother lives in the same block where the suspect lay in the ground, in the 2600 block of New Orleans Street. She said his body lay about two houses down from her mother's.\nPolice at first blocked off the 2600 block of Allen Street and members of the SWAT team were searching homes in the block and neighboring area. Officers alerted onlookers to stay away from what the officers called a \"hot scene.\" By 5 p.m. police had expanded the search to include several blocks.\nSWAT members in helmets, vests and other gear dotted the multi-block crime scene. Two black NOPD SWAT vehicles unloaded at least a half dozen agents and gear at the coroner of Industry and Allen Streets. One agent took from the truck what appeared to be a battering ram.\nAn NOPD search and rescue K-9, Axel, and his handler entered the scene at the same corner.\nNOPD SWAT vehicle unloads agents, equipment at Industry and Allen streets, around 7 p.m. pic.twitter.com/jXjXT8EEBQ\n-- Emily Lane (@emilymlane) August 22, 2016\nTwo witnesses said the incident involved an exchange of gunfire between at least one person and more than a dozen law enforcement officers.\nAlbert Girard, who said he was in the area visiting friends, said he saw police first exchange gunfire with two men near the corner of Duels and Allen streets. Girard said the suspects then ran through the back yards of homes on the block and had another exchange of gunfire with officers at Law and New Orleans streets, two blocks away from the first site.\n\"I saw the policemen chase them,\" Girard said. \"It was a rolling gun battle.\"\nAnother witness, who asked to be identified only as James P., said about 15 officers were at Law and New Orleans streets apparently looking for someone when a man in a gray outfit motioned to the officers and then began firing at them.\nThe witness said an exchange of gunfire ensued, at which time the trooper was injured.\n\"It was surreal,\" the witness said.\nA woman on her porch on Annette Street, who declined to provide her name for safety reasons, said she was in the kitchen when she first heard gunshots. She said she then came to the front door and saw a car speeding down Duels Street, a cross street to Annette on her block, followed by a Louisiana State Police car. She then quickly got back in her house before hearing more gunfire.\n\"In situations like that you just want to get out of harm's way,\" she said.\nThe woman whose mother lived in the block where the suspect's body lay said she went to her mother's after her mother called to say someone was knocking at the door. The woman said she didn't know if the sound her mother heard was gunfire or police going door-to-door as part of the investigation.\nShe said she felt sorry for the deceased man's parents, adding, \"You gotta be crazy to shoot at police.\"\nA man who said he was in the neighborhood at the time of the shooting said a man who lay near New Orleans and Hope streets after being hit during an exchange of gunfire with police was wearing a blue striped shirt and jeans.\nA neighbor who would only give her first name, Sylvia, said she had gone for a walk with her sister and came back to find her street blocked off by police. She's been having chest pains and was worried about being able to access her medication. Concerned about the crime in the area, she said she had planned to move out of the neighborhood last week but her move was delayed.\n\"I've been trying to get away from around here,\" she said. \"This is my first and last time living in the 7th Ward.\"\nStaff writers Emily Lane and Michael DeMocker contributed to this report. Stay with NOLA.com | The Times-Picayune for more on this developing story."}