{"uri": "http://www.whio.com/news/news/crime-law/shooting-reported-in-springfield/njDDR/", "title": "Fatal Springfield shooting victim identified", "dct": "Sat, 22 Nov 2014 00:00:00 GMT", "id": "af8d9b4cfc3aad4becdca959c0fba478", "content": "UPDATE @ 2:50 p.m.\nSpringfield police are investigating an early morning shooting that left one man dead and sent three others to Dayton hospitals Saturday.\nDavienne J. Lewis of Springfield died at Springfield Regional Medical Center of a single gunshot wound, according to Clark County Coroner’s Office investigator Mike Haytas.\nThe 23-year-old’s address was reported as 218 E. Third St., but an aunt who spoke with Hayes said he only occasionally stayed at that house.\nThe Montgomery County Coroner’s Office on Saturday performed an autopsy.\nLewis was found around 2:15 a.m. lying on Rice Street west of Clinton Avenue.\n“A car was all shot up,” Haytas said.\nHe said it was not clear whether Lewis was ever in the car. Multiple shots were fired at the scene, but only one hit Lewis, Haytas said.\nSpringfield police Sgt. James Hall described the situation as “touchy.”\n“I can’t release anything at this time,” he said\nA short time after emergency crews took Lewis to the hospital, two males of unknown ages were dropped off at Dayton Children’s Hospital with gunshot wounds they suffered during the shooting in Springfield. CareFlight flew the pair to Miami Valley Hospital before 3:30 a.m.\nThe fourth person arrived in Good Samaritan Hospital’s emergency room with a gunshot wound in his arm. He also was transported via CareFlight to Miami Valley Hospital.\nUPDATE @ 10:34 a.m.\nA 23-year-old male from Clark County has died, according to the Montgomery County Coroner’s Office.\nAn autopsy was expected today on the victim, whose identity has not been released.\nFIRST REPORT\nA shooting in Springfield sent one man to the hospital and might be connected to other shooting victims reported around Dayton.\nSpringfield Police say they responded to a report of shots fired at Clifton Avenue at Rice Street around 2:15 a.m. Police add they found one person with at least one gunshot wound and took them to Springfield Regional Medical Center. That victim has since been taken to Miami Valley Hospital for treatment. The condition of that victim is unknown.\nA short time later two people of unknown age were dropped off at Dayton Children’s Hospital with gunshot wounds. Those two were transported via CareFlight to Miami Valley Hospital before 3:30 a.m. They advised Dayton Police that they were shot in Springfield but would not say where. Their conditions are also unknown at this time.\nA third gunshot victim was reported in the emergency room at Good Samaritan Hospital where that person said he was shot in the arm also in Springfield. They were also transported by CareFlight to Miami Valley Hospital with an unknown condition.\nBoth Dayton and Springfield Police are investigating and believe that all the incidents are related.\nFIRST REPORT\nPolice have been dispatched to a shooting reported in Springfield at Clifton Avenue at Rice Street."}