{"uri": "http://www.godanriver.com/opinion/editorials/highs-lows-a-quick-take-on-the-dan-river-region/article_ef0298f0-6b13-11e6-adf3-b765d0d0a5c0.html", "title": "Highs & Lows: A quick take on the Dan River Region", "dct": "Sat, 27 Aug 2016 00:00:00 GMT", "id": "ba04a0eef4a46df78144b9fd59a37d21", "content": "High/Low:\nA community recently came together to support a young Danville family whose 3-year-old son died in an accidental shooting.\n“This is too much grief,” community organizer Shakeva Frazier said.\nAbout 150 people attended the neighborhood event last Thursday at the Constance Covington Youth Center at Cardinal Village to support the parents of William Lawrence “Trae” Betts III.\nHigh:\nIn the late 1990s, a house fire caused by a natural gas line that failed pushed the city government to start a program to replace all of the aging metal gas lines rotting under Danville’s streets. After the third River District power outage linked to the Bridge Street Substation in 18 months, the city is taking a closer look at substation transformers.\n“All existing substation transformers will be inspected and ranked based on failure possibility,” Danville Utilities Director Jason Grey said. “Future transformer replacements will be based on this study.”\nHigh:\nDanville is considering the development of a bike share program. Councilman Lee Vogler suggested the idea after seeing a similar one during a visit to Chattanooga, Tennessee, in 2012.\n“It’s not that expensive, especially if it’s privately funded out of the gate,” Vogler said. “This is not going to be any kind of major expense in our budget at all.”\nThe start-up cost should be under $50,000, with annual maintenance costs of around $5,000.\nLow:\nSpray-paint wielding vandals continue to hit Danville churches and other public places; the latest included a swastika and the words “White Pride” on a wall as well as damage to a Danville church and another place in the city.\nHigh:\nAs General Assembly Republicans and Gov. Terry McAuliffe continue to fight over whether felons who have paid their debt to society can automatically get their rights restored, we should consider the words of Danville resident and ex-offender Richard Harris.\n“I’m almost a citizen,” Harris said.\nAfter McAuliffe restored the rights of more than 200,000 people this spring, some said that would tip the scales in November’s election to Democrat Hillary Clinton. But 200,000 ex-offenders didn’t take the chance McAuliffe gave them and register to vote — it was more like 13,000, including Harris.\nTo Richard Harris and all the other ex-offenders who are working toward becoming — once again — a citizen, we hope that their path to the voting booth won’t be blocked again.\nHigh:\nAnd finally this week, the work of a 13-year-old animal shelter volunteer has led to the creation of The Little Critter Bliss Fund to benefit rabbits, hamsters, birds, guinea pigs and other small animals.\n“They don’t really get adopted a lot and they need friends,” shelter junior volunteer Mia Trotter said.\nEditorials are the consensus view of the Danville Register & Bee’s editorial board: Publisher Steven W. Kaylor, Editor Robert D. Benson and Assistant Editor Charles Wilborn."}