{"uri": "http://abc7chicago.com/news/7-year-old-boy-fatally-shot-in-humboldt-park/829489/", "title": "Shot that killed 7-year-old boy in Humboldt Park meant for his dad, police say", "dct": "Sun, 05 Jul 2015 00:00:00 GMT", "id": "bf22e056fbc1dbaf1c99da1c2f0def19", "content": "CHICAGO (WLS) --\nA 7-year-old boy was shot and killed Saturday night while celebrating the Fourth of July with his family on the city's West Side, and Sunday evening Chicago Police Superintendent Garry McCarthy said that the bullet that killed Amari Brown was meant for his father.\nMcCarthy said Antonio Brown, who he referred to as a \"ranking gang member,\" was the intended target of the attack and that he is not cooperating with investigators.\nAmari was standing with an unrelated 26-year-old woman on the sidewalk in the 1100-block of North Harding Avenue in the Humboldt Park neighborhood just before midnight Saturday when shots rang out.\nHe was shot in the right side of the chest and taken by his father to Cook County Hospital, where he died. The woman was also shot in the chest and is hospitalized in stable condition.\nAmari's grieving mother, Amber Hailey, could not be comforted as her family made a plea for the person who gunned down her son to turn themselves in.\n\"You might as well turn yourself in because this 7-year-old, our family member, did nothing to you,\" Deirdre Holman said.\nThe child's family made their demand during a Sunday afternoon prayer vigil on the sidewalk of the Humboldt Park neighborhood where the boy was killed.\n\"This person was killed by someone who looks like us, who walks like us, who dresses like us, who lives among us,\" said Rev. Ira Acree.\nPastors with the Leaders Network pledged $1,000 for information leading to an arrest.\n\"None of us will be safe until all of these children are safe,\" said Rev. Marshall Hatch.\nThe soon-to-be second grader was one of several dozen weekend shooting victims in the city. By mid-afternoon Sunday, at least seven people had been killed in Chicago and 40 wounded in 33 separate shooting incidents since Friday.\nAmong those hit by bullets was 17-year-old Vonzell Banks, who was honored Sunday at the South Side church where he played the drums. Banks was shot and killed Friday at a park named for another slain teen, Hadiya Pendleton.\n\"In the last 48 hours, Chicago police officers have recovered about one illegal gun per hour across our city,\" McCarthy said.\nWhile displaying some of those guns, Supt. McCarthy said there was a move to increase manpower this weekend by putting officers on 12-hour shifts.\nHe said the bullet that killed 7-year-old Amari Brown was intended for Antonio Brown.\n\"His father is ranking gang member with 45 previous arrests,\" said McCarthy. \"I don't know how many pages (his arrest record) is, it's probably 22 pages long. (He was) arrested for a firearms in April, on the street the very next day. If Mr. Brown is in custody, his son is alive.\"\nMcCarthy said the case of Amari's father highlights the need for tougher punishment for alleged gun offenders."}