{"uri": "http://www.stltoday.com/news/local/crime-and-courts/gunfire-wounds-several-at-home-of-relatives-of-child-fatally/article_c36ac516-e348-58e6-9e6d-c1fde70f98c5.html", "title": "Gunfire wounds several at home of relatives of child fatally shot last year in Ferguson", "dct": "Fri, 29 Apr 2016 00:00:00 GMT", "id": "cde5500e4ae737b432e286d2b567879d", "content": "FERGUSON • Police say they are looking for suspects in an apparent drive-by shooting Friday that injured three children and a woman at the home of relatives of young shooting victim Jamyla Bolden.\nPolice said three people were wounded but LaToyia Olowookere, 36, said she was also one of those hit along with two 9-year-old girls and a 4-year-old boy. She said all of the wounds were from being grazed by bullets.\nPolice said the shooting happened outside a home in the 400 block of Dade Avenue that belongs to the family of Jamyla, who at 9 years old was shot and killed while doing homework last August.\nOlowookere, a family friend who lives nearby, said several people were gathered at the home because of the death of a great-aunt of Jamyla’s. She said she was among about 15 to 20 people in the yard when the gunfire began. Of those, about 10 were children.\n“That’s how I got my injury,” she said. “I got up and started grabbing kids and pulling them down.”\nShe was grazed in the upper chest but declined to be taken to a hospital for treatment.\nShe said a 9-year-old girl was grazed in the head, another 9-year-old girl in the wrist and a 4-year-old boy in the abdomen.\nShe said the children were cousins of Jamyla. Jamyla’s brother was among the children who were in the yard but he was not hit, Olowookere said. He had been home in August 2015 when Jamyla was killed and his mother was wounded by gunfire at another residence in Ferguson.\nThe shooting on Friday happened around 5 p.m., according to Ferguson’s acting police chief, Al Eickhoff.\nTwo vehicles were driving down Dade and at least one person inside fired multiple shots, Eickhoff said.\n“You have a senseless drive-by shooting,” Eickhoff said. “Senseless.”\nPolice say they do not know who the target was.\nMichele Atkins, 33, said she was waiting in a car for her boyfriend nearby when she heard several shots. She said there was a lot of screaming and crying when the shooting happened.\nOlowookere said she did not see where the gunfire came from, but she said a neighbor told her that someone had fired as a pickup and a sedan passed the home in opposite directions.\n“Everybody’s OK, by the grace of God,” she said afterward. “What do you tell these kids in a situation like this?”"}