{"uri": "http://www.wyff4.com/news/coroner-called-girl-shot-in-hunting-accident-with-stepfather/35868046", "title": "Teen shot by foster father while hunting on family property", "dct": "Sun, 18 Oct 2015 05:45:00 GMT", "id": "dcaa250e7b4b22bcae88f685369f7518", "content": "Pendleton High School student was in full camouflage gear\nANDERSON COUNTY, S.C. —\nThe Anderson County coroner on Friday identified the teenager who was shot to death by her foster father while hunting.\nCoroner Greg Shore said Amanda Daniele Foster, 17, died of a gunshot wound. He said the bullet entered her back and exited through her left chest.\nRobert McCollough with the state Department of Natural Resources said the foster father accidentally shot the girl with a high-powered rifle.\nFoster attended Pendleton High School and had been living with her foster parents for more than two years, according to Shore. Foster had a younger foster brother, who also lived at the home, Shore said.\nDeputies were dispatched to the woods behind Foster's home on Dalrymple Road and Harris Bridge Road just before 7 p.m., Shore said.\nFoster was transported to AnMed Health, where she was pronounced dead, Shore said.\nShore said he waited to release Foster's name until he had contacted her biological parents, who live in Anderson.\n\"She had just gotten home from school, and went out into the woods with her foster father about 5 p.m.,\" Shore said. He said she was wearing full camouflage gear when the shooting happened.\nAccording to Shore, the foster parents own 7.5 acres of wooded land behind the home. Foster and her foster father regularly hunted deer on the property, Shore said.\nShore said the Sheriff's Office has turned the investigation over to the Department of Natural Resources.\nPendleton High School Principal Brian Couch told WYFF News 4's Mandy Gaither that Foster wanted to go into nursing and was a member of the Health Occupations Students of America group.\n\"She went on a field trip with that student organization yesterday, and I didn't see her yesterday, but most days I'd see her and we'd speak in the hall. (This loss) has touched everybody,\" said Couch.\nCounselors met with grieving students at school on Friday, Couch said.\nSome students were planning to wear Foster's favorite color of purple to honor her at the football game, he said."}