{"uri": "http://www.mlive.com/news/grand-rapids/index.ssf/2013/10/a_punch_to_the_mouth_leads_to.html", "title": "A punch to the mouth leads to gunfire, alleged attempted murder at Kentwood graduation party", "dct": "Thu, 10 Oct 2013 15:32:00 GMT", "id": "39eaa27464057ac20d0d229708328e9f", "content": "KENTWOOD, MI – The perception that the suburbs are immune to gang and gun-related violence was tested again on Thursday as a parade of young people, many sporting jail garb, talked about the events at a Kentwood graduation party that ended in gunfire.\nBillie McKinney, 18, could face up to life in prison if he's convicted of attempted murder and felony use of a firearm. A judge determined there is enough evidence to bind the case over to Kent County Circuit Court.\nWitnesses testified Thursday, Oct. 10, in Kentwood District Court about what they saw during a July 14 graduation party on Farmview Court SE, north of 52nd Street SE, near Breton Road.\nFour people were injured by bullets and another person sustained a minor wound that may have been caused by a bullet, police said.\nRelated: 'It was unreal,' dad of Kentwood graduate says of five-person shooting in backyard\nWitnesses said the party was going fine until a group of young men associated with the Grand Rapids-based Bemis Boys street gang shoved their way into the party that was taking place around a pool in the residential neighborhood.\nDominique Hudson, 22, testified during a probable cause hearing that he was at the party when he saw McKinney reaching for his waistband, leading Hudson to believe a gun was about to be produced.\n“I punched him,” said Hudson. “In the mouth.”\nHudson is a member of the Eastern Avenue gang, which is a rival to the Bemis Boys, although Hudson is not sure why they are rivals.\nA few minutes after the punch, witnesses said they saw McKinney cock and then fire a gun. The number of shots range anywhere from four to eight depending on which of 10 witnesses was talking.\nBut Mark Armstrong knows at least two shots were fired because he was struck once in the stomach and once in the back and spent four days in the hospital afterward.\n“Someone said ‘You got him, bro, you did it,’” Armstrong told Judge William Kelly. “I thought I was done.”\nArmstrong said he did not see who shot him and he never met McKinney before the shooting.\nJaqte Shannon Beal, 39, was in the Kent County Jail on a charge of unarmed robbery, allegedly committed while he was on parole for a previous unarmed robbery charge.\nBeal contacted jail officials saying he had a conversation with McKinney, who told his fellow inmate that the teen got punched in the face and then shot a party.\n“(McKinney) said he blanked out and didn’t know who he was shooting at,” testified Beal, who went as far as to wear a wire when talking to the defendant.\nFor the witnesses’ cooperation, Chief Assistant Prosecutor Christopher Becker agreed to a plea deal that would limit Beal’s time behind bars to one year in the Kent County Jail on his most recent armed robbery charge.\nMcKinney’s teen girlfriend also testified that her boyfriend sent her a letter asking her to lie to prosecutors in order to present him with an alibi. After being charged with perjury, the girl turned a copy of the letter over to law enforcement.\nDefense attorney Todd Van Eck argued that no one could testify that his client actually had possession of a concealed weapon.\nBut Kelly decided that the evidence was sufficient to send the case on to Kent County Circuit Court.\nMcKinney remains in the Kent County Jail on a $500,000 bond.\nE-mail Barton Deiters: bdeiters@mlive.com and follow him on Twitter at twitter.com/GRPBarton or Facebook at"}