{"uri": "http://www.mlive.com/news/grand-rapids/index.ssf/2014/03/teen_found_guilty_of_attempted.html", "title": "Teen found guilty of attempted murder in Kentwood graduation party shooting", "dct": "Tue, 25 Mar 2014 20:46:00 GMT", "id": "997be80ee78b25f0b94080dd19de425f", "content": "GRAND RAPIDS, MI – An 18-year-old faces life in prison after he was found guilty of attempted murder stemming from a wild series of gunshots and panic that injured five people at a high school graduation party last July.\nDuring a trial that lasted a week and a half, the Kent County Circuit Court jury heard testimony mostly from teens, some of whom were less than happy to take the stand.\nBut enough of those witnesses pointed the finger at Billie McKinney to convince the jury to find him guilty as charged on Tuesday, March 25. McKinney was convicted of attempted murder, felonious assault and felony use of a firearm. He remains in the Kent County Jail pending his sentencing April 29 before Judge Paul Sullivan.\nThe teens were at the July 14 graduation party on Farmview Court SE, north of 52nd Street SE near Breton Road, when rival gangs squared off, testimony showed.\nRelated: A punch to the mouth leads to gunfire, alleged attempted murder at Kentwood graduation party\nAccording to witnesses, between 150 and 200 people were at the party when a group of 10 or 12 young men showed up around 11:30 p.m. The newcomers, who were not invited, were members of the Bemis Boys street gang based in Southeast Grand Rapids, according to Chief Assistant Kent County Prosecutor Christopher Becker.\nAlready at the party were members of a suburban gang out of Kentwood.\nBecker told the jury that when the rival gang members showed up, the groups began arguing and that escalated to Dominique Hudson punching McKinney in the mouth, knocking him to the ground and chipping his tooth.\nAfter he was helped back on his feet, McKinney began shooting into the crowd and several people were struck by bullets, Becker said.\nParty-goer Mark Armstrong, who was struck in the stomach and the back, spent four days in the hospital. Another victim was struck in the face and a few others received minor injuries while scattering in the panic of gunfire.\nSome of the witnesses testified they either saw McKinney with the gun, saw him shooting into the crowd or saw Armstrong get shot.\nE-mail Barton Deiters: bdeiters@mlive.com and follow him on Twitter at twitter.com/GRPBarton or Facebook at facebook.com/bartondeiters.5"}