{"uri": "http://www.detroitnews.com/story/news/local/detroit-city/2015/08/10/dead-wounded-overnight-detroit-shootings/31403023/", "title": "3 dead, 26 wounded in weekend Detroit shootings", "dct": "Mon, 10 Aug 2015 00:00:00 GMT", "id": "de107997bd62ba8e18a49f5ac0cf22dd", "content": "Detroit — Disputes between drug dealers are believed to be partially responsible for more than two dozen shootings in which three people were killed over the weekend, Detroit police said.\nFrom Friday through Sunday, gunfire wounded 26 people across the city, according to police.\n“Almost half of these cases, we believe, have a narcotics nexus,” Sgt. Cassandra Lewis said Monday afternoon.\nLewis said investigators don’t believe any of the shootings are related to each other, despite the involvement of drugs in some of them.\n“We don’t have anything that connects these cases,” she said. “But there were several shootings with multiple victims.”\nFrom Sunday evening into Monday morning, police reported two fatal shootings and 15 nonfatal shootings.\nOne of the fatal shootings occurred around 8:40 p.m. Sunday at West McNichols and Parkside on the city’s west side.\n“Witnesses reported that they heard shots and observed the suspect running in an alley,” Officer Nicole Kirkwood said. “The suspect is a black male, about 5-foot-8, with short hair, wearing a green shirt and blue jeans.”\nThe victim was transported to a local hospital where he was pronounced dead, Kirkwood said.\nAccording to WDIV-TV (Channel 4), the 51-year-old was shot after an argument inside a liquor store at West McNichols and Wildemere. The suspect forced the victim at gunpoint into the victim’s vehicle, police said. The victim began to drive but was shot about a block away while attempting to escape.\nThe suspect ran eastbound, according to the report. Police are investigating with help from eyewitnesses and surveillance video from inside the liquor store.\nAbout two hours later, a 25-year-old man was killed at 10:50 p.m. on the 15200 block of Hazelridge near Kelly on the city’s east side, Kirkwood said.\nThree other male victims, ages 24, 25, and 41, were wounded in the shooting.\nFurther details about the incident are unclear as police continue to investigate, Kirkwood said.\nPolice confirmed the two fatalities were a small fraction of the shootings that occurred late Sunday into early Monday morning.\nFour other overnight incidents left eight people wounded, police said.\nA 15-year-old girl was shot in a drive-by around 11:20 p.m. on the 15000 block of Manor, Officer Dan Donakowski said. She was standing outside when an unknown suspect opened fire from inside a dark-colored vehicle, possibly a Dodge Caravan.\nTen minutes later, two women were shot at 11:30 p.m. on the 300 block of Rosedale, Donakowski said. The women, ages 26 and 25, heard the gunshots and felt pain while standing on a porch.\nTwo men, ages 28 and 25, were shot around 12:30 a.m. on Yacama near Remington, Donakowski said.\n“Unknown suspects pulled up in a dark-blue minivan, and the sliding door on the passenger side opened up,” he said. “Someone inside started firing shots.”\nThe 28-year-old victim was in temporary-serious condition and the 25-year-old victim was stable Monday.\nAbout a half-hour later, three people were shot at 1:05 a.m. on the 2000 block of Cadillac, Donakowski said. The 19-year-old man, 38-year-old woman and 21-year-old woman were standing outside when they were wounded.\nTwo vehicles may have been involved in the Cadillac shooting, including a Chevy Trailblazer. The three victims were in temporary-serious condition.\nDetails about at least four additional people shot overnight were not immediately available.\nHFournier@detroitnews.com\n(313) 223-4616\n@HollyPFournier"}