{"uri": "http://fox40.com/2016/11/24/sacramento-county-deputies-investigate-officer-involved-shooting-in-carmichael/", "title": "Sacramento County Deputies Investigate Deadly Officer-Involved Shooting in Carmichael", "dct": "Thu, 24 Nov 2016 15:43:00 GMT", "id": "ddf3eea1bf04b3fef2a73128ad45246f", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nCARMICHAEL -- An angry rant, partially about the state of the country, phoned into 911 evolved into a gory scene inside a Carmichael 7-Eleven Thursday.\n\"The suspect popped out from around an aisle, had a knife in his hand and began stabbing himself in the throat. Officers saw that clearly a main artery had been struck during this time,\" said Sgt. Tony Turnbull with Sacramento County Sheriff's Department.\nDeputies say after that they tried to disarm the young man in his late teens with rubber bullets while he was still armed with that knife.\nBut according to them, his erratic behavior intensified causing them to fear for their own safety.\nThat's when they switched from less-than-lethal force to actual bullets to protect themselves.\nIt's still unclear if he succumbed to the knife wounds or the gunshots.\n\"He may have killed himself. We still don't know that at this point in time. Once the scene was made safe officers began to render aid,\" said Turnbull.\nBut again, to no avail.\nManuel Bustamante knows the clerks at the 7-Eleven.\nHe and his wife go to that convenience store every day and he was trying to reach her by phone when he saw all of the flashing lights.\n\"I'm kind of tripping out, where she's at,\" he said, relaxing a little when FOX40 informed him the suspect was the only one injured in the incident.\nInvestigators also say it appears all customers had just left the building as the young man in question walked in.\n\"We don't know his mental impairment. We don't know if he's got a history of mental illness or if he was just angry today,\" Turnbull explained.\nWhat they do know is that the true nature of the suspect's mental state or any possible drug activity will be among the factors closely examined as investigators try to determine why a young man went shopping for a confrontation in the aisles of a 7-Eleven.\nThe sheriff's department, the district attorney's office and the office of the inspector general will all conduct a probe into what happened Thursday.\nThe-27-year-veteran of the force who fired at the suspect has been placed on administrative leave pending those investigations."}