{"uri": "http://www.heraldextra.com/news/local/crime-and-courts/orem-police-man-shot-self-and-woman-in-leg-before/article_10bd20c3-8a59-5203-8e63-6ee6c23be43c.html", "title": "Orem police: Man shot self and woman in leg before stealing car", "dct": "Tue, 15 Nov 2016 00:00:00 GMT", "id": "ef65e41aaf5272efe94c425b8bbc1094", "content": "A Santaquin man was arrested Monday afternoon on reports of shooting himself and a woman before stealing a car.\nA man called the Orem Police Department after picking up Jarrat Broadbent from a gas station near the hospital to give him a ride to Nephi, reports state.\nAfter a short while, Broadbent, 22, shot himself and a female passenger in the legs, reports state.\nThe driver pulled over, but Broadbent told him to keep driving or he would kill him, according to police. Broadbent told all three passengers to stay in the vehicle, or he would kill them, reports state.\nThey drove to the hospital to treat the woman, where Broadbent ordered them out of the vehicle, and then took the vehicle.\nBroadbent reportedly ditched the car not far from the hospital, hid the gun in some bushes, and called a friend to pick him up because he had been shot.\nBroadbent was also transported to Timpanogos Regional Hospital to receive medical care for his gunshot wound.\nThe driver of the vehicle told police about the entire event and Broadbent was booked into Utah County Jail once he was released from the hospital.\nBroadbent was booked into Utah County Jail on suspicion of the following charges: one first-degree felony of aggravated kidnapping, two first-degree felonies of aggravated robbery, one first-degree felony of felony discharge of a firearm, one second-degree felony of possession of a firearm by a restricted person, one third-degree felony of aggravated assault and one class A misdemeanor of obstruction of justice.\nIt was originally reported that the female who was shot in the leg had to have her right leg surgically removed. However, authorities with the hospital have stated she was treated and released the same day.\nKurt Hanson is the Breaking News and Courts reporter for the Daily Herald. He can be reached via email at khanson@heraldextra.com. Follow him on Twitter: @hansonherald."}