{"uri": "http://www.democratandchronicle.com/story/news/2015/10/03/killer-ak-47-traced-burglary-genesee-homicides/73223548/", "title": "Killer AK-47 traced to burglary", "dct": "Sat, 03 Oct 2015 00:00:00 GMT", "id": "cf065ea071e3c845cdad67255ab911f9", "content": "The AK-47 used in the triple homicide in August on Genesee Street was likely stolen from a Lake Avenue apartment during a July burglary, according to law enforcement sources and court papers.\nPolice are investigating allegations that the gun was stolen by Ramel Robinson, who then passed the gun on to Johnny Blackshell Jr. Robinson is now accused in federal court of stealing guns in a separate Clay Avenue burglary.\nBlackshell is accused of fatally shooting three people as they left the Boys & Girls Club at 500 Genesee St. on the night of Aug. 19.\nMore coverage: Triple homicide on Genesee Street\nKilled were Raekwon Manigault, 19, Jonah Barley, 17, and Johnny Johnson, 25.\nThe investigation into the Genesee Street killings, a drive-by shooting, has mushroomed into a large and active investigation by local and federal authorities. That investigation has focused on two separate thefts of firearms and multiple individuals connected to Blackshell.\nPolice have said that Blackshell was not the driver in the shooting, so others are clearly suspected of involvement in the homicides.\n“It's very active and we're confident that we will ultimately be able to charge all those involved and hold them accountable,” said Monroe County District Attorney Sandra Doorley.\nThe thefts of the firearms are detailed in federal charges against Robinson and Joseph Lowry, who is accused of crimes in state and federal court.\nCourt papers maintain that, after Lowry’s arrest, police showed him a photograph of an AK-47 that had been “recovered by law enforcement.” Lowry identified the semi-automatic weapon as one that Robinson once had. Robinson allegedly told Lowry he’d stolen the gun from a Lake Avenue apartment.\n“Lowry stated that he was aware that Robinson ultimately gave the assault rifle to Johnny Blackshell,” Patrick Hoffman, a special agent with the Bureau of Alcohol, Tobacco, Firearms and Explosives, or ATF, said in court papers.\nCourt papers do not identify the rifle as the one used in the Genesee Street mass killing. However, three sources familiar with the investigation said the gun is the one that police recovered and linked to the homicides through ballistics.\nCourt papers detail this timeline:\nOn July 29 an apartment at 1070 Lake Avenue was burglarized. The safe held three guns — an AK-47, a .40-caliber carbine rifle, and a 12-gauge shotgun, according to an affidavit from ATF Special Agent Hoffman.\nThree days later, police responded to a report of “family trouble” at a Phelps Avenue home. There, they found a loaded shotgun on the front porch allegedly belonging to Lowry, who lived at the home. Lowry was arrested for endangering a child — a 2-year-old was in the home — and he was later released from custody.\nOn Aug. 21, only two days after the Genesee Street homicides, authorities allege that Lowry, Blackshell, and Blackshell’s sister, Shalesha Blackshell, struck a city man in the head with a bottle and robbed him of about $100 worth of property.\nThen, on Aug. 24, Lowry was with Blackshell when they and others allegedly were involved in the theft of nearly $2,600 worth of clothes from Eastview Mall. Blackshell, already a suspect in the homicides, was then under surveillance by police who stopped him after the robbery and arrested him on multiple charges.\nA parolee, Blackshell was charged with illegal possession of a handgun found in his car, which was the getaway vehicle at the mall robbery. (It wasn’t until mid-September when Blackshell was charged with first-degree murder for the Aug. 19 killings.) On Aug. 24, Lowry was also arrested for the Eastview Mall robberies. By that time, police had matched the serial number on the shotgun found on his porch with the one stolen on July 29.\nIn an interview with police, Lowry allegedly said he got the shotgun from Robinson. Robinson allegedly admitted to Lowry that he stole that and two other firearms from Lake Avenue. One was the AK-47 that allegedly ended up in Blackshell's hands.\nOn Sept. 9 burglars stole a safe of firearms from a Clay Avenue home. Inside the safe were an AK-47, two AR-15 rifles, a 12-gauge shotgun, another semi-automatic rifle and 200 rounds of ammunition. Rochester police and the ATF developed information that Robinson was involved in the burglary, and arrested him, as he was driving a stolen Ford Expedition, on Sept. 14. Robinson allegedly admitted that he and others committed the Clay Avenue burglary and stashed some of the firearms at another Clay Avenue home.\nOn Sept. 24 authorities hit Lowry with new charges. He was charged in state court with the Aug. 21 robbery and in federal court with possession of a stolen firearm, the shotgun found on his porch.\nRobinson is not now criminally accused of possession of the AK-47 connected to the Genesee Street killings. The one public connection between him and the gun are the statements allegedly made by Lowry to police that link Robinson and the gun. Robinson's attorney, Donald Thompson, declined to comment, as did Lowry's attorney, Avik Ganguly.\nAssistant District Attorney Perry Duckles, a prosecutor involved in the investigation into the Genesee Street killings, also declined comment, as did Barbara Burns, a spokeswoman for the U.S. Attorney's Office.\nBlackshell has been indicted for the Genesee Street homicides, but the indictment has yet to be publicly handed up by the grand jury. He is, for now, the only person charged in the mass killings.\nGCRAIG@Gannett.com"}