{"uri": "http://www.democratandchronicle.com/story/news/2015/09/15/parolee-suspect-mass-shooting-boys-girls-club/72304134/", "title": "Genesee St. shooting suspect charged with murder", "dct": "Tue, 15 Sep 2015 00:00:00 GMT", "id": "ef39d51928ace25b5c672ef036185936", "content": "Video by Max Schulte\nWithin days of the triple homicide on Genesee Street, police had the name of Johnny Blackshell Jr., a parolee, as a suspect.\nHowever, they did not have adequate evidence linking him to the Aug. 19 killings, or any other crimes. Then, police allege, Blackshell did them a favor.\nWhile under surveillance by the Rochester police on Aug. 24, Blackshell allegedly drove the getaway car in the theft of nearly $2,600 worth of clothes from Eastview Mall. Within 15 minutes, police had pulled over the car in the city and found the stolen clothes — Ralph Lauren shirts, jackets and jeans, and a variety of other shirts and boxer shorts — inside the Saturn.\nA search of the car also yielded a .25-caliber semiautomatic pistol, loaded with seven rounds, according to court records. Blackshell, on parole for an attempted burglary conviction, could not own a firearm. He allegedly admitted to police the gun was his.\nMore: Coverage of the Genesee St. triple homicide\nOn Aug. 24 police charged Blackshell with illegal weapons possession and possession of stolen property. On Tuesday, he was also charged with a single count of murder in the killings outside the Boys & Girls Club at 500 Genesee St.\nBlackshell, a 21-year-old Chili resident, faces a sentence of life without parole for the charge. Other criminal charges will be presented to a grand jury, said District Attorney Sandra Doorley.\nKilled in the shooting at the Boys & Girls Club were Raekwon Manigault, 19, Jonah Barley, 17, and Johnny Johnson, 25. Police announced Tuesday the names of the four other Rochester residents who were shot and injured: Billy Williams, 26, Carey Bradley, 19, Anthony Jones, 24, and Carl Canty, 29.\nThey were among a crowd spilling out of the Boys & Girls Club after the championship basketball game for a summer league.\nThe apparent randomness of the killings and the location — outside an organization that has worked to provide opportunity for local youths — shocked the community. U.S. Attorney William Hochul Jr. said the crime was “one of the most heinous we’ve seen in some time here in Rochester.”\nFederal authorities have also charged Blackshell with the Aug. 4 robbery of a 7-Eleven at 3345 Lake Ave.\nDoorley and Police Chief Michael Ciminelli said the police have recovered an AK-47 semiautomatic rifle used in the Genesee Street killings and the car — a black Suzuki Verona — allegedly driven by those who fired into the crowd. Ciminelli said police suspect a second firearm was fired from the car.\nCiminelli said the investigation into the homicides is continuing. He said police do not think Blackshell was driving the car used in the shootings.\nShell casings were found in the car that match the AK-47, which has been linked through ballistics to the homicides, Doorley said. Blackshell admitted the homicides to others, Doorley alleged.\nHochul said Blackshell was part of a gang called the Maroon Goons. Ciminelli declined to discuss the gang.\nRochester Mayor Lovely Warren said community help was vital to the investigation.\n“It’s been the community stepping forward and saying, ‘Enough is enough,’ ‘’ she said.\nAt a Public Safety Building news conference announcing the arrest Tuesday, dozens of law enforcement personnel lined a back wall. Federal, state and local authorities collaborated on the investigation.\n“These folks have worked around the clock in partnership with the community to solve this violent crime,” Warren said.\nThis year has been exceptionally violent, with a significant increase in shootings. Other large and midsized cities have also seen upticks in violent crimes, after years of decline.\n“I don’t know what the cause of this may be but certainly it’s a national trend,” said Warren, who revealed several proposals as part of an anti-violence initiative.\nGCRAIG@Gannett.com"}