{"uri": "https://www.washingtonpost.com/news/morning-mix/wp/2016/02/23/we-can-tell-his-heart-is-broken-ind-6-year-old-picks-up-dads-gun-and-accidentally-kills-him/", "title": "‘We can tell his heart is broken': Ind. 6-year-old picks up dad’s gun and accidentally kills him", "dct": "Tue, 23 Feb 2016 00:00:00 GMT", "id": "0edf5d8bd98de3d2399b3d6ef720f878", "content": "It happened the way these things so often do: in the instant when no one was looking.\nJames E. Lonaker sat at his computer, his back to his 6-year-old son. His wife was also turned away as she put their baby down.\nNeither of them noticed the little boy approach the table where Lonaker had left his .38 revolver. No one watched as he picked it up, the weapon clumsy and cold in his tiny hands. And no one saw him pull the trigger, sending a bullet flying toward his father.\nWhen deputies arrived at the Lonaker home in Hartsville, Ind., on Sunday night, Bartholomew County Sheriff Matt Myers said, they found the 62-year-old father dying of a gunshot wound to his upper body and the boy disconsolate at what he’d inadvertently done.\n“We can tell his heart is broken,” Juli Lonaker, James Lonaker’s adult daughter from a previous marriage, told the Johnson County, Ind., Daily Journal.\nLonaker, who was not named in the sheriff’s statement but has been identified by family members, died en route to Methodist Hospital in Indianapolis.\nChild Protective Services has been notified about the incident, which is still under investigation, Myers said.\n“Please keep your guns in a secure location out of reach of children,” his statement implored. “This was a tragic accident. Please make certain that firearms in your homes are not accessible to anyone — especially children. Many firearms accidents in the home can be prevented simply by making sure that firearms are kept unloaded and safely stored, with ammunition secured in a separate location. Please keep your guns in a secure location out of reach of children.\n“This is a tragedy that is told and retold all across the country and a tragedy that can be avoided.”\nLonaker’s death is at least the 18th accidental shooting by an American child under age 10 this year, according to a Washington Post survey of news reports. Six of those incidents were fatal, and in every other one, the victim was also a child. In three cases, the person killed was the child who accidentally pulled the trigger.\nLast year, at least 265 people were shot by kids under age 18, according to data compiled by the gun-control advocacy group Everytown for Gun Safety.\nEach shooting is simultaneously deeply shocking and heartbreaking its banality. There is the 5-year-old from Missouri who shot herself in the leg with a gun she found underneath her grandmother’s couch; the woman had stashed it there to hide it from her grandchildren when they arrived at her house. There’s the 3-year-old boy who accidentally killed himself with a pistol that his parents didn’t even know was in their home, and the 8-year-old who was trying to unload the semiautomatic pistol his siblings had found in their mother’s purse, when the gun discharged, fatally shooting his 7-year-old brother in the head.\nAnd then there’s Lonaker’s 6-year-old son.\nThe little boy was in the bedroom with both of his parents, Juli Lonaker told the Daily Journal, when he picked up the revolver. Lonaker was changing his clothes, and he had put the gun down on top of a table and mini fridge. Then he turned to do something on his computer.\nHis wife, Jenny Rose Lonaker, heard the “pop” of the weapon firing, but she didn’t register it as a gunshot, the Daily Journal reported. She looked up to see her husband bleeding from a bullet wound to his chest.\nThe 6-year-old told investigators that he didn’t mean to hurt his father and that he didn’t think the gun was loaded when he fired it, Myers said.\nNow, the Lonaker family is left to figure out how to comfort a little boy who lost his father at his own hand.\n“We don’t want this incident to define him or his future,” Juli Lonaker told the Daily Journal.\n“Some of the headlines used the word ‘killed'; my little brother is not a killer,” she said in an interview with local TV station WISH. “My little brother is a little boy who likes to play and have fun, and he is a good, good little boy.”\nIt’s not clear how much the 6-year-old can be protected from what happened. For now, when he talks about his father, he tells relatives that “his daddy is in heaven,” she said.\nSpeaking to WISH, Lonaker’s other adult child, James, explained that he and his sister have agreed to interviews for their young half-brother’s well-being. People need to understand what happened, he said.\nThe 6-year-old “should not have been in a situation where he could’ve got his hands” on a gun, he said.\nThe two adult Lonaker children told WISH that their father had a concealed-carry permit for the revolver.\nSpeaking to WRTV, James — who also goes by Corky — said that his father ran a boxing gym in nearby Hope, Ind. He was known for his generosity and for welcoming in anyone who wanted to work out.\n“Whether they had any money to pay for the uniforms, my dad provided shoes, clothes, anything. Roofs over their head. He just could not stand for kids to go without,” he said.\nJames E. Lonaker had grown up poor in Austin, Ind., his son told the Daily Journal. He was one of seven children living in a one-bedroom house, and he was accustomed scarcity.\nThat made him generous, and adventurous, friends and family said. Tony Ault, who once trained with Lonaker, recalled traveling across the country and the world with him for boxing matches.\n“He was a really good boxing coach,” Ault told the Daily Journal. “He was just a really good friend. He was always willing to help in the community.”\nLonaker raised his older children in Hope, Ind., about an hour south of Indianapolis, and moved to nearby Hartsville when he remarried. He had plans to build a resort in the Philippines, James Lonaker Jr. told the Daily Journal — a characteristically ambitious scheme.\n“No one lived as well, or as hard or as fast as my dad,” his son said. “He lived life as though he was very rich, even though he wasn’t.”"}