{"uri": "http://www.rrstar.com/article/20150114/NEWS/150119737/10448/NEWS", "title": "More of the same, but sunshine by midweek", "dct": "Sun, 29 Jan 2017 06:16:20 GMT", "id": "28d656fcfd5afd31196d931d8979b844", "content": "Today will look a lot like Saturday, with highs in the upper 20s, a gusty northwest wind and clouds. A few light snow showers may leave behind a couple tenths of an inch of accumulation tomorrow - half-inch at most. Be aware of slick spots and reduced visibility on the roads. Tonight, we'll have fewer clouds, and with that, colder temperatures. Lows dip into the middle teens. We'll see temps in the 30s and a little sunshine by midweek.\nRead more\nLOS ANGELES - Barbara Hale, a movie actress who found her most famous role on television as steadfast secretary Della Street in the long-running \"Perry Mason\" series, has died. She was 94. Hale, who grew up in Rockford, was surrounded by family when she died Thursday at her Los Angeles area home, said Jaqueline Stander, an agent for Hale's son, actor William Katt (\"The Greatest American Hero,\" ''Carrie\"). \"She was gracious and kind and silly and always fun to be with,\" Katt posted on his Facebook page Thursday, calling Hale a wonderful actress and a \"treasure as a friend and mother...\nRead more\nHononegah students, Rockford residents melt hearts at snow sculpting awards ceremony\nROCKFORD - Temperatures approaching 60 degrees in January make things easier for almost everyone. Except snow sculptors. Unseasonably warm weather pushed back the 31st Annual Illinois Snow Sculpting Competition at Sinnissippi Park last week. Man-made snow compensated for the lack of natural snow that's fallen this month. But after all the weather and scheduling issues, 10 state teams and 15 high school teams took 6- and 10-foot tall, 2-ton blocks and turned them into complex artwork. \"If we can pull it off this year, there's nothing that can stop us in the years ahead,\" WIFR meteorologist Mark Henderson said as he emceed the event...\nRead more\nPresident's executive order on refugees to affect those in pipeline to Rockford\nROCKFORD - An executive order from the nation's highest political office has sent shock waves through immigrant and refugee communities across the nation, including in the Rockford region, which is home to a number of refugee families. The executive order, which President Donald Trump signed Friday, requires the U.S. secretary of state to suspend the U.S. Refugee Admissions Program for 120 days for a review of the application and adjudication process. It bans people from Iraq, Iran, Libya, Somalia, Sudan, Syria and Yemen - all countries with a Muslim majority - from entering this country...\nRead more\nChuck Sweeny: Donald Trump inauguration ... alternative facts or alternative opinions?\nThe kerfuffle over the size of the crowd at President Donald Trump's inauguration isn't really about facts and alternative facts. There's no official crowd count.\nRead more\nByron girl, father want to raise $10K by Tuesday night for domestic violence shelters\nROCKFORD - Victoria Kuzlik has three days to raise $10,000 to benefit domestic violence shelters in the Rock River Valley. The Byron girl, who turns 13 Sunday, and her father were victims of domestic violence before the family moved to Byron. This is the second winter that she and her father are raising money and collecting coats and other winter garments to donate to domestic violence shelters. They are about halfway to their $20,000 fundraising goal, her father said. The deadline is Tuesday night...\nRead more"}