{"uri": "http://www.kgns.tv/content/news/bodies-found-399526631.html", "title": "UPDATE: Man Arrested in Connection to Bodies Found on Arco Iris Road", "dct": "Thu, 03 Nov 2016 00:00:00 GMT", "id": "ef14c87f4eb3a6ba5583acab15da7a27", "content": "LAREDO, TEXAS (KGNS) - A 19-year-old man has been charged with double homicide in the case of the two bodies found on Arco Iris Road last Monday.\nPolice have arrested Edwin Cortez Mercado.\nPolice released the identity of the victims on Tuesday - Alexus Nicole Zepeda, 17, and Andrew Michael Moreno, 18.\nPolice say they were able to identify Cortez's car through surveillance footage - a red Ford Expedition.\nCortez was traced back to the 6000 block of Presa, where police found three weapons - and Cortez cleaning his vehicle.\n\"He was actually in the process of actually washing out the inside of the car, with all the doors open - and actually with a water hose, trying to clean up what we believe is the location of the crime scene,\" says LPD Investigator Joe Baeza.\nTwo other people that were with Cortez were also taken in for questioning, but have not been charged.\nOnce in custody, LPD says Cortez admitted he was involved in the homicide. The case is still under investigation.\nBelow is the previous text from this story:\nLaredo Police have arrested a young man in connection to this case.\nPolice have arrested Edwin Cortez Mercado, 19. He is facing two counts of murder.\nPolice have also released the identity of the victims. They are Alexus Nicole Zepeda, 17, and Andrew Michael Moreno, 18.\nTheir bodies were found last Monday night, near Highway 359.\nThe couple were shot, but an official cause of death still needs to be determined by the Medical Examiner.\nThis is Laredo's 11th and 12th homicide of 2016.\nBelow is the previous text from this story:\nAn investigation has been launched following the two bodies that were discovered on Halloween night.\nPolice have labeled this incident the city's 11th and 12th homicide of the year.\nAuthorities have confirmed that the bodies found were of two Laredo teenagers.\nThe young man was 18-years-old meanwhile the young woman was 17-years-old.\nThe bodies were reportedly found near Highway 359 after people near the area called police around eight o clock.\nThe identities of the victims has yet to be released until after their family is notified.\nPolice say the teens were a couple but it has not been determined if they were married or not.\nOfficials say the teens were shot but the number of times and the location of the wounds are not being disclosed.\nSince the discovery of the bodies, investigators have been at the scene and have been making progress."}