{"uri": "http://kfor.com/2013/07/14/one-dead-three-injured-in-northeast-okc-shooting/", "title": "One dead, three injured in northeast OKC shooting", "dct": "Sun, 14 Jul 2013 20:52:00 GMT", "id": "e36253add0b6857b884743da650a5fe5", "content": "OKLAHOMA CITY – One person is dead and three others injured after a shooting outside a metro hotel.\nIt happened around 11:30 p.m. Saturday outside the Lincoln Inn Express Hotel & Suites at 5405 N. Lincoln Blvd.\nThe Oak Room is a building next to the hotel that they rent out for parties, events and banquets.\nOne witness says it was a group of bikers that was having a party Saturday night when the violence broke out.\n“It was pretty packed. The whole thing was just packed with cars and bikes. And I guess three people came in from another outlaw gang or something and just started shooting,” said Waqar Nasir.\nNasir works at the Lincoln Mart convenience store next to the hotel.\nHe says he heard four or five gunshots.\n“And then everybody just starts running to the gas station and that’s what we saw. We heard gunshots and then we looked out the window and we just see people running in front of the window and we just locked the door. You know everyone was trying to come inside,” said Nasir.\nNasir says people who were at the party told him the ones that came up shooting were not invited guests.\n“They didn’t expect it. You could tell the people that were hurt didn’t expect it,” said Nasir.\nNasir says The Oak Room is rented out most weekend nights, but that he’s never witnessed anything like this before.\nHe says the parking lot entrances were blocked and they were charging $10 to get into the party, so he’s not sure how the shooters made their way inside.\nAuthorities identified the victims Monday morning.\nOfficials say 42-year-old Kevin Miller, of Antlers, died after being taken to a local hospital.\nThree others were injured including 22-year-old Aaron Wayne Brown, 41-year-old Joe Brown and 33-year-old Michael Hogue.\nInvestigators say the gunfire was exchanged between many of the victims and no arrests have been made in the case.\nAt this time, they say they are not looking for any other suspects."}