{"uri": "http://www.local10.com/news/crime/mother-2-teens-killed-in-quadruple-shooting", "title": "Suspect identified in fatal shooting of mother, 2 teens", "dct": "Sun, 31 Jul 2016 07:01:00 GMT", "id": "5eeb895ec18b78a94e566d11aa55be85", "content": "MIAMI-DADE COUNTY, Fla. - Police have identified a suspect in a shooting that left a mother and her two children dead and another child wounded.\nMiami-Dade police said Antwon Fair is wanted in connection with the early Sunday morning shooting at a home near Southwest 203rd Terrace and Southwest 115th Avenue.\nFlorida woman sentenced to 40 years for killing boyfriend, living with body\nTakeeya \"KeKe\" Fulton, a 39-year-old mother of six, and her daughter, Nuckeria \"Keria\" Harris, 19, were shot inside the home after Fulton got into an argument with a man, relatives told Local 10 News.\n\"The arguing, the commotion every other weekend. It was bound to happen,\" a neighbor, Alex, said.\nFulton and Harris were pronounced dead at the scene.\nHarris was shot and killed while trying to defend her mother, sources said.\nCorey \"CJ\" Johnson, 17, was sleeping in his bedroom when he was shot. He later died at Kendall Regional Medical Center.\nFulton's 12-year-old son was also shot and taken to Kendall Regional Medical Center. He is listed in stable condition.\nA shelter hearing was held Monday afternoon and a relative was granted custody of the boy and Fulton's other children. Family members also asked the judge to make sure that the children have police protection from Fair.\nMeanwhile, neighbors are watching over the family's dog that was found wandering in the street after the shooting.\nA GoFundMe account was created to help the family.\nPolice said Fair is considered armed and dangerous.\nCourt records show that he has been on probation for more than year for a weapons charge. He's previously been arrested on charges of assault, battery and drug possession.\nFair is the father of three of Fulton's children.\n\"(He's) not a human being,\" Alex said. \"That was the devil out to harm. That lady was a good woman. She was a good woman.\"\nPolice said Fair's white 2009 Chevrolet Impala was found near Northwest Eighth Avenue and Northwest 80th Street, but Fair remains at large.\nAnyone with information as to his whereabouts is asked to call Miami-Dade Crime Stoppers at 305-471-TIPS.\nCopyright 2016 by WPLG Local10.com - All rights reserved."}