{"uri": "http://kfor.com/2016/10/24/authorities-identify-two-victims-killed-during-shooting-spree-that-left-two-oklahoma-officers-injured/", "title": "Authorities identify two victims killed during shooting spree that left two Oklahoma officers injured", "dct": "Mon, 24 Oct 2016 10:57:00 GMT", "id": "8324858257c3588667c8e28cb4dd503b", "content": "LUTHER, Okla. – Authorities have identified the two victims killed during a shooting spree that left two Oklahoma officers injured.\nAround 6:30 p.m. Sunday, officers were called to reports of shots fired in the Wellston area in Lincoln County.\nOfficials say, when authorities arrived to the scene, Michael Vance opened fire with an AK-47, injuring two Wellston police officers.\nFortunately, the officers’ injuries are non-life-threatening.\nThe officers have been identified as Officer Shawn Stewart and Officer Jim Hampton.\nVance allegedly stole a Wellston police vehicle left the scene.\nAfter ditching the stolen police vehicle, Vance allegedly shot a woman after carjacking another man.\nShe also sustained non-life-threatening injuries.\nThat stolen car was reportedly found at Triple X Rd. and Covell, where two people were found dead Sunday night.\nAround 10:45 a.m. Monday, authorities identified the victims who were killed as 55-year-old Ronald Wilkson and 54-year-old Kay Wilkson.\nVance is the Wilksons’ nephew, officials say.\nAccording to court documents, Ronald Wilkson was shot with an AK-47.\nHe also reportedly had a large cut on his neck that officials say is consistent with an attempt to sever his head.\nKay Wilkson suffered similar injuries, authorities say.\nShe also had a large cut on her shoulder area.\nPolice believe Vance attempted to remove her arm.\nVance then allegedly stole the Wilksons’ silver 2007 Mitsubishi Eclipse with an Oklahoma license plate, 943-LQQ.\nAround 2:30 a.m., a man was reportedly shot at a gas station in Sayre, Oklahoma.\nThe shooting suspect matches Vance’s description.\nPolice say the suspect attempted to carjack another victim, but was unsuccessful.\nThe 54-year-old man injured in the shooting was transported to a local hospital where he underwent surgery.\nHe is currently in good condition.\nAuthorities are still searching for Vance.\nThey believe he may have returned to Oklahoma County or Lincoln County.\nThere is now an arrest warrant out of Oklahoma County for Vance.\nHe is wanted on two counts of first degree murder, unauthorized use of a motor vehicle and being in possession of firearm with prior felony conviction.\nAccording to a wanted poster released by OHP, Vance has a medical condition and may try to spread disease.\nIf you know of his whereabouts, call police immediately.\nDo not approach the suspect.\nHe is considered armed and dangerous.\nPolice say Vance has been shot at least twice.\nHe was recently released from jail after being arrested for sexually assaulting a child."}