{"uri": "http://www.stltoday.com/news/local/crime-and-courts/grandma-of--year-old-boy-who-shot-himself-in/article_f165b64f-7117-59fd-b65e-bec63b9eed52.html", "title": "Grandma of 6-year-old boy who shot himself in Wildwood is charged", "dct": "Tue, 06 Jan 2015 00:00:00 GMT", "id": "247ab0b4eab2c16acc1a6861a2e6ea00", "content": "WILDWOOD • Police say Cheryle J. Spaeth went to take a shower while her three grandchildren played in her bedroom last August. Soon, she heard a gunshot.\nHer 6-year-old grandson had been shot in the leg after one of the children apparently got a handgun from atop a high dresser.\nThe boy's injury Aug. 22 wasn't life-threatening, police say. He was treated at a hospital and released.\nSpaeth was charged Friday with first-degree endangering the welfare of a child, a felony. Spaeth, 60, has not yet been arrested so no mugshot was available Tuesday. She could not be reached for comment. Bail is set at $25,000.\nThe shooting happened in the 18300 block of Rathbun Hills Road in Wildwood, in a home Spaeth shares with her adult son and grandchildren.\nThe gun had not been in a holster or locked up.\n\"The kids were playing,\" County Police Officer Shawn McGuire said. \"I'm guessing she thought (the gun) was high enough that they couldn't get to it.\"\nAccording to a county detective's probable cause statement, police say the boy shot himself. Yet officers say the children in the room were scared when police arrived and details were difficult to sort out.\nThe children's father, who was in another room of the house at the time, heard the shot too and rushed into the room to find his bleeding son. The father owns several guns, but it wasn't immediately clear who owned the gun on the dresser in the grandmother's room.\nEndangering the welfare of a child in the first degree is punishable in Missouri by up to seven years in prison and a $5,000 fine. The crime is defined, in part, as \"knowingly (acting) in a manner that creates a substantial risk to the life, body, or health of a child less than seventeen years of age.\"\nPolice say the four-month-old case ended up at the prosecutor's office only in the last few days because the Ferguson unrest and police detail following the Aug. 9 killing of Michael Brown had taken so much of the police department's time."}