{"uri": "http://www.wowt.com/content/news/Police-Young-man-playing-with-gun-accidentally-shoots-self-dies--386682941.html", "title": "Police: Teen handling gun accidentally shoots self, dies", "dct": "Wed, 13 Jul 2016 23:24:00 GMT", "id": "aba8ed6a8b5f0dc14f31398ec002f61e", "content": "OMAHA, Neb. (WOWT) -- Police have identified the 18-year-old who accidentally killed himself Wednesday afternoon in North Omaha. They said Derrick Vaughn was handling a gun when it somehow went off.\nDerrick Vaughn was known as “Sonny” to friends and family. Vaughn’s cousin, Richante Hyde, said the teen just graduated from Northwest High School a few weeks ago.\n\"My little cousin was a very strong young man, independent, very loving,” said Hyde.\nThey say he started working right out of school and that he loved being with his family.\n\"We all support each other, we're all there for each other and we were his motivation, he was our motivation. He motivated me a lot of times,” Hyde told WOWT 6 News.\nFollowing the accident, Omaha police are stressing the importance of safety when handling guns.\n\"If you choose to have one in your home, have it in a safe, have it in a place where it's not easily accessed by people who shouldn't have access to it; that being children or people who come into your home,” said OPD Deputy Chief David Baker.\nHis family was clearly distraught as they arrived to the scene. Even as heavy rain poured down Wednesday afternoon, some of Sonny's family were too overcome with shock to even notice. Instead they embraced and reflected on what they’d miss most.\n\"His voice, his smile. I won’t be able to hear his voice, I won’t be able to talk to him. I can't get a phone call from him anymore saying 'what are you doing' or anything, ' how you been?'” said Hyde.\nPolice are calling it an accident. It’s an accident that has left behind a lasting impact on this family.\n\"This is something that can never be replaced, nothing can be patched up, nothing can be fixed,” Hyde said.\nOmaha police host two gun buy back days a year where they collect unwanted guns. They say unless you have a safe place for them, there's no reason to have unused guns around."}