{"uri": "http://www.mlive.com/news/kalamazoo/index.ssf/2016/09/two_teens_confirmed_dead_in_la.html", "title": "Two teens found dead in alley after Labor Day shooting; both were 17", "dct": "Tue, 06 Sep 2016 20:14:09 GMT", "id": "d0c5552beed4ca2d042c35877e4d6010", "content": "UPDATES: Police ID teens killed by gun shots\nKALAMAZOO, MI -- Police have confirmed the shooting deaths of two teen males Monday night in the 1500 block of Clinton Avenue in Kalamazoo's Edison Neighborhood.\nBoth young men were 17 and residents of Kalamazoo, according to police. Their identities were not disclosed late Monday night or early Tuesday morning.\nIn a press release, Kalamazoo Public Safety officers stated that they responded to a 9 p.m. report on Monday, Sept. 5 that a person that had been shot. In their release, they stated \"two subjects found shot.\"\n\"When officers arrived they found two males with gunshot wounds in the alley just north of the 1500 block of Clinton,\" officers reported. \"Both subjects were pronounced dead at the scene. The circumstances surrounding their deaths are still under investigation.\"\nOfficers swarmed the area of Clinton Avenue and March Street late Monday night but offered no information about what circumstances may have led to the shootings. Nor did they offer background information on the subjects.\nIn a press release issued by KDPS Lt. Lance Handlogten, officers stated that police were not involved in the shootings.\n\"There have been some reports stating that this was an officer involved shooting,\" officers stated. \"These reports are inaccurate. No officers were involved in this shooting other than to render aid and investigate the incident.\"\nSocial media chatter among some area teens who may know one or both of the subjects incorrectly indicated that the shootings may have been police-involved.\nOfficers ask anyone who may have in information regarding the investigation to contact them directly at 269-337-8994 or anonymously via the Silent Observer at 269-343-2100 or www.kalamazoosilentobserver.com."}