{"uri": "http://www.fox8live.com/story/30588162/10-women-7-men-wounded-in-9th-ward-playground-shooting-crimestoppers-reward-increased", "title": "10 women, 7 men wounded in 9th Ward playground shooting; Crimestoppers reward increased", "dct": "Mon, 23 Nov 2015 20:52:00 GMT", "id": "4bfbfab757caa59ca727a4cb55890b10", "content": "NEW ORLEANS (WVUE) -\nNew Orleans police said Monday that a 10-year-old boy is the youngest victim among the 17 shot at Bunny Friend Playground Sunday night in the Ninth Ward. Mayor Mitch Landrieu, NOPD Chief Michael Harrison, and city leaders addressed the media at a news conference.\nHarrison said the shooting appears to be gang-related and included two groups of people firing at each other. Police said the event, a music video shoot and block party, was not permitted.\nHundreds of people were gathered at the playground Sunday when the shooting broke out around 6:30 p.m. The victims were transported to four different hospitals, including Touro, Tulane Medical Center, University Medical Center, and St. Bernard Parish Hospital.\nOf the females injured:\nA 14-year-old was shot to the leg\nA 16-year-old sustained a graze would to the buttocks\nA 17-year-old was grazed in the leg\nA 19-year-old was shot in the heel\nA 21-year-old was shot three times in the lower back\nA 21-year-old was shot in the buttocks\nA 21-year-old was shot in the thighs\nA 22-year-old was shot to the thigh\nA 22-year-old was grazed in the thigh\nA 29-year-old was shot in the foot\nOf the males injured:\nA 10-year-old was shot in the thigh\nA 20-year-old was grazed in the foot and shot in the leg\nA 21-year-old was grazed in the hand\nA 22-year-old was grazed in the thigh\nA 22-year-old was shot in the groin\nA 29-year-old was shot in the arm\nA 37-year-old was grazed in the back of the head\n\"We are going to go after these gunmen with everything we have. These children did not deserve to be shot,\" said Chief Harrison.\nCrimestoppers spokesperson Darlene Cusanza says few tips have come in and urge the public to come forward with any information they may have. The Crimestoppers reward has been increased to $5000.\nCopyright 2015 WVUE. All rights reserved."}