{"uri": "http://www.nola.com/crime/index.ssf/2016/11/sixth_defendant_in_bunny_frien.html#incart_river_index", "title": "Sixth defendant in Bunny Friend Park shooting pleads guilty", "dct": "Thu, 17 Nov 2016 19:25:06 GMT", "id": "8003cb2dfc0795a775153b7c7a7efa70", "content": "(Courtesy of Orleans Parish Sheriff's Office)\nThe sixth of 10 defendants charged in connection with last November's mass shooting at New Orleans' Bunny Friend Park pleaded guilty Wednesday (Nov. 16) after reaching a plea agreement with state prosecutors.\nShawn \"Shooter\" Ruffin, 23, resolved three open cases with a plea agreement that saw him sentenced to two years in state prison (one suspended), followed by five years of active probation.\nOrleans Parish Criminal District Judge Robin Pittman credited Ruffin with time served and ordered one year of his sentence to be suspended. But the judge also designated one year executory, meaning he must complete 12 months behind bars to satisfy the Department of Corrections.\nRuffin was charged with felony discharge of a firearm during a violent crime in connection with the park shooting that left 17 people wounded Nov. 22, 2015. That charge was amended Wednesday to a lesser felony of criminally negligent discharge of a firearm.\nRuffin's agreement also required guilty pleas to aggravated assault with a firearm and illegal possession of stolen things in two unrelated open cases.\nThe deal brokered between defense attorney Miles Swanson and the Orleans Parish District Attorney's office was an improvement for Ruffin over one he rejected on Oct. 14. At that time, the DA's office offered to resolve his three cases with a plea agreement requiring a five-year prison sentence.\nFive defendants charged in the Bunny Friend case pleaded guilty in October. The remaining four are scheduled for trial in Pittman's courtroom Jan. 17.\nEight of the 10 men suspected of firing weapons during the mass shooting that wounded 17 people last November at Bunny Friend Park were offered the chance to plead guilty to lesser charges Friday (Oct. 14)."}