{"uri": "http://www.nola.com/crime/index.ssf/2016/01/new_orleans_grand_jury_indicts_2.html", "title": "New Orleans grand jury indicts 10 in Bunny Friend Park mass shooting case", "dct": "Wed, 27 Jan 2016 17:15:00 GMT", "id": "cf983f63c5a1d089deb5b34475fb1c2e", "content": "Ten men were charged in a 15-count indictment handed up Wednesday (Jan. 27) by an Orleans Parish special grand jury, in connection with last November's mass shooting that left 17 people injured at Bunny Friend Park.\nThough most of the suspects had been arrested and jailed on accusations of attempted murder, the indictment charges no one with that offense. Nine are charged with the lesser offense of negligent discharge of firearms, while others are charged with obstructing justice or obstructing the New Orleans police officers investigating the mass-casualty event that garnered national headlines.\nThe indictment charges Michael \"Mack\" Allen, Quendrick \"C-4\" Bailey, Wilfred \"Lil' Wilfred\" Celestine, Eddie \"Eazy\" Copelin, Malik \"Leaky\" Johnson, Allen \"Snoop\" Offray, Shawn \"Shooter\" Ruffin, Lawrence Veals and Rashad \"KMG Ezzy\" Walker with \"intentionally or criminally negligently\" discharging a firearm while committing a crime of violence.\nJohnson is charged with three counts of obstruction of justice, \"by removing evidence from the scene of a crime.\" He and Veals are charged with a second count of negligent firearm discharge, along with a single count for Dominic Savoy, who previously had not been accused of a crime linked to the shooting on Nov. 22, 2015.\nJohnson also is charged with obstructing NOPD officer James Winston and Sgt. Charles Love during their investigation of the shooting. Johnson's bond was set at $1.8 million.\nAnother count charges Johnson and Savoy with illegally possessing and/or concealing two handguns known to be stolen.\nWalker is charged with six counts of negligent firearm discharge, and with an additional count of illegal possession of a handgun by felon.\nThe indictment says Walker previously was convicted on a simple burglary charge. Walker received the highest bond amount of the group as directed by criminal courts Judge Arthur Hunter, at $3.5 million.\nAllen also is charged with illegal gun possession by a felon. The indictment cites his previous conviction for cocaine and marijuana possession as underpinning that charge.\nVeals' bond was set at $1.25 million. Allen and Savoy's followed at $1 million and $750,000, respectively. Bailey, Celestine, Copelin, Offray and Ruffin each had bonds set at $500,000."}