{"uri": "http://www.nola.com/crime/index.ssf/2015/12/bunny_friend_wheelchair_shooti.html", "title": "1 Bunny Friend Park shooting suspect fired gun from wheelchair, another was also shot: records", "dct": "Tue, 08 Dec 2015 03:40:38 GMT", "id": "d48e61a91f0634f271264193e716755f", "content": "A witness to last month's mass shooting at Bunny Friend Park, which littered the playground with up to 70 shell casings and left 17 wounded, told police one of the shooters fired a semi-automatic handgun from a wheelchair, court records show.\nThe records also show one of the suspected shooters was among the wounded.\nThe New Orleans Police Department have so far identified eight suspects in the Nov. 22 shooting at the Upper Ninth Ward playground. All are wanted on 17 counts of attempted first-degree murder, one for each victim shot. Among the five who have been arrested is 22-year-old Rashad \"KMG EZZY\" Walker.\nA witness to the shooting told police Walker was seen \"seated in a wheel chair\" inside the gated park \"and firing a semi-automatic handgun into the crowd,\" a warrant for his arrest says.\nWalker surrendered to police Dec. 5 after police publicly named him as a suspect.\nWarrants connected to the recent arrests of suspects provide other new information about the shooting. Records reveal one of the suspects was shot in the park and another was shot the next day, in a separate shooting in eastern New Orleans.\nSuspect also a victim\nGunfire broke out in the park following an argument involving another arrested suspect, Eddie \"Eazy\" Copelin, 20, Copelin's arrest warrant says. During that argument, a witness told police, several people were seen \"removing firearms\" and shooting into the crowd.\nCopelin is also one of the 17 victims shot in the park that night, his arrest warrant says.\nThe warrant says a witness told police \"Eddie from OBLOCK\" was one the shooters. NOPD Detective Chad Cockerham, who was one of the first responding officers, immediately recognized the reference, the warrant says.\nCockerham knew \"Eddie from OBLOCK\" as one of the victims. His name had also come up before from \"previous intelligence\" related to the investigation. Police learned \"Eddie from OBLOCK\" referred to Copelin, and the witness picked Copelin out of a photographic lineup.\nCopelin was arrested Dec. 5.\n\"Chaos and panic\"\nWarrants also paint a picture of what police officers encountered when they pulled up to the scene.\nBefore any word shots were fired, Cockerham was on his way to Bunny Friend Park \"to disperse an unauthorized party,\" records say. While on the way, near the intersection of North Galvez and Louisa Street, he heard \"a barrage of gunfire erupt.\"\nA warrant says Cockerham and several other 5th District officers immediately accelerated their cars to a rush to the scene after hearing gunshots.\nOnce police arrived, \"they were met with chaos and panic of citizens running in numerous directions across the park (and) surrounding streets,\" records say. Cockerham saw people jumping into vehicles and accelerating \"to the point where the tires ... were spinning and screeching\" as they left the scene.\nRecords say police then saw victims lying on the ground in on the north side of the park, suffering from gunshot wounds. Police and other first responders began attending to the victims before they were taken to the hospital.\nPolice previously said several hundred people were gathered at the park for a party and some planned to shoot a music video. The video shoot never happened, though, when gunfire sent the crowd scattering. Some of those trying to escape toppled over a chain-link fence they trampled over to get out the park.\nSuspect shot the next day\nAs investigators continued poring over the mass shooting scene the next day, Lawrence \"L\" Veals, 19, was the only victim of a shooting in eastern New Orleans on Nov. 23. Veals has since been named as one of the Bunny Friend Park shooting suspects, and was arrested Dec. 4.\nA witness to the eastern New Orleans shooting told police he saw four men \"shooting guns into the air\" and then scattering, records say. The witness said approximately 20 shot were fired.\nResponding officers, who received the Nov. 23 shooting call around 10 p.m., found Veals lying on his side near the intersection of Rosemont Place and Dreux Avenue with a wound in his lower abdomen.\nAnother Bunny Friend Park shooting suspect, Malik \"Leaky\" Johnson, 17, was arrested on charges related to the eastern New Orleans shooting. He was booked on a charge of possession of a stolen weapon. The arrest came after police found a backpack near the scene containing a stolen gun.\nPolice said he will be booked on the additional attempted murder charges.\nAfter questioning another man, Dominic Savoy, about the backpack, Savoy said Johnson had possession of it. Both Johnson and Savoy were then booked on stolen gun charges.\nPolice on Sunday (Dec. 6) named Johnson as a suspect in the Bunny Friend mass shooting. He has not yet been charged with 17 counts of attempted first-degree murder.\nSavoy has not been named a suspect in the Bunny Friend shooting.\nOther suspects\nJoseph \"Moe\" Allen, 32, was the first Bunny Friend suspect named by police, less than a week after the shooting. He surrendered to police Nov. 28.\nAdditional suspects Wilfred \"Lil Wilfred\" Celestine, Quendrick \"C4\" Bailey, 20, and Michael \"Mack\" Allen, 29, remain at large."}