{"uri": "http://www.fox8live.com/story/30633115/bunny-friend-shooting-suspect-has-lengthy-criminal-history", "title": "Bunny Friend shooting suspect has lengthy criminal history", "dct": "Mon, 30 Nov 2015 23:48:00 GMT", "id": "eb17699dbd67f59717f0f6da7518c22f", "content": "NEW ORLEANS, LA (WVUE) -\nThe mother of a man accused of opening fire into a large crowd gathered at a Ninth Ward playground on Nov. 22 says her son is innocent, despite his lengthy criminal history.\nNew Orleans police have arrested one of the suspects wanted in the Bunny Friend Park shooting that left several injured. Joseph \"Moe\" Allen, 32, was taken into custody Saturday, after turning himself in, according to police.\nDetectives named Allen as a suspect on Friday. Police believe that he is one of several people involved in the Sunday shooting that left 17 injured at the park located in the 1900 block of Gallier Street.\nAuthorities are asking for anyone with additional information on the incident to contact NOPD Fifth District detectives at 504-658-6050 or Crimestoppers at 504-822-1111.\n“The news came on and my son’s picture came on the screen. I hollered, ‘what the hell?' I grabbed my cell phone and I called him,” Deborah Allen said.\nAllen said she immediately got in touch with her son, Joseph \"Moe\" Allen, whom police say was one of the gunmen in the mass shooting at Bunny Friend Playground that left 17 people wounded. Deborah, though, said there’s no way her son could have committed the shooting because he was in Texas at the time.\n“So, we’re trying to figure out how he can be in two places at one time,” she said.\nAccording to the arrest warrant obtained by FOX 8, it was a lone witness who identified Joseph Allen as one of the shooters to detectives.\n“The neighborhood has a right to know who victimized their neighborhood,\" Deborah Allen said. \"My son is innocent. I’m not a mother who is just trying to protect her son. My son did not do this.”\nBut she also admits her son is no stranger to police. With an extensive criminal history, Joseph Allen entered the criminal justice system in 2002 and 2003, when he was arrested multiple times for drugs, including cocaine and heroin. He was also arrested for illegally carrying a weapon. For those charges, he received a five-year sentence.\nIn 2006, he was arrested for illegally carrying a weapon and distribution of cocaine. The charges were refused.\nIn 2007, Allen was picked up for three counts of attempted first-degree murder and one count of second-degree murder. Those charges were also refused.\nIn 2008, he was arrested again for felon in possession of a firearm. The charges were dropped.\nIn 2010, he was arrested for a carjacking. The charges were reduced to possession of stolen things. Also in 2010, he was arrested for a home invasion, but was found not guilty.\nIn between arrests, a bill of information was filed for possession of cocaine and heroin. On those charges, Allen was sentenced in 2012 to eight years in prison as a habitual offender, which means he would not be afforded any good time, and would have to serve the entire sentence.\nIn 2013, though, that sentence was amended, which allowed him to be eligible for educational and/or work release programs.\nAllen’s mother said her son was released in January of this year and moved to Texas, where he remains on parole. She said two weeks ago, when gunfire erupted at Bunny Friend Playground, Joseph Allen was shopping with his wife in Texas.\n“My daughter and them are out there right now. They are going to clear his name,” Allen said.\nNow, she claims the family and his attorney are searching for surveillance video in Texas to prove their case.\n“They have the wrong guy. I feel for those people. I know what those people are going through, but I ask you, chief, to tell your men to get back out there and do their job,” Allen said.\nAllen remains in jail on a $1.7 million bond.\nHis next court date is Dec. 8. That’s when his mother says they’ll have the evidence to prove her son’s innocence.\nCopyright 2015 WVUE. All rights reserved."}