{"uri": "http://wavy.com/2015/11/20/mathews-county-teen-dies-in-hunting-accident/", "title": "Mathews county teen dies in hunting accident", "dct": "Fri, 20 Nov 2015 10:02:00 GMT", "id": "1fdbb0e4c0577c146c320b176a76b064", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nBOHANNON, Va. (WAVY) — Officials with the Virginia Department of Game and Inland Fisheries have confirmed that a 13-year-old boy from Mathews County died from a hunting accident Thursday evening.\nOfficials said the victim was accidentally shot with a shotgun by a 17-year-old boy while the two were hunting on private property in the Long Lane and Myrtle Grove Avenue area of Bohannon.\nAccording to department officials, the victim was in front of the shooter, and had knelt-down as he attempted to a shoot a deer. As the shooter was also attempting to shoot at the same deer, the victim stood up and came into the line of fire.\n“It’s just terrible,” said neighbor Lisa Sutton. “It’s terrible.”\nNo other way to describe what happened in Mathews County Thursday night.\n“My husband and I were on the porch last night and we saw the two boys go by to go hunting, which they do all the time,” Sutton added.\nSutton lives along The Long Lane in the Bohanan area. It’s the same area where officers with the Department of Inland Game and Fisheries spent the day investigating. She says the two boys cousins, ages 17 and 13 headed out in towards woods. It was getting dark and the rain was coming down.\n“The next thing we heard was two shots and then we see the parents rushing out of the house,” Sutton said. “It was just devastating.”\nOfficers say the 13-year-old was in front of the 17-year-old when they a saw a deer. The 13-year-old crouched down and took a shot. He stood up at the same time his cousin fired. The young boy was hit.\n“I got a phone call this morning from another neighbor to let me know that boy had passed away,” Sutton said.\n10 On Your Side learned the 13-year-old is Jordan Stewart, a student at Thomas Hunter Middle School. Grief counselors were at the school to comfort the students.\nDeer hunting season had just begun last weekend, and the two juveniles would be legally allowed to hunt if they were on their parent’s property.\n“The whole neighborhood is in mourning,” Sutton added. “They are children. It was an accident. They grow up hunting.”\nNewport News police have been asking the community to start turning in…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}