{"uri": "http://www.wsmv.com/story/28287096/11-year-old-charged-with-homicide", "title": "11-year-old charged with killing 15-year-old", "dct": "Mon, 23 Mar 2015 18:45:00 GMT", "id": "73304cabb49305c21ed3071e41cf1b04", "content": "NASHVILLE, TN (WSMV) - Metro police have charged an 11-year-old boy with homicide in connection to a deadly shooting in North Nashville.\nThe victim, DaVontae Ziegler, 15, died Friday at Vanderbilt Hospital after being shot outside his home on Gwynnwood Drive.\nThe suspect is believed to be one of DaVontae's friends.\n\"The young man who fired the shot was very concerned about the victim's welfare and ran to check on him before he fled the immediate scene,\" said Metro police spokesman Don Aaron.\nAaron did not immediately release the name of the underage suspect. The boy was charged at Nashville's juvenile court.\n\"I can't understand why or how that child got a gun,\"said Amelia Griswould, DaVontae's aunt. \"I feel bad for the mother, but she still has her child, and I don't have mine. My child is gone, and he's not coming back home.\"\nGriswould said she raised her nephew since he was 6 weeks old. She said she taught him strong values and good manners and watched him grow into a young man who sang in the church choir and played running back.\nGriswould said DaVontae was shoveling snow from the driveway Friday when the gun carried by the 11-year-old went off. She said a third boy saw the shooting and raced home to tell his parents.\n\"I don't want this child to spend the rest of his life in prison for an accident,\" said Griswould. \"I can't bring DaVontae back, but that's two children right there. That's two children whose life is gone. He's going to suffer just knowing that he killed his friend, and that's enough punishment for that child.\"\nGrieving the loss of DaVontae, Griswould said she hopes his story teaches a lesson.\n\"I wish they'd just turn around, and the children would just stop toting these guns,\" said Griswould. \"I'd like to tell these parents to please, please watch your child. I'm just going to miss him, and I'm sure all his friends in the whole neighborhood and all of his family's going to miss him. I'm just going to miss him.\"\nCopyright 2015 WSMV (Meredith Corporation). All rights reserved."}