{"uri": "http://articles.dailypress.com/2013-07-30/news/dp-nws-hampton-shooting-hearing-20130730_1_hampton-coliseum-spring-carnival-ralphael-davis-jr-one-teen", "title": "Grand jury gets Hampton carnival murder case", "dct": "Tue, 30 Jul 2013 00:00:00 GMT", "id": "8404bb63b47d600e3c962ca46ce5d24f", "content": "\"If you're gonna show the gun, shoot it,\" a teenage male in the other group challenged the gun-wielding teen, according to testimony at a preliminary hearing Tuesday in Hampton Juvenile and Domestic Relations District Court.\nWithin seconds, according to a witness on the scene that day, the teen with the gun opened fire. The shooting killed Ralphael Davis Jr., 16 — who was not the one who dared the gunman — and left four other teens — ages 14, 16, 17 and 18 — injured.\nThe shooting also spurred Hampton decision-makers to shut down the rest of the carnival, held during Memorial Day weekend, and spurred a candlelight vigil against youth violence in the city.\nTwo Hampton teenagers, Ryan Taybron, 15, and Eric Nixon, 17, face murder charges in Davis' death, as well as several malicious wounding charges in the injuries to the others.\nOn Tuesday, Judge Robert Wilson found that prosecutors had established probable cause in the case, certifying the charges and sending them to a grand jury in Circuit Court.\nAs the hearing began, Commonwealth's Attorney Anton Bell made a motion asking Wilson to clear the courtroom of most of its spectators, with the prosecutor saying there was a problem with witness intimidation, witness safety and \"an atmosphere of fear.\"\nPreliminary hearings in juvenile courts are generally open hearings as long as the defendant is 14 years old or older and being charged with a felony. But a juvenile court judge is allowed to close the courtroom \"for good cause shown,\" either on his own or by an attorney's motion.\nTaybron's attorney, Leslie Siman-Tov, and Nixon's attorney, Gregory Bane, both objected to closing the courtroom, with Siman-Tov saying there \"hasn't been a single bit of evidence\" that anyone had been threatened.\nBut Wilson agreed to close the courtroom based on Bell's assertions, with about 30 spectators having to leave the courtroom. Davis' parents, the defendants' parents, a Daily Press reporter and several others were allowed to stay.\nTwo teenage girls on hand in the group of teens before the shooting began were the prosecution's two witnesses.\nNeither girl was able to pinpoint what the argument that night was about.\nBut one of the teens testified that she saw the shooting from about 20 feet away, seeing a man with a hoodie opening fire. \"People were yelling at each other,\" she testified. \"I seen somebody reach in their pocket and start shooting.\"\nAs she fell behind a potted flower plant, the teen said, she also saw the \"tip of a gun\" being held by someone else. But she couldn't see who was holding it.\nAs for the first shooter, she acknowledged that she had told a police detective after the shooting that she could not ID the shooter because she saw him at an angle and he had a hood on.\nBut in the courtroom on Tuesday, she picked Taybron out in the courtroom as the shooter, though she acknowledged she picked him out of a group of photographs only \"in the past week.\"\nThe second prosecution witness testified that she saw Nixon \"go in his pants\" to remove \"something black.\" She heard gunfire \"two or three seconds\" later, though she said she had looked away and \"didn't see him shoot nobody.\"\nBoth girls' stories were at times unclear and difficult to follow, with the attorneys and judge often having to ask for clarifications.\nBane argued that the evidence against Nixon — with no one actually testifying to seeing him open fire — was \"at most\" evidence of brandishing a firearm. Siman-Tov said the evidence against Taybron also fell far short.\nBut Wilson ruled that Bell and the prosecution witnesses had established adequate probable cause.\nAfter the hearing, sheriff's deputies escorted Davis' family quickly down an elevator and out of the building to their cars.\nNixon's mother, Alfreda McCoy, was visibly upset, saying her son just graduated from Hampton High School and was planning to go to college. \"This has just been a nightmare,\" she said. \"I know he didn't do it, and they know he didn't do it. They are railroading my son.\""}