{"uri": "http://wishtv.com/2014/07/05/police-investigate-shooting-on-broad-ripple-avenue/", "title": "Police ID 7 victims in Broad Ripple Avenue shooting", "dct": "Sat, 05 Jul 2014 04:18:00 GMT", "id": "7be61ab1aca2a3f41c6665ba3ba1ad2e", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nINDIANAPOLIS (WISH) – Seven people were shot on Broad Ripple Avenue, a popular strip of bars on the city’s north side, according to the Indianapolis Metropolitan Police Department.\nPolice said six men and one woman were shot around 2:20 a.m. Saturday. The victims were Antell Garnett, 28, of Indianapolis, Duran Simmons, 23, of Indianapolis, Betty Jean Antwi, 23, of Fishers, Dontay Harris, 23, of Indianapolis, Marcus Clayton, 23, of Indianapolis, Joshua Kyner, 26, of Indianapolis and Stacy L. Griffin, 23, of Indianapolis.\nPolice say it was a busy night and there were lots of people out when someone shot into a large crowd of people.\nNo shooter has been identified or arrested as of Saturday afternoon.\nPolice did arrest Lawrence Jones, 23, of Indianapolis, for having a handgun without a license. However, it is unclear if he’s involved in the shooting. Officers said they were questioning Jones on Saturday morning.\nPolice don’t know if this was random, or if someone was specifically targeted. They’re still looking into all the possibilities, but they say in such a crowded place, this could have been much worse.\nPolice shut down part of Broad Ripple Avenue and Westfield between College and Guildford to canvas the area. More than 60 police officers responded to the scene to gather evidence.\nPolice said they have no witnesses other than the victims. They’re hoping anyone with information will come forward or call Crime Stoppers at 262-TIPS.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}