{"uri": "http://www.wxyz.com/news/three-people-killed-inside-berrien-county-courthouse-in-southwest-michigan-report-says", "title": "Two bailiffs, shooter killed inside Berrien County Courthouse in southwest Michigan", "dct": "Tue, 12 Jul 2016 09:13:00 GMT", "id": "29299031b5d373bb8687bf51369bdb04", "content": "Autoplay:Berrien County courthouse shooting updateCONNECTING...XVictims identified in Berrien County courthouse shooting\nST. JOSEPH, Mich. (AP) - A sheriff says two bailiffs and a gunman are dead after a shooting at a western Michigan courthouses on Monday.\nBerrien County Sheriff Paul Bailey said at a news conference late Monday afternoon that an inmate who was being held at the berrien County courthouse on numerous felony charges was being moved when he disarmed an officer and then shot and killed the two bailiffs. The victims have been identified as 61-year-old Joseph Zangaro and 63-year-old Ronald Kienzle.\nZangaro was head of court security. He retired from the Michigan State Police as commander of the Bridgman Post in Berrien County.\nKienzle retired as a sergeant of the Benton Township Police Department after serving in the U.S. Army.\nBailey said they were \"close friends\" of his.\nThe deputy sheriff, we're told, was also shot but is in stable condition at Lakeland Hospital in St. Joseph. He has been identified as Deputy James Atterberry.\nA civilian was shot in the incident, but is also expected to be OK. Her name has not been released.\nBoth of them were shot in the arm.\nThe inmate, who has been identified as 44-year-old Larry Darnell Gordon of Coloma, was killed by other officers after the shooting.\nSt. Joseph is located in far southwestern Michigan's Berrien County, which borders Indiana.\nMichigan Supreme Court Chief Justice Robert Young released this statement following the incident:\n“Our prayers and condolences go out to those affected by today’s shooting at the Berrien County Courthouse. This tragic incident is another sad reminder that courthouse employees put their lives at risk every day to serve the people of Michigan. As we await further details and the results of the ongoing State Police investigation, we stand ready to implement steps to further strengthen courthouse security to better protect both employees and the public.”\nCopyright 2016 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nPrint this article Back to Top"}