{"uri": "http://www.freep.com/story/news/local/michigan/2016/07/11/reports-shots-fired-berrien-county-courthouse-st-joseph/86953034/", "title": "2 bailiffs, shooter dead in Berrien County Courthouse shooting", "dct": "Mon, 11 Jul 2016 00:00:00 GMT", "id": "3d8530839d4827d071e850ed03eb5ac6", "content": "Berrien County Sheriff Paul Bailey confirmed at a Monday press conference that two court bailiffs -- both retired police officers -- were killed and the suspect, an unidentified man, was shot and killed by police inside the county courthouse in downtown St. Joseph.\nBailey said the shooting happened about 2:25 p.m. when a \"disturbance\" occurred on the third floor of the courthouse, which is next to to the sheriff's department and county jail.\n\"The person had shot two bailiffs, they're both deceased, and shot a deputy sheriff who is at the hospital right now being treated in an emergency room.\"\nRelated Berrien County shooting stories:\nBailey said the sheriff's deputy is in stable condition at Lakeland Regional Hospital. Bailey said \"several civilians\" were also taken to the hospital and are in stable condition as well at the same hospital.\n\"They went for shelter once the shooting occurred and other brave officers were able to come to their rescue and take the shooter down,\" Bailey said.\nBailey said the sheriff's department is investigating the shootings along with the St. Joseph's Police Department and Michigan State Police.\n\"We have the MSP Crime Lab coming down to process the scene,\" Bailey said. \"We don’t have all the details about what happened or what occurred or how he got the weapon, we will be investigating that along with the homicide task force.\"\nBailey called the shootings a \"terrible, terrible\" event and said additional information will be released later Monday.\nMichigan Department of Corrections spokesman Chris Gautz said a probation agent was in the courtroom and saw the gunman run past her. He said she then went back to the office and instructed staff members to get down and stay low.\n“Her training and her instincts kicked in,” Gautz said. “We’re very proud of her response.”\n\"We're asking people to pray for the families of the deceased,\" Bailey said.\nRetired Benton Township Police officer Kim Fowler knew both of the slain bailiffs well. He said he worked with one of the men for a quarter of a century at Benton Township and the other, a retired state trooper, was his neighbor.\nHe said he was stunned by the news. He called both men \"100 percent police officers carrying on in their retirement by being in the courtroom.\"\nFowler said the last time he recalled a law enforcement officer being killed in the line of duty in Berrien County was in 1984 when Michigan State Trooper Robert Mihalik was killed during a traffic stop in Shoreham, just south of St. Joseph.\n“There are always sporadic incidents everywhere in the country,\" Fowler said. \"Fortunately nothing has happened recently here, but I guess it was our turn in the barrel.”\nBerrien County Commissioner Mac Elliott, who is also an attorney, was in the courthouse today prior to the shootings.\n“It’s just surreal, I was in the building today for matters I had on the civil docket … and I still can’t believe it,” he said.\nElliott described the victims as fine individuals who were good at their jobs and at dealing with the public.\n“Professional, always courteous, just great people. I can tell you they will be sorely missed,” Elliott said, noting that he hopes God gives their families the strength to bear the unbearable. He also said he hopes God has found a “very warm place” for the perpetrator.\nElliott, who said he chairs the commission committee overseeing the court, said the incident was not caused by anyone bringing something into the building. He said metal detectors and a machine to scan items coming into the building are used at the courthouse.\n“There was no failure of the security system in terms of screening individuals coming into the building. That all worked the way it was supposed to work,” Elliott said.\nJames Jesse, an attorney in Berrien County for 46 years, was also in the courthouse today. He said he left about 10 minutes before the shooting started.\n“It’s just really, really sad,” he said. “It’s a sad world we live in anymore.”\nMarcus Muhammad, the mayor of neighboring Benton Harbor, said he was sending \"condolences and prayers to the families of those fallen and injured and the entire Berrien County staff and Paul Bailey.\"\n\"If it affects them, it affects us because we are Benton Harbor and St. Joseph, the Twin Cities,\" Muhammad said, referring to the two cities' longtime nickname. \"I think with unity we can solve 95% of our problems. Together there is no tragedy too great that in the end we can triumph\nToday my message is to be prayerful.\"\nMichigan Supreme Court Chief Justice Robert P. Young, Jr. released a statement on the shooting this afternoon.\n“Our prayers and condolences go out to those affected by today’s shooting at the Berrien County Courthouse,\" he said in it. \"This tragic incident is another sad reminder that courthouse employees put their lives at risk every day to serve the people of Michigan. As we await further details and the results of the ongoing State Police investigation, we stand ready to implement steps to further strengthen courthouse security to better protect both employees and the public.”\nStaff writer Eric D. Lawrence, Elisha Anderson, Gina Damron and Free Press special writer Michelle Crandall contributed to this report."}