{"uri": "http://www.kmov.com/story/32741070/chase-ends-in-crash-in-jennings", "title": "Charges filed in chase, crash and accidental shooting of officer in Jennings", "dct": "NODATE", "id": "34a07a28831d19c960cb0ad045a7df8a", "content": "Print\nDetective Robert Inman accidentally shot himself while trying to grab his gun as a suspect's car approached him at the end of a chase in Jennings. Credit: KMOV\nNORTH ST. LOUIS COUNTY (KMOV.com) -\nCharges were filed Friday in connection to a chase that ended in a crash in Jennings. The wreck caused an officer to accidentally shoot himself.\nAntwon Baldwin, 19, is facing 10 charges including assault on a law enforcement officer, resisting arrest, receiving stolen property and tampering with a motor vehicle.\nTyrone Hendrix. 21, is charged with tampering with a motor vehicle.\nPolice believe the two allegedly broke into homes and took keys in order to steal cars. The cars were then used to commit other crimes.\nPolice say a suspect in an ongoing investigation was arrested Wednesday and provided information on Baldwin and Hendrix.\nThursday, police surrounded a house where the two were inside. Hendrix was arrested as he walked out, while Baldwin got into a stolen Mazda and hit two other cars that were blocking him in.\nAn officer outside the home pointed a gun at him but didn’t shoot, police say.\nBaldwin then got away and led officers on a chase. Near the intersection of Lucas and Hunt and West Florissant, police say he pointed a gun at officers and lost control of his car, hitting a silver Dodger Neon head on. Three people were inside. Police believe those three will be okay.\nWhen Baldwin allegedly hit the Neon, he dropped the gun on the floor of the car. He then reached down to pick up the gun, causing him to drive towards a detective car. A detective, Robert Inman, who was inside the car, feared for his life and started to reach for his gun.\nHowever, the Mazda hit the detective car while the Inman was still reaching for his gun, police say. The impact caused the Inman’s finger to touch the trigger, which discharged a bullet into the his thigh.\nInman, not realizing he was wounded, got out of the car and arrested Baldwin, police say.\nPolice do not believe the wound is life threatening.\nCopyright 2016 KMOV (Meredith Corporation). All rights reserved"}