{"uri": "http://www.stltoday.com/news/local/crime-and-courts/st-ann-officer-accidentally-shoots-self-three-suspects-in-custody/article_42761e63-c84a-5aa8-893c-ca2198341b36.html", "title": "St. Ann officer accidentally shoots self; three suspects in custody after pursuit", "dct": "Thu, 11 Aug 2016 00:00:00 GMT", "id": "48243f566d13939a4fec3b28d8ad8301", "content": "ST. ANN • A St. Ann police officer accidentally shot himself in the leg during a pursuit that ended in a crash Thursday afternoon, according to police.\nTwo suspects wanted for several crimes were arrested in the incident, according to St. Ann Police Chief Aaron Jimenez.\nDetective Robert Inman was one of two officers involved in a pursuit that began in Ferguson and ended near Lucas & Hunt Road and West Florissant Avenue about 4 p.m. when the suspect rammed his car into Inman’s vehicle.\nInman, who was starting to get out of his vehicle with his gun unholstered, accidentally shot himself, Jimenez said. Inman was treated at a hospital and released, but he will have to go through rehabilitation, Jimenez said.\nThursday afternoon, officers approached a house on Day Drive in Ferguson to arrest the two suspects, Jimenez said. Police had arrested a third man Wednesday evening as part of an investigation into a series of home break-ins and car thefts, Jimenez said. That man provided police with information on the two suspects in Ferguson.\nOfficers arrested one man at the house, but the other drove away in a white Mazda CX-9 that had been reported stolen. The suspect led police on a pursuit of more than 110 miles per hour while waving a gun that also turned out to be reported stolen, Jimenez said.\nThe fleeing car ran a red light trying to turn left onto Buzz Westfall Plaza and hit a Dodge Neon head-on before stopping in the westbound lane. The three adult occupants in the Dodge were not severely injured, according to police.\nAs Inman and another officer began to get out of their car to arrest the suspect, the suspect rammed the officers’ vehicle, Jimenez said. Inman, who had taken out his gun, was jolted, and his gun went off.\nHe was still able to help the other officer take the suspect into custody, Jimenez said."}