{"uri": "http://www.nbcmiami.com/news/local/2-Miami-Men-Arrested-in-Lakeland-Triple-Murder-365335261.html", "title": "2 Miami Men Arrested in Lakeland Triple Murder", "dct": "Thu, 14 Jan 2016 21:35:00 GMT", "id": "5098945ad916cd28b0e286cd81d13cec", "content": "Two Miami men have been arrested in what authorities say was an \"organized execution\" of three people in Lakeland, officials said Thursday.\nAndrew Joseph, 35, and Jonathan Alcegaire, 26, are both facing several charges including three counts of first-degree murder and attempted murder, Polk County Sheriff's Office officials said.\nJoseph was arrested Monday and Alcegaire was arrested Tuesday. Both were booked into the Miami-Dade Jail but will be taken to the Polk County Jail where they will be held without bond.\nThe two suspects were arrested with the help of the Miami-Dade and Miami Police departments, officials said.\nThe shooting happened at a home on East Magnolia Drive in the Combee area of Lakeland, about 30 miles west of Tampa, on Jan. 6.\nDeputies responding to a call of a shooting at the home found two women and a man dead, officials said. Another man was taken to a nearby hospital with a gunshot wound to his face.\nThe victims were later identified as David Washington, 23, Eneida “Stacey” Branch, 31, and Angelica Castro, 23. Felix Campos, 18, was hospitalized but survived.\nOfficials said illegal drugs, drug paraphernalia and two firearms were found in the home. Detectives also learned Washington had made several trips to the Miami area to buy drugs, including the day before the shooting, officials said.\nAuthorities said Joseph, Alcegaire and another man arrived at the house and one of them got into an altercation with Washington.\nCampos told detectives he heard Washington talking with the three suspects before one of them entered his bedroom and shot him in the face. Campos pretended to be dead and heard multiple gunshots, officials said.\nDetectives learned that a white U-Haul work van was seen leaving the home, and the van was tracked to Miami-Dade, where it had been rented by Joseph, authorities said.\nAccording to authorities, the robbery was orchestrated by Joseph, whose arrest history includes 29 previous felony charges in Florida, as well as six drug-related charges in Minnesota.\nAlcegaire has eight previous felony charges, as well as nine previous misdemeanor charges, officials said.\nDetectives are searching for more suspects and are asking anyone with information to call the sheriff's office at 863-298-6200."}