{"uri": "http://wfla.com/2016/03/04/manhunt-for-polk-triple-murder-suspect-ends-with-arrest/", "title": "Manhunt for Polk triple murder suspect ends with arrest", "dct": "Fri, 04 Mar 2016 10:42:00 GMT", "id": "ef92e836b45ddf5588233963d5ee4bdd", "content": "MIAMI, Fla. (WFLA) — The manhunt for the remaining suspect in a violent Polk County triple murder ended on Thursday with the arrest of Tavares Antwan Mack, 26, in Miami.\nU.S. Marshalls arrested Mack at a residence at 2225 NW 119th St. in Miami the Polk County Sheriff’s Office said on Friday.\nMack is one of four suspects in a Jan. 6 triple homicide. Polk County Sheriff Grady Judd said the victims were found ‘slaughtered’ in the home. Two women and a man were found dead inside a home on East Magnolia Drive in Lakeland. A fourth victim was found alive, but has been shot in the face.\n18-year-old Felix Campos was the sole survivor of the attack. The murder victims were identified as 24-year-old David Washington, 31-year-old Eneida Branch, and 23-year-old Angelica Guadalupe Castro.\nMack is charged with three counts of First Degree Murder, Attempted First Degree Murder, Armed Robbery, Armed Burglary, and Tampering with Physical Evidence in a Capital Proceeding. He was booked into the Miami-Dade County Jail and will be extradited to Polk County.\nThree other Miami men are suspected in the murders. Andrew Joseph age 35, Jonathan Alcegaire age 26, and Jamaal Smith age 25, have already been arrested.\nTHE STORIES OTHERS ARE CLICKING ON:\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}