{"uri": "http://www.abcactionnews.com/news/region-polk/polk-county-deputies-investigate-magnolia-street-shooting-in-combee-area-of-lakeland", "title": "2 Miami men arrested in Polk triple homicide", "dct": "Wed, 06 Jan 2016 08:48:00 GMT", "id": "f9b46ef4d06f430bada39e0fefdf300d", "content": "Autoplay:2 Miami men arrested in Polk triple homicideCONNECTING...XPolk deputies search for 3 suspects in triple homicide\nLAKELAND, Fla. -\nTwo Miami men have been arrested in a Lakeland triple homicide, according to the Polk County Sheriff's Office.\nThe news comes a week after Polk County deputies released video of a van possibly driven by suspects in the case.\nAndrew Joseph, 35, and Jonathan Alcegaire, 26, are both charged with three counts of First Degree Murder, Burglary, and other crimes.\nThe white Ford Transit Connect was captured on surveillance video sometime after the drug-related murders occurred Jan. 6 at 2314 Magnolia St. E. in Lakeland.\nSheriff Grady Judd said the men intended to kill everyone in the house but one person survived.\nJudd released toll road surveillance pictures of one man driving to Lakeland the morning of the murders and another surveillance photo of a man in a black sedan who was in the area a few weeks prior to the killings.\nIt was on Jan. 6 that law enforcement received a 911 call from the house about 6:44 a.m. reporting the murders.\nThe victims have been identified as David Washington, 24, Enedia Branch, 31, and Angelica Guadalupe Castro, 23. Felix Campos, 18, who was wounded, remains at LRMC. Judd said at this point Campos has not been able to add much information to his detectives.\n\"Our preliminary investigation shows this house is known as the one-stop-shop for drugs,\" Judd said during a news conference the day of the slayings. \"Marijuana, pills, heroin, cocaine…whatever you needed, they had here.”\n\"To those who think drugs are harmless [and that] drugs are minor [and that] drugs aren't that serious, try telling that to the families of those four people,\" Judd said.\nOne woman who lives in the neighborhood, Cheryl Alexander, said she is part of a group called CARE, which services the Combee area. She said the group has been trying to revitalize the community for some time.\n\"We've trying to change an image that has developed about the Combee area,\" Alexander said.\n\"There are some drug dealers in the neighborhood and they've been giving to people from here some grief just by having the traffic and all. And of course this was upsetting because it was the first time anyone had done any shooting over it,\" Alexander said.\nJoseph and Alcegaire are half brothers. Judd believes they are part of a Haitian crime ring, but said they have just scratched the surface and don't know how many other players are involved. He did have this message for other drug operators in the state.\n\"If you are in the drug world or trade in the Miami area you may be the next one they murder if we don't get them off the streets,\" Judd said. \"They brag of hitting drug houses they brag of murder.\"\nCopyright 2016 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}