{"uri": "http://www.walb.com/story/28292240/deputies-at-least-one-person-hurt-in-shooting-at-seneca-bar", "title": "Oconee Co. shooting claims one man's life, may have injured others", "dct": "Sun, 08 Mar 2015 17:11:00 GMT", "id": "4f68289b3a3a36b39893fa49e2954a3b", "content": "SENECA, SC (FOX Carolina) -\nDeputies with the Oconee County Sheriff's Office are investigating an early Sunday morning shooting at a bar that claimed one man's life and may have sent others to the hospital.\nDeputies and officers with the Seneca Police Department were called to Sonny's Bar and Grill near on Wells Highway after a fight was reported around 12:30 a.m.\nBefore deputies arrived at the scene, they learned from dispatchers that multiple gunshots had been fired and that callers at the location reported multiple people had been injured, according to a news release.\nDeputies arrived to find one man in front of the bar with a gunshot wound to his midsection. Deputies said that man was rushed to the hospital.\nThe man died at the hospital just after 9:30 a.m. according to Oconee County Coroner Karl Addis.\nAddis identified the victim as 29-year-old Anthony Holden of South Pine Street, Seneca.\nThe coroner said an autopsy would be conducted on Monday to aid in the investigation into Holden's death. Addis said the cause of death was complication due to a gunshot injury to the abdomen.\nDeputies also believe additional victims may have been driven to the hospital by others at the bar, according to a news release issued Sunday afternoon.\nDeputies said glass on the front of the business and a vehicle in the parking lot was also damaged in the gunfire.\nWitnesses told deputies that as many as 100 people may have been in the crowd when the shooting happened.\nDeputies ask any witnesses or anyone with information about what happened to call Crime Stoppers at 1-888-CRIME-SC or 864-638-STOP.\nNo suspects were identified, per the news release.\nDeputies could not provide an exact number of victims and said they were not aware of any additional victims' conditions Sunday afternoon.\nDeputies said the investigation was ongoing and that no other information was available Sunday afternoon.\nCopyright 2015 FOX Carolina (Meredith Corporation). All rights reserved."}