{"uri": "http://www.khou.com/news/crime/father-son-shoot-alleged-teen-robbers-at-e-houston-home/306881137", "title": "22-year-old who killed teen suspect, wounded another has no regrets", "dct": "Wed, 24 Aug 2016 00:00:00 GMT", "id": "7aecddad75a8bcde178ec71555f92b08", "content": "HOUSTON - A young man who shot two teenage apparent would-be-robbers believes they got exactly what they deserved.\nOne of those juveniles was pronounced dead shortly after the shooting. The other is now recovering at an area hospital.\nIt happened around 8 p.m. Tuesday night on Majestic Street.\nJose, who asked us not to use his last name, said the teenagers had been walking up and down the street for about 10 minutes.\nAccording to Jose, he and his dad were hanging out in their backyard when the teens walked up their driveway.\n“The first teenager pulls out his firearm and points it directly at us,” Jose recalled. “I didn’t let him finish talking. My first reaction was to take out my gun and open fire.”\nJose said the teens appeared to be about 15 or 16 years old.\nJose told KHOU 11 News he had never seen the underage suspects before the encounter. He said he wasn’t sure why they picked his family’s house.\n“I didn’t want him to die, but oh well. He asked for it,” Jose said.\nJose said he got his concealed handgun license four months ago to protect himself and his family.\nHe believes things would have ended much differently if he hadn’t been armed.\n“I had no other choice. It would be me or my dad laying down on the ground dead. I had to do what I had to do to protect myself,” he said.\nJose said he called 911 right after unleashing seven shots toward the suspects.\nHouston Police said the surviving teen ran home after getting shot. He’s now recovering in the hospital and is expected to be OK.\nNeither teenage suspect has been identified by authorities.\nA neighbor said the teens attend Wheatley High School, but Houston Independent School District could not confirm that.\nPeople in the east Houston community are applauding the actions of Jose. They hope it sends a stern message to others who are thinking about committing crimes.\n“If anybody is thinking twice about coming over here to rob somebody, that’s what is going to happen,” said neighbor Paul Garay. “I don’t wish death on nobody, but if you do wrong, karma’s a mother.”\nNo charges have been filed at this time. This case will now be headed to a grand jury.\n(© 2017 KHOU)"}