{"uri": "http://www.modbee.com/news/local/crime/article31965084.html", "title": "Police identify victim killed in Modesto shooting", "dct": "Sun, 23 Aug 2015 09:39:00 GMT", "id": "02271ae31f1b922b87cbd8cca8fddf7a", "content": "Eight people were shot and one of them is dead after gunfire erupted at a party at a warehouse in west Modesto early Sunday, police said.\nThe preliminary investigation reveals that an X-Fest after-party was taking place at a warehouse in the 1100 block of Kansas Avenue, with dozens of people in attendance, according to Modesto Police Department spokeswoman Heather Graves.\nWhile attendees were waiting to get into the party about 3 a.m., a man walked into the parking lot and started shooting, police said. Nearly everyone scattered before police arrived, including seven of the people who were shot. They later arrived at a hospital.\nAt the scene, officers found Zachary McGee, 25, of Modesto suffering from gunshot wounds. Only a few witnesses remained, Graves said. McGee was taken by ambulance to a hospital, where he died.\nTwo of the victims remain hospitalized. A 23-year-old woman underwent surgery and is listed in critical but stable condition, and a 25-year-old man is in serious but stable condition. Both are Modesto residents.\nThe other five victims were treated for gunshot wounds and released. They are 19- and 28-year-old men and 24-, 30- and 31-year-old women.\nX-Fest promoter Chris Ricci said the party had nothing to do with the downtown event earlier in the evening.\n“From my perspective, really the only connection to X-Fest was that people from X-Fest were there,” he said. “There are no X-Fest after-parties associated with Chris Ricci Presents. Our full commitment after the 1 a.m. closing of the event is to remove stages, take down fences and return the downtown to the state it was in prior to the event. We work hard to make X-Fest safe for our community from beginning to end.”\nGraves said attendees identified the party as an X-Fest after-party and many were still wearing wristbands from the event.\nNo major crimes were reported at the X-Fest event downtown apart from a handful of arrests for fighting and being drunk in public, according to police Lt. Kelly Scott.\nOn Kansas Avenue, detectives were investigating whether the shots were fired from more than one gun and are trying to determine whether any of the people shot are also suspects, Graves said. Detectives have not said what motivated the shooting, and no one is in custody.\nA woman who lives several blocks from the shooting said she awoke to the sound of gunfire and then heard a woman screaming.\n“All I heard was gunshots going back and forth for what felt like forever,” said Anessa Paz. “I didn’t think it was going to end, and then afterward I heard a woman screaming at the top of her lungs.”\nPaz estimated hearing at least 20 gunshots.\nKansas Avenue was closed between Emerald Avenue and Carpenter Road well into the afternoon Sunday while detectives processed the crime scene. Yellow evidence placards dotted the street in front of the warehouse.\nThe warehouse shares a building with auto body and auto repair businesses but is vacant, Graves said. The unit is leased, but no business license is associated with the space.\nThis is Modesto’s third fatal shooting in five days.\nOn Wednesday, a man was found dead in the street on Olivero Road after having been shot. On Friday, a 24-year-old Modesto man, Augustin Chum, was fatally shot at the Standiford Court Apartments at the southwest corner of Standiford Avenue and Colonial Drive. A Stockton man also was shot in that incident and was listed Saturday in stable condition at an area hospital.\nIf you have any information regarding these shootings, call Crime Stoppers at 209-521-4636. Callers can remain anonymous and are eligible for a cash reward. Tipsters can also text information to Crime Stoppers at 274637; type “TIP704” along with the message.\nErin Tracy: 209-578-2366, @ModestoBeeCrime"}