{"uri": "http://www.miamiherald.com/news/local/crime/article82850432.html", "title": "Game with gun costs two teens - one dead, another now prison-bound", "dct": "Thu, 09 Jun 2016 18:00:00 GMT", "id": "f809cea4fe10e733c24760427d7bf7d0", "content": "While playing with a revolver after an afternoon at the park, Curtis Hollinger aimed the barrel square at his friend’s chest. He squeezed the trigger three times.\nOn the fourth shot, a bullet killed 13-year-old friend Darin “Book” Booker.\nNow, the dangerous game will cost Hollinger more than 10 years of his own life.\nA Miami-Dade judge on Thursday rejected any sort of boot camp or juvenile detention center for the 17-year-old Hollinger, instead sentencing him to 128 months in state prison for manslaughter. The judge will ask the Florida Department of Corrections to place him in a “youthful offender” facility, where he will be housed separately from older, hardened inmates.\n“Book won’t get to satisfy his future plans,” Circuit Judge Dennis Murphy said. “Mr. Hollinger is here and will try to regroup.”\nThursday’s emotional sentencing capped yet another sad tale of gunplay, this one shattering two South Florida families in August 2014 outside a home in Florida City.\nOn Thursday, Darin’s family sat on one side of the courtroom gallery, wearing T-shirts adorned with his photo. His little sister, Kayla Booker, 14, showed off a poster with her brother’s picture. She could barely speak, wiping away tears.\n“Book was my favorite brother,” she told the judge quietly. “I really miss when we used to have our silly moments.”\nHollinger’s mother teared up, too, during her testimony. Hollinger himself took the stand, begging forgiveness. “I'd do anything to have Darin Booker back on this Earth,” he said.\nFor the judge, sentencing Hollinger was not an easy decision.\nThe teen was already on juvenile probation for stealing and crashing a golf cart inside a Florida City apartment complex. He was put on probation for nine months, but was arrested again just three months later after he was caught riding in a stolen car. Eventually, Hollinger was returned to probation for the first case. Then came the killing.\nIn August 2014, Hollinger was playing football with other kids at a Florida City park.\nHe had with him a .22-caliber revolver that he had bought for $150. Hollinger and another teen shot the weapon into the ground while at a public park with children playing nearby. He, Darin and another teen identified only as “L.B.” then smoked a few joints before heading over to a neighbor’s yard.\nAs they walked over, L.B. told Hollinger that the gun still had one bullet left. Nevertheless, Hollinger continued playing with the revolver. He pointed it at Darin’s chest and pulled the trigger three times. On the fourth time, the weapon fired, hitting Darin square in the chest.\n“The defendant made no effort to render aid or assist the victim whatsoever,” prosecutor Jonathan Borst wrote in a court motion to the judge.\nIn the moments afterward, Hollinger’s actions raised suspicions that the shooting was no accident. He then “lifted and slammed” Darin to the ground, then strangely rifled through the boy’s pockets – prosecutors were never sure if he actually took anything.\nHollinger ran home, hiding the revolver in some bushes, but not before telling a neighbor that Booker had actually shot himself.\n“I was scared,” Hollinger explained on Thursday. “It really hurt me. My friend, he died playing a dangerous game.”\nHollinger gave shifting versions of what happened. At first, he claimed “L.B.” shot Darin. Then, he said they were playing some sort of game of Russian Roulette.\nAnd on Thursday, Hollinger changed his story yet again, saying he believed the gun was not loaded.\nThe teen was initially charged with manslaughter with a deadly weapon. But prosecutors later upped the charges to second-degree murder, and Hollinger was transferred to the adult court system.\nHe eventually pleaded guilty to manslaughter.\n“This was a kid who did something stupid and dangerous,” said his lawyer, Kenneth Speiller said. “And unfortunately, his friend paid the ultimate price.”"}