{"uri": "http://www.sfgate.com/crime/article/Baby-shot-by-errant-bullet-in-Richmond-9228103.php", "title": "Baby shot by errant bullet in Richmond", "dct": "Sat, 17 Sep 2016 00:00:00 GMT", "id": "551370b795508b1a837dc025bc807c90", "content": "A 1-year-old baby being held by his mother on a Richmond sidewalk was shot in the leg Friday by an errant bullet when someone opened fire on a man more than two blocks away, police and witnesses said.\nGunshots broke out about 10:15 a.m. on Second Street and Bissell Avenue, where a man in his 20s was shot, residents said. A bullet that missed the man flew 2½ blocks north up Second Street and struck the infant in the leg at McDonald Avenue, said Lt. Felix Tan, a spokesman for the Richmond Police Department.\nWhen the shooting happened, the mother was holding her child in her arm as she waited in front of the Bay Area Rescue Mission, a food pantry and distribution center, said Leo Freels, a warehouse manager.\nFreels, 45, said he was inside the warehouse fetching a refrigerator for the mother, when co-workers told him a baby had just been shot.\n“It didn’t occur to me that the baby in her hands was shot,” Freels said of the mother he was helping. “I got a baby the same age. It’s crazy.”\nFreels said he ran back outside and saw the injured child. He and other workers wrapped up the baby’s leg in bandages. As others called 911, Freels put the baby in his car and sped him and his mother to the Kaiser Permanente Richmond Medical Center on Nevins Avenue.\nThe mother “was freaking out, but the hospital staff calmed her down,” said Freels, adding that the mother lives in Richmond and that her baby is going to be fine.\nPolice did not release the names of the mother and child.\nTan said police officers went directly to the McDonald Avenue food pantry as soon as they received calls of the shooting. While there, officers learned that a 25-year-old man had been shot at Second Street and Bissell Avenue and had already been taken to a hospital.\nNo suspects have been identified, he said.\nThe man suffered non-life-threatening injuries, Tan said.\nResidents in the area where the gunfire broke out said they heard at least three shots and then saw a man on the ground wounded.\n“It’s really frightening. I didn’t go outside. It’s awful. It was terrible,” said Janet Hackett, 74, who looked out her door and saw the wounded man.\nSarah Ravani is a San Francisco Chronicle staff writer. Email: sravani@sfchronicle.com"}