{"uri": "http://sacramento.cbslocal.com/2014/10/24/authorities-at-scene-of-officer-involved-shooting-in-arden-area/", "title": "UPDATE: Two Deputies Killed In Sacramento, Placer Counties; Suspect In Custody", "dct": "Fri, 24 Oct 2014 19:02:00 GMT", "id": "d08cdeaf55b2295e9b956d21f8871d83", "content": "8:10 p.m. UPDATE: SACRAMENTO (AP) — California Gov. Jerry Brown is extending condolences to the families of a Sacramento County sheriff’s deputy and a Placer County sheriff’s deputy who were shot in what he calls “brutal murders.”\nThe governor’s statement says Friday’s killings of Deputy Danny Oliver and Detective Michael Davis are “a tragic reminder of the sacrifices we demand of our peace officers.”\nFlags at the state Capitol have been ordered to fly at half-staff.\nAUBURN (CBS13) — 6:30 p.m. UPDATE: Det. Michael David Davis Jr, veteran officer and detective of the Placer County Sheriff’s Department, was identified as the deputy killed in the line of duty in Auburn.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nSheriff Ed Bonner said Davis’ father died 26 years ago to the day in a similar incident in Riverside County.\nThe sheriff shared his thoughts on bringing the suspect in alive.\nThe suspect is in custody, as you know. I think there are those people who would say, “You know what, I wished you’d killed him.” No. That’s not who we are. We are not him. We did our job. I’m incredibly proud of the men, women who go out there every day and put their live on the line. And today this organization, this family has suffered a horrific loss.\nThe female suspect who was captured hours before Marcelo Marquez was identified as 38-year-old Jannelle Monroy.\nAUBURN (CBS13/AP) 4:20 p.m. UPDATE: Placer County Sheriff’s Department confirms one of the two deputies has died, a second deputy was injured.\nThis is in addition to the shooting death of Sacramento County Sheriff’s Deputy Danny Oliver.\nThe Placer County High football game has been postponed until Saturday in light of Friday’s tragic events.\nAUBURN (CBS13/AP) 3:55 p.m. UPDATE: A Placer County Sheriff’s deputy tells CBS13 they have their suspect. Say they made a positive ID. He was inside the 220 Belmont Drive home.\nDena Erwin with the Placer County Sheriff’s Office has identified the suspect as Marcelo Marquez, a 34-year-old man.\nErwin told The Associated Press that two deputies from her department also were shot in Auburn, about 30 miles north of Sacramento, as the manhunt continued. The conditions of the other two deputies and the bystander were not immediately known.\n3 p.m. UPDATE: Sheriff Scott Jones confirms Sacramento County Sheriff’s Deputy Danny Oliver, 47, was killed in the initial shooting at Motel 6 on Arden Way.\nA suspicious vehicle was reported at the Motel 6 on Arden Way. Oliver and a partner responded, and the suspect opened fire from within the vehicle, shooting Oliver in the forehead. He was pronounced deceased at the scene.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nOliver was a 15-year law enforcement veteran. He leaves a wife and two children.\nThe suspect attempted to carjack a vehicle in a nearby neighborhood. The owner fought back and was shot in the head. The condition of that person is unknown, but they were transported to UC Davis Medical Center alive and conscious.\nThe Ford F-150 pickup that was carjacked was believed to be the second attempted carjacking.\nThe conditions of the other two deputies shot at this time is unknown.\nThe shooting comes days before the eighth anniversary of the on-duty death of Sacramento Sheriff’s deputy Jeffrey Mitchell.\n“It’s unfortunate that we have to put another plaque on this wall today,” Jones said\n2 p.m. UPDATE: Police have confirmed the female suspect is in custody. A Hispanic male in his 30s is still being sought by Police. Reports suggest he may be inside Auburn home.\nSACRAMENTO (CBS13) – Authorities are saying that at least three officers and one civilian have been shot in two different incidents Friday.\nThe incident started near Arden Way and Howe Avenue. Lisa Bowman with the Sacramento County Sheriff’s Department says that around 10:30 a.m. an officer responded to a report of a suspicious person inside of a vehicle. The suspect shot the deputy at least once during the confrontation.\nBowman says the suspect then fled the scene and tried to steal a car, only to shoot the person. The suspect then went to steal a truck and was successful.\nA Blue Alert was issued by the California Highway Patrol to be on the lookout for the stolen truck, but it has since been recovered.\nBowman later said that they received “credible information” from a park ranger that the suspect was seen in Carmichael changing clothes. A female passenger is said to be in the truck with the suspect.\nPlacer County Sheriff’s later confirmed that the crush of police activity in Auburn was related to the incident in Sacramento. Deputies say they are seeking the same suspect.\nCalifornia Highway Patrol later said that a total of three officers, two in Placer County and one in Sacramento, have been shot in the incidents.\nThere has been no word on the extent of the injuries on any of the shooting victims.\nAll Auburn schools, including Placer High School, Chana High School and Maidu High School, are on lockdown, Placer Unified officials confirm."}