{"uri": "http://m.wsbtv.com/news/news/local/child-critical-following-quadruple-shooting-deK/nn2GZ/", "title": "Child recovering after quadruple shooting in DeKalb County", "dct": "Mon, 12 Oct 2015 20:36:00 GMT", "id": "6a6ab34e938d3d4e14447d14c81ac02a", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nDEKALB COUNTY, Ga. - Police are investigating a shooting Monday that has injured four people, including a 1-year-old.\nThe child was in critical condition and is now recovering from surgery and expected to be OK.\nThe grandmother of D'onte' Patterson II didn't have much time to speak with Channel 2’s Richard Elliot as she was rushing to get to Children’s Healthcare of Atlanta at Egleston.\nShe seemed to say she knew two of the people who were shot.\n“I don't know if either of them is OK,” the grandmother said, not identifying herself.\nThe shooting happened at the Austin Oaks Apartments just after 8 p.m.\nAccording to DeKalb County police detectives, a group of people, including the toddler, was standing out in the breezeway when someone came around a corner and just started shooting.\nThey still don't know why.\nJoseph Mason heard the shots from inside his apartment.\n“Constant. Pow, pow. Like automatic going off, like they shot seven or eight times,” Mason told Elliot.\nhttps://twitter.com/RElliotWSB/status/653740572486860801\nDeKalb police only have a vague description of the suspect and aren't sure how he made his getaway, but they are vowing to find the man who fired into a crowd of people that included a small child.\n“This is a serious issue when you have an individual who is willing to take a shot and hit and shoot indiscriminately into a group of people and hit a child. That is something that the DeKalb police is really not going to tolerate,” said Detective Corneilus Yarbro with the DeKalb County Police Department.\nTwo men and a woman were taken to a local hospital with non life-threatening injuries."}