{"uri": "http://www.mysanantonio.com/news/local/article/Second-suspect-in-MLK-Day-fatal-shooting-back-in-6101613.php", "title": "Second suspect in MLK Day fatal shooting back in San Antonio, another at large", "dct": "Wed, 25 Feb 2015 00:00:00 GMT", "id": "a49a1a8ec17498e1cfec8ec70236b84f", "content": "SAN ANTONIO — The second suspect in an East Side shooting that left two dead on Martin Luther King Day is back in San Antonio and behind bars, while a third remains at large.\nJacquay Howard, 21, was a arrested in Houston on Friday after more than a month on the run. On Monday, he was extradited to San Antonio, where he will face a charge of capital murder.\nSan Antonio Police Department Spokesman Officer Douglas Greene said Howard is cooperating with authorities in locating the third suspect in the fatal shooting that also injured five people.\nPerkins, 24, is wanted in the deaths of Vontay Jamar Price, 22, and Royal Willrich, 30, who were gunned down on Jan. 19 at a car wash in the 1000 block of Gibbs Street near the intersection of New Braunfels Avenue.\nAuthorities were able to link Howard, Perkins and Edwin Joseph, 35, who was arrested earlier this month, to the shooting through surveillance footage, according to an arrest warrant.\nDuring the shooting, the three suspects could be seen with an AK-47, a .40 caliber handgun, and a .380 handgun, detectives said.\nThe man with an AK-47 allegedly fired several shots into a crowd of people, followed by the man with a .40 caliber handgun, police said. The third suspect was seen firing a single shot.\nIncluding the two dead, seven people were hit, police said.\nPolice identified the men in the footage as Howard, Joseph and Perkins via witnesses and a Crime Stoppers tip.\nSAPD Gang Unit officers believe a Jan. 23 shooting at 118 St. John was a gang retaliation for the Jan. 19 homicides.\nThe U.S. Marshals Service Gulf Coast Violent Offenders Task Force found out Howard was hiding out in the North Side of Houston last week and tracked him to an apartment in the 1200 block of West Tidwell Road.\nOfficers entered the apartment and arrested Howard without incident on Friday.\nTask force officers request the public’s help locating and arresting Perkins. Call 210-657-8500 with information leading to an arrest.\nText \"NEWS\" to 72727 to sign up for breaking news from mySA\nmdwilson@express-news.net\nTwitter: @MDWilsonSA\njbeltran@express-news.net\nTwitter: @JBfromSA"}