{"uri": "http://www.nola.com/crime/index.ssf/2017/01/murder_desire_street.html", "title": "15-year old killed, 13-year old wounded in Desire Street double shooting: NOPD", "dct": "Sun, 22 Jan 2017 17:04:40 GMT", "id": "d6455573a10464b2f98d56beec4ab0c5", "content": "A double shooting on Desire Street left a 15-year-old boy dead and a 13-year-old boy wounded Saturday night (Jan. 21) in the St. Claude neighborhood, according to the New Orleans Police Department. The shooting happened in the 2100 block of Desire.\nJust before 6 p.m. Saturday, officers with the department's 5th District responded to a call of an shooting near the intersection of Desire and North Galvez streets, where they found the dead body of an 15-year-old boy lying on the sidewalk. He had suffered multiple gunshot wounds, police said in a news release issued at 8:15 p.m. Friday.\nA 13-year-old boy who was wounded in the arm during the shooting arrived later by private conveyance at a hospital, detectives learned. No additional information was immediately available from police.\nAround 6:45 p.m, police completely blocked off the intersection of Desire and North Galvez with a crime scene tape. The scene stretched down to North Miro Street. A body lay on the sidewalk beside an empty grassy lot.\nAlbert Greenleaf, who lives nearby, said he was on his way to pick up a pizza at Domino's when he heard about eight shots. He had stopped at the corner of North Galvez and Desire streets to watch officers struggle to set up a screen to block the body from view.\n\"You hear shots all the time like they're firing in the air or something,\" he said. \"It's pitiful.\"\nA woman, who lives nearby and asked that she not be identified, said after the shooting she saw a crowd of at least 30 people huddling around the victims on Desire Street. The crowd \"scattered in all directions\" once police arrived, the woman said. She heard about nine shots.\nAnyone with information about this shooting is asked to call Homicide Detective TJ Williams at 504-658-5300. You may also call Crimestoppers at 504-822-1111 or toll-free at 1-877-903-STOP."}