{"uri": "http://tbo.com/news/breaking-news/search-continues-for-suspects-in-moon-lake-slayings-20150210/", "title": "Fourth victim escaped during Moon Lake slayings, recovering from wounds", "dct": "Tue, 10 Feb 2015 00:00:00 GMT", "id": "01844ca0c9aafb0798831930ef2e77c3", "content": "MOON LAKE — A victim who escaped from a mobile home where three people were killed early Monday also was injured in the attack, but is expected to recover, the Pasco County Sheriff’s Office said.\nAuthorities are not releasing the victim’s name, as investigators Tuesday afternoon still were searching for suspects Christopher Lee Duncan, 26, and Dora Delgado, 38, who are considered armed and dangerous, the sheriff’s office said.\nDuncan and Delgado were last seen driving a blue Ford SUV with Florida license plate CDA A98. Sheriff Chris Nocco said the attack might be drug-related and the victims could have been “targeted.”\nAlso Tuesday, the sheriff’s office identified Louis Wayne Lunceford, 44, as a third victim in the fatal incident. Lunceford’s identity was withheld Monday, as authorities attempted to contact his next of kin.\nVictims Shane Newland, 42, and Justin Huckeby, 25, were previously identified. The victims all died of gunshot wounds, according to autopsies completed Tuesday by the medical examiner’s office, the sheriff’s office said.\nDeputies say the bodies were found inside the mobile home at 9552 Adler St. after they responded to reports of shots fired near Banbury Avenue and Adler just before 5 a.m. Monday.\nAccording to state Corrections records, Duncan was released from state prison in May after serving more than three years of a four-year sentence on charges of possession of a weapon or ammunition by a convicted felon, carrying a concealed weapon or firearm and resisting an officer without violence.\nIn 2007, Duncan served just under nine months of a one-year, four-month state prison sentence for grand theft motor vehicle, state corrections records show.\nAt 6-foot-1 and about 160 pounds, Duncan is heavily inked with tattoos of a spiderweb, skulls and a star on his right arm and the words “Hard Times” tattooed onto both arms, among other tattoos on his arms, legs, right hand and chest, according to jail records.\nCourt records indicate that Delgado has lived in Pasco and Hernando counties in recent years. In 2005, she was charged with battery in a Hernando case, but the charge was eventually dropped, according to the county clerk’s records.\nLunceford, the victim identified by authorities on Tuesday, had recently been charged with several crimes in Pasco, including battery by strangulation, false imprisonment, aggravated battery and attempted sexual battery, according to the county clerk’s records.\nIn March 2014, Lunceford was charged with possession of methamphetamine with intent to sell in Pasco, while in 2012 he was found guilty of loitering or prowling and giving false information to a law enforcement officer, court records show.\nLunceford also had a lengthy criminal history in North Carolina, where he was sentenced to nearly four years in state prison in 2006 on charges related to burglary, grand theft, trafficking in stolen property and leaving the scene of a crash with injuries, records show.\nAnyone with information about Monday’s killings can submit an anonymous tip on the sheriff’s office website or call 1-800-706-2488.\nCrime Stoppers of Tampa Bay has offered a cash reward for information that leads to the arrest of Duncan and Delgado. Crime Stoppers tips can be submitted by calling 1-800-873-8477 (TIPS).\ngfox@tampatrib.com\n(813) 371-1860"}