{"uri": "http://www.nydailynews.com/news/crime/16-year-old-junior-firefighter-fatally-shot-fire-station-article-1.2889171", "title": "16-year-old junior firefighter fatally shot inside fire station", "dct": "Mon, 28 Nov 2016 01:05:00 GMT", "id": "1d8724dc6d92d0fc1df9c304650aec67", "content": "A teenage volunteer firefighter was fatally shot inside a fire station as he prepared for a community light parade Sunday night, officials said.\nThe 16-year-old Brownsville Area High School sophomore was shot and killed inside the Redstone Township firehouse in Fayette County, Pa., fire officials told the WPXI-TV.\nA fire official with the Republic Volunteer Fire Company initially said the shooting was accidental, the report stated.\nA 21-year-old man identified as George Matis, of Republic, was later charged with criminal homicide in the teen’s death, according to the TV station.\nThe boy was not immediately identified and it's unclear if the victim knew the suspect.\nFollowing the incident, firefighters canceled the 'Light Up Night' parade as the community expressed condolences on the department's social media page.\n\"Thoughts and prayers go out for the members of the department, the families and all involved in the tragic incident,\" Facebook user Jay T. Reid wrote.\n\"Station 23 sends our condolences to your department. In deep sadness, RIP Brother, we'll take it from here,\" another user, Kevin Gegerly, wrote.\n\"Sending prayers from a firefighter's sister and aunt,\" user Colleen McLane added.\nOfficials say some firefighters were inside the firehouse preparing for the parade at the time, according to the station.\n\"We are saddened to hear of the loss of one of our students,\" Brownsville School District Superintendent Philip Savini said in a statement, adding that counseling sessions would be available for students and faculty members once classes resume on Tuesday.\nNeither the Republic Volunteer Fire Company nor the Pennsylvania State Police Department immediately responded to a request for comment."}