{"uri": "http://www.wdbj7.com/content/news/Man-charged-with-murder-scheduled-to-be-in-court-Tuesday-398303751.html", "title": "Charges dropped against man accused of killing 1, injuring 10 others at Roanoke bar", "dct": "Tue, 25 Oct 2016 18:04:00 GMT", "id": "2f71bd9043bf25069b1623500830d82a", "content": "ROANOKE, Va. (WDBJ7) Charges have been dropped against a man accused of a shooting at a Roanoke bar that killed one person and injured 10 others back in September.\nProsecutors say at this time, they did not have enough evidence to proceed with charges against Jermaine Brown.\nJermaine Black, 26, died in the shooting on September 4 at Monster’s Bar and Grill on Orange Avenue.\nRoanoke Assistant Commonwealth’s Attorney Joshua Dietz said prosecutors are still waiting for evidence to come back from the state lab. He described the crime scene at Monster’s as complicated.\nOnce more evidence is returned, Dietz said it’s possible that Brown or others could be charged.\nBrown is expected to be released from jail.\nDietz said witnesses have cooperated, but there’s “certainly room for more people to come forward.”\nORIGINAL STORY\nThe man charged with murder in a shooting at Monster's Bar and Grill in Roanoke is scheduled to be in front of a judge.\nIn all, ten people were hurt and one left dead from the shooting in early September. Jermaine Brown is scheduled to be in court Tuesday his preliminary hearing.\nPolice say Brown killed 26 year-old Jermaine Black. The shooting happened at Monster's Bar and Grill on Orange Avenue back on September 4.\nRoanoke Police say people were running out of the building and leaving in cars, arriving at local hospitals throughout that morning. We talked with Jermaine Black's family about his death. Angela Hopson took care of him since he was three. She's still heartbroken about the young life gone too soon.\nAngela Hopson, Caretaker, said, “I have my moments -- but it's like, I know he's never going to come through those doors again, so it's been rough.”\nShe doesn't feel bad at all for the person who allegedly did this.\n“I mean I don't know what to say because he took my son's life,” she said. “I'm very angry when it comes to him. I don't know him, didn't know him, so all I can say is I want justice.”\nQuanisha Pannell, Black’s cousin, said, “We as the family, we need justice. We need answers, and I want to know why.”\nThat hearing is scheduled for 11:00 Tuesday.\nRoanoke City Police say the shooting is still under investigation and additional people may be charged."}