{"uri": "http://boston.cbslocal.com/2016/12/24/child-shot-with-fathers-gun-yarmouth/", "title": "3-Year-Old Yarmouth Girl Accidentally Shoots Herself With Father’s Gun", "dct": "Sat, 24 Dec 2016 18:05:00 GMT", "id": "c64cf81bf206fa5165caa496c942055f", "content": "YARMOUTH (CBS) – A three-year-old has serious injuries after police say she accidentally shot herself with her father’s gun.\nPolice and paramedics responded to a home on Captain Daniel Road on Friday around 1 p.m. and found a 3-year-old girl suffering from a serious gunshot wound in her left hand.\nShe was taken to a Boston hospital. Yarmouth Police said her injuries were very significant, but that she is expected to survive.\nOfficers discovered that the child had found a fully loaded handgun on a nightstand in the bedroom she shares with her parents.\nThey also said the suspect, Nicholas Jenner, 30, is a military veteran who recently moved his family in with his parents temporarily.\n“The father left his weapons unsecured,” said Deputy Chief Steven Xiarhos. “One of them was a handgun on a nightstand, and this tragedy happened.”\nXiarhos said that several unlicensed weapons, including a rifle and a shotgun, were recovered in the home. They seized those guns, as well as the .40 caliber semiautomatic pistol the girl apparently shot herself with.\nInvestigators said Jenner told them the weapons were legal in the state where he previously lived–but police say that’s no excuse.\n“He is going to be charged with several misdemeanors and felonies,” said Xiarhos.\nBut Jenner was not arrested.\n“We chose to not arrest him,” Xiarhos said. “We knew that the weapons were all taken from the home. We know that the girl has been placed in the custody of the Department of Children and Families. So there’s really no danger factor. It’s also Christmastime, and he was very cooperative.”\nJenner is charged with improper storage of a large capacity of a firearm near a minor, unlawful possession of a firearm, and reckless endangerment of a child, and will be summonsed to court at a later date."}