{"uri": "http://www.wfmynews2.com/news/local/six-shot-at-rockingham-county-party/377623246", "title": "7 Shot After Fight At Madison Moose Lodge In Rockingham Co.", "dct": "Sat, 24 Dec 2016 00:00:00 GMT", "id": "870a310cea2c46f3616f91cf3dd541a1", "content": "ROCKINGHAM COUNTY, NC -- The Rockingham County Sheriff's Office is investigating multiple crime scenes in connection to one shooting that happened overnight.\nRockingham County Sheriff Sam Page says they got a call about multiple gunshot victims near the Madison Moose Lodge 1148 just after 2:15 am.\nSheriff Page said 250 to 300 people were attending a private party at the lodge when the fight broke out and shots were fired. There were victims connected to the shooting, but many of them were not found at the lodge.\nPage said they found two shooting victims at the lodge, two at a nearby convenience store, one in the parking lot of Western Rockingham Middle School, one by the Stokes County Sheriff's Office, and the last one was found at Annie Penn Hospital in Reidsville.\nAll seven victims were transported to the hospital, none of them have life-threatening injuries.\nWitnesses describe the shooters as two black men, who were believed to have been in attendance at the party before the shooting started. One was described as wearing a brown Carhartt jacket with black pants and witnesses said he has dreadlocks. The other is described as wearing a green jacket and black pants. Sheriff Page says both were last seen leaving the scene in a silver vehicle (no make or model information available at this time) driven by a black woman.\nSince so many people were in attendance at the party, the sheriff's department believes someone may have evidence or information that can help. Anyone with information is asked to call Rockingham County Crimestoppers at (336) 349-9683 or the Rockingham County Sheriff’s Office at (336) 634-3232.\nStay connected 24/7 via WFMY News 2\nGet the WFMY News 2 App and the WFMY News 2 Weather App free in the Apple store.\nCopyright 2016 WFMY"}