{"uri": "http://www.reviewjournal.com/crime/homicides/coroner-ids-teen-shot-death-las-vegas-apartment-complex", "title": "Coroner IDs teen shot to death at Las Vegas apartment complex", "dct": "Tue, 12 Jul 2016 08:50:00 GMT", "id": "bdef428cf952da117f9cc548de7089bd", "content": "The teenager shot and killed at an apartment complex near the North Las Vegas Airport on Monday has been identified by the Clark County coroner.\nRobert Joseph Bustos II, 17, was shot twice just within the front gates of Alterra Apartments, 2701 N. Decatur Blvd., near Rancho Drive, about 6:30 p.m., police said.\nA man who lives at the complex heard two gunshots and saw a man running from the area when he stepped out of his apartment.\nPolice are looking for two suspects: both Hispanic men wearing T-shirts and shorts. The shooter was wearing a black baseball cap with a ponytail in the back, held together with a rubber band. The other man had a short, trimmed beard, Metro homicide Lt. Dan McGrath said.\nAfter the shooting, the pair ran out of the complex, east toward Rancho, then north, police said.\nA GoFundMe page set up for the teen’s funeral expenses had raised $2,760 as of 8:30 p.m. Tuesday.\n“It is all so surreal,” the post reads. “It is so hard to describe the pain of losing our Robert Jr., who was only 17.”\nIn a video the teen’s father, Robert Bustos, posted to Facebook in February 2014, the teen can be seen wrestling in a match for Palo Verde High School, where he wrestled his freshman year, according to the team’s 2013-2014 Nevada Preps roster.\n“That’s my boy,” the father’s post read.\nBustos’ death was the 95th confirmed homicide Metro has investigated so far this year.\nAnyone with information is asked to call Metro’s homicide unit at 702-828-3521 or Crime Stoppers at 702-385-5555.\nReview-Journal writer Lawren Linehan contributed to this story.\nContact Rachel Crosby at rcrosby@reviewjournal.com or 702-387-5290. Find @rachelacrosby on Twitter."}