{"uri": "http://www.wzzm13.com/news/local/grand-rapids-south/grand-rapids-police-respond-to-shooting-with-multiple-victims/331772322", "title": "1 person killed, 8 hurt in overnight shooting at party on 28th Street", "dct": "Sun, 09 Oct 2016 00:00:00 GMT", "id": "53baa4f54ad41f8cabb320a92517e003", "content": "GRAND RAPIDS, MICH. - Update: Grand Rapids shooting victim, 21, identified; 8 injured people to live\nGRAND RAPIDS, Mich. -- Grand Rapids Police are investigating a shooting with multiple victims, including one death, on the city's Southeast Side.\nSgt. Terry Dixon says at least nine people were shot at a large party inside the Clearance Outlet store on 28th Street near the intersection with Kalamazoo Avenue. They are still looking for a suspect.\nPolice say one person, a man in his early 20s, was found dead inside the building. The remainder of the victims are in various conditions at local hospitals.\nPolice say the initial call came in at around 3:45 a.m. Sunday, Oct. 9, 2016. They were responding to a noise complaint before learning of the shooting.\nA witness said the gathering was supposed to be a small birthday party, with everyone knowing each other.\n\"Literally as soon as I came out and hit the corner, I heard a round of gunshots,\" said Tyresha Moody, who attended the party. \"I ran to my car, and people (came) just rushing out, rushing out. ...\n\"... Everybody knew everybody in the party. So, it's not like new people came out. It was such a good vibe, like, everything was good. (Then 3:45 a.m.) came, everything changed.\"\nA manager said he allowed an employee to throw the party at the store last night.\nThere is still a large police presence in the area.\nThe police department’s Major Case Team is investigating. If anyone has any additional information, please call 616-456-3400 or Silent Observer at 616-774-2345.\nThis is a developing story. WZZM 13 has a crew on the scene and will bring updates as they become available.\n(© 2017 WZZM)"}