{"uri": "http://www.pennlive.com/news/2016/03/hummelstown_shooting_death_was.html", "title": "Hummelstown teen's shooting death ruled accidental", "dct": "Thu, 31 Mar 2016 13:59:00 GMT", "id": "b67237ffba3632f26b2659d7fd4c4933", "content": "The shooting death of a 14-year-old boy in Hummelstown in January was ruled accidental, officials say.\nCoroner Graham Hetrick said Thursday that Caleb Wehry's death was accidental, due to mishandling of a gun.\nCaleb died of a gunshot wound to the chest, said Sgt. William Ryan, acting Hummelstown police chief.\n\"He was handling the gun and it went off,\" Ryan said. The gun, a Taurus .410 handgun, belonged to someone who lived in the house, Ryan said.\nNo criminal charges will be filed in the case, said Ed Marsico, Dauphin County district attorney.\n\"From our perspective, yes, it was accidental,\" Marsico said of the shooting death. \"He was playing around with it, for lack of a better term,\" Marsico said. \"He was showing it to a friend, playing with it.\"\n\"It wasn't anything formal, like Russian Roulette. He was mishandling a gun, and it was just a total tragedy,\" Marsico said.\nHetrick urged people who own guns to be careful to secure them, \"especially with young people in a house.\"\nCaleb's mother, Sara Good, told the Hummelstown Sun shortly after the incident that her son's death was an accident and that he didn't take his own life.\nThe mother of the 14-year-old boy who died of a gunshot Jan. 14 in Hummelstown told the Hummelstown Sun that her son's death was an accident.\nThe Dauphin County criminal investigation division and the district attorney investigated and concluded the death was accidental, Ryan said.\nRyan said he doesn't know why Caleb had the gun out but said it wasn't part of a game. A friend was with Caleb at the time of the shooting but wasn't involved in the death, Ryan said.\nCaleb's family has said he loved fishing, and in his memory, a memorial youth fishing club is forming for youth 9-17.\nThe first meeting will be at 3 p.m. April 3 on the second floor of Bass Pro Shops at the Harrisburg Mall. A parent must accompany the youth attending. The club will instruct youth on how to fish and take part in tournament fishing.\nAlso, a Caleb Wehry Memorial Youth Team Bass Tournament has been set for 6 a.m. Sept. 17 at Shikellamy State Park & Marina, Sunbury.\nThe inaugural tournament is for youth in grades 3 through 12. Teams must consist of either two high school students from the same school and one adult boat captain or two students from grades 3-8 with one adult boat captain. There will be prizes for the winners of each grade group and the winning boat captains.\nThis story has been updated to correct grammatical errors."}