{"uri": "http://www.toledoblade.com/Police-Fire/2015/02/22/Toddler-shot-in-South-Toledo.html", "title": "Toddler shot in South Toledo", "dct": "Sun, 22 Feb 2015 00:00:00 GMT", "id": "69496caab8b2167ac491699149012d10", "content": "Up and down Prouty Avenue, a woman in a black winter jacket spread the news to her neighbors that a 3-year-old girl had been shot in the stomach.\nThe little girl had, by that point, been rushed to Mercy St. Vincent Medical Center by Toledo Fire Department paramedics. The woman, who declined to be identified, said she saw the girl carried out of 533 Prouty wrapped in a blanket. To her, she did not look conscious.\nThe girl’s condition was not known Saturday afternoon nor were the shooting’s circumstances. About 90 minutes after the shooting was reported, Toledo police Sgt. Joseph Trudeau said the girl, whom he did not identify, was in surgery and her mother was with her at the hospital.\nJust after 4 p.m., police led a man described as the girl’s father out of the orange South Toledo duplex and escorted him to a waiting police wagon. A man inside a black vehicle pulled up next to the police wagon and yelled to the man, whom he identified only as Michael, “Do not say a word. Not a word.”\nThe man in police custody was not handcuffed but, as he got into the vehicle, said a gun “went off,” and the girl was hit. Sergeant Trudeau said no one else in the home was injured.\nPolice were called for a person shot at about 1:45 p.m. Shortly thereafter, an updated broadcast told the detective the victim’s age.\nJohnathan Byrd, who was visiting a friend who lives next door to 533 Prouty, said he and his friend were talking when they heard a single gunshot.\nAt first the two thought the noise was from a television show but realized the gunfire was real when an ambulance arrived out front.\n“I would like to know what happened,” Mr. Byrd said as he walked the two blocks home through snow.\nAs officers went in and out of the duplex’s lower unit, other children could be heard inside. Occasionally they would be heard crying and screaming, and later they were heard laughing.\nWhen one police officer walked out of the front door, a small voice yelled, “Bye!”\nThe officer peered into garbage and recycling bins against a neighboring home, then appeared to check a snow mound for evidence.\nFor almost three hours Saturday, as they shoveled sidewalks in front of their homes, neighbors quietly speculated about what could have happened.\nThe girl is the second Toledo toddler to suffer a gunshot wound this month. On Feb. 6, 2-year-old Marquise Hudson, Jr., was shot in an apparent gang-related drive-by in the 200 block of Maumee Avenue, only blocks from Saturday’s scene.\nThe shot that hit Marquise first shattered a glass front door of the Maumee Avenue home. It passed through his arm and lodged in his stomach. The toddler most recently received treatment at C.S. Mott Children’s Hospital at the University of Michigan. Relatives said the boy lost a kidney during his initial treatment.\nNo arrests have been made. Police ask that anyone with information call Crime Stopper at 419-255-1111.\nContact Taylor Dungjen at tdungjen@theblade.com, or 419-724-6054, or on Twitter @taylordungjen.\nPoints of Interest"}