{"uri": "http://wsls.com/2016/11/18/police-investigating-homicide-in-danville/", "title": "Police: 15-year-old Danville boy shot and killed", "dct": "Fri, 18 Nov 2016 07:29:00 GMT", "id": "24d8db521ae651947d6cdb59d3721f59", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nDANVILLE (WSLS 10) – Danville police say a 15-year-old boy was shot and killed Thursday night.\nSean Antwan Clayborne, 15, of Danville was found Thursday night, suffering from apparent gunshot wounds.\nAs of Friday afternoon, police were still investigating.\nThe shooting happened just before 11:30 p.m. Thursday behind the old Highlander Restaurant, Lodge & Pub.\nOfficers got a call about 11:25 p.m. for shots fired in the 100 block of Piney Forest Road.\nWhen they got on scene, they found the boy.\nHe was pronounced dead by EMS.\nInvestigators were back at the scene late Friday morning canvassing the surrounding area.\nAs of Friday afternoon, it was not known what may have led to the shooting.\nThe police department did have a few leads on possible suspects, and for that the department was thanking the community.\n“We count on them, especially in a situation where you don’t know the persons involved,” Danville Police Department Lt. Mike Wallace emphasized. “We count on the community giving us some help. We’re only as effective as the people who help us a lot of times.”\nThe victim’s body was being taken to the medical examiner’s office in Roanoke for an autopsy.\nAnyone with information is asked to call Crimestoppers at (434) 793-0000.\nHe previously waived his right to be indicted and pleaded…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}