{"uri": "http://kxan.com/2016/04/15/driver-shot-by-stray-bullet-in-burnet-county/", "title": "Driver shot by stray bullet in Burnet County, 3 teens arrested", "dct": "Fri, 15 Apr 2016 14:08:00 GMT", "id": "1b9034d4afc638f9a48603bef377d95b", "content": "BURNET COUNTY, Texas (KXAN) — A man who was driving along a county road in Burnet County was hit by stray bullet on Wednesday.\nThe Burnet County Sheriff’s Office say the man was driving in the 1200 block of County Road 304 around 10 a.m. when he thought something “exploded” and caused injury to his hip. When emergency crews responded, they determined he was actually hit by a bullet.\nDuring the investigation, deputies were able to identify three teenagers who had been target practicing with a rifle in the area. Authorities discovered two of the teens were shooting a .308 caliber rifle into some trees. One of the rounds fired missed its intended target and continued west, for approximately 150 yards, before striking the passenger door of the passing vehicle.\nThe three suspects, Ronald Mason Reynolds, 18; Cruzito Joe Solis, 17; and Richard Phillip Spradling, 18, were initially arrested for a misdemeanor possession of marijuana. Reynolds and Spradlin were also charged with aggravated assault causing serious bodily injury.\n“Persons need to consider where a bullet may travel before engaging in shooting a firearm,” said Burnet County Chief Deputy Joey Canady in a press release. “The reckless actions of the individuals could have caused much more serious injuries or death to the victim.”\nThe victim was taken to the hospital and is expected to recover.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}