{"uri": "http://www.cleveland.com/metro/index.ssf/2016/08/cleveland_man_arrested_in_conn_2.html#incart_m-rpt-1", "title": "Cleveland man arrested in connection with drive-by shooting of 2-year-old girl", "dct": "Mon, 01 Aug 2016 20:33:00 GMT", "id": "1f54fc477eecc83832580dc12e2e3560", "content": "CLEVELAND, Ohio -- A man charged in connection with a drive-by shooting that left a 2-year-old girl blind in one eye was arrested Monday in Canton.\nJeJuan Burns, 19, is charged with felonious assault in connection with the July 15 shooting of 2-year-old Alaya Brown at her home in the 4100 block of East 146th Street.\nU.S. Marshals arrested Burns about 4 p.m. Deputy marshals said they gathered information Monday that he was hiding in the Canton area and zeroed in on a home in the 900 block of Highland Road N.E.\nA K-9 officer tracked Burns to the basement of a home. He will be held in the Stark County Jail until he's brought to Cleveland to face charges.\n\"A brave little girl who suffered a gunshot wound to the head was all the motivation the men and women of the Cleveland Police and the U.S. Marshals needed to hunt this reckless fugitive down,\" said Northern Ohio U.S. Marshal Pete Elliott. \"We continue to join Alaya's family in prayer as she battles for recovery.\"\nBurns is accused of being the getaway driver in the incident, according to court records. He pulled up to the home to talk to a resident, court records say.\nA second car pulled up next to Burns' car. A passenger of Burns' car fired several gunshots.\nAlaya was outside in her 21-year-old mother's arms when a bullet struck the toddler in the arm and head, a family member previously said.\nBurns then drove off and went into hiding, according to court records and Elliott.\nThe bullet cracked the girl's skull. The right side of her brain is dead and she's now blind in one eye, according to the family member. She had brain surgery at University Hospitals Rainbow Babies and Children's Hospital the day of the shooting.\nAlaya was born premature and has battled epilepsy and diabetes for her entire short life, family members said.\nShe had trouble walking and talking, and seizures before the shooting.\nAlaya was one of 92 people shot in Cleveland in July. She is the youngest shooting victim that month.\nBurns entered a drug treatment program that could have erased his felony conviction for stealing a car in February. Part of the program stipulates that Burns commit no more crimes or the conviction could be reinstated.\nIf you wish to discuss or comment on this story, please visit our crime and courts comments section."}