{"uri": "http://www.ohio.com/news/break-news/13-people-shot-in-cleveland-friday-and-saturday-1.697752", "title": "13 people shot in Cleveland Friday and Saturday", "dct": "Sat, 16 Jul 2016 19:05:00 GMT", "id": "537b9e8b3276134425dbfb6944fb019a", "content": "CLEVELAND: Thirteen people were shot in seven shootings reported Friday night and early Saturday morning including five who were shot outside the Agora Theater and Ballroom, Beacon Journal news partner Newsnet5 reported.\nAkita Campbell, 29, died and a 2-year-old remains in intensive care after two separate drive-by shootings on the city’s East Side on Friday, police said.\nThe toddler was shot in the head and arm during a drive-by shooting in the 4100 block of East 146th Street around 7 p.m. Friday. The family is identifying the little girl as Alaya Brown, Newsnet5 reported.\nAlaya was transported to Rainbow Babies & Children’s Hospital and underwent emergency surgery.\nAccording to family members, she was awake and moving her legs Saturday afternoon. She’s being kept in the PICU unit at the hospital.\nAccording to Cleveland police, at 8:40 p.m. Friday, a 24-year-old man was shot in the back on Phillips Avenue.\nAround the same time, Akita Campbell was shot multiple times in the back and legs. Police say she was walking in the area of East 117th Street and Sellers Avenue when a group of men drove by and one of the men fired shots from the vehicle. The car is described as being light colored with four doors.\nCampbell was transported to University Hospital where she was pronounced dead.\nAt 1:20 a.m., a man was shot multiple times at East 30th Street and Superior Avenue. He was taken to University Hospitals.\nAround 2 a.m. five people were shot outside the Agora theater. Police say casings from multiple guns were found at the scene. One person was transported to MetroHealth Medical Center for treatment, two were taken to Cleveland Clinic and two were taken to University Hospital.\nAround 3 a.m. a man was shot in the area of East 64th Street and St. Clair Avenue. He was taken to University Hospitals.\nJust before 4 a.m., two males and one female were shot at East 55th Street and Payne Avenue. No futher information was provided.\nPolice say all victims and witnesses are uncooperative, Newsnet5 said. No suspect information has been released. According to police, the shootings are not believed to be RNC-related."}