{"uri": "http://abc13.com/archive/9334256/", "title": "Police ID suspect accused of killing 3, injuring 2 others in NW Harris County", "dct": "Fri, 22 Nov 2013 04:19:56 GMT", "id": "79ef3d6cca95f03adba351c4b8d53e62", "content": "HOUSTON --\nDetectives have identified a suspect in the northwest Harris County apartment shooting that killed three people and injured two others.\nJohnathan Sanchez, 25, is charged with capital murder. Sanchez, who's also known as \"J Boi,\" has not yet been arrested.\nThe shooting happened Wednesday afternoon at a studio apartment in the 8200 block of Sunbury in the Copperfield area.\nNeighbor Tristan Coleman says he was upstairs when he heard about six gunshots firing from the apartment below.\n\"Like the first 2 shots, it sounded like loud knocking; then I knew after the third one, it was gunshots. Then I heard a door slam,\" he said.\nSheriff's department sources tell Eyewitness News the victims were sitting on a couch and killed one by one. All three of the victims were shot in the head, and were each shot multiple times. Aside from the three deceased victims, two other people were also shot. They were flown by Life Flight to Memorial Hermann Hospital. Both were listed in critical condition.\n\"We have found other weapons and substances that we believe to be narcotics in the apartment,\" said Harris County Sheriff Adrian Garcia.\nThe slain victims has been identified as 17-year-old Veronica Hernandez, 21-year-old Yosselyn Alfaro and 17-year-old Daniel Munoz.\n\"He was like a brother to me. He was a sweet person, never disrespectful to any of our family members or anything,\" Munoz's cousin, Viri Ortega said.\nAt this time, detectives are still investigating what caused the suspect to shoot five people. However, authorities said the victims have connections to gangs in the area.\nMunoz's family said he had fallen in with a rough crowd, but that he was not a gang member. After a stint in juvenile detention, they felt he had found God and could have accomplished anything.\n\"We're just sad that he was taken from us so quickly and that we didn't have a proper goodbye or enough time with him,\" Ortega said.\nDetectives say Sanchez allegedly has ties to a well-known street gang.\n\"Coming home, we used to see, like, a lot of people just posted up right by the stairs, or just hanging out like they just didn't belong here,\" Coleman said.\nThe shooting has left neighbors on edge, and their biggest fear...\n\"My life, you never know. You don't know if he's still around here, or if he -- you just don't know at all,\" neighbor Shaneika Mumphrey said.\nAnyone with information about Sanchez's whereabouts is asked to contact Crime Stoppers of Houston at 713-222-TIPS (8477).\nCrime Stoppers will pay up to $5,000 for any information called in to the 713-222-TIPS (8477) or submitted online at www.crime-stoppers.org that leads to the filing of felony charges or arrest of the suspect in this case. Tips can also be sent by text message. Text TIP610 plus your tip to CRIMES (274637). All tipsters remain anonymous."}