{"uri": "http://www.chron.com/neighborhood/cyfair/crime-courts/article/3-killed-2-wounded-in-shooting-at-apartment-4996946.php?cmpid=hpbn", "title": "3 killed, 2 wounded in shooting at apartment", "dct": "Sat, 23 Nov 2013 00:00:00 GMT", "id": "8d1841c836f7536301ae25c79c21c97f", "content": "A gunman shot five people in the head on Wednesday, killing three, at a northwest Harris County apartment complex.\nAll were in their late teens or early 20s, officials said, and the shooting is at least the third in the last two weeks to take the lives of local teens.\nOn Nov. 9, two teens were killed and 20 people injured in a shooting at a house party in the Cypress area. On Sunday, a 17-year-old died and three others injured at a party in southwest Houston. Both parties had been promoted on social media.\nIn Wednesday's shooting, two female victims, one 18 years old, and a 20-year-old man were killed. The injured, a man and a woman, were taken via Life Flight helicopter ambulance to the Memorial Hermann Hospital trauma center, according to Memorial Hermann spokeswoman Alex Rodriguez. They were in critical condition late Wednesday, said Harris County Sheriff Adrian Garcia.\nOfficials believe the two are the only witnesses to the deaths.\n\"Once they get out of harm's way, hopefully they'll have more information for us,\" the sheriff said.\nThe gunman was in the apartment at Peppermill Place, in the 8200 block of Sunbury in the Copperfield area, when he opened fire about 4:25 p.m., deputies said. Someone in the complex reported hearing gunfire. Authorities were told the gunman shot the five, closed the apartment door, then fled.\nAuthorities said they do not have a description of the shooter and have not determined a motive, but did disclose that weapons and drugs were found inside the apartment.\nIdentities of the dead or wounded were not available.\nSheriff Garcia said late Wednesday that all of the five were shot several times. Deputies at the scene said the victims were seated and had been shot in the head.\nGarcia wouldn't say whether they were tied up.\nResidents at the complex, one of several in the area, were tense after the shooting.\nReanna Auclair, who lives in the complex, said she was startled by the sirens and other commotion.\nShe said other similar violent incidents have occurred at the complex, where she lives with her daughter.\n\"I'm out of here. I'm a single mom. I can't have that kind of stuff going on,\" Auclair said.\n\"I just don't feel safe here anymore.\"\nTerry Noisom has been a resident for about 13 years. She said the apartments have gone downhill in the past three or four years.\n\"It's gotten quite bad. I just want out of here,\" she said.\n\"You can walk through here in the middle of the night and make a drug deal,\" Noisom said."}