{"uri": "http://www.ketv.com/article/black-friday-2016-tips-how-to-survive-the-post-thanksgiving-shopping-holiday/8349415", "title": "Black Friday 2016 tips: how to survive post-Thanksgiving shopping holiday", "dct": "Tue, 22 Nov 2016 13:31:00 GMT", "id": "4d9e746420162375cecb391cff2c91f8", "content": "Black Friday is almost here, a day when an estimated 137.4 million shoppers flood malls, shopping centers, outlets and retail stores in search of the best deals. Before you venture out into the madness, assess your situation and goals. The post-Thanksgiving holiday comes once a year and you don't want to miss anything. Check out our favorite tips for surviving the third most popular shopping day of the year.\nHave a plan. Don’t wait until you’re in the Target parking lot to Google the best deals for that flat screen TV you're eyeing. Research deals with online retailers like Amazon and retail chains such as Walmart for products that offer similar options in your price range before the big day. Sometimes older items receive massive price cuts simply because they’re not currently a store’s big-ticket item. Be open-minded and flexible. You may not be able to grab that soldout 48” television, but you can still watch “Game of Thrones” on a 42” screen and save a few bucks. This brings us to point number two.\nSet a budget. The average person spent $300 on Black Friday in 2015, according to the National Retail Federation. In 2014, consumers spent approximately $380.95 each. Black Friday’s a great time to save big bucks, but many spend more cash than planned on unnecessary purchases. Sure, that premium ice cream maker looks cool, but don’t kid yourself. You don’t need it. Set a budget and stick to it.\nSign up for e-mail alerts from your favorite stores. Retailers like Target, Walmart, Sears and Best Buy send subscribers exclusive deals via email. Don’t forget specialty stores like Old Navy, Ulta, GameStop and Barnes & Noble. Some offer discounts that begin on Thanksgiving and last all weekend.\nKeep your phone charged. Coupons can be easily downloaded on your mobile device. If the battery life on your smartphone is iffy, bring an extra car charger or external battery.\nKeep receipts. Put them all in an envelope and make sure all purchases all accounted for on your credit card bill. If you’re buying gifts for friends and family, make sure to ask salespeople for gift receipts.\nCome prepared. Bring extra bottles of water and snacks. Items like squeezable yogurt, string cheese, apples, protein bars, crackers and nuts will be easy to grab when you’re driving or walking from store to store. Plan meals if you have to, but it’s better to eat a large meal before you leave and again when you return home.\nLighten up. Don’t get too caught up in the post-Thanksgiving madness. The ubiquitous shopping day has caused a number of deaths and injuries. A Walmart employee was killed during Black Friday after being trampled in 2008. Last year, a Progressive Insurance report claimed that car accidents spike 34 percent during the week of Thanksgiving. Be smart. If you see someone who needs help, lend a hand. And don’t take Black Friday too seriously. Remember, if you don’t find everything you need, Christmas is right around the corner."}