{"uri": "http://yaledailynews.com/blog/2013/10/28/six-shot-at-nightclub/", "title": "Six shot at nightclub", "dct": "Mon, 28 Oct 2013 00:00:00 GMT", "id": "b13a243abd656caecaf1e426ce3bee52", "content": "At 3:31 a.m. on Saturday, shots were fired inside the Key Club Cabaret on 85 Saint John St., and over 100 patrons rushed out of the club’s main doors, giving way to several New Haven Police Department officers. They found six gunshot victims inside.\nContinuing a recent trend of violence in the city’s nightlife, five were wounded and Erica Robinson, a 26-year-old West Haven resident, was killed at the nightclub. The incident increased the Elm City’s 2013 homicide count to sixteen.\nIt appears that Robinson was not the intended victim of the shooting, and investigators believe that they have identified the shooting’s true target, said NHPD Chief Dean Esserman. NHPD detectives have interviewed several witnesses, though an official suspect has not been named.\n“I offer our condolences to [Robinson’s] family for this completely senseless murder,” Esserman said at a Saturday press conference. “I believe that New Haven Police detectives will honor the promise we made [to her] father and mother this morning in the emergency room when they asked us to please bring justice to this guy.”\nAll available NHPD officers, along with many firefighters and emergency medical technicians from the New Haven Fire Department, were dispatched to the scene immediately following the incident. The shooting took place in the Key Club’s “after-hours” area, where patrons are allowed to bring alcohol after 2 a.m., when the club is required to stop serving liquor. Drug paraphernalia and packaging were found at the scene, which reeked of marijuana, according to a Saturday press release from the NHPD.\nJahad Brumsey, a 29-year-old New Haven resident, remains in critical condition. Additionally, one victim — 19-year-old Amanda John — was underage.\nThe incident was captured on video, which has helped the investigation move “very rapidly,” Esserman said. Also speaking at the press conference were New Haven Mayor John DeStefano Jr. and Connecticut Governor Dannel Malloy. Despite increased security, DeStefano warned that the nightclub scene in New Haven is becoming increasingly dangerous. Four of this year’s homicides have been nightclub-related shootings.\n“To not see the connection with the clubs is to misunderstand what is happening. With these clubs … there’s an environment that contributes to the risk of the people who are in it or near it,” DeStefano said.\nDeStefano proceeded to discuss the various security measures imposed on local nightclubs. One such measure is a requirement for licenses such as the Key Club’s cabaret license, which allows for after-hours areas like the one where Saturday’s shooting took place. DeStefano also said that the city cannot currently afford to station police outside all New Haven nightclubs, even though on Saturday there was a police officer stationed directly outside of Key Club Cabaret. DeStefano said he has sought the authority to levy a fee on nightclubs to increase police presence.\n“As we think about not only dealing with this issue, but how we can prevent this from happening, we can do more as a community to engage the club owners, particularly those who are not responsible,” DeStefano said.\nDeStefano said that in light of this incident, addressing the recent spike in nightclub-related violence has become increasingly important.\nMalloy also shared plans for stricter nightclub standards throughout the state, citing protocol in cities like Hartford that have sought to address similar issues of nighttime violence at entertainment venues. The governor said that he is ready to work with DeStefano, Esserman and other local leaders to pass stricter laws for nightclubs statewide.\n“Although any number of homicides is too many, we are making some progress over the last two years in New Haven,” Malloy said. He added that the state has already begun measures to improve public safety, such as Project Longevity.\nMalloy closed the conference by encouraging parents to carefully consider the dangers of the nightclub scene and situations like this before allowing their children to visit such places. He added that there is no reason for underage patrons to be at these clubs late at night.\nTen of 58 New Haven shootings in the past year, including fatal and nonfatal, have occurred at nightclubs."}