{"uri": "http://www.reviewjournal.com/news/las-vegas/teen-indicted-execution-16-year-old-girlfriend", "title": "Teen indicted in 'execution' of 16-year-old girlfriend", "dct": "Wed, 18 Nov 2015 15:01:00 GMT", "id": "c1063d545330e782152eb13c6e86b818", "content": "A teenage boy executed his live-in 16-year-old girlfriend inside their North Las Vegas home, prosecutors said Wednesday.\nCasey Olaf Sandoval was indicted this week on one count of murder with use of a deadly weapon after a medical examiner determined that the .22-caliber handgun was pressed up against the back of Ariele Azrate-Lujan's head when she was shot Oct. 15.\nSandoval, who also was 16 at the time of the shooting, told police two different stories about what happened, according to Chief Deputy District Attorney Marc DiGiacomo. When police first arrived at the home at 3302 Bridge House St., Sandoval said he had left the bedroom, heard a noise and found his girlfriend on the floor, bleeding.\nAfter officers pressed Sandoval further, his account changed.\nHe told police he found the gun, started playing with it and asked Azrate-Lujan to leave the room after he noticed a live round in the chamber. When she bent over to pick up her cellphone, about 4 feet away, the gun discharged, and she fell to the ground, he said.\n\"I got scared and didn't want to tell anybody what happened,\" according to the prosecutor's account of what Sandoval said.\nInitially, the medical examiner's office did not make a ruling on the manner of death. But on Tuesday, a medical examiner told a Clark County grand jury that soot from the gunshot was found inside the girl's skull, meaning the weapon was \"indisputably pressed directly against back right of the victim's head and discharged,\" DiGiacomo said.\n\"There's just simply no question that this is an execution,\" DiGiacomo said. \"Now, why it is, none of us know at this point.\"\nSandoval said there was no argument. Family members in the house told police they heard no gunshot before Sandoval yelled out, \"it's an accident, it's an accident,\" according to the prosecutor.\nAzrate-Lujan was rushed to University Medical Center, where doctors discovered the gunshot wound and a bullet lodged in her left temple, and the girl later died.\nSandoval's lawyer, Kristina Wildeveld, rejected the prosecutor's allegation that the killing was an execution.\n\"We personally delivered to the Clark County District Attorney's office information that would have led any reasonable person to understand the accidental nature of this tragedy,\" Wildeveld said. \"When confronted as to why he (DiGiacomo) didn't present that information to the Grand Jury as required by law, the prosecutor laughed, suggesting if he didn't see it, it doesn't exist. It does exist and the fate of a 16 year old child is no laughing matter.\"\nChief Judge David Barker ordered Sandoval held without bail.\nContact David Ferrara at dferrara@reviewjournal.com or 702-380-1039. Find him on Twitter: @randompoker."}