{"uri": "http://www.hawaiinewsnow.com/story/31917736/legal-expert-says-accused-puna-murderer-could-try-insanity-defense-if-charged", "title": "Police charge Puna man in fatal shooting of woman, 2 children", "dct": "Sun, 08 May 2016 18:42:00 GMT", "id": "510c6e43481c709b2f47fd5a23f26713", "content": "PUNA, BIG ISLAND (HawaiiNewsNow) -\nPolice have charged the 49-year-old Puna man accused of killing a woman and two children with first-degree murder, three counts of second-degree murder and a firearms charge.\nJohn Ali Hoffman's bail was set at $2.75 million.\nPolice said he remains at the Hilo police cellblock, pending his initial court appearance Monday.\nOn Saturday, Hawaii Police Department's Criminal Investigation Division and Crime Lab executed a search warrant of Hoffman's Leilani Estates home.\nPolice said they were called to the rural Leilani Estates subdivision about 1:30 a.m., after getting a report about a disturbance. When they arrived, police stopped Hoffman, who was driving away from his Moku Street home without his lights on.\nPolice said they arrested Hoffman after seeing a gun in his front seat. Officers then spotted blood dripping from the trunk of the car, and found the woman's body inside. Police said she had been fatally shot.\nPolice then checked the home where the reported disturbance happened and found the bodies of two children, a boy and a girl. Both of them also died of gunshot wounds.\nThough there has been no official confirmation of the victim's identities, the Honolulu Star-Advertiser reports Hoffman's sister, Sumayah Hodges, identified the victims as her brother's wife, Aracey, and their children -- 8-year-old Clara Mae \"C.J.\" and younger brother John IV.\nChristina Nelson, who was in a class at Hawaii Community College with Hoffman in 2010, tells Hawaii News Now that Hoffman always appeared to be struggling with something.\n\"He was one of those people you have empathy for because you know they have some type of struggle they're going through that they need help with, but you just don't know how to help them,\" Nelson said.\nOn Monday, Hoffman posted a rambling video on Facebook about land ownership.\n\"The truth is I have been systematically oppressed. Deprived of life, liberty and the pursuit,\" Hoffman said, in the video.\nCourt documents show Hoffman signed an agreement of sale for a piece of land in Fern Acres on Hawaii island a few years ago. He built a shack on the property and moved in his family.\nA few months later, he stopped paying. He resisted eviction by the owners and was arrested for criminal trespass in February 2015.\nSources say Hoffman has been fighting the lawsuit and the criminal cases with paranoid accusations that there was a plot among the judges and attorneys to murder him. In late April 2016, a judge ruled the case over and no more motions would be accepted from Hoffman.\n\"I have only tried to save my family,\" Hoffman said, in the Facebook video. \"You can not build a home in the state of Hawaii without being a property owner.\"\nExperts say there is a high chance Hoffman could enter a plea of not guilty by reason of insanity in the triple homicide.\n\"When you look at the rants and stuff on Facebook, when you look at the filing in court basically saying judges are conspiring to have him murdered etc., it indicates there's something wrong mentally,\" said Kenneth Lawson, Criminal Law professor at the University of Hawaii at Manoa.\nCopyright 2016 Hawaii News Now. All rights reserved."}