{"uri": "http://www.miamiherald.com/news/local/community/miami-dade/north-miami/article109417577.html", "title": "Drive-by shooting that wounded an 8-year-old, 2 others has neighborhood on edge", "dct": "Thu, 20 Oct 2016 13:56:00 GMT", "id": "e704a0046745e0d77962b339753086a4", "content": "North Miami police say they don’t know what prompted a drive-by shooting at an apartment building that wounded two adults and an 8-year-old.\nThe only description they have of the gunman is of his transportation, a dark car. Assistant Chief Neal Cuevas said the three who were shot were together in the courtyard of the one-floor building at 1298 NE 128th St.\n\"The group was targeted,\" he said. \"They didn't have any idea who shot at them or why.\"\nHerald news partner CBS4 reported 18-year-old Jean Louis Mardochee suffered a gunshot to his left arm and 8-year-old Childer Joseph took a bullet to the leg. Both were released from the hospital. A 35-year-old woman who lives across the street also was hit.\nMardochee said he didn’t think he was the target.\nAfter returning from school dropoff Thursday morning, a father in the neighborhood said children were playing in the courtyard Wednesday night while Mardochee sat outside the courtyard entrance, closer to the corner of Northeast 128th Street and 13th Avenue. He said Childer came from Haiti a few weeks ago and often played with his children.\nA single chair sat just inside the courtyard entrance Thursday morning. Elements of child’s play — plastic faux kitchen, cars, a basketball — dotted the courtyard grass and the surrounding sidewalk.\nThis kind of gun violence occurred “over there and over there,” said the father, who did not want to be identified, flinging an arm east then south. But he said there have been no other shootings in the area, blocks north of 125th Street and behind William Jennings Bryan Elementary School, at least in his five years there.\nAnother father, preparing to take his kids to school after working a night shift, said he’d like to see more police cars patrolling the area.\n“My wife just told me about it. It’s very concerning,” he said, looking toward 125th Street. “I have kids. It could’ve been any of our kids. You see the school right there. We have kids walking around.”\nDavid J. Neal: 305-376-3559, @DavidJNeal"}