{"uri": "http://pittsburgh.cbslocal.com/2014/08/02/1-killed-4-more-wounded-in-strip-district-shooting/", "title": "Suspect Sought After 1 Killed, 5 More Wounded In Strip District Shooting", "dct": "Sat, 02 Aug 2014 17:20:00 GMT", "id": "67b22bd9cfa3c0a7f6f36fa17dde4cee", "content": "PITTSBURGH (KDKA) – Police are looking for a suspect after an argument, reportedly over loud motorcycles, led to an overnight shooting in the Strip District that left one person dead and five others wounded.\nIt happened around 1 a.m. at Penn Avenue and 29th Street, outside of Art’s Tavern.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nOne victim died at the scene, 40-year-old Tyrone Tomman of Penn Hills. Two others were taken to the hospital.\nThree more victims showed up at local hospitals, including one at Children’s Hospital.\nPolice collected more than 20 shell casings from the hail of bullets.\nPolice say it started when four men from the North Side got into an argument with members of the Pittsburgh Gentlemen’s motorcycle club.\n“A group of four other people, who claim they were from the North Side, were complaining about their motorcycles being too loud and they were taking parking spaces,” said Lt. Daniel Herrmann, of Pittsburgh Police.\nAn argument inside eventually led to gunshots in the street.\nTomman died next to his motorcycle. Police say another victim is in critical condition. The other victims are all believed in stable condition with various gunshot wounds. All of the victims are between the ages of 38 and 44.\nPolice say they believe the gunmen left the area firing shots from a black SUV.\nThe same black SUV was found burning in the 500-block of Francis Street in the Hill District.\n“It was engulfed in flames,” said Lt. Herrmann. “We went to that scene believing it was part of our shooting incident, and we believe it was part of our shooting incident.”\nPolice aren’t sure if anyone in the motorcycle club fired shots. The club is not known for any criminal activity.\nPolice say they are looking for at least one suspect, a black male, 6-feet-7-inches tall and weighing approximately 240 to 250 pounds.\n“He was seen yelling at the victims about their motorcycles,” Lt. Herrmann said. “It’s a very descript, physical description of a 6-foot-7 gentleman.”\nPolice don’t think the bar itself had anything to do with the shooting, but there was a large crowd of people outside and police are hoping someone in the crowd can help lead them to the suspects.\nNo arrests have been made."}