{"uri": "http://www.foxcarolina.com/story/33369803/dispatch-shooting-reported-in-spartanburg-co", "title": "Homeowner shoots, kills 15-year-old suspect in Spartanburg Co., 13-year-old arrested", "dct": "Wed, 12 Oct 2016 03:04:00 GMT", "id": "d0732bd0154d1e9356f910c0c1532baf", "content": "WELLFORD, SC (FOX Carolina) -\nThe Spartanburg County Sheriff said a 15-year-old boy was shot to death and a 13-year-old was taken into custody after trying to steal a car outside a home Tuesday night.\nSheriff Chuck Wright said a homeowner called at about 10:50 p.m. and said he had shot at someone who tried to steal his car. The incident occurred on the 300 block of James Raymond Court in Wellford.\nWright said found the 15-year-old's body on the ground when they arrived.\n\"This is...it's just tragic. Terrible,\" Wright said.\nThe sheriff said a second suspect, later identified as a 13-year-old, fled from the scene and was shot at as well but they do not believe that person was hit and had not received any reports on gunshot victims at area hospitals.\nAccording to the sheriff, a car had been stolen from the same residence earlier today or yesterday and it seems as if the same people came back to get another car, though he is not certain.\nThe sheriff said a handgun was also found laying next to the body of the suspect. That handgun did not belong to the homeowner.\n“It could have wound up being a home invasion and the homeowner dying,\" Sheriff Wright said. \"He had some intention of not just taking the car.”\nThe Spartanburg County Coroner confirmed Wednesday that 15-year-old suspect Deondre Larise Brannon of Belmarc Drive in Spartanburg died of a single gunshot wound.\nBrannon was a former student of Spartanburg District One. The school district released the following statement after the incident:\n\"District One officials have been made aware of last night’s incident. We have been in contact with the family and out of respect for them, we are not releasing any information at this time. Our thoughts and prayers are with all of the families involved.\"\n-Spartanburg School District One\nOn Wednesday evening, Sheriff Chuck Wright told FOX Carolina that the second suspect involved in the attempted car theft Wednesday night had been taken into custody at the Department of Juvenile Justice on an unrelated offense. The suspect was 13-years-old.\nThere is no word on charges at this time or how the 13-year-old knew Brannon.\nKesha and Kiara Oglesby, Brannon's mother and sister, sat down with Cody Alcorn on Wednesday to speak about the tragedy. The boy's mother said she's facing something she never expected: preparing to bury her own child.\n\"He had a life ahead of him. You know he's still a child,\" Oglesby said.\nShe said she may never know exactly why her son was on James Raymond Court when he was shot.\n\"Wrong place, wrong time. Hanging with, you know being around the wrong children,\" she speculated.\nOglesby said the tragedy should serve as a lesson for other youngsters to choose friends wisely and never take life for granted.\n\"All these teenagers should take this into aspect in their life you know,\" the grieving mother said.Y\"ou should change yourself. You never know when it's your last time. You should change yourself.\"\nSheriff Wright said the investigation is ongoing.\nA candlelight vigil will be held Sunday night in memory of 15-year-old Brannon. The vigil will take place at 8 p.m. at Leroy Mathis Park at 50 Bruce Street in Inman.\nCopyright 2016 FOX Carolina (Meredith Corporation). All rights reserved."}