{"uri": "http://www.chicagotribune.com/news/local/breaking/chi-man-wounded-in-south-side-shooting-20130704-story.html", "title": "Holiday violence toll includes boys, 5 and 7: 'It's just senseless'", "dct": "Fri, 05 Jul 2013 19:49:00 GMT", "id": "149a2fce3016c99fd1778d35929af904", "content": "With the long Fourth of July weekend not even half over, the toll from violence in Chicago stood at 9 dead and at least 36 wounded today, including two little boys, 5 and 7, seriously hurt while at parks with their families.\nThe victims since Wednesday afternoon also include a 14-year-old boy shot on the West Side, a 16-year-old boy wounded on the South Side and a cabbie shot in the stomach by a robber on the South Side.\nThe youngest victim so far is 5-year-old Jaden Donald, who was shot in the abdomen and right leg while with his family at a party in Cooper Park on the Far South Side shortly after midnight.\nHis mother, Jasmine Donald, stood outside Advocate Christ Medical Center in Oak Lawn this morning in a gown, blood on her dress and shoes. She said she hadn't been at the park long when a young man started shooting.\n\"Not 15 minutes,\" she said.\nDonald lifted her right hand and held it out, then swept it from left to right as she described how a young man shot into the crowd. \"Everybody ran. The kids hit the ground. My son tried to run to me.\"\nShe noticed he was bleeding and lifted his shirt and saw a gaping wound.\nJaden underwent surgery but \"he's not breathing on his own. A machine is breathing for him,\" she told reporters outside the hospital about 7:30 a.m. The boy lost three organs, she said.\n\"This senseless shooting needs to stop,\" she said, \"It's just senseless. This makes me want to go back in the house with my kids and never go out. Why would you do something like this? Why? All these kids and innocent people out here, why?\"\nTwo others also were wounded in the park. Police said neither of the men, 34 and 28, has documented gang affiliations.\nSomeone drove all three to Metro South Medical Center in Blue Island and the boy was transferred to Christ, police said.\nNo one was in custody and police did not have a description of the shooter.\nOn Thursday night, a 7-year-old boy was hit in the neck by a stray bullet at Cole Park in the 300 block of East 85th Street, police said. He was taken in critical condition to Advocate Christ Medical Center, according to fire officials.\nThe boy was shot in the neck behind the ear, apparently hit by a stray bullet from at least one gunman who was aiming at rival gang members, police said.\nCole Park, at 85th Street and King Drive, is across the street from where Chicago Police Officer Thomas Wortham IV was shot and killed in 2010 in front of his parents' home.\nIn other shootings across the city:\n• Four people, including a 14-year-old boy, were wounded about 12:30 a.m. Friday on Cottage Grove between 60th and 61st streets in the West Woodlawn neighborhood.\nThe 14-year-old was taken to Comer Children’s Hospital, about two blocks away. A 54-year-old woman with a leg wound and a 37-year-old man with a wound to the right forearm were taken to the University of Chicago Hospital. A 35-year-old woman was stable at Northwestern Memorial Hospital with a leg wound.\n• A 26-year-old man was shot to death in Rogers Park about 5:30 a.m. Friday. Police found him bleeding from gunshot wounds in the 7400 block of North Paulina Street and he was pronounced dead there. He was identified as Elliot Frazier of the 7400 block of North Winchester Avenue, according to the Cook County medical examiner's office.\n• A man was critically wounded Friday afternoon in a shooting on the West Side in the city's Lawndale neighborhood. The shooting happened about 12:30 p.m. on the 1400 block of South Keeler Avenue, said Police News Affairs Officer Michael Sullivan. A man described as in his 20s was wounded and taken to Mount Sinai Hospital, where he was listed in critical condition, Sullivan said.\n• A 28-year-old man drove himself to St. Bernard Hospital and Healthcare Center after suffering three wounds – two to his abdomen and one to his chest. He was transferred to Stroger Hospital in critical condition, police said. He was shot in the 5900 block of South Peoria Avenue about 3:30 a.m. Friday.\n• Friends of a man shot in the buttocks dropped him off at Saint Bernard Hospital and Healthcare Center about 3:30 a.m. Friday, but police said the 21-year-old was not cooperating with police and had left the hospital. He was shot in the 6500 block of South Parnell Avenue, police said.\n• A cab driver was shot outside a taxi association on the South Side about 2:30 a.m. Friday. The shooter tried to rob the cabbie in the 7700 block of South Exchange Avenue and shot him in the stomach. The 56-year-old man was taken to Northwestern Memorial Hospital in serious condition, police said.\n• About 2:15 a.m. Friday, a 17-year-old boy was shot in the abdomen near 103rd Street and Michigan Avenue in the Roseland neighborhood. He was driven to Little Company of Mary Hospital and transferred to Advocate Christ Medical Center in serious condition.\n• A man and a boy, 19 and 16, were wounded in the 5800 block of South Princeton Avenue about 2:10 a.m. Friday. They were on a porch when two men walked up and opened fire, police said. The man was in serious condition at Stroger hospital with a wound to his lower back, and the boy was hit in the left leg and was stable at Mercy Hospital and Medical Center.\n• Someone shot a 35-year-old man in the leg about 11:45 p.m. Thursday in the 300 block of East Kensington Avenue in the Roseland neighborhood, police said. He was taken to Metro South Medical Center in stable condition, police said.\n• A 33-year-old man was shot in the 7100 block of South Campbell Avenue about 11:30 p.m. Thursday. He was on a porch and hit in the shoulder and leg. He was stable at Mount Sinai Hospital. Police said he was shot by someone who stepped out of an alley and opened fire.\n• Another person was wounded about 10:30 p.m. Thursday in the 7600 block of South Coles Avenue. The man was shot four times in the leg, once in the abdomen and once in the side, police said. The 23-year-old said he didn't know why he was shot. He was taken to Northwestern Memorial Hospital, police said.\n• A 31-year-old man was shot and killed while on a porch in the 6200 block of South Marshfield Avenue in Englewood around 9:30 p.m. Thursday. Two people snuck up from a gangway and shot him, and he was pronounced dead at the scene.\nThe victim was identified as Marlon Obannon of the 7500 block of South Paulina Street, according to the medical examiner's office.\n• Someone shot a 27-year-old in his back and left thigh in the 300 block of South Mozart Street about 8:45 p.m. Thursday. The 27-year-old had told the shooter moments earlier to stop urinating in front his girlfriend, police said. The man left, returned on a scooter and opened fire. He was taken to Stroger Hospital in serious condition.\n• Two others were shot about 3:42 p.m. Thursday on the 500 block of North Lawndale Avenue in the East Garfield Park neighborhood, said Police News Affairs Officer Dan O'Brien. Two men, both 20, were shot and taken to Mount Sinai Hospital in stable condition. One was hit in the left shoulder and the other in the left thigh, police said.\n• Earlier Thursday afternoon, a 21-year-old man was fatally wounded in the Lawndale neighborhood, said O'Brien. The man was shot several times on the 600 block of South Francisco Avenue. Steve Mabins was taken in critical condition to Mount Sinai Hospital, where he was pronounced dead, according to O'Brien and the Cook County medical examiner's office.\n• A 36-year-old man was also fatally wounded Thursday afternoon in a shooting in the Park Manor neighborhood. The shooting happened about 12:19 p.m. on the 7300 block of South Wabash Avenue, said Police News Affairs Officer Michael Sullivan.\nPolice said the man was dead at the scene. The man was seen on the street before the shooting talking to someone in a car. The car pulled away and a couple minutes later an SUV rolled up and someone jumped out and chased the man into a home.\nA couple mintues later, the shooter left the house and police found the man dead inside. He was identified as Cheodis Young, according to the Cook County medical examiner's office, but public records indicate his name was Theodis Young, formerly of the 10000 block of South Carpenter Street.\n• Earlier, a teenager was killed in a police-involved shooting in the city's Washington Park neighborhood. That shooting happened shortly after 1 p.m. Thursday on the 5600 block of South State Street. The teen was taken in serious-to-critical condition to Stroger Hospital, where he died.\n• A man Friday after being shot in the 5600 block of South Western Avenue on Thursday while he was in a car, police said. He was driving south when someone in a Dodge Charger flashed gang sins and fired toward the man, hitting him in the head.\nThe man was identified as Shavonte Howard, 20, of the 5300 block of South Hoyne Avenue, accoriding to the Cook County medical examiner's office. He was pronounced dead at 2:47 p.m. at Mount Sinai Hospital where he had initially been listed in grave condition, officials said.\n• In Austin, three people were shot as they stood outside on Leclaire Avenue north of Madison Street about 2:20 a.m. Thursday.\nA 29-year-old man was shot in the right ankle and a 25-year-old woman was grazed in the arm. Both of them were taken to West Suburban Medical Center. A 25-year-old woman was shot in the neck and buttocks and was taken to Stroger Hospital.\n• Just after 3 a.m. Thursday, two other people were shot in the 1100 block of South Mason Avenue, half a block north of Cicero and half a block east of Oak Park in a neighborhood known as the Island. A 27-year-old man was shot in the head and a 28-year-old man was wounded in the leg. Both were taken to Loyola University Medical Center, the younger man in serious condition.\n• Just after midnight, in the early minutes of Thursday, a 19-year-old man was shot in the 10100 block of South Indiana Avenue in the Rosemoor neighborhood. Someone got out of a car and fired, then got back inside and took off, police said. The victim was taken to Advocate Christ Medical Center with a chest wound.\n• In the West Woodlawn neighborhood, three men were shot about 7:25 p.m. Wednesday in the 6600 block of South Champlain Avenue, one of them fatally, according to Police News Affairs Officer Daniel O’Brien, citing preliminary information.\nA 26-year-old man was shot in the head and was pronounced dead at Saint Bernard Hospital and Health Care Center at 7:38 p.m. Wednesday, authorities said. The two other men, 18 and 19, were shot in the shoulder and were stable at the hospital, O’Brien said.\n• Earlier in the South Shore neighborhood, a 24-year-old man was shot in the back and critically wounded about 6:50 p.m. Wednesday in the 2400 block of East 79th Street, according to O'Brien.\nPolice said someone fired at him after getting out of a green car. The victim ran around the corner into the 7900 block of South Phillips Avenue and collapsed, police said.\nHe was pronounced dead at Northwestern Memorial Hospital at 7:26 p.m., according to the medical examiner's office. No arrests have been made, said O'Brien.\n• In another fatal shooting, someone shot a man as he sat in a vehicle in the 8700 block of South Loomis Street at 1:15 p.m. Wednesday, according to Police News Affairs Officer Michael Sullivan. William Jones, 26, of the 7800 block of South Emerald Avenue, was pronounced dead on the scene at 1:31 p.m., according to the medical examiner's office.\n• Also, two people were shot, including a 20-year-old man with a head wound, in the 500 block of West 104th Street on the Far South Side about 3 p.m.\nHe was was taken in critical condition to Advocate Christ Medical Center in Oak Lawn, O’Brien said. No arrests have been made in the shooting.\nBoth of the men shot were in the alley at the time. One was urinating when the shooting started, and he was hit in the head. He tried to leave the scene, came back and another man was there shot in the foot.\n• In the 1600 block of South Komensky Avenue in the Lawndale neighborhood, a 19-year-old man was shot in the lower back and an 18-year-old man was shot in the foot about 2:10 p.m. Wednesday, O’Brien said.\nBoth were taken to Mount Sinai Hospital, where the older man was in serious condition and his companion’s condition had stabilized, according to O'Brien.\n• About 9:50 p.m. Wednesday, a 24-year-old man was shot in the 100 block of South Kostner Avenue in the West Garfield Park neighborhood. He was dropped off at Loretto Hospital, where he was listed as stable with a gunshot wound to the back.\n• About 6:25 p.m. Wednesday, a man was shot in the 2700 block of West Lexington Avenue on the West Side. A half hour earlier another man was shot in the 3600 block of West Lexington Avenue. The second person was taken to Mount Sinai Hospital with a wound to the right foot, police said."}