{"uri": "http://www.chicagotribune.com/news/local/breaking/chi-chicago-shootings-violence-crime-20140711,0,7441064.story", "title": "At least 2 dead, 18 wounded in city shootings", "dct": "Sat, 12 Jul 2014 09:45:00 GMT", "id": "c2e7b89bc4a58bad016d2933c5295565", "content": "At least two men have been killed and 18 other people wounded, including two 15-year-old boys, in shootings in Chicago Friday night into Saturday morning.\nIn the Austin neighborhood about 7:13 p.m. Friday, a 32-year-old man was shot and pronounced dead on the scene in a possible drive-by shooting in the 5200 block of West Quincy Street, said Chicago Police Department News Affairs Officer Veejay Zala. A man whose age was not yet available was shot in the right arm, but refused medical treatment and refused to cooperate with police.\nLater, a 30-year-old woman who had been shot multiple times in the same attack showed up at Loretto Hospital, less than a mile away, but was transferred to John H. Stroger, Jr. Hospital of Cook County, Zala said. A fourth person, a 41-year-old man, walked into West Suburban Medical Center with a gunshot wound to his hand but gave police a bogus address before they figured out he had also been shot on Quincy.\nThe Cook County medical examiner's office identified the man as Damion Bryant, 32, of the same block where the shooting occurred. He died at the scene and was pronounced there at 10:13 p.m.\nA large crowd gathered near the crime scene at Quincy and Laramie Avenue, and several people who appeared to be family members of the man killed stood together, visibly upset.\nNeighbors and family members told WGN-TV on Saturday that Bryant had several children and owned several convenience stores on the West Side.\nThe shooting scene was near a parking lot for the Friendship Baptist Church, at Laramie and Jackson Boulevard, and many cars were in the parking lot about 9 p.m. for a function at the church. The church's website indicated it was an event marking the 117th anniversary of the church's founding, one of several events scheduled for this weekend.\nIn the night's other homicide, a ma n was killed and his mother wounded about 1:15 a.m. Saturday in the 6200 block of South Rockwell Street in the Chicago Lawn neighborhood. A 50-year-old woman was shot in the chest and is in serious condition. The man, 27, died at the scene. The Cook County medical examiner's office identified the man as Addarius Thompson; he was pronounced dead at 1:46 a.m.\nPolice believe the shooter is a 47-year-old man who had an argument with the two people before coming back with a gun and shooting them.\nIn other shootings:\n• A 38-year-old man walked into Norwegian American Hospital after someone shot him in the Humboldt Park neighborhood about 4:30 a.m. Saturday. He had a wound to his leg. Someone opened fire from a passing light-colored four-door car. The shooting happened in the 3300 block of West Le Moyne Street, police said.\n• Someone shot a 22-year-old man in the 9800 block of South Hoxie Avenue in the Jeffery Manor neighborhood about 3:55 a.m. Saturday. He was driven to Advocate Trinity Hospital by a relative but had sustained multiple gunshot wounds to his body and will be transferred to Advocate Christ Medical Center in southwest suburban Oak Lawn.\n• Two men were shot about the same time within a couple blocks of each other in the Humboldt Park neighborhood but the attacks are apparently unrelated, according to police. A 31-year-old man was shot about 11:45 p.m. Friday near Division and Rockwell streets and taken from there to Stroger hospital with wounds to his upper right thigh.\nA couple minutes later Friday, a 38-year-old man was shot in the front yard of a home near Rockwell and Evergreen streets a couple blocks north. He walked into Saints Mary and Elizabeth Medical Center with gunshot wounds to each leg.\n• Someone shot two men in the 100 block of West 104th Place in the Fernwood neighborhood about 10:40 p.m. They were both taken to Advocate Christ Medical Center - a 21-year-old with an arm wound and a 26-year-old with a back wound. Police said the two \"heard shots and felt pain\" while standing on a sidewalk.\n• About 9:55 p.m., three people were shot near the intersection of Austin and Fullerton avenues in the Belmont Central neighborhood. A 15-year-old boy was shot in the arm and taken to Lurie Children's Hospital, police said. A 54-year-old man was grazed in the head and a 24-year-old man was shot in the back. They were both taken to Loyola University Medical Center.\n• About 7:35 p.m., a 15-year-old boy was shot in the left ankle in the 7000 block of South Damen Avenue in the West Englewood neighborhood, said News Affairs Officer Stacey Cooper. The boy was in good condition at Holy Cross Hospital. The boy was walking in the area when someone came out of an alley, went up to the boy and started shooting, Cooper said.\n• In the Lawndale neighborhood, a 22-year-old man was shot multiple times about 7 p.m. in the 900 block of South Springfield Avenue and was taken to Mount Sinai Hospital in critical condition, said Zala. No information about the circumstances of the shooting was immediately available.\n• A little before 7 p.m., two men were shot in the Brighton Park neighborhood, in 2800 block of West Pershing Road in what may have been a drive-by shooting, Zala said. A 28-year-old man and a 23-year-old man were both shot multiple times and taken to Mount Sinai Hospital for treatment, Zala said.\nAt the scene of the shooting, police were examining a green Hyundai SUV and behind it, a GMC AstroVan which appeared to have come to a stop in front of a small, red brick church, Iglesia Cristiana Emanuel, at the corner of Pershing and Francisco Avenue.\nThere were four evidence markers on the ground next to the SUV and shattered glass on the pavement nearby.\nNeighbors said they heard what they thought were fireworks getting lit off, realizing later that they had heard five gunshots, not fireworks. Residents were gathered on nearby porches, looking at the scene, while a small group of people stood nearby.\n• Earlier, a 23-year-old man was shot about 6 p.m. in the West Pullman neighborhood. The man was shot in the foot and showed up at Advocate Trinity Hospital, where he was in good condition, Zala said. Two people were in custody. Police said he had been shot in the 11500 block of South Prairie Avenue."}