{"uri": "http://www.whio.com/news/news/crime-law/multiple-people-shot-on-macarthur-ave-in-dayton/nk74C/#__federated=1", "title": "Shooting of 7 happened at illegal boot joint", "dct": "Mon, 04 May 2015 00:00:00 GMT", "id": "ec1ecc59fc29245740c8829ce6bba4dd", "content": "A gunman opened fire early Sunday, killing one man and wounding six others at a large party at a Germantown Street house.\nKEY POINTS\nShooting reported at 4 a.m. May 3\nDwayne Curtis, 27, of Trotwood was killed\nSix others struck by bullets\nIncident in 2800 block of Germantown Street\nSuspect remains at large\nUPDATE @ 12:30 p.m. (May 4)\nAccording to a news release from the Dayton Police Department, one female, 27, is in serious condition, and five others, aged 22 to 31 years of age, suffered non-life-threatening injuries.\nVictims conditions:\nSex: M Race: B Age: 27 Condition: Deceased\nSex: F Race: B Age: 27 Condition: Serious\nSex: M Race: B Age: 24 Condition: Admitted/non-life threatening\nSex: M Race: B Age: 31 Condition: Non-life threatening\nSex: F Race: B Age: 22 Condition: Non-life threatening\nSex: M Race: B Age: 25 Condition: Non-life threatening\nSex: M Race: B Age: 24 Condition: Non-life threatening\nLt. Wendy Stivers said the location of the incident is an illegal liquor establishment, and the deceased male had been ejected due to his behavior. He reportedly returned with a gun and forced his way in. Shots were exchanged and there were multiple injuries.\nAt this time, no arrests have been made.\nUPDATE @ 11:50 p.m. (May 3)\nA victim speaks out tonight about the incident around 4 a.m. that sent six people to the hospital with gunshot wounds and left one man dead early Sunday.\n” … so it was just crazy, fire, bullets was just flying everywhere, (he) came inside and was shooting inside,” said Desiree Johnson, a mother of four recovering from a gunshot wound.\nDwayne Curtis, 27, of Trotwood, was found dead inside Germantown Street house in Dayton.\nPolice are still searching for the suspect.\nJohnson described the chaotic scene as she and her friend tried to leave a party.\n“That’s all I heard was gunfire and the crowd turned around and was saying ‘no, go back, go back, go back they’re shooting.’ I never looked back after that, I just took off running.”\nJohnson wasn’t quick enough. The 22-year-old was shot in her right leg.\n“I felt a burning then a cooling sensation and I thought to myself, ‘I’ve been shot but I just have to keep going.’ ”\nShe managed to get away and her friend drove her to the hospital. At least five other gunshot victims were treated when the person opened fire at the house on Germantown Street in Dayton.\nThe police report lists the address as a “boot joint,” which is a phrase used to describe a place where alcohol is sold illegally.\nJohnson said someone checked her ID when she arrived, and that she thought it was a club.\nNeighbors said there’s never been an issue there before.\n“I don’t know what was going on in there. I know there was always people out there, you know, barcecuing and I thought it was a nice, quiet establishment,” said Martin Caldwell.\nJohnson said she didn’t know Curtis, but she had seen him at the event. It wasn’t missed on her that she and he were shot by the same man.\n“From the same gun, the same bullets took somebody’s life,” she said. “I’m leaving here alive, so emotions are just crazy because, like I said, I’m a single mother of four so instantly I think about my babies and … (feel) relieved that I could come home to them and I’m alive.”\nThe bullet is still in Johnson’s leg, and she’ll have to get it checked out in a few days.\nUPDATE @ 12:30 p.m.:\nThe Montgomery County Coroner’s Office identified the man killed in this morning’s shooting at a house party.\nDwayne Curtis, 27, of Trotwood was fatally shot around 4 a.m. in the 2800 block of Germantown Street. Six other people were treated for gunshot wounds at Miami Valley Hospital after shots rang out during a large party at the residence.\nUPDATE @ 5:30 a.m.:\nA man was killed and at least six others shot at a residence on Germantown Street.\nAbout 100 people were partying when shots rang out around 4 a.m. at the house in the 2800 block of Germantown Street, said Dayton police Sgt. Andrew Zecchini.\nOne man was pronounced dead at the scene. Medics took a woman with gunshot wounds to Miami Valley Hospital. Five other gunshot victims from the same party arrived on their own to Miami Valley Hospital.\nAn eighth gunshot victim had a bullet wound to the leg. He was a block away at Lakeview Avenue and Blanche Street, but police are still investigating whether his injuries are connected to the house party shooting.\nPolice are interviewing multiple witnesses and have not released information on potential suspects.\nFIRST REPORT\nPolice were called to reports of multiple people shot near the intersection of Germantown Street and McArthur Avenue.\nCrews responded to the call shortly after 4 a.m. today. Initial reports indicate at least eight people suffered gunshot wounds, and some of the victims have driven themselves from the scene to Miami Valley Hospital.\nWe have a crew on the scene and will update this page when new information is available."}