{"uri": "http://www.lex18.com/story/32463488/police-suspect-wounds-milwaukee-officer-then-kills-himself", "title": "Police: Suspect Wounds Milwaukee Officer Then Kills Himself", "dct": "Sun, 17 Jul 2016 15:49:00 GMT", "id": "4f07b08718ee11d60e09d14b884ef09b", "content": "MILWAUKEE (AP) - A domestic violence suspect opened fire on a Milwaukee police officer who was sitting in his squad car early Sunday, seriously wounding him before fleeing and apparently killing himself shortly afterward, authorities said.\nThe suspect, a 20-year-old man from the suburb of West Allis, had two felonies on his arrest record, said police spokesman Sgt. Tim Gauerke, who did not disclose the man's name. The 31-year-old officer was taken to a hospital with serious wounds that weren't considered life-threatening, he said.\n\"This is just another example of the risks our officers take each and every day to protect these citizens,\" Assistant Milwaukee Police Chief William Jessup said at a morning news conference.\nOfficers responded to several calls in the 3500 block of South 17th Street early Sunday, including two domestic violence-related calls in which the suspect was no longer there when the officers arrived, Gauerke said.\nThe officer was sitting in his squad car conducting the investigation at about 2 a.m. when a suspect approached on foot and fired at the officer, striking him several times, Gauerke said. About a half-hour later, officers heard a nearby gunshot and found a man who had apparently shot himself in the head, killing himself.\nInvestigators believe the dead man was the suspect in the domestic violence incidents and the person who shot the officer, Gaurke said. The name of the officer, a 13-year police veteran, was not immediately released.\nJessup said he did not know if there was any video evidence from the squad car's dashboard camera or the officer's body camera, WISN-TV reported.\n(Copyright 2016 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.)"}