{"uri": "http://www.nbcnews.com/news/us-news/milwaukee-police-officer-wounded-gunman-while-squad-car-n611381", "title": "Milwaukee Police Officer Wounded by Gunman While in Squad Car", "dct": "Mon, 18 Jul 2016 05:32:00 GMT", "id": "cd7a819d68e3bcc7b543755667f29a1b", "content": "A police officer was shot and seriously injured in Milwaukee early Sunday by a suspect who is believed to have later killed himself, officials said.\nThe 31-year-old was hit while sitting in his squad car after police were called to the south side of the city for two domestic violence incidents, the Milwaukee Police Department said in a statement.\nThe officer has not been officially identified but NBC station WTMJ named him as Brandon Baranowski, who has served with the department for 13 years.\nWhen police responded to the incidents, the suspect was no longer in the area. Baranowski was about to leave at 2 a.m. local time (3 a.m. ET) when a man walked up to his car and fired several shots into the vehicle, police said.\nAccording to WTMJ, Baranowski was struck in his arm and bulletproof vest. He was transported to a local hospital for what police described as \"non-life threatening but serious injuries\" and is expected to make a full recovery.\nAround 30 minutes after the shooting, officers heard another single gunshot and found the body of a man later identified as 20-year-old from the West Allis suburb. His arrest record includes two prior felonies, police said.\nPolice said the man — who appeared to have shot himself in the head — is suspected of the officer's shooting and the two domestic violence calls.\nA man who identified himself as the suspect's uncle issued a statement to WTMJ, saying the shooting was \"not the result of any movement, political agenda, race or gender. It is the result of a young man who was suffering from profound emotional distress.\"\nThe statement said the man's family were \"working diligently to identify resources and get them into place\" to help the man, but that \"sadly our efforts were not in enough time.\"\nIt expressed the family's \"most heartfelt apologies to Officer Brandon Baranowski and his entire family\" and thanked the police department for \"their efforts to perform lifesaving measures and their efforts to protect and serve in our community.\"\nAssistant Police Chief William Jessup told a press conference that the shooting was \"just another example of the risks our officers take each and every day to protect these citizens.\"\nMilwaukee police are going out in two-person teams until further notice, WTMJ reported.\nThe incident came hours before three police officers were shot dead in Baton Rouge, Louisiana, and just over a week after five officers were gunned down in Dallas, Texas."}