{"uri": "http://dailyjournalonline.com/news/local/crime-and-courts/suspect-barricades-self-after-shots-fired/article_a9ccf780-5686-578d-aef1-8790746d4acc.html", "title": "UPDATED: Suspect in custody after shots fired at deputies", "dct": "Fri, 12 Aug 2016 00:00:00 GMT", "id": "04dde91fb9d1b579dbfeabf5cdf8156a", "content": "12:05 a.m. Update: After nearly three and a half hours, a suspect who fired shots at officers attempting to serve a felony warrant at an apartment off of Corcoran Road just outside of Doe Run has been taken into custody.\nSt. Francois County Sheriff Dan Bullock said four deputies went to serve a felony warrant for failure to appear on a distribution and manufacture charge out Desloge, to Donte Winston, 40, of Farmington. They knocked on the door and announced “sheriff’s department”.\n“Immediately shots fired from inside the house towards the deputies and deputies returned gunfire,” said Bullock. “A standoff with numerous deputies took place. Everybody was going to a fundraiser for Deputy Tim Harris when all this occurred, so 10 or 12 of us ended up at the address instead of going to the fundraiser.”\nBullock said they secured the residence from outside and evacuated the area. He said they eventually made phone contact with the suspect.\n“He would not come out of the house and the phone conversation went on for several hours,” said Bullock. “We called in the Farmington City SWAT team in case we had to go in. Eventually the deputy talked the suspect into coming out and giving himself up.”\nBullock said they had been after Winston throughout the day Friday and they sent the extra deputies to cover both sides of the door so he wouldn’t run out of the house. The standoff began at about 6 p.m.\n“We finally took him into custody at 9:20 p.m.,” said Bullock. “It was one my deputies that did all of the negotiating. He built a rapport with the guy inside the house. One deputy was injured. A bullet came through the wall and hit him in the leg, but it did not penetrate him, it just bruised him.”\nBullock said at that point they called in Missouri State Highway Patrol to take over the investigation because an officer fired their weapon.\n“The patrol will handle the actual investigation of the shooting to show there is no impropriety,” said Bullock. “We are in the process of obtaining a search warrant for the apartment, but they may have it by now.”\nBullock said Winston has a bond of $250,000 for the warrant they were trying to serve, but they also plan to file charges against him with the state prosecutor’s office.\nWinston has a history of charges including three class C felonies of endangering the welfare of a child, distribute, deliver, manufacture, produce or possess with the intent to distribute, deliver, manufacture, produce a controlled substance, and assault in the third degree.\n9:35 p.m. Update: It has been reported the suspect is in custody. We will have more details as information is made available.\nOriginal story: An individual has barricaded himself in an apartment off Corcoran Road just outside of Doe Run after firing several shots at law enforcement while they were trying to serve a felony warrant Friday evening."}