{"uri": "http://www.miamiherald.com/news/local/community/miami-dade/miami-gardens/article27995416.html", "title": "Security guard killed in Miami Gardens strip-club shooting", "dct": "Tue, 21 Jul 2015 06:10:00 GMT", "id": "ff5fbd63b55b1f50cbfe4a5c23e8a3cb", "content": "A security guard was shot and killed and two others wounded in a shooting at a Miami Gardens adult club.\nFamily members said that the shooting claimed the life of 34-year-old David Hilbert. He had worked as a security guard at night at the club for more than two years and was married and had at least one child.\n“He just lost his life for no reason,” said the security guard’s cousin, Roberta Hilbert. “It happened over stupid stuff.”\nJust after 4 a.m. Tuesday, police received word of the shooting at the Mint Lounge, Northwest 187th Street and 27th Avenue.\n“There was an argument outside of the establishment which led to multiple shots being fired,” Miami Gardens police Detective Michael Wright said.\nfacebook twitter email Share\nDeadly shooting outside of Miami Gardens strip club\nMiami Gardens police detective Michael Wright speaks to reporters about the shooting that took place outside of a Miami Gardens strip club. Video by Walter Michot/Miami Herald Staff\nwmichot@miamiherald.com\nTwo men who were shot were taken to Aventura Hospital and Medical Center, according to police.\nAt the scene, a tarp-covered body lay in between two cars in the club’s parking lot. Police searched the area with flashlights. Shell casings and evidence markers dotted the street in front of the lounge, across from the new police headquarters and City Hall.\nFamily members say Hilbert was passionate about his job as a security guard.\n“He was a fun type family man. He was just a person that believed in working, just a hard working person,” Roberta Hilbert said.\nIt’s not clear whether David Hilbert was involved in the fight or just trying to break it up.\nMint Lounge has had trouble in the past.\nIn March 2015, an argument that started at the club led to a man being shot dead later in the night.\nIn 2010, one man was killed, two others injured when an argument led to gunfire.\nHilbert’s great aunt, Lannie Hilbert, said, “This is very bad. If anyone knows anything, they should come forward. This was not right.”\nMiami Gardens police said they are looking at surveillance tape to see if that can help them with this case."}