{"uri": "http://thetandd.com/news/person-of-interest-in-custody/article_61a4773a-565e-5e58-8835-1341ec3bbe11.html", "title": "‘Person of interest’ in custody", "dct": "Thu, 23 Jul 2015 00:00:00 GMT", "id": "42043a6b18176871c8b74ceec790ff42", "content": "A Moncks Corner man says he has a deserved reputation for fighting, but he’s not the person who shot four people to death in a Holly Hill home.\nWhile the 26-year-old has not been charged in last week’s deaths, officials announced he is a “person of interest.”\nSmith said, “I would never, ever harm nobody’s family or their children. I might fight somebody. As you can see, my record’s consistent with that, like I will fight you.\n“As far as committing other things with guns, everybody totes them. That’s like life because of so many things going on in the streets right now.”\nThe Disciple Way man was arrested by the Orangeburg County Sheriff’s Office Tuesday on charges of second or subsequent offense failure to stop for blue light and two counts of possession of a controlled substance.\nLaw enforcement officers also wanted to talk to Smith about the four people killed at 7050 Old State Road, near Holly Hill, on July 15.\nThe victims were Tamara Alexia Perry, 14; Shamekia Tyjuana Sanders, 17; Krystal Hutto, 28; and Jerome Butler, 50.\nOrangeburg County Sheriff Leroy Ravenell said on Thursday that the multiple homicide investigation has been non-stop since it was first called in.\n“We want to assure the community we have been tracing out every new lead, interviewing anyone even remotely connected with it, including Mr. Smith,” he said. “We can’t rest until this is resolved.”\nFirst Judicial Circuit Solicitor David Pascoe told the court that Smith has an outstanding warrant in Summerville for criminal domestic violence and a Berkeley County General Sessions bench warrant for failing to appear in court on a strong-arm robbery charge.\n“He’s from Berkeley County, but he’s very transient and can be hard to locate,” Pascoe said.\nGodwin said he and another investigator were assembling a team of officers to “basically go in and get him because we didn’t want to take any chances with his history of fighting officers, failure to stop for blue light, his prior criminal history.”\nAs they waited for other officers to arrive, Smith “came out and attempted to get in his vehicle and leave,” Godwin said.\n“He was sitting stationary in his car. He recognized us as police. We had our blue lights on and he chose right then and there to flee the scene,” Godwin said.\nGodwin said Smith led them on a chase that exceeded 100 mph down Mingo Street, Goff Avenue, back down Mingo Street and through the “Bojangles parking lot every bit of 80 mph at 12:15 in the afternoon,” Godwin said."}