{"uri": "http://www.thestate.com/news/local/crime/article27301705.html", "title": "Search continues for suspect who killed 2 adults, 2 teens at Holly Hill home", "dct": "Wed, 15 Jul 2015 10:18:00 GMT", "id": "6bfa70c0123f00b148cd658dfc2f401c", "content": "The Orangeburg County Coroner identified the four individuals found shot to death at a Holly Hill residence early Wednesday morning.\nCoroner Samuetta Marshall said 14-year-old Tamara Perry, 17-year-old Shamekia Sanders, and 28-year-old Krystal Hutto were all found dead from apparent gunshot wounds in separate bedrooms of the home, which is on the 7000 block of Old State Road in Holly Hill.\nMarshall identified the fourth victim Wednesday night as 50-year-old Jerome Butler. The relationships between the victims is still being determined. Autopsies have been scheduled for Thursday morning in Newberry.\nAlthough Orangeburg County Sheriff Leroy Ravenell said his department has not identified a suspect or determined a motive for the shooting, it is following many “good leads” and he encourages anyone with information about the shooting to come forward.\n“We will not rest until we arrest the person that killed these individuals,” Ravenell said.\nState and local law enforcement agencies stepped up to help track down the killer or killers.\n“Just as we realized the magnitude of this tragedy, particularly when children are involved, these agencies sent officers to assist us,” Ravanell said Wednesday evening.\nRavenell said sheriff’s deputies responded to the residence just after 7 a.m. after receiving a call from an unidentified male regarding a shooting at the home. When deputies arrived, they found the Butler dead from an apparent gunshot wound in the front yard of the home.\nInside the home, Ravenell said, deputies located Perry and Sanders, who had been apparently shot in one bedroom, while Hutto was shot in a separate bedroom. Sheriff’s deputies also found a wounded 8-year-old boy in the home. He was airlifted to a Charleston hospital for treatment.\nRavenell said Thursday evening he did not know the child’s condition.\nAfter the victims were discovered, a search began for a green 1990s model Mercedes believed to be connected to the incident. Shortly after a be-on-the-lookout bulletin was issued for the vehicle, it was located about 15 miles away, near Vance, Ravenell said.\nAlthough Ravenell said he had not seen the vehicle, he was told it was burned.\nSheriff’s deputies, along with officers from the Holly Hill Police Department, the South Carolina Law Enforcement Division and the Charleston and Berkeley County sheriff’s departments continue to search for the suspect.\nHolly Hill is about 60 miles northwest of Charleston, near the intersection of Interstates 95 and 26.\nThe Associated Press contributed."}