{"uri": "http://newyork.cbslocal.com/2014/11/23/parents-charged-after-brooklyn-baby-struck-by-bullet/", "title": "Parents Charged After Brooklyn Baby Struck By Bullet", "dct": "Sun, 23 Nov 2014 23:30:00 GMT", "id": "73f53b058c94700aabad2d932a78c976", "content": "NEW YORK (CBSNewYork) — A father and mother have been arrested and charged after the man’s gun accidentally discharged, striking their 9-month-old daughter in Brooklyn on Saturday, police said.\nAs CBS2’s Ilana Gold reported, the father, 47-year-old Pedro Rosales, was behind bars at the 75th Precinct Sunday morning in connection with the shooting of Jessica Rosales.\nThe mother, Jessica Aguilar, 24, is facing charges for failing to supervise.\nThe couple also face reckless endangerment and weapons charges, WCBS 880’s Monica Miller reported.\nAs CBS2’s Steve Langford reported, the couple failed to provide a straight story about how it happened, according to police, who said Rosales shot the little girl in the hip while cleaning an unlicensed Colt .45 handgun in his East New York apartment.\nThe baby was rushed to Bellevue Hospital Center, where she underwent surgery. She was listed in stable condition and is expected to recover, CBS2’s Tracee Carrasco reported.\n“I’m just praying that the child is OK,” neighbor Tiffany Sanders said.\n“I’m very hurt,” another neighbor said. “It was a 9-month-old baby, and it’s sad. Very sad.”\n“I don’t know what happened in the house. It could have been a mistake, it could — I don’t know, but from outside looking in, it looks bad,” said neighbor Torrance Davis.\nPolice spent hours overnight at the Sutter Avenue apartment complex after the two parents flagged them down, saying their child was shot.\n“I never suspected that he would carry any gun because he’s a working man,” Sanders said of the father. “He’s a good person.”\nOn Sunday, Brooklyn Borough President Eric Adams called for stiffer penalties for people convicted of having illegal loaded weapons around children, Miller reported.\n“It is important that a strong message is sent when a 9-month-old baby is shot by their dad,” he told 1010 WINS’ Roger Stern.\nAt a news conference, Adams said he is working with state Assemblyman Nick Perry, D-Brooklyn, to draft a bill that would set the prison sentence for offenders at five to 25 years. The current penalty for illegal possession of a loaded weapon is 3 1/2 to 15 years.\n“We can’t continue to have a culture where illegal guns are in homes or premises with children,” Adams said. “Children should be around toys, not weapons.”\nPolice said Rosales has been previously arrested on weapons-related charges.\nRosales and Aguilar were expected to be arraigned at Brooklyn Criminal Court overnight, Carrasco reported.\nYou May Also Be Interested In These Stories"}