{"uri": "http://www.adn.com/alaska-news/2016/08/05/man-wanted-in-sunday-east-anchorage-shooting-surrenders/", "title": "Man wanted in Sunday shooting surrenders after a confession video surfaces", "dct": "Fri, 05 Aug 2016 00:00:00 GMT", "id": "c0c166544eef2c5e6208114fa16ae543", "content": "The man wanted after Sunday's East Anchorage death of a driver who was shot inside his vehicle surrendered to police Friday morning, a short time after a Facebook video was posted in which a man claiming to be the suspect gave a confession.\nPolice spokeswoman Jennifer Castro said in a Friday statement that Deandrew Lee Jennings Walker-Webster II, 18, was in custody after \"turning himself in to authorities.\"\nWalker-Webster has been charged with manslaughter in the death of 17-year-old Xeryus Tate, whose body was found next to his 1995 Honda Accord near Fourth Avenue and Newell Street about 2 a.m. Sunday.\nThe Facebook video, posted by user Xavier Johnigan about an hour before police announced Walker-Webster's surrender, showed a man who identified himself as Walker-Webster saying he will soon be turning himself in. The video appeared to have been taken with a handheld camera or phone in a clean, narrow residential hallway.\nThe muscular man in the video took responsibility for shooting Tate, also known as \"Iggy.\" He said the shooting was not deliberate but added he was prepared for the consequences.\n\"The people who say I murdered Iggy on purpose, that's not what happened; it was an accident,\" the man said. \"I shouldn't have been playing with the gun in the first place, but hey — it happened.\"\n\"When he got shot I was standing there watching him talk to me, and he stopped breathing in my hands,\" the man said. \"So for people to say I did this just out of spite or evilness is a lie.\"\nCastro said police couldn't confirm the video's authenticity Friday morning.\nThe man in the video signed off by thanking his loved ones for their support and said he appreciated his upbringing.\nIn charging documents, police said witnesses inside the Honda Accord reported that Walker-Webster was sitting in the vehicle's back seat Sunday when he pulled out a handgun. The gun discharged and fatally wounded Tate, police said."}