{"uri": "http://woodtv.com/2016/06/18/police-investigating-shooting-in-muskegon/", "title": "Teen shooting victim’s mom: ‘He was trying to get away’", "dct": "Sat, 18 Jun 2016 21:50:00 GMT", "id": "64c4da2955540d8dc6eb97340d571508", "content": "MUSKEGON, Mich. (WOOD) — A 17-year-old was killed and two other people were hurt in a shooting in Muskegon Saturday evening.\nThe shooting happened at around 8 p.m. on East Isabella Avenue and Madison Street near Sheldon Park.\nMuskegon police say responding officers found three victims, two 18-year-old men and the 17-year-old, suffering from gunshot wounds in a yard. All of the victims were taken to an area hospital, where the 17-year-old died as a result of his injuries.\nSunday, family members identified him as Naethon Sims.\nThe 18-year-olds were treated for non-life threatening injuries.\nSims’ mother, Kerri Sims, identified them as his brother and friend.\nKerri Sims told 24 Hour News 8 on Sunday that three men had been knocking on doors asking for the brothers and their friend. She said they were shot as they ran away. She said a neighbor called her to tell her what happened, but it was too late.\n“Stop this violence,” she said. “It’s got to stop. My son didn’t bother anybody. He was trying to get away.”\nSunday, a makeshift memorial with flowers and stuffed animals was growing near where Sims was fatally shot. A vigil was held there starting at 8 p.m.\n“He had a good heart,” Sims’ ex-girlfriend Anecia Morse said Sunday. “He didn’t do nothing to nobody.”\nPolice said Monday afternoon that a person of interest is in custody.\nOfficers asked anyone with information about what happened to contact Muskegon Police at 231.724.6750 or Silent Observer at 231.722.7463. Silent Observer callers may remain anonymous.\n–24 Hour News 8’s Sarah Hurwitz contributed to this report.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}