{"uri": "http://www.tulsaworld.com/news/crimewatch/second-victim-of-gunfire-at-freedomfest-says-bullet-felt-like/article_5e805e9f-a257-5b72-bab3-88a314e40263.html", "title": "Second victim of gunfire at FreedomFest says bullet felt like a baseball bat to his face", "dct": "Thu, 07 Jul 2016 00:00:00 GMT", "id": "4c4be94f902d27271c1421c9e8fa79c3", "content": "Related story — Possible celebratory gunfire during FreedomFest sends boy, 9, to hospital with head wound\nVIDEO: FeedomFest, Fireworks and Bullets-Branon Vaughan\nThe second victim of suspected celebratory gunfire during FreedomFest thought he had been smacked in the face with a baseball bat as he walked back to his car after enjoying the annual Fourth of July fireworks display.\nThe force of the impact made Branon Vaughan stumble left, then to the right, finally dropping to a knee with his arms on a wall to brace himself. The 35-year-old wondered if he had walked into a street sign. Seeing none in the area, he reasoned it might have been a beer can thrown at him.\n“I really thought it was a beer can,” Vaughan told the Tulsa World on Wednesday. “There was no exit wound, and it stopped bleeding in minutes.”\nMedical personnel discovered that Grant Pinkstaff, who turns 10 this Sunday, also suffered a bullet wound to the head after he complained to his parents that he felt something strike him while in Veterans Park as fireworks exploded overhead.\nThe child was admitted to a local hospital that night and was in fair condition Wednesday evening, a hospital spokeswoman said.\nHis parents, Mark and Annette Pinkstaff, told KTUL-TV that the bullet has not been removed and will remain in his head.\nThey reported on a GoFundMe page that Grant has severe headaches and pain from a brain injury.\nSoon after they learned that it was a bullet that had hurt their child, the parents thought for a time that he might not survive, Annette Pinkstaff said. However, the boy is expected to make a full recovery except for partial loss of vision in his right eye, KTUL reported.\nMark Pinkstaff asked that anyone who knows of someone shooting a gun during the fireworks show contact the police.\nTulsa Police Department spokesman Leland Ashley said officers have received no reports of gunshots in the area, nor of a person firing a weapon. Without tipsters stepping forward, Ashley said, investigators don’t have anything to go on to potentially locate the shooter, who might have been in a nearby neighborhood and not at Veterans Park.\n“It’s virtually impossible to differentiate between fireworks and gunshots,” Ashley said.\nAn estimated 80,000 spectators were expected to watch the Folds of Honor FreedomFest fireworks show, which began about 9:40 p.m. and ended around 10 p.m. Monday.\nVaughan had been at Veterans Park with family and friends to enjoy the festival and fireworks. The group was walking northeast of the park after the show to his car, which was parked at 18th Street and Boston Avenue.\nHe said he could feel the round lodged in his right cheek but that it didn’t occur to him that he had been struck by a bullet. His friends drove him to J. Bradley’s in Brookside — a place he owns with two others — to put ice on the wound.\nThe pain only got worse the next day, Vaughan said, and at the encouragement of family he checked himself into St. John Medical Center around midnight. Within an hour of seeing a doctor, Vaughan said, tests confirmed that a round-shaped foreign metallic object had entered through the side of his face and settled down near the right side of his chin.\nVaughan was awaiting a call from an ear, nose and throat specialist on Wednesday before undergoing surgery to remove the bullet. The doctor at St. John told him it’s more likely to be struck by lightning than a falling bullet.\n“The symptoms will probably just tissue over,” he said, indicating that it hurts to touch but otherwise is OK. “The entry wound isn’t bad; it’s already healed — just a little swollen.”\nVaughan hopes the shooter steps forward to hold himself or herself accountable, but he doesn’t expect to that to happen. He said any witnesses to the gunfire who don’t tell the police also are responsible.\n“I think that it impacts our city,” Vaughan said. “We want to live and eat and work in a safe place. We want to go to the river with our children and think it’s safe.”\nAnyone with information may contact Crime Stoppers at 918-596-COPS or text TIP918 to CRIMES."}