{"uri": "https://www.dnainfo.com/chicago/20160428/humboldt-park/amari-brown-murder-leads-charges-against-second-man", "title": "Amari Brown Murder Leads To Charges Against Second Man", "dct": "Thu, 28 Apr 2016 13:22:00 GMT", "id": "3d0bd10a6959c91ae846959ede7a9f36", "content": "COOK COUNTY CRIMINAL COURTHOUSE — A second man has been charged in the July 4 murder of 7-year-old Amari Brown.\nAmari was just getting home from watching fireworks with his family July 4 when two men opened fire in the 1100 block of North Harding Street about 11:50 p.m., Assistant State's Attorney Jamie Santini said during a bond hearing Thursday.\nAmari was fatally shot in the chest, prosecutors said, while a 27-year-old woman was shot twice in the chest and survived.\nRasheed Martin, 21, was charged in late July with first-degree murder. At the time, prosecutors said Martin admitted to firing a single shot before implicating an accomplice.\nAuthorities now believe that accomplice was 21-year-old Jamal Joiner, who was charged this week with first-degree murder.\nJoiner is already being held without bail in Cook County Jail, where he awaits trial in a separate murder case. In that case, Joiner is accused of fatally shooting 36-year-old Courtney Jackson in April 2015.\nAccording to prosecutors, Martin and Joiner are members of the Black Flag faction of the Four Corner Hustler gang.\nThe pair were involved in an ongoing feud with a rival faction that resulted in shootings on April 17, May 23 and July 4 of 2015, authorities said.\nAbout 11:50 p.m. July 4, Martin, Joiner and at least two other people were walking near the 1100 block of North Harding Avenue when they spotted rival gang members, prosecutors said. Amari and the female victim were standing next to those gang members.\nMartin and Joiner opened fire — striking Amari and the 27-year-old victim in their chests, according to prosecutors.\nAfter the shooting, Martin fled to Wisconsin, where he was arrested based on witness testimony on July 22, Santini said. Martin told police he carried a gun and fired one shot that evening, and that Joiner was responsible for firing multiple shots, prosecutors said.\nAccording to Santini, Joiner admitted to someone that he fired a gun on July 4 in the direction of rival gang members who had shot at him earlier — and that he knew Amari got shot that evening.\nJoiner was previously convicted of robbery and drug possession. He has pending cases for drugs and murder.\nCook County Judge Peggy Chiampas on Thursday ordered Joiner held without bail.\nRelated Links:\n• 7-Year-Old's Killing Inspires Hoops Star To Create 'Stop the Violence' Game\n• Students Speak Out on Violence, Create Amari Brown-Inspired 'Peace Mural'\n• 7-Year-Old Amari Brown's Alleged Killer Admits Firing A Shot: Prosecutors\n• Man Suspected in Killing 7-Year-Old Amari Brown Arrested\n• Remembering Amari Brown: Community Comes Together to Mourn Slain 7-Year-Old\nFor more neighborhood news, listen to DNAinfo Radio here:"}