{"uri": "http://fox6now.com/2015/05/26/three-men-with-prior-convictions-charged-in-connection-with-kendrai-walkers-death-shooting-at-his-vigil/", "title": "Three men with prior convictions charged in connection with Kendrai Walker’s death, shooting at his vigil", "dct": "Tue, 26 May 2015 19:54:00 GMT", "id": "4634ada2f2051bbf3f782cd766a59446", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nMILWAUKEE (WITI) -- Three men, who each have prior criminal convictions, are now facing charges in connection with the shooting death of 18-year-old Kendrai Walker, and a shooting that occurred one day later at a vigil held in Walker's honor.\nThose charged include:\n35-year-old Brian Echols of Milwaukee\nCharged with possession of a firearm by a felon\n38-year-old Lonell Echols of Milwaukee\nCharged with first degree recklessly endangering safety and possession of a firearm by a felon\n27-year-old George Eskridge of Des Moines, Iowa\nCharged with first degree recklessly endangering safety and two counts of possession of a firearm by a felon\nOn Friday, May 15th, police were dispatched to 28th and Auer, where they found 18-year-old Kendrai Walker suffering from several gunshot wounds. Walker was pronounced dead at the scene.\nThree .380 caliber cartridge casings were recovered near Walker's body.\nAn autopsy revealed Walker died as a result of multiple gunshot wounds, and his death was ruled a homicide.\nOne day later, officers were called back to the scene for several wounded individuals. A shooting occurred as loved ones gathered for a vigil for Walker. At the scene, police recovered five 9mm casings, one .22 caliber casing and a .380 caliber casing. Five people were found to have been shot and injured.\nKendrai Walker's own mother was found on the ground in the 3100 block of N. 29th Street -- suffering from three gunshot wounds (one to the right rear, one above her left knee and one to her inner thigh).\nA woman sustained a gunshot wound to her left arm. She said she heard gunshots while on the scene of a vigil, and raised her hand to cover her face when she felt pain in her left arm. She told police she did not see who was shooting.\nAnother woman sustained a single gunshot wound to her right leg. She said she was caught in gunshots while on the ground. This woman was able to positively identify Eskridge and Lonell Echols as being two of the individuals who shot toward the group during the vigil. She identified them via a lineup.\nA man sustained a single gunshot wound to his left shoulder. He said he was at the vigil when he heard one shot and then saw someone shooting toward the group that had gathered for the vigil. He then ran from the scene.\nAnother man was shot in his left flank. He was able to identify Eskridge and Lonell Echols as being two of the individuals who shot toward the group during the vigil -- identifying them via a lineup.\nTwo days after Kendrai Walker was shot and killed, on May 17th, police stopped a vehicle in the 800 block of W. Hampton Avenue in Glendale. George Eskridge was located in the rear passenger seat. Brian Echols was in the rear driver's seat.\nPolice found an unloaded 20 gauge shotgun, a 9mm semiautomatic firearm loaded with .380 ammunition and a loaded .357 magnum revolver in the vehicle.\nThe three .380 caliber casings police recovered near Kendrai Walker's body were sent to the Wisconsin Crime Lab for analysis. It was determined that these casings were fired from the same firearm -- and it was further determined that the casings came from the 9mm firearm recovered during the traffic stop.\nPolice spoke with Brian Echols about the firearms recovered from the vehicle. He admitted to purchasing all three weapons recently.\nWhen police spoke with George Eskridge, he said that he witnessed Brian Echols shoot Kendrai Walker. He said that he was driving with Brian Echols after the incident, and during the drive, Echols said he had shot Walker in the head.\nEskridge told police he was also present during the shooting that occurred during the vigil for Walker. He said Brian Echols wasn't there, but Lonell Echols had a weapon, as did another man. After the shooting, Eskridge told police Brian Echols returned to the scene. Eskridge admitted to police that the shotgun recovered during the traffic stop in Glendale was his.\nIn a separate interview, police say Eskridge admitted to discharging the .357 caliber revolver.\nLonell Echols told police he observed Eskridge to have several weapons -- including a machine-type gun, a revolver and a shotgun. Echols admitted to handling a revolver as well as a 9mm firearm -- saying it was probable that his fingerprints and/or DNA would be found on them. Echols told police he saw Eskridge discharge the machine-type gun toward the group that had gathered for the vigil. Echols said after the shooting, he asked Eskridge why he had done it, and Eskridge admitted it was his fault.\nThe complaint indicates Brian Echols has previously been convicted of attempted murder in Cook County, Illinois.\nGeorge Eskridge has previously been convicted of second degree robbery in a case out of Johnson County, Iowa.\nLonell Echols has previously been convicted of robbery out of Racine County.\nEskridge, and Brian and Lonell Echols will be in court on June 1st for their preliminary hearings.\nMeanwhile, if you'd like to help out with Kendrai Walker's funeral costs, you can do so by CLICKING HERE."}