{"uri": "http://www.khou.com/news/crime/child-three-others-shot-near-downtown-houston/263983894", "title": "Three dead, two hurt in Fourth Ward shooting caught on video", "dct": "Tue, 05 Jul 2016 00:00:00 GMT", "id": "0d33f905e287643acd0c67b9908850a4", "content": "HOUSTON - A shooting killed at least three men and wounded a 10-year-old boy in Fourth Ward near downtown Houston late Monday.\nThe shooting occurred around 10 p.m. off Wilson Street near Robin Street, not far from Eleanor Tinsley Park where the Freedom Over Texas celebration was being held.\nHPD Homicide Division Sergeant D. Fontenot confirms a total of five people were shot. As of Tuesday morning, three were pronounced dead. A 10-year-old boy suffered minor injuries.\nPolice are investigating what events led up to the shooting. They say they are looking for multiple suspects in the case.\nIt's believed three to four suspects opened fire, aiming at one person in particular. The other four victims were apparently shot by accident, HPD says.\nWitness video shows kids lighting firecrackers in a can in the roadway before a car horn honks and gunfire is heard. In the background you can hear the fireworks show at nearby Eleanor Tinsley Park.\nRelatives identified one of the dead victims as 28-year-old Charles Jackson, a father of three girls.\n“…never been in trouble took care of his kids respected everyone and loved everyone,” said Rosaland Jackson, the victim’s great aunt. “People had to came to tell us Charles was shot, everyone went running down to see, but there was so many people - so much happening.”\n“We need to get together as more of a love and bring the community together, start loving more and start trusting God more.”\nFourth Ward is an historic but rapidly gentrifying area. People who've bought or rented expensive new homes just a few blocks from the shooting scene told KHOU off camera they're troubled by what happened. They call it a pattern of crime that doesn't seem to go away and has even caused many to move. For sale signs pop up around the neighborhood all the time.\nPolice say they're getting tips called in, but so far have no motive and no suspect description to pass along. If you have any information, call Houston Crime Stoppers at (713)-222-TIPS.\n(© 2017 KHOU)"}