{"uri": "http://www.khou.com/news/crime/mother-grieves-loss-of-2nd-son-in-a-month-1/278006602", "title": "Mother grieves loss of 2nd son in a month", "dct": "Thu, 21 Jul 2016 00:00:00 GMT", "id": "41191cd49578eff2e8bc96d4d54807b0", "content": "HOUSTON – For the second time in less than a month, a mother is grieving the death of a son.\nTwo brothers were killed just weeks apart – both believed to be the unintended victims of gunfire.\nJust Tuesday night, KHOU 11 News aired a story about 19-year-old named Daquarius Tucker, who was shot and killed on the Fourth of July. His big brother was killed early Wednesday morning.\nHouston Police say Damarcus Tucker was shot and killed in a drive-by on Rosalie Street, near the University of Houston.\n\"He was a good boy. I didn't even get to say bye,\" said Charlie Ferguson, Demarcus' father, during a press conference at The Forge For Families. \"It's crazy right now. I don't know what to say. It's shock to me.\"\nPolice believe he was killed during a case of mistaken identity, and they now have a suspect in custody.\nFamily members confirmed that Damarcus is the brother of Daquarius Tucker, who was also shot and killed back on July 4. Police had said he, too, was an innocent bystander. Tucker was laid to rest July 16; Damarcus was a pallbearer.\n“When you go see a family like that you are a person who is supposed to have the answers and words of encouragement and at this point there's just nothing to say,” said Dr. D.Z. Cofield.\nCofield, who has been trying to comfort the grieving mother, is a pastor at Good Hope Missionary Baptist Church.\n“As a matter of fact, his mother, after she just collapsed in my arms just crying said, ;At least he came forward at his brother's funeral and gave his life to God,'” he added.\nAs far as the suspect is concerned, he was pulled over and arrested at a Wing Stop near Wednesday’s murder scene. No word yet on who he is.\nDamarcus Tucker was a father and described as a great, funny guy.\n\"I just hope justice is served for my brothers,\" Raymond Tucker said.\nCommunity leaders and family members are asking for prayers and calling upon the community to come together.\n\"The other thing this family would love to see happen out of this is—beyond the rhetoric and beyond the words—what can be done to address the root issues behind the gun violence in our inner cities across the country,\" said Cofield.\nFriends have set up a GoFundMe page to help the family.\n(© 2017 KHOU)"}