{"uri": "http://www.click2houston.com/news/police-4-people-shot-near-downtown", "title": "Father among 3 killed in Fourth of July shooting in 4th Ward", "dct": "Mon, 04 Jul 2016 22:19:00 GMT", "id": "a7d537812394834364d4c29f8e6eac68", "content": "HOUSTON - Three men were killed and two people were hurt in a shooting Monday night near Wilson and Robin streets in the Fourth Ward, police said.\nA 10-year-old who was grazed by a bullet and a 37-year-old man were taken to Memorial Hermann Hospital, police said. The child is expected to be OK.\nTwo other shooting victims, ages 26 and 29, were taken to St. Joseph Hospital, where they died. Police confirmed Tuesday that a third person also died as a result of the shooting.\nThe Harris County Institute of Forensic Sciences confirmed Jamal Dixon-Lackey and Daquarius Tucker also died.\nVideo circulating on social media showed the sound of fireworks turning to gunfire.\n\"We heard a lot of strange sounds that didn't sound nothing like fireworks. And all of a sudden seen everyone running for cover. Kids and adults,\" Rosaland Jackson said.\nShe said many people ran to her family's store just down the street for cover. She said the dead included her nephew, 28-year-old Charles Jackson. She said he had three daughters.\n\"He don't bother nobody. He was innocent. He was with the kids firing firecrackers,\" his cousin Demetria Jackson said.\nCharles Jackson leaves behind three daughters, his family said.\n\"Charles was a very, very respectable young man. Everybody loved him,\" his aunt, Rosaland Jackson, said.\nAccording to police, a large group was gathered in the 1300 block of Robin Street for what investigators called \"an illegal fireworks display\" when a car pulled up and three to four men started shooting at one of the male victims.\n\"If the police had not have come when they did, there was going to be some scary stuff. It was scary. Very scary,\" Rosaland Jackson said.\nHouston police confirmed they got a call about 5 p.m. Sunday about shots fired. Officers said they sent two police cars within five minutes of the call but did not find that any shots had been fired.\nOthers claimed the police should have been in the neighborhood earlier.\n\"The saddest part is all day the citizens of this community was calling police about people packing these guns. All day. They started at 12 p.m. all the way to 9 p.m.\" Charonda Jackson said.\nNo arrests have been made, police said.\nAnyone with information on the identities of the gunmen is asked to contact the HPD Homicide Division at 713-308-3600 or Crime Stoppers at 713-222-TIPS.\nVIDEO: Daylight gives a clearer view of crime scene in Fourth Ward. 3 confirmed deaths. 2 others hurt. @KPRC2 pic.twitter.com/s24bGsZLeG\n— Brandon Walker (@KPRCBrandon) July 5, 2016\nCopyright 2016 by KPRC Click2Houston - All rights reserved."}