{"uri": "http://www.whio.com/news/news/crime-law/multiple-victims-reported-in-dayton-shooting/nnqSG/", "title": "No arrests in drive-by shooting that wounds 4", "dct": "Mon, 28 Sep 2015 00:00:00 GMT", "id": "16d51b23621922aa4bca72006705d722", "content": "At least four people were shot and wounded late Monday night in the 1900 block of Oakridge Drive in Dayton.\nNo arrests have been made, police said Tuesday\nPolice will not speculate on possible motive\nConditions of victims not known\nUPDATE @ 10:07 a.m. : Four men injured in drive-by shootings late Monday were all treated at Miami Valley Hospital for non-life threatening injuries, Dayton police said in a statement released to media..\nThe victims are ages 23, 26, 28, and 29, according to Lt. Wendy H. Stiver.\nThe shootings occurred about 11:30 p.m.\nAn initial investigation shows the victims were at 1921 Oakridge Drive when persons in an older, black pickup truck traveling west on Oakridge began shooting at them, according to the statement. There were at least two people firing from the truck.\nNo suspect information was available from police Tuesday morning.\nAnyone with information should call 937-333-COPS (2677) or Crimestoppers at 937-222-STOP (7867).\nUPDATE @ 3:05 a.m.\nInvestigators on scene declined to comment and release any information regarding the incident including potential suspects or suspect vehicle.\nThe conditions of the victims also remains unknown.\nWe will continue to monitor this story and will update this page with the latest as it develops.\nUPDATE @ 1:30 a.m.\nPolice continue to have the 1900 block of Oakridge Drive blocked with crime scene tape while homicide detectives investigate.\nOur crew is awaiting a statement by police for more details on the incident.\nUPDATE @ 12:45 a.m. (Sept. 29)\nOur crew on the scene is reporting at least 38 evidence markers on the ground in the 1900 block of Oakridge Drive in Dayton, but the exact number of shell casings recovered by investigators is not known.\nOfficers and detectives are on scene continuing to investigate, but have not given a statement yet to our crew on the details of the incident.\nUPDATE @ 11:55 p.m.\nAdditional reports to come through the newsroom indicate at least four people suffered gunshot wounds in the 1900 block of Oakridge Drive.\nReports also indicate this was an apparent drive-by shooting, but it’s unknown if police are searching for a specific vehicle at this time.\nThe conditions of the victims are also unknown.\nWe’ll have more information on this story as it becomes available.\nFIRST REPORT (Sept. 28)\nDayton police have responded to a shooting in the 1900 block of Oakridge Drive on reports of multiple people shot.\nSeveral officers and medics were sent just before 11:30 p.m. Monday after multiple people reported being struck with gunfire at different addresses in the 1900 block of Oakridge Drive.\nWe have a crew on the way and will update this story when new information is available."}