{"uri": "http://www.nbcsandiego.com/news/local/Two-Officers-Shot-in-Southcrest-Acacia-Grove-388626512.html", "title": "1 San Diego Police Officer Shot, Killed in Line of Duty, Second Seriously Wounded", "dct": "Fri, 29 Jul 2016 00:00:00 GMT", "id": "83c30cee53a1f485642553d428b74907", "content": "A San Diego Police Department officer has died and another officer remains hospitalized after a late-night shooting during a traffic stop just south of downtown San Diego. Both officers are part of the force's Elite Gang Unit.\nOn Friday evening, SDPD Chief Shelley Zimmerman named Jesse Michael Gomez, 52, as the suspect linked to the shooting. Gomez is in police custody. The chief identified Marcus Antonio Cassani as a \"possible\" suspect in the case, though police have yet to confirm if Cassani had any involvement in the shooting.\nAt an earlier new briefing Friday, Zimmerman identified the officers who were gunned down as Jonathan \"JD\" De Guzman, 43, a 16-year veteran of the force, and Wade Irwin, 32, a 9-year veteran.\nDe Guzman died from wounds suffered in the shooting. Irwin is seriously wounded but is expected to survive.\n\"I can tell you [De Guzman] is a loving, caring husband, father, talked about his family all the time,\" Zimmerman told reporters. \"I personally worked with him when I was a lieutenant at Mid-City Division. I know him. This is gut-wrenching. He cared. He came to work every single day just wanting to make a positive difference in his community.\"\n\"I can’t begin to put in words the emotions and feelings that surround an event like this. This is one of the most difficult and heart-wrenching situations for police officers to go through,\" Zimmerman added.\nAccording to the chief, Gomez was arrested shortly after the shooting Thursday night. He was found by police in a ravine in the 1300 block of 38th Street. According to reports from the Associated Press, a trail of blood led police to Gomez. Zimmerman said Gomez had suffered a gunshot wound.\nAs of 11 a.m. Friday, the suspect remained hospitalized in critical condition.\nPolice believed there many have been additional suspects tied to the shooting of the police officers. A manhunt was launched in Southcrest and surrounding areas, including San Diego's nearby Shelltown neighborhood. A shelter-in-place order was issued to some residents as police scoured the area just west of where Interstate 15 and Interstate 5 meet, near Barrio Logan and Logan Heights.\nThe manhunt continued into Friday morning as authorities used a helicopter, SWAT vehicles and patrol cars.\nAt around 8:10 a.m. Friday, officers surrounded a home in Shelltown, at 41st and Epsilon streets, honing in on another possible suspect.\nA standoff unfolded, which continued for several hours.\nSWAT officials could be heard calling out to someone inside the home, Cassini, saying, \"Come to the door. It's been a long night.\"\nThe sounds of dozens of flash bangs filled the air as the SWAT standoff unfolded. Negotiators continued calling out to Cassini: \"No one is going to hurt you. This has gone on long enough.\"\n\"We hear you coughing in there,\" SWAT officials called out. \"We know you're hurting in there. Man up. This isn't going to get any easier.\"\nAbout three hours into the standoff, officials outfitted themselves with masks and began running hoses into the house, getting ready to dispense tear gas.\nAt 12:20 p.m., it appeared SWAT officers were making entry into the home. NBC 7 crews could hear glass shattering at the scene as officers entered the house from a back door.\nAbout an hour later, the standoff ended. Police confirmed Cassini had been taken into custody for an outstanding warrant at that location, dubbed a \"possible\" suspect by investigator.\nShortly thereafter, just before 2 p.m., police officers surrounded a second home in the Shelltown area, at 41st and Delta streets, in search for additional possible suspects. That SWAT situation soon ended, and no arrests were made.\nLeading up to the manhunt and standoffs, here's how Thursday night's officer shootings unfolded: De Guzman and Irwin were conducting the traffic stop shortly before 11 p.m. in the 3700 block of Acacia Grove Way near Boston Avenue in San Diego's Southcrest neighborhood when they were fired upon, Zimmerman said.\nThe chief said it is still unclear if the traffic stop was on a vehicle or a pedestrian. Shortly after stopping their car, the officers called for emergency cover.\nAdditional law enforcement officers swarmed the area. They found both officers suffering from gunshot wounds.\nDe Guzman, who suffered multiple wounds, was rushed in a patrol car to Scripps Mercy Hospital in Hillcrest. Doctors were unable to save his life.\nIrwin was taken to UC Medical Center, also in Hillcrest. At around 3:30 a.m., the officer had come out of surgery and was recovering, the police chief said. Irwin has a wife and 19-month-old toddler, Zimmerman said.\n\"It's a long haul until he makes a full recovery, but the good news is that he is going to survive, and he is going to recover,\" Zimmerman said.\nThe mood at the hospital was somber as dozens of officers from all ranks came in and out of the building all morning. Zimmerman said the situation was simply heartbreaking for her police department. She too went in and out of the hospital, comforting the families of the officers.\nOther SDPD leaders, including Asst. Chief Terry McManus and Capt. David Nisleit, also visited the hospital. As officers filed in, they greeted one another with hugs and pained expressions.\n.@ChiefZimmerman just left the hospital where our second Officer has just come out of surgery. He is expected to survive!!\n— San Diego Police (@SanDiegoPD) July 29, 2016\nBREAKING: We have one suspect in custody. We are still searching the area for other possible suspects.\n— San Diego Police (@SanDiegoPD) July 29, 2016\nZimmerman said the the shooting occurred \"seconds to a minute or so,\" both officers were wearing personal body cameras, and \"there is video evidence.\"\nWith the preliminary investigation underway, Zimmerman said details of what happened could change. At this point, however, the chief did not say whether the shooting was an ambush.\nSources told NBC News the suspects are believed to belong to a local San Diego gang and there is no indication at this stage of the investigation that the officers were specifically targeted, as in recent incidents in Dallas and Baton Rouge that collectively claimed the lives of eight officers.\nMeanwhile, San Diego Mayor Kevin Faulconer released this statement Friday morning on the tragedy:\n“Last night we lost one of San Diego’s finest. We grieve for our fallen officer and stand with his family during this very difficult time. We also pray for the second officer shot last night as he recovers from surgery. Violence against the men and women who wear the badge is violence against us all. I ask all San Diegans and all people across our nation to join together in support of our officers who courageously protect our communities. We need them and they need us.”\n.@SanDiegoPD and SWAT are calling on \"Marco\" to come out at Epsilon near 41st #nbc7pic.twitter.com/JkZEPZYq7z\nThe National Action Network (NAN) San Diego , a community organization led by Reverend Shane Harris, released a statement regarding the shooting, \"We condemn anyone who uses vengeance as a tool to kill innocent police or innocent victims.\"\nSan Diego County District Attorney Bonnie Dumanis also released a statement Friday morning which said, in part:\n\"This senseless act once again highlights the dangers our peace officers face on a daily basis as they work to ensure and protect the public’s safety. The District Attorney’s Crimes Against Peace Officers Unit is working closely with SDPD to investigate and review this case so those responsible for this cowardly act will be held accountable.\"\nZimmerman also called the shooting of her officers \"senseless.\"\n\"Police officers go out every single day, that wear a badge with pride. We all took an oath to protect and serve all of our communities. To have this happen to our police officers. We've seen this happen way too many times just in these last few weeks across our great country. It is tragic for everyone,\" Zimmerman added.\nThe last time an SDPD officer was killed in the line of duty was in 2011, when Officer Jeremy Henwood was shot in San Diego's City Heights community.\nSince 1913, the city has lost 33 officers in the line of duty."}