{"uri": "http://www.seacoastecho.com/article_8396.shtml#.VHkBtMna671", "title": "9-year-old boy shot in groin in local accident", "dct": "Sat, 22 Nov 2014 00:10:00 GMT", "id": "0b60a75d350937be6caa89a7f88d0af2", "content": "10Share var addthis_config = {\"data_track_addressbar\":true};\n9-year-old boy shot in groin in local accident\nBy Dwayne Bremer\nNov 22, 2014, 00:10\nA nine-year-old child last Friday accidentally shot himself in the groin during a family gathering in Bay St. Louis, authorities said Thursday.\nBay St. Louis Lt. Detective Robert O'Neal said Thursday that police responded to a report of an accidental shooting on Bay Oaks Drive about 10:50 p.m. on Friday Nov. 18.\n\"There was a family gathering at the home,\" O'Neal said. \"During the gathering, some of the children went to a vehicle outside to listen to some music. There was a .22 caliber revolver in the car and one of the kids began playing with it. The gun accidentally went off and struck the child in the groin area.\"\nO'Neal said there were three other children in the vehicle when the gun went off.\nThe victim, a nine-year-old boy, was the only person injured, he said.\nThe child was taken to Gulfport Memorial Hospital and later transferred to Children's Hospital, O'Neal said.\nNo update on the child's condition was available by press time Friday.\nO'Neal said the incident has been determined to be an accident and no charges will be forthcoming.\nHe said the incident should serve as a reminder that gun safety is very important.\n\"People need to make sure that their weapons are locked and put in a safe place,\" O'Neal said. \"Accidents can happen any time, but taking proper precautions can limit them.\"\n/* <![CDATA[ */ var myDate = new Date; var thisyear = myDate.getFullYear(); document.write('<div align=\"center\">Copyright &copy; 2004 - ' + thisyear + ' www.seacoastecho.com<\\/div>'); /* ]]> */ Copyright © 2004 - 2017 www.seacoastecho.com &lt;div align=\"center\"&gt; Copyright &amp;copy; 2004 - present seacoastecho.com &lt;/div&gt; var gaJsHost = ((\"https:\" == document.location.protocol) ? \"https://ssl.\" : \"http://www.\"); document.write(unescape(\"%3cscript src='\" + gaJsHost + \"google-analytics.com/ga.js' type='text/javascript'%3e%3c/script%3e\")); try { var pageTracker = _gat._getTracker(\"ua-8154382-4\"); pageTracker._trackPageview(); } catch(err) {}"}