{"uri": "http://wreg.com/2014/10/29/several-people-shot-at-memphis-apartment-complex/", "title": "Five people shot at Memphis apartment complex", "dct": "Wed, 29 Oct 2014 14:22:00 GMT", "id": "7afd02cda31226973c3bf8c36fde29c8", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nMEMPHIS, Tenn -- Police are searching for a group of men who shot five people in Raleigh.\nOne of the victims, a woman trying to break up the fight, was shot in the head.\nWitnesses said the shooters didn't care who they hit when they opened fire at the Lexington Apartments near the intersection of Yale and Ramill Roads.\nWitnesses said the trouble started in a white car and green car, both of which police had towed from the scene.\nWitnesses said a group of guys in each of the cars were yelling back and forth at each other in the middle of the complex Wednesday afternoon.\nOne witness told WREG a woman tried breaking up the fight when she was shot in the head, and the next thing you know, bullets were flying everywhere.\nFour other men were hit.\nKids were coming home from school as officers were collecting evidence. The children were escorted through the crime scene.\n\"It is really sad. These apartments are really nice. It's just the people who live in the apartments that are making it rough over here,\" Betty Morris said.\nMorris was shaking when she pulled up to the complex. Thankfully, her husband who works there wasn't hurt.\n\"I was hoping he was OK. He was fine,\" she said.\nFamily members said some of the victims live at the complex, and the woman shot was on vacation visiting her boyfriend.\nWhat's even worse, they said one of the victims just got out of the hospital after being shot last month.\n\"It is sad. The violence needs to stop. It really does. It needs to stop,\" Andrea Jennings, who lives next to the complex, said. \"Everybody wants to be the bad man. Everybody wants to run around with the guns. It's everywhere. It's everywhere! It's sad.\"\nWhile a man was put in the back of the cruiser, police said no arrests have been made as of Wednesday night.\nPolice did not release a description of the suspects, but said they are looking for three to four men.\nAs of Wednesday night, three victims were in critical condition at Regional Medical Center, and two others were expected to be OK.\nWREG will keep you updated on this story."}