{"uri": "http://wjla.com/news/crime/report-shooting-at-westfield-montgomery-mall-in-bethesda", "title": "Suspect captured in alleged deadly shootings at Mall, High Point HS, Giant store", "dct": "NODATE", "id": "a52b41a2363b41afeffdbb01a68c3159", "content": "BETHESDA, Md. (ABC7/WJLA) -- Shortly before 3 p.m. on Friday, Eulalio Tordil, 62, the suspect in three separate shootings in Maryland was quietly taken into custody. Tordil was wanted for the shootings at Westfield Montgomery Mall and at an Aspen Hill Giant store on Friday and at High Point High School in Beltsville on Thursday that left three dead and three injured, including Gladys Tordil, his estranged wife, police say.\nAt this time, Tordil has been charged with first-degree murder and related charges in connection with the fatal shooting of his estranged wife.\nAs police zeroed in on Tordil's location, he reportedly was eating at the Boston Market close to the Giant store. He was captured without resistance and led away to a police car.\nABC7 reporters and photographers were on the scene of the arrest and caught it on video:\nOne man died from the Montgomery Mall shooting in Bethesda and one woman died from injuries sustained in the shooting at the Giant grocery store in Aspen Hill Friday morning, according to police. On Thursday, Tordil's estranged wife was killed at High Point High School in Beltsville.\nMontgomery County Police responded to 7101 Democracy Blvd. at approximately 11:30 a.m. to investigate reports of the Montgomery Mall shooting.\nAn investigation revealed three people were shot during the incident. One man was killed and a second was reported to be in critical condition. A woman also sustained non life-threatening injuries, according to police.\nThe second shooting was reported shortly after at a Giant grocery store located in the 13700 block of Connecticut Avenue at approximately 11:50 a.m.\nThe victim in that shooting, a woman, died from her injuries, according to police.\nThere was speculation that the suspect in both of the shootings was 62-year-old Eulalio Tordil, who was already wanted in connection with the shooting death of his estranged wife Gladys Tordil Thursday at High Point High School in Beltsville in Prince George's County, sources told ABC7.\nHe also shot a Good Samaritan at High Point High School who tried to intervene and stop the escalating domestic situation. That Good Samaritan is in the hospital in \"stable condition,\" we are told.\nRELATED: Police looking for suspect who killed 1, wounded 1 in domestic shooting at high school\nPolice say Eulalio Tordil is an employee of the Federal Protective Service at Homeland Security.\nSources tell ABC7 that Gladys Tordil, a teacher at Parkdale High School, had a protective order against her estranged husband and that he had been ordered to surrender his service weapon.\nTordil was thought to be driving a four door, silver sedan with Pennsylvania tags (JZA-0123), ABC7 learned. Police advised media in the area to take shelter, as the suspect was still at large and could be nearby.\nAll Montgomery County public schools and the Montgomery County Recreation Department were placed on \"shelter in place\" status while the investigation into the shootings was ongoing. At about 2 p.m. the schools shelter in place was lifted.\nSuburban Hospital and the National Institutes of Health were also placed on lockdown following the shootings."}