{"uri": "http://www.nbcwashington.com/news/local/Shooting-Reported-at-Mall-in-Bethesda-Police-Say-378417311.html?update4", "title": "Suspect in Maryland Shootings Charged With 3 Counts of Murder", "dct": "Fri, 06 May 2016 15:31:00 GMT", "id": "e11518f117708e01d308f72d9e5eaee2", "content": "Police have charged the man suspected of killing two people and injuring two others at Montgomery County shopping centers on Friday and the fatal shooting of his estranged wife on Thursday in Prince George's County.\nEulalio Tordil, 62, was arrested Friday afternoon after he was suspected of terrorizing the Maryland suburbs of Washington, D.C., for two days.\nHe was charged with two counts of first-degree murder, two counts of attempted first-degree murder and four counts of use of a handgun in the commission of a felony in connection with the Montgomery County shootings.\nTordil was charged with first-degree murder and related charges in connection with the fatal shooting of his estranged wife at High Point High School in Prince George's County on Thursday. He’s also charged with assault for shooting the good Samaritan at the school.\nMontgomery County police announced his arrest at a press conference on Friday afternoon, the end of a manhunt that forced officials to heighten security at schools and government buildings.\nTordil, a Federal Protective Service employee, shot and killed his estranged wife on Thursday when she went to pick up her children from the High Point High School, police say.\nDramatic surveillance video shows officers in unmarked cars swarm Tordil's car and surround the Federal Protective Service employee with guns drawn.\nEarlier Friday, two people were killed and two others were injured in shootings at a mall and a shopping center in Montgomery County, Maryland. Police believed all the shootings are related. They believe the Friday shootings resulted from attempted carjackings.\nThe shootings Friday struck fear in the D.C. suburbs. Students and staff at all Montgomery County schools sheltered in place for some time Friday. Lockdowns were in place at other institutions in the area, including Suburban Hospital in Bethesda.\nThe National Institutes of Health main campus was on \"heightened alert,\" a spokesman said.\nIn a ghastly coincidence, the shopping center is within sight of the scene of one of the 2002 Beltway sniper shootings, which remain all too fresh in the memory of many people in the D.C. area.\nTwo Sets of Shots Ring Out\nPolice patrolling Westfield Montgomery mall in Bethesda, Maryland, about 11 a.m. Friday happened upon the shooting scene in the parking lot, police said.\nPolice said they believe the victims at the mall did not know the shooter. A woman appeared to have been shot first. The gunman shot two men who came to her aid, police said.\nOne witness told News4 the woman was walking toward Macy's when a man approached her and asked where she was going. When the woman didn't answer, the suspect reached into his car, pulled out a gun and began firing.\nThe woman was shot in the shoulder, the witness said.\n\"We have no reason to believe the victims knew the suspect,\" Montgomery County Assistant Chief Darryl McSwain said. \"But we are certainly looking at all angles.\"\nThe woman suffered non-life-threatening injuries. One of the men died. The second man was in grave condition Friday afternoon, police said.\nAs police investigated that scene, they received a 911 call reporting a shooting outside the Giant grocery store on the 13000 block of Connecticut Avenue in Aspen Hill, Maryland, about 8 miles northeast of the mall.\nA woman there was shot and killed, police said.\nPolice have not identified any of the victims.\nWatching the Suspect, Making the Arrest\nThe anxious hours ended when Montgomery County police officers in plainclothes spotted Tordil's car. It was parked in a shopping center across Connecticut Avenue from the shopping center where the second shooting occurred Friday, Montgomery County Police Chief Tom Manger said.\nOfficers then spotted Tordil himself going from business to business, including into a Boston Market, where he ate, and into a Dunkin' Donuts.\nOfficers watched Tordil, choosing to surround his car and wait.\n\"Knowing that the suspect was armed, knowing that the suspect had made statements about what he intended to do, we needed to make sure the public was safe when we took him into custody,\" the Montgomery County police chief said.\n\"Our fear was that he was armed. Since he had already shot four people, we certainly did not want any other bloodshed here,\" Manger said. \"The plainclothes officers waited until it was safe to take him into custody, and that's what they did.\"\nSurveillance video shows Tordil walk to his car with what looks like a bag of ice. He steps into the car, shuts the door and then officers in unmarked cars surround him, bumping the car and effectively forcing him to stay inside.\nOfficers took Tordil into custody and drove him away from the scene.\nThe First Victim?\nOn Thursday, police believe Tordil shot and killed his estranged wife, Gladys Tordil, and shot and injured a man who tried to help her about 4:40 p.m. Thursday at High Point High School in Beltsville, Maryland.\nGladys Tordil, who was 44, was a chemistry teacher at Parkdale High School in Baltimore County, Maryland, the school said in a letter to parents.\n\"Ms. Tordil was a beloved staff member. Students will be deeply affected by her death,\" the letter said.\nThe District Court of Maryland for Prince George's County ordered Tordil in March to stay away from his wife, her home, her workplace and High Point High School -- where police said he killed her, court documents show.\nGladys Tordil told the court Eulalio Tordil beat her and sexually and physically abused two children. In 2010, he slapped her so hard her glasses broke on her face, she told the court. She had filed for divorce, court documents say.\nThe court allowed Eulalio Tordil to use his work-issued firearm while he was at work. He was instructed to leave it at work during non-work hours.\nEulalio Tordil is being held without bond. He's due in court Monday. It was not clear if Eulalio Tordil had an attorney."}