{"uri": "http://www.ksat.com/news/man-charged-in-shooting-death-of-7-year-old-girl-proclaims-innocence", "title": "Man charged in shooting death of 7-year-old girl proclaims innocence", "dct": "Wed, 08 Jun 2016 12:35:00 GMT", "id": "21e02dedeb0ab95db0c322740cc1391d", "content": "SAN ANTONIO - A 28-year-old man charged in the fatal shooting of a 7-year-old girl said Wednesday that police have the wrong suspect.\nFrank Gomez proclaimed his innocence in a jailhouse interview with KSAT 12 News reporter Jessie Degollado.\n\"They gave me capital murder for something I didn't do,\" Gomez said. \"I had no play. I had no part. I'm innocent, you know. I didn't do nothing. I was just at the wrong place at the wrong time.\"\nGomez said he ducked down in the car when he claims someone else fired the gunshots that killed Iris Rodriguez and wounded her mother during a confrontation June 1 between the woman's boyfriend and four men, police said. The girl and her mother were walking on San Fernando street to a store to buy candy when the gunfire erupted.\nPolice said witnesses reported seeing four men driving away from the scene, but only Gomez has been arrested.\n\"For whoever did it, not to come forward, and let me go down like this, that's wrong,\" Gomez said.\nPublic records show that Gomez had a record mostly involving a string of burglaries.\nGomez, who is on suicide watch, said he didn't know the girl had been killed until he saw it on Facebook. He also said he's sorry the little girl was killed. Garza knew he was a wanted man when he saw it on news reports.\n\"It wasn't meant for the little girl to get shot, no, it wasn't,\" Gomez said. \"That little girl didn't deserve that.\"\nThe suspect, who was on parole at the time of his arrest, admitted to cutting off his ankle monitor.\nGomez said he is aware he could get the death penalty if he's convicted of the little girl's murder.\n\"I regret it. It bothers me at night,\" Gomez said.\nHe also had a message for other young men who may be fathers putting their children at risk by being involved in gangs.\n\"Just stop, stop the violence, man. Guns all that, put that away,\" he said.\nWatch the raw jailhouse interview:\nCopyright 2016 by KSAT - All rights reserved."}