{"uri": "http://wavy.com/2016/10/04/virginia-beach-police-investigating-womans-death/", "title": "Navy sailor charged in shooting death of Va. Beach teen", "dct": "Tue, 04 Oct 2016 23:20:00 GMT", "id": "478c775628afb848ca085afbb8ff68b1", "content": "VIRGINIA BEACH, Va. (WAVY) — A 22 year-old man has been arrested and charged in the shooting death of an 18-year-old girl from Virginia Beach.\nFamily members identified the victim as Aleigha Hawkingberry. Police say Alec Spencer Wagner, 22 of Chesapeake, is charged with involuntary manslaughter and reckless handling of a firearm.\nDispatchers received the emergency call at 9:52 p.m. Tuesday. When officers arrived on scene they found Hawkingberry suffering from a gunshot wound. She was pronounced dead at the scene.\nCommander David Hecht of Airlant confirmed to 10 On Your Side that Wagner entered the Navy in May of 2014. He is currently stationed on the USS Harry S. Truman. He’s been assigned to the Truman since October 2014. His current rank is E-3 Seaman.\nFamily members said that Hawkingberry had just graduated from Landstown High School in June. She then started school at Tidewater Community College, with hopes of becoming a judge.\nThe teen’s aunt told 10 On Your Side that Hawkingberry loved her family, and will be remembered for her vibrant personality and artistic talents.\nThe family told 10 On Your Side that they do not know what happened.\nA wake will be at H.D. Oliver Funeral Home on Laskin Road on Sunday from 4 to 6 p.m. A church service will be held at 11 a.m. Monday at St. John The Apostle Catholic Parish on Sandbridge Road.\nThe family of Hawkingberry has set up a GoFundMe in her memory.\nWagner is currently being held at Virginia Beach Correctional Center without bond.\nStay with WAVY.com for the updates to this developing story.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}