{"uri": "http://www.wsoctv.com/web/wsoc/news/local/teen-shot-killed-by-homeowner-in-union-county-deputies-say/427964629", "title": "Union County homeowner not charged in deadly shooting", "dct": "Fri, 26 Aug 2016 15:33:00 GMT", "id": "5773bc3460f3025b3519ab6ac7e33ff0", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nMINERAL SPRINGS, N.C. - A Union County homeowner will not be charged after he shot and killed a 17-year-old he said was breaking into his home Monday morning, the Sheriff's Office said Friday in a news release.\nChannel 9 first broke news on Twitter of the investigation just down the street from Western Union Elementary school.\nBREAKING: @UnionCoSheriff investigating after homeowner shot & killed burglary suspect early this AM. 17-yo Marquies Waters died. @wsoctv\n— Liz Foster (@lizfosterWSOC9) August 22, 2016\nThe man who lives at the home on Happy Hollow Lane said he woke up to noises before 4 a.m. Monday and knew someone broke in. He told detectives with the Union County Sheriff’s Office he yelled and saw burglars jump out of a window.\nAuthorities said a few minutes later, at least two teenagers came back for what investigators believe was to get a book bag they left behind.\nThe homeowner said he saw Marquies Waters on the back porch, confronted him and shot him.\nEyewitness News anchor Liz Foster spoke to Waters’ mother, Shaunte. She doesn’t believe her son was breaking into the home and said he knew the homeowner.\n“He was my baby. He was my everything,” she told Channel 9.\nFoster tried talking to the homeowner, but no one answered the door.\nWaters’ mother said regardless of what her son was up to, he didn’t deserve to die and she wants the homeowner to be punished.\n“I don’t think he should live because he just took an innocent child’s life, my son, for no reason,” Waters said.\nUnion County Sheriff’s deputies arrested two 17-year-old suspects Tuesday in connection with Monday’s burglary.\nJacob Alexander Maye and Tristen Malyk Deese, both of Waxhaw, face charges of first-degree burglary and felony conspiracy.\nMaye and Deese were being processed at the Union County Sheriff’s Office Tuesday and bond information is pending.\nAccording to North Carolina law, a homeowner is in his or her legal right to use deadly force if in fear of his or her life or if the homeowner believes someone has broken into their home.\nRead more top trending stories on wsoctv.com:\n© 2017 Cox Media Group."}