{"uri": "http://krqe.com/2016/06/12/roswell-police-searching-for-man-suspected-of-killing-wife-and-four-daughters/", "title": "Police still unsure why New Mexico father gunned down wife, 4 kids", "dct": "Sun, 12 Jun 2016 09:09:00 GMT", "id": "89475b4e58d0ad10f2a70dc2f723687f", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nROSWELL, N.M. (KRQE) – A man suspected of killing his wife and four daughters in Roswell has been taken into custody in Mexico.\nRoswell Police had been looking for 34-year-old Juan David Villegas-Hernandez since Saturday when he allegedly shot his wife and 3, 7, 11 and 14-year-old daughters.\nPolice confirmed on Monday that Villegas was found in the area of Arizpe, Mexico which is in Sonora. Authorities are now working to get him back in the U.S. to face charges.\nMeanwhile, people who live along Davis Street in Roswell where this happened are in shock.\n“Those little girls were always so happy and always playing all the time,” said John Whann, neighbor.\nThe community is pulling together to raise money for the family. They have set up a GoFundMe page.\n“We’re just gonna get all that money that we want to raise, we’re gonna get it to this family so they don’t have to worry about nothing but having five beautiful funerals,” said Nicole Vargas, family friend.\nFriends of the family say that Cynthia worked at Eastern New Mexico Medical Center.\nInvestigators say they think it was a domestic dispute that turned deadly, but the motive is yet to be determined.\nA candlelight vigil is scheduled for Saturday evening on the corner of 23rd and Davis. Organizers are inviting anyone who wants to come out to remember the family.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}