{"uri": "http://www.wrdw.com/home/headlines/Dispatch-Child-involved-in-accidental-shooting-363281871.html", "title": "UPDATE| Neighbors say accidental shooting could have been prevented", "dct": "Tue, 22 Dec 2015 23:35:00 GMT", "id": "fb1b2b676f3495738f836db355ffe44d", "content": "Tuesday, Dec. 22, 2015 News 12 at 11 O'Clock\nAUGUSTA, Ga. (WRDW) -- Sonya Miller used to live in this neighborhood, right near River Glen Apartments, but says it used to look a lot different.\n\"These fields were filled with baseball, kickball, we did a lot out here and just over the summer we had camp and everything with the children,\" Miller said.\nLeamon Lang lives just down the street and says unfortunately this sort of thing is happening more frequently.\n\"Another one just got shot, that's how you feel, it just goes on over, but there's something that can be done about it,\" Lang said.\nMiller says kids are not supervised and do not have anything to do.\n\"They have to have something to do because if they don't they are going to find something to do, find something to get into,\" Miller said.\nLang, Miller and others in the community agree, accidents like this could be avoided.\n\"A lot of carelessness, we are supposed to be looking over our children, we got to make sure that they are kept safe,\" Miller said.\nJust moments before talking to News 12 some kids walking by asked her to pray for them.\n\"For them to stop and ask it's got to be hurting because because they grew up right there, some of them know those children, they laugh they play every day together, they're kind of scared,\" Miller said.\nMany believe it's a good neighborhood, but they feel left behind.\n\"It's not like it's a helpless case, just nobody cares, locking them up isn't going to do it,\" Lang said.\nMany think these kids just need something to keep them occupied; sports, after school programs, someone who cares.\nTuesday, Dec. 22, 2015\n7:07\nAUGUSTA, Ga. (WRDW) -- Richmond County Investigators have completed the initial investigation of this afternoon's accidental shooting on East Chapman Street."}