{"uri": "http://www.montereyherald.com/article/ZZ/20140530/NEWS/140539692", "title": "Salinas man will go to trial in taqueria killings; may face death penalty", "dct": "Fri, 30 May 2014 07:01:00 GMT", "id": "d83dfae484e1bd4cb426939ce43c2834", "content": "SALINAS >> A Salinas man said to be mentally disabled may face the death penalty in connection with the 2013 shooting of seven people after a Monterey County Superior Court judge ruled Friday he will stand trial.\nConcluding a two-day preliminary hearing, Judge Julie Culver found sufficient evidence to hold Giovanni Pacheco, 22, for trial on three first-degree murder counts, attempted murder, gun enhancements and a special circumstances finding of multiple murders that makes him eligible for the death penalty.\nAlthough a number of police officers and witnesses testified, Culver cited several videotapes shown in court as critical to her decision to proceed with a trial.\n\"It's all in black and white and color on video — there really is no room to speculate about what happened,\" Culver said.\nCommercial surveillance tapes recorded at a Williams Road shopping center show the flash of a gun and man appearing to fire into a crowd in front of Taco's Choice taqueria shortly after midnight on Aug. 5, 2013.\nIn the videotapes, shooting victim Edgar Garcia Salinas, 28, runs away but collapses behind a pillar, where police found him dead when they arrived moments later.\nAlso killed were Victor Andrade Ortiz, 22, and Alejandro Lorenzo Hernandez, 25. Four unnamed others were struck by gunfire and treated for various injuries.\nAccording to this week's testimony, Pacheco, his mother and stepfather had been eating at Los Altos restaurant in Salinas, where they met a group and together went to Taco's Choice.\nIt was karaoke night, and the music was loud.\nWhen two young women stepped outside, a man offered them a cigarette, and a brawl ensued with men shouting and shoving.\nOne of the women was Pacheco's girlfriend, according to testimony, and Pacheco was upset with the man who gave her the cigarette.\nIn the videos, a man identified as Pacheco's stepfather Ernesto Ramos can be seen running toward the melee and putting out a hand, apparently trying to stop his son.\nSeveral bright flashes are seen as the shooter fires into the group.\nIn close-up still images shown at the hearing's closing by prosecutor Rolando Mazariegos, the shooter is pointing his gun directly at Garcia Salinas and others at close range.\nMazariegos said, \"this was a fight over two girls a group of men that were drinking, trying to figure out who's the most macho.\"\nPacheco tried to show he was \"the bigger man\" because he had a gun, Mazariegos said.\n\"He took three men's lives because he didn't want to use his hands and fists.\"\nSalinas police detective Rodolfo Roman said he drove Pacheco's mother and stepfather to the police station for questioning after the shootings and had turned on a recording device in the patrol car.\nRamos told his wife in Spanish they were probably being recorded, Roman said. When his wife asked if her son was the shooter, Roman said, Ramos answered, \"It was him, it was him.\"\nRamos said he tried to calm his stepson, but Giovanni had already started shooting, Roman testified.\nAfter the hearing ended Friday, Pacheco's attorney Monique Shana Hill said a preliminary test found her client has an IQ of 59, well under the common cutoff range for a finding of mental disability.\nShe said Culver had granted a request for special treatment in court because of Pacheco's alleged disability, and agreed to speak more slowly and make sure he understood the proceedings.\nHill stressed, however, that the court has not officially determined that her client is disabled.\nThe U.S. Supreme Court in 2002 ruled that executing mentally disabled people was unconstitutional, and said a score of less than 70 usually indicates disability.\nBut on Tuesday, the nation's high court banned a state's reliance on a strict cutoff score of less than 70 to determine mental disability, with one justice writing, \"Intellectual disability is a condition, not a number.\"\nMazariegos said District Attorney Dean Flippo will decide in coming weeks or months if his office will seek the death penalty against Pacheco.\nMeanwhile, he is scheduled to be arraigned June 12, when Hill plans to introduce a motion to dismiss on grounds that evidence has not shown the shootings were premeditated or deliberate, two requirements for a charge of first-degree murder.\nIn addition, Hill said that because of Pacheco's low IQ, she is going to challenge his acceptance in 2011 of a guilty plea for a charge of being a felon in possession of a firearm.\nPolice said Pacheco, then 18, was stopped in December 2010 while officers investigated a report of loud music from vehicles. Pacheco was searched because he was \"behaving suspiciously,\" according to officers, and police found a loaded gun in his pants pocket.\nJulia Reynolds can be reached at 648-1187.\nAdvertisement"}