{"uri": "http://lasvegassun.com/news/2016/may/05/north-las-vegas-police-investigating-fatal-double/", "title": "2 adults dead, 2 children wounded in shooting outside day care center", "dct": "Thu, 05 May 2016 00:00:00 GMT", "id": "361255166e07bcccb44f5b1f9ea8ac8d", "content": "A domestic-related shooting in front of a North Las Vegas day care center left a man and woman dead Thursday and their two young children hospitalized with gunshot wounds, authorities said.\nNorth Las Vegas Police said they received a call about 6 a.m. of shots fired in the 3900 block of Martin Luther King Boulevard. Officers found a man and woman dead with apparent gunshot wounds, police said.\nTheir children — a 4-year-old boy and 3-year-old girl — also suffered gunshot wounds and were taken to University Medical Center in stable condition with nonlife-threatening injuries, police said.\nIt was not clear whether the mother or father fired the shots or whether the 3-year-old girl and 4-year-old boy were intended targets, North Las Vegas police spokeswoman Ann Cavaricci said.\nPolice said they believe the incident was domestic related, and they were not looking for any other suspects.\nAuthorities have not identified the family.\nEmployees were at the Kids Campus Learning Center as it opened, but no other children were around when the shooting happened around 6:10 a.m. in the front parking lot, police said. No one else was hurt at the preschool and day care.\nThe workers initially cared for the children and reported the shooting to police, Cavaricci said.\n\"They opened the doors and brought the children inside, called 911,\" she said. \"They did everything they could to make sure those kids were safe.\"\nThe center declined to comment.\nCavaricci said the children attend daycare at the center. A child protective services agency is working to find relatives to help care for them.\nOnly a few employees were at work at the time of the shooting, and no other children were at the daycare at the time, Cavaricci said.\nPolice said they don't believe there was an exchange of gunfire because only one weapon was recovered at the scene.\nThe Associated Press contributed to this report."}