{"uri": "http://www.ktnv.com/news/police-investigating-2-deaths-near-martin-luther-king-blvd-alexander", "title": "UPDATE: Violent history between couple involved in murder-suicide", "dct": "Thu, 05 May 2016 07:06:00 GMT", "id": "9d7338584d269285786c7f368b545bc7", "content": "Autoplay:UPDATE: Arrest report details man behind shooting at Kids CampusCONNECTING...XDaycare murder-suicide update\nLATEST: An arrest report from around Christmas shows Travis Spitler had been arrested and charged with domestic violence.\nThe arrest happened just months before last week's tragedy, when Spitler opened fire in front of Kid's Campus Learning Center, killing his ex-girlfriend, Christina Franklin, and injuring their two children.\nBack in December, Spitler was arrested after police found Franklin bleeding from the head. Franklin told police the two were arguing, so she hid in the bathroom. That's when Spitler forced his way inside and beat her up.\nThe arrest report also says Franklin told police that wasn't the first time Spitler had beaten her up. Franklin said he was arrested for the same thing in early 2015.\nFOURTH UPDATE: The Clark County coroner has identified the man as 40-year-old Travis Lee Spitler of Las Vegas. The coroner ruled his death a suicide.\nThe 27-year-old was identified as Christina Pearl Franklin of Las Vegas. She died of multiple gunshot wounds.\nInvestigators believe the incident was a murder-suicide.\nPolice said the 27-year-old mom was dropping off her two children, when Spitler arrived moments later.\nWitnesses reported hearing shots. The bodies of Spitler and the woman were discovered outside Kids Campus.\n13 Action News learned that employees of Kids Campus were the ones to call 911 after the shooting. A former worker told 13 Action News that it is believed that the mother of the children involved was afraid of the father.\nPolice said the adults had two children together.\nRecords show the couple had a history of domestic violence and the mother had a restraining order against him.\nTHIRD UPDATE: Kids Campus has released the following statement:\n\"Kids Campus Learning Center is working with the North Las Vegas Police Department in regards to the domestic violence incident that happened outside its place of business this morning. It is tragic that isolated, random acts such as this can happen anywhere.\nOur thoughts and prayers go out to the two children involved in the incident and their extended family. At Kids Campus Learning Center, our foremost priority is the safety, well-being and education of our students and their families as well as our staff.\"\nSECOND UPDATE: Police said during a press briefing that the injured children are a 4-year-old boy and 3-year-old girl. It is not clear if the children were shot or injured in some other way during the incident. They are believed to be in stable condition.\nPolice say that the children are most likely related to the man and woman who are deceased and the shooting is considered to be a domestic situation. No one else is believed to be involved.\nEmployees of Kids Campus called 911. The facility was not open at the time and will remain closed today.\nThe Clark County coroner will release the names and ages of the deceased after relatives have been notified.\nWATCH PRESS BRIEFING BELOW\nUPDATE: North Las Vegas police have confirmed that 2 people are dead. Police say that a man and woman were shot in front of Kids Campus Learning Center.\nIn addition, two children were found on the scene with non-life threatening injuries. They were transported to a local hospital.\nWe know two people are dead. Just got to the scene. @KTNV pic.twitter.com/mo8y9riX5e\n— Parker Collins (@parkercollinstv) May 5, 2016\nNo other information on what led to the shooting or whom may be responsible has been released at this time.\nORIGINAL STORY:\nNORTH LAS VEGAS (KTNV) -- Police are on the scene of an incident near Martin Luther King Boulevard and Alexander Road in North Las Vegas. It appears that two people have been killed in front a kindergarten/learning center in the 3900 block of Martin Luther King Boulevard.\nAccording to initial reports, Martin Luther King is completely closed to traffic between Alexander Road and Cheyenne Avenue. Motorists should seek alternate routes.\nThe incident was reported at 6:07 a.m.\nThis is a developing story. Check back for updates."}