{"uri": "http://www.tri-cityherald.com/news/local/crime/article96448322.html", "title": "UPDATE: Hermiston teen missing after apparent murder-suicide", "dct": "Thu, 18 Aug 2016 12:36:00 GMT", "id": "0361419b2f8cf75e3f36ae5895d60b02", "content": "Two volunteer wrestling coaches were found dead in a Hermiston home and a woman was hospitalized after a suspected murder-suicide Thursday. And police were intently searching the area for a missing teen related to one of the victims.\nPolice found Jason E. Huston, 45, and Kenneth E. Valdez dead from gunshot wounds about 11:18 a.m. in a bedroom at Valdez’s house at 130 N.W. 11th St.\nHuston died of an apparent self-inflicted wound, said a joint news release from Police Chief Jason Edmiston and Sheriff Terry Rowan.\nValdez was found dead in the same room. A 35-year-old woman, whose name was not released, was found in the same bedroom with a gunshot wound and was taken to a nearby hospital, said Edmiston.\nBefore the woman was taken to the hospital, she was able to give police a detailed statement about what happened and said they all knew each other, said the news release.\nHuston and Valdez helped coach at Hermiston High School, according to the Hermiston School District.\n“Our thoughts and condolences go out to the family, students, coaches and others affected by this tragedy,” the release said.\nEdmiston said the community is not at risk and police were not searching for additional suspects.\nHowever, authorities were looking for James “JJ” Hurtado, 14.\nHe was last seen about 10 a.m. with Huston, who said he was taking the boy to play Frisbee golf at McNary Park in Umatilla, police said.\n“At this time we are considering JJ Hurtado a Missing/Endangered Person,” said the release.\n“Our primary focus at this time is finding JJ,” the release said. The agency released a photo of him to help in the search.\nAnyone with information is asked to call 541-966-3651.\nWith help from the Oregon State Police and the Umatilla County Sheriff’s Office, Hermiston officers searched Huston’s home at 31293 Morgan Lane and his vehicle, which was found on Bridge Road in Hermiston.\nBecause Huston and Valdez were well-known the school district is offering support for staff, students and athletes at 10 a.m. Aug. 19 at Hermiston High School."}