{"uri": "http://www.pennlive.com/news/2016/12/pa_police_describe_accused_tee.html", "title": "Pa. police describe accused teen's motive and 'horrific' acts in killing mom and brother", "dct": "Fri, 02 Dec 2016 15:52:48 GMT", "id": "071655994e860bbf3f0a66b0ba570cab", "content": "If anyone is looking for a deep, dark motive for why a 14-year-old boy in western Pennsylvania is accused of coldly loading a gun, then turning it on his sleeping mother and younger brother, shooting both in the head and killing them, police say it is just not there.\nAccording to TribLive.com, Trooper Steve Limani said Thursday that early interviews with the grieving family did not indicate an exact motive:\n\"There were some indications that he did have some recent difficulty with his parents. But there doesn't seem to have been any tumultuous relationship whatsoever with his brother,\" Limani told TribLive.com.\nLimani said troopers' interviews with the father indicate that the accused teen, Jacob Roland Remaley of New Stanton, Westmoreland County, Pa., had some typical teenage disputes with his parents, but \"nothing that would lead to such a horrific act.\"\nLimani said he had no record of state police being called to the residence. He said state police could not divulge whether the teen ever had mental health treatment, \"but I can tell you that he was under no type of medication.\"\nAs for how the teen allegedly carried out the double homicide, the details as described by police are chilling, as TribLive.com reports:\nRemaley allegedly retrieved the handgun from the top of the kitchen refrigerator just before 7 a.m. Wednesday, went back to his bedroom to find it was unloaded.\nState police allege that he then went back to the kitchen where the ammunition is stored \"and grabbed a six-round magazine and loaded the handgun.\"\n\"He then walked into the mother's room were she was asleep and shot her, and then walked into his brother's room, where he was asleep, and shot him. They were clearly both lethal shots,\" Westmoreland County District Attorney John Peck Peck told TribLive.com.\nRemaley allegedly shot his mother, Dana Remaley, 46, and brother, Caleb Remaley, 8, with a Ruger .380-caliber handgun after his father, David, left their home for work about 5:40 a.m. Wednesday, TribLive.com reports. The teen allegedly told police that we would have shot his father, too, if he were home.\nAs a result, the teen is now facing adult charges in the case: two counts each of homicide and first-degree murder. He is now under mental health treatment.\nThis, after arriving ambulance crews found the teen in the yard repeatedly saying, \"Mom,\" in wake of the killings, TribLive.com reports, adding:\nInvestigators believe the teen was still in shock after allegedly committing the \"horrific incident\" as first responders arrived.\nRead more Pa. buzz:\nA 43-year-old woman accused of operating an online-based prostitution service out of her home in Easton, Pa., is now facing more legal troubles.\nA quick rundown of all the latest top-trending stories from across Pennsylvania."}