{"uri": "http://www.ksat.com/news/12-year-old-boy-shot-on-san-antonio-highway-didnt-deserve-it-family-says", "title": "12-year-old boy shot on SA highway 'didn't deserve it,' family says", "dct": "Tue, 27 Dec 2016 16:45:00 GMT", "id": "5ba66e6f4ea62a346bfaf95e3ead9232", "content": "SAN ANTONIO - Angel De La Cruz, a 12-year-old boy who was a passenger in a relative’s car on Loop 410, is recovering from gunshot wounds he suffered as the result of what may have been a random shooting.\nSan Antonio police found the middle schooler, along with his relatives, at Northeast Baptist Hospital around 11 p.m. Monday. Officers said relatives told them the boy was a passenger in a pickup when someone in a passing car fired at them somewhere in the area between Broadway and Nacogdoches Road.\nAngel was hit twice -- in the shoulder and neck. Although his wounds initially were thought to be life-threatening, his father, Aurelio De La Cruz, confirmed that the boy is in stable condition now.\n“He’s ok,” he said. “All I can say is, we don't know why. There was no reason. We don't have no problems. So I don't understand.\"\nDe La Cruz said his son didn’t deserve to be shot, and that no one in the family did anything to prompt it. The whole thing is a mystery to them, he said.\n\"He's a good student. He's a nice boy. So that's why all the family, you know, we're surprised about that.\"\nHe said Angel was in his uncle’s pickup, headed to spend time at that relative’s home, when someone took aim at them.\nA preliminary report from police stated that the pickup was in the fast lane on the eastbound highway, when a late model dark-colored Dodge Charger or Challenger with LED headlights and tail lights pulled up next to it. The report stated that the passenger in the car then leaned out of the window and fired several shots over the roof of the car.\nWitnesses told police the shooter and driver appeared to be the only two people inside the car at the time.\nAnyone who has information about the people responsible for the shooting is asked to San Antonio police or Crime Stoppers at (210) 224-STOP (7867).\nCopyright 2016 by KSAT - All rights reserved."}