{"uri": "http://www.timesfreepress.com/news/local/story/2016/mar/01/authorities-give-few-answers-after-toddler-sh/352709/", "title": "Hamilton County Sheriff's Office tight-lipped after toddler shot, killed in Apison", "dct": "Tue, 01 Mar 2016 00:00:00 GMT", "id": "532cafb4d3d52388f356b17fb722650e", "content": "A 3-year-old boy was shot and killed outside his home in Apison early Monday, and investigators are keeping quiet about exactly what happened.\nThe Hamilton County Sheriff's Office won't say whether Gavin Pittman shot himself or was shot by another person, will not say whether the shooting was accidental, and won't discuss what type of weapon was used.\nGavin was inside the family's minivan when he was shot around 9:18 a.m., sheriff's spokesman Matt Lea said. He declined to say whether anyone else was with Gavin inside the van — which was parked outside the house — because of the ongoing investigation.\nAs authorities worked the scene Monday, neighbors gathered near the yellow tape in the quiet, rural neighborhood. A woman in a blood-soaked gray T-shirt declined to speak with the Times Free Press. She smoked a cigarette as she walked in the area near the home, which is tucked at the bottom of a pothole-filled dirt road.\nThe family has lived there for several years, neighbors said.\n\"They definitely care about those kids,\" Janet McElroy said. \"They love their kids.\"\nGavin was an especially rambunctious toddler, another neighbor said.\nThe boy's family declined to speak with the Times Free Press. His death comes months after a high-profile incident in Clarksville, Tenn., where a 2-year-old boy was shot and killed in October 2015. Authorities later arrested the boy's stepfather and said the man plotted to kill the toddler.\nAnd in January, a 7-year-old boy was accidentally shot in the head after he was left alone in a vehicle with three other children. In that case, one child found a loaded, semi-automatic pistol inside a purse.\nNone of the toddlers who have been killed in the city of Chattanooga during the last five years were shot to death, according to The Toll, a Times Free Press database of homicides. Since 2011, three children ages four and younger have been killed within the city limits.\nTatiana Emerson, 3, and Tyre'Ke Evans, 4, were beaten to death. Demarcus Bryant, 1, died from an overdose when a caretaker put a powerful drug pain patch on his back.\nZoey Duncan, now 2, was shot and paralyzed from the chest down during a home invasion in Chattanooga in January 2015 — she survived.\nContact staff writer Shelly Bradbury at 423-757-6525 or sbradbury@timesfreepress.com with tips or story ideas. Follow @ShellyBradbury."}