{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-shootings-violence-20160320-story.html", "title": "2 killed, including 7-year-old boy, and 9 wounded in Chicago shootings Sunday through Monday", "dct": "Mon, 21 Mar 2016 01:33:00 GMT", "id": "4705c903c82db01f1fdc7eb1db93df0d", "content": "A 7-year-old boy and a 23-year-old man were killed, and nine people including an off-duty Chicago police officer were wounded in shootings in Chicago from Sunday afternoon through early Monday, authorities said.\nDevon Lofton was accidentally shot in the 6700 block of South Aberdeen Street in Englewood at about 3:50 p.m. Sunday, said Officer Bari Lemmon, a Chicago police spokeswoman.\nThe boy was taken to Comer Children's Hospital, where he was pronounced dead at 4:20 p.m., according to the Cook County medical examiner's office.\nAndrew Holmes, a Chicago activist who is working with Devon's family, said family members are still piecing together the circumstances leading up to the shooting.\nRelatives say the boy \"may have mistaken the gun as a toy gun when it went off,\" Holmes said. \"But the real question is who the gun belongs to.\"\nInvestigators planned to confirm preliminary evidence that indicates the gunshot wound was self-inflicted by performing a gunshot residue test on the victim's hands, Holmes said.\nAt the scene earlier Sunday evening, Chicago police officers blocked off the area around the boy's three-story home.\nNext-door neighbor Claudia Harris took in the family's other children, including a 1-year-old baby, while the family went to the hospital, after a boy related to Devon ran to her house asking her to call police following the shooting.\nHarris, who was at home when the shooting happened, said the boy was frantic.\n\"He was hysterical. I didn't even get a chance to see him. I was upstairs in my room and he ran through the kitchen door and said, 'Claudia, call the police! Call the paramedics! Devie's been shot!\"\nSeveral residents stood outside the police tape. Relatives at the scene said the boy suffered a gunshot wound to the chest, but that had not been confirmed by authorities.\nFamily members and friends rushed to the scene. Two young boys on bicycles waited outside the police tape.\nOne woman swiftly walked up to one of the boys asking, \"What happened?\"\nHe anxiously replied, \"Where's my brother?\"\nAs the group prepared to drive to Comer, one relative received a call that made everyone in the group frantic.\n\"He's gone!\" one woman yelled.\nA man who was next door at the time of the shooting said he rushed outside when police cars and an ambulance arrived. Shortly after, he said the youngest of the four boys who lived in the house was carried away on a stretcher.\n\"I don't think anyone should have to bury their own child,\" said Bernard Warfield, 22, as he consoled one of the victim's older brothers. \"That makes me not want to have kids again. Now, three boys have to grow up without their baby brother.\"\nGroups of emotional family members showed up at the scene, including one woman who frantically cried as she ran past crime scene tape. A man and another woman, followed soon after and ducked under the tape that cordoned off the area before they were stopped by officers.\nAnother man sped to the scene in a car, abruptly stopping the car and getting out when he could go no farther. He was sobbing while he walked up to the tape and demanded to be let in.\n\"I need to get over there, man. I need to see my baby though, man,\" he said.\nHe left speeding backward in his car, almost getting hit by another car at a nearby intersection.\nEarlier Sunday, Christian Ortiz, 23, was killed in a shooting in the Albany Park neighborhood that also critically wounded a 26-year-old man. They were in the 4800 block of North Albany Avenue at about 2:50 p.m. when someone in a baseball cap and a dark jacket fired shots and then rode away on a bicycle.\nBoth men were shot in the abdomen and taken in critical condition to Advocate Illinois Masonic Medical Center. The 23-year-old man was pronounced dead there at about 3:20 p.m., according to the Cook County Medical Examiner's office.\nThe off-duty police officer was shot in the leg during a robbery at about 2:20 a.m. in the Washington Heights neighborhood, police said. He was taken to Advocate Christ Medical Center in serious condition and was expected to survive.\nA person of interest was being questioned after he showed up at a nearby hospital with a gunshot wound, police said.\nOther shootings:\n• At about 5:15 a.m., a 20-year-old woman was shot in West Humboldt Park.She was in the 800 block of North Kostner Avenue when she was shot in the chest. She was taken to Mount Sinai Hospital. Details were not immediately available about the circumstances or the woman's condition.\n• At 3:10 a.m. Monday, a 29-year-old man was grazed by a bullet in the Humboldt Park neighborhood. He was in an SUV in the 1200 block of North Homan Avenue when a black sedan pulled up and someone fired shots. He was grazed in the back and driven to Norwegian American Hospital. His condition was stabilized.\n• At 2:45 a.m., a 17-year-old girl was shot in Rogers Park. She was hit in the lower back in what may have been a drive-by shooting in the 7100 block of North Clark Street. She want to Saint Francis Hospital and her condition was stabilized.\n• At about 11 p.m. Sunday, a 25-year-old man was grazed in the wrist in South Austin, police said. He was in an alley in the 200 block of South Cicero Avenue when someone got out of a dark-colored minivan and announced a robbery. The man ran away and someone fired shots, grazing him in the wrist. He was treated at West Suburban Medical Center and his condition was stabilized.\n• At about 8:35 p.m., a 22-year-old man was shot in Gresham. He was in a car in the 8800 block of South Hermitage when someone fired shots from a passing white sedan. He was hit in the right side and went to Advocate Christ Medical Center. His condition was stabilized.\n• At about 4:20 p.m., a 13-year-old girl was shot in the Lawndale neighborhood on the West Side, police said.\nThe shooting happened in the 1300 block of South Karlov Avenue, police said. The girl was shot in the armpit and taken in good condition to Stroger Hospital.\nThe girl told police she was walking in the area when she heard shots and felt pain from the gunshot wound, police said."}