{"uri": "http://chicago.suntimes.com/news/police-boy-accidently-shoots-himself-in-englewood/", "title": "7-year-old Englewood boy fatally shoots himself: police", "dct": "Sun, 20 Mar 2016 16:42:00 GMT", "id": "5014c9b36a4e69b833fe8ebd6f7c3397", "content": "Police are investigating after a 10-year-old boy brought a gun into his family’s Englewood neighborhood home, where his 7-year-old brother found the weapon and fatally shot himself Sunday afternoon.\nDevon Lofton accidentally shot himself in the head about 3:50 p.m. inside the home in the 6700 block of South Aberdeen, authorities said. He was taken to University of Chicago Medicine Comer Children’s Hospital, where he was pronounced dead at 4:36 p.m.\nDevon’s brother brought the .22-caliber gun into the house, although investigators are still trying to determine how he got the gun in the first place, according to Chicago Police Department spokesman Anthony Guglielmi.\nAn autopsy Monday did not rule on Devon’s cause or manner of death, with final results pending further investigation, according to the Cook County medical examiner’s office.\nRELATED:\nTears and pain at vigil for 7-year-old Englewood boy\nClaudia Harris, a next-door neighbor and close friend of the family, said she was in her home when one of Devon’s brothers ran in and yelled for her to call police.\n“I didn’t know what was going on at first, but I knew it was bad,” Harris said. Devon, a first-grader, lived in the home along with his mother, grandmother and several siblings, Harris said.\nBernard Warfield, another next-door neighbor to the south, said he saw Devon and greeted him when the boy rolled up to his home on his red bicycle just a few hours before the shooting.\n“He said ‘See you later,’ the last words. . . . It’s traumatizing,” Warfield said, who recalled seeing the boy outside playing football on the block regularly.\n“He was a great kid. It’s heartbreaking,” Warfield said.\nHolmes said he had spoken with some of Devon’s family members, including the boy’s mother, who was taken to a hospital after going into shock.\nAccording to the preliminary investigation, Holmes said Devon and at least one other child were playing with a gun, which they might have mistaken for a toy.\nHolmes said Devon accidentally shot himself in the chest, though police have said he suffered a head wound. Investigators were performing gunshot residue tests on the boy’s hands to confirm it was self-inflicted, Holmes said.\nThe boy’s grandmother was home at the time, Holmes said. Investigators are trying to figure out whose gun it was.\n“No matter if they thought that was a BB gun or a toy, that weapon should not have been inside that home,” Holmes said."}