{"uri": "http://www.pennlive.com/news/2016/07/sixth_victim_new_eyewitness_id.html", "title": "Sixth victim, new eyewitness identified in 2015 shooting outside Williamsport night club", "dct": "Fri, 22 Jul 2016 21:09:00 GMT", "id": "85c0cb8e3a886fd90ce24f9472af55c7", "content": "WILLIAMSPORT -- A sixth victim and another eyewitness have been identified in the shooting that occurred outside a Williamsport night club 15 months ago.\nAs a result of the developments, Lycoming County Judge Marc F. Lovecchio Friday delayed by one day until Tuesday the trial of Michael Rakeem Spencer, 34, who is charged with wounding bystanders outside the Imbibe Lounge and Night Venue on April 18, 2015.\nThe defense sought to preclude the new evidence or have the trial delayed until an investigator had the opportunity to question the two.\nLovecchio denied the motion but ordered the prosecution to make the two available to the defense before Tuesday and authorized the public defender's office to retain an investigator, if it deems necessary, to interview them.\nHe gave Assistant Public Defender Greta Davis the opportunity to renew her continuance motion after the two men are interviewed.\nLovecchio made it clear in his ruling Assistant District Attorney Martin Wade did nothing improper and lauded him for immediately notifying the defense about the new evidence.\nWhat the judge called a \"pretty subtle discovery\" occurred July 15 when Wade said he again was viewing surveillance video from the club as he was preparing for trial.\nIt was then he saw an unidentified man look in the direction of the shooter and another man lift his shirt slightly exposing what appeared to be a wound, he said.\nThe two were identified with the help of Williamsport police, he said.\nAgent Raymond O. Kontz III testified he and another agent traveled to Philadelphia earlier this week and spoke with Christopher Harrold Jr.,\nHe admitted standing about 15 feet from the shooter while with brothers Tyrone and Tyree Green of Williamsport, who police believe may have been the intended targets.\nHarrold explained he had not come forward because \"it's not what we do, we don't talk to police,\" Kontz said.\nThe sixth victim, identified as David Baker of Milton, also was interviewed and is cooperative, the agent said.\nCourt documents state Spencer admitted doing the shooting but during the recent jury selection for the trial there was a hint he might recant his confession.\nThe six who were wounded were among the 20 to 30 people socializing outside in a walkway off the 300 block of Pine Street about 2:10 a.m. after the club had closed.\nSpencer, a Philadelphia native who had lived in Williamsport about six months at that time, had gotten into an altercation with Tyree Green inside the club, police were told.\nGreen left saying he was going to get a gun but returned and was calmed down by his brother, the arrest affidavit states.\nSpencer allegedly had a friend drive him home where he got a handgun. Upon returning he pulled the gun and firing it into the crowd, the affidavit alleges.\nSurveillance tapes show some in the crowd running away and others hiding behind barriers or falling to the street, police said.\nThe five victims previously identified victims who ranged in age from 23 to 33 all required hospital treatment.\nSpencer is charged with attempted homicide, aggravated and simple assault, illegal possession of a firearm, carrying a firearm without a license and recklessly endangering. He is jailed without bail.\nAlso awaiting trial in the case is Adrian N. Stafford, 36, of Williamsport who is accused of driving Spencer to get a gun and after the shooting to Philadelphia where the alleged shooter was arrested.\nCharged with hindering apprehension, providing false information to law enforcement and obstruction of justice, he is free on $5,000 unsecured bail.\nTyree Green, 24, is charged with illegal possession of a firearm due to a 2011 robbery conviction and carrying a firearm without a license. He is jailed in lieu of $50,000 bail."}