{"uri": "http://www.myrtlebeachonline.com/news/local/crime/article22706784.html", "title": "Police: Accidental shooting of 3-year-old at home leads to family dispute, second shooting at Grand Strand Medical Center", "dct": "Sat, 30 May 2015 17:58:00 GMT", "id": "0ec135b5309cf60d8e660edce1f2b6ef", "content": "The accidental shooting of a 3-year-old at a home near Myrtle Beach Saturday led to an argument between family members and a second shooting hours later at Grand Strand Medical Center, authorities said.\nAfter surgery, the child was stable but critical, police said. The other victim suffered a wound that wasn’t life threatening.\nTwo people were taken into custody after the hospital shooting, said Lt. Joey Crosby with the Myrtle Beach Police Department. The suspects will be identified when they are formally charged, but Crosby said that may not happen until Sunday.\nThe child was shot around 1 p.m. at a home on Carnation Circle, said Horry County Police Lt. Raul Denis. Investigators believe the child found a gun in a dresser drawer and accidentally fired the weapon. Denis said police do not expect to charge anyone in the child’s case.\nThe second shooting happened a few hours later outside the rear entrance of Grand Strand Medical Center. Late Saturday, police were still piecing together how the situation unfolded, but they said family members began arguing and one person was shot. The victim wasn’t identified.\nLoretta Dellinger of Calabash, N.C., was visiting her stepfather after his brain surgery when she heard the commotion outside.\n“I just kept hearing people screaming and gunshots,” she said. “I said, ‘Oh my God! What’s going on?”\nDellinger looked outside the hospital room window and saw men fighting and women screaming.\n“I was scared to death,” she said.\nThe hospital was briefly placed on lockdown after the shooting, said Grand Strand spokeswoman Julie Kopnicky.\n“We are cooperating fully with their investigation and continuing to provide support and care to our patients and families,” she said via email. “Our top priority is providing the highest level of care for our community in a safe and caring environment.”\nPolice were still on scene at 6:30 p.m., but the crime scene tape had been removed and visitors were using the back entrance again.\nContact CHARLES D. PERRY at 626-0218 or on Twitter @TSN_CharlesPerr."}