{"uri": "http://www.myrtlebeachonline.com/news/local/crime/article22795785.html", "title": "Two people charged after weekend shooting outside Myrtle Beach hospital", "dct": "Mon, 01 Jun 2015 11:36:00 GMT", "id": "e348ba7a5050d479434481f6212dc7ce", "content": "Two people were charged this weekend after a 27-year-old man was shot outside Grand Strand Medical Center following an argument about a 3-year-old accidentally being shot at a home near Myrtle Beach.\nYul Grayson Harley II, 24, of Florence was charged with attempted murder and possession of a weapon during the commission of a violent crime and Brandilyn Brianni Wright, 20, was charged with accessory after the fact of a felony, which was attempted murder, Myrtle Beach police Lt. Joey Crosby said Monday.\nBond was set for Harley at $15,000, and he remained jailed at J. Reuben Long Detention Center, according to records at 11:45 a.m. Monday.\nThe charges were filed in connection with an incident that occurred about 4 p.m. Saturday outside the hospital at 809 82nd Parkway, Crosby said.\nIn arrest warrants for Harley, officers were called after the victim suffered non-life-threatening injuries when he was shot in front of the hospital.\nHarley left the area in a vehicle driven by Wright, according to the affidavit.\nThe child was shot about 1 p.m. Saturday at a home on Carnation Circle, which is near 48th Avenue North in the Myrtle Beach area, Horry County police Lt. Raul Denis said.\nHorry County police responded to the shooting of the child because it was in their jurisdiction, while Myrtle Beach police went to the hospital shooting because that is in the city limits.\nAuthorities said the second shooting happened several hours after the initial shooting.\n“At this time, it appears that the child may have unintentionally found a firearm in a dresser drawer and accidentally caused it to discharge,” Denis said Saturday. “While at the Grand Strand Medical Center, an unknown situation unfolded between the victim’s family members that resulted in another gunshot victim.”\nThe child underwent surgery on Saturday and was listed in critical, but stable condition, Denis said. Horry County police do not plan to file any charges, but their investigation continues.\nIn a police report released Monday by Horry County police, officers learned the child’s mother and uncle took him by private vehicle to the hospital after the shooting at the home. Several young children were at the apartment playing when they heard a loud noise come from the master bedroom.\nThe boy’s 20-year-old mother and two men, a 23-year-old and 32-year-old, told police that they found a .40-caliber handgun had been accidentally fired by the boy, according to the report. The gun was kept in the top dresser drawer in the bedroom.\nMore information will be posted as it becomes available.\nContact TONYA ROOT at 444-1723 or on Twitter @tonyaroot."}