{"uri": "http://www.denverpost.com/2016/06/04/police-looking-for-homicide-suspects-and-maroon-chevy-tahoe/", "title": "Denver Police call triple slaying “drug deal gone extremely bad”", "dct": "Sat, 04 Jun 2016 10:56:00 GMT", "id": "a1284e30db295e367b5c3854e6ba1a96", "content": "To view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nDenver Police are looking for several suspects after three people were killed Friday night at a home in Park Hill in what police said Saturday afternoon was likely a “drug deal gone extremely bad.”\nPolice said they received a call about a shooting on the 3600 block of Hudson Street at 8:13 p.m. Friday. When they arrived, they found a man outside with a gunshot wound to the arm, and then discovered two dead people inside the home.\nThe man with the gunshot wound to the arm was transported to the hospital and remains in serious condition, said Denver police spokesman Tyrone Campbell.\nA fourth victim was transported to the hospital by a private party, said Sonny Jackson, a Denver police spokesman. That person later died.\nThe block of Hudson Street is lined by duplexes and multifamily homes with well-manicured lawns. People were walking their dogs Saturday morning and slowing to look at crime scene technicians still working in the area.\nThe victims have not been identified, but Jackson said he believed they are all adult men. Campbell said it is unclear if the men all lived in the home or not, and would not release details about what drug may have been involved.\n“We don’t believe it to be gang-related at this time,” Jackson said.\nPolice initially said they were looking for multiple suspects, according to information they released on Twitter. By Saturday afternoon, Campbell said police are looking for a 2015 or newer, maroon, Chevy Tahoe with temporary tags that may be traveling out of state.\n“We are looking for a person or persons of interest,” Campbell said. “Anyone tied to that vehicle.”\nCampbell said police are still looking for more witnesses or anyone who may have information about the shooting, and encouraged anyone with information to call 911.\nSaturday morning, neighbors said the block is usually quiet, despite being a few blocks away from Holly Square.\n“In all situations we’re always asking our community to be vigilant,” Campbell said. “But this appears to be an arranged encounter.”\nSponsored Links\n.\nMoney MorningCapital Gains Tax Loophole?Money Morning\nWar Bitz20 Images of Damaged B-17 Bombers That Miraculously Made It HomeWar Bitz\nDealStealsTop rated mattress deals. Bye bye back pain!DealSteals\nHome Solar QuotesHomeowners Are Furious With Their Power Company!Home Solar Quotes\nVital Reds SupplementHow To Fix Your Fatigue (Do This Every Day)Vital Reds Supplement\nBivvy Survival Sleeping BagThis Sleeping Bag Could Save Your LifeBivvy Survival Sleeping Bag\nSponsored\nRumors Have Been Confirmed, Jolie Comes Clean\nThe Rumors Have Been Confirmed, Jolie Comes Clean - Will Family And Friends Forgive Her? Learn More Sponsored by Chatter Box Daily\nSponsored\nHomeowners Born Before 1985 Are Getting a Huge Reward\nIf you have not missed a mortgage payment in 3 years you need to see this. Learn More Sponsored by FetchaRate"}