{"uri": "http://www.wwltv.com/story/news/local/northshore/2016/01/04/teen-killed-in-hunting-accident-remembered-as-witty-well-liked/78280782/", "title": "Teen killed in hunting accident remembered as witty, well-liked", "dct": "Mon, 04 Jan 2016 00:00:00 GMT", "id": "7170cc79999a6734e9fac850c30cdc58", "content": "FRANKLINTON, La. - A letter to a friend, left on his bed, is one of many things helping Tracy Taylor with the loss of her son, 16-Year-old Cayle Taylor.\n\"When I came and I read the first part of the note, I just smiled,\" said Tracy Taylor.\nTaylor's family says he was accidentally shot by his father during a hunting accident on New Year's Eve in Mississippi. Loved ones say one of the teen's last acts while on that hunting trip, to ask his estranged father to witness his upcoming baptism, has also brought them peace.\n\"About three weeks ago, Cayle professed his faith to Jesus Christ and he was saved,\" said Taylor, \"And I know the other thing that gives me extreme comfort in knowing is that my child's soul is in heaven.\"\nTaylor was the fourth of seven children, described as energetic, witty and well-liked.\n\"His friends have sent me pictures and posted things and I've looked at them, and that's part of what's given me some comfort,\" his mother said.\nGood memories are also flowing out of Franklinton High School Monday.\n\"Class clown, definitely a class clown,\" said English teacher June Graham, \"Outgoing, always volunteering. At the beginning of the year, we did a warm up activity and he managed to dance 'The Quan' in front of the class for us all.\"\nAnd the baseball team Taylor recently joined, as a determined walk-on, will be using his memory as this season's motivator.\n\"He just fit right in, everybody loved him, got along well, worked really really hard, stayed after school and hitting the batting cages,\" said Coach Jeff Tageant, \"And he was a joy to be around.\"\nTaylor's loved ones hope those memories help them, and the community, heal from the tragedy."}