{"uri": "http://www.moultrieobserver.com/news/local_news/lawmen-respond-to-violence-reports/article_da7bed02-5681-11e5-ac59-5f0bcb2b41e2.html?mode=jqm", "title": "Lawmen respond to violence reports", "dct": "Tue, 08 Sep 2015 00:00:00 GMT", "id": "7104a9aa9690011cb57686b6b3c7d898", "content": "MOULTRIE — Deputies responded to a reported shooting in Berlin Tuesday morning. The initial call said one man was shot at and four people had been shot but were refusing treatment by EMS. While the officers were still en route, the dispatcher added that the man with the gun was high on narcotics and that the caller was being uncooperative, the deputy said in his incident report.\nWhen the deputy arrived, he saw a man walking from the residence where the shots had allegedly been fired. He and Berlin Police Chief Timothy Weathers forced the man to the ground at gunpoint, and another officer handcuffed him without further incident.\nThe man “appeared under the influence and was hallucinating,” the deputy reported.\nA neighbor said the man had been shooting at objects and acting out of his head. The man was taken to Colquitt Regional Medical Center for evaluation. The deputy said a 12-gauge pump shotgun, a Taser and a .22-caliber pistol were taken into evidence.\nOther violence\nSheriff’s Office\n• Heather Tucker, 100 block Lighter Knot Court, reported Saturday that her brother had pointed a pistol at her and other relatives when they were at his residence to retrieve some property. The other relatives agreed that’s what happened, and one provided a description of a black .45-caliber handgun they said he used.\nPolice contacted Tucker’s brother, Eric Chafin, at his residence, 191 Fireplace Lane. Chafin and another witness said there was a verbal argument but no firearm was pointed at anyone. Chafin acknowledged owning a pistol that fit the relative’s description, and the deputy recovered it from a closet in the residence.\nThe reporting deputy said Chafin was arrested on a charge of pointing a pistol at another. No booking paperwork was available at the Colquitt County Jail on Tuesday; usually that paperwork isn’t available until after a warrant is issued officially charging a suspect.\n• A Colquitt County woman reported she was sexually assaulted Friday night on the side of Edmondson Road.\n• A Colquitt County woman reported Sunday that her juvenile daughter returned from her father’s house with what looked like a hickey, and she said her daughter told her that her father had poked her and touched her inappropriately. The daughter, however, would not talk with the deputy preparing the initial report."}