{"uri": "http://bangordailynews.com/2014/11/18/news/portland/saco-man-who-killed-family-self-had-stopped-taking-antidepressants-because-h", "title": "Saco man who killed family, self, had stopped taking antidepressants when he lost his insurance", "dct": "Tue, 18 Nov 2014 00:00:00 GMT", "id": "00e8f7aa13cd5b921fc6217699efb7d7", "content": "SACO, Maine — In the 13 months before police say he murdered his family and then killed himself, Joel Smith repeatedly visited doctors seeking help for stress and anxiety, but stopped taking prescribed medication because he lost his insurance, according to documents released this week by the state medical examiner’s office.\nThe night of July 26, police say Smith, 33, shot his wife, 35-year-old Heather Smith, 12-year-old stepson Jason Montez, and biological children Noah Montez, 7, and Lily Smith, 4, with a shotgun before turning the weapon on himself in the family’s Saco apartment.\nOn Monday, the medical examiner’s office released its reports on all five individuals in response to a Freedom of Access Act request filed by the Bangor Daily News in August.\nAccording to an account by Saco police officer Megan Tibbetts that accompanied the reports, Joel Smith was angry at his wife for staying out until 10:30 p.m. on the night in question, drinking with neighbors in the Water Street apartment complex where they lived.\nWithin the next hour, neighbors said they heard what sounded like fireworks going off.\nHeather Smith had recently returned to the apartment after treatment for heroin and oxycodone abuse, Tibbetts’ account read, in part. Three days before the incident, on a Wednesday, Joel and Heather Smith went to pick up the three children from their paternal grandfather, with whom they’d been staying during Heather’s rehabilitation stint.\nThe night before the crime, Heather Smith passed a drug test, but abruptly left a group therapy session halfway through the meeting with no explanation. Police would later report that on the same night, Joel Smith threatened suicide, although it is unclear whether, or in what way, the two circumstances are related.\nAccording to the medical examiner’s report, Joel Smith had visited doctors at least four times between June 2013 and February 2014 seeking help for stress and anxiety, among other things. Those visits came on the heels of what the report suggested were numerous previous attempts to seek medical help since 2008, when Smith told doctors he lost his job and his anxiety became “intolerable.”\n“He had done well on [the antidepressant] sertraline, but lost his insurance and had not been taking sertraline for several months. His anxiety had returned with panic symptoms, obsessive worrying and difficulty sleeping,” read the medical examiner’s recounting of Joel Smith’s Feb. 28 appointment with his primary care physician. “He rarely drank and denied recreational drugs. He denied depression and suicidal and homicidal ideation. The impression was generalized anxiety and panic disorder. Sertraline, 50 mg daily, was prescribed. He was to return in one month. There were no further visits.”\nThe report did not indicate why he lost his insurance or whether he regained coverage, but by July 26, Joel Smith was apparently not using any antidepressants. The medical examiner’s office found only cotinine, a byproduct of tobacco use, in his system.\nThe medical examiner’s office found what it called “a therapeutic level” of hydrocodone in Heather Smith’s system, as well as a peripheral blood alcohol content of 0.23.\nMuch of the rest of the reports released Monday support state and local police accounts in the immediate aftermath of the incident.\nThe three children who were home at the time died of two shotgun shots apiece. The youngest, 4-year-old Lily, was found in bed next to her mother in what appeared to be the master bedroom.\nHeather Smith and Joel Smith each died of a single shotgun wound to the head.\nPolice have surmised that Joel Smith, who was found beside the master bed next to the murder weapon, killed Jason Montez and Noah Montez in their bedrooms before continuing to the master bedroom, where he shot Lily Smith twice, Heather Smith once and then himself.\nJoel and Heather Smith had been together 12 years, and moved from Arizona to Maine approximately four years ago."}