{"uri": "http://www.montgomeryadvertiser.com/story/news/2016/03/19/police-investigate-wetumpka-shooting/82024638/", "title": "Deadly drive-by shootings stun Wetumpka residents", "dct": "Sat, 19 Mar 2016 00:00:00 GMT", "id": "83e253adb477d71e49bb4baabed36082", "content": "WETUMPKA – Two days after a drive-by shooting left two dead and two in critical condition, residents here are still coming to grips with what happened.\nRico Thomas was walking Monday morning along Outhlacoochee Street near the South Shelby Street intersection where the shooting occurred.\n\"Man, it's bad,\" said Thomas, who lives in the neighborhood with relatives. \"You don't expect bullets to be flying like that.\"\nMarcus Edwards is in custody in connection to the shootings and warrants were being drawn up Monday morning, said C.J. Robinson, chief assistant district attorney.\nKilled in the shootings were Daryl Hunt and Deosha Jackson, said Wetumpka Police Chief Danny Billingsley.\nRoderick Jones and Jacoreian Jennings were critically injured, the chief said.\nFrances Carter had lunch with friends Monday at Hog Rock BBQ. The shootings were the subject of conversation at her table.\n\"I don't know what this world is coming to,\" she said, shaking her head. \"Shooting in a neighborhood like that. I'd like to know what was going through his mind.\"\nMore information about the incident may come out this afternoon. Edwards is set to appear before Elmore County District Judge Glenn Goggans at 1:30 p.m. It will be Edwards' first court appearance. Prosecutors are expected to discuss bond and Edwards will have the charges against him explained.\nThe shootings took place at 3:30 p.m. Saturday.\nThat matches with what a witness at the scene says happened.\n“It was a drive-by shooting,” said Minister Bruce Jackson on Saturday in a video interview with the Montgomery Advertiser. The shooting took place near his home at the intersection of Shelby and Outhlacoochee streets.\n“I didn’t know who the people was in the car because I was so quick going down myself to keep from getting shot,” said Jackson, as he was cleaning up at the scene.\nPhotographer Mickey Welsh contributed to this report"}