{"uri": "http://www.kentucky.com/news/local/crime/article110381572.html", "title": "Arrest warrant issued for third suspect in Red Mile Road double shooting", "dct": "Tue, 25 Oct 2016 15:55:00 GMT", "id": "3b009e3013629675a9eb3c35cbc0feb6", "content": "An arrest warrant has been issued for a third suspect in the Red Mile Road shooting and drug-related robbery on Oct. 20.\nLexington police are seeking Joseph “Jodie” Fain, 20, on a first-degree robbery charge. Anyone who knows his location is asked to call police at 859-258-3600.\nDemetrioun L. Boaz turned himself into police Friday night and also was charged with first-degree robbery, police said in a news release. Charges are pending against Saquan Freeman, 19, who is at University of Kentucky Chandler Hospital.\nThe Oct. 20 robbery began about 8:30 p.m. when Robert Record, 22, was shotat the Shell station on 930 South Broadway, police said. During that time, Freeman, with five gunshot wounds in the chest, arrived by private vehicle at St. Joseph Hospital and was transferred to University of Kentucky Chandler Hospital in critical condition, according to court records.\nRecord told police he had been near the apartment at 975 Red Mile Road when he saw several men nearby, according to court documents. Record told officers he tried to run when the men started shooting, and he was struck in the back. Record’s statement differed from those provided by other witnesses, according to court documents.\nOther witnesses told police that several masked men entered the apartment at 975 Red Mile Road, fired multiple shots and fled. Officers found several bullet holes in the walls and spent shell casings inside, according to court documents.\nOfficers learned that several victims escaped through the basement garage of the apartment when they saw the three men enter, according to court documents. Two of the victims were led back into the apartment at gunpoint.\nOne of the fleeing victims then re-entered the apartment, retrieved a .22-caliber revolver and a 9mm semi-automatic handgun, and ran into a bedroom, according to court documents. From the bedroom, the man said, he saw the two other victims being walked up the stairs at gunpoint, according to court documents. Once one victim passed him, he told police, hestepped into the hallway and shot one of the suspects.\nThe suspect then fired back, and the victim told police he shot the suspect multiple times, according to court documents.\nHe then turned to fire at the other suspect and unintentionally hit Record, according to court documents. At that point, everyone ran from the apartment.\nFernando Alfonso III: 859-231-1324, @fernalfonso"}