{"uri": "http://wavy.com/2016/08/14/four-people-shot-on-selden-avenue-in-norfolk/", "title": "Police believe four shootings in Norfolk Sunday are connected", "dct": "Sun, 14 Aug 2016 23:08:00 GMT", "id": "ffcdc456dda480360b11dcb1c1d3a5ec", "content": "NORFOLK, Va. (WAVY) — Four people were injured from gunshot wounds in the Campostella section of Norfolk Sunday evening.\nPolice say they were notified of a shooting on Selden Avenue around 10:45 p.m. Officers found one man with an apparent gunshot wound in the 1600 block of Selden Avenue.\nAnother man was found one block away on Oakfield Avenue. Both men were taken to Sentara Norfolk General Hospital.\nAround that same time, two men with apparent gunshot wounds walked into Sentara Norfolk General Hospital. Officers were later spotted speaking with people outside of the hospital.\nDispatchers believed the victims were linked to a report of shots fired in the 1600 block of Selden Avenue. Police said Monday afternoon that they believe the shootings are connected.\nPolice say all four victims appear to have non life-threatening injuries.\nOn Monday, one of the victims spoke exclusively to 10 On Your Side’s Brandi Cummings.\nBryan Gibbs described in great detail what happened. It was an experience he calls unreal.\nGibbs gave 10 On Your Side exclusive access inside his Norfolk home to show where a bullet shattered his bedroom window and went through his headboard.\nGibbs explained that he, his girlfriend and 3-year-old daughter were in bed nearing sleep when they heard gun shots.\n“It started down here and it got past the house and it stopped,” he said.\nThey thought it was over, instead the shooting started again.\n“The next thing you know, another set. Boom, boom, boom, boom. I hear glass break and I feel it. I feel it hit my face,” he said.\nGibbs said he scrambled to get everyone to safety, grabbing his family and pushing them off the bed. Seconds later, he realized he had been hit.\n“I reached down, I grabbed my leg and that’s when I pull up and I see all this blood all over my hand.”\nGibbs said the bullet went through one leg and grazed the other.\n10 On Your Side captured video of police on the scene minutes after the shootings happened.\nPolice say all they can say right now is that there was a cookout going on and at least one of the victims was attending, but they haven’t said what ultimately led to the quadruple shooting.\n“It’s just unreal. Its just unreal,” Gibbs said.\nNow out of the hospital, he’s replaying the ordeal in his head, just grateful for life.\n“When I got to looking where the bullet when through the headboard, if my legs would not have been there, it would have hit her and my wife. They wouldn’t have been here,” he said.\nThis isn’t the first time Gibbs witnessed a shootout. He said in June, he narrowly escaped being shot right outside of his house.\nAccording to Norfolk Police, in that case, someone different was shot in the foot, but wouldn’t cooperate with their investigation.\nNow after two shootings nearby, Gibbs said his family is considering a new place to call home.\n“I’m not afraid. I’m not afraid for myself. I’d take another bullet for my wife and daughter anytime, anytime. I’m scared for them,” he said.\nDetectives are still investigating. Anyone with information about the incident is asked to call the Norfolk Crime Line at 1-888-LOCK-U-UP."}