{"uri": "https://www.washingtonpost.com/local/public-safety/prince-georges-mourns-firefighter-as-police-continue-shooting-investigation/2016/04/16/c66d4db2-03d6-11e6-b823-707c79ce3504_story.html", "title": "Prince George’s mourns firefighter as police continue shooting investigation", "dct": "Sat, 16 Apr 2016 00:00:00 GMT", "id": "c671db137af665d5a1b60d330df185f3", "content": "John E. Ulmschneider always wanted to be the first firefighter at the scene in an emergency. On Friday, his desire to help cost him his life.\nUlmschneider was among the Prince George’s County rescuers who rushed to a Temple Hills-Camp Springs-area house after a call from a man who had been unable to reach his diabetic brother. The caller told firefighters that he feared his brother had suffered a blackout or seizure.\nWhen knocks on the door went unanswered and there was no response as rescuers announced that they were outside, the emergency workers decided to break through the door, officials said. As they did, gunshots erupted from inside, mortally wounding Ulmschneider and injuring another firefighter and the man’s brother.\nAuthorities said Saturday that they are still working to determine why the 61-year-old man allegedly opened fire. But a county fire spokesman said it may have been a tragic mistake — the man possibly thought that the rescuers were intruders seeking to break into his house.\nThe man was released from police custody Saturday evening, officials said, and no charges have been filed. Officials did not say whether the man had suffered a medical emergency.\nOne firefighter was shot and killed and a second was critically wounded Friday, April 14 in Prince George’s County while answering a medical call, authorities said. (WUSA9)\nAs police continued their investigation, family members and colleagues mourned the death of the one firefighter and prayed for the recovery of the other. At Ulmschneider’s station in Landover Hills, they draped black bunting over the firehouse and along the hood of an ambulance parked on the lawn.\nUlmschneider, who had been in the department for 13 years, was a husband and the father of a 2-year-old girl, officials said. The 37-year-old went by the nickname “Skillet” and had decided in high school that he would become a firefighter.\n“He wanted to help others,” said Diana Krieger, whose daughter is married to Ulmschneider’s brother. “He loved doing what he was doing, being a paramedic and a firefighter, and I really believe that he was doing God’s work.”\nAuthorities identified the wounded firefighter as Kevin Swain, 19, a volunteer at the Morningside station. They said he had been shot four times and underwent surgery at Maryland Shock Trauma Center in Baltimore. He is expected to survive, they said.\nThe injured brother was shot in the shoulder and was listed in fair condition at a local hospital, officials said. They did not identify either brother by name.\nThe incident began about 7:30 p.m. Friday when firefighters and medics arrived at the home, said Mark Brady, a spokesman for the county department. The occupant’s brother was outside with them, he said, and the rescuers announced themselves loudly three times and knocked repeatedly.\nBrady said the rescuers made the decision not to wait for police to arrive because they “felt compelled that there could be a medical emergency going on” and “had to enter the house as soon as possible.”\nThere is no set protocol governing when responders will enter a residence by force, he said. Rather, the decision is based on individual circumstances.\nAfter the shooting, Brady said, the man inside the home quickly surrendered to police. Two additional volunteer firefighters were injured as they sought cover during the shooting, he said. One suffered a knee injury, and the other hurt her jaw.\nOn Saturday morning, officers had blocked off the home with police tape. There were two Prince George’s forensic services vans parked across the street and a police car parked in the driveway. The front and garage doors were open as investigators worked inside. The block of mostly ranch houses was quiet.\nJose Zuniga, who lives down the street, said he was on his porch Friday evening watching his young son and two grandchildren play soccer on the front lawn when he noticed an ambulance and fire emergency vehicle pull up.\nThe 52-year-old man, speaking in Spanish with his daughter as an interpreter, said he figured that it was a small house fire and thought nothing of it until he started hearing a smashing noise against the home’s front door. Soon after, he heard gunshots and saw first responders leap into the bushes outside the door.\nHe ushered the children — ages 3, 10 and 13 — inside. He recalled thinking that it took a while for police to arrive.\n“It’s the first time anything like this happened” in his 11 years on the block, he said.\nThe Zunigas said that they didn’t know who lived in the house but that it was a man. Another neighbor said the occupant had been there about seven years and lived by himself.\nBrady said Ulmschneider was always the first person to step up to get a job done, so it wasn’t surprising to anyone that he was one of the first ones at the door that evening.\n“He was extremely dedicated to service. He was a hard-working country boy,” Brady said. Firefighters would joke that Skillet had such a hard head, he said, “he could take a knock and keep on working.”\nAs a teenager, Ulmschneider worked at Miller Farms in Prince George’s County and continued to help out between fire shifts, said Richard Miller, a member of the family that owns the farm.\nMiller said that Ulmschneider met his wife, Dawn, at the farm. Her father also was a firefighter, and her mother is a distant relative of state Sen. Thomas V. Mike Miller Jr. (D-Calvert), president of the Maryland Senate.\nHe explained how Ulmschneider, who lived in St. Mary’s County, earned his nickname: When Ulmschneider was a teenager, he drove a dirt bike off a hill near the farm, trying to do a trick — and fell off and hit his head. When he was in the hospital with stitches and a red face, they all joked that he looked like a skillet.\n“The guy was never tired of helping you out. He would work all day at the fire department then would come by here,” Miller said. Ulmschneider was “someone who could fix and do anything around the farm as far as working on tractors, trucks. . . . He always had a smile on his face, and if you were down, he would be the one who would get you back up.”\nClarence Godfrey, a retired county paramedic, also had fond memories of Ulmschneider. “He was hard-working and dedicated,” said Godfrey, who lives in Upper Marlboro. “He was very humble and funny.”\nGodfrey said Ulmschneider worked at several fire departments to pick up overtime. On Friday night, fire officials said, Ulmschneider was on assignment with the Forestville Fire/EMS station, but he typically worked at the Landover Hills Fire/EMS station.\nIn a statement, Prince George’s County Executive Rushern L. Baker III called Ulmschneider “a dependable family man who loved serving this county as both a firefighter and paramedic.”\nAndrew Pantelis, president of the Prince George’s County Professional Fire Fighters and Paramedics Association Local 1619, said in a statement, “This is a day that we have all dreaded in our minds.”\n“We are keenly aware of the dangers of our profession but we all have hoped that God would continue to look over and protect us,” he wrote. “Now that tragedy has stricken us, we must not fall apart but stand strong and band together to support Skillet’s family and those who are closest to him.”\nLynh Bui and Hamil H. Harris contributed to this report."}