{"uri": "http://www.wwltv.com/news/crime/police-suspects-in-stolen-vehicle-fired-at-officers-three-different-times/305142204", "title": "Police: Suspects in stolen vehicle fired at officers three different times", "dct": "Tue, 23 Aug 2016 00:00:00 GMT", "id": "25ee1f7f9429e37a36e3733a6705d2ad", "content": "NEW ORLEANS – Suspects driving in a stolen car that crashed after a police chase fired at officers in three separate incidents Sunday, the last of which resulted in the death of one of the suspects, the NOPD said Monday.\nNOPD Superintendent Michael Harrison said a State Trooper was shot in the left elbow during one of the exchanges.\nRELATED: State Trooper Wounded, one suspect dead in 7th Ward shooting\nHarrison said the entire incident began as a state trooper began pursuit of a gray, 2015 Toyota Camry that had been reported stolen on Aug. 4 in the 1500 block of Crete Street.\nThe trooper pursued the vehicle to the intersection of Allen and Duels Streets where the vehicle crashed. Harrison said three suspects got out of the car and ran in different directions. Two of the suspects fired at the trooper, who did not return fire, but called for additional aid.\nState trooper units and NOPD units nearby responded to the scene and a second trooper chased one of the three suspects to the 1900 block of Hope Street. The trooper got out of the vehicle and chased the suspect into an alley, where they fired shots at each other. The trooper was shot to the elbow and taken to the hospital.\nSeveral units arrived at the intersection of Law and New Orleans Streets where police said the same suspect who shot the trooper, then fired at officers, who returned fire, hitting the suspect.\nThe suspect was taken to the hospital, where he later died. Police said a black, semi-automatic handgun with an extended magazine was found on the suspect.\nA perimeter was set up in hopes of capturing the other two suspects, but, as of Monday afternoon, they had not been taken into custody.\n(© 2017 WWL)"}