{"uri": "http://www.nola.com/crime/index.ssf/2016/08/suspects_in_7th_ward_gunfight.html#incart_river_index", "title": "Suspects in 7th Ward gunfight with police 'have no regard for human life,' NOPD chief says", "dct": "Mon, 22 Aug 2016 22:56:00 GMT", "id": "bd25bac06cb4b4675baeb4ed595b960b", "content": "These were not fireworks, Briana Gordon thought. Thirty years of living in New Orleans had taught her the difference.\nShe had heard gunfire before, but never this close to her family's 7th Ward home. Her sister and mother grabbed her young nephews and niece, and the entire family ducked for cover in fear of catching a stray bullet.\nWhen the shooting finally stopped Sunday afternoon (Aug. 21), one Louisiana State Police trooper was left with a gunshot wound to his elbow, and the man authorities suspect was responsible for that wound was lying dead on the pavement outside Gordon's home.\n\"That's the way that goes,\" Gordon said Monday from her home at New Orleans and Law streets. \"I figured he was probably a criminal trying to escape from police and shooting at cops.\"\nWhile several questions remain unanswered, new details from New Orleans police and from witnesses started to provide a fuller picture of the events surrounding Sunday's gun battle between law enforcement and two of three men in a stolen 2015 Toyota Camry.\nThree different shooting scenes\nAt least four officers - two from State Police and two from NOPD - took fire in three different shooting scenes all contained within a roughly three-block-by-three-block area. Two of the three men riding in the stolen Camry, including one police say fired the first shots at officers, remain at large and should be considered armed and dangerous, said NOPD Superintendent Michael Harrison.\n\"It makes our job that much harder when people just have no regard for human life,\" Harrison said during a press conference Monday. \"These people make this very cowardly decision to fire at police officers, putting innocent people in harm's way.\"\nThe unnamed trooper was released as dead suspect's identity withheld and authorities continue investigating yesterday's 7th Ward shooting.\nHarrison said the Camry's owner reported it stolen from the Fairgrounds neighborhood three weeks ago, and it had become part of an ongoing State Police investigation into New Orleans-area auto thefts.\nState Police had the Camry under surveillance Sunday, Harrison said, though he did not say where the car was just before it sped away from a trooper who tried to stop it.\nThe chase ended in the 7th Ward, Harrison said, when the Camry crashed at the intersection of Allen and Duels streets. Three men jumped out of the car. Two of them opened fire on a State Police trooper while he was still in his marked SUV, Harrison said.\nThe trooper was not injured and did not return fire, the chief said.\nThe trooper called for backup from State Police and NOPD. A second trooper spotted one of the three suspects in the 1900 block of Hope Street, about four blocks away. That trooper chased the suspect into an alley, Harrison said, where the suspect fired at the trooper, striking him in the elbow.\n'Samuel. I'm shot.'\nThe trooper returned fire, but Harrison said it was not immediately clear whether the suspect was wounded. Witness accounts from neighbors near Gordon's house, however, suggest he was wounded before being fatally shot by authorities at New Orleans and Law streets.\nA woman who lives on Law Street, and asked not to be identified out of fear for her safety, said she and her granddaughter were home when they heard someone banging on their back door.\nShe looked through her blinds but could only see the top of someone's head, which was covered with a hat. The woman then went to the front of her house and spotted the same hat moving along the side of her house, toward her front porch.\nThe woman barely opened her front door and, looking through her locked gate, saw a man trying to crawl up the steps of her front porch. The blood splotches he left behind were still visible Monday.\nThe woman yelled for the man to identify himself.\n\"He looked me dead in my eye and said, 'Samuel. I'm shot,'\" she remembered.\nThe woman slammed her door shut and went to grab her phone to call police. Her next-door neighbor was also looking out his window at the time. He did not want to give his name when speaking with reporters Monday, but he said he could see that the man was clearly wounded when he left his neighbor's front porch and headed in the direction of Gordon's house.\nThe woman's neighbor said he lost sight of the wounded man, but he could see a marked NOPD cruiser stop on New Orleans Street next to Hardin Park. Two police officers jumped out of the car and, guns drawn, opened fire.\n\"He looked nervous,\" the neighbor said in describing one of the two officers.\nHarrison said the suspect who wounded the State Police trooper fired first at officers responding to New Orleans and Law streets. Gordon said she could see a handgun on the grass next to the man's body. That gun had been reported stolen from St. Tammany Parish, Harrison said.\nHarrison confirmed that two NOPD officers returned fire. Those two officers have been placed on administrative reassignment pending the outcome of the department's investigation.\nThe chief declined to identify the two NOPD officers. He also did not say whether the State Police troopers also at New Orleans and Law streets fired their weapons. An NOPD press release says \"law enforcement officers returned fire, striking the suspect.\" NOPD spokesman Tyler Gamble said detectives were still investigating whether any State Police troopers fired on the suspect at New Orleans and Law streets.\nHarrison also declined to provide a breakdown of how many shots were fired, and by whom. The chief said members of the Independent Police Monitor's office and NOPD's Force Investigation Team - the lead investigating agency - plan to be present Tuesday for an autopsy at the Orleans Parish Coroner's Office.\nBoth NOPD officers were wearing body cameras at the time of the shooting. That footage, as well as footage from dashboard cameras, is being reviewed, Harrison said. As part of a new NOPD policy, the chief will have up to nine days to decide, based on published guidelines and recommendations from others in the department, whether to release any footage to the public.\nAnyone with information about the two at-large suspects should contact Crimestoppers at 504-822-1111."}