{"uri": "http://www.wwltv.com/news/local/orleans/coroner-suspect-killed-himself-with-fatal-shot-during-gun-battle-with-police-sunday/305841778", "title": "Coroner: Suspect killed himself with fatal shot during gun battle with police", "dct": "Tue, 23 Aug 2016 00:00:00 GMT", "id": "e05401409fbc9465a89e75b3e2050ca9", "content": "NEW ORLEANS -- The death of a man during an officer-involved shooting Sunday was the result of a suicide, according to the Orleans Parish Coroner's Office.\nBernie Porche, 37, died Sunday after an incident with State Police. Officers were on patrol looking for stolen vehicles and tried to make a traffic stop on a vehicle they believe was stolen.\nAs police were stopping that vehicle, one subject got out and began firing, hitting the trooper in the left elbow.\nDuring a hunt for suspects, police came across one of the suspects, later identified as Porche, and exchanged gunfire near Law and New Orleans streets.\nAccording to a statement from coroner Dr. Jeffrey Rouse, Porche can be seen on dashboard camera video from the NOPD firing at police while running from officers.\nPolice then returned fire and Porche fell to the ground.\n\"After a brief period of being motionless, Mr. Porche then moves his arm, and another shot occurs in close proximity to his head, while officers remain at a distance,\" said the coroner.\nPorche suffered three gunshot wounds, said a statement from Rouse.\nThe first wound hit his legs and the second wound hit him in the lung. Both bullets were collected and \"Neither of these wounds traversed major blood vessels and (both) were potentially survivable,\" said Rouse.\nThe fatal gunshot was the third one. \"This wound had an entrance on the right side of the head and exit on the left, leaving no fragments observable on x-ray nor recoverable for analysis. Significantly, the entrance wound showed evidence of soot deposition on the skin with searing around the edges and soot on the underlying bone. This pattern occurs when a bullet is fired with a muzzle in contact with skin.\"\nDue to video and autopsy evidence, Porche's death \"is consistent with a self-inflicted gunshot, and the death of Mr. Porche has been preliminarily classified as a suicide,” said Rouse.\nDuring Porche’s autopsy, representatives from the Federal Bureau of Investigation, the Independent Police Monitor, the Federal Consent Decree Monitor, the Louisiana State Police and the Force Investigation Team of the New Orleans Police Department were present, according to the coroner."}