{"uri": "http://www.seattletimes.com/seattle-news/3-dead-1-wounded-in-clark-county-shooting/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_seattle-news", "title": "3 found dead at Clark County home; man with Nazi tattoos arrested", "dct": "Sat, 16 Jul 2016 19:32:00 GMT", "id": "77c838f38163a078b8a1dd7fffae5665", "content": "A man with elaborate Nazi tattoos was arrested Saturday afternoon after authorities found three people dead inside a Clark County home.\nAuthorities had launched a broad search for Brent Luyster, saying he was believed to be armed and extremely dangerous. They eventually found him in a vehicle on Ocean Beach Highway, where he was arrested without incident by Cowlitz County deputies and state troopers, authorities said.\nSgt. Fred Neiman said in a bulletin that he appreciated the attention brought to the case, along with “tips and information resulting in the apprehension of the suspect.”\nAlong with the three people found dead at the home near Woodland, authorities said a woman also suffered a gunshot wound to the face. She managed to drive herself to a convenience store Friday night, according to authorities.\nPlay VideoPlayMuteCurrent Time 0:00/Duration Time 0:00Loaded: 0%Progress: 0%Stream TypeLIVERemaining Time -0:00Playback Rate1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptionsAudio TrackFullscreen\nThis is a modal window.\nCaptions Settings Dialog Beginning of dialog window. Escape will cancel and close the window. Text Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps Defaults Done\nIn photos provided by the Sheriff’s Office, Luyster is shown with swastikas and images of Nazi leaders on his back and arms\nThe Columbian reported that Luyster was set to go on trial Monday on charges that he pistol-whipped his ex-girlfriend in Longview. Luyster pleaded not guilty in May to charges of assault, harassment and illegal firearm possession."}