{"uri": "http://www.mystatesman.com/news/news/local/officials-suspect-del-valle-fire-linked-to-death-o/nsT8S/?icmp=statesman_internallink_referralbox_free-to-premium-referral", "title": "Officials suspect Del Valle fire linked to death of 4 was arson", "dct": "Fri, 09 Sep 2016 00:00:00 GMT", "id": "ae938625242492871928e57ce7432515", "content": "0\nDEL VALLE —\nFire investigators have found evidence suggesting that the Del Valle house fire that led to the discovery of a suspected quadruple homicide Thursday might have been intentionally set.\nTravis County Fire Marshal Tony Callaway said the location where the four adult victims were found dead inside the home has led him to believe the fire was arson. Investigators also believe an accelerant — such as gasoline — was used to set the fire, he said.\nIt will take one to two weeks for the State Fire Marshal’s Office to test evidence collected from the scene to confirm the presence of an accelerant, Callaway said.\nSTAY ON TOP OF THE NEWS: Click here to sign up for our Breaking News emails\nThe Travis County sheriff’s office began investigating the victims’ deaths as possible homicides after they found what appeared to be gunshot wounds on their bodies.\nThe sheriff’s office identified two Bastrop men, Jacob Derr, 25, and Brian Lee Satterfield, 41, as possible victims. The sheriff’s office hasn’t officially confirmed their identities, but detectives “strongly suspect” those two men were killed in the incident, a news release said.\nAnother man with Bastrop ties, Matthew Aaron Barber, 26, was named as another possible victim. Barber is thought to have been a resident of the home. The fourth victim hasn’t been named.\nThe fire in the 8300 block of Linden Road, about two miles east of Circuit of the Americas, was first reported by a neighbor who called 911 around 5:54 a.m. The fire burned about half of the home, which is set far back from the street on a property with multiple buildings.\nThe fire was extinguished relatively quickly after Travis County and Austin firefighters arrived to the scene.\nFire marshals then examined the property looking for burn patterns and other evidence that might indicate arson. A dog trained to detect accelerants found the presence of fuels, Callaway said\nCallaway said fire investigators looked at the locations of the bodies to determine what they were likely doing before they died. The location where a body is found in relation to the location where the fire started can sometimes indicate whether a victim was awake, asleep or actively trying to flee the fire.\nCallaway wouldn’t elaborate further as to what made him believe their locations were suspicious.\nA neighbor who wished not to be named said that, on the morning of the fire, her husband heard what he believed to be at least two gunshots. When she looked out a window toward the sound of the shots, she saw the fire.\nOther neighbors told the American-Statesman that they had seen cars coming and going from the home during all hours of the night. On Thursday, Travis County sheriff’s spokeswoman Kristen Dark said investigators hope to learn the identities of the people who visited the home.\nDetectives asked for anyone with information about Derr or Satterfield and their connection to the home where the fire occurred to call Crime Stoppers at 512-472-8477.\nAll four victims were at the Travis County medical examiner’s office Friday, where investigators are working to confirm their identities and causes of death. Their autopsies were completed Friday, but results won’t be available until lengthy toxicology tests are completed."}