{"uri": "http://www.timesdispatch.com/news/local/city-of-richmond/four-dead-in-apparent-murder-suicide-in-richmond/article_58a3e04a-f0ed-51d7-a7e6-3b867aa84353.html", "title": "Family members: Teenage woman, young boy among 4 slain in S. Richmond", "dct": "Thu, 09 Oct 2014 05:58:00 GMT", "id": "b816bba124f6b85b07958099b2728591", "content": "Police are investigating an apparent murder-suicide that left four people dead Wednesday night in the 100 block of East Roanoke Street in South Richmond.\nFamily members at the scene said the dead include a boy as young as 3 or 4 years old, and a young woman believed to be 19. The deadly attack possibly erupted as the result of domestic troubles including a child custody dispute, they said.\nPolice said a woman’s body was found along the sidewalk in front of the small, two-story bungalow when officers answered the “shots fired” 911 call at 8:21 p.m. It took just minutes to respond but not in time to revive any of the victims.\nA far more gruesome scene awaited investigators inside, where a young boy, age three or four, lay dead. Nearby were the bodies of a teenage woman, believed to be 19, and the gunman, an older male. Police recovered a handgun they suspect was used in the killings.\nPolice said they hope to confirm and release the identities of the four Thursday morning. But the certainty of the identities appeared beyond doubt to family members who gathered into the early morning hours on street corners at opposite ends of the murder scene, a block off Midlothian Turnpike and east of George Wythe High School.\nA pumper truck from Engine Co. 20 arrived on scene shortly before 2 a.m. and three firemen hosed away pools of blood on the sidewalk in front of the 70-year-old home, rendering the hose spray a dull pink in the pumper’s headlights.\nBlocks away, family members and friends were held back by police tape and squad cars, their lights illuminating an area of several square blocks. In separate clusters of grief, family members cried out in pain and sometimes collapsed to the ground over still-unconfirmed deaths.\nMarkeita Boyd prayed, wrapping her arms over sobbing knots of mourning men and women.\n“She just fell out right where she was,” Boyd, a member of Citizens Against Crime, said of the mother of the teenage victim who had driven from Newport News last night with her husband, Clarence Gary.\n“My heart dropped to the bottom of my feet; there are no words for this,” whispered Gary, who said his daughter was a student at J. Sargeant Reynolds Community College seeking a degree in criminal justice. Gary’s daughter, family friends said, may have been killed when she tried to intervene in a custody transfer involving the young boy between the older male shooting suspect and the child’s mother, the woman found dead outside the home.\n“She always wanted to help people, to do the right thing,” said Gary, who moved from Richmond to Newport News after his wife’s health failed. She’d been a respiratory therapist at an area hospital.\nSisters of the teenage victim said they’d heard snatches of cell phone calls from their sister that indicated something was wrong.\nAt the opposite end of the crime scene, the father of the alleged shooter shuddered with grief as more than a dozen neighborhood and family friends surrounded him. “They won’t tell me what happened,” he said of police. “I just don’t know what happened.”\nEarlier in the evening, Christine Gibson said she had just been attending a meeting at nearby Swansboro Elementary School with other residents and City Councilman Parker C. Agelasto, 5th District.\n“The message (at the meeting) was everything seems to be getting better,” said Gibson, referring to crime in the area.\nShe said residents had been saying that things were looking up, with the weather cooling off and the holidays coming up. “But when I came out of the meeting, police cars were flying up Midlothian (Turnpike) and I knew something was wrong.”\nShe soon learned from news reporters that four people were dead.\n“It breaks your heart,” she said."}