{"uri": "http://www.mercedsunstar.com/news/local/article3288744.html", "title": "Los Banos gang member gets 40 to life for murder", "dct": "Fri, 04 Apr 2014 21:17:00 GMT", "id": "4b90bff1cf4afdd1c13d8b33e9405985", "content": "Kimberly Brewer stood before a crowded courtroom Friday morning and said she would never forgive the gang member who opened fire into a crowded garage last year in Los Banos and killed her 18-year-old son, Shane Moore.\nBrewer described convicted killer Albert Hernandez as a “cold, calculated monster.”\n“We do not forgive him for killing Shane,” Brewer told the judge. “True justice would be for the court to turn him over to us.”\nHernandez, 18, was sentenced Friday to serve 40 years to life in prison for killing Moore on March 4, 2013. A jury convicted him of second-degree murder and gang participation in February after a three-week trial before Judge Ronald W. Hansen. Hernandez was 17 at the time of the attack, but he was charged as an adult.\nThe Merced County District Attorney’s Office said Hernandez intended to attack rival gang members but killed Moore, who was not involved in gangs, and injured three others. Hernandez fired at least 10 rounds from a Ruger P89 pistol with an extended magazine into a crowd of about a dozen people, according to trial testimony.\nAn appeal is planned.\nCo-defendant Christopher Aguayo pleaded guilty on Oct. 2, 2013, to being an accessory in the killing and was sentenced to seven years in the state Division of Juvenile Justice. Aguayo, 16, also was charged as an adult.\nProsecutors sought a first-degree murder conviction, but the jury found Hernandez innocent of that charge.\nDefense attorney Chris Loethen said jurors believed Hernandez shot into a crowd of people but did not intend to kill anyone. Loethen also noted the three other victims were all shot below the waist, which he said was further evidence Hernandez did not intend to kill.\nMoore’s family rejected the argument and said the jury should have convicted Hernandez of first-degree murder.\n“The intent (to kill) was there,” Brewer said outside the courtroom Friday. “It doesn’t matter whether you’re a good marksman or not.”\nIn his ruling Friday, the judge considered Hernandez’s youth, maturity, and high school records when determining parole eligibility. Hansen said Hernandez’s high school grades showed “some hope,” but were “inconsistent” and noted a history of suspensions.\n“I cannot overlook the lifestyle he chose. I can’t ignore the fact he killed an innocent person, a person he did not know, a person who did not know him,” Hansen said. “Mr. Hernandez, you have a steep price to pay.”\nHansen said Hernandez would not be eligible for his first parole hearing for 25 years, the maximum time allowed for a juvenile by law.\nLoethen said he respectfully disagreed with the characterization of Hernandez made by both the judge and the victim’s mother. He said he empathized with Brewer’s grief, but said the realities of the case were more complex than labeling his client as “a monster.”\n“He’s not a monster,” Loethen said. “He was himself victimized (by gangs) and he tried to avoid killing anyone. That’s not a monster. There are reasons why he ended up in that situation.”\nHe described Hernandez as a “shy kid,” with a “warm, nice personality” who got involved with street gangs for protection after he was assaulted by a gang member in San Jose. Loethen described Moore’s death as “a terrible tragedy” for the victim’s family, as well as Hernandez’s family.\nDuring the trial, Loethen criticized tactics used by Los Banos police investigators during their interview with Hernandez. Loethen said police exploited Hernandez’s youth and his ignorance of the law and crime scene investigation methods to convince him that he would never see his family again unless he confessed to killing Moore.\nProsecutors countered the argument saying detectives used legal, commonly practiced methods of interrogation in their interview and that falsely confessing to a murder “made no sense.”"}