{"uri": "http://www.mercedsunstar.com/news/local/article3286805.html", "title": "Jury finds Los Banos gang member guilty of second degree murder", "dct": "Fri, 28 Feb 2014 17:54:00 GMT", "id": "c6408b16ac3792bcd4c6d6ccd375473d", "content": "After deliberating nearly three days, a Merced County jury on Friday convicted a Los Banos gang member of murder in connection with the death of an 18-year-old man last year.\nAlbert Hernandez, 18, was found guilty of second-degree murder and criminal street gang participation. The Merced County District Attorney’s Office had charged Hernandez with first-degree, or premeditated, murder.\nThe jury of nine women and three men also found Hernandez guilty of firearm and weapons enhancements, but not guilty of three counts of attempted murder in connection with the same incident\nThe verdict came after a nearly three-week trial before Judge Ronald W. Hansen in Merced Superior Court.\nShane Moore, 18, was shot to death March 4, 2013, at a home in the 800 block of La Mesa Lane in Los Banos. Three other people were injured in the attack.\nProsecutors said Hernandez fired 10 rounds from a Ruger P89 pistol with an extended magazine into a crowd of about a dozen people. The group included several people Hernandez believed were rival gang members. Moore was not a gang member and, police said, not the intended target.\nThomas Min, the deputy district attorney who prosecuted the case, said he respected the jury’s verdict, saying, “I’m glad that Shane’s family will have some closure.”\nMoore’s family attended nearly every day of the trial, but asked for privacy.\nCo-defendant Christopher Aguayo pleaded guilty Oct. 2, 2013, to being an accessory in the killing and was sentenced to seven years in the state Division of Juvenile Justice. Aguayo, 16, was charged as an adult.\nHernandez’s attorney, Deputy Public Defender Chris Loethen, said that based on the conviction, the jury believed the defendant fired into a crowd of people, but did not intend to kill anyone.\n“But firing into a crowd is such an incredibly dangerous action that is likely to produce death or great bodily injury. That’s what this (verdict) indicates,” Loethen said after the verdict was read. “I’m thankful for the not guilty verdicts and the time and the effort and thought they (the jurors) put into this verdict.”\nJurors could not be reached for comment Friday.\nLoethen said an appeal is planned, and he intends to speak with Hernandez regarding a possible motion for a new trial.\nHansen ordered Hernandez to return to court March 28 for sentencing. The maximum possible prison sentence was not clear Friday.\nDuring the trial both attorneys focused heavily on Hernandez’s interview with Los Banos police detectives nearly three weeks after Moore’s death. With no physical evidence in the case, Hernandez’s statement was the key piece of evidence.\nProsecutors said Hernandez confessed to killing Moore unintentionally while firing at suspected rival gang members.\nThe defense called it a false confession and said Hernandez, who was 17 at the time but charged as an adult, only said he killed Moore because police convinced him it was the only way he would be able to see his family again. Prosecutors countered, saying falsely confessing to a murder made “no sense.”\nHernandez remains in custody in Merced County pending sentencing."}