{"uri": "http://www.ktuu.com/content/news/Anchorage-police-conduct-early-morning-death-investigation-in-Government-Hill-411422175.html", "title": "Family members identify 17-year-old killed in Government Hill shooting", "dct": "Mon, 23 Jan 2017 09:55:00 GMT", "id": "f341224659dd5631fb8648eaa6046338", "content": "ANCHORAGE (KTUU) - Family members have identified the 17-year-old boy fatally shot in Government Hill early Saturday morning as Jesus “JJ” Oropeza.\nFelicia Smith, Oropeza’s aunt, said the boy left his Government Hill home on foot at around midnight Friday after telling his father he planned to walk to the Tesoro Gas Station. The father, concerned about what his son was doing outside at that hour, decided to follow him. By the time he had put on his coat and shoes, Oropeza had already made his way down the street, Smith said.\nAccording to Government Hill resident Stephanie Manning, a security camera on the outside of her home captured the entire incident. She says the footage shows Oropeza meeting with two individuals at a street corner shortly after midnight.\n“It showed very clearly the two perpetrators come around our side street and then the victim walking from another direction,” Manning said. “They were young teenage boys.”\nAfter a brief conversation, one of the two individuals produces a handgun and points it at Oropeza, who then gets down on his knees before lying face down in the snow. The two suspects are then seen searching through Oropeza’s pockets. Shortly before fleeing the scene, the suspect with the gun shoots Oropeza in the back.\n“None of the neighbors or I heard anything,” Manning said. “I think the snow muffled any sound. I was downstairs getting ready for bed and then the dog barked two times so I came upstairs and saw somebody laying in the road.”\nFamily members said Oropeza’s father, still trying to catch up with his son, saw what had happened from down the street and immediately ran towards the two suspects.\n“When he turned the corner, the boy was on the floor, so he ran,” Smith said. “And as he was running the guy started firing guns,” Smith said.\nAs the suspects fled in a vehicle, Oropeza’s father ran to his son’s side. Shortly thereafter, Government Hill resident James Maloney, who was driving back home from a friend’s house, came across the scene and immediately jumped out of his car to render aid.\n“I saw a man kneeling next to a kid and he was on the phone and crying. I got out of the car and approached and asked him if he needed help,” Maloney told Channel 2. “He said his son had been shot.”\nMaloney helped the father tell dispatchers their location and began administering CPR to the victim while they waited for paramedics to arrive.\n“When I walked up he appeared to be dead already but I did all I could to save his life. I really wish I could have done more,” Maloney said.\nAnchorage Police responded to reports of a man lying in the road just a few minutes after midnight. Oropeza was rushed to a local hospital where he was later pronounced deceased. Meanwhile a heavy police presence was seen in the area, as officers with rifles and a K9 unit searched the area for the suspects.\nCattherine Rhetta, another one of Oropeza’s aunts, said marijuana was found at the crime scene and thinks it may have had something to do with her nephew’s killing.\n“It was for marijuana. It was a setup,” Rhetta told Channel 2. “They knew what they were doing, they knew what they were coming for. He just had the mistake of coming down the street last night and getting shot and killed. He didn’t know any better.”"}