{"uri": "http://www.kansas.com/news/local/crime/article62530532.html", "title": "Four dead, including gunman, in Kansas workplace shooting", "dct": "Thu, 25 Feb 2016 17:40:00 GMT", "id": "56b93ae8b4b0cbf45c35e3210578df4c", "content": "An employee went on a shooting spree Thursday afternoon that left three people dead and injured 12 at a manufacturing plant in Hesston, about 35 miles north of Wichita.\nTwo other people were shot earlier, one in Newton and one on U.S. 81.\nThe suspected gunman – identified by two co-workers who witnessed the shootings as Cedric Ford – was shot and killed inside the plant by a Hesston police officer.\n“This is just a horrible incident here,” Harvey County Sheriff T. Walton said. “It’s going to be a lot of sad people before this is all over.”\nWalton said authorities have an idea of the motive, “something that triggered this particular individual.” But he did not offer any details Thursday evening.\nThe shooting at Excel Industries, which manufactures lawn mowers and employs about 1,000 people, was reported shortly after 5 p.m. on Thursday. About 150 people were inside the plant when the shooting began.\n“I heard some popping noises, but I thought it was just a drill,” said Tim Kasper, a laser operator at Excel. “Then I heard a three-round burst, and I knew it was something real.\n“I got out of there quick. People were running and panicking. It was chaos.”\nLaw enforcement gave this account of the day’s events:\n▪ The first call to 911 came at 4:57 p.m. A man was shot in the shoulder while driving near 12th and Meridian in Newton. He said he was shot by someone in another vehicle.\n▪ A short time later, a report came in of a motorist shot in the leg while driving a pickup near Meridian and Hesston roads, which is between Newton and Hesston.\nThe vehicle driven by the shooter drove off the road, and he stole the shooting victim’s pickup and drove it to Excel.\n▪ At Excel, the shooter shot one person in the parking lot before entering the building and opening fire.\nfacebook twitter email Share\nVIDEO: Harvey County Sheriff updates shooting situation in Hesston\nHarvey County Sheriff T. Walton updates the media about the shooting that took place at Excel Industries in Hesston, Kansas, during a 9 p.m. briefing Thursday night. ( Video by Fernando Salazar)\nfsalazar@wichitaeagle.com\n“The shooter was firing on any target that came within his sights,” Walton said.\nAt 5:23 p.m, less than 30 minutes after the first call, the shooter was killed inside the plant by a Hesston police officer.\nWalton said the officer took fire from the suspect as he entered the building. Walton said the officer “saved multiple, multiple lives.” He was not injured.\nWalton said law enforcement was working to identify the victims and notify family members. Those killed, including the gunman, remained inside the plant Thursday evening.\nWalton said the victims and the gunman were all killed near the front-office area of the plant. He said investigators would work through the night Thursday and Friday.\nFifteen ambulances and two helicopters were used to evacuate the wounded.\n“We’re going to do what we can to take care of them and bring them through this tragedy,” Paul Mullet, president and CEO of Excel Industries, said of his employees.\nThe shooting comes less than a week after authorities say a man opened fire at several locations in Kalamazoo, Mich., leaving six people dead and two severely wounded.\n“I ask all Kansans to offer their prayers for the victims and families of today’s shooting in Hesston,” Gov. Sam Brownback said in a statement Thursday night. “This is a tragedy that affects every member of the community and I ask that Kansans remember them in their thoughts.\n“State law enforcement agencies are supporting the local authorities and I will provide any support to help them and the entire community in the days and weeks to come.”\nfacebook twitter email Share\nVIDEO: Witness describes being at Excel during mass shooting\nExcel employee Marty Pierce describes hearing the shots and running out of the building when a gunman started shooting people inside the building in Hesston, Kansas, on Thursday. (Video by Fernando Salazar)\nfsalazar@wichitaeagle.com\n‘Everybody was running’\nGunfire at the plant started just a few hours into the second shift, just after employees had taken their first break. It began near the paint line, employees said.\nMarty Pierce said he was working in the welding shop when he heard the paint guys yelling, “Fire. Fire. Fire.”\nHe said he thought the building was on fire and was ready to leave when he heard a pop, pop, pop and saw people scattering and running outside. He left the building through a side door.\nHe said he ran into a female co-worker who said the shooter followed her outside. She hid behind a tree.\nfacebook twitter email Share\nVIDEO: Kansas sheriff describes mass shooting at Excel Industries\nHarvey County Sherriff T. Walton describes the shooting at Excel Industries in Hesston, Kansas, on Thursday. A gunman killed at least five people and injured 20. (Video by Fernando Salazar)\nfsalazar@wichitaeagle.com\nJacob Hershberger, 20, said he was working on the mower line, about 30 yards from the paint line, when he heard three gunshots. At first he thought the guys on the paint line were building something.\nThen he heard six more shots and heard someone yell, “Those are gun shots. You need to get out of here.”\nHe said he ran by one person who had been shot in the leg. He and other workers saw a second worker who had been shot in the back.\nThey loaded him onto a pallet and put him in the back of a motorized cart, and drove him out of the plant, urging him to keep his eyes open and stay awake.\nA law enforcement officer directed them to hide behind a grassy hill.\nAn employee who said he was in the plant said he heard gunshots and people shouting to get out of the building.\n“Everybody was running,” said the employee, who did not want to give his name.\nHe said the man, whom he recognized as a co-worker, seemed to be on a rampage.\n“He was coming at everybody,” the employee said.\nHe said he noticed two weapons: an AK-47 and some type of handgun.\nKasper, the laser operator, said one of his co-workers, a friend, was fatally shot in the head. He said he had just talked to his friend about 10 minutes before the shooting.\n“It’s pretty unnerving,” Kasper said. “Things can change fast. It was just a normal day before that.”\nfacebook twitter email Share\nVIDEO: Excel employee describes saving co-worker during mass shooting\nExcel employee Jacob Hershberger describes being in the building in Hesston, Kansas, where a gunman started shooting. Hershberger saved a co-worker while fleeing for his life. (Video by Fernando Salazar)\nfsalazar@wichitaeagle.com\nSuspect’s background\nA preliminary check of Ford’s background Thursday evening showed he has had legal woes in Kansas and in Florida – the state he claims as home on his Facebook page.\nHe has had a handful of criminal cases in Harvey County, where Thursday’s shooting took place, including a misdemeanor conviction in a 2008 fighting or brawling case and various traffic violations from 2014 and 2015, district court records there show.\nHis Florida cases encompass crimes such as burglary, fleeing from a police officer and grand theft, according to online public records database Lexis-Nexis. The adjudication of those and other cases was immediately unclear late Thursday.\nIt was also unclear what sentence Ford may have received for any of his convictions.\nIn what may be his most recent bout of trouble prior to Thursday’s shooting, Ford was accused of assault by a woman who identified herself in Sedgwick County court records as his live-in girlfriend.\nThe woman, in a written petition for protection from abuse that was filed Feb. 5, says she and Ford were arguing verbally that day in the 1800 block of South Green Acres Drive when he “became physical by him pushing me then grabbing me.”\n“He placed me in a choke hold from behind – I couldn’t breathe,” the woman wrote in all capital letters in her petition. “He then got me to the ground while choking me.” Eventually, she says, he let her go.\nA Wichita police report dated Feb. 5 shows that an officer took the woman’s report by phone shortly after 10:30 that morning. The woman, it says, reported a person “battering her leaving visible injuries.”\nPolice categorized the report as a domestic violence incident with no children present. Both have children, but not together, records show.\nIn her petition for protection from abuse, the woman expresses concern over Ford’s demeanor and mental state.\n“He is an alcoholic, violent, depressed,” she writes, again all in capital letters. “It’s my belief he is in desperate need of medical & psychological help!”\nNext to a question about whether she and Ford resided together, she jotted a note: “he’s moving out.”\nThe wounded\nVia Christi Hospital St. Francis in Wichita received six victims from the shooting, Walton said. He said that two were in critical condition and four were stable.\nWichita’s Wesley Medical Center was treating four patients Thursday evening. Walton said three were critical and one stable.\nNewton Medical Center in Newton received four patients. All four were stable, and one was transferred to Wesley Medical Center because of broken bones, according to CEO Steve Kelly.\nNewton Medical Center remained in lockdown Thursday evening because of a nearby situation related to the shooting at Excel.\nWalton said law enforcement was trying to get into the shooter’s home, but a roommate would not allow them access. Walton said authorities were in the process of a getting a warrant to enter the house.\nLate Thursday evening, the parking lot of the plant was encircled in crime-scene tape. Law enforcement officers had blocked off roads leading to the plant.\nInside the parking lot, a police car had its headlights pointed at a silver pickup, which was parked near a door on the northeast side of the building, where the shooter reportedly entered. The driver’s door of the pickup stood wide open.\nExcel Industries, 200 S. Ridge Road in Hesston, touts itself on its website as a “leading manufacturer of turf care products,” including Hustler Turf Equipment and BigDog Mower Co. lines.\nData curated by FindTheData\nTim Potter: 316-268-6684, @terporter\nAmy Renee Leiker: 316-268-6644, @amyreneeleiker\nKelsey Ryan: 316-269-6752, @kelsey_ryan\nBryan Horwath: 316-269-6708, @bryan_horwath\nTimeline\nHere is a timeline of events, according to Harvey County Sheriff T. Walton.\n5 p.m. - First reports of shots fired come in, saying a man is shooting at people from his vehicle into other vehicles near 12th and Meridian in Newton. A man was shot in the shoulder.\nThe second report of a shooting comes from Meridian and Hesston Road. A person was shot in the leg.\nA third shooting is reported in the parking lot at Excel in Hesston.\nThe fourth report is of an active shooter inside the Excel plant.\nThe reports came “one after another,” Walton said.\n5:30-5:45 p.m. - Shooter is killed by law enforcement officers."}