{"uri": "http://www.kaweahcommonwealth.com/news/deputies-mobilize-three-rivers-just-case", "title": "Deputies mobilize to Three Rivers... just in case", "dct": "Thu, 17 Jul 2014 19:24:00 GMT", "id": "caebe4c5f01293f832f262b9507316de", "content": "It’s been just over a year since as many Sheriff’s Department vehicles came screaming up to Three Rivers with lights flashing and sirens blaring. When this happened again last weekend, it’s no wonder so many assumed it was trouble on the river.\nOn June 27, 2013, that trouble on the river was a shoot-out at Cobble Knoll Recreation Area, a popular U.S. Army Corp of Engineers-managed river swimming hole just east of Lake Kaweah. That gang-related shoot-out and ensuing manhunt left two dead and two wounded. A surviving shooter, Manuel Talamantez, 28, of Farmersville, whose teenage brother was one of the victims of the violence, was captured shortly after the shootings in Lemon Cove and remains in a California prison.\nBut on the afternoon of Saturday, July 12, 2014, 15 marked patrol vehicles and several unmarked ones once again came racing up Highway 198. Even the local ambulance, normally parked in Lemon Cove, was staged by 4 p.m. at the White Horse Inn parking lot in preparation of what might be going down nearby.\nThe rapid mobilization began right after the alarm company that monitors Powerhouse No. 3 just below the Ash Mountain entrance station, reported “tampering” to the building or with the SCE transformers at the riverfront site.\nInvestigating officers in plain clothes from the National Park Service were on site. According to an investigating deputy, the unidentified officers with weapons drawn were captured by surveillance cameras and suddenly the situation escalated.\nOnce it could be determined that no suspects could be located in the vicinity of Powerhouse No. 3, half of the responders were dispatched to Kaweah River Drive to check on Edison Beach and Powerhouse No. 2, which is posted as closed to the public on weekends and holidays.\nFor at least 30 minutes, Kaweah River Drive was blocked off near the Dinely Bridge by seven Sheriff’s Department vehicles. A witness reported that one deputy, armed with an M16 rifle, had taken a vantage point up in a tree. Soon, law officers sounded the all clear for the Powerhouse No. 2 area too.\nBecause of the Cobble Knoll shootings one year ago, Three Rivers certainly has the attention of the Tulare County Sheriff’s Department. Last Saturday proved, in the event of trouble, the department can mobilize an impressive response of manpower and do it in a hurry."}