{"uri": "http://www.cleveland.com/metro/index.ssf/2016/12/boy_arrested_in_death_of_teen.html", "title": "Boy arrested in death of teen found shot dead in abandoned Cleveland building", "dct": "Thu, 08 Dec 2016 17:30:00 GMT", "id": "6df77322a24eba19e2e5a3853c5d5379", "content": "CLEVELAND, Ohio -- An 15-year-old boy was arrested Wednesday in connection with the death of a 16-year-old boy found shot dead in an abandoned building in the city's Slavic Village, police said.\nCleveland Police Sgt. Jennifer Ciaccia confirmed the arrest on Thursday. No information about the arrest was immediately available.\nAlex Mullins was found shot to death Nov. 20 in a building in the 3700 block of 54th Street.\nMullins was last seen by family members on Nov. 9 after his father dropped him off at Washington Park Environmental Studies, a technical school that teaches landscape design and animal and plant science management.\nHis father, Henry Mullins, reported him missing after he never showed up at his mother's apartment in Parma.\nThe family began a daily search through vacant homes in the neighborhood. They scoured dumpsters and vacant fields looking for him or his cellphone that last pinged near East 50th Street and Chard Avenue.\nCleveland police asked for the public's help in finding Mullins four days after he went missing.\nA woman called police Nov. 20 and said that her son heard rumors that Alexander Mullins was dead inside the building in the 3700 block of East 54th Street, police reports say.\nOfficers went to through the backdoor of the boarded-up building that sits between two vacant lots. They found him dead with a gunshot wounds to his left chest, according to police.\nPolice found bullet casings on the ground and a puddle of blood near Mullins, according to police reports.\nHenry Mullins previously said his son had typical teenage problems and was expelled from Parma schools for skipping classes and smoking cigarettes with friends. He enrolled his son at the Washington Park because he thought it would be safer.\nIf you'd like to comment on this story, visit Thursday's crime and courts comments section."}