{"uri": "http://www.wjbf.com/story/28947039/sheriff-talks-about-infant-shooting-investigation", "title": "Sheriff Talks About Infant Shooting Investigation", "dct": "Thu, 30 Apr 2015 22:50:00 GMT", "id": "1795e30f22fd4dddb38fefafc4f10164", "content": "An Augusta teenager is behind bars after a 1-year-old boy was shot and killed Wednesday.\nThe Richmond County Coroner says the infant, Rasheem Scriven ,was shot at least one time.\nThe 20-month-old died at his family’s home just after 2pm.\nThe home is located in the 1200 block of Holden Drive in Augusta. That’s right off Central Avenue.\nA 15-year-old has been charged, although he has not be identified to us because he is juvenile.\n“I mean it’s nothing you can put into words. This is a tragedy for this entire community. A 1-year-old child has no concept of the dangers of this world,” Sheriff Richard Roundtree told us.\nRichmond County investigators are still trying to figure out what lead up to the shooting death of the 20-month-old boy.\nThe sheriff says he believes two teenagers were playing with a loaded gun when it happened.\n“The handgun accidentally discharged while the 1-year-old child was present in the room striking the child in the head and causing his death,” he said.\nThe sheriff says the child’s mother was home at the time of the shooting.\nThe suspect, a juvenile who hasn’t been identified, has been charged with Involuntary Manslaughter, Reckless Conduct, and Possession of a Handgun by a Minor.\nInvestigators say they found the gun hidden elsewhere and are now looking into how the teen got it.\n“We believe it was possibly stolen, but we are trying to back track to see if multiple persons handled the gun, so we are working that angle of the investigation,” Roundtree said.\nNot much is known about the 15-year-old, other than the fact that he was a friend of a teen who lived in the home.\n“We feel right now that the juvenile may have been in possession for several days. He may have had the weapon on school property at some point,” Roundtree said.\nAnd as a mother is now grieving over the loss of her baby boy, the sheriff is reminding people of the importance of gun safety.\n“So many times we hear people say I emptied the magazine and they think the gun was rendered safe, but we tell people, every gun should be treated as a loaded weapon,” Roundtree said.\nInvestigators say that the 1-year-old, a 3-year-old, a 17-year-old, and the mother lived in the home.\nAlso, an investigation is underway at the Board of Education into whether the suspect brought the gun to school.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}