{"uri": "http://www.13newsnow.com/story/news/local/mycity/portsmouth/2014/09/09/14824608/", "title": "1 killed, four wounded in Portsmouth shooting", "dct": "Mon, 19 Aug 2013 00:00:00 GMT", "id": "1e3af90cfc64e63dfa209c4f47b73921", "content": "PORTSMOUTH-One person was killed and four others were wounded in a shooting at a public housing complex in Portsmouth.\nPolice were called to London Oaks on Mount Vernon Avenue just after 11:00 p.m. Sunday.\nAron Turner, 31, of the 3900 block of Trailwood Court was pronounced dead at the scene.\nOfficers also found two men in the adjacent parking lot suffering from gunshot wounds. Both were transported to Sentara Norfolk General.\nMedical staff at Sentara Norfolk General also reported a man walked into the ER with a gunshot wound. Maryview Hospital staff reported another man entered their ER with a gunshot wound. Both men said they were shot on Mt. Vernon Avenue.\nThe four victims who survived the shooting are in serious to guarded condition, police said Monday afternoon.\nThe victims range in age from 29 to 34. Police say they were visiting an apartment when suspects entered the front door and began shooting.\nThe suspects fled on foot. Police have not yet released a description.\nPolice say the motive is unknown.\nThe shooting has caught the attention of the US Department of Housing and Urban Development, who is working with the company that owns the London Oaks Apartments to increase security. Residents at the complex receive federal housing subsidies.\nNeighbors say they feel increasingly unsafe near the complex, which spans three blocks. One resident who asked not to be identified said the complex has been overrun with gang and drug activity.\nAn off-duty police officer is now patrolling the complex around the clock after 13News Now alerted HUD to the seemingly increase in violence at the complex. Before the shooting, an officer patrolled the complex just four hours a day.\nJoanna Rose, a spokeswoman for the company that owns the complex, gave 13News Now the following statement:\nThe safety and security of our residents is our first priority and we have consistently had on-property off-duty police patrols in place as well as site-wide exterior lighting we proactively installed after acquiring the property. We are aware of the unfortunate isolated incident that occurred on Sunday and have taken steps to increase the patrols even further. We are continuing to work closely with the Portsmouth Police Department on the matter. - Joanna Rose"}