{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-shooting-violence-20160719-story.html", "title": "Girl, 6, seriously wounded on family porch: 'Granddad, I been shot. Look, I been shot'", "dct": "Wed, 20 Jul 2016 07:20:00 GMT", "id": "32ff1cd10118bcfd1b55df9f44ec21aa", "content": "(E. Jason Wambsgans / Chicago Tribune)\nThe first volley of gunfire, a few dozen shots or so from up the block, sent 6-year-old Tacarra Morgan scrambling off the front porch step toward the safety of her grandparents' home.\nHer grandmother was in a chair nearby. Her mother was sitting on stacked milk crates with a piece of carpet on top.\nThe shots came from someone in a convoy of three cars that had turned onto Paulina from 59th Street around 1 p.m. Tuesday. The whole neighborhood scattered. Guys playing basketball at 59th and Marshfield ducked and ran. Another group, the apparent targets, fled south on Paulina.\nA second volley rang out, again a few dozen shots.\nTacarra had turned and made it close to the door when a round hit the left side of her abdomen. Other rounds punctured glass windows and aluminum siding in her grandparents' house.\nNo one else was hit. The convoy fled under a police camera at 60th and Paulina that investigators hope will yield some evidence.\nArthur Morris, 76, heard the commotion and found his granddaughter upstairs, the left side of her abdomen torn open by a bullet.\n\"Granddad, I been shot,'' she said. \"Look, I been shot.\"\nTacarra did not cry. She tugged at her grandfather and drifted in and out of consciousness, Morris said.\n\"She was afraid,\" he said. \"And she wanted to be with me.\"\nMorris' 48-year-old son Anthony heard the shots while playing basketball on Marshfield. He called home after it settled and found out his niece had been shot. He ran home and found Tacarra on the couch.\n\"Tony, I been shot,\" she said.\n\"I was like, look, we got to go,\" Anthony Morris said.\nHe picked her up and carried her outside to a waiting car. Police had started swarming the neighborhood and stopped him.\n\"Nah, you might do more harm than good,\" he was told. \"(But) I didn't want my niece suffering and the quicker she can get to a hospital, the quicker she can be all right.\"\nHe carried her out of the car and gently laid her in the street and waited until paramedics arrived. She didn't cry until her mother cried, the younger Morris said.\nAs paramedics tended to Tacarra, the girl tried to keep paramedics from putting an oxygen mask on her face. She asked for her grandfather.\n\"All this was hanging out\" -- Anthony Morris pointed to the side above his left hip -- \"but wasn't no blood. I felt real sad. She don't need to go through nothing like that.\"\nThe elder Morris tried to comfort his wife, who went to the hospital with Tacarra. She had collapsed with grief near the scene before gathering herself up and heading to Comer Children's Hospital.\nTacarra was listed in critical but stable condition Tuesday evening after undergoing surgery, police said. “Her prognosis is that she should be OK,\" said top police spokesman Anthony Guglielmi on Tuesday night.\nPolice said the shooting was possibly sparked by a feud between factions of the Gangster Disciples. It was not clear if anyone returned fire after the first round of shots, police said.\n\"We don't know that for sure,\" said First Deputy Superintendent John Escalante. \"We're not ruling anything out, including the possibility that maybe there was some return fire. But we do know the second round of gunshots that traveled southbound appear to be the rounds that struck this 6-year-old girl.\n\"There's a lot of rounds recovered, as you're aware, there's dozens of rounds we'll be processing.\"\nInvestigators found shell casings more than a block away. Yellow evidence markers were scattered down the street where casings were found. Police were checking video from the camera at 60th and Paulina.\n\"If this doesn't make anyone sitting at home angry, I don't know what will,\" Escalante said. \"It's a beautiful summer day, a 6-year-old should be able to sit on their porch and play on their block without having to worry about that stuff.\"\nThe family home is often swarming with a dozen or so of Morris' three-dozen grandkids. He has 15 to 20 bikes in the basement, and his family has lived in Englewood since 1959, when he moved here from Mississippi.\nAt the hospital, Tacarra's mother and father waited in the surgical wing while more than 20 relatives gathered in the waiting room, according to community activist Andrew Holmes, speaking for the family.\n\"We want the community to come forth,\" he said. \"If we're demanding police officers to be held accountable for discharging weapons out of the protocols of law enforcement, we want these people who discharge weapons here to be held accountable too.\"\nAt least 21 children under age 13 have been shot in Chicago so far this year, according to data kept by the Tribune. The girl is the fifth under 13 shot this month.\nSuperintendent Eddie Johnson, who is in Washington, D.C., issued a statement saying he has \"directed all resources within the Bureau of Detectives and Bureau of Patrol be dedicated to gathering community intelligence in the case.\"\n\"The level of gun violence on the South and West sides of our city is absolutely unacceptable, and it’s appalling when our children are caught in the crossfire of individuals who have no regard for human life,\" Johnson said."}