{"uri": "http://www.nola.com/crime/index.ssf/2016/01/toddler_shot_grandmother_new_o.html#incart_m-rpt-2", "title": "'Unthinkable': Neighbors process toddler's death after grandmother's gun discharges", "dct": "Wed, 20 Jan 2016 17:52:00 GMT", "id": "98fe6d7a80cbb672a0f6f70d56a4b717", "content": "Betty McCormick's eyes welled when she looked across her eastern New Orleans street Wednesday morning (Jan. 20) at the blue house where, hours earlier, a 3-year-old boy was killed when a gun discharged while he slept in a bed with his grandmother.\n\"I can't imagine what they're going through at that house,\" McCormick said.\nShe was one of several neighbors who were awakened shortly after 2 a.m. by the sound of fire trucks on their block in the Maple Ridge subdivision, off Michoud Boulevard.\nThey would later learn -- some from sidewalk chatter in the dark, others from the morning news -- that the toddler was fatally struck in the chest when the semi-automatic gun under his grandmother's pillow discharged, according to the New Orleans Police Department.\nThe grandmother, Deonca Kennedy, 42, was booked later on charges of negligent homicide, second-degree cruelty to a juvenile and child desertion, NOPD said.\nInvestigators think Deonca Kennedy was sleeping in bed with 3-year-old when gun beneath pillow discharged\nKennedy and her grandson were alone in the home at the time of the shooting, police said. An NOPD statement says the investigation is ongoing. Kennedy did not give a statement, and was not cooperating with detectives, the statement said.\nMcCormick said she only knew Kennedy as a nice neighbor who was at times seen outside while her grandson played in the yard. McCormick, 62 and a grandmother herself, said her heart goes out to the family.\n\"A 3-year-old, innocent child,\" McCormick said. \"For that to happen ... it's just unthinkable.\"\nReginald Gentry, who lives across the street from Kennedy, said violence like what happened Wednesday morning, however unintentional, is \"very unusual\" for their neighborhood. He recalled police came when a body was found dumped a few years ago in a secluded corner of their street, Red Maple Drive. But mostly, \"it's a very quiet neighborhood.\"\nNeighbors tend to wave at each other or say hello, said Bryson Byrd, and Kennedy was no exception.\nByrd said he didn't know Kennedy well but got the impression the family were \"good people.\" He worked with Kennedy a few years ago at Home Depot, he said.\n\"She never caused no trouble,\" said Byrd, 22. \"It's a sad story,\" he said of Kennedy's grandson's death.\nNeighbors spoke with NOLA.com | The Times-Picayune prior to news of Kennedy's arrest.\n'Things happen so fast'\nNo one answered the door at Kennedy's house Wednesday. A family friend who drove up to the house but did not want to be interviewed said the family wasn't home, after her own failed attempt to have the door answered.\nMcCormick said she believed Kennedy lived in the house with a daughter who is in her 20s -- the deceased toddler's mother; a second daughter who is in high school; and the toddler who was killed.\nKennedy's crisp blue, ranch style house is in the 5600 block in the back end of the subdivision. Candycane lawn ornaments placed in a neat pile on a wicker bench near the front door suggested the family was in the process of putting away Christmas decorations. Oversized colored lights clumped on the lawn also appeared to be in the process of being picked up until next season.\nByrd, who lives two houses down from Kennedy, said he heard yelling around 2 a.m. and what sounded like people moving around loudly before the noise from the fire truck's siren filled the block.\nMcCormick shook her head slightly from side to side when she spoke about learning what happened a stone's throw from her front door.\n\"I was horrified,\" she said. \"Things happen. Things happen so fast.\""}