{"uri": "http://www.nola.com/crime/index.ssf/2016/01/nopd_warrant_says_grandmother.html#incart_river_index", "title": "NOPD warrant says gun found on bed where toddler was fatally shot Wednesday", "dct": "Tue, 02 Feb 2016 12:36:09 GMT", "id": "a3494d028e4d2fc62b734adf955b9300", "content": "An arrest warrant affidavit for eastern New Orleans security guard Deonca Kennedy says she alone was home caring for her 3-year-old grandson when the boy sustained a fatal gunshot wound early Wednesday morning (Jan. 21).\nThe warrant application, sworn by New Orleans police child abuse detective Tyra Pruitt, also says a search of Kennedy's home in the 5600 block of Red Maple Drive found a handgun \"in the bed where the victim succumbed to his fatal injuries.\"\nThe warrant did not describe the gun or indicated whether it was a revolver or a semi-automatic.\nEarlier in the same report, Pruitt wrote that the still-unidentified toddler \"was transported to University Medical Center, where he succumbed to his injuries.\" It is unclear whether the boy was dead on arrival at the hospital or pronounced there minutes later.\nThe warrant request said, \"The victim was in the interior of the residence in the care of his grandmother, Ms. Deonca Kennedy. ... Near the bed, a security uniform was found with a name tag reading 'D. Kennedy' pinned to the front of the shirt.\" It added that \"Ms. Kennedy ... refused to make a statement in reference to the injuries of her grandson.\nThe arrest warrant was requested \"based on the fact that the victim was in the care of (Kennedy) at the time of his injuries/death, coupled with the fact that a handgun was found in the bed where the victim was found injured,\" the document said.\nKennedy was booked with negligent homicide of a victim under age 10, second-degree cruelty to a juvenile and child desertion.\n\"I can't imagine what they're going through at that house,\" said Betty McCormick.\nPolice said officers responded to the incident after a 911 call received at 2:12 a.m. The court document shows Pruitt had Kennedy's arrest warrant approved and signed by a magistrate commissioner at 7:20 a.m. Her arrest was executed at that same time, according to the documents, but was not announced publicly until 10:01 a.m.\nKennedy, who does not yet have an attorney or public defender, is being held without bond in \"medical custody\" of the Orleans Parish Sheriff's Office while awaiting her first scheduled court appearance Friday afternoon.\nDeonca Kennedy was arrested Wednesday (Jan. 20) after her 3-year-old grandson was fatally shot in her bedroom.\nCourt records show the Orleans Public Defenders office was appointed to represent Kennedy. But the OPD filed a motion of notice to the court declining to represent the defendant, citing caseload concerns. A judge can still order OPD representation for Kennedy if she cannot afford a private attorney.\nKennedy was ordered held without bond under provisions of Article 330.0, also known as \"Gwen's Law.\" It requires a contradictory bail hearing to be held within five days for a person in custody for certain domestic violence, stalking or allegations of felonies involving a deadly weapon committed upon dating partners, family or household members."}