{"uri": "http://wavy.com/2017/01/10/airman-who-served-at-langley-eustis-injured-in-florida-airport-shooting/", "title": "Airman who served at Langley-Eustis injured in Florida airport shooting", "dct": "Tue, 10 Jan 2017 22:35:00 GMT", "id": "779db975a99abf6786ed06692b0ab810", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nFORT LAUDERDALE, Fla. (WAVY) — An active duty member of the U.S. Air Force, who was once assigned to Joint Base Langley-Eustis, was injured in a shooting at a Fort Lauderdale, Florida airport\nAir Force officials say Senior Master Sgt. Christopher B. Prather was hurt in the shooting at Fort Lauderdale-Hollywood International Airport on Friday, Jan. 6.\nUS veteran arrested in airport shooting; 5 dead\nSergeant Prather is a Vehicle Maintenance Major Command Functional Manager at Joint Base San Antonio, Texas, where he’s been since August 2016. In that capacity, officials say he conducts manning, force development and career field management in his specialty for Airmen in the commands he supports.\nSergeant Prather was previously assigned to Air Combat Command at Joint Base Langley-Eustis from 2011 to 2016.\nOfficials say 26-year-old Esteban Santiago, an Army veteran, loaded his weapon in a bathroom stall before opening fire on fellow passengers, killing five and wounding six others, including Prather.\n10 On Your Side has also learned that one of the five people killed in the shooting was a Virginia Beach man, Terry Andres.\nThis is a developing story. Stay with WAVY.com for updates.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}