{"uri": "http://www.palmbeachpost.com/news/state--regional-govt--politics/breaking-dead-several-injured-fort-lauderdale-airport-shooting/7LlZTqT1D3n3ktqOeDEtZK/", "title": "UPDATE: Gunman faces multiple charges, is eligible for death penalty", "dct": "Sat, 07 Jan 2017 00:00:00 GMT", "id": "cdd0e8f0a1ff1c2b4e16b20ba7baed68", "content": "To view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nFORT LAUDERDALE\n10:00 p.m. UPDATE: The accused gunman’s brother believes the FBI “failed” Esteban Santiago by not doing anything despite “evaluating him for a while.”\nBryan Santiago told AP from his home in Puerto Rico that his brother was behaving differently after his return from a tour of duty in Iraq, and “sometimes couldn’t control his anger.”\n6:52 p.m. UPDATE: Esteban Santiago faces several charges, one of which, is carrying out a violent act against persons at an international airport. If convicted, he is eligible for the death penalty. According to an affidavit, Santiago “fired approximately ten to fifteen rounds…aiming at victims’ heads.”\nSantiago later told authorities he retrieved his 9mm Walther and two magazines from his checked baggage, loaded the gun in the restroom and began firing once he exited. The affidavit states he reloaded with the second magazine and continued firing.\nWhen approached by a Broward Sheriff’s Deputy he dropped the gun, which had no remaining ammunition, and was arrested without resistance.\n6:03 p.m. UPDATE: Broward Health Medical Center said in a statement thatseven patients are still hospitalized at their facility, and one has been released. The hospital says five are in good condition and two are in critical condition.\n4:45 p.m. UPDATE: Federal law-enforcement officials in Alaska said they took a gun from the Fort Lauderdale airport gunman, Esteban Santiago, when he voluntarily underwent a mental-health evaluation in November. Officials confirmed Santiago spoke of “mind control” and hearing voices when he showed up at an FBI office in Alaska in November.\nLocal police returned the gun to Santiago once he was released in December after the mental health evaluation was complete, saying there was no law to keep them from doing so. “We are a society of laws,” one official said. Police held Santiago’s gun for 31 days and Santiago carried out the shootings 29 days later, the Miami Herald reports.\nMarlin L. Ritzman, FBI special agent in charge in Anchorage, said they did not have confirmation whether the gun Santiago used to kill five people on Friday at Fort Lauderdale-Hollywood International Airport was the same weapon that was returned to him in December.\nThey said Santiago had been involved in prior acts of “criminal mischief” in Alaska before Friday’s attacks.\nAuthorities said they had no evidence that anyone in Alaska conspired with Santiago to plan the fatal shootings.\nSantiago had been “fighting with a lot of people,” his brother, Bryan, told NBC News in a phone interview from Puerto Rico. “Sometimes he’s good. Sometimes something weird,” Bryan Santiago said. “He had a woman there in Alaska, a child.”\n2:25 p.m. UPDATE: Gov. Rick Scott has directed all U.S. and Florida flags throughout the state to be lowered to half-staff in honor of the victims of the shooting at Fort Lauderdale-Hollywood International Airport.\nThe order is in effect from sunrise to sunset today and tomorrow.\n2:15 p.m. UPDATE: Tri-Rail has resumed some shuttle service to Fort Lauderdale-Hollywood International Airport.\nIn a bulletin sent to passengers, Tri-Rail said its shuttles will only pick up passengers from the Terminal 1 stop and the Terminal 3 and 4 stop. The Terminal 2 and 3 stop will be closed through the weekend, Tri-Rail said.\n2:05 p.m. UPDATE: Gov. Rick Scott addressed reporters shortly before 1 p.m. at Broward Health Medical Center in Fort Lauderdale, expressing empathy for tired travelers who only wanted to complete their connections, suddenly being disconnected from normalcy and life itself.\n2 p.m. UPDATE: Fort Lauderdale-Hollywood International Airport should be fully operational Sunday following Friday’s deadly shooting.\n1:30 p.m. UPDATE: One of six people injured in a deadly shooting yesterday at Fort Lauderdale-Hollywood International Airport will be released from a Broward County hospital today, a hospital official said.\nMark Sprada, Broward Health Medical Center CEO, spoke during a news conference with Gov. Rick Scott.\nScott said he returned to the hospital on Saturday to thank those who were treating the victims of the shooting, along with those who sustained injuries in the ensuing chaos.\n1:20 p.m. UPDATE: American Airlines has issued a travel alert for those scheduled to fly into or out of Fort Lauderdale-Hollywood International Airport on Saturday.\nThose travelers can rebook their flights without having to pay a change fee, the airline said. They also have the option of flying out of or into Miami International Airport or Palm Beach International Airport.\nTo reschedule travel with American Airlines, go to www.aa.com or call 800-433-7300. For those looking for missing checked baggage from American Airlines, call 800-433-7300 or 800-535-5225.\n12:30 p.m. UPDATE: Help is coming for travelers who left their IDs in Fort Lauderdale-Hollywood International Airport yesterday during the evacuation after a deadly shooting.\nGov. Rick Scott said he has directed the Florida Department of Highway Safety and Motor Vehicles to send its Florida Licensing on Wheels units to the airport to help those who need new IDs to travel home.\n12:17 p.m. UPDATE: Terminal 2 at Fort Lauderdale-Hollywood International Airport — where a gunman shot and killed five people and injured six others on Friday — is expected to “completely” open by 6 p.m. Saturday, the airport said on Twitter.\nThe airport reopened at 5 a.m. Saturday following the attack, but Terminal 2 remained completely closed for several hours before the ticket counters and check-in areas were reopened. As of early Saturday afternoon, flights that had been scheduled for Terminal 2 are departing from Terminal 3, and the baggage area remains closed.\n11:50 a.m. UPDATE: Investigators are looking into why 26-year-old Esteban Santiago chose Fort Lauderdale-Hollywood International Airport for his attack, FBI Special Agent in Charge George Piro said Saturday morning. But at this point, it doesn’t appear there is a specific reason. Still, Piro added, Santiago did come to Fort Lauderdale “specifically to carry out this horrific attack.”\nAuthorities have not ruled out terrorism as a possible motive, Piro said. Investigators also are going through airport security footage for more information on Santiago’s actions.\n11:30 a.m. UPDATE: Fort Lauderdale-Hollywood International Airport has opened a phone line for people who left belongings behind during the evacuation yesterday.\nPeople can call 866-435-9355. Airport officials caution that the line will be busy — workers collected 20,000 personal items left behind following yesterday’s deadly shooting — so people should be patient.\nTravelers who left personal items on airplanes should contact the airline, not the airport.\n11:15 a.m. UPDATE: The gunman who shot and killed five people and injured six others at Fort Lauderdale-Hollywood International Airport on Friday was confronted by Broward County sheriff’s deputies within 70 to 80 seconds of his attack, Broward County Sheriff Scott Israel said in a news conference.\nThe gunman, identified as 26-year-old Esteban Santiago, was not on a no-fly list, said FBI Special Agent in Charge George Piro. It also appears Santiago acted alone, Piro said, and there has been no indication that Piro had an altercation on one of the flights he took Friday or in the baggage area, as had previously been reported.\nSantiago is being held at the Broward County Jail. Piro said Santiago was interviewed “for many hours” Friday, and charges will be announced later Saturday.\nInvestigators are looking into why Santiago chose the Fort Lauderdale airport for his attack, but right now there is “no specific reason,” Piro said. Investigators also are going through airport security footage for more information on Santiago’s actions.\n10:50 a.m. UPDATE: There were six people with gunshot wounds in addition to the five people killed in Friday’s shooting at Fort Lauderdale-Hollywood International Airport, Broward County Sheriff Scott Israel said in a news conference Saturday. Israel made the clarification following earlier reports there had been eight people injured in the shooting.\nThree of those injured are still in intensive care, he said.\nGov. Rick Scott said he has asked for help from cruise lines and airlines as some passengers lost their IDs in the evacuation yesterday.\n10:45 a.m. UPDATE: David Bean and his wife, Ann, of Massachusetts, were stuck overnight at Port Everglades. They arrived at Terminal 3 at Fort Lauderdale-Hollywood International Airport — one terminal away from the shooting — just before the incident to fly out to Boston, but never made it onto the plane.\n“We were watching it unfold on TV and all of a sudden there was panic, and security and police rushed the terminal shouting ‘Hit the floor! Hit the floor!,’ ” David Bean said.\nThey were stuck for hours on the terminal floor while police investigated. By midnight, they were shuttled to Port Everglades to sleep.\n“If you can call it sleep,” he said. “It was chaos.”\nThe couple flew into Fort Lauderdale to see the New England Patriots play the Miami Dolphins last week and stayed for a short vacation.\nThey would book a hotel or another flight, Bean said, but the Broward Sheriff’s Office collected their checked luggage. They’ve waited at the airport about 36 hours now, Bean said.\nThomas Jordan, of Nevada, also can’t access — or locate — his luggage and was also stuck in the airport terminal on Saturday. Jordan, an Air Force veteran who did three tours in Iraq, was planning to fly home after a cruise, but was stuck in a terminal when the chaos broke out.\n“This was poorly handled,” Jordan said, describing a scene of shouting, panicked security forcing people to hide for hours with no explanation as to what was going on.\n“We were trampled leaving the terminal to the jet way” where he and several others were held for safekeeping for nearly 10 hours, Jordan said.\nWhen Jordan learned a military veteran reportedly carried out the shooting, it struck him more.\n“I told my wife, we need to talk about this shooting and talk a lot,” Jordan said. “Because if you hold it in, that’s how you get PTSD.”\n10:20 a.m. UPDATE: The Terminal 2 check-in and ticket counters are open at Fort Lauderdale-Hollywood International Airport following yesterday’s deadly shooting, according to Broward County officials.\nThe Terminal 2 baggage claim, where the shooting took place, remains closed, and all planes are departing from Terminal 3, the county said.\n10:15 a.m. UPDATE: The Transportation Security Administration advises passengers who left their ID in the airport to allow for extra time — even more than the regularly advised two hours — for the TSA to verify their identity.\n10 a.m. UPDATE: About 5,000 passengers were transported by bus last night to Port Everglades from Fort Lauderdale-Hollywood International Airport, according to Broward County Mayor Barbara Sharief.\n9:35 a.m. UPDATE: Flights resumed this morning at Fort Lauderdale-Hollywood International Airport following yesterday’s shooting, where five people were killed and eight injured by a gunman.\nAirport officials caution that although flights are back underway, there are many delays and cancellations. Travelers should check with their airlines for up-to-date information.\n5:40 a.m. UPDATE: An American Airlines flight to Port-Au-Prince, Haiti, originally scheduled for 6 a.m., has been pushed back to 7 a.m., according to airline officials.\nFlight 1158 is scheduled to depart from gate E3 in Terminal 3.\n4:40 a.m. UPDATE: All roadways to Fort Lauderdale-Hollywood International Airport have reopened, according to airport officials.\n4:20 a.m. UPDATE: As FBI officials were preparing to do a final walk through of the Terminal 2 baggage claim area at 4 a.m. Saturday, traffic was picking up outside the Fort Lauderdale-Hollywood International Airport following a shooting Friday.\nTerminals 1, 3 and 4 were scheduled to operate normally with a few possible delays as Terminal 2 is expected to remain closed as the investigation into the shooting continues.\nIt was unclear early Saturday if travelers at Port Everglades scheduled to depart Fort Lauderdale would be provided transportation to the airport.\n3 a.m. UPDATE: Esteban Santiago has been booked into the Broward County Jail. His booking photo was released on the jail’s website. He is being held for murder, according to the website.\nSantiago’s booking information says he is 5-foot-7 and weighs 135 pounds.\nFRIDAY NIGHT UPDATE: Esteban Santiago, the man investigators say killed five people at the Fort Lauderdale-Hollywood International Airport on Friday, is in federal custody and is expected to face a judge Monday morning.\nSantiago, 26, arrived at the airport Friday afternoon after flying on Delta Airlines from Alaska to Minnesota, and then to Fort Lauderdale, investigators said. He declared his firearm to the airline, and had a military ID.\nOnce in the baggage area, he retrieved his bag, and loaded his semi-automatic handgun in the bathroom before he shot at least 13 people, killing five and sending eight to the hospital. Between 30 and 40 more were injured after the shooting, officials said.\nBroward County Sheriff Scott Israel said Santiago was caught by a Broward Sheriff’s deputy and taken into custody without incident.\nThe FBI and Broward Sheriff’s Office had a “long” interview with Santiago. But investigators say they do not know why he came to South Florida.\nInvestigators confirmed reports of concerns about Santiago’s mental health, but were still trying to determine his motives. They did not rule out terrorism. Investigators said Santiago used a semi-automatic handgun in the shooting.\nAccording to CNN, Santiago went to the FBI in Anchorage a few months ago, claiming that he was hearing voices telling him to join the terrorist organization ISIS. While Santiago said he didn’t intend to harm anyone, his erratic behavior concerned FBI agents and they contacted local police. He also was taken for a mental health evaluation, an FBI official said at a press conference late Friday evening.\nMeanwhile, officials are working to open the airport by 5 a.m. Saturday.\nTraffic at the airport has grown relentlessly in the past decade. In the first half of 2016, 7.4 million passengers got on a plane at Fort Lauderdale. That’s up two-thirds from the traffic in early 2003.\nInternational flights drove almost half of the increase in the airport’s traffic. International flights increased about five fold: In last March alone, about 272,000 people left Fort Lauderdale for an international destination.\nThe airport also hosts flights coming in for cruises."}