{"uri": "http://www.wsbtv.com/news/local/atlanta/at-least-1-fort-lauderdale-shooting-victim-is-from-atlanta/481941767", "title": "Marietta woman killed in airport shooting", "dct": "Sat, 07 Jan 2017 20:09:00 GMT", "id": "e1f52643c860fdca61a4ecbfecd1c4ca", "content": "ATLANTA - A Cobb County woman was among five people killed in a shooting at the Fort Lauderdale airport, according to the Atlanta Journal-Constitution.\nOlga Woltering and her husband Ralph were in the baggage claim area of the Fort Lauderdale-Hollywood International Airport when the shooter, identified as 26-year-old Esteban Santiago, started firing shots around 1 p.m. Friday.\nRELATED STORIES:\nThe shooting happened in Terminal 2 in the baggage claim area that is used by Atlanta-based Delta Air Lines.\nThe shooting happened near the baggage claim carousal that was carrying bags from the Atlanta flight that landed at 12:30 p.m., according to witnesses.\nThe Wolterings, who live in Marietta, were headed to Fort Lauderdale for a cruise, according to friends on social media. They say Ralph escaped serious injury.\nA mass was held for Olga Woltering Saturday evening at the Catholic Church of the Transfiguration in Marietta.\nTerrorism finally hits too close to home! Please pray for the soul of Olga Woltering ... one of the innocent victims of the senseless shooting in the Fort Lauderdale airport. Olga was a prominent member of my church in Marietta - Transfiguration Catholic Church. Olga and her husband Ralph were preparing to board a ship for a cruise when the gunman starting killing people randomly. Fortunately, Ralph escaped serious injury, but PLEASE PRAY for the whole Woltering family ... the Transfiguration family mourns with them tonight!\nOlga Woltering was a wife, mother, grandmother, great-grandmother and friend, according to people on social media. She was a beloved member of her church in Marietta.\nAt least one of the injured victims is also from metro Atlanta. He posted on Facebook about the attack. He said a lone gunman began firing and security was not nearby. He said shrapnel hit his hand.\nWINTER STORM HEADLINES:\nPolice say the shooter had just flown in on a Canadian flight. A county officials says he pulled a gun out of checked luggage, loaded it in the bathroom and started shooting.\nThe suspect is in custody.\nInformation from the Associated Press was used in this report.\n© 2017 Cox Media Group."}