{"uri": "http://www.miamiherald.com/news/local/community/broward/article125142924.html", "title": "These are the victims of the Fort Lauderdale airport shooting", "dct": "Sat, 07 Jan 2017 11:06:00 GMT", "id": "e3891a1f395e8b18b03dd1a30c7488dd", "content": "A lone gunman opened fire at Fort Lauderdale-Hollywood International Airport on Friday afternoon, wounding six people seriously and killing five.\nOn Wednesday, Broward officials released the name of the fifth victim, Mary Louise Amzibel, 69.\nThey also confirmed the names of the other victims: Shirley Timmons, Michael Oehme, Olga Woltering and Terry Andres.\nMary Louise Amzibel, 69\nAmzibel is originally from Ohio, police said. She and her husband, Ed, were natives of Ashtabula but moved away years ago, according to the Star Beacon. Public records indicate the couple lived in Delaware.\nHer husband was wounded during the shooting and remains in a coma, the newspaper said. They were in Fort Lauderdale for a Panama Canal cruise.\nShirley Timmons, 70\nShirley Timmons/Facebook\nTimmons was from Senecaville, Ohio, and died at the airport, according to Jim Reineccius, a relative. Timmons’ husband, Steve Timmons, was shot in the face and taken to the hospital, where he is in a coma.\nShirley and Steve met in 8th grade and were high school sweethearts, according to a family statement.\n“She was the most loving, passionate mother who had a love for life and truly sparkled,” they wrote. “She touched many and was loved by all. She will live in our hearts forever and will be truly missed.”\nThere was confusion after the initial shooting over whether Shirley was dead or had just gotten separated from her family. Loved ones took to social media to beg for information.\nA family spokesman told an Ohio radio station that “Steve and Shirley raised an amazing family, three amazing girls. Their family was everything to them.”\nHe said the couple were on their way to a family cruise leaving from Fort Lauderdale.\nSteve and Shirley, who owned the now-shuttered The Mayfair stores in Cambridge, Ohio, were married in 1966, according to an anniversary announcement in The Daily Jeffersonian. Their 51st wedding anniversary would have been on Jan. 28.\nSteve is retired from Northwest Aluminum in The Dalles, Oregon.\nTerry Andres, 62\nTerry Andres/Facebook\nAndres was from Virginia Beach, Virginia, and died at the airport, according to a local NBC affiliate in Virginia, WAVY-TV.\nHis daughter Ryan Kim, 37, told The Palm Beach Post that her father and mother had just arrived in Fort Lauderdale on their way to a cruise vacation when her father left the Delta Sky Club in Terminal 2 to get a luggage cart. “Then everything happened,” Kim said. “And after all the ruckus ended, they didn’t realize that my dad wasn’t there right away.”\nAndres’ wife, Ann, was unharmed. The couple had been married for nearly 40 years.\nKim said her father had worked at the Norfolk Naval Shipyard for about 20 years, most recently as a radiological control technician. He was also a volunteer with the Oceana Volunteer Fire Department in Virginia Beach.\n“I know that everyone always says that people are the greatest in the world, but he was the greatest person you could know,” Kim said. “He never had a horrible word to say about anyone or anything.”\nDarrin Stevens, a friend of Andres, said he was “a hell of a great guy.”\n“He was one of the most helpful men you would have ever wanted to meet,” Stevens said in a Facebook message. “Any time he could help someone out he did anything he could.”\nA former fire department volunteer, Tommy Harrell, told the Miami Herald that he remembered Terry “as being a great person and doing anything to help out.”\nOlga Woltering, 84\nOlga Woltering/Facebook\nWoltering and her husband, Ralph, are from Marietta, Georgia. The couple flew into Fort Lauderdale for a cruise with their children, according to the Atlanta Journal-Constitution. Ralph wasn’t injured in the shooting, but Olga was killed. The cruise was to celebrate Ralph’s 90th birthday, said fellow churchgoer Dan Blankowski.\nThe couple were involved members of Transfiguration Catholic Church since they joined in 1978, he said, and regular front seat attendees to 5 p.m. Mass.\n“To call them pillars of the church would be a gross understatement,” Blankowski said.\nOlga, a great-grandmother, was never seen without a wide grin, he said. Her habit of calling everyone “love” or “lovey” was made all the more charming by her British accent.\n“Olga was one of the most joyful, loving, caring and committed people I have ever met,” the church’s pastor, Fr. Fernando Molina-Restrepo, said in a statement. “This is a horrible tragedy for everyone here at Transfiguration, especially because Olga was so loved.”\nOther parishioners mourned Olga’s death on social media.\n“Tragedy hit too close to home today. Transfiguration Church lost a very loving and caring woman in the Ft Lauderdale airport attack,” Jerry de Varennes wrote on Facebook, along with a photo of the couple on a couch, smiling and bouncing babies on their laps.\nThe family put out a statement Saturday asking for privacy in their time of grief and calling Olga “the cornerstone of our family.”\n“While she’s absent in our lives now, she remains in our hearts, thoughts, and memories for ever,” they wrote. “Her bright smile and loving manner will be missed by all who had the fortune to know her. She rarely seemed to meet a stranger, rather she had a smile or a hug for all. She was a blessing in the lives of family and friends.”\nThe couple lived in a retirement community and were socially active, Alvin Connolly, a member of their church, told The Associated Press.\n“She and her husband were kind of the life of the party,” he said. “They’d go to a dance, and they’d be the last ones on the floor.”\n“You look at them and say, ‘Man, I hope I can do everything they do when I’m that age,’ ” Connolly said.\nMichael Oehme, 57\nMichael Oehme/Facebook\nMichael Oehme and his wife, Kari, flew to Fort Lauderdale from Omaha, Nebraska, for their annual cruise. When the shooting started, he was killed and his wife was injured, according to Omaha TV station WOWT.\nThe witness who told TV stations about the couple, Mark Lea, told Omaha ABC affiliate KETV that he ran to help Kari Oehme moments after the shooting.\n“I saw that she had a through-and-through on the right shoulder … And she said ‘where’s my husband, where’s my husband?’ And I asked her to describe him, and she described him and I looked right over there and saw a white-haired guy in a blue shirt that he had on … and he was not moving, not breathing.”\nMichael Oehme owned a surveying business, according to the Omaha World-Herald. They lived in Council Bluffs, Iowa, which is across the Missouri River from Omaha.\nHis sister told The Associated Press that the couple was headed to the Caribbean.\n“They were supposed to leave today,” Elizabeth Oehme-Miller, 52, said on Saturday. “They were happy to be going on another trip.”\nA family member is flying down to help Kari, who was a clerical worker at a Council Bluffs office, return home.\nOehme-Miller heard about the news through a text message from her daughter.\n“I still can’t believe it’s true,” she said. “It hasn’t hit yet. I’m kind of in shock right now.”\nThe Associated Press contributed to this report."}