{"uri": "http://www.recordonline.com/article/20160527/NEWS/160529493", "title": "Police: Retired Town of Newburgh cop killed his son, his daughter, himself", "dct": "NODATE", "id": "1081c3bd8c8bbc76aa4799c432744049", "content": "TOWN OF WALLKILL - Retired Town of Newburgh police Officer John Casullo used a .45 caliber pistol to kill his children as they slept, and then fatally shot himself, state police said Friday.\nJames Casullo, 8, and Kathleen Casullo, 12, were each found dead from a single gunshot wound to the head on Thursday inside their home at the Valley View Mobile Home Park.\nNeighbors say their mother, Anne Marie Labrada Casullo, found them when she came home - but first she had to break into the locked house. A neighbor told a Times Herald-Record reporter that she witnessed the children's mother making the frantic 911 call, telling the dispatcher that \"he killed them.\"\n\"She told me she had been trying to call her husband all day, he didn't answer, she felt something was wrong,\" that neighbor, Jean Stevens, said Friday.\nPolice have said little else about the case.\n\"We're awaiting the conclusion of the police investigation, and we are taking a serious look at his mental health history,\" said Orange County District Attorney David Hoovler.\nThat includes awaiting the results of an autopsy and a medical examiner's report to determine the times of death.\nSpeaking in general, Hoovler said, the mental stress of military, police and sometimes firefighting jobs can take a toll on people. He added, \"the phenomenon needs to be studied, because it's costing a lot of lives.\"\nCasullo is a former Town of Newburgh police officer. Records on the SeeThroughNY website show that he retired on March 13, 2008.\nTown of Newburgh police Chief Bruce Campbell confirmed that Casullo retired on disability, although he didn't immediately know the details of the injury that led to Casullo's retirement. Calls to the Town of Newburgh for more information were not returned.\nCampbell said the department will offer any support the family needs.\n\"We don't know all the facts yet, what happened or what led to it,\" he said.\nThe department began notifying its officers of the murder-suicide on Thursday afternoon.\nLabrada Casullo is a lieutenant with the New Hampton Fire Department, and someone who draws high praise from her colleagues.\n\"She's a great firefighter. She's probably one of our most dedicated members. She's just one of the most awesome people I've ever met,\" said Rob Albino, president of the fire district. \"We're there for her.\"\nA woman who identified herself as a relative of Labrada Casullo, but declined to give her name, sat on the front steps of the family home Friday afternoon, watching the house while a locksmith worked on repairs.\nJean Stevens' husband, Jeff, said the Casullo family had lived in their gray, one-story modular for 12 years. Several neighbors said the family kept very much to themselves, and that the Casullo children were never allowed outside to play. Jeff Stevens said John Casullo would wave when he took Kathleen to school at Harmony Christian School nearby, but that was the extent of their contact with him.\n\"When they got a pizza or the UPS man came, John would always meet them on the lawn,\" Jeff Stevens said. \"He'd never let them in the house.\""}