{"uri": "http://www.ajc.com/news/news/crime-law/5th-person-dies-after-july-murder-suicide-in-forsy/npcqz/", "title": "5th person dies after July murder-suicide in Forsyth County", "dct": "Sat, 05 Dec 2015 00:00:00 GMT", "id": "43ad7614fc4a32afef545b571c9432b7", "content": "The lone survivor of a July murder-suicide that killed four family members inside a Forsyth County home died Friday. Jerry David Manning was 75.\nOn July 22, Manning was shot multiple times inside the Old Atlanta Road home he had owned for more than 30 years. Manning’s daughter, Rebecca Manning, and her husband, Matthew Kyle Fields, lived with him in the small white home, along with Rebecca’s two sons, Jacob, 9, and Jared Smith, 8.\nAfter a fight with his wife, Fields had left the home the night before, according to the Forsyth County Sheriff’s Office. But he returned shortly after 6 a.m. the next morning and shot everyone in the home, including the brothers as they slept.\nFields then called his mother in Dawson County and told her had shot four people and planned to shoot himself, the sheriff’s office previously said. Fields’ stepfather called 911 to report the shootings.\nWhen deputies arrived at the home, Fields and the two boys were dead, but Rebecca Manning was on the front porch screaming for help. The 37-year-old woman later died at the hospital.\nJerry Manning was critically injured and underwent emergency surgery the same day at North Fulton Hospital. He was never able to return home, but had improved in recent weeks, according to his nephew, Justin Lankford.\n“He was getting better,” Lankford told The Atlanta Journal-Constitution. “He was talking, laughing.”\nLankford said he and other family members were optimistic Manning would recover from his injuries.\n“At least now he’s back with his family,” Lankford said. “He’s in a better place. No more suffering, but he will be missed.”\nFuneral arrangements for Manning were pending.\nAfter the shootings, Lankford said his cousin had planned to divorce Fields, and that may have sparked his actions."}