{"uri": "http://wishtv.com/2016/09/19/impd-identifies-men-killed-in-northwest-side-shootings/", "title": "IMPD identifies men killed in northwest side shootings", "dct": "Mon, 19 Sep 2016 17:36:00 GMT", "id": "f2f9f63a4c2880a2ee6cbd5ac6b8b5b3", "content": "INDIANAPOLIS (WISH) – The two men shot who were killed in shootings on the city’s northwest side have been identified.\nAccording to the Indianapolis Police Department, Antonio Kelley and Derrius Brandon, both 23-years-old, were shot and killed in the 2000 block of West 76th Street early Saturday morning.\nPolice initially responded to a report of a shots fired in the 2000 block of West 76th Street around 12:30 a.m. Saturday, September 17. Upon arrival on scene, one man was found with a gunshot wound to his hand. However, a brief investigation in the area discovered Kelly unresponsive with a gunshot wound inside an apartment. Responding medical crews declared Kelley dead at the scene.\nThe individual shot in the hand was taken to the hospital in good condition.\nApproximately an half hour later, around 1:30 a.m., police stated they received another report of a person shot near the same area on West 76th Street. Brandon was found unresponsive, with a gunshot wound in a deserted area of a parking lot. Brandon also died as a result of his injuries.\nAdditionally, around 1 a.m.another individual was found shot in the 7200 block of North Michigan Road at the Shell gas station. They were taken to St. Vincent Indianapolis Hospital in serious condition.\nIMPD continues to investigate the shootings, but have said they believe the shootings are related.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}