{"uri": "http://www.rrspin.com/roanoke-rapids-weldon-halifax-county-nc-news/item/12926-child-injured-following-gun-mishap.html", "title": "Child injured following gun mishap", "dct": "Tue, 09 Aug 2016 13:04:00 GMT", "id": "aec1358ad3d8dba4c70ed15128a9724f", "content": "The Roanoke Rapids Police Department is investigating to determine a how a shotgun was knocked over and fired, striking a 7-year-old child late Monday night.\nThe child, who was injured in the lower body, was treated and released.\nPolice were called to the 1800 block of Roanoke Avenue around 11 p.m. after it was reported a juvenile was shot, Chief Chuck Hasty said in a statement.\nMaster Officer Roy Ball found several people outside, visibly upset. He was told the juvenile was taken to the hospital by private vehicle.\n(A gun safety brochure from the state Department of Insurance is included as a PDF attachment at the end of the story)\nMembers of B Squad secured the residence and interviewed witnesses. Investigator Chris Babb was called to continue the investigation and spoke with the juvenile and the child’s mother at the hospital.\nInitial witness statements indicate the gun went off when it was knocked over and fell to the floor. Police are trying to determine the circumstances of the matter.\nHasty said investigation is ongoing to determine whether charges will be filed as well as whether the weapon was properly stored.\nHasty in the statement also included tips from Project Child Safe and the National Shooting Sports Foundation.\nThey are as follows:\n• Always keep the firearm’s muzzle pointed in a safe direction. A “safe direction” means that the gun is pointed so that even if an accidental discharge occurred, it would not result in injury.\n• Always keep your finger off the trigger until you actually intend to shoot. When handling a gun, rest your finger outside the trigger guard or along the side of the gun. Don’t touch the trigger until you are actually ready to fire.\n• Firearms should be unloaded when not actually in use. Whenever you pick up a gun, such as when removing it from or returning it to storage, remember to point it in a safe direction and make sure it is unloaded.\n• Be sure you know how your firearm operates: read the manual on your firearm, know how to safely open and close the action of the firearm and know how to safely remove any ammunition from the firearm and its magazine.\n• Store your firearms in a locked cabinet, safe, gun vault or storage case when not in use, ensuring they are in a location inaccessible by children and cannot be handled by anyone without your permission.\n• Store your ammunition in a locked location separate from firearms.\n• Use a gun locking device that renders the firearm inoperable when not in use. A gun lock should be used as an additional safety precaution and not as a substitute for secure storage.\n• Make sure young people in your home are aware of and understand the safety guidelines concerning firearms. Have them sign the Project Child Safe Pledge for young people—a reminder that if they find an unattended firearm in their home or a neighbor’s to not touch it, and tell an adult.\n• Always unload, clean and place your firearms in their secure storage location immediately after returning from a hunting trip or a day at the range.\n• Educate everyone in your family about firearms safety. Visit the Project Child Safe website for safety information and to find out where to get a free firearm safety kit in your area.\nThe Roanoke Rapids Police Department has free gun locks from Project Child Safe at the front desk."}