{"uri": "http://www.king5.com/news/local/wsp-active-shooter-at-cascade-mall-in-burlington/324940198", "title": "Tips from public lead to arrest of Burlington mall shooting suspect", "dct": "Sun, 25 Sep 2016 00:00:00 GMT", "id": "1b3dc9d8c847f103fb69631367dd176e", "content": "BURLINGTON, Wash. -- Police say tips from the public helped them arrest a suspect in Friday's deadly shooting at Cascade Mall in Burlington.\nPolice have identified the suspect as Arcan Cetin, 20, of Oak Harbor. The arrest came not long after police sent out an alert with his identity and car description.\nIsland County sheriff’s deputies spotted the car near their office in Oak Harbor, but no one was inside. More deputies converged on the scene.\n“At the corner of 7th Avenue NE and Oak Harbor Road, I saw an individual walking northbound on the sidewalk and I instantly recognized that this is the person that I just viewed on my computer,” said Lt. Mike Hawley, Island County Sheriff’s Office, at a press conference Saturday night.\nCetin did not run, Hawley said, and he was not armed at the time of his arrest. He had a computer in a bag he was carrying at the time.\nError loading player: No playable sources found\nLt. Chris Cammock with the Mount Vernon Police Department said police received numerous tips Friday night and Saturday. One of those tips led them to interview relatives and acquaintances of Cetin. Police also reviewed surveillance footage from other nearby businesses and were able to identify a suspect car.\nPolice have impounded the car, but were awaiting search warrants before taking a closer look.\nCammock said Cetin immigrated from Turkey and is a legal, permanent resident of the United States. Initial reports from police after the shooting labeled the then-unidentified suspect as Hispanic.\n“I think the earlier accounts of the race was from witness accounts that were trying to describe what they saw in there,” said Cammock.\nLaw enforcement sources tell KING 5 Cetin was in possession of three guns Friday night. All of them were legally purchased, but Cetin stole them from his father.\nThe weapon used Friday night was a .22 Ruger, according to law enforcement.\nAs for the motive, law enforcement sources say Cetin’s ex-girlfriend use to work at the Macy’s where the shooting happened. However, she has not worked there in several months and now lives in Pierce County. But that connection appears to be why Cetin chose that location.\nCammock said it was too early to officially give a motive Saturday night. He said he would not rule out anything, including terrorism. Earlier Saturday, the FBI said there was no evidence that pointed to terrorism as a motive.\nJose Ochoa, a high school classmate of Cetin, says some of his peers viewed Cetin as an outcast. But Ochoa said he was very surprised Cetin would be accused of something like this.\n\"I'm still in shock. I can't take it in, really,\" said Ochoa.\nBurlington mayor Steve Sexton praised police for their quick work in finding Cetin.\n“I can’t imagine the situation we would be in if it was Burlington on our own trying to do this. I can almost certainly guarantee we would not have a suspect in custody this evening if it wasn’t for all the efforts of the men and women you’re looking at today,” said Sexton.\nCammock said earlier Saturday the female victims' ages ranged from teens to seniors. There was no information on the age of the male victim. No identifications have been released as of Saturday night.\nKING 5 has confirmed two of the victims are Belinda Galde and Beatrice Dotson, Galde's mother. Several other Seattle news organizations have reported the three other victims are Sarai Lara, a Mount Vernon High School student, Chuck Eagan, a longtime Boeing employee, and Shayla Martin.\nAuthorities say the shooter initially entered the shopping center without a weapon, but 10 minutes later, went to the cosmetics counter inside Macy's with a rifle and opened fire for about one minute. He then laid his rifle on the counter and walked away.\nThey found the killer in Oak Harbor #CascadeMallShooting pic.twitter.com/g2GVCzU0dc\n— Gerry Oliver (@GerryOliver) September 25, 2016\nMore than 200 officers from more than two dozen agencies responded and painstaking searched the over 400,000-square-foot mall.\nBurlington is a city of about 8,000 people about 60 miles north of Seattle.\nCopyright 2016 KING"}