{"uri": "http://www.king5.com/news/local/timeline-of-the-cascade-mall-shooting/325221022", "title": "Timeline of the Cascade Mall shooting response", "dct": "Sat, 24 Sep 2016 00:00:00 GMT", "id": "cec282250cdec03523d93955f30463ea", "content": "KING 5 obtained the dispatch calls from the time the first call went out to first responders. This timeline is based on the approximate time of the radio traffic and what was said during the messages.\n6:54 p.m. The first call to law enforcement and first responders went out just before 7 p.m. on Friday night.\n\"Cascade, all Burlington units male, ran into the women's Macys with a long rifle we're getting multiple calls,\" said dispatch.\n6:57 p.m. Less than 3 minutes later law enforcement was entering the Macy's. At that same time, authorities already had a description of the suspect.\n\"He's last described as wearing grayish clothing, had a longer rifle last seen in the women's Macy's, possibly two subjects have been shot,\" said dispatch. \"Three to four down inside.\"\n6:58 p.m. Initially, there were reports that two people potentially involved were fleeing under Interstae 5.\n6:59 p.m. Minutes later authorities found the first victims in the jewelry section of the women's Macy's.\n\"I've got one rifle left in this area empty,\" law enforcement told dispatch.\n7:01 p.m. According to scanner traffic, a couple of minutes later, authorities find a third victim.\n\"We have another one down,\" voices said over the scanner.\n7:07 p.m. At this point scanner traffic indicated some employees at the mall were still hiding in a back room.\n7:11 p.m. Authorities inside the mall found forensic evidence.\n\"I've got several .22 caliber shell casings,\" voices saud over the scanner.\n7:17 p.m. By this time authorities were asking for help near the Chuck E Cheese.\n\"We're trying to make up teams of four for injuries,\" was the message relayed to dispatch.\n7:18 p.m. Less than 25 minutes after the first call for service went out, law enforcement report to dispatch that they have the mall surrounded.\nCopyright 2016 KING"}