{"uri": "http://www.king5.com/mb/news/local/burlington-community-to-honor-cascade-mall-victims/325261071", "title": "Young cancer survivor among Cascade Mall shooting victims", "dct": "NODATE", "id": "f4c56f72072c54e2ce4d2d3d2bb7a9a8", "content": "BURLINGTON, Wash. -- The Skagit County coroner is expected to release more information about the five people killed in the Cascade Mall shooting on Tuesday, but KING 5 is learning more details about the victims.\nFamily members say Sarai Lara, a 16-year-old Mount Vernon High School sophomore and cancer survivor, died when the gunman opened fire on Friday. Her mother and father were in the mall but did not go with her to Macy's, where the shooting happened.\nFamily members confirm Sarai Lara, 16, was killed in the Cascade Mall shootings in Burlington, Wash.\n\"She was just a really beautiful lady. She was just really sweet to everybody,\" said Salvador Lara Jr., Sarai's brother. \"She was a very caring young lady. She didn't deserve this.\"\nHer mother says her daughter survived cancer, and just last week her doctor told her everything was fine. She says she's saddened that her daughter had to die this way. She had also just applied for a job at Denny's and was going to start working to support the family.\n\"She had a second chance to live her life. I guess God didn't let her live too long,\" said Salvador. \"I have no words to express my feelings right now. I'm just speechless.\"\nSarai's parents say they haven't seen their daughter's body yet and are desperate to hear from investigators.\nProbation officer and daughter among victims\nBelinda Galde and Beatrice Dotson, a mother and daughter, both died in the cosmetics section of the Macy's department store where the shooting occurred.\nAuthorities say Galde was a probation officer. The Snohomish County District Court in a statement identified Belinda Galde as an employee with the court since 1989, reports the Associated Press. The statement says the 64-year-old Galde \"was an amazingly kind and caring individual\" who helped thousands of probationers find a better way to live.\nMacy's employee a 'giving, graceful and caring' soul\nOther victims were Shayla Martin, 52, a Macy's employee, and Chuck Eagan, a Boeing employee who was just about to retire.\nMartin's daughter Tanya Young said Martin was a loving grandmother and mother, who always put others before herself.\n\"My mother was the most giving, graceful and caring souls,\" Young wrote in an email. \"Everyone that knew her was touched by her light. She was intelligent and full of class.\"\nBoeing employee 'sacrificed himself to save his wife'\nChuck Eagan and his wife began running when the shooter opened fire. His wife slipped and fell. Eagan stopped to help her, but was shot.\n\"Pam was able to roll under a table and hide at some point. I understand the gunman walked past her but didn't see her,\" said Allen Hicks of Marysville, a friend of Eagan.\n\"He sacrificed himself to save his wife. That's the kind of person he was,\" Hicks added. \"The hard part was picturing him around any act of violence, because that wasn't him.\"\nHicks said Eagan made interiors for Boeing airplanes and spent 25 years at the aerospace company.\n\"He talks slow. And a lot of times we'd be, come on Chuck. Get on with the story, get on with the story. But they were great stories,\" said Hicks. \"I'm glad he came into my life and I knew him.\"\nHicks worries about Eagan's wife, who was not hurt in the shooting.\n\"I cannot imagine what she's going through...I don't want her to go through survivors guilt.\"\nFamilies seeking solace and understanding after Friday's deadly shooting attended Sunday service at Christ the King Church in Burlington.\nHis Place Church, where survivors were reunited with their loved ones after the shooting, also held a vigil for the victims Saturday. Attendees prayed for the victims and connected with other community members seeking support.\nCommunity members in Skagit County gathered Saturday at Maiben Park to grieve and support one another. Organizers called it \"Skagit Strong.\"\n“When people come together and share their hearts it relieves that stress,” said Patty, a \"Skagit Strong\" organizer.\nThere will be a Light Up the Boulevard candlelight vigil Monday, Sept. 26 at 7 p.m. to remember the victims. It will be in the Cascade Mall parking lot between Applebee's and Johnny Carino's.\nKING 5's Liza Javier, Jenna Hanchard and the Associated Press contributed to this report.\nCopyright 2016 KING"}