{"uri": "http://wivb.com/2016/01/14/no-charges-in-gun-accident-that-injured-a-four-year-old-girl/", "title": "No charges in gun accident that injured a four-year-old girl", "dct": "Thu, 14 Jan 2016 16:21:00 GMT", "id": "0797022b23872b941df0fee11022e7ed", "content": "ORCHARD PARK, N.Y. (WIVB) — No one will be criminally charged in the accidental discharge of a gun in an Orchard Park home last Sunday that injured a four year-old girl.\nThe girl’s uncle who has a gun permit was handling the gun at the time.\nThe gun discharged and the bullet hit a kitchen counter and shattered. A fragment made a 90 degree turn and hit the girl who was nowhere near the gun, officials said.\nThe girl has been released from the hospital and is recovering from injuries to her stomach.\nActing Erie County District Attorney Michael J. Flaherty Thursday said his office agreed with the Orchard Park Police that the incident was an accident and no one would be criminally charged. His deputies considered reckless endangerment and negligence charges.\nFlaherty said police interviewed everyone who was in the house on Sandpiper Court.\n“What happened is the gun accidentally discharged striking a counter shattering and one of the fragments hit the child. She’s been treated and as I understand it is recovering nicely. So Orchard Park police have determined there would be no charges filed because this was simply that, an accident,” Flaherty said.\nThe incident was reported on Jan. 10 at 4:45 p.m.\nPolice have not released the address or the names of anyone involved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}