{"uri": "http://ultimateclassicrock.com/randy-meisner-wife-shot/", "title": "Eagles Co-Founder Randy Meisner’s Wife Shot to Death", "dct": "Mon, 07 Mar 2016 09:41:00 GMT", "id": "703a714c0edeb7ee6a37ca11bd776744", "content": "Randy Meisner’s wife was shot to death at the couple’s home, according to multiple news sources, but the founding Eagles bassist has been cleared of all charges.\nAuthorities now say Lana Rae Meisner was killed on Sunday (March 6) in Studio City, Calif., in a bizarre accident, according to TMZ. Randy Meisner, 69, told police that his wife was shot as she searched for something in the closet, RadarOnline reports.\nLaw enforcement had been to the Meisner residence earlier in the evening, several news outlets say. Lana Rae Meisner, 63, allegedly called 911 to report a domestic violence incident, according to TMZ, which also claims that she accused Randy Meisner of “acting erratically.” Roughly an hour and a half later, Randy Meisner called to say his wife had gone into another room when he heard a gun shot, according to multiple reports.\nRadarOnline quotes an unnamed law enforcement source who describes a grisly scene. According to that source, Meisner told the police that his wife “was stumbling around, looking for something in a closet where there were two guns. She was looking for something in the hall closet, and Randy told cops one of the guns was falling and in the process, Lana Rae caught it and it ended up blowing her head apart.”\nTMZ earlier reported that Meisner was “acting in an altered state” when police arrived, and apparently was taken to the hospital. “Randy seemed to be in shock,” Page Six says, “and wasn’t even able to acknowledge that Lana Rae was dead from a gunshot wound.”\nThe Meisner’s marriage made headlines last spring when Randy Meisner refuted a TMZ story claiming Lana Rae wanted to kill him. She’d been accused in that same report of keeping Randy in a “state of near-constant inebriation” because “he is easier to control when he’s drunk.” Later, in June, Randy was placed under 24-hour care by a temporary conservator following a court hearing in which Meisner was alleged to have threatened to shoot hospital staff and also to end his own life by taking all of his medication.\nMeisner left the Eagles in 1977; he was earlier in Poco."}