{"uri": "http://www.nj.com/union/index.ssf/2014/09/son_killed_in_scotch_plains_murder-suicide_was_master_chess_player.html", "title": "Son, 11, shot in Scotch Plains murder-suicide was internationally ranked chess player", "dct": "Tue, 09 Sep 2014 03:13:43 GMT", "id": "caefbb68b87970beebf23b1a67283592", "content": "(Jessica Remo/NJ Advance Media for NJ.com)\nSCOTCH PLAINS — The 11-year-old boy police say was killed by his father in a murder-suicide in Scotch Plains last week was an internationally ranked chess player who played at area chess clubs.\nActing Union County Prosecutor Grace H. Park announced today that police believe Jens Elberling, 48, shot his 11-year-old son with a rifle and then shot himself sometime last week. Mark Spivey, a spokesman for the prosecutor's office, later confirmed the son's name was Thomas.\nJoan DuBois, director of affiliate relations for the United States Chess Federation confirmed that Thomas Elberling was an expert-level player, who was ranked fifth in his age group in the country, with a rating of 2151. Internationally, Thomas Elberling was recognized as a \"candidate master,\" the final level before master player, DuBois said.\n\"He was a very, very good player,\" DuBois said.\nDuBois confirmed that Jens Elberling also played chess, but had \"a much lower rating\" as an intermediate player.\nJim West, a local master-level player, said he played against Thomas Elberling about a dozen times and often lost to the boy.\n\"He was one of the most talented kids in the country,\" West said. \"I'm in complete and utter shock. His father was very supportive of him. Why would he do this?\"\nWest said the Elberlings were club members at the Chessmates chess club in Rahway. Our calls and emails to that club were not immediately returned.\n\"His father took him around to all the local clubs,\" West said. \"I first met him when he was about eight years old at Chessmates. Usually when you play young kids, one facet where they are the weakest is the end game. But he played the end game very well and defeated me. I learned to play a little more cautiously with him, and he absolutely beat me as many times as I beat him.\"\nWest said Jens Elberling was \"a typical chess dad,\" supportive, with a good sense of humor, but was particular about the conditions when his son was playing chess, sometimes asking organizers to turn down the air-conditioning because Thomas was too cold.\nWest said Jens Elberling also never allowed anyone to take photos of Thomas.\n\"If you tried, he'd want you to delete it immediately,\" West said.\nBill Cohen, one of the directors of the Westfield Chess Club, said Jens Elberling brought Thomas to their club about once a month for the past three years.\nCohen described Jens Elberling as “temperamental” and said he was difficult to deal with as a director.\n“He was a complainer, argumentative, picky,” said Cohen. “He wanted to see everything that was happening, wanted the perfect conditions for his son to play, always wanted to watch his games, things like that. But I never got the sense he was violent. When you are raising talented chess kids, you have to give them a lot of leeway. I do think his father was too involved.”\nCohen also described Jens Elberling as “competitive” and said he spoke about playing basketball in Denmark in his college years. According to what appears to be Jens Elberling's LinkedIn profile, he studied forestry, business and economics at the University of Copenhagen, graduating with his masters in 1993.\nJens Elberling's wife Kate Chou is the registered owner of TKJ International, according to public records. Chou filed for divorce from Jens Elberling in May, though the divorce had not yet been granted, according to public records.\nThe business was registered to a Berkeley Heights home that is currently for sale. The realtor for that property said she was aware of the tragedy and knows the family, but did not want to comment further.\nAccording to that same LinkedIn profile, TKJ International is involved in \"market development of new products including renewable energy originating from biomass fiber such as wood.\"\nThe prosecutor's office said police arrived at Jens Elberling's current residence on the 300 block of Jerusalem Road on Saturday morning in response to a welfare check request from a family member, but officials would not say specifically who called police.\nArriving officers found the bodies of the father and son inside the home, and also recovered a rifle used in the shootings, the prosecutor said. There were no signs of forced entry, she added.\nThomas Elberling was home schooled and did not attend local public schools, the prosecutor said. He was previously enrolled at Oak Knoll, a Catholic private school in Summit, for a period of time, the school confirmed.\n\"The entire Oak Knoll community is deeply saddened to learn of the death of Thomas Elberling,\" said Oak Knoll's Head of School Timothy J. Saburn in a statement. \"While he was only a member of our school community for a short time, Thomas is remembered by all as a sweet, caring and intelligent young man. Our thoughts and prayers are with Thomas’ family.\"\nRELATED: Father, 11-year-old son found dead in Scotch Plains home, police confirm\nJessica Remo may be reached at jremo@njadvancemedia.com. Follow her on Twitter @JessicaRemoNJ. Find NJ.com on Facebook."}