{"uri": "http://www.localmemphis.com/news/local-news/3-year-old-shot-multiple-times-while-sitting-in-car", "title": "3-Year-Old Shot Multiple Times While Sitting In Car", "dct": "Mon, 16 May 2016 10:57:00 GMT", "id": "415b2181953916ace433d81abb80489a", "content": "Error loading player: No playable sources found\nlocalmemphis.com\nA three-year-old girl is fighting to stay alive after being shot Sunday night in Whitehaven.\nMemphis police said the girl's mother tried getting away from a confrontation with a man who then opened fire, hitting the child multiple times.\nThe gunman is on the run.\nPolice said that child remains in extremely critical condition.\nThose living nearby that shooting scene are furious over what went down and why that little girl was even out and about late at night in the first place.\n\"It makes me want to cry because it shouldn't have happened,\" parent Elisha Rushing said.\nSadness and disbelief were the emotions others felt Monday around the Whitehaven apartment complex. Hours after police said a man shot a three-year-old girl and an innocent bystander multiple times.\n“For that kind of situation to happen, that's a sickness man. It's sickness,\" parent Elijah Sledge said.\nAccording to the police report, the girl's mother brought the child to the apartment complex to do a woman's hair.\nThe report said a man made an advance on another woman, got into an altercation, and opened fire into a car with the child and her mother inside.\n“He can't handle his rage. He can't handle his anger,\" parent Dineshia Smith said.\n\"You know that little girl is fighting for her life right now just because a young man doesn't know how to take rejection,\" Sledge said.\nParents also alarmed a child that young was out and about so late.\n\"That child shouldn't have been around that situation or altercation period. I just don't understand Memphis,\" Rushing said.\nA hospital spokesperson said the girl's family declined comment.\nCopyright 2017 Nexstar Broadcasting, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}