{"uri": "http://www.greenvilleonline.com/story/news/crime/2015/03/08/injuries-reported-fight-gunshots-seneca-business/24608611/?from=global&sessionKey=&autologin=", "title": "Fatal shooting reported outside Seneca business", "dct": "Sun, 08 Mar 2015 00:00:00 GMT", "id": "2f4480e85ee8752bd27f98cfda7610e6", "content": "As many as 100 people may have been in the crowd when the fight started, the Oconee County Sheriff's Office said.\nAuthorities are investigating a fatal shooting at a business early Sunday.\nAuthorities received a report of a fight about 12:35 a.m. Sunday at Sonny's Hot Spot Bar & Grill on Wells Highway at Shiloh Road, Oconee County Sheriff's Office spokesman Jimmy Watt said. Dispatchers were told that multiple shots were fired and multiple victims were struck while officers from the Sheriff's Office and Seneca Police Department were on their way, Watt said.\nOne of the victims was in front of the business with a gunshot wound to his midsection when deputies arrived, the Sheriff's Office said. The victim was taken to Oconee Memorial Hospital for initial treatment, authorities said.\nThe Oconee County Coroner's Office confirmed the identity of the man as Anthony Letron Holden, 29, of South Pine Street, Seneca. He died at 9:33 a.m. Sunday in the intensive care unit at Greenville Memorial hospital, Coroner Karl Addis said.\nAn autopsy will be conducted Monday to assist with the investigation, Addis said.\nNo information was available on the conditions of the people who were injured.\n\"Other victims may have been transported to hospitals by unknown subjects that were at the incident location,\" Watt said in a press release.\nDeputies said there was damage to the front glass of the business and to a vehicle in the parking lot. As many as 100 people may have been in the crowd when the fight started, Watt said.\nAnyone with information about the shooting or potential suspects involved should contact Crime Stoppers at 1-888-CRIME-SC or 638-STOP. Tipsters who provide information that leads to an arrest could be eligible for a cash reward."}