{"uri": "http://dfw.cbslocal.com/2016/09/26/report-several-people-injured-in-houston-strip-mall-shooting/", "title": "Nine Injured In Houston Strip Mall Shooting, Suspect Dead", "dct": "Mon, 26 Sep 2016 14:16:00 GMT", "id": "d917e18c343f48a059d0c2d8aa3268b8", "content": "HOUSTON (CBSDFW/AP) – Houston police say several people were injured in shooting near a strip mall early Monday morning. Police searched the condo of the suspect, who was shot and killed by police.\nJason Delgado, the property manager of The Oaks at West University condo complex, confirmed that police are going through the residence belonging to the suspect, who has not been identified by authorities other than as a lawyer.\nDelgado said that the suspect twice recently became upset about things at the complex. Delgado said that last week the man became upset because of water pressure problems at his home. When he asked for maintenance help and expressed his displeasure in an email to the management firm that implied he’d “intimidate his way to getting what he was asking for.”\nIn August, police were called after roofers working in the complex said he pointed an assault-style rifle at them. He says there wasn’t enough evidence to move forward with charges because the suspect contended he didn’t point the gun at roofers.\nA resident of the Houston condo complex where several people were shot says her husband was injured by glass when his windshield was shot at.\nJennifer Molleda says she first heard shots about 6:12 a.m. Monday, when her husband left for work. She called him shortly after and he told her “I’m hit, I’m hit.” After the gunfire stopped around 7:15 a.m., she said she found her husband, Alan Wakim, at a strip mall parking lot with two bullet holes in his windshield. He was taken to the hospital.\nLee Williams lives in a home in the neighborhood where the complex is and began directing traffic away after he heard gunfire in the area. He said one car ignored him and immediately was shot at.\nWilliams says people cut through the neighborhood to avoid some busier intersections.\nNine people were shot and wounded, one critically. Several cars with riddled with bullet holes and shattered windows.\nAccording to sources, the shooter, who has not yet been identified, was a lawyer who allegedly had issues with his law firm.\nThe shooting happened in a shopping center in the southwest area of Houston at the corner of Weslayan at Bissonnet.\nPolice Chief Martha Montalvo said at a news conference, and when officers arrived, the suspect began firing at them. Police shot the man, whom Montalvo did not identify and who later died at the scene.\nNumerous weapons were found at the scene, Montalvo said, and a bomb-squad robot is looking at a Porsche that’s believed to be the shooter’s.\nMayor Sylvester Turner, who is in Cuba for a trade mission, told KTRK-TV that the lawyer was “disgruntled.”\n“He was either fired or had a bad relationship with this law firm,” Turner said.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\n*This is a developing story. Follow CBSDFW.com for the latest information.\n(©2016 CBS Local Media, a division of CBS Radio Inc. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report. )"}