{"uri": "http://www.gjsentinel.com/news/articles/drug-ring-uncovered-after-teen-was-shot", "title": "Drug ring uncovered after teen was shot", "dct": "Thu, 22 Dec 2016 00:00:00 GMT", "id": "4bba963137e929e83e84747768882bd2", "content": "The gun that authorities believe was used in the accidental shooting of a 14-year-old Mesa County boy in August has been linked to a pair of suspected methamphetamine dealers accused of buying and reselling the weapon after the incident, according to a federal agent’s testimony.\nSteven Knight, a supervisor with the Drug Enforcement Administration’s Grand Junction office, described to federal Magistrate Gordon Gallagher this week a multi-jurisdictional investigation that followed the gun from the 15-year-old boy accused of shooting his friend through the hands of a convicted felon, an accused drug dealer, and finally an undercover DEA agent.\nKnight spoke during a detention hearing for Manuel Arias, Maria Serna, Michael Batt and Gretchen Wallbraun, who were indicted on a variety of federal drug- and gun-related charges and arrested last week.\nKnight’s testimony shed some light on the arrest of 15-year-old Michael Anthony Manzanares, who faces numerous counts, including second-degree assault, in connection with the Aug. 31 shooting of his 14-year-old friend at a home in the 1700 block of Christopher Court.\nKnight said during the hearing that Manzanares and other “juveniles” confessed to stealing a .223 Tavor rifle from a home on Aug. 30. The semi-automatic weapon, which is used by armed forces in Israel but is not common in the U.S., can retail at up to $5,000 on the black market, Knight said. The gun’s owner didn’t initially realize his weapon was missing.\nInvestigators believe Batt, a five-time felon, somehow had contact with the weapon that day.\nBased on information learned through a months-long wiretap operation targeting suspected meth and weapons dealers Arias and Serna, Knight said his agents believe that Batt approached Arias with the rifle in hopes that Arias would sell it to an out-of-state contact.\nBy the next day, however, the teens were back in possession of the rifle. While handling the gun, it apparently went off and left the 14-year-old boy seriously injured. Another teen — it’s unclear who — fled the address with the stolen gun, Knight said.\nWallbraun told investigators after her arrest that the unidentified teen showed up at her door with the Tavor rifle.\nShe is accused of then helping coordinate the gun’s sale to Arias, who in turn sold it to his contact.\nArias’ out-of-state contact, however, was a DEA informant. When Arias finally sold the rifle for $2,500 on Sept. 14 to the informant’s “brother-in-law,” he was actually selling the stolen gun to an undercover agent, Knight said.\nThe entire scenario appeared tangential to the original DEA investigation targeting Arias and Serna; the couple had been under surveillance since November 2015 and had sold meth and guns to undercover agents multiple times, said Knight, who described them as professional criminals.\n“They have no other legitimate form of employment,” Knight said, adding the couple appeared to work “in tandem.”\nAssistant U.S. Attorney Pete Hautzinger asked Gallagher to keep all four in custody, citing the high volumes of meth involved in the case and describing them as a “profound public safety risk” at a “profound risk of flight.”\nArias and Serna, who face the most charges including multiple counts of drug possession with intent to distribute, remain in custody after Gallagher said he couldn’t impose bond conditions that would ensure both community safety and their appearance in court.\nBatt, who is only charged with possession of a weapon by a previous offender, also remains in custody.\nWallbraun, who allegedly bought meth from Serna, faces a single count of drug possession with intent to distribute. She was released from custody Tuesday, but will forfeit $100,000 if she violates her bond conditions, Gallagher said.\nAll four defendants are due to return to federal court at 10 a.m. Dec. 29."}