{"uri": "http://www.wbaltv.com/article/city-police-investigating-shooting-in-carroll-park/8525511", "title": "Police: Former officer shoots carjacking suspect in Carroll Park", "dct": "Thu, 22 Dec 2016 22:10:00 GMT", "id": "c2d174b0580dd8cecd6317f1eacb9fcc", "content": "BALTIMORE —\nPolice said they are investigating the shooting of a 13-year-old would-be carjacker in southwest Baltimore.\nPolice were called around 3:45 p.m. Wednesday to an area near Washington Boulevard in Carroll Park, where three young men had approached a man sitting in his car.\nPolice said the assailants tried to carjack the victim. One assailant pulled out what appeared to be a handgun, but investigators later learned the firearm was a replica, police said.\n\"He threatened the 73-year-old man with that handgun in an attempt carjacking,\" Baltimore media Chief T.J. Smith said.\nThe victim, a former Baltimore police officer who is now a private investigator, pulled out a gun and shot the assailant once. Police said the assailant is a 13-year-old boy.\n\"One of the young men opened his car door and produced what he thought was a real gun,\" Baltimore police spokesman Detective Donny Moses said. \"The 73-year-old shot the suspect in the head. He is at Shock Trauma in critical condition.\"\nThe two other assailants fled. Police said they have not yet been located.\nPolice said the victim left the Police Department in 1974. Police said he has a handgun permit from the Maryland State Police for the weapon and remained at the scene.\n\"At this point it's senseless,\" Moses said. \"He put himself in a bad predicament and unfortunately he paid a heavy price. Preliminary this looks to be justified. The male did have a valid hand gun permit issued by the state police of Maryland. It was no way he could have known at that instant the gun the young man was carrying was not real.\"\nCarjackings increase in Baltimore\nSmith said carjacking increased 52 percent this year. He said adult carjackings arrests have increased 20 percent.\n\"Year to date, however, our carjacking arrests for juveniles is up 70 percent. Arrest is a last resort, but it's something that has to be done as corrective action when people don't want to follow the law,\" Smith said.\nSmith said those juvenile arrests for carjacking in 2015 were 16, and in 2016, the number is 27. Stolen vehicle arrests for juveniles have decreased from last year to 230 this year.\n\"Our thoughts and prayers are certainly out to the 13-year-old. This is a child at the end of the day. A child committed a criminal act and that child suffered a life-threatening injury,\" Smith said.\nEarlier this month, police arrested two boys, ages 13 and 15, in the attempted carjacking and assault of former Baltimore City Councilwoman Rikki Spector, who was attacked inside a garage near her home.\nIn April, in the area of Aisquith and Baltimore streets, police chased and shot a 13-year-old boy, who they thought had a real weapon in his hand. It turned out to be a replica. That led to the City Council passing legislation banning replica guns, which police said are used to pose a threat.\nSmith said some of the negative social media response to the incident has been concerning.\n\"We're all humans here, and we should act like humans at times, and this is a 13-year-old and we've all been 13, and we've done some silly things, and maybe many of us have never done anything like this, but when referring to this 13-year-old we need to be mindful of the fact that he committed a silly act, and the consequences were substantial, but there's absolutely no need for name calling,\" Smith said. \"He obviously has some issues that need to be addressed. We're hopeful he can survive this incident and really be able to tell his friends and become a leader in the community so that we can limit situations like this happening.\"\n\"We have young people across our city who are involved in activities that we don't want them to be involved in,\" Baltimore Mayor Catherine Pugh said. \"What I want to say to Baltimore is: 'Please, let's see what we can do to help our young people.'\"\nSmith said there is a collective responsibility for parents and the community to help with at-risk and troubled juveniles. He cited community examples like Munir Bahar's work with COR Community and 300 Men March, and Ericka Alston-Buck with Kids Safe Zone.\nWBAL-TV 11 News I-Team reporter Barry Simms contributed to this story."}