{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-mchenry-man-killed-wisconsin-russian-roulette-met-20170107-story.html", "title": "Drunken game of Russian roulette led to man's shooting death: officials", "dct": "Sun, 08 Jan 2017 09:38:00 GMT", "id": "d2ac20bc26d149753f4846751a43f97a", "content": "(Walworth County Sheriff's Office)\nTwo people are in custody in the death of a McHenry man who was fatally shot in the face after a drunken game of Russian roulette, authorities said.\nDavid Bauspies, 36, died after he was shot Monday in an apartment in East Troy, Wis.\nAccording to a criminal complaint filed Friday in Walworth County, East Troy police responded to the apartment about 12:30 p.m. that day to investigate a report of gunfire. When they arrived, they discovered another McHenry man, Robert Sterling, 31, kneeling over Bauspies' \"deceased\" body, a revolver lying on the floor nearby and \"a large amount of blood on the wall and surrounding the victim,\" the complaint said.\nThe document also stated that Sterling had blood on his hands and clothing.\nAuthorities said a man who lives in the apartment, Tyler Odell, 22, later told East Troy police that Sterling and Bauspies had been drinking beer and were \"pretty drunk,\" according to the complaint.\nOdell \"decided to show everyone his gun,\" a .44 Magnum revolver, after removing its six rounds of ammunition, the complaint said. Odell told authorities he then put one round back in the gun, spun the cylinder and aimed the revolver at his own head but did not pull the trigger, according to the court record.\nOdell told police he then handed the gun to Sterling, who \"spun the cylinder, held the gun up to (his own) head, and pulled the trigger,\" but the gun did not fire. Odell said Sterling \"then pointed the gun at Bauspies and pulled the trigger, causing the gun to fire,\" according to the criminal complaint.\nOdell and another man who was present but was not charged in the shooting then left the apartment, returned later and were met by police outside, authorities said.\nAccording to the complaint, Sterling told authorities that he was holding the revolver \"by (his) knee when the gun went off and Bauspies was shot.\"\nSterling was formally charged Friday with first-degree reckless homicide and homicide by negligent handling of a dangerous weapon in Bauspies' death and was being held in lieu of $20,000 bond in Walworth County Jail, according to authorities and court records.\nOdell was being held in lieu of a $10,000 bond, and authorities said they have referred him for a possible charge of being a party to a reckless homicide, though he has not been formally charged. Odell is due in court Tuesday, according to court records.\nA GoFundMe page has been set up to cover funeral costs for Bauspies, who is the father of a young child, according to the site. The person who set up the page could not be reached for comment.\nAmanda Marrazzo is a freelance reporter."}