{"uri": "http://www.ky3.com/content/news/forsyth-murder-pc-statement-397345731.html", "title": "Murder suspect said he was scared when friend arrived from wrong way", "dct": "Mon, 17 Oct 2016 14:07:00 GMT", "id": "bd011ccf77e5e70b9b846987d7069221", "content": "FORSYTH, Mo. - A man charged with murder told a detective that he was scared because he saw a vehicle approach his house from an unexpected direction. A detective’s account of what happened doesn’t say why that would have caused Tristan Carr to shoot a friend.\nCarr, 18, is charged with first-degree murder and armed criminal action for the shooting death of Eric Summerfield at 665 Skyline Drive in Forsyth. Carr admitted he shot Summerfield but initially said it was accidental when he called 9-1-1. Summerfield also was 18 years old.\nThe probable cause statement is the basis for the charges against Carr. Here’s a summary of what Forsyth Police Detective William Murphy wrote:\nAn officer was dispatched to 665 Skyline Drive at 7:38 p.m. The officer found Summerfield lying in the road with a gunshot wound to his chest. She did CPR until paramedics took over. Carr was crying and sobbing and said he shot Summerfield, who died at the scene.\nThe detective secured the gun that Carr said he used to shoot Summerfield. The detective later read Carr his Miranda rights and interviewed him. That’s when “he explained to me that he had been scared. He told me that he had asked Mr. Summerfield along with other friends to come to his residence and hang out. He explained to me that the vehicle they were driving did not come from the direction he was expecting it to come from and he was scared when the vehicle stopped,” the probable cause statement says.\nA witness told the first officer on the scene that “when the vehicle arrived Mr. Carr looked out of the window and said, ‘Oh (expletive). Eric is here.’ (The witness) stated he did not know where Mr. Carr had went. (The witness) said that he walked out of the home and greeted Mr. Summerfield and then started to walk off. (The witness) stated that Mr. Carr and Mr. Summerfield were talking and then he either heard ‘Oh (expletive)’ and then a shot, or a shot and then ‘Oh (expletive).’ At this time is when Mr. Summerfield took off running. (The witness) could not tell me his exact route,” the probable cause statement ends.\nCarr is charged with first-degree murder and armed criminal action. He made his first court appearance on Monday morning. He's in the Taney County jail in lieu of a $500,000 bond."}