{"uri": "http://www.palmbeachpost.com/news/news/local/boca-family-mourns-death-of-son-16-in-accidental-s/nqJwt/", "title": "Family of teen killed in accidental shooting pushes gun safety", "dct": "Thu, 04 Feb 2016 00:00:00 GMT", "id": "594d8dc55b87fa8228a2ca4f7a0d097c", "content": "WEST PALM BEACH\nWhen Stephen Cartigiano dropped off his 16-year-old, James, at a friend’s home Jan. 22, he thought it was just another normal night for his teenage son. The friend had been to their home before, he’d met the boy’s family, everything seemed to be safe.\nHours later he got a call from authorities: His son had been shot in the head. His friend was the shooter. It appeared to be an accident.\nThree days later, his son was declared brain-dead. James was removed life support on Jan. 27.\nCartigiano, his wife, Gloria, and the family’s lawyer, Gary Lesser, spoke at a news conference Thursday to advocate for better safety measures with guns. Lesser said at the time of the shooting, there were no adults in the home and several loaded guns throughout the residence. The shooting was an accident, but there could have been better care to prevent the tragedy that he said happens all too often across the nation.\n“The gun never should have been in the shooter’s hands,” Lesser said. “This isn’t about gang violence. This isn’t about drive-by shootings. This isn’t a debate about open carry. This is about gun safety.”\nThough no criminal chargeshave been filed, the Palm Beach County Sheriff’s Office is investigating the shooting. Lesser said a handgun was used, but they don’t want to release any other information, including where James went to school, that might hinder PBSO’s investigation.\nLesser and the family plan to file a civil lawsuit, but at the moment they said their goal is to raise awareness about gun safety, from things as simple as parents asking other parents if there are guns in their home accessible to children.\nStephen Cartigiano said his son was just a regular 11th-grader who skateboarded and whose friends looked up to him, always asking him for advice. In the last two years, the teen worked on getting his grades up because he wanted to go to college.\n“Now that’s not going to happen because somebody was careless,” he said. “A law has to be made or changed to not let this ever happen again. It’s just horrific.”\nThough the shooting happened in suburban Delray Beach, the Cartigianos are from Boca Raton, whose Deputy Mayor Robert Weinroth came out to show his support for the grieving family.\n“No family is immune from what Stephen and Yvonne are facing when loaded guns are left in the reach of children,” Weinroth said. “We must protect our families from the dangers of unsupervised guns.”\nEventually, they hope to bring their story to the state legislature so laws can be enacted to prevent anything like this from happening again. For now, Lesser said the Cartigiano family is trying to make sense of the loss of their son.\n“We don’t want to see any other family get a phone call or a surprise visit from law enforcement, when they think their son or daughter is at a play date or a sleepover, and instead they get that horrible news that their son or daughter is dead,” Lesser said."}