{"uri": "http://www.wptv.com/news/region-s-palm-beach-county/west-boca-teenager-shot-and-killed-in-what-appears-to-be-accident", "title": "Suburban Boca Raton teenager shot and killed in what appears to be accident", "dct": "Thu, 04 Feb 2016 12:19:00 GMT", "id": "a6b047e4389f9ecae69e141545c5b80f", "content": "Autoplay:Family speaks about son's accidental shooting deathCONNECTING...XTeen killed in accidental shooting - 4pm report\nPALM BEACH COUNTY, Fla. - A West Boca Raton family is calling for stricter gun safety rules.\nSteve Cartigiano says his son, 16-year-old James, was accidentally shot by a teenage friend and later died.\nHe says James went to a sleep over at the friend's house in suburban Delray Beach on January 22.\nCartigiano's lawyer, Gary Lesser, says there were several unsecured, loaded guns in the home. Lesser says no adults were at the home when the boy living there accidentally shot James Cartigiano. He died January 27, when doctors took him off life support.\n\"I cant describe, or tell you, the feelings. There are no words for them, but no parent should have to go through this, ever,\" Steve says.\nNow, the Cartigiano family and Lesser want to raise awareness about gun safety. They say guns should be locked, kept in a secured place and never handled without adult supervision.\n\"[James] was waiting to go to college, that's all not going to happen now because somebody was careless, a homeowner was careless, a child was careless. A law has to be made, or changed to not let this ever happen again,\" Steve says.\nLesser says he is drafting a civil lawsuit against the family which owns the home and the gun, and possibly others.\nHe says the goal isn't to get a huge sum of money, but to raise awareness about gun safety regulations.\n\"We don't want to see another family get a phone call, or a surprise visit from law enforcement, when they think their child is at a play date, or a sleep over, instead they get that horrible news that their son is dead,\" Lesser explains.\nBoca Raton Deputy Mayor Robert Weinroth is joining their fight to raise awareness about gun safety.\nAlex Shkop owns Guns and Range Training Center in West Palm Beach. He sells a variety of safes, trigger locks and other devices to secure guns.\n\"You have people who financially don't want to spend the money, it's not required, they don't think it's necessary, they don't see the need,\" Shkop explains.\nHe says no law requires a gun owner to buy a safe.\nIn his experiences, the father of two says the best way to avoid tragedies is to start a conversation with your kids about guns and what to do if they see one.\n\"These are all preventable things and it's sad,\" Shkop says. \"But it comes back to the same thing: education. People don't see the need and that's the sad part because that's the most important part.\"\nA spokesperson from the Palm Beach County Sheriff's Office says detectives are investigating this incident as a homicide. No one has been charged, at this time.\nSteve described his son, James, as a fun-loving, skateboarding, high school junior who was working to improve his grades to prepare for college."}