{"uri": "http://www.nbcphiladelphia.com/news/local/Police-Find-Three-Shot-Dead-in-Kensington-House-After-Barricade-Sources-375982271.html", "title": "Gunman Kills Three, Barricades Himself Inside Kensington Home, Shoots at Police", "dct": "Mon, 18 Apr 2016 04:32:00 GMT", "id": "54005cd46850890c20b8886fe40a85cb", "content": "Three people are dead and a fourth is wounded after police say a man went on a shooting spree in Kensington and barricaded himself inside a house early Sunday morning.\nPolice were called to Westmoreland Street near E for reports of a shooting at 3:43 a.m., according to Chief Inspector Joe Sullivan. When they arrived, they found a man believed to be the first victim with a gunshot wound to his arm. He was taken to a local hospital for treatment, Sullivan said.\nNot long after, police responded to Westmoreland Street near Tampa -- less than a block away -- for a shooting inside the house. When officers arrived, they were able to talk with a man through the door, but he wouldn't let them inside, Sullivan said. Police declared a barricade at 4:10 a.m. and called SWAT teams and hostage negotiators.\nThe man stayed in the house more than an hour and at one point fired several shots at SWAT officers from inside as they climbed onto a nearby roof, police said.\nSullivan said at one point, the man called 9-1-1 and told a police supervisor on the phone that he was armed with a shotgun and at least one person was dead inside the house with him.\nHostage negotiators eventually stepped in, Sullivan said, and managed to convince the man to surrender. He did so peacefully and was taken for questioning.\nWhen police got into the house, they discovered a grisly scene: three people inside suffering from gunshot wounds. One victim, a man, was found lying on the living room floor with an apparent shotgun wound to his head, police said. Another man was found on the dining room floor also suffering an apparent shotgun wound to his head, and a woman was found lying on the kitchen floor with what appeared to be a shotgun wound to the head, according to police.\nPolice also found a gun inside the house.\n\"It's a tragic scene,\" Sullivan said early Sunday.\nThe chief added that preliminary information indicated that all four victims were injured in the same incident, and that it appears the man found first managed to escape from the gunman. It's unclear what led to the shooting or what the gunman's relationship to the victims is. He said the suspect is known to police.\nThis story is developing. Stay with NBC10.com and the NBC10 app for updates."}