{"uri": "http://interactives.dallasnews.com/2016/ambush-victims/?_ga=1.45701988.1599579249.1468248068", "title": "A look at the lives of the Dallas ambush victims", "dct": "Fri, 08 Jul 2016 00:00:00 GMT", "id": "1ec41bfdeaa0a875eeb1cb6a7e836b51", "content": "The five officers killed by a gunman Thursday night in downtown Dallas had varying personalities and styles but shared a passion for their profession.\nNine other officers and two civilians were also injured Thursday. Click the photos below to read about each of the victims who have been identified, and to see memorial arrangements for those who were killed.\nSenior Cpl. Lorne Ahrens’ children had already gone to bed Thursday night when the Dallas police officer was wheeled into the emergency room at Baylor University Medical Center at Dallas.\nOn Friday morning, the kids woke up to the news that their father was dead.\nMedical staff couldn’t save Ahrens from the bullets that tore into his liver, said Karen Buckingham, his mother-in-law.\n“It’s just beyond belief,” Buckingham said.\nAhrens had been with the Dallas Police Department since January 2002, according to department records.\n\"He was always one of the happy ones, with a smile on his face,\" said a fellow officer who often saw him around the department’s Central station.\nSteven Stribley, a Dallas patrol officer and a state Fraternal Order of Police vice president, said Ahrens was “an incredible loving and devoted husband and father. Greatly respected veteran of the department.\"\nThe 48-year-old officer was married to Detective Katrina Ahrens from the crimes against persons division. The couple lived in Burleson with their two children: 10-year-old Sorcha and 8-year-old Magnus.\nLaszlo Rakovszky, a southwest patrol officer, said Lorne Ahrens was a true cop, but also a “a big teddy bear.”\n“He was a jokester,” Rakovszky said. “He did what he needed to do, but he also had fun.”\nRakovszky and Ahrens bonded over their California heritage. “He was my friend,” he said. “He was my brother.”\nIt wasn’t unusual for Ahrens to reach out to the community he served, said fellow officer Jorge Barrientos, who was wounded in Thursday’s violence.\nThe day before his death, he bought dinner for a homeless man and his dog, a kindness he frequently extended, Barrientos said. Ahrens also encouraged other officers to reach out to the man and say hello when they passed.\nFormer Dallas officer Anthony Quintanilla met Ahrens when he transferred to the robbery unit.\nAt first, Quintanilla, who served in the Marines, was intimidated by Ahrens’ bulky frame. But Quintanilla said Ahrens took him under his wing and helped show him the ropes.\nAhrens, who worked near his wife, often appeared disorganized and kept a messy desk, Quintanilla said. But he always knew where he put every piece of paperwork on his cases and was a team player.\nQuintanilla said Ahrens always put his kids first.\nHe was stunned to hear that a guy as big and friendly as Ahrens had been killed.\n\"I just didn’t think this man could go down like that,\" he said.\nWith a shaved head and a frame exceeding 6 feet tall, Ahrens boasted the physique of a football player.\nBut when it came to his kids, he’d crouch to their level. He took them fishing and played with them in the park.\n“He enjoyed it as much as they did,” Buckingham said.\nThe officer volunteered to go down to his children’s school when teachers needed someone to come talk to their classes, Buckingham said. He became so popular that the school asked him to come back several times, she said.\nAhrens always wore his uniform when he visited the school so the kids could see him in blue.\nAfter keeping vigil at the hospital all night, Katrina Ahrens came home. She told Sorcha and Magnus that their father died doing what he was supposed to: trying to help people.\n“They don’t get it yet,” Buckingham said. “They don’t know what to do quite yet.”\nStaff writers Naomi Martin, Eva-Marie Ayala and Claire Z. Cardona contributed to this report.\nMemorial arrangements\nVisitation will be Tuesday from 5 to 9 p.m. at Prestonwood Baptist Church, 6801 W. Park Blvd. in Plano.\nAhrens’ funeral will be at 11 a.m. Wednesday at Prestonwood.\nHe will be buried in Restland Memorial Park’s Garden of Honor.\nMemorial coverage"}