{"uri": "http://www.detroitnews.com/story/news/local/wayne-county/2016/07/08/slain-dallas-officer-wayne-county-sheriff/86856406/", "title": "Slain Dallas cop from Wayne Co. was ‘all about serving’", "dct": "Fri, 08 Jul 2016 00:00:00 GMT", "id": "4de8b010d0c3a32e7c2dbbf8481af30b", "content": "A former Wayne County sheriff’s deputy who was one of the Dallas police officers killed during a Thursday night protest was “all about serving others,” his brother-in-law said Friday.\nMichael Krol “always wanted to be a cop,” Brian Schoenbaechler told The Detroit News. “He always wanted to help and serve other people.”\nSchoenbaechler is married to the youngest sister of Krol, who was among five officers who died in the gunfire, which wounded seven others. The attack came during a protest in Dallas over the fatal shootings this week of African-American men in other states.\nKrol, 40, worked in Wayne County jails from 2003-07. He lived in Redford Township for a couple of years in the early 2000s, according to public records.\nSchoenbaechler and Krol’s other family members gathered Friday at the Redford home of Krol’s mother, Susan Ehlke.\nAn unidentified woman who answered the door said the family was overwhelmed and did not wish to comment.\nBut Schoenbaechler told The News it was Krol’s dream to be a police officer. He said Krol moved to Dallas nine years ago because the city was heavily recruiting officers and the Detroit Police Department wasn’t hiring at the time.\n“He was also a Detroiter at heart,” Schoenbaechler said. “He really wanted to be a cop. That was his dream. That’s the only reason he left.”\nKrol wasn’t married and didn’t have any children, his brother-in-law said. He did, however, have a serious girlfriend in Dallas, Schoenbaechler said.\nSchoenbaechler, who lives in Atlanta with his wife, Amie, said the last time he saw Krol was in Metro Detroit at Thanksgiving, when the officer’s girlfriend accompanied him.\nKrol is the third of four children from a close-knit family, he said. Krol’s father, Frank, lives in Muskegon and was en route to Dallas on Friday, Schoenbaechler said.\nSchoenbaechler released a statement from Krol’s mother.\nIt reads: “He was living a dream of being a police officer. He just turned 40 in April. He knew the danger of the job but he never shied away from his duty as a police officer. He grew up in Michigan. He was a Wayne County Sheriff’s deputy and with the Dallas Police Department for nine years. He was a great, caring person and he wanted to help people. He was a wonderful son, brother, uncle, nephew and friend.”\nSchoenbaechler said Dallas police Chief David Brown has been in touch with the family and “he’s making (funeral) arrangements and will notify us when that’s been worked out.”\nLocal officials expressed their condolences to Krol’s family, friends and colleagues.\n“We are saddened by the loss of the dedicated officers in Dallas — one of whom was a former member of this agency — and also the wounding of the other officers,” Wayne County Sheriff Benny Napoleon said in a statement.\nGov. Rick Snyder also issued a statement Friday about the fallen officers.\n“My heart is with the Dallas Police Department, the Dallas Area Rapid Transit police and the communities they serve,” he said. “I was notified today that one of the fallen officers in Dallas is a Michigan native who previously worked in law enforcement in southeast Michigan. We didn’t need this tragedy to be brought home to feel its impact, but still it hurts more this way.”\nRedford Township Supervisor Tracey Schultz Kobylarz said she didn’t know Krol personally, but her community grieves along with the rest of the country for him and the other Dallas victims.\n“I feel the pain as much as anybody feels this type of grief,” she said. “It’s extraordinarily difficult to deal with the shooting of a police officer anywhere in the country. And when you hear about the officer being from our hometown, it makes it that much more difficult.”\nAs Krol was mourned in Metro Detroit and Texas, details began emerging Friday about some of the other Dallas officers who died in the sniper attack. Four of the officers killed were with the Dallas Police Department; the fifth was a Dallas Area Rapid Transit officer.\nBrent Thompson, 43, had worked as an officer with the transit authority for the last seven years. There he found love, marrying another transit officer within the last two weeks, according to DART Chief James Spiller.\n“Brent was a great officer,” Spiller told MSNBC. “He has served admirably during his time here at DART.”\nPatrick Zamarripa, 32, was a Navy veteran who did three tours in Iraq, then returned to Texas and became a Dallas police officer. He was married with a toddler and a school-age stepchild.\n“Patrick would bend over backward to help anybody,” his father, Rick Zamarripa, said Friday. “He’d give you his last dollar if he had it. He was always trying to help people, protect people.”\ncramirez@detroitnews.com\n(313) 222-2058\nAssociated Press contributed"}