{"uri": "http://www.fox4news.com/news/171359952-story", "title": "5 Dallas officers killed in ambush, sniper suspect identified", "dct": "Fri, 08 Jul 2016 02:17:00 GMT", "id": "a104e325ee2f96fc3b11d0c93884d7c3", "content": "DALLAS - Five police officers were killed and several others were hurt in a shooting at the end of a protest Thursday night in downtown Dallas.\nDallas Area Rapid Transit officials identified one of the slain officers as DART Officer Brent Thompson. Four Dallas Police Department officers also died from their injuries and have been identified as Patrick Zamarripa, Michael Krol, Mike Smith and Lorne Ahrens.\n5 Dallas officers killed in ambush, sniper suspect identified\nOfficers negotiated with one suspect, identified as 25-year-year-old Micah Johnson, as he barricaded himself on the second floor of parking garage next to El Centro College. Dallas Mayor Mike Rawlings said officers killed him using explosives attached to a robot.\n\"We don't exactly know the last moments of his death but explosives did blast him out,\" Rawlings told The Associated Press.\nDPD Chief David Brown confirmed the man was upset about Black Lives Matter and the recent police shootings. He told negotiators he wanted to kill white people, especially white officers.\nRawlings said during a Friday press conference that there is no longer an active threat to the city.\n\"We believe now the city is safe, and we can move to heal,\" he said.\nThe Ambush\nDozens of shots were fired just before 9 p.m. Thursday as roughly 800 protestors were ending a march near Lamar and Main streets.\nThe rally and protest began at 6 p.m. and remained peaceful until the shooting. Several officers were even posing for pictures with protestors as the crowd began marching.\nThe protesters had gathered after a Minnesota officer on Wednesday fatally shot Philando Castile while he was in a car with a woman and a child in a St. Paul suburb. The aftermath of the shooting was live streamed in a widely shared Facebook video. A day earlier, Alton Sterling was shot in Louisiana after being pinned to the pavement by two white officers. That, too, was captured on a cellphone video.\nVideo footage from the scene in downtown Dallas showed that protesters were marching along a street about half a mile from City Hall when the shots erupted and the crowd scattered, seeking cover.\nThe Suspects\nDuring a Friday afternoon press conference, Rawlings said they believe Johnson was the lone shooter and acted alone.\n\"He did his damage,\" Rawlings said. \"But we did our damage as well.\"\nBrown said it appeared the shooter \"planned to injure and kill as many officers as they could.\"\nBrown said the Johnson told police, “The end is coming” and threatened to kill more officers. He also told police the garage was rigged with bombs and said other bombs were also possibly downtown.\nAlthough Johnson reportedly told negotiators he was not affiliated with any group, Brown said he is not confident that all suspects have been accounted for. He said he would not expand on the identities or the status of the other suspects until police have had more time to investigate.\nSKY 4 captured video of detectives removing bags of evidence from a two-story brick house in Mesquite Friday morning. The home is believed to be Johnson’s.\nDuring the search of Johnson's home, detectives found bomb making materials, ballistic vests, rifles, ammunition, and a personal journal of combat tactics.\nThe Army confirmed Johnson served as an enlisted soldier and had a tour of duty in Afghanistan. He had no criminal history.\nA female suspect was also taken into custody in the parking garage.\nTwo other suspects were questioned and then released. They were seen fleeing downtown in a vehicle with camouflage bags. They were stopped just south of downtown. SKY 4 footage showed many police cars surrounding a vehicle stopped on Interstate 35.\nA person of interest turned himself in after police circulated pictures of him online. Dallas police released him shortly after 1 a.m. after questioning him. Footage shows that he was in the crowd of protestors and not shooting when shots rang out at the end of the march.\nInjured Officers\nA total of 12 officers were shot, some from DPD and others with DART police. The attacks made Thursday the deadliest day for U.S. law officers since the Sept. 11, 2001, terrorist attacks, according to The National Law Enforcement Officers Memorial Fund, which tracks on-duty deaths.\nDART Chief James Spiller said 43-year-old Thompson, the officer who was killed, joined the agency's police force in 2009 and is the first DART officer to die in the line of duty.\nHe will be remembered as a \"courageous\" and \"great guy.\" He was married just two weeks ago and his wife, Emily, also works for the police force. She was not on duty at the protest.\nThe injured DART officers have been identified as 44-year-old Officer Omar Cannon, 32-year-old Officer Misty McBride and 39-year-old Officer Jesus Retana. Two are now out of surgery and one has already gone home.\nFamily members told FOX 4 that McBride was shot twice, but is going to be okay.\nThe Associated Pressed named Patrick Zamarripa as one of the fallen DPD officers. He was a Navy veteran who served three tours in Iraq.\nThe Wayne County Sheriff's Office in the Detroit area said Micheal Krol, one of its former officers, was also killed in Dallas. Krol reportedly moved to Dallas to join DPD in 2007.\nChief Brown said most of the injured officers have already been released from the hospital.\nEarly Friday morning about a dozen officers stood at attention outside Parkland Hospital as the bodies of three fallen officers were moved.\nCivilian Victims\nFamily members identified one of two civilians injured as 37-year-old Shetamia Taylor. Her sister says she was shot in the back of her calf as she shielded one of her sons from the shots. She was rushed to the hospital and into surgery but is expected to be okay.\n\"When we got [to the hospital], he was covered in his mom's blood, scared,\" said Taylor's sister, Theresa Williams. \"All he could do was run up to my sister and myself and hug our necks.\"\nWilliams said Taylor was alert when she was taken into surgery and said she was most concerned about the lives of officers being lost.\nDowntown Closures\nOfficials have blocked off a 12-block area in downtown between Ross Avenue, Houston Street, Jackson Street and Griffin Street. The area will be restricted to law enforcement only on Friday.\nThose who work in the area have been encouraged to contact their employer before going into work Friday.\nDART trains will operate through downtown Friday morning, but will not stop at the West End Station. The TRE will operate to Union Station. DART buses that serve CBD West are also being moved to CBD East. Those buses will board on Pacific Avenue between Pearl and Olive streets.\nDallas police conducted an extensive sweep of downtown for explosives. Lt. Max Geron said primary and secondary sweeps for explosives are complete and no explosives were found.\nReactions\nWhile heartbroken, Chief Brown said he is also proud of his officers.\n\"I can just tell you I've never been more proud of a police officer and being a part of this great, noble profession… seeing the courage, the professionalism and just the grit to stay on scene in an area looking for suspects, knowing that we are vulnerable,” he said. “Some of the stories I've heard from officers about what happened, running toward gunfire to help the injured officers, to get them transported to a hospital by patrol car and not having time to wait for an ambulance. There are just so many stories of great courage.”\nPresident Barack Obama is oversees attending a NATO summit in Poland, but commented on the shooting early Friday morning.\n“There has been a vicious, calculated and despicable attack on law enforcement,” said President Barack Obama. “We are horrified over these events and we stand united with the people and police department in Dallas.”\nRepublican presidential candidate Donald Trump called it an attack on our country.\n\"Our nation has become too divided. Too many Americans feel like they’ve lost hope. Crime is harming too many citizens. Racial tensions have gotten worse, not better. This isn’t the American Dream we all want for our children,\" he said in part.\nAttorney General Loretta Lynch is calling for peace after a week of heartbreak and loss for the nation.\nLynch says the spate of violence can't be allowed to \"precipitate a new normal.\" Calling the Dallas attack \"an unfathomable tragedy,\" she says those concerned about suspect killings by police should not be discouraged \"by those who use your lawful actions as a cover for their heinous violence.\"\nTexas Gov. Greg Abbott released a statement saying he has directed the Texas Department of Public Safety director to offer \"whatever assistance the City of Dallas needs at this time.\"\n“The past 24 hours in Dallas has been veritable a tale of two cities. On the one hand is the tale of heroism of police officers. At the same time, it's been a tale of cowardice by an assassin,\" Abbott said during a Friday press conference. \"We are so proud of the officers…for their heroism in the face of remarkable danger, running toward danger to aid those who needed it the most.\"\nAbbott also added that the Dallas Police Department and all law enforcement officers in Texas \"have the respect of a grateful state. And you have a governor who has your back.\"\nThe Next Generation Action Network, the group that organized Thursday’s protest, said the goal of the event was to bring awareness of the issues that people of color face concerning police brutality.\n“Never in our wildest dreams would we think that our efforts to save lives would take lives,” said Dominique Alexander, president of the organization. “We echo the words of President Obama yesterday when he stated that because black lives matter, it does not mean that blue lives do not matter.”\nAccording to the Associated Press, the Sterling family in Baton Rouge has rejected the shootings as \"reprehensible acts of violence\" against Dallas police officers.\nShow Your Support\nThe Dallas Police Association is collecting donations for the fallen and injured officers and their families. Anyone who wants to contribute can do so at ATODallas.org.\nThere will also be a multi-faith prayer vigil at noon at Thanksgiving Square, located at 1627 Pacific Avenue in downtown Dallas. The mayor and police chief will be there with Sen. Royce West.\nThe Associate Press contributed to this report."}