{"uri": "http://www.wwltv.com/news/local/downtown-ambush-survivor-gives-thanks-to-officers/355849676", "title": "Dallas ambush survivor gives thanks to officers", "dct": "Fri, 25 Nov 2016 00:00:00 GMT", "id": "a5d65794f23cbb9185484ced46d0bdc2", "content": "Shetamia Taylor has many reasons to be thankful.\n“A lot of cooking going on here,” she laughs in her kitchen. “I've had to sit down occasionally.”\nShe's alive and so are her four boys.\nIt's the first time we're hearing from Taylor since a few days after she was shot in the leg during the July 7 downtown attack. Five police officers died that night. She was one of two civilians injured.\n“The families of the officers who lost their lives that day are always continuously in my prayers, and on this day I lift them cause they're husbands, they're fathers. [They] are not there to sit at the table with them today and I know that that's got to be painful,” she says. “I'm here with my family and I'm thankful for it that my sons weren't hurt.”\nThe recovery has been long and painful. She’s got a metal plate and a dozen screws in her leg. She’s gone from a wheelchair to a walker and now a crutch. She hopes to soon upgrade to a cane. But you'll hear no complaints from Taylor, a woman with an infectious spirit and an even more infectious laugh.\n“I can stand up. I can bend my knee,” she said. “I can walk and that's wonderful. That's a blessing to me.”\nOn this Thanksgiving, she has three of her four sons at home. Her eldest, Kavion, is back from his freshman year of college. She’d been up all night cooking for her family. We spoke to her as she bustled around the kitchen finishing food preparations.\n“I’m feeling good,” she said. “I’m truly thankful. Just really truly thankful. It’s awesome to be here, to be alive.”\nThat terrible night is still vivid in the Garland resident’s mind.\nShe had taken her sons to the protest. She had left the rally early because she needed to get to work the next morning. They were standing on the corner of Main and Lamar Streets when the first shot rang out.\nTaylor initially thought it was fireworks.\n“There was a pause and then there was a pop, pop,” she said.\nA big bald cop standing by a squad car told her to take cover.\n“I remember him distinctly. You can't miss him,” she recalls. “He looked right at me and he said 'he’s got a gun. Get down.'”\nIt was Senior Cpl. Lorne Ahrens, one of the four Dallas Police Department officers to die that night.\n“Cpl. Ahrens saved our lives. He saved our lives. And I think about that all the time, how he saved our lives,” she said. “He's always on my mind.”\nTaylor hopes that one say she can tell his wife, Detective Katrina Ahrens, in person.\n“I just wanted to tell her I’m sorry, but your husband saved my life. He saved my kids' lives,” she said.\nShe's thankful to the five officers who surrounded her and her 15-year-old son as the bullets continued to fly. Her other sons had taken cover nearby.\n“There is no possible way that I can say thank you enough to those men who surrounded me and my son because were in the middle of the beginning of everything,” she said. \"Those men are not only heroes. They are angels and I am forever indebted to them.”\nTaylor says she never had a negative view of law enforcement because she doesn’t believe the actions of a few bad apples should tarnish the entire profession.\n“I’m thankful to every officer who put their lives on the line that night and do it every day,” she said. “We have to respect that. We have to honor that. You have to respect what they do, these men and women who live their lives daily to protect and serve strangers.”\nTaylor returned to work earlier this month after being off for about five months. She says financially she just couldn’t be away any longer. She is thankful to her employer, Conn’s Home Plus, where she works as a customer service representative, for keeping her job open all the months she was unable to work.\nThe Taylors are having all the fixings on this Thanksgiving. But most of all they have each other.\n“None of us deserved what happened. None of us. Dallas didn’t deserve it, Texas or the world,” she said. “But it really brought a lot of us together, people who never knew each other and people who never thought they could. It brought a lot of us together and I'm thankful for that.”\nCopyright 2016 WFAA"}