{"uri": "http://www.news-leader.com/story/news/local/ozarks/2015/03/15/police-negotiator-lake-shore-apartments/24830765/", "title": "Police identify man, two children found dead after nearly 24-hour standoff", "dct": "Sun, 15 Mar 2015 00:00:00 GMT", "id": "651c9d6069e9f041f7aa952b999142bf", "content": "Two children and an adult male were found dead when law enforcement made entry to a southwest Springfield apartment Monday evening, ending a nearly 24-hour standoff situation, police said.\nThe man — William R. Williams, 51 — appeared to have died of a self-inflicted gunshot wound, Lt. Eric Reece told the media in a briefing after the bodies were found, ending a day in which there was little communication from officials as to the status of the situation.\nAlso dead were Williams' son and daughter — Brodie Williams, 4, and Marley Williams, 2.\nIt was a check-person call that initially brought police to Lake Shore Apartments around 9:30 p.m. Sunday, Reece said.\n\"When we arrived, we encountered a man who was armed,\" Reece said. \"We set up a perimeter, which continued throughout the night with negotiations. Those negotiations continued into today.\"\nMuch of the day was a waiting game for Lake Shore residents, the media and family members of the individuals in the apartment, all of whom gathered at the apartment complex. The apartment where the man and children were holed up was out of public view given how police secured the scene, making it hard to ascertain developments.\nLaw enforcement activity picked up briefly about noon, but soon died down.\n\"Come out the front door of your apartment. Do it now,\" an officer said into a bullhorn about 12:10 p.m.\n\"This is your last chance.\"\nDespite the officer's warning, the standoff continued. Numerous ambulances were on the scene, along with the Springfield Fire Department and the Missouri State Highway Patrol.\nAbout 5 p.m., a bomb squad robot was deployed and began moving toward the apartment building. A second robot arrived some time later. A reporter at the scene heard what sounded like an explosion around 6:15 p.m., followed by another — although not as loud — around 7 p.m.\n\"Some of the noises and bangs you heard was us entering the apartment,\" Reece said. \"We sent in robots, which helped clear for our safety. At this time, the scene is just being held. It's being released to our detectives ... they'll be here for several hours, collecting evidence and processing everything and dealing with it.\"\nWilliams worked as a civilian for the Missouri State Highway Patrol from 1988 to 1991, patrol spokesman Jason Pace said Monday.\nCourt records indicate Williams filed for divorce in March 2014 from Brittnee Williams, whom he had married in May 2011, but the case was later dismissed. Williams filed again for divorce in November. The November divorce filing says that Williams worked for CST, LLC at the time.\nSam Coryell, executive director of TLC Properties, said earlier Monday that staff at the apartment complex had been busy making arrangements for displaced tenants.\nBuilding 29, where the man at the center of the standoff resided, was evacuated Sunday evening. Coryell said there are about 24 units in the building, but that he wasn't sure how many tenants were occupying them.\nCoryell said some residents displaced Sunday night wound up sleeping in the building's clubhouse, and others were placed in vacant TLC units.\nBuilding 29 resident Andrew Hernandez wound up in the clubhouse. He said he was briefly handcuffed Sunday evening when he walked outside to take out the trash Sunday evening; officers released him once they determined his identity, he said.\nBecause of the standoff, Hernandez couldn't get back to his apartment, and he couldn't make it to work at McDonald's on Monday. He said he did a television news interview so his bosses would know the reason for his absence.\n\"Waiting and very frustrated,\" Hernandez said. \"We are beyond inconvenienced now. And it has nothing to do with the complex. I don't know why they're taking so long, especially with children inside. Why are they waiting so long?\"\nHernandez said he didn't know Williams well, but that he believed Williams had been living at Lake Shore about four months. The November divorce filing indicates Brodie and Marley Williams were living with their parents at an apartment in Brookline Station at the time.\nBuilding 32 resident Jeremy Sanders, who was still able to get to his apartment, said he's lived at Lake Shore for about a year and that the complex was generally \"very quiet.\"\n\"For apartments, it's a dream,\" Sanders said.\nBy the end of the day, a 4-year-old and her father had put out cookies and water for officials who had responded to the scene.\n\"Thank you for keeping us safe,\" read a handwritten sign on a fence."}