{"uri": "http://www.huffingtonpost.com/2013/06/07/santa-monica-college-shooting_n_3404689.html", "title": "Santa Monica College Shooting Leaves Five Dead Including Suspect, Several Others Wounded (UPDATES, GRAPHIC PHOTO)", "dct": "Tue, 11 Jun 2013 00:00:00 GMT", "id": "2bf009f3865c921b1732a831af803212", "content": "Santa Monica College was placed on lockdown Friday after reports that a suspect fired a gun inside a campus building just before noon.\n11:55 a.m.: CHP began receiving multiple phone calls reporting a man dressed in black standing on a street corner. The reports varied in description: witnesses described him as either fully armed, holding a shotgun or holding several different weapons.\n11:59 a.m.: CHP started fielding calls that the gunman was actively shooting at a bus and that there were injured parties inside the vehicle (See a photo of the bus with gunshots). At that point CHP officials were able to confirm with the Santa Monica Police Department that they had an active shooter on their hands.\n12:17 p.m.: Santa Monica College students heard screams and shots being fired inside the library.\n1:29 p.m.: SMPD confirmed they had one shooter in custody. From then on, the department began the process of containing and clearing the entire campus in search of other victims and suspects.\n2:11 p.m.: At the time of HuffPost’s call, authorities were continuing to clear the campus. The process could take several hours.\nJimes Gillespie, 20, told The Associated Press he was in the college’s library studying when he heard the gunfire, and he and dozens of other students began fleeing the three-story building.\n“As I was running down the stairs I saw one of the gunmen,” said Gillespie, who described the shooter as a white man in his 20s, wearing cornrows in his hair and black overalls. He said the man was carrying a shotgun.\nGillespie believes there were two shooters because he heard two kinds of gunfire – a shotgun and a handgun – but only saw one person.\n“The shotgun blast was first. It was either him or the partner who shot eight to 10 handgun shots,” Gillespie said. “Then after I saw the gunman I heard more shots and I ran out of the library through the emergency exit.”\nAs Gillespie ran away across campus, he said he saw a car in front of the English building that was riddled with bullet holes, had shattered windows and a baby’s car seat in the back.\nThere have been reports of a shooter on the main SMC campus. The college is on lock-down. This means that if you are on campus, stay out of open spaces, stay in doors, lock all doors and do not open the doors until you receive an all clear from college officials. If you are off campus, do not come to campus."}