{"uri": "http://www.nydailynews.com/news/national/short-article-1.1372515", "title": "Santa Monica shooter John Zawahri left a remorseful farewell note to friends, mother", "dct": "Fri, 14 Jun 2013 03:09:08 GMT", "id": "b6e3ce5542b790f0bcb5041edbe030a1", "content": "LOS ANGELES — John Zawahri left a farewell note in which he expressed remorse for killing his father and brother but left no explanation for the rampage that left them and three others dead in Santa Monica, police said Thursday.\nThe three- to four-page handwritten note was found on Zawahri’s body after he was shot and killed June 7 by officers on the campus of Santa Monica College, Police Chief Jacqueline Seabrooks said at a news conference.\nIn the note, which was conversational in tone, 23-year-old Zawahri also said goodbye to friends and expressed hope that his mother would be taken care of and receive recompense from his father’s estate.\nSeabrooks said investigators believe mental illness played a role in the killings, but she didn’t give details.\n“We know his was a troubled life and that he experienced mental health challenges,” Seabrooks said. “We believe that his mental health challenges likely played a role in his decisions to shoot and kill both his father and his brother, to set fire to the family home, and to go on a 13-minute shooting spree spanning roughly 1.5 miles and which left five innocent people dead and three people injured.”\nZawahri apparently built his own .223-caliber assault rifle, using it to shoot his father and brother before he set fire to their family home, officials said earlier Thursday.\nZawahri’s mother was out of the country visiting family in Lebanon during Friday’s rampage but cut short her trip and returned home Sunday. She has been interviewed by detectives.\nSeabrooks said the semi-automatic weapon appears to have been built with component parts that are legal to obtain, but put together make the rifle illegal in California.\nShe said he also modified an antique black-powder .44 revolver so that it could hold .45-caliber ammunition; it was loaded during the shooting and he carried it with him in a duffel bag.\nZawahri’s rampage ended when police killed him in the Santa Monica College library Friday. To get there, he had carjacked a woman, directing her to the college and having her stop so he could fire at vehicles and strangers. Police still did not know why he chose to go to the college, why he targeted those killed or why he chose that day.\nSanta Monica police plan to work with the FBI to understand Zawahri’s psychological makeup and motivation, Seabrooks said.\nOfficials said Thursday that the fire at Zawahri’s father’s home, which erupted soon after neighbors heard shots fired, was intentionally set.\nAn official, who was not authorized to speak publicly and spoke on condition of anonymity, said the fires were started in a front living room and atop one of two twin beds in another room. Several boxes of matches were also found in the bedroom.\nFirefighters found the bodies of the gunman’s father and brother in a back bedroom that was uninvolved in the blaze. The house was found unkempt with files and papers scattered throughout, providing ample kindling.\nIn Zawahri’s bedroom, investigations found illegal zip guns, Seabrooks said. They also found ample evidence of his fascination with weapons, including four replica airsoft pellet guns, knives and gun magazines, said Sgt. Richard Lewis. Investigators also found materials that indicate he likely assembled the weapon.\nPolice said Zawahri bought a lower receiver that was only 80 percent complete. Because it is not complete and not considered a full weapon, a person isn’t required to go through a background check to get one, nor does the part need to have a serial number.\nThough Zawahri fired about 100 rounds during the rampage, police said he was carrying 1,300 rounds of ammunition in magazines that were capable of holding 30 rounds each. Such high-capacity magazines are illegal to purchase, sell or transfer in California. Possession is not illegal. He also had a spare upper receiver and the antique revolver with him in a duffel bag.\nZawahri’s last reported contact with law enforcement was seven years ago, when bomb-making materials were found at his house during a search prompted by threats to students, teachers and campus police officers at Olympic High, a school for students with academic or disciplinary issues.\nThe Santa Monica-Malibu school board was briefed at the time by school administrators after police found Zawahri was learning to make explosives by downloading instructions from YouTube, school board member Oscar de la Torre said.\nRetired police officer Cristina Coria, who helped serve the search warrant, said Zawahri was hospitalized for psychiatric evaluation at the time. She didn’t know the outcome of the evaluation.\nPolice declined to provide further details, saying Zawahri was a minor at the time. But once a person is held for such an exam, they cannot access or possess firearms for five years.\nIn the case of Zawahri, that prohibition would have expired in 2011.\nPolice said Thursday that in 2011, Zawahri tried to buy a weapon but was denied by the California Department of Justice, likely because of that 2006 incident.\nDespite that denial, Seabrooks said, Zawahri was able to buy the component parts to build his own weapon and obtain an array of magazines.\nSanta Monica police said they will work with the ATF to understand how he came to possess these gun components, Seabrooks said."}