{"uri": "http://www.wkyc.com/story/news/local/cleveland/2015/10/01/baby-shot-clevelands-east-side/73170392/", "title": "Baby killed in shooting on Cleveland's east side identified", "dct": "Fri, 02 Oct 2015 00:00:00 GMT", "id": "5ab54467af0bca2cdbe64caa3aed8bc2", "content": "CLEVELAND -- Police are asking the public's help for any information after a baby was shot and killed on Cleveland's east side Thursday.\nCleveland police confirmed a 5-month-old girl was shot in the chest during a shooting.\nThe baby has been identified by the Cuyahoga County Medical Examiner as Aavielle Wakefield of Cleveland.\nA photo of the child was used on a GoFundMe page set up to raise money for the victim's family.\nCleveland EMS took the child from the area of East 147th Street and Kinsman Road. The baby was rushed to University Hospitals.\nOfficials say shots came from an apartment building. Shots struck a car and building near the area of East 145th Street and Spear Avenue.\nSWAT team is also investigating. Cleveland Police Chief Calvin Williams became emotional at the scene at the recent violence in the city.\nCavaliers star LeBron James took to Twitter to voice his frustration about the violence.\n\"Like seriously man!!!! A baby shot in the chest in Cleveland. It's been out of control but it's really OOC. Ya'll need to chill the F out.\"\n\"C'mon man let's do and be better! Don't fall into the trap. This can't be only way. Accept more from yourselves. #TheLand#TheNation\"\nIn September, 3-year-old Major Howard was shot and killed while inside a vehicle E. 113th Street between Union and Regalia avenues. Five-year-old Ramon D. Burnett was playing football in the area of 2300 Louise Harris Drive when he was killed by a stray bullet.\nNearly two weeks ago, a 30-year-old man was killed and a 10-year-old boy was shot in the shoulder while riding in a car on Martin Luther King Boulevard, near the intersection with Shaker Boulevard.\nWhat do you think will help curb the violence? Share us your ideas by using the Twitter hastag #3StoptheViolence.\nStay with WKYC.com as more details emerge."}