{"uri": "http://www.palmcoastobserver.com/article/heres-what-your-deputies-are-doing-oct-26-nov-1", "title": "Here's what your deputies are doing: Oct. 26-Nov. 1", "dct": "Thu, 27 Oct 2016 00:00:00 GMT", "id": "fe843a4783cf21b4c6f19fffc2359f35", "content": "A man accidentally shot himself in the leg, and a thief broke into a truck.\nThe following is a summary of entries in the daily Flagler County Sheriff's Office commanders reports, updated as the reports are released:\nOCT. 31\nNight Shift:\nDeputies responded to an address near Palm Coast Parkway NE to arrest a man who had two active felony warrants from Volusia County. They made contact with the man on a rear patio, and he at first complied, but then resisted arrest physically. One deputy performed a takedown. The man was taken to Florida Hospital Flagler and medically cleared, then taken to the county jail.\nA man pulled into the parking lot of the Walmart in Palm Coast to fix a flat tire, but a vehicle pulled up beside him and two people got out and began hitting him, then drove off, the man told deputies. They were gone by the time deputies arrived.\nA man found his daughter dead at her home on Pine Brook Drive in Palm Coast. There were no signs of foul play.\nA person called the Sheriff’s Office about a male “going crazy” in a home on Pine Ash Lane in Palm Coast. Deputies detained the male when they arrived at the house. The family gave conflicting statements.\nDay Shift:\nThe Daytona Beach Police Department found a wallet belonging to a Fenimore Lane, Palm Coast resident, and asked the Flagler County’s Sheriff’s Office’s help in returning it to the owner. When deputies tried to find the owner, they discovered that his home had likely been burglarized overnight. Several items were stolen, including a 2014 Red Chevrolet Camaro and two XBox gaming systems.\nSomeone entered an unlocked 2007 Chevy Cobalt on Edward Drive in Palm Coast, and stole a laptop computer.\nA woman made threats to harm herself before she left her home on Seaside Court in the morning. Family members couldn’t find her or communicate with her. She was later found and taken into protective custody under a Baker Act.\nA woman crashed a car after accelerating over a parking stop. She struck a pillar at the West Tower entrance at Town Center Medical Center on Hospital Drive. The driver, who was disoriented and confused, was taken to Florida Hospital Flagler. No one else was hurt in the crash.\nOCT. 30\nNight Shift:\nA man called the Sheriff’s Office after his Madison Green Parkway, Palm Coast neighbor’s children came to his house seeking help because their mother hadn’t been home for a few days. The Sheriff’s Office notified the Department of Children and Families, but the mother came home before DCF responded. Deputies arrested the mother for child neglect, and DCF turned the children over to family friends.\nDay Shift:\nSomeone called the Sheriff’s Office after he posted an ad for his cell phone on a website and arranged to meet a potential buyer, who took the phone from him and left without paying for it. Deputies found a suspect, who’d already sold the phone to someone else.\nA man was arrested after shoplifting more than $500 in merchandise from the Walmart in Palm Coast. He was also charged with violation of parole for retail theft.\nSomeone stole a black Honda all-terrain vehicle from a property on Lake Disston Drive, Bunnell, sometime between Oct. 23 and Oct. 30.\nA woman was found dead at a home on Folcroft Lane in Palm Coast.\nOCT. 29\nNight Shift:\nA man and a woman were involved in a physical disturbance at a home on Bronson Lane in Palm Coast. Deputies arrested the man.\nDeputies responded to a physical disturbance on Lago Vista Place in Palm Coast and arrested a woman.\nDeputies responded to a 911 hangup call from County Road 205 in Bunnell. Approximately three gunshots were heard in the background before the caller hung up the phone. When deputies arrived, about 50 cars were leaving the scene, and everyone there refused to cooperate with the investigation.\nThere was a single-vehicle rollover crash with severe injuries on U.S. 1 northbound, about a mile north of Matanzas Woods Parkway. One person was taken to Halifax Medical Center with a trauma alert, and another was taken to Florida Hospital Flagler. Both were transported by ground because of fog. The scene of the accident was turned over to the Florida Highway Patrol.\nDay Shift:\nSomeone reported about $15,000 worth of jewelry missing from a home on Madeira Court in Palm Coast. There were no signs of forced entry into the house, and the victim wasn’t sure when the jewelry had last been seen.\nA man and woman who were dating and who live together were involved in a dispute on Wheatfield Drive in Palm Coast. The man pushed the woman, causing her to fall against a vehicle and hit her elbow. The woman refused to cooperate with the investigation. Deputies arrested the man on a charge of battery.\nA Filbert Lane, Palm Coast resident was arrested on charges of domestic violence assault, felony battery with a prior conviction and aggravated assault with a deadly weapon.\nA Wood Acre Lane, Palm Coast woman reported to deputies that her adult son, who she had a protection injunction against, was at her home. The man was evasive when deputies arrived, and physically resisted when they tried to secure him. He hit his face on a vehicle, causing a laceration on his lip, as they secured him. He was evaluated by a medical unit and taken to jail. Another person on scene was arrested on charges of obstruction of justice and resisting arrest without violence.\nOCT. 28\nNight Shift:\nA loss prevention employee at the Walmart in Palm Coast reported that three males and one female stole three sets of pots and pans, and ran from the store. Deputies found the male at the Smokers Express Exxon gas station on Cypress Point Parkway and arrested him on a Volusia County warrant. They found the stolen pots and pans in the Walmart parking lot.\nThere was a physical disturbance between a man and a woman on Filbert Lane in Palm Coast. The man fled before deputies arrived.\nDay Shift:\nA homeowner found a boy crouched inside her garage on Ryker Lane in Palm Coast. The boy fled on a bike with another person who was also on a bike. Nothing was reported stolen.\nA Welling Lane, Palm Coast woman reported that her adult sister, who lives with her, shoved her and spit on her after an argument. The sister was arrested on a charge of battery domestic violence.\nOCT. 27\nNight Shift:\nA Bickford Drive man got home from a doctor’s appointment and found that someone had broken into his home and stolen several items.\nSomeone reported that his roommate hadn’t returned to their home after the roommate was placed under a Baker Act by a deputy Oct. 20. The reporting person was in contact with some of the roommate’s friends, but none had heard form the roommate himself. Deputies listed the roommate in state and federal missing persons databases.\nDay Shift:\nAn Ulbright Court, Palm Coast woman reported to the Sheriff’s Office that her ex-husband has been missing since Oct. 24, and that this was out of character for him. Deputies entered him into state and federal missing persons databases.\nAn off-duty Daytona Police Department officer saw a white four-door Toyota Camry that had been reported stolen from Pinellas County on Interstate 95. Flagler County deputies spotted the car, performed a felony traffic stop and arrested one man.\nDeputies saw a white Chrysler 300 driving erratically. The car was stolen and had fled from law enforcement officers earlier in the week. Deputies tried to catch up to it to conduct a traffic stop. They found the car, empty, at the intersection of Hargrove Grade and Otis Stone Hunter Road. Deputies established a perimeter and deployed a police dog, and called in FireFlight, the county’s emergency services helicopter. They did not find the thief.\nOCT. 26\nNight Shift:\nTwo people who were dating got into a fight, and the woman struck her date with a closed fist at a home on Bareback Trail in Palm Coast. The victim had minor injuries, and the woman was arrested.\nSomeone called the Sheriff’s Office to report a suspicious vehicle on Palm Harbor Village Way: a pickup truck, with a half-dressed woman outside. Deputies arrived and found a woman standing outside the driver’s door, and a man in the seat. Deputies arrested the man for DUI and the woman for obstruction of justice, for resisting arrest without violence.\nDay Shift:\nA thief broke into a car on Emmons Lane in Palm Coast and stole a credit card and keys.\nAn elderly man called the Sheriff’s Office and said that he’d accidentally shot himself below the knee while cleaning his gun at a home on Chinook Court in Palm Coast. Rescuers forced their way into the house and and ambulance took him to Halifax Hospital."}