{"uri": "http://www.latimes.com/local/lanow/la-me-ln-death-penalty-sought-in-lax-shooting-spree-20150102-story.html", "title": "Prosecutors to seek death penalty in fatal LAX shooting", "dct": "Fri, 02 Jan 2015 15:38:00 GMT", "id": "0f15029893f8a88202b59521111e2eaf", "content": "Federal prosecutors will seek the death penalty against the man charged in the 2013 attack that killed a TSA officer at Los Angeles International Airport, according to a document filed in federal court Friday.\nPaul Anthony Ciancia, 24, was charged with 11 federal counts in connection with the Nov. 1, 2013, attack, in which authorities allege he opened fire with a semiautomatic rifle in the airport's busy Terminal 3. He has pleaded not guilty to the charges.\n------------\nFOR THE RECORD\nJan. 2, 3:38 p.m.: An earlier version of this post incorrectly stated the decision to seek the death penalty was made by the U.S. attorney’s office. It was made by Atty. Gen. Eric H. Holder Jr.\n------------\nTransportation Security Administration Officer Gerardo I. Hernandez was killed and three other people were wounded in the attack. Hernandez, 39, was the first TSA employee killed in the line of duty since the agency was formed after the Sept. 11, 2001, terrorist attacks.\nThe decision to seek the death penalty was made by Atty. Gen. Eric H. Holder Jr. In the court documents filed Friday, prosecutors cited several factors that led to their decision, alleging Ciancia's actions were intentional and occurred after \"substantial planning and premeditation.\"\n\"By committing his crimes on a weekday morning in a crowded terminal at one of the busiest airports in the world ... Ciancia terrorized numerous airline passengers and airport employees,\" prosecutors wrote.\nProsecutors also discussed the effect Hernandez's death had on his family and colleagues.\nCiancia allegedly targeted TSA employees in the attack; investigators said they found a note signed by Ciancia saying he wanted to kill TSA agents and \"instill fear in their traitorous minds.\" Witnesses to the shooting said the gunman asked them whether they worked for the TSA before moving on without shooting them.\nCiancia, a New Jersey native living in Los Angeles, was shot in the head and leg during a gun battle with airport police. He spent two weeks recovering at a hospital before he was transferred to a federal detention center in downtown Los Angeles, where he remains in custody.\nLos Angeles airport police Chief Pat Gannon said Friday that he felt the decision to seek the death penalty was appropriate, \"given the facts of the shooting.\"\n\"What a tragedy, all around,\" Gannon said. \"Especially for Gerardo Hernandez's family and those wounded.\"\nFollow @katemather and @LAcrimes for more Los Angeles crime news."}