{"uri": "http://www.ksl.com/?sid=42794989&nid=148&title=charges-woman-shot-twice-with-1-bullet-by-man-trying-to-hit-on-her", "title": "Charges: Woman shot twice with 1 bullet by man trying to hit on her", "dct": "Fri, 06 Jan 2017 00:00:00 GMT", "id": "a7b2c15318e3afdb24476e90531156da", "content": "WEST VALLEY CITY — A man who police say was upset that a woman was rejecting his advances was charged Friday with shooting her.\nCristian Ivan Ceballos-Rodriguez, 23, was charged in 3rd District Court with discharge of a firearm, a second-degree felony; aggravated assault, a third-degree felony; and possession of a firearm by a restricted person, a third-degree felony.\nCeballos-Rodriguez was \"very intoxicated and kept hitting\" on a woman in her house on Dec. 26, according to charging documents. The woman went upstairs to the restroom, but Ceballos-Rodriguez followed \"and kept trying to flirt with her.\"\nThe woman sat on the edge of a bathtub with her hands on her head and ignored the man. This angered Ceballos-Rodriguez, who then pulled out what the woman initially thought was a cellphone and allegedly threw it at her. The woman heard a loud noise and \"felt pain and blood on her right side and realized that she had been shot,\" according to charging documents.\nAt the hospital, police learned that the woman had four wounds.\nOne bullet went in, out, back in and back out.\n–Charging documents\n\"It appeared that the bullet entered and exited (the woman's) side, hit the tub, and then ricocheted back into (the woman) and exited,\" the charges state. \"One bullet went in, out, back in and back out.\"\nWhen Ceballos-Rodriguez was interviewed by police, he said he \"accidentally threw the gun and it went off when it hit the tub,\" the charges state.\nA West Valley police detective told him \"that this was highly unlikely because the round hit the top edge of the bathtub,\" according to charging documents. \"Ceballos-Rodriguez went quiet and could not provide an explanation for how the gun was fired.\"\nThe Department of Homeland Security also confirmed that Ceballos-Rodriguez's legal status was not current at the time of his arrest."}