{"uri": "http://www.orlandosentinel.com/news/breaking-news/os-six-shot-parramore-apartment-complex-20160416-story.html", "title": "Cops: One dead, five injured after gunman shot into 'large crowd' outside Parramore apartment", "dct": "Sun, 17 Apr 2016 00:20:00 GMT", "id": "ec6a33d8cdedc138ef8fceff178c74ea", "content": "Six people were shot at Saturday night at an apartment complex in Parramore, leaving one person dead, Orlando police said. On Sunday, officers released the names of most victims.\nGino Nicolas, 24, was the victim who was pronounced dead at Orlando Regional Medical Center.\nA group of people were gathered outside a building in the Landings at Carver Park apartment complex around 9:30 p.m. when gunfire erupted, said Orlando Police Lt. Roger Brennan.\n\"...A vehicle drove by and occupants inside the vehicle began to fire multiple handguns from the vehicle,\" said spokeswoman Sgt. Wanda Miglio.\nThe gunshots hit six people. Several rounds also were shot into homes and hit vehicles along Conley Street, Brennan said.\n\"It's unusual to see that number of people shot but when you come into a multi-family housing area and you have people that just randomly shoot into crowds of people this is what you get,\" he said.\nThe Orlando Fire Department said they transported four people to the hospital from the complex while the others transported themselves to the hospital, officials said.\nFour victims had multiple injuries to the legs and arms but were not life threatening, Brennan said. This group included 24-year-old Cordarius Williams, 23-year-old Daquan Lundy, 23-year-old Ricky Harrison and 22-year-old Wendell Edwards Jr.\nAnother victim is in critical condition, according to officers. No details about that individual are being released, said Miglio.\nOfficers are unsure of \"the intended target of the shooting.\"\nPeople scattered and others sped away in the vehicles after the shooting, leaving authorities no suspects, he said.\n\"Of course when the gunfire started people ran,\" he said. \"But we know people saw what happened and we're hoping it leads us to a suspect or suspects. We'll also be talking to the victims at the hospital to piece together what happened.\"\nPolice closed off part of the complex, located between Orange Blossom Trail and Westmoreland Drive, with crime-scene tape and left markers in the street for each shell casing. Crowds of neighbors gathered around the area and were shocked to hear the number of people shot.\n\"When you show that reckless disregard for innocent people that are just standing in the road trying to enjoy a Saturday night, we're going to go after them aggressively just like we would anyone else,\" Brennan said.\nAnyone with tips can call Crimeline at 800-423-8477 or Orlando Police Department at 321-235-5300."}