{"uri": "http://magicvalley.com/news/local/crime-and-courts/update-police-say-man-was-showing-gun-to-neighbors-when/article_0445e6b1-8951-5d20-be48-7501601f9aeb.html", "title": "UPDATE: Police say man was showing gun to neighbors when he fatally shot roommate", "dct": "Fri, 20 Jan 2017 00:00:00 GMT", "id": "a14e87d736940f4a51c86603ef52ed10", "content": "TWIN FALLS — A Twin Falls man has been arrested and charged with involuntary manslaughter in the Thursday-afternoon shooting of a woman at the State Apartments on Second Avenue North.\nBrandon S. Smithson, 26, is charged in the death of roommate Katrina D. Budden, 20, of Twin Falls. Police officers were dispatched to 232 Second Ave. N. for a reported shooting and found Budden inside the apartment building with a gunshot wound to her head.\nBudden was taken to St. Luke’s Magic Valley Medical Center, where she died from her injuries. The Twin Falls County coroner scheduled an autopsy for Monday.\nPolice say two neighbors were in Budden and Smithson’s apartment when the shooting happened. The group was sitting and talking when Smithson offered to show them his other roommate’s guns. The first was an AR-15 rifle; the second was a Remington shotgun.\n“…when Smithson came back into the living room, he racked the shotgun and suddenly shot Budden as she was sitting in the chair,” an officer wrote in court records. One of the neighbors told police Smithson dropped the shotgun on the floor and began screaming that it was an accident.\nSmithson told police he was holding the gun at his waist when he racked open the shotgun and checked to make sure the gun was empty, then closed the action and pulled the trigger. The gun went off, and a round struck Budden in the head.\n“Smithson said he dropped the shotgun on the floor, called 911 and tried administering first aid to Budden,” court records say. “Smithson said he had done the same sequence in the past, and after racking the gun, he would pull the trigger and hear the metal click.”\nHe told police he was sure the gun was empty.\nThe roommate who owns the shotgun told police he had recently been out shooting and left the gun loaded with shells in the tube, but no shell in the chamber.\nPolice said evidence in the house was consistent with Smithson’s and the neighbors’ versions of events.\nSmithson is being held at the Twin Falls County Jail in lieu of $75,000 bond. A preliminary hearing is set for Jan. 27."}