{"uri": "http://www.wsmv.com/story/32084947/woman-hurt-in-drive-by-shooting-now-charged-with-murder", "title": "Woman hurt in drive-by shooting now charged with murder", "dct": "Fri, 27 May 2016 21:43:00 GMT", "id": "b4fdf8aa0b36769237eea360246e3788", "content": "NASHVILLE, TN (WSMV) -\nA woman who was shot while riding in the front seat of a car during a drive-by shooting on Sunday night is now wanted for murder.\nFour people were shot and two were seriously injured in the shooting on Rains Avenue near Wedgewood Avenue.\nMetro detectives are investigating whether a murder case from earlier this month led to Dameisha Clark being specifically targeted in an act of retaliation.\nClark, 20, received a non-critical wound and was released from the hospital shortly after arriving on Sunday. She is now named in an arrest warrant charging her with criminal homicide for the shooting death of Johnny Broadnax at Hickory Manor Apartments on Hamilton Church Road in South Nashville.\nOn May 14, police said Clark contacted Broadnax, 21, to arrange the drug deal. Clark was driving a stolen Dodge Charger from which the fatal shots were allegedly fired. At least one other person is believed to have been inside the Charger at the time.\nOfficers responded to a shots fired call just before midnight and found Broadnax lying in the grass near an SUV that had struck an apartment building.\nPolice said Broadnax was shot near the apartment’s management office and had tried to flee in the SUV before the crash. He was transported to Vanderbilt University Medical Center where he died.\nOn Sunday night, police said Clark was the front seat passenger of a Nissan Sentra being driven by Kayla Blakely when two people in a small black sedan opened fire on the Sentra.\nBlakely also suffered a non-critical injury and was treated and released.\nThe two passengers in the back seat, Michael Myers Jr. and Michael Shaw, were more seriously hurt. They have since been released from the hospital.\nBlakely, Myers and Shaw are not suspected in Broadnax’s murder.\nAnyone with information on Clark’s whereabouts is asked to call Crime Stoppers at 615-742-7463.\nCopyright 2016 WSMV (Meredith Corporation). All rights reserved."}