{"uri": "http://www.starnewsonline.com/news/20160903/multiple-victims-in-creekwood-shooting", "title": "Four shot in Creekwood community", "dct": "NODATE", "id": "8004fa2c9919fbd6a77013d777a768a4", "content": "The shooting happened at about 2:40 p.m. Saturday in the 600 and 700 blocks of North 30th Street.\nWILMINGTON -- Police do not have a suspect in custody after a shooting in the Creekwood community sent four people to the hospital.\nLt. Matt Ingram of the Wilmington Police Department said several people were shot at about 2:40 p.m. Saturday in the 600 block of North 30th Street. At 8 p.m., police spokeswoman Cathryn Lindsay confirmed that four people were shot. She said police would not disclose the victims' conditions, but said there was \"not a homicide at this time.\"\nEarlier in the day, Ingram said police did not yet have a description of a suspect.\n\"Our detectives are just starting to paint a picture of what happened,\" Ingram said. \"We have multiple gunshots, multiple victims, we have a house that's been struck, we have no suspect in custody.\"\nIngram said several victims were taken to New Hanover Regional Medical Center in personal vehicles and at least one was transported by EMS. He said all were alive when they reached the hospital and he had not heard an update on their conditions.\nPolice and deputies with the New Hanover County Sheriff's Office had more than a block of the street closed off with police tape as investigators interviewed residents and collected evidence. Officers were photographing personal items discarded in the middle of the street -- a bicycle, a cell phone, a New York Yankees ball cap, bottles of Powerade, a Styrofoam container of half-eaten food.\nSeveral residents watching the scene said they did not know what happened during the shooting or declined to be interviewed.\nAlmost two hours after the shooting, about a dozen police cars remained at the scene. Ingram said police would release more information as it becomes available.\nReporter Cammie Bellamy can be reached at 910-343-2339 or Cammie.Bellamy@StarNewsOnline.com."}