{"uri": "http://abc13.com/news/woman-niece-followed-shot-by-home-invader/1259958/", "title": "Woman, niece followed shot by home invader in La Marque", "dct": "Wed, 23 Mar 2016 00:00:00 GMT", "id": "e441bed49388353ad07b8270deb74d72", "content": "LA MARQUE, TX (KTRK) --\nA terrifying home invasion in La Marque Tuesday night ended as quickly as it began with a woman and a two-year-old shot by the intruder.\nLa Marque police say the suspect kicked in a door, fired one shot and ran off.\nThe woman who was shot says he probably scared himself. But the damage was done.\n\"It was real scary. It was like something on TV,\" says Kim.\nKim says Tuesday night was the scariest night of her life -- so scary that she doesn't want to go back to her La Marque home, and she asked us not to show her face or use her full name.\nShe was inside with her sister and two-year-old niece when someone banged on the door around 10:50pm.\n\"I didn't answer at first. Then they knocked again and I said 'Who is it?' A couple of seconds later, they just kicked in the door and said 'Everybody in this mother***** get down,'\" she said.\nThe man was wearing a ski mask and had a gun. Kim says her instinct was to protect her niece.\n\"My reaction wasn't to get down. It was to stand up,\" she explains. \"So when I stood up, that's when he shot. Then he left. He just shot and ran.\"\nThe bullet hit Kim in the leg and hit her niece in the hand. Both were taken to UTMB.\nKim has been discharged. She says she's blessed to have not been seriously hurt. Her niece suffered non life-threatening injuries. She had a cosmetic procedure to repair the damaged hand.\n\"Very thankful,\" Kim says.\nShe's not sure what made this guy come after her, but has an idea: \"I really don't know why I was targeted. But I do have a nice car and it has the shiny rims on it. And a lot of people don't want to work how I work to get stuff. \"\nThere's not much of a description to go on. Kim says the suspect was about 5'6 or 5'7, skinny and was wearing a ski mask and a black hoodie.\nShe, her family and La Marque police hope someone may have seen something and will help them catch this guy before he hits again in La Marque.\n\"I'm 40. I'll be OK. I just want justice for her,\" Kim said.\nAnyone with information can call La Marque Police at 409-938-9269 or La Marque Crime Stoppers at 409-938-8477."}