{"uri": "http://www.dailymail.co.uk/news/article-2647713/Girl-3-accidentally-shot-dead-brother-6-left-loaded-gun.html", "title": "Girl, 3, 'accidentally shot dead when she and brother, 6, were left alone with a loaded gun'", "dct": "Tue, 03 Jun 2014 22:09:00 GMT", "id": "068756e886b31bdc0aded738669c8c23", "content": "Miranda Doerr was shot in her Missouri mobile home on Monday and died in hospital\nPolice said the toddler was playing with her brother when the loaded gun went off\nThe children's mother, Jennifer Doerr, said she was in another room\nPolice don't know who pulled the trigger, but consider the death accidental pending further investigation\nThe six-year-old boy is in protective custody\nA three-year-old girl has been shot dead after she and her older brother were left alone with loaded gun.\nMiranda Doerr's mother rushed her to hospital yesterday morning thinking she'd hurt her head in a fall, but it wasn't until the toddler had a CT scan that doctors realized she'd been shot. She died an hour later.\nAlthough police consider the death accidental, the Missouri girl's grief-stricken mother Jennifer Doerr told KOAM-TV her daughter's death 'falls on her shoulders'.\nScroll down for video\nNewtown County Sheriff Ken Copeland told MailOnline that paramedics were called to a home at Bykota Mobile Home Park in rural Joplin about 10am yesterday, following reports a girl couldn't breathe.\nJennifer Doerr told police her daughter and six-year-old son were playing unattended in another room of the house when she heard a bag.\nShe said she saw Miranda leaning against the dresser with a bloody eye, and thought she had fallen.\nSheriff Copeland said that when he saw the girl's eye, he also didn't realize she had been shot.\nHe said officers are investigating, but preliminary inquiries indicate the shooting was accidental. He said police don't know who pulled the trigger and an autopsy will be performed.\n'It is an unfortunate and tragic accident,' Sheriff Copeland said.\nJennifer Doerr's husband and 20-year-old son were not home at the time of the incident.\nThe six-year-old boy is in protective custody while officials investigate.\nMeanwhile neighbor Ray Moody said the close-knit community will support the grieving Doerr family.\n'They're just good people, you know, and uh they don't abuse anyone that I know of anyway, they're just good people,' he told KOAM-TV."}