{"uri": "http://www.roanoke.com/news/crime/roanoke/pistol-phone-and-bullets-seized-after-fatal-shooting-of-roanoke/article_5017cfc3-f2ef-5870-a956-e69a76979200.html", "title": "Pistol, phone and bullets seized after fatal shooting of Roanoke 11-year-old", "dct": "Tue, 31 May 2016 16:33:00 GMT", "id": "c8cc7b8fd3a2859b5e4c3f5d9c5c2793", "content": "Khalil Abdullah Lavon Burt died around noon Thursday, the same day he graduated from Westside Elementary School, relatives have said.\nKhalil was shot and killed by a 10-year-old relative as the two boys were playing with a gun in Khalil’s house in the 2000 block of Carroll Avenue Northwest, according to Roanoke police spokesman Scott Leamon.\nA search warrant filed Friday showed that investigators seized a pistol from the house, as well as a shell casing, a phone and an unspecified number of bullets.\nPolice are now working to confirm that the handgun they recovered — a .380 Ruger — was the firearm that killed Kahlil, Leamon said.\nHe said that no charges have been filed in the case and that it was unclear when the investigation would be complete.\nRoanoke Commonwealth’s Attorney Donald Caldwell said Tuesday that the primary focus of the investigation is to determine the time sequence and the events leading up to the shooting.\n“Quite honestly, the circumstances are such that there is almost no likelihood that any charges will be placed against the young man,” Caldwell said.\n“There is an adult family member who has said that they left this particular weapon in the house, although they do not reside there,” he added.\nVirginia law makes it illegal to allow a child access to a loaded gun, and it further penalizes those who let someone younger than 12 use a firearm unsupervised. The offenses, both misdemeanors, can carry up to a year in jail and a $500 fine.\nKhalil’s funeral will be held Friday at 1 p.m. at Williams Memorial Baptist Church, according to Serenity Funeral Home and Cremation Service."}