{"uri": "http://www.fox34.com/story/32462529/updated-three-hospitalized-including-one-juvenile-after-e-lubbock-shooting", "title": "UPDATED: Three hospitalized, including one juvenile, after E. Lubbock shooting", "dct": "Sun, 17 Jul 2016 04:47:00 GMT", "id": "a960402a1a9812163b163496dbda354c", "content": "LUBBOCK, Texas -\nUpdate (8:20 p.m. Sunday)\nA ten year old boy and two adults wounded after a shooting on East 30th St. near Ute. Ave.\nPolice said a group of children were playing in Johnnie Taylor's front yard when he told them to leave the property. The children fought with the 82-year-old for a short time but nobody was hurt. The kids left but came back with about eight family members. They started shouting at each other, when Kenneth Davis, 44, came up to the fight and joined in the confrontation.\nAccording to police, Davis pulled a gun from a backpack and stated shooting at Taylor, who pulled out his own gun and returned fire. Taylor and his son Cary Taylor, 44, were hurt in the exchange, as well as a ten year old boy nearby. None of their wounds were life-threatening.\nPolice said Davis ran to his home where he was arrested. He is charged with two counts of aggravated assault.\nUpdate (4:15 a.m. Sunday)\nLubbock police report a confrontation led to the shooting Saturday night, after children playing in the yard of a homeowner were told to leave the property. Police said family members of the children got involved in a confrontation when a third party came to the yard and brandished a gun. The homeowner reportedly took out a gun as well, and the two shot at each other.\nPolice said the homeowner was injured in the exchange, as well as the homeowner's son and a 10-year-old boy playing in the yard. None of their injuries were life-threatening.\nOriginal story (11:45 p.m. Saturday)\nThree people were reportedly shot near 30th and Ute Ave. Saturday night and were taken to the hospital with serious injuries.\nLubbock police report a homicide investigation started, but no deaths have been reported. A juvenile investigation was also started that night, after police say a 10-year-old was a victim.\nNeighbors said the juvenile was playing in a yard when the owners of the house he was playing at shot him.\nNo other information has been released."}