{"uri": "http://www.kcbd.com/story/32462550/2-adults-1-child-injured-in-shooting-at-east-lubbock-home", "title": "2 adults, 1 child injured in shooting at East Lubbock home", "dct": "Mon, 18 Jul 2016 00:14:00 GMT", "id": "e5b037614b77f1a653b7a66863569f64", "content": "LUBBOCK, TX (KCBD) -\nTwo adults and a 10-year-old child are in the hospital after a Saturday night shooting at an East Lubbock home. Lubbock police were called to the 2100 block of East 30th Street around 10:30 p.m.\nOfficials on the scene say the homeowner and a parent of a child got into an argument after the homeowner was accused of pushing the child. Officials say the parent pulled a gun and the homeowner then pulled out his gun.\nShots were exchanged, and the homeowner, parent and 10-year-old child were all injured and taken to the hospital with non-life threatening injuries.\nPolice say it started as a civil disturbance over children playing in the yard in front of the house.\nPolice say 82-year-old Johnnie Taylor confronted one of the children out front, but, according to witness statements, the child \"mouthed off\" and approached him in an aggressive manner.\nThe man pushed the child away from him. The child went to tell his mother, and eight adults came back to confront the Johnnie Taylor and the homeowner, 44-year-old Cary Taylor. A verbal argument started between the adults and the homeowner.\nPolice believe the shooting suspect, 22-year-old Kenneth Desmond Davis, walked up and started to argue with Cary, then pulled a gun out of a backpack and opened fire at both of them.\nJohnnie then pulled his gun and returned fire. The child, 10 years old, was struck during the exchange of gunfire. Davis was found inside a nearby home and taken into custody. He's been charged with two counts of aggravated assault with a deadly weapon.\nJohnnie and Cary Taylor were taken to Covenant with non life-threatening injuries. The 10-year-old was taken to UMC. His injuries were also not considered life-threatening.\nCopyright 2016 KCBD. All rights reserved."}