{"uri": "http://www.ksla.com/story/33297074/teen-fatally-shot-in-attempted-carjacking-identified", "title": "Teen fatally shot in attempted carjacking identified", "dct": "Mon, 03 Oct 2016 03:48:00 GMT", "id": "9123e98289e0a8b9b6e7b4f05a38b26d", "content": "SHREVEPORT, LA (KSLA) -\nThe teen fatally shot outside a Shreveport convenience store during an attempted carjacking Saturday has been identified as 16-year-old Grandson Johnson of Shreveport, according to the Caddo Parish Coroner's Office.\nClick here for updated jail bookings in Caddo and Bossier Parishes.\nMore\nShreveport police are investigating the fatal shooting, which happened at 11:41 p.m. in the parking lot of the Circle K in the 300 block of Kings Highway in Shreveport's Highland neighborhood.\nPolice say Johnson and a 17-year-old were shot after approaching a man who was sitting in the passenger seat of a truck that had just pulled up to the store after the driver had gone inside.\n\"During that time, two individuals walked up to the vehicle, to the victim's truck, pointed a gun at the victim, ordered him out,\" said SPD spokesman Cpl. Marcus Hines\nPolice say the two suspects got into the vehicle.\n\"The victim, unbeknownst to the suspects, was armed. And he managed to fire rounds, striking both suspects, killing one and seriously injuring the other suspect,\" said Hines.\nPolice say Johnson died at the scene. Medics rushed the 17-year-old to University Health hospital with life-threatening injuries. At last check, he was listed in critical but stable condition.\n\"I was fixing to go in the house and go to bed and then, 'bam, bam, bam, bam, bam, bam!'\" recalled Cathy Walhof, who lives just half a block from the site of the deadly shooting.\nWalhof later found out what happened and told us this kind of violence is alarming.\n\"Scary. We were just sitting in the backyard talking last night about how quiet it was around here. And, it's not quiet no more.\"\nThe identity of the attempted carjacking victim has not been released, but Hines said charges are not pending against him.\n\"Someone pulls a gun on you and orders you out of a car, you have every right to defend yourself.\"\nLes Wallace, a Louisiana State Police conceal carry instructor, agrees.\n\"This individual was obviously afraid for his life, had two people coming at him as aggressors.\"\nAccording to the Caddo Parish Coroner's Office, Johnson was identified through information gained from the his personal properly and his identity was confirmed by family members contacted by Shreveport police.\nThe name of the 17-year-old suspect has not been released.\nCopyright 2016 KSLA. All rights reserved."}