{"uri": "http://www.ktva.com/teen-charged-grunwald-murder-listed-suspect-separate-death-investigation-870/", "title": "Teen charged in Grunwald murder listed as ‘suspect’ in separate death investigation", "dct": "Fri, 13 Jan 2017 20:19:00 GMT", "id": "9ed2ceff66b9dd55aff1865048895ecc", "content": "WILLOW –\n“New information” has prompted Alaska State Troopers to reopen the case of the death of 16-year-old Frank Woodford. The teen was found shot in the chest over the summer at a home in Wasilla, according to an AST incident report.\nThe two people in the room with him at the time of the shooting were Austin Barrett and Damien Peterson, trooper Jared Noll wrote in the report.\nBarrett, 19, is one of the teens charged in connection with the death of David Grunwald. Peterson, 19, is the brother of Devin Peterson, another teen charged in the Grunwald death investigation.\nJust after midnight on June 27, 2016, Noll responded to the shooting, where he found Frank Woodford “on the floor of a downstairs bedroom with an apparent gunshot wound to his chest.”\nWhat follows in Noll’s report is an interaction between him and the injured teen:\nI asked [Woodford] what happened and he replied he didn’t know. I asked him again and he stated he didn’t shoot himself. At that point, one of the medics spoke to [Woodford] and stated “You are not going to survive [t]his, we need to know what happened.” [Woodford] reiterated that he did not shoot himself.\nFrank Woodford was then taken to the hospital, where he later died. When his mother, Michelle Woodford, was finally able to read the incident report last week, she says her grief turned into disbelief.\n“I know he didn’t [shoot himself],” she said of her son. “He would’ve never done that. When I read that, it upset me. I mean, I know my son wouldn’t have done that.”\nThe incident report goes on to detail that both the “property custodian” and “a large number of juveniles” were among those in the home when the shooting happened. After hearing the gunshot, the teens initially fled the scene and later returned, the report says. When troopers interviewed Barrett, he said there was a gun on the bed and Frank Woodford asked Peterson if he could play with it.\n“[Barrett] stated he was looking at a tablet when suddenly he heard a boom and [Woodford] was next to him with blood everywhere,” the report states.\nWhen Peterson was later interviewed by troopers, he said Frank Woodford picked up the gun and “the shot went off about 4-5 minutes later.”\nIn the report, both Barrett and Peterson are classified under the term “suspect.” But troopers also noted, “at this time there is no conclusive evidence of foul play. Case closed pending further investigative leads.”\nAST won’t say exactly what “new information” is causing them to take a second look at the teen’s death or how that information was was obtained.\n“Troopers will investigate the validity of the information,” said spokesperson Megan Peters in an email Friday. “At this time we are not providing details regarding the case as it is under review.”\nMichelle Woodford describes the way AST handled her son’s death investigation as “pretty messed up.”\n“To me, it was like it was just cast aside,” she said of the case. “Why didn’t they do stuff then instead of now?”\nMichelle also notes the connection to the Grunwald case with remorse, adding that a life could’ve potentially been saved.\n“If [troopers] would’ve done their job, probably this boy wouldn’t have died,” she said of the Palmer teen. “Now that this case is open with Grunwald, all of a sudden they want to start interviewing people. I mean, I’m glad it’s coming to light. I’m really glad for that. And I hope something is done, because I don’t feel justice is served yet.”\nAST’s Major Crimes Unit has taken over Frank Woodford’s case. His mother says she hopes the next update from troopers will be answers to an unexplained death she still has questions about.\n“I miss him so much … It still feels like he’s going to call every day,” she said. “And he’s not.”\nKTVA 11’s Sierra Starks can be reached via email or on Facebook and Twitter."}