{"uri": "http://www.sfgate.com/crime/article/Gunfire-near-E-Palo-Alto-restaurant-hurts-6-4490230.php", "title": "E. Palo Alto: Shots hurt 6 near McDonald's", "dct": "Sun, 05 May 2013 00:00:00 GMT", "id": "af2c0b88275056546795a9ca9fc519fc", "content": "Six people, including an elderly woman and her 6-year-old granddaughter, were wounded Sunday afternoon when two men in a passing car fired a dozen gunshots into an East Palo Alto bus stop, police said.\nInvestigators believe the brazen daylight shooting on Bay Road near University Avenue was gang-related and that the four men who were wounded were the intended targets, said East Palo Alto Police Capt. Carl Estelle.\nPolice were searching for two young men who were seen in an early 1990s car that sped away from the scene. Five people were taken to Stanford Medical Center for treatment, but none of the victims had life-threatening injuries and all are expected to recover, police said.\nThe city's ShotSpotter technology detected the shooting at 2:48 p.m. at a bus stop in front of a McDonald's restaurant.\nThe victims were waiting for a bus when a sedan, described by witnesses as either silver or green, pulled up in front, Estelle said. Twelve shots were fired as the victims scrambled for cover, he said.\nThe grandmother was hit by a bullet or bullet fragments, but not seriously injured, said police Capt. John Cook.\nHer granddaughter was injured by shattered glass when she fell trying to run away from the chaotic scene, Cook said.\nWillie Te'o, 15, who lives in the area, said he was across the street when the gunshots rang out.\n\"I was walking from McDonald's when I heard three to four shots right behind me,\" he said. \"I thought it was fireworks for Cinco de Mayo, but after I heard the fourth shot, I knew it was guns and I ran as fast as I could.\"\nMenlo Park Fire Protection District Chief Harold Schapelhouman said he was particularly disturbed by the fact that the shooting occurred in daylight in an area that was normally crowded with people. He said a Cinco de Mayo celebration was being held at the nearby Green Oaks Academy elementary school.\n\"This is clearly unacceptable to everyone in the community,\" he said.\nEstelle said hopes someone will offer information on the shooters \"and help us do our job,\" especially because one of the victims is a young girl.\nEllen Huet and Benny Evangelista are San Francisco Chronicle staff writers. E-mail: ehuet@sfchronicle.com, bevangelista@sfchronicle.com"}