{"uri": "http://www.timesunion.com/local/article/Teen-gunned-down-in-Schenectady-9226763.php", "title": "Teen mother slain Schenectady, leaves child, 2", "dct": "Fri, 16 Sep 2016 00:00:00 GMT", "id": "972ba8e3e0252b6ab686214a5ed51904", "content": "SCHENECTADY – Keya Bibbs and her husband, DeShun Lewis, were in bed when they heard two gunshots, followed by wailing Thursday night.\n\"I heard her say, 'Mommy! Mommy!' Then her mother started screaming,\" Bibbs said. Amid her cries, the mother screamed, \"He killed my daughter!\" Lewis said.\nIn the second-story apartment next door, 17-year-old Medina Knowles died from a gunshot to the head.\nA suspect had not yet been identified and no arrests had been made by late Friday, police said.\nEarlier in the day, police spokesman Lt. Mark McCracken reiterated that Schenectady police responded at 11:30 p.m. to reports that someone had been shot inside a second-floor apartment at 524 Schenectady St. However, he declined to comment on developments in the case, citing the ongoing investigation.\nKnowles was pronounced dead in the duplex, breaking the hearts of family and friends and becoming the third shooting victim — and second fatality — on the block in a little more than a year.\nShe leaves behind a 2-year-old son, Jahsiy.\nAs Bibbs stood shivering on her porch overlooking the crime scene early Friday morning, she described how events unfolded. Bibbs ran outside to console Knowles' mother, who led her to her upstairs apartment. Knowles \"was lying in bed,\" Bibbs said, covering her eyes. \"I've been throwing up all morning.\"\nPolice said it appeared the teen was shot once. An autopsy was scheduled for Friday afternoon.\nThe apartment's lights were on in the pre-dawn hours and evidence technicians could be seen working inside the building. Investigators searched for evidence throughout the morning, with patrol officers stationed outside.\n\"Everything was normal yesterday,\" Lewis said. \"She was just out walking with her son at maybe 4 o'clock.\" Friday morning, the baby stroller was still outside 524 Schenectady St.\nFamily and others present at the time of the shooting, including Bibbs, were interviewed at the police station.\nThe victim's aunt arrived at the home in tears around 8:30 a.m., looking for her family. \"She was a good person,\" said the woman, who declined to give her name. \"I don't understand how this could happen. She wasn't in the streets or involved in anything.\"\nIn her final hours, Knowles posted on Facebook over a dozen times about relationships, spurned exes and conflict with other women. She wrote in a status update, \"I Was Never Scared Of Nobody Daughter Honestly. Always Ready For War.\" She reposted numerous photos Thursday morning, including one that said, \"Don't waste your time on revenge. Those who hurt you will face their own karma.\"\nNext-door neighbor David Clark said he knew the victim. He said she lived in the apartment with her 2-year-old son. pic.twitter.com/2IEGwuu3GP\n— Emily Masters (@emilysmasters) September 16, 2016\nNext-door neighbor David Clark said he also knew Knowles and her son. Clark said the victim lived with her mother and two sisters.\n\"I've got three kids upstairs,\" Clark, 52, said. \"It's scary. It happens all the time around here.\"\nThree doors down from Thursday's crime scene is a memorial for another homicide victim. Dozens of Hennessy cognac bottles and prayer candles were clustered on the sidewalk in remembrance.\nOn July 27, 2015, Kusaan Tolliver, 18, was shot and killed on the street. The teen, who was found with a gunshot wound to the upper body, later died at Ellis Hospital.\nHis death occurred four days after another man was shot in the buttocks on the same block of Schenectady Street. He survived.\n\"I'm going to move,\" said Anais Gonzalez, 20, who lives with her daughter in the apartment downstairs from the homicide scene. \"It's not a good environment for kids to grow up in.\"\nAnother neighbor who declined to give her name said her children know the victim's son. She said she does not let her children play outside because of fear of random violence.\n\"It's horrible,\" the neighbor said. \"We live here for the cheaper rent.\"\nAs the sun rose, a young girl wearing a pink coat, backpack and pigtails came out from a neighboring home and waited for the school bus next to the crime scene tape. When adults discussing the shooting hushed their tones and asked where the girl's mother was, she said, \"Why? I hear gunshots all the time around here.\"\nThe neighborhood is waking up for school and work. One child waits for her bus next to the scene of fatal shooting.\n— Emily Masters (@emilysmasters) September 16, 2016\n\"I don't understand how this could happen,\" victim's aunt said. \"She wasn't in the streets or involved in anything.\" pic.twitter.com/Rs5SVIVtm4\n— Emily Masters (@emilysmasters) September 16, 2016\nemasters@timesunion.com • 518-454-5467@emilysmasters"}