{"uri": "http://baltimore.cbslocal.com/2015/10/06/at-least-2-shot-in-baltimore/", "title": "5, Including Teenager, Shot In Baltimore", "dct": "Tue, 06 Oct 2015 23:12:00 GMT", "id": "1db0e39c4bcf0c93734006369a736a31", "content": "BALTIMORE (WJZ) — Police are searching for information about a lone gunman who they say shot five people in broad daylight. The violence follows another multiple shooting days earlier.\nChristie Ileto has more on the investigation.\nPolice have no suspect and no clear motive but believe at least one of the five were targeted. Now they’re hunting who pulled the trigger.\nInnocent eyes and a maze of yellow tape after gun violence hit Penrose and Payton.\n“I heard the continuous bam bam bam bam,” said resident Sylvia Roy.\nA flurry of emergency calls followed.\nFive were shot in broad daylight; the youngest was 17. Detectives say at least one was targeted.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\n“A lone gunman came around the corner, fired a number of shots at the individuals and then took off on foot,” said Lt. TJ Smith.\n“I see him grab his stomach and go to the ground,” said one witness.\nHe didn’t want his face on camera but tells WJZ he witnessed the aftermath.\n“He was just hollering, `When is the ambulance going to get here? When is the ambulance going to get here?'” he said.\nThe shooting happened just up the corner, literally a block away from an elementary school that had recently dismissed students.\n“It’s frightening and it’s around the time kids are coming home from school,” said one neighbor.\nAnd it’s becoming too common, residents say.\nTuesday’s violence comes four days after a handful of people were shot in a city strip mall parking lot.\n“It’s sad. I’m tired of hearing about it, for real,” said one resident.\nBut it’s a grim reality even for some of the city’s youngest residents, coming home to flashing lights and evidence markers.\nPolice say the victims were shot in their lower bodies and have non-life threatening injuries.\nAnyone with information can call Metro CrimeStoppers at 1-866-7-LOCKUP."}