{"uri": "http://www.democratandchronicle.com/story/news/2015/08/22/live-blog-rochester-police-press-conference-genesee-street-shooting/32205715/", "title": "Cops: Man fired at Genesee St. gunman", "dct": "Sat, 22 Aug 2015 00:00:00 GMT", "id": "05994181b9358465db56c7a25985be8c", "content": "Police have arrested a 32-year-old city man for allegedly firing at the vehicle in last week's drive-by shooting at the Boys & Girls club on Genesee Street.\nBut whoever fired into the crowd — killing three and injuring four others — remains at large, authorities said Saturday. And that had Mayor Lovely Warren and others making impassioned pleas for witnesses to speak up.\n\"The information that we have currently is not enough,\" Warren said during a late-afternoon news conference at the Public Safety Building.\n\"I'm begging you. I'm asking you for this community, if you know something, please come forward. The victims and their families deserve justice. They deserve it. And I know that there is someone out there that can help us bring these individuals to justice and give these families peace of mind.\"\nQuartermaine D. Titus, 32, allegedly was caught on video firing a .22-caliber handgun at the scene on Wednesday. Titus was arrested late Friday for felony criminal possession of a weapon, arraigned Saturday morning and remains in the Monroe County Jail. He has prior misdemeanor and felony convictions, but none for weapons charges, said District Attorney Sandra Doorley.\nPolice Chief Michael Ciminelli declined to say whether police suspect Titus or those in the vehicle fired first, nor to discuss any further detail of the case. But authorities do not think Titus is responsible for the slayings of Johnny Johnson, 25, Jonah Barley, 17, and Raekwon Manigault,19, nor for injuring the other four people.\n\"The shooter or shooters remain free, and we need help,\" Doorley said, similarly focusing her message on potential witnesses: \"We are asking you, we are begging you, to come to us.\"\nDoorley later said that the pleas for assistance should not be interpreted as meaning authorities are concerned they won't close the case. Rather, there is a process to build a solid case to not just secure an arrest but a conviction.\nIn this case, she said, the crowd had attended a basketball game that was part of an anti-violence initiative. People of all ages, including a 9-year-old child, were among those fired upon.\n\"The violence we have seen this summer is unacceptable, and has to stop,\" she said. \"This tragedy could have been far worse.\"\nCiminelli said tipsters can remain anonymous, and police will make arrangements to talk in a safe and confidential manner. He reiterated that there is a reward of up to $10,000 for information leading to the arrest and successful prosecution of the crimes. Police have gotten cooperation from the community already, but Warren said \"some people are afraid to come forward.\"\n\"Now is the time to be outraged enough to stand up,\" the mayor said. \"We must do this together.\"\nBDSHARP@DemocratandChronicle.com"}