{"uri": "http://www.cleveland.com/metro/index.ssf/2015/10/father_arrested_after_4-year-o.html#incart_river", "title": "Father arrested after 4-year-old son shot in shoulder on Cleveland's East Side", "dct": "Thu, 29 Oct 2015 14:12:40 GMT", "id": "a8ef41cc841fa20113c9e9ad1b382e84", "content": "(File photo)\nCLEVELAND, Ohio -- A man was arrested at his home Wednesday afternoon after his 4-year-old son was shot in the shoulder.\nPolice responded to a call about 5:30 p.m. Wednesday of a boy shot at a home on the 6600 block of Bliss Avenue in the city's St. Clair-Superior neighborhood, Det. Jennifer Ciaccia said.\nThe boy was taken to Rainbow Babies and Children's Hospital, Ciaccia said. He remains at the hospital with his mother as of 7:30 p.m. His injuries do not seem to require surgery.\nThe boy's father initially told police that his son was shot in a drive-by, Ciaccia said. The man's story then changed, saying that a 5-year-old had accidentally shot the boy.\nPolice soon determined that the boy was shot inside the home, and they believe that the father might have accidentally shot his son, Ciaccia said. The man was arrested for endangering children and weapons charges.\nGunshot residue tests were conducted, and the incident remains under investigation.\nThe shooting represents the latest in a string of gun violence involving children.\nA 6-month-old baby girl died earlier this month after she was shot on Cleveland's East Side.\nA 15-year-old boy died in surgery Sunday after a drive-by shooting on Wade Park Avenue near Martin Luther King Jr. Drive.\nRamon Burnett, a 5-year-old boy, died in September after he was shot during a drive-by shooting outside his grandmother's home. Major Howard, 3, died in a shooting two weeks after Burnett.\nSeveral children were also injured in shootings since the summer. Four were shot over the Fourth of July weekend.\nA 7-year-old boy was shot while sitting in a car in mid-September.\nCleveland.com has reached out to Cleveland police Chief Calvin Williams and Mayor Frank Jackson for comment. City officials have not responded to the request."}