{"uri": "http://www.recordnet.com/news/20160906/slain-teen-identified-police-say-double-shooting-had-gang-component", "title": "Slain teen identified, police say double shooting had 'gang component'", "dct": "NODATE", "id": "da7f818dc11ed18ccc6fedf6bf21692e", "content": "STOCKTON - Police investigators have determined that Sunday afternoon's drive-by shooting on a street corner in Conway Homes that took the life of a 16-year-old Edison High School student and left another 16-year-old student wounded is connected in some way to gang activity.\nOn Tuesday, the San Joaquin County Coroner's Office positively identified the fatal victim as Elian Christian Calvo of Stockton.\nThe Record is withholding the name of the second student because he is both a victim of a violent crime and a minor. He was transported to an area hospital for treatment of a gunshot wound and has reportedly been released.\nPolice spokesman Officer Joe Silva would not elaborate on investigators' latest discovery, only stating that \"there was a gang component to the shooting.\"\nPolice indicated that gunfire from a vehicle was reported about 4:20 p.m. Sunday at the residential intersection of Dallas and Connecticut avenues in the Conway Homes neighborhood of southwest Stockton, just north of the city's Van Buskirk Municipal Golf Course.\nNo suspect information had been released as of late Tuesday.\nA family member was adamant Sunday that Calvo was not involved with a gang. The family member described him as a young man who liked music, played handball and was \"just hanging out\" when the shooting occurred.\nAfter police left the area, a makeshift memorial was established at the corner near the shooting and included a photo of Calvo, more than three dozen vigil candles, a couple of rosaries, flowers, a neon-green stuffed bear, Top Ramen chicken soup and bottles of Jose Cuervo Gold Tequila and Amsterdam Vodka.\nNotes were written on a wall and sidewalk offering condolences with messages such as \"RIP Elian 'Lil E,' \" \"Rest Easy Bro\" and \"Elian Block.\"\nBy Tuesday afternoon, the memorial had been removed.\nSilva said the Police Department's Neighborhood Impact Team would be back in the area in coming days going door to door to meet and speak with residents.\nConsisting of uniformed officers, community service officers, cadets and chaplains, team members conduct outreach to areas impacted by crime and violence and serve as a sounding board for residents to let police know of their concerns.\nAs school resumed Tuesday following the Labor Day holiday, Edison High had grief counselors on site for any students who felt the need to talk about losing a classmate. Counselors were also out at Taylor Elementary, where Calvo had younger siblings, according to Edison Principal Brian Biedermann.\nAfter struggling with prior academic problems, Biedermann said Calvo had been looking forward to a fresh start to his sophomore year at Edison.\n\"He seemed to have his life back together and wanted to buckle down,\" Biedermann said. \"He realized 'OK, I can't let that happen again,' and he told me he wanted to graduate and move on. It's just super sad.\"\nAt the request of Calvo's peers, a moment of silence was held during Tuesday's student announcements.\nRecord reporter Nicholas Filipas contributed to this report.\n- Contact reporter Joe Goldeen at (209) 546-8278 or jgoldeen@recordnet.com. Follow him at recordnet.com/goldeenblog and on Twitter @JoeGoldeen."}