{"uri": "http://www.seattletimes.com/seattle-news/crime/2-teen-brothers-to-face-adult-murder-charges-in-jungle-shooting/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_seattle-news", "title": "Teens charged in Jungle shooting grew up amid tumult, drug deals", "dct": "Fri, 05 Feb 2016 07:32:00 GMT", "id": "226f7c11bdcbdd47bd6f4e85a40bb50b", "content": "The three teenage brothers charged with murder and assault in connection with last week’s deadly shootings in The Jungle have had tumultuous childhoods marked by family upheaval and drug-dealing parents, according to court records.\nThe King County Superior Court records indicate the family moved to the Seattle area from California in 2002 when the two older boys were preschoolers and the youngest still a baby. But their father has a criminal history here that dates to the mid-1990s, the records show.\nThe brothers are all wards of the state and each was wanted on a “run warrant” for leaving various placements by the state Department of Health and Social Services (DSHS) when they were arrested Monday, King County Prosecuting Attorney Dan Satterberg said during a Thursday news conference.\nAll three boys were each charged Thursday with two counts of first-degree felony murder and three counts of first-degree assault, Satterberg announced. Each charge also carries a firearms enhancement.\nPlay VideoPlayMuteCurrent Time 0:00/Duration Time 0:00Loaded: 0%Progress: 0%Stream TypeLIVERemaining Time -0:00Playback Rate1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptionsAudio TrackFullscreen\nThis is a modal window.\nCaptions Settings Dialog Beginning of dialog window. Escape will cancel and close the window. Text Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps Defaults Done\nThe older boys, James Taafulisia, 17, and Jerome Taafulisia, 16, will be prosecuted in adult, or superior, court “due to the seriousness of the crimes,” Satterberg said.\nThe teens both face potential prison sentences of 90 to 113 years if convicted as charged, but because they are under 18, a state law passed two years ago would require that their sentences be reviewed after they serve 20 years, Satterberg said.\nThe third brother, 13, will be prosecuted in juvenile court on the same charges, Satterberg said. Though his older brothers are the suspected shooters, Satterberg said the younger boy was a “full participant” in the alleged crimes. If convicted, prosecutors will seek to have him held in juvenile confinement until he is 21, he said.\nThe Seattle Times generally does not identify juvenile suspects unless they are charged as adults.\nThe Taafulisia brothers are accused of opening fire on a group of people at the homeless encampment south of downtown Seattle on Jan. 26 to settle a $500 drug debt owed to their mother, Seattle police allege.\nWitnesses identified the Taafulisia brothers to police, who then employed informants to record conversations in which they acknowledged the shooting, police say. The brothers also sold a .45-caliber handgun, one of two weapons used in the shootings, to an informant, police say.\nSatterberg said the investigation will determine whether the boys’ mother could face criminal liability in The Jungle shootings. She’s regarded as a “crucial witness,” he said.\n“The investigation into her role in this is continuing,” he said. “There’s a lot of work that still needs to be done.”\nWhen Satterberg was asked Thursday about the drug-debt motive, he said that investigators “don’t have solid evidence for that theory.”\nThe mother’s parental rights were terminated, but Satterberg did not know when that happened. A DSHS spokeswoman said the agency is unable to release details about the boys’ cases because of federal privacy laws.\nThe boys’ father is a reputed gang member and methamphetamine dealer who is now serving a 4 ¼-year prison term for a variety of crimes committed between 2011 and 2014, according to court records and the state Department of Corrections.\nAs of 2013, he owed his sons’ mother — as well as the mother of his two older daughters — a combined $75,000 in unpaid child support, the records say.\nThe boys’ mother, who completed drug court in 2008 after her arrest four years earlier for selling crack cocaine in Occidental Park, accused her children’s father of being violent and threatening to kill her in a protection-order petition filed in 2003, court records say.\nThe couple also have a 12-year-old daughter together who has lived with an aunt and uncle for the past few years, the records say.\nAccording to charging documents, the boys’ mother was pulled over in a traffic stop at the same time her sons were being arrested by a SWAT team on Monday at a homeless camp.\nShe told detectives that on the day of The Jungle shooting — her 37th birthday — her older boys told her they were planning to do a “lick,” street slang for a robbery, on a drug dealer known as “Phats,” the charges say. But she didn’t think they were serious and told them not to do it, according to the charges.\n“She also admitted that she and her sons had lived in The Jungle for a short time before moving out of there in the last year,” say the charges.\nSatterberg said the boys were familiar with The Jungle and were able to move freely around the homeless encampment.\nHe said he didn’t know where they were living at the time of the shootings since they moved between various motels and homeless-camp sites.\nKilled in The Jungle were Jeannine L. Zapata, 45, and James Quoc Tran, 33, who had reportedly gone to The Jungle to visit friends. Three others — a man and two women — survived and remain hospitalized. Tran was shot twice with the .45, while Zapata — who also went by the last name Brooks — was found dead in a tent, shot once with the. 45 and once with the .22, Satterberg said.\nOne witness said the shooters were apparently after drugs and cash and had targeted a homeless man known as “Phats.”\nThe three surviving victims were interviewed by detectives at Harborview Medical Center. Two couldn’t identify a gunman from a police-photo montage but one man picked James Taafulisia as the suspect who “pulled the trigger” and shot him, the charges say.\nPolice allege James Taafulisia was armed with a .45-caliber handgun and Jerome Taafulisia carried a .22-caliber handgun when they went to the camp just after 7 p.m. Jan. 26, charging papers say. The 13-year-old brother also told the informants he was at The Jungle during the shootings.\nPolice say the Taafulisia brothers took about $100 worth of black-tar heroin and $200 or $300 in cash.\nDuring the news conference, Seattle Assistant Police Chief Robert Merner said investigators also are looking into the brothers’ possible connection to a string of violent crimes in the Sodo neighborhood.\nSatterberg said the .45-caliber handgun used in the shootings had been stolen in a 1976 burglary in Seattle. When the boys were arrested, police recovered marked “buy money” used by the informant to purchase the gun from the 13-year-old, he said.\nThe second weapon, a .22-caliber handgun, was found in the brothers’ tent after their arrest Monday at an encampment near Fourth Avenue South and Royal Brougham Way, Satterberg said. The weapon’s serial number is illegible, making it difficult to trace, he said.\nThe shootings have added a sharp edge to the city’s dialogue over how to confront homelessness, recently highlighted by Mayor Ed Murray’s declaration of a state of emergency.\n“It’s time to envision a Seattle without The Jungle,” Satterberg said during Thursday’s news conference.\nSatterberg said conditions in The Jungle are “highly unsanitary” and dangerous.\n“It’s worse than Third World conditions,” where crimes are “vastly unreported.”"}