{"uri": "http://www.king5.com/story/news/local/seattle/2016/01/26/seattle-police-responding-shooting-airport-way-s/79383148/", "title": "Victims in Seattle homeless camp shooting identified", "dct": "Wed, 27 Jan 2016 00:00:00 GMT", "id": "48d34f4010f2f3f0af859430ad60f52d", "content": "Two people were killed and three were hurt in a shooting at a homeless encampment south of downtown Seattle Tuesday night.\nThe King County Medical Examiner identified the victims as James Q. Tran, 33, and Jennine L. Brooks, 45.\nSeattle Police say at around 7:15 p.m. Tuesday, they received reports of gunfire near the 1500 block of Airport Way South.\nOfficers began searching a greenbelt where there is a homeless encampment known as \"The Jungle,\" and found the five victims.\nOne man was dead at the scene, four victims were taken to Harborview Medical Center. Their ages range from 25 to 45.\n\"We've got gunshot wounds to the chest, the abdomen,\" said Harborview spokeswoman Susan Gregg.\nOne of the four died at the hospital. The other three were listed in serious condition in intensive care Wednesday morning.\nPolice say all of the victims lived at the camp.\n\"The scene is a tent, and multiple shots were fired up there,\" said Seattle Assistant Police Chief Robert Merner.\nPolice are searching for two \"persons of interest\" in the shooting. They did not release any further information about the suspects.\n\"We have reason to believe it was very targeted,\" said Merner.\nThe Seattle Department of Transportation said Airport Way was expected to be closed well into the night and possibly into the morning.\nSeattle Police Chief Kathleen O'Toole said they have several leads and are interviewing witnesses.\n\"As soon as we can release the information we will,\" she said.\nOne witness told KING 5 he saw at least six people dressed in black arrive on bikes. He said up to 10 shots were fired.\nSeattle Mayor Ed Murray was told about the shooting just after had given a special address on the issue of homelessness at Mary's Place Family Center in North Seattle.\nLater, at a press conference at the scene of the shootings, Murray said \"We are involved in a homeless crisis, the likes that we have not seen since the great depression.\"\nMurray said his emergency order to expedite the creation of two safe lots for homeless people who live in RVs or cars, issued last week, was not a gimmick.\n\"It was an actual plea that Seattle by ourselves cannot deal with this crisis. It was an actual plea to the state and federal government to assist us,\" he said.\nSeattle Mayor Ed Murray\nMurray said the area known as the jungle, which is on state right-of-way, has been \"unmanageable and out of control\" for almost two decades.\n\"I spoke with the governor and with the county executive and all three governments, in the next 48 hours, will launch an assessment of state right-of-way connected to I-5 through the city of Seattle,\" said Murray.\n\"No city in America can deal with a crisis this large without our state and federal partners stepping up,\" said Murray.\n\"The whole point of my speech tonight and the declaration of emergency is that… and one of the arguments we're having in this city… is that one of the things we have to do is we have to go into these encampments on state right-of-way, offer people services, clean the place up and try and get people out,\" he said. \"This area was actually marked for that process tomorrow.\"\n\"Let me reiterate there is no single answer,\" said Murray. \"It's going in, it's offering services, if people are breaking the law it's arresting those people, it's cleaning up the garbage, the human waste and the needles. And it's not going to be easy given the size of this crisis.\"\n\"You can't help but wonder - I can't help but wonder - did I act too late,\" he said. \"Maybe I should have issued the state of emergency months earlier. We've tried to do the best that we can given the circumstances we have, but obviously I'm going to question was I good enough at my own job. It's on me in the end.\""}