{"uri": "http://www.seattletimes.com/seattle-news/crime/3-suspects-in-jungle-shooting-to-appear-in-court-tuesday/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_crime", "title": "Mom’s drug deal brought sons to Jungle, police say", "dct": "Fri, 05 Feb 2016 10:18:00 GMT", "id": "c7860caf12cf24541fc4772a057ea717", "content": "Three teenage brothers accused of killing two people and wounding three others in The Jungle had gone to the homeless encampment to settle a $500 drug debt owed to their mother, Seattle police allege in newly released documents.\nWitnesses to the Jan. 26 shooting identified the boys to police, who then employed informants to record conversations in which the suspects acknowledged the shooting, police wrote in an affidavit of probable cause that outlines the case against the defendants. The brothers also sold a .45-caliber handgun, one of two weapons used in the shootings, to an informant, police allege.\nA King County juvenile judge on Tuesday found probable cause to hold the brothers, ages 13, 16 and 17, on investigation of two counts of felony murder and three counts of first-degree assault, as well as for unlawfully possessing firearms.\nThe two younger siblings waived their appearances at the court hearing in the King County Youth Services Center.\nThe oldest boy, however, was in court. He appeared calm as he looked around the packed courtroom. When he saw the only person he appeared to know, a woman who was crying, he mouthed something to her and shook his head.\nAs he was led out, he said, “I love you,” and she answered, “I love you, too.”\nShe later acknowledged to reporters that she was the 17-year-old’s girlfriend, but declined further comment.\nThe judge ordered the siblings to have no contact with each other or their mother after Senior Deputy Prosecutor Stephen Herschkowitz said that she could prove to be a material witness. When the teens’ defense attorneys objected, the judge said the issue could be revisited at the boys’ next court appearance Friday.\nThe Seattle Times is not naming the boys because they have not been charged.\nThe two older boys have felony juvenile records, while the youngest brother was arrested in September for making a false statement to a police officer, a misdemeanor charge, according to court records. All three had been reported missing last year, according to reports.\nWitnesses told police a group of at least two and up to five masked men approached a group seated by a fire at The Jungle just after 7 p.m. and opened fire. Jeannine L. Zapata, 45, and James Quoc Tran, 33, died of multiple gunshot wounds.\nThree others — a man and two women — survived.\nOne witness said the shooters were apparently after drugs and cash and had targeted a man known as “Phats.”\nAccording to the affidavit released by the King County Prosecuting Attorney’s Office after Tuesday’s hearing, an informant identified the boys to police shortly after the shooting. The informant said the boys and their mother lived in a tent near Safeco Field.\nPolice, in the probable-cause paperwork, said they are familiar with the family and say that some in their group may have been involved or associated with several robberies and shootings, as well as a homicide in October. Police did not provide additional details about the October slaying.\nPolice obtained a court order permitting them to record a conversation between two informants and the three brothers, officers wrote in the affidavit. The informants set up a meeting with the brothers Saturday in downtown Seattle.\nAfter being dropped off at the meeting by their 37-year-old mother, the brothers told the informants they had gone to The Jungle to complete a drug deal with one of the victims, police wrote in the affidavit.\nPlay VideoPlayMuteCurrent Time 0:00/Duration Time 0:00Loaded: 0%Progress: 0%Stream TypeLIVERemaining Time -0:00Playback Rate1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptionsAudio TrackFullscreen\nThis is a modal window.\nCaptions Settings Dialog Beginning of dialog window. Escape will cancel and close the window. Text Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps Defaults Done\nThe oldest brother said he was armed with a .45-caliber handgun and the 16-year-old carried a .22-caliber handgun when they went to the camp on Jan. 26, according to the affidavit.\nPolice wrote that the 13-year-old brother told the informants he was at The Jungle during the shootings and “laughed” as he described what he saw. Police said the brothers told the informants they took about $100 worth of black tar heroin and $200 or $300 in cash, the affidavit said.\nA third informant who contacted police said the boys told him they had gone to the Jungle to collect a drug debt for their mother, police said in the affidavit.\nThe brothers brought the .45-caliber handgun to the Saturday meeting and offered to sell it to the informants, police wrote in the probable-cause paperwork. When asked about the other handgun, the brothers said it belonged to their mother and that they would have to ask her if she would be willing to sell it, the documents said.\nPolice said they directed the informants to buy the .45-caliber gun, which was turned over to investigators after the purchase. Police compared the weapon to shell casings recovered at the crime scene, and the casings matched, the paperwork said.\nThe boys were arrested Monday afternoon at a small homeless camp on Fourth Avenue South beneath an Interstate 90 offramp, according to police.\nAfter being arrested, two of the brothers denied being in The Jungle at the time of the shootings.\nWhen police told the youngest suspect that his brothers told a different version of events, the boy explained that they entered The Jungle through an access road and took another path out when they left, paperwork said. He said their mother was angry at them when she found out about the shootings, police wrote in the affidavit.\nBecause of their ages, the two older boys’ cases likely will be automatically transferred out of juvenile court to adult, or superior, court.\nIn September, the 13-year-old was stopped by a Seattle police officer in Pioneer Square and repeatedly gave him a false name, but was identified as the missing youth by fingerprints, court records say. The boy finally acknowledged he lied “because he hates going to jail,” the records say.\nIn February 2014, the now-16-year-old was charged with robbery for stealing a backpack from a fellow middle-school student while armed with a Taser, court records say. Last February, he and a couple friends carjacked a taxi cab in SeaTac, threatening the driver with what turned out to be a pellet gun and leading police on a pursuit that he later told an officer “was fun and exciting,” according to the records.\nThe eldest brother, who was charged last year with making false statements to a police officer, has previous convictions for robbery and theft, primarily committed in 2012 when he was 14, court records show.\nThe 16- and 17-year-old brothers have each been sentenced to 15 to 36 weeks in custody for their previous crimes, according to court records."}