{"uri": "http://wncn.com/2017/01/04/nc-girl-6-killed-as-cousin-11-showed-her-shotgun-he-got-for-christmas-deputies-say/", "title": "NC girl, 6, killed as cousin, 11, showed her shotgun he got for Christmas, deputies say", "dct": "Wed, 04 Jan 2017 20:14:00 GMT", "id": "f34e874abd3d02a8354218ef1eb5de51", "content": "PINETOWN, N.C. (WNCT) – A 6-year-old girl was killed Tuesday after her 11-year-old cousin’s new shotgun went off while he was showing it to her, the Beaufort County Sheriff’s Office said.\nDeputies were called out to a residence in Pinetown around 6 p.m. on Tuesday, and first responders said they found 6-year-old Victoria Whitehurst had died of a gunshot wound.\nThe Sheriff’s Office said Victoria was visiting the home of her 11-year-old cousin and a 12-year-old girl, who are not being named.\nThe boy was showing the two girls a shotgun he got for Christmas when the gun went off, struck and killed Victoria and injured one of the family dogs, deputies said.\nThe dog suffered minor injuries and was taken for medical treatment, the Sheriff’s Office said.\nThose who have visited the family said the 11-year-old is distraught.\n“He’s a good boy,” said neighbor Kaliff Moore. “But, phew, I just can’t imagine how the family is now. We just need prayers up there for them.”\nJennifer Gray, a family friend, said Victoria and the boy were close.\n“They got along great,” said Gray. “They were more like brother and sister a lot of the times because, you know, Victoria was here a lot.”\nNeighbors are in disbelief and want the community to remember the little girl whose life was cut short.\n“We’ve all gotten to know Victoria,” said Gray. “She was here a lot, so we all got to know and love her.”\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}