{"uri": "http://www.abqjournal.com/822705/2-dead-2-injured-in-apparent-shooting-near-wyoming-and-copper.html", "title": "Two killed, two hurt in NE Albuquerque shooting", "dct": "Tue, 09 Aug 2016 07:55:00 GMT", "id": "cd08fda6931266aa3f0cb6dab45bb722", "content": "ALBUQUERQUE, N.M. — Two people were killed and two were left seriously wounded in a shooting inside a Northeast Albuquerque home late Monday night.\nDetails of the quadruple shooting, which left neighbors on edge and wondering why it happened, were few and far between. Albuquerque police have not released any information about the two victims who died or what the motive for the killings may have been.\nNo arrests had been made by Tuesday afternoon, according to Albuquerque police spokesman Simon Drobik.\nOfficers were called to the shooting at a home in the 300 block of General Marshall near Wyoming and Copper around 11 p.m. Monday. Police have not released the names of the deceased, their ages or genders.\nDrobik said the two who were wounded were still alive Tuesday evening but he did not know what condition they were in.\nKendra Westfall, 19, lives nearby and said she was taking out the trash around 11 p.m. when she heard a couple of shots. She ran back inside and the police arrived soon after, she said.\nShe said she sometimes hears gunshots in the area, but there haven’t been any serious incidents that she can remember. The proximity of the killings to her home is scary, she said.\n“I’m in fear of my life,” she said. “I don’t feel safe on this street. I don’t feel safe at all.”\nWestfall said an older man lived at the home and often said hello to her when she walked to a nearby convenience store. She said she had also seen young children at the home.\n“He was a really sweet guy,” she said. “I really hope it’s not him.”\nPlainclothes detectives remained at the crime scene mid-day Tuesday, and a police dog was taken onto the property around 12:30 p.m. Multiple vehicles were parked behind the home.\n– Digital Editor Robert Browman contributed to this report."}