{"uri": "http://www.chicagotribune.com/news/local/breaking/chi-chicago-shooting-violence-20150415-story.html", "title": "Boy, 13, among 7 injured in separate shootings", "dct": "Thu, 16 Apr 2015 03:57:00 GMT", "id": "dc1ebcf12db154861fe0a583562bf572", "content": "(Peter Nickeas, Chicago Tribune)\nAt least seven people, including a 13-year-old boy, have been wounded in separate shootings since Wednesday afternoon on the South and West sides, police said.\nMost recently, a 30-year-old woman was injured in a shooting about 1:40 a.m. Thursday in the 5400 block of South May Street in the Back of the Yards neighborhood on the South Side, said Chicago Police Department spokesman Officer Hector Alfaro.\nThe woman was driving in a vehicle eastbound on 54th Street when she heard gunshots and realized she was struck, Alfaro said.\nShe suffered a graze wound to the back of her head and was able to drive to John H. Stroger Jr. Hospital of Cook County for treatment. Her condition stabilized, Alfaro said.\nAbout 12:10 a.m., a 52-year-old man was wounded during an attempted robbery in the West Garfield Park neighborhood on the West Side, Alfaro said.\nThe man was walking on a sidewalk in the 4700 block of West Maypole Avenue when two male attackers walked up to him and tried to rob him, Alfaro said.\nThe man was shot in the abdomen during the incident. He was taken to Mount Sinai Hospital, where his condition stabilized, police said.\nNo one was in custody, Alfaro said.\nA 13-year-old boy was shot about 10 p.m. Wednesday in the Englewood neighborhood.\nPolice said the boy was in the 5700 block of South Bishop Street when two males approached him on foot and fired shots. The teen was shot in his upper left leg. He was taken to Comer Children's Hospital, where his condition stabilized.\nTwo more teens were shot hours earlier in what may have been a drive-by shooting in the Englewood neighborhood. The shooting happened about 5:15 p.m. in the 700 block of West 74th Street, according to Chicago police spokesman Officer Veejay Zala.\nA 16-year-old boy was shot in the neck, and a 17-year-old boy was shot in the right shoulder, he said. The two were in good condition at Advocate Christ Medical Center in Oak Lawn.\nPolice said the two teenagers were uncooperative. No other details were available.\nFollowing the shooting, officers marked the location of shell casings on 74th Street between Union and Emerald avenues with pieces of paper held in place by rocks and other debris. The shell casings lay in the street west of a silver car that had been shot.\nDetectives and an evidence technician arrived about 6 p.m. Police closed the entire block, which is enveloped on both sides by tall brown-brick apartment buildings, so investigators could work.\nNeighbors looked on, though aside from hearing gunfire, none seemed to know for sure what happened. Gawkers on Halsted Avenue to the west slowed as they rolled through the light at 74th Street, drawing the ire of drivers up the road who honked as people ahead turned their heads toward the shooting scene.\nA man was wounded Wednesday afternoon in a shooting on the Far South Side in the city's Roseland neighborhood.\nAbout 12:05 p.m., police responded to the 300 block of West 107th Street and discovered a 26-year-old man with a gunshot wound to the upper right leg, said Chicago Police Department spokeswoman Officer Janel Sedevic.\nThe man was taken to Roseland Community Hospital, where he was listed in good condition, Sedevic said.\nNo one was in custody. Police were investigating.\nAbout 8:40 p.m., a 16-year-old boy accidentally shot himself in the leg on the West Side, Alfaro said. The boy was in the 1600 block of North Austin Boulevard when he was shot. He managed to get to West Suburban Medical Center for treatment, police said. It was not immediately clear if police took the boy into custody."}