{"uri": "https://www.yahoo.com/news/police-arrest-utah-drive-shooting-9-old-001004827.html?ref=gs", "title": "Police make arrest in Utah drive-by shooting of 9-year-old", "dct": "Fri, 30 Dec 2016 00:00:00 GMT", "id": "cc0e1824bc77dbdf8e23381872ae93ba", "content": "SALT LAKE CITY (AP) — Utah police on Thursday arrested a 19-year-old man in connection with the drive-by shooting of a 9-year-old boy, which left the youth in critical condition.\nA tweet Thursday from the Unified Police official Twitter account announced the arrest of Oscar Bermejo-Zaragoza. Police did not offer further details or return a message seeking more information.\nSalt Lake County jail records show Bermejo-Zaragoza was being held Thursday afternoon on suspicion of aggravated assault and discharging a firearm toward a vehicle.\nPolice say on Wednesday, the 9-year-old boy was sitting with several other children in the backseat of a parked SUV in the town of Kearns, about 15 miles from Salt Lake City, when one shot was fired from a passing car occupied by two men.\nThe bullet went through the SUV's windshield and hit the boy in the head.\nHe underwent emergency surgery Wednesday night and remained in critical condition Thursday, police said. Unified Police Detective Ken Hansen said Thursday that doctors may not know until the weekend whether the boy will recover.\nNo other children were injured.\nHansen said police believe the shooting was gang-related and someone else was the target.\nThe car that the two men were seen in was later found in Salt Lake City.\nCourt records show Bermejo-Zaragoza faces aggravated burglary, robbery and assault charges from a September home invasion in Ogden. He has not yet entered a plea in that case. He was not in custody for that case because he had posted a $50,000 bond.\nBermejo-Zaragoza was scheduled to appear at a hearing regarding the September charges Thursday morning, but it wasn't clear if he made the appearance before his arrest Thursday.\nHis attorney in that case, James Retallick, and prosecuting attorney Brody Flint did not return messages."}