{"uri": "http://www.wbaltv.com/article/man-shoots-suspect-trying-to-break-into-his-car-police-say/8502996", "title": "Man shoots teen trying to break into his car, police say", "dct": "Thu, 15 Dec 2016 23:13:00 GMT", "id": "414f5ab582ddfb02566571b8b12d5a06", "content": "LANSDOWNE, Md. —\nA man shot a teenager who tried to break into his vehicle Wednesday morning, Baltimore County police said.\nPolice said the shooting was reported just after 4:30 a.m. in the 100 block of Hazel Avenue in the Lansdowne area. The Baltimore County State's Attorney's Office is looking into whether the shooting was justified.\nInvestigators said a 44-year-old man saw an individual breaking into his vehicle, so he took a rifle outside and confronted the 17-year-old boy.\n\"A man saw someone breaking into his car, so he takes a rifle and goes outside to confront the suspect. The suspect takes a sharp object, perhaps a knife or screwdriver, (and) swipes it at the man, cutting his hand. The man then fires one shot, striking the suspect,\" Baltimore County police Cpl. John Wachter said.\nThe teen, identified as Timothy James Rivera, fled but was later found and taken into custody.\nRivera was treated at a hospital for a gunshot wound to his arm, police said. He is charged as an adult with first-degree assault, theft and related charges. Rivera is being held without bail at the Baltimore County Detention Center.\n\"I think that's a good call. I think he's an adult. He's 17. He knows what's right and what's wrong,\" said Kara Anderson, a neighbor.\nGina Anderson has a bullet hole in the gutter on the side of her house because of what happened in her next-door neighbor's driveway early Wednesday.\n\"It's scary because look how close it is to the actual house,\" Gina Anderson said.\nNeighbors said there have been many car break-ins and thefts recently in their area of Lansdowne, including Wednesday night.\n\"There have been break-ins all over the neighborhood, in cars, kids going up and down the street. A friend of mine's vehicle got stolen on First Avenue a couple of weeks ago,\" Kara Anderson said."}