{"uri": "http://www.nola.com/crime/index.ssf/2016/07/deputy_shoots_suspect_at_metai.html", "title": "Deputy shoots, kills suspect in Metairie newspaper warehouse", "dct": "Wed, 27 Jul 2016 16:15:51 GMT", "id": "1fdbcc9c4debab0128904cabe35151bb", "content": "A Jefferson Parish deputy sheriff shot and killed a man late Tuesday (July 26) inside The Times-Picayune's newspaper warehouse in Metairie. The Sheriff's Office said the man pointed a gun at the deputy, after a foot chase that began with reports of two suspicious people at a nearby vehicle storage lot.\nCol. John Fortunato, a Sheriff's Office spokesman, said deputies were called to Cleary Avenue and Ford Street at 11:46 p.m. to check reports that two people were \"rolling shiny objects down the street,\" jumping the fence at the vehicle storage lot and, finally, running toward Interstate 10, a block south of Ford.\nDeputy David Dalton saw a man enter the north side of the newspaper warehouse, at 4013 N. Interstate 10 Service Road, and followed him.\nThe video shows the man raising what appears to be a gun and pointing it at the deputy.\n\"As Dalton pursued the suspect, he turned facing Dalton and pointed a handgun at him. Dalton drew his service weapon and fired six shots at him,\" Fortunato said. \"The suspect collapsed and was pronounced dead on the scene.\"\nThe dead man was holding a 9mm pistol with an obliterated serial number, Fortunato said. His name was not immediately released.\nDuring a search of the vehicle lot, Fortunato said, a new Ford pick-up truck was found resting on blocks, missing two wheels.\nThe property where the shooting occurred includes an office building that used to be the home of The Times-Picayune's East Jefferson bureau. Attached to the rear is a large warehouse where newspapers are sorted and distributed to dealers. The building is now occupied by Advance Central Services-Southeast, part of the same family of companies as NOLA Media Group, which runs NOLA.com and publishes The Times-Picayune.\nJust northeast of the site is a fenced vehicle storage lot at Ford and Richland Avenue. Dealerships often park new vehicles there before moving them onto their sales lots.\nThe Sheriff's Office said it will discuss the shooting at a 3 p.m. news conference.\nCorrection: An earlier version of this story incorrectly said the shooting took place early Wednesday (July 27). It happened late Tuesday."}