{"uri": "http://www.wdsu.com/news/local-news/new-orleans/jpso-investigating-an-officerinvolved-shooting-that-left-one-man-dead/40905470", "title": "Suspect who pointed gun at deputy shot, killed in Metairie, Sheriff's Office says", "dct": "Wed, 27 Jul 2016 20:42:00 GMT", "id": "b8c7c0da34ab9461864b7a4b98be902e", "content": "METAIRIE, La. —\nA Jefferson Parish deputy fired his weapon six times before he killed a suspect who pointed a gun at him late Tuesday in Metairie, officials said.\nThe incident was first reported after 11:30 p.m. when the Sheriff's Office received calls about two suspicious people near the intersection of Ford and Cleary avenues.\nInvestigators were told that the two people appeared to be rolling metal objects down the street. The two were seen jumping the fence of a nearby vehicle storage lot, the Sheriff's Office said.\nThe Sheriff's Office received another report about the two running toward the Interstate 10 Service Road. Investigators said deputies began searching the area and found a man running toward the garage of the Times-Picayune at Richland Avenue and the I-10 Service Road.\nOne of the deputies, identified as David Dalton, saw a man wearing blue jeans and a black T-shirt go into the garage on the north end of the building, the Sheriff's Office said.\nDalton went after the man, who turned around and pointed a gun at the deputy. The Sheriff's Office said Dalton took out his service weapon and fired six shots at the suspect.\nThe man, who has not been identified, was pronounced dead at the scene. Investigators said he was armed with a 9 mm handgun with a serial number that had been removed.\nDetectives searched the parking lot and found a new Ford pickup truck with two tires and wheels missing. The vehicle was resting on blocks.\nJefferson Parish Sheriff Newell Normand will discuss the investigation at a news conference at 3 p.m. Wednesday.\nStay with WDSU-TV and WDSU.com for updates.\nKeep up with local news, weather and current events with the WDSU app here.\nSign up for our email newsletters to get breaking news right in your inbox. Click here to sign up!"}