{"uri": "http://www.kiro7.com/news/local/5-people-shot-in-downtown-seattle/465797407", "title": "Suspect identified in downtown Seattle shooting", "dct": "Fri, 18 Nov 2016 19:37:00 GMT", "id": "5a6b33bbfeddac1b3c906f2cc2055c84", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nSEATTLE - UPDATE, NOV. 18: Police said the shooting suspect is Alrick Hollingsworth Jr. He is 5-foot-5 and 160 pounds. Anyone with information is asked to call 911.\nORIGINAL TEXT: Police are searching for a suspect after five people were shot in downtown Seattle Wednesday night.\nOfficers responded to a report of a shooting on Third Avenue and Pine Street just before 7 p.m.,when people were protesting Donald Trump. Police later said the shooting was unrelated to the people who were protesting in downtown. Read about the protest here.\n3/Pine shooting NOT believed to be connected to earlier demonstration at Westlake. Investigation ongoing.\n— Seattle Police Dept. (@SeattlePD) November 10, 2016\nDuring a police briefing, Assistant Chief Robert Merner said the shooting happened in front of the 7-Eleven.\nAccording to police, the shooting stemmed from a personal argument.\nThe victims -- a woman and five men -- were transported to Harborview Medical Center.\nAs of Wednesday night, two men remain in critical condition and the other three are in satisfactory condition. The victims range in age from 20s to 50s and sustained wounds to their legs, chest and neck.\nHarborview update on Seattle shooting: 2 males remain critical, but stable. 2 males & female improved to satisfactory condition.\n— UW Medicine (@UWMedicine) November 10, 2016\nAccording to police, it is believed that some of the victims were innocent bystanders.\nPolice are looking for a suspect, who is believed to be an adult male.\nKIRO 7 News' chopper flew over the shooting scene.\nThe investigation is on going.\nAnyone with more information on the shooting is asked to call detectives at 206-684-5550.\nPolice closed Third Avenue between Pike and Pine streets for several hours for detectives to investigate. Then later reopened the street to traffic.\nTop stories on KIRO7.com\n© 2017 Cox Media Group."}