{"uri": "http://www.kiro7.com/news/local/west-seattle-high-school-students-walk-out-in-post-election-protest/465700652", "title": "After socialist councilmember calls for massive protest, hundreds march in Seattle", "dct": "Wed, 09 Nov 2016 23:35:00 GMT", "id": "c6343a31b1b3ae947be0d3a67ac27693", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nHundreds of people took to downtown Seattle streets to protest president-elect Donald Trump on Wednesday evening after a Seattle socialist councilwoman encouraged residents to fight racism.\nFive people were shot in downtown Seattle about 6:50 p.m. Police say the shooting is not related to the people who were protesting in downtown. Read about the shooting here.\nDemonstrators across the nation, from Seattle to Chicago, gathered to protest Trump Wednesday. Here's how events unfolded for Seattle.\nProtest at Westlake Park\nOn the protest event Facebook page, more than 1,500 people said they were going to demonstrate. Hundreds of people gathered in the downtown park around 4:30 p.m. and started to march through the streets around 5:45 p.m. A group continued marching through Capitol Hill and then the U-District until nearly 9 p.m.\nSee photos from the protest here\nThe Facebook page wrote the following about the protest: “The Democratic Party has proven they are incapable of stopping Trump. The Democratic Party has failed. This is the result of the Democratic Party leadership backing Hillary Clinton instead of Bernie Sanders. It is time to build a new party of the 99%.”\nHere's a real-time log of events as they happened:\n8:42 p.m. The protest moves from Wallingford back toward the U-District on 45th.\nThe anti-Trump protest is moving from Wallingford back toward the U-District on 45th. https://t.co/N6PRn5HcoB https://t.co/N6PRn5HcoB pic.twitter.com/nj5mZbKM9k\n— KIRO 7 (@KIRO7Seattle) November 10, 2016\n8:30 p.m. The protest moves from U-District toward Wallingford.\n8:15 p.m. A large police response – including bike officers – is working to keep anti-Trump protesters from getting on Interstate-5 in the U-District.\nA large police response – including bike officers – are working to keep anti-Trump protesters from getting on I-5 in the U-District. pic.twitter.com/ZdK2KdlyAg\n— KIRO 7 (@KIRO7Seattle) November 10, 2016\n8 p.m. Protesters are still marching, they are in the University District.\n7:30 p.m. The protest has thinned out.\n6:59 p.m. The main protest is continuing in Capitol Hill.\n6:50 p.m. The protest appears to have broken off around downtown as the march heads toward Capitol Hill.\n6:34 p.m. BREAKING: Seattle anti-Trump protesters are now marching in Capitol Hill.\n#BREAKING: Trump protesters don't appear to be stopping any time soon. They continue to chant: \"Not my president.\" pic.twitter.com/sa12rhjJIb\n— KIRO 7 (@KIRO7Seattle) November 10, 2016\n6:11 p.m. BREAKING: Seattle officers are blocking express lanes to I-5 as protesters march in downtown.\n5:57 p.m. Protesters march on 4th Avenue near Pike Street.\n5:45 p.m. Officers are peacefully monitoring protesters.\n5:38 p.m. All Sound Transit Express bus routes with stops in downtown Seattle experience delays due to the protest.\n5:30 p.m. Protesters fill the downtown streets after the rally. They move along 2nd and Pike.\nProtesters chanting: \"When Black lives are under attack, what do we do, stand up fight back.\" Thounsands still marching down 2nd Ave. pic.twitter.com/akHs5XMxzv\n— KIRO 7 (@KIRO7Seattle) November 10, 2016\n#Breaking: Protesters are moving along 2nd & Pike in downtown #Seattle.\n[GRAPHIC LANGUAGE WARNING] >> kiro/tv/LiveNews pic.twitter.com/Itaxhpdg4C\n— KIRO 7 (@KIRO7Seattle) November 10, 2016\n5:15 p.m. Sawant speaks to the crowd telling demonstrators that \"we are stronger than the billionaires\" and \"their capitalists system.\n4:50 p.m. Anti-Trump protesters in Seattle chant: \"The people united will never be defeated.\"\nActivists from communities who feel threatened by trump speaking one by one pic.twitter.com/sFcC3fA1nS\n— Henry Rosoff (@HenryKIRO7) November 10, 2016\n4:40 p.m. KIRO 7 Chopper shows a large crowd listening to speakers who say they did not good candidates to vote for this election season.\n4:30 p.m. The protest is underway in Westlake. Demonstrators hold signs with Trump's face that say, \"fight racism.\" Watch live stream here.\nSawant calls for nationwide shutdown on Inauguration Day\nIn a packed post-election rally at Seattle City Hall on Wednesday afternoon, Socialist councilmember Kshama Sawant called for a massive protest on Wednesday night and a nationwide shutdown on Inauguration Day in response to president-elect Donald Trump.\n“I appeal to you, [Wednesday] at 4 o’clock, at Westlake [Park], let’s have a massive protest, and tell America we do not accept a racist agenda,” Sawant said. “And let’s make sure on Inauguration Day … let’s do a nationwide shutdown.”\nSawant made headlines in 2014 for being among several people arrested at Alaska Airlines headquarters in SeaTac during a demonstration protesting the company’s failure to pay workers $15 an hour. Watch video here.\nOther protests erupted in Seattle and along the West Coast on Wednesday morning after Trump one 270 electoral college votes.\nWest Seattle High School students walk out in post-election protest\nNearly 200 West Seattle High School students walked out of class in a demonstration of an upset of Donald Trump’s presidency.\nThe school is allowing the students to walk out and express themselves. West Seattle High School administration said that students are due to come back and have an informal assembly with those students to talk about their feelings and futures,\nSeattle Public Schools released the following statement to KIRO 7 News:\n“The district is supporting schools and staff on ways to best handle potential reactions from students, especially, younger students, to the election results.”\n“We are working with our school board to create supports.”\n“Schools are handling this on a case by case basis - they're still feeling-out how students are feeling.”\nKIRO 7 News chopper flew over the crowd chanting “He’s not my president.”\nProtesters demonstrate on Capitol Hill early Wednesday morning\nAbout 100 protesters demonstrated early Wednesday on Capitol Hill after Donald Trump was elected president of the United States.\nSocial media videos showed people filling the street in the block of Pike Street, Broadway, and 10th Avenue. They set fires, blocked traffic and threw bottles.\nProtestors angry over election turn out. 10th and pike is closed. @KIRO7Seattle @PhotogJKIRO7 #wakeupwithus pic.twitter.com/0CYYS2JNIM\n— Jason D. Nobles (@PhotogJKIRO7) November 9, 2016\nA Periscope user, who said he was a delegate to the Democratic National Convention, posted a video showing police lining an intersection near 10th Avenue and Pike.\nA waste bin was set on fire nearly an hour later at Pine Street and Harvard Avenue.\nThe protesters have since dispersed and no arrests have been reported.\nProtesters set a waste bin on fire at pine and Harvard. @KIRO7Seattle @PhotogJKIRO7 @KIRO7Seattle #wakeupwithus pic.twitter.com/vxYXfzxBfU\n— Jason D. Nobles (@PhotogJKIRO7) November 9, 2016\nProtests in California and Oregon\nDemonstrators angry about the election of Donald Trump smashed windows and set garbage bins on fire early Wednesday in downtown Oakland, California, joining protesters elsewhere in the country who swarmed streets in response to the election. Other protests were generally peaceful.\nIn Oregon, dozens of people blocked traffic in downtown Portland and forced a delay for trains on two light-rail lines. Media reports said the crowd grew to about 300 people, including some who sat in the middle of a road. The crowd of anti-Trump protesters burned American flags and chanted, \"That's not my president.\"\nGet complete election coverage from kiro7.com\n© 2017 Cox Media Group."}