{"uri": "http://www.king5.com/news/local/multiple-people-shot-in-downtown-seattle/350611854", "title": "5 people shot, 2 seriously injured in downtown Seattle shooting", "dct": "Thu, 10 Nov 2016 00:00:00 GMT", "id": "e2aea2b4fabb84922785a92a0b26735d", "content": "SEATTLE – Five people were shot in downtown Seattle Wednesday night.\nSeattle Police said it happened at about 6:45 p.m. near the intersection of Third Avenue and Pine Street. All five victims were transported to Harborview Medical Center.\nInvestigators said an argument took place outside the 7-Eleven and quickly escalated. It's believed the suspect walked away from a group of people, turned around, and fired at the crowd, according to police.\nAdditional police presence was already downtown for an unrelated anti-Trump rally, and crews were on the scene within one minute.\nSeattle Police stressed the shooting was not at all connected to the anti-Trump rally.\nAt this time, police said it appears several of the victims were not involved in the argument and were innocent bystanders. Some were waiting at the bus stop when they were caught in the crossfire.\nSeattle Police are still looking for the shooter, an adult male, who fled on foot.\nAndy Wittenberg was shopping at Walgreens when the shooting happened. He said people ran into the store saying, “Get cover, get down.”\nHe thought the incident was over, so he went outside and saw multiple victims with a large police presence. Wittenberg said the incident was “pretty intense.”\n“I’ve lived in major cities for a while. I’ve never seen anything close to this,” Wittenberg said. “This is the worst incident I’ve ever seen.”\nWitness describes what happened after shots were fired near 3rd and Pike pic.twitter.com/LXtzqWyYtF\n— Natalie Swaby (@NSwabyKing5) November 10, 2016\nCharelle Williams, a leasing agent who moved to the area from North Carolina two months ago, also heard the shots. He said he heard some pops and screams before people started scattering. He said it was shocking to see a shooting in Seattle.\n\"It’s kind of frightening,\" Williams said. \"A bullet can have anybody’s name on it. You never see it coming.\"\nWATCH: witnesses at downtown Seattle shooting had to hide under tables inside McDonald's at third & pine pic.twitter.com/PEv7UEz8Fm\n— Heather Graf (@HeatherGrafK5) November 10, 2016\nWednesday night two victims were in critical condition, but Thursday morning Harborview confirmed their conditions improved to serious. Two other victims are now in satisfactory condition while the fifth was released from the hospital overnight.\nThe five victims range in age from 20's to 50's. They sustained gunshot wounds to their chest, neck, and legs.\nA man at Harborview Medical Center said his 26-year-old son was among the victims that has non-life-threatening injuries. His family waited at the hospital for several hours, worrying about their loved one.\n\"If there's anybody that does know anything I would appreciate you coming forward and helping the police out in solving this,\" said Jesse Baker. \"Because it wasn't just my son, it was a couple other innocent people. And just as random - this shooting stuff has just gone too far, it really has.\"\nPolice are now reviewing surveillance video from businesses in the area where the shooting took place, working to identify the gunman. They're asking anyone with information to contact Seattle Police right away.\nCopyright 2016 KING"}