{"uri": "http://www.nbclosangeles.com/news/local/LAPD-Officer-Shot-Nickerson-Gardens-388225112.html", "title": "1 Dead, LAPD Officer Injured in Watts Shooting", "dct": "NODATE", "id": "5e338f549880ec62235e24e8d869c85b", "content": "An LAPD officer was injured and a person was killed Monday night during a shooting in the Watts area that led to an overnight search, police said.\nLAPD officers were patrolling the Nickerson Gardens area on E. 11th Street and Antwerp Street around 11 p.m. when shots were fired and officers requested backup, said Sgt. James Linder of the Los Angeles Police Department Southeast Division. A gun battle ensued among the officers at the scene and an unknown number of people, Linder said.\nThe injured officer suffered a graze wound to his left arm, police said.\nOne person was shot multiple times and died at the scene, police said. It was unknown whether the victim was involved in the gunfire or was a bystander.\nA shootout with police left one dead and a LA police officer injured in Watts. Many residents are left questioning what led to shots being fired. Toni Guinyard reports for the NBC4 News at 11 a.m. on Tuesday, July 26, 2016. (Published Tuesday, July 26, 2016)\nA woman who identified herself as the deceased man's mother told NBC4 he was 18 years old and attended Apple Valley High School.\n\"They haven’t found no weapon. All the people say my son was running when they shot him,\" Lisa Simpson said.\nLAPD said a weapon was recovered from the scene, despite Simpson's assertions.\nThe injured officer was in stable condition at Long Beach Memorial Hospital, police said. LAPD Chief Charlie Beck tweeted he was arriving at the hospital to check on the officer and to be briefed on the shooting.\nTwo people of interest were detained, LAPD Southeast Division said. LAPD was searching for one other person connected to the shooting.\nA police cruiser escorted an ambulance out of the area.\nOfficers had formed a skirmish line, asking residents to return to their homes as police investigated. At one point, an agitated crowd began throwing rocks and bottles at police, but no one was injured, Linder said.\nCrime scene investigators remained in the neighborhood Tuesday afternoon.\nA man who identified himself as the father of the victim said he believes what neighbors told him happened. They told him that his son was unarmed and running for his life.\nThe shooting comes as officers around the country are on alert following the targeted killings of police this month in Dallas and Baton Rouge, Louisiana. Beck last week announced that he was taking extra precautions to better protect officers.\nLAPD Chief Charlie Beck said Tuesday that extra patrols had been in the area after recent rival gang shootings, noting that 11 had occurred in the last two weeks leaving three people dead. He says officers were trying to get a group of young men to disperse when one of them took off running."}