{"uri": "http://www.deseretnews.com/article/865658761/One-dead-child-seriously-hurt-in-Salt-Lake-City-shooting.html?pg=all", "title": "Salt Lake man shoots 8-year-old boy, then himself in murder-suicide, police say", "dct": "Tue, 26 Jul 2016 12:45:00 GMT", "id": "91c3be6fc8163864c53b4896833bf2ea", "content": "Salt Lake City officials work at the scene of an apartment complex where an 8-year-old boy was transported to the hospital and later died and an adult male was found dead in Salt Lake City on Tuesday, July 26, 2016.\nSALT LAKE CITY — Police say a Salt Lake man shot an 8-year-old boy and then himself in a murder-suicide Tuesday inside a Capitol Hill apartment.\nOfficers were called to a report of a domestic incident involving a gun just after noon at an apartment at 561 N. Center. Salt Lake police detective Greg Wilking said the weapon used in the killings was an \"improvised firearm\" rather than a traditional gun, though he declined to elaborate further about the device or the fatal injuries sustained by the man and the boy.\nThe device used traditional bullets, according to police.\n\"The scene is going to take a long time to process due to the complexity of it,\" Wilking said Tuesday.\nThe 911 call was made by the boy's mother, Wilking said. When officers arrived inside the apartment, they found the man deceased, the child injured and the boy's mother, who was not injured.\nThe boy was transported to Primary Children's Hospital, where he was later pronounced dead, Wilking said.\nInvestigators believe the boy, his mother and the man lived at the apartment together. None of their names were released Tuesday.\nThe motive for the murder-suicide was unknown Tuesday, Wilkig said, noting that police do not believe there are any outstanding suspects.\nShelby Castleton, a neighbor, said she was flabbergasted to hear about the ordeal. Castleton remembers the boy going to and from school.\n\"The bus would come up every morning and he would jump in and then come home, and then I could always hear him yelling for his mom,\" she said.\nBrandView\nNothing about the home itself made Castleton suspicious that something was wrong there, she said.\n\"Any glimpses I got inside their apartment, they always had drawings of his up,\" Castleton said of the boy.\nShe added that the man who lived at the apartment was a \"great guy as far as I knew.\"\n\"He was so nice with me always,\" Castleton said.\nContributing: Alex Cabrero\nTwitter: benlockhartnews"}