{"uri": "http://www.pcso.us/news-10331-update-on-yesterday's-accidental-shooting", "title": "Update on Yesterday's Accidental Shooting", "dct": "Wed, 09 Mar 2016 00:00:00 GMT", "id": "c0bf7e0a67718a3a3d9fa7731856d26e", "content": "Putnam County, FL: This is an update regarding the accidental shooting in Putnam County on 03/08/2016. Our investigation has revealed that the firearm was legally owned by the victim and the child came to possess the firearm without the victim’s knowledge. Florida Statute makes it a misdemeanor for a person to store or leave, on a premise under his or her control, a loaded firearm in such a manner that it is likely a child can gain access to the firearm. The investigation is ongoing to determine exactly how the firearm was stored in the vehicle. The primary concern for PCSO at this time is to provide the necessary services and assistance to the young man and his family. Due to her medical condition, Detectives have not been able to interview the victim and any decision on the filing of criminal charges will not come until after we speak with the victim. It is not known when we anticipate speaking with the victim. The Florida Department of Children and Family Services have been notified and are reviewing the case as well. The four-year-old child remains with family members.\nThe Sheriff's Office has received several questions about the Florida Statute regarding the safe storage of firearms. Here is the entire statute:\n790.174 Safe storage of firearms required.—\n(1) A person who stores or leaves, on a premise under his or her control, a loaded firearm, as defined in s. 790.001, and who knows or reasonably should know that a minor is likely to gain access to the firearm without the lawful permission of the minor’s parent or the person having charge of the minor, or without the supervision required by law, shall keep the firearm in a securely locked box or container or in a location which a reasonable person would believe to be secure or shall secure it with a trigger lock, except when the person is carrying the firearm on his or her body or within such close proximity thereto that he or she can retrieve and use it as easily and quickly as if he or she carried it on his or her body.\n(2) It is a misdemeanor of the second degree, punishable as provided in s. 775.082 or s. 775.083, if a person violates subsection (1) by failing to store or leave a firearm in the required manner and as a result thereof a minor gains access to the firearm, without the lawful permission of the minor’s parent or the person having charge of the minor, and possesses or exhibits it, without the supervision required by law:\n(a) In a public place; or\n(b) In a rude, careless, angry, or threatening manner in violation of s. 790.10.\nThis subsection does not apply if the minor obtains the firearm as a result of an unlawful entry by any person.\n1(3) As used in this act, the term “minor” means any person under the age of 16."}