{"uri": "http://minnesota.cbslocal.com/2016/09/27/2-charged-fatal-st-paul-shooting/", "title": "3 Charged In Shooting Death Of Minnetonka Teen", "dct": "Tue, 27 Sep 2016 13:22:00 GMT", "id": "8a79f4040c6d8b02552a925e5cc67999", "content": "MINNEAPOLIS (WCCO) – Two people have been charged in connection with the shooting death of a Minnetonka teen.\nThirty-two-year-old Christopher Calloway and 29-year-old Kalisha Smith, both of South St. Paul, as well as 24-year-old Davonte Bobo of West St. Paul have each been charged with one count of second degree murder, one count of second degree murder while committing a felony and one count of first degree robbery.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nAccording to the criminal complaint, on Sept. 24 Smith, Brittany Rock, Rock’s girlfriend and 16-year-old Samantha Leah Burnette were driving around in Smith’s Dodge Dart, drinking and talking.\nRock was driving, Smith sat in the passenger seat, Rock’s girlfriend sat behind Smith and Burnette sat behind Rock.\nSmith told Rock that she needed to meet someone and had her drive them to an alley on the 700 block of Sims Avenue in St. Paul. Once they arrived, Smith got out of the car and told the girls she would be right back.\nAccording to the criminal complaint, after Smith left a male wearing a hooded sweatshirt, later identified as Calloway, approached the car and got in the passenger seat. Court documents say two other men — one of whom was later identified as Bobo — appeared at the rear passenger door. Investigators later learned Bobo was carrying a semiautomatic weapon.\nCalloway pulled out a revolver, pointed it at Rock and said, “Give me everything.” Calloway then took a red HTC phone from her and hit her in the head with the gun, causing her to bleed. He also took a white LG phone.\nPolice said once Rock came-to from being hit in the head, she fled from the car and hid behind a garage.\nRock told police the man who hit her was still in the front seat when Smith got into the car and drove off. She heard them yelling, “Go! Go! Go!” as the pulled away.\nPolice said Rock then went back to where the car had been and found Burnette bleeding from the mouth.\nParamedics were called, but Burnette was declared dead on the scene.\nAccording to the criminal complaint, Rock’s girlfriend thought Burnette had been shot two, or three times.\nA short time later, police said the located the Dodge Dart after it crashed near Mississippi Street and Jessamine Avenue East. A police canine found parts of the HTC cell phone in an alley and heavily wooded area.\nAccording to the criminal complaint, on Sunday officers responded to a report of domestic assault filed by Smith. During questioning, Smith mentioned her boyfriend, Calloway, had a .22 handgun.\nPolice arrested Smith and brought her in for questioning.\nSmith told police that she was “hanging out” with Calloway, and eventually admitted knowing Calloway was planning to rob the girls. She admitted to telling Calloway the girls had money and to getting out of the car because she knew the robbery was going to happen.\nPolice said Smith saw Calloway get in the passenger seat and poke Rock with the gun. Bobo and another man, identified as “Harris,” were armed and stood around. Burnette then hit Calloway with a bottle and he shot her.\nBobo told police his gun was aimed at the girl during the robbery, and he may have shot her when Calloway started shooting. Investigators say forensic evidence indicates Burnette was shot three times with bullets of two different calibers.\nCalloway has eight prior felony convictions, including an armed robbery and aggravated battery with great bodily harm from Illinois. Bobo has a prior conviction for aggravated robbery and has charges pending for soliciting a prostitute in Olmstead County.\nIf found guilty, Calloway, Bobo and Smith could face up to 40 years for each murder charge, and up to 20 years in prison, a $35,000 or both for the robbery charge."}