{"uri": "http://www.nola.com/crime/index.ssf/2016/12/shots_fired_during_police_chas.html", "title": "Gretna officer hit by stolen vehicle, teen suspect shot during chase", "dct": "Fri, 16 Dec 2016 11:48:21 GMT", "id": "563e93b7dd5941bbdf6c82ac80bea051", "content": "A police chase involving a stolen car ended in Gretna with the shooting of a suspect and injury of a police officer who was hit by the vehicle Thursday night (Dec. 15), authorities said.\nThe Gretna officer, who was not identified, sustained a leg injury and was in good condition, Police Chief Arthur Lawson said.\nThe suspect -- identified as Ray John Brown, 17, of New Orleans -- was shot in the stomach, according to the Jefferson Parish Sheriff's Department. He was being treated at University Hospital, JPSO spokesman John Fortunato said.\nBrown was wanted on an outstanding warrant out of New Orleans for aggravated assault with a weapon, Fortunato said. He has five prior felony arrests as a juvenile, he said.\nThe chase began at 9:12 p.m. when Jefferson Parish authorities spotted a stolen car through a license place recognition camera in Marrero, according to Jefferson Parish Sheriff Newell Normand. The Kia Optima was stolen from Kenner on Dec 3, he said.\nWhen officers arrived, the driver refused to stop and led deputies through Jefferson Parish and into Gretna, Normand said.\nShots were fired by the driver and the pursuit continued to the intersection of 4th and Weyer streets where the car encountered a barricade, Chief Lawson said.\nThe driver tried to break through the barricade and \"intentionally tried to run over several officers,\" Lawson said.\nLawson said the man ran from the scene and was found hiding in a car in the 500 block of Derbigny Street.\nSheriff Normand said the driver shot at two police vehicles before the Kia ran over a sidewalk and into the front yard of a house. Shattered glass and several dozen evidence markets dotted the area around the vehicles which included a blue pick up truck, a silver SUV and a Ford Mustang.\nJohn Saltzman, who was working in the attic of a building on 4th Street and Huey P. Long Avenue said, \"I stopped counting at 65 rounds. I'm former law enforcement so I know what that sounds like.\"\nHis wife, Nancy, was having dinner at the Gretna Depot Cafe and Spirits a block from Weyer and 4th streets. She said she heard what sounded like fireworks and then saw several police cars drive by at around 9:42 p.m."}