{"uri": "http://www.local10.com/news/crime/grandfather-of-8-year-old-killed-in-shooting-says-incident-was-retaliation-", "title": "Grandfather of 8-year-old killed in shooting says incident was retaliation", "dct": "Thu, 29 Dec 2016 10:19:00 GMT", "id": "4177d689ac109095e443095be35af1a3", "content": "DANIA BEACH, Fla. - The grandfather of an 8-year-old boy who was killed Wednesday night in a shooting in Dania Beach told Local 10 News on Thursday that he believes that his grandson was killed in one of several shootings that was in retaliation for a fatal shooting that happened six years ago.\nMeanwhile, witnesses said the boy's cousin tried to shield other children that were with them from the bullets.\nBoy killed, 2 adults injured in Dania Beach shooting\nRelatives said Rasheed Cunningham Jr., 8, was leaving his 4-year-old cousin's birthday party about 7:40 p.m. with a group of about 15 children, his aunt and his cousin when someone pulled up in a car and started to shoot at them in the 200 block of Northwest Ninth Avenue.\nRelatives said Rasheed's cousin, Brandon Cunningham, grabbed as many children as he could to shield them from the bullets. They said Rasheed was walking in front of him and he was unable to grab him.\nThey said Brandon Cunningham was shot five to six times in the back.\n\"That's who the kids walk home with and they probably were targeting him. I don't know if they were targeting him because they shot my grandkid,\" Rasheed's grandfather, Rodney Daughtry said.\n\"He didn't deserve this and it could've been my child, because she was walking with them at the time,\" witness Sonia Hughes said. \"It's going to be anybody's child, but now ya'll killing kids. It really has to stop.\"\nBroward Sheriff's Office deputies said Rasheed was also shot and was taken to Joe DiMaggio Children's Hospital in Hollywood, where he was pronounced dead.\n\"(He was a) good football player, very smart in school, everybody loved him,\" Daughtry said.\nBrandon Cunningham and Rasheed's aunt, Teresa Greggs, remain in the hospital. Relatives said they were celebrating Greggs' daughter's birthday.\nThe shooting is the fourth since Christmas in the same Dania Beach neighborhood.\nInvestigators believe that three of the shootings were related.\nA man identified by relatives as Christopher Jordan, 25, was killed on Christmas Day while he was walking home in the 200 block of Northwest Sixth Avenue.\n\"That was an angel boy. That boy was good,\" Jordan's mother, Sharon Grace, said. \"He was going to be something in life.\"\nA bystander was shot Tuesday in the 300 block of Phippen Waiters Road. That person survived.\nAccording to Rasheed's grandfather, Jordan was in a car six years ago with a group of brothers who drove up to a home and fatally shot someone.\nDaughtry said the group of brothers were hanging out at a park recently when someone named Eric, who just got out of prison, approached them and said that he would \"get them all.\"\nCunningham believes that the man, who he said is a member of a Lincoln Park gang, is trying to get retaliation for the shooting that left his brother dead.\nHe said he believes that detectives know the gunman's identity. However, BSO is asking anyone with information about the shooting to call Crime Stoppers at 954-493-TIPS.\nCopyright 2016 by WPLG Local10.com - All rights reserved."}