{"uri": "http://www.local10.com/news/crime/2-arrested-in-connection-with-string-of-shootings-in-dania-beach-", "title": "2 arrested in connection with string of shootings in Dania Beach", "dct": "Fri, 30 Dec 2016 12:01:00 GMT", "id": "f18a1a54c6987ae51775b50fb1ef628e", "content": "DANIA BEACH, Fla. - Two suspects were arrested Thursday and Friday in connection with a string of shootings in Dania Beach, authorities said.\nThe first man arrested Thursday faces charges in connection with a robbery and shooting that left one man injured Monday.\nGrandfather of 8-year-old killed in shooting says incident was retaliation\nAccording to the Broward Sheriff's Office, a man was injured during an armed robbery shortly before 7 p.m. Monday near 100 NW Eighth Ave.\nDeputies said the victim struggled with the gunman, identified as Gregory Sims, 22, who fired a shot that missed the victim.\nDeputies said the victim was injured by a projectile that ricocheted off the ground. He was taken to Memorial Regional Hospital in Hollywood with non-life-threatening injuries.\nSims was taken into custody Thursday on charges of armed robbery and aggravated battery with a deadly weapon.\nDetectives believe the shooting might be connected to three other shootings recently reported in the area.\nBroward County Sheriff Scott Israel held a news conference Friday and said that U.S. marshals in Tallahassee located a suspect believed to be involved in one or more of the recent shootings.\nIsrael said Arvis Brown, 19, bailed out of a vehicle and two others inside the car were detained. It's unclear whether the other two men were involved in any of the shootings.\nIsrael said a firearm was confiscated from the vehicle. Brown was detained shortly after fleeing from the vehicle, authorities said.\nThe first shooting was reported shortly after 8 p.m. Christmas Day near Northwest Sixth Avenue and Second Street.\nAuthorities said Christopher Jordan, 25, was walking home when he was shot. He was taken to Broward Health Medical Center, where he later died.\nAccording to court records, Jordan and another man, Eric Hunter, were previously arrested for the 2011 killing of Dijon Brown.\nDetectives believe Jordan was killed in retaliation for Brown's murder and have confiscated a pickup truck believed to have been used in the shooting. They said Jordan's cousin, who was the victim in Monday's shooting, believed he was next and tried to purchase a gun from Sims, who authorities said robbed him at gunpoint.\n\"That homicide of Christopher Jordan on Christmas night set off a chain of events,\" Sgt. Scott Champagne said.\nAnother shooting was reported about 9:30 p.m. Tuesday in the area of 389 Phippen-Waiters Road. Deputies said the victim was grazed by a bullet and was treated as Memorial Regional Hospital. A motive for the shooting is unknown.\nThe final shooting was reported shortly before 8 p.m. Wednesday when a group of children and two adults were walking home from a birthday party.\nRasheed Cunningham Jr., 8, was killed and a man and a woman were shot.\nThe man, Brandon Cunningham, was taken to Broward Health Medical Center and the woman was taken to Memorial Regional Hospital. Both are expected to recover.\nRasheed's grandfather told Local 10 News that the gunman he believes killed his grandson, who he did not identify, is seeking retaliation for the fatal shooting of his brother that happened nearly six years ago.\nDetectives said they do believe that Arvis Brown was the gunman who targeted Brandon Cunningham and consequently shot the man's young cousin.\nAuthorities said Brown was released from jail Nov. 8 after serving six years in Lee County for an unrelated non-fatal shooting in Lehigh Acres. He was arrested on a felony warrant for possession of a firearm by a career offender. Deputies said he will be questioned about the shooting that happened on Christmas Day, Tuesday and Wednesday.\nHe is not yet charged with those shootings.\n\"I want to say to all citizens of Dania Beach and Broward County, it is absolutely time to stop burying 8-year-olds,\" Israel said at the news conference. \"If you know something, it is your obligation and duty -- it is the right thing to do to call Crime Stoppers immediately. Don't go on social media. Don't post anywhere. Call Crime Stoppers and make sure law enforcement is aware of what you know so that justice is served.\"\nAnyone with information about the shootings is asked to call Broward Crime Stoppers at 954-493-TIPS.\nCopyright 2016 by WPLG Local10.com - All rights reserved."}