{"uri": "http://woodtv.com/2016/02/14/bcpd-woman-dies-of-gunshot-wound/", "title": "Man tells BCPD fatal shooting was accidental", "dct": "Sun, 14 Feb 2016 16:29:00 GMT", "id": "36a949bf17febba8dea5fa43198adea5", "content": "BATTLE CREEK, Mich. (WOOD) — Battle Creek police are investigating after a man said his girlfriend was accidentally shot and died.\nIt happened around 1:30 p.m. Sunday at a residence on Highway Street between Cliff Street and Lathrop Avenue. The Battle Creek Police Department says one shot was fired, resulting in the death of 24-year-old Kayla Marie Babick.\nBCPD says Babick and her 25-year-old boyfriend, identified by his mother as Deangelo Gaines, were in an upstairs bedroom of the home they shared when the shooting happened. Police said Gaines told them Babick laid on a gun that was resting on a bed, causing it to fire.\nBabick was shot once in the side of her abdomen.\n“I just heard a big bam and me and my daughter, we opened the door, we opened the sliding door, we ran up and we seen Kayla running down the steps, saying she was about to die,” said Teresa Gaines, Deangelo Gaines’ mother.\nShe said Babick collapsed at the bottom of the stairs and that her son tried to help her.\n“Constantly talking to her, kept bringing her back, bringing her back,” Teresa Gaines said. “Letting her know that he loved her and he wouldn’t do nothing to hurt her.”\n911 was called quickly, BCPD said, but Babick died on the scene.\nThe gun in question, a .45-caliber, is registered to Deangelo Gaines. He is cooperating with the investigation. There is no word yet on whether he could face charges or what those charges would be.\nTeresa Gaines said her son and Babick had known each other for about 10 years. She said they had dated in the past, broken up and then started dating again within the last year. She said they were very much in love with each other. She said there was never any domestic violence between them.\n“They had a perfect relationship. You know how you have your ups and downs, I mean anybody. … But other than that, no. He don’t believe in hitting no woman. He’ll walk away first,” she said.\nGaines said she loved Babick like a daughter.\n“She was a sweetheart,” she said.\nFamily members said Babick had two children.\nShe was an organ donor. Family members said they are comforted somewhat knowing that her organs will help others.\n–24 Hour News 8’s Sarah Hurwitz and Leon Hendrix contributed to this report.\n**Correction: Citing Battle Creek Police Department sources, an earlier version of this article indicated Deangelo Gaines had accidentally shot Kayla Babick while cleaning his gun. Tuesday, Battle Creek Police said that since the beginning of their investigation Gaines had told them Babick laid on the gun on a bed, causing it to fire. The article has since been corrected.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}