{"uri": "http://www.battlecreekenquirer.com/story/news/local/2016/11/21/gaines-sentenced-accidental-shooting/94235016/", "title": "Gaines sentenced in accidental shooting of girlfriend", "dct": "Mon, 21 Nov 2016 00:00:00 GMT", "id": "378a6da0bec0362d3cd87b19477b616a", "content": "A Battle Creek man was placed on probation Monday after his girlfriend died in an accidental shooting on Valentine's Day.\nDeangelo Gaines, 26, was sentenced to two years of probation and fines and costs of $1,280 and ordered to pay restitution of $6,782 in the Feb. 14 death of Kayla Babick, 24.\nGaines entered a no-contest plea last month to a charge of careless discharge of a firearm causing death. As part of a plea agreement Gaines did not face any jail time.\n\"This is a very sad case that resulted in the death of someone,\" said Calhoun County Circuit Judge John Hallacy. \"It is one of those cases that the court system is not designed, I don't think any system is designed, to dole out a fair penalty for what happened. A life is lost and no matter what I do or you do it is not going to bring anyone back. You have to deal with that and the family has to deal with that and society has to deal with that.\"\nBabick died after Battle Creek police concluded she laid on a handgun. When she reached behind her to move it, the gun discharged. She died from a single gunshot wound.\nInvestigators said the gun belonged to Gaines and that the couple were in the bedroom of their home on Highway Street when the shooting occurred. Police said Babick, the mother of two children, was talking on the phone to her mother and Gaines was looking at Facebook on his phone, The gun was lying on the bed.\nGaines passed a polygraph and was interviewed twice and was cooperative, police said. Detectives said they have no evidence he was responsible for the shooting. Prosecutors decided that while the shooting was not intentional, Gaines, as the owner of the gun, had a responsibility to keep it safe from an accidental discharge.\nThe handgun had safeties on both the trigger and grip but police concluded Babick handled the gun in such a way that it fired.\nAt the sentencing hearing, Gaines asked the judge if the charge could be changed to a misdemeanor because with a felony on his record he was going to lose his job.\n\"I would like to go back (to work) but with a felony they won't let me,\" he said in a brief statement to the judge. \"I have been looking for work elsewhere but have not been able to get work. If you just maybe bring it down to a misdemeanor if that is possible.\"\nHallacy said Gaines pleaded to the felony and that charge would stand.\nAssistant Prosecutor Patrice Lewis told the judge that \"the (plea) agreement was offered with the endorsement of the family of the victim.\"\nContact Trace Christenson at 269-966-0685 or tchrist@battlecreekenquirer.com. Follow him on Twitter: @TSChristenson"}