{"uri": "http://wiat.com/2016/02/20/jeffco-investigating-shooting-in-bessemer/", "title": "One arrested after Bessemer shootout on West Elm Street", "dct": "Sat, 20 Feb 2016 17:47:00 GMT", "id": "e9ec78c6e2b4b7081e9b7ad1d9126701", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nBESSEMER, Ala. (WIAT) — UPDATE: Mario Desmond, 28, has been charged with the murder of 37-year-old William Lewis.\nLewis and Desmond were smoking marijuana and drinking when an argument broke out between the two, because one would not return the marijuana to the other. Desmond pulled a gun on Lewis and shots were fired by both men.\nDesmond was arrested on February 24 and remains in the Jefferson County Jail, with bond set at $135,000.\nORIGINAL: On February 20 just before 5:30 p.m., Jefferson County Sheriff’s Deputies were called to a residence in the 200 block of Elm Street SW to investigate a homicide.\nDeputies were told at the scene that several people were sitting outside in a vacant lot drinking and an argument broke out, upon which two men pulled out guns and began shooting.\nFour males, ages 28, 37, 37 and 45 were struck.\nDetectives later learned that in addition to drinking, the men were smoking marijuana. An argument broke out when one of the men would not return the marijuana to the owner, and then the 28-year-old and one of the 37-year-olds pulled guns on each other and began firing.\nThe 37-year-old was critically wounded and later died at the hospital. He has been identified as William Lewis of Birmingham.\nThe 28-year-old was struck and fled the scene before deputies got there, and he later went to an area hospital where he was treated and released. He has been identified by detectives and was questioned about his involvement in the scenario.\nThe other two victims remain in the hospital, but are expected to recover.\nThis investigation is ongoing. The results of the investigation will be presented to the district attorney’s office for a determination of what charges will be filed.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}