{"uri": "http://www.inquisitr.com/862001/five-family-members-shot-in-brooklyn-after-calling-police-about-abuse-in-mcdonalds/", "title": "Five Family Members Shot In Brooklyn After Calling Police About Abuse In McDonald’s", "dct": "Sun, 21 Jul 2013 00:00:00 GMT", "id": "2952940172fe46713502eeeed7c4dc2d", "content": "Five members of a family were shot in Brooklyn after they had reported abuse inside a nearby McDonald’s.\nThe five family members were hurt Saturday near Hope Ballfield in the Bushwick neighborhood of Brooklyn. Witnesses said at least one man out of a group of four ran over to the family and started firing.\nThe shooting left 45-year-old Ronaldo Pizarro, his wife 37-year-old Melody Amill, his 22-year-old son, and two other relatives injured.\nThe five family members were shot in broad daylight before a number of witnesses.\n“I heard the gunshots,” said 46-year-old Ivet Hernandez.\nHernandez said she looked from her window to see a group of young men all wearing white T-shirts running from the scene after the shots were fired.\nSome friends of the family believed the shooting was in retribution for one of the victims reporting abuse inside a nearby McDonald’s. They said one of the perpetrators threw a milkshake in the face of the victim’s daughter.\nThe elder Pizarro had reportedly told police that his 18-year-old daughter was harassed by a group of young men while she was working at the restaurant. After she refused the advances of one of the young men, he grew angry and threw the drink in her face.\n“They were making advances and teasing her and harassing her,” said family friend Ivette Miranda. “It got worse when they threw a milkshake in her face. She called her dad, Rolando, and he went there to the McDonald’s and called the cops.\n“He filed a police report right there. Those guys are bad men. They wanted to get back at Rolando for filing a report.”\nAll five of the family members shot after the McDonald’s incident in Brooklyn were taken to hospitals and expected to survive."}