{"uri": "http://wate.com/2016/11/25/metro-police-1-suspect-dead-3-arrested-amid-stolen-car-investigation/", "title": "Metro police: 1 suspect dead, 3 arrested amid stolen car investigation", "dct": "Fri, 25 Nov 2016 18:13:00 GMT", "id": "00bfa1bfdb312e34af1a8ef968d5cd86", "content": "NASHVILLE, Tenn. – One suspect is dead and three others are in custody amid a stolen car investigation in Nashville.\nThe situation unfolded Friday afternoon in Antioch around the South Shore neighborhood off Hamilton Church Road, not too far from the La Vergne city line.\nMetro police spokesman Don Aaron said the incident actually began two days ago when a woman left her keys and purse inside her Oldsmobile on Meridian Street in East Nashville.\nThe woman worked with her dealership to track the GPS signal to Sunset Drive near Hart Lane. Police said the woman found her car, saw it was empty, and went to have an extra key made, but when she arrived the second time, her car was gone.\nMetro-Nashville police were called on Thursday and an investigation began.\nThe car’s GPS was tracked again Friday, and both K-9 officers and a helicopter were used to pinpoint the location.\nAccording to Aaron, the Oldsmobile was found driving down Oceanfront Circle in the South Shore neighborhood as a police cruiser was driving up the same street.\nThe Oldsmobile collided with the driver’s side of the police cruiser, pinning the officer inside. Four people inside the Oldsmobile then bailed out of the passenger’s side and took off running.\nAaron reported a K-9 officer spotted two of the suspects run into nearby woods a short time later.\nThe officer let his K-9 go after the suspects and one shot as heard. Once police got to the scene, one suspect was captured by the K-9 while another was found dead.\nAaron said the suspect was either shot by his accomplice or himself; two guns were found on the ground, and no Metro police officer ever fired a weapon.\nA third suspect was also caught by the K-9 about eight-tenths of a mile away, while the fourth was located inside a shed back near the homes in South Shore in the area of Beachfront Avenue and Oceanfront Circle.\nNone of the suspects’ identities have been released at this time.\nThe investigation is ongoing.\nAaron said police still need to determine who shot the suspect that was killed in the woods—himself or an accomplice.\nHe also said two bullet holes were found on the top of Oldsmobile, “strongly suggesting” one of the suspects got out of the vehicle and fired two shots toward the police car.\n“The bullet holes are angled in such a way that they are facing toward the police car,” Aaron explained. “The shots were fired in that direction.”\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}