{"uri": "http://koin.com/2014/12/31/indictments-filed-against-rosemary-anderson-hs-shooting-suspects/", "title": "Rosemary Anderson HS shooting suspects indicted", "dct": "Wed, 31 Dec 2014 06:45:00 GMT", "id": "5efac10f8390b139a3942890868b01ad", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nPORTLAND, Ore. (KOIN 6) – A grand jury indicted the three suspects linked to the shooting outside Rosemary Anderson High School.\nMarquise D’Angelo Murphy, 16, his older brother, 20-year-old Lonzo Murphy, and their friend Marquel Diamond Dugas appeared in court Wednesday morning for arraignment on the grand jury indictment.\nPolice said the Dec. 12 shooting outside the high school was gang-related. Court documents show one of the suspects used a cellphone to record himself declaring “war” on a rival gang in the days leading up to the shooting.\nThe three victims: Taylor Michelle Zimmers, David Jackson-Liday and Labraye Franklin — 16, 20 and 17, respectively — have all been released from the hospital. Olyvia Lynn Batson, 17, suffered a graze wound and was treated at the high school the day of the shooting.\nMarquise Murphy was arrested in Keizer, Oregon on Dec. 16, after the car he was riding in led police on a chase in Marion County. Dugas and Lonzo Murphy were arrested on Dec. 13. Police said when Lonzo Murphy was arrested they found a firearm that they believed was used in the shooting.\nMarquise Murphy was indicted on one count each of attempted murder and first-degree assault, four counts of second-degree assault, three-counts of third-degree assault, eight counts of unlawful use of a weapon and 10 counts of reckless endangering.\nLonzo Murphy was indicted on one count each of attempted murder, first-degree assault, felon in possession of a firearm, hindering prosecution and tampering with physical evidence. He is also charged with four counts of second-degree assault, three counts of third-degree assault, eight counts of unlawful use of a weapon and 10 counts of reckless endangering.\nMarquel Diamond Dugas was indicted on one count each of attempted murder and first-degree assault, four counts of second-degree assault, three-counts of third-degree assault, eight counts of unlawful use of a weapon and 10 counts of reckless endangering.\nA trial is tentatively scheduled to begin in February 2015.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}