{"uri": "http://www.floridatoday.com/story/news/local/2016/12/02/investigation-underway-after-police-involved-rockledge-shooting/94794324/", "title": "Teen shot by police in Rockledge resting; FDLE investigates", "dct": "Fri, 02 Dec 2016 00:00:00 GMT", "id": "52f2ee3d31a75b25cf2b9fe1e57c90c3", "content": "ROCKLEDGE —The Florida Department of Law Enforcement continues to investigate the officer-involved shooting of a 17-year-old, which happened after Rockledge police responded late Thursday to calls about two teens breaking into cars.\nThe teen was shot in the chest, according to Brevard County spokesman Don Walker, and taken to Holmes Regional Medical Center in Melbourne. Friday afternoon he was stable and resting comfortably in the hospital, Police Chief Joseph LaSata said.\nThe chief said the teens drove a white sedan directly at an officer, who had to move out of the way before they crashed into a stationary patrol car. They then crashed into a ditch on the side of the road near Cogswell and Hawk Streets off Barton Boulevard. While the 17-year-old was pinned in the car, the second teen, 15, ran.\nLaSata said officers found him two hours later hiding on a porch and is now in custody. He had property from other burglaries, LaSata said. Neither have been charged with a crime, so their names have not been released, but LaSata said both will be charged with felonies.\nBody camera footage from the incident shows Cpl. Nicholas Galluzzi, a 17-year veteran with the department and commanding SWAT officer who was a 2007 Brevard officer of the year, with the 17-year-old on the ground outside of the white sedan that had crashed. Officers repeatedly told the teen not to move, to which he replied that he couldn't move.\nA shot is heard, the teen begins to scream, and he asks repeatedly why he was shot.\n\"Why did you shoot me?\"\n\"You kept moving your hands,\" Galluzzi replies.\nAs other officers helped, the teen said he was scared. One officer asked him if he had any guns on him and the boy said he did not.\nDuring a news conference Friday with FDLE Special Agent Rich Piccininni, LaSata said while officers did not find a weapon on the teen, they are \"working on information that there is a stolen firearm in the car.\"\nHe said FDLE is now in charge of the case, and investigators have not been inside the vehicle yet to search it.\nPiccininni said the investigation will include looking at why Galluzzi used his gun. A Taser or stun-gun wasn't used, LaSata said.\nGalluzzi has retained an attorney and has not spoken to LaSata or to FDLE officials related to the investigation. Galluzzi has never been involved in a shooting before but does have a disciplinary record with the department. One of the disciplinary actions was a verbal reprimand after Galluzzi struck a Murrell Road Walgreens, causing over $400 worth of damage to his patrol car.\nGalluzzi has also been commended many times throughout his career, including receiving the 2007 Officer of the Year award from the Rockledge Police Department.\nFDLE Spokeswoman Gretl Plessinger said Friday afternoon the agency is in the process of conducting interviews, collecting evidence and reviewing information.\nShe said these cases can take weeks or months before all of the evidence is collected and presented to the state attorney's office, where prosecutors will decide if the officer's actions were criminal or not.\nLynne Bumpus-Hooper, a Viera spokeswoman for 18th Judicial Circuit State Attorney Phil Archer, said they had not been given the case yet, and a prosecutor had not been assigned as of Friday.\n“Florida Department of Law Enforcement is investigating it (the shooting) and when they conclude their investigation they’ll present it to us,” she said. “We are available, and have spoken to them today about steps that would be necessary to take to ensure the quality of the investigation. Beyond that, we provide assistance to our law enforcement departments to the best of our ability any time they request us to. On the front end of the investigation it’s usually ‘is this search warrant legally sufficient,’ things like that.”\nArcher’s office, she said, doesn’t normally turn to a grand jury to review police-involved shootings.\nOnce FDLE issues a report, which can run into thousands of pages, Archer’s office will determine if any criminal charges are warranted.\n“The guys here are pretty fast, they’ll be aware that it’s coming,” Bumpus-Hooper said. “It’s assigned to a veteran prosecutor who has handled numerous cases with quite a bit of history. This prosecutor will review it, see if there’s additional work to be done and then review it with senior staff. And the person with the ultimate responsibility is our State Attorney (Archer,) he has to sign off on whatever charges would be filed.”\nShe noted Archer’s office earlier this year filed second-degree murder charges against a deputy sheriff.\nDeputy Yousef Hafza, 32, was charged with second-degree murder and attempted second-degree murder in the fatal June 19 roadside shooting of a 25-year-old man in Palm Bay. Hafza was off duty at the time of the incident and was not acting in the capacity of a law enforcement officer at the time of the shooting, FDLE said.\nMelissa E. Holsman of USA TODAY NETWORK – Florida contributed to this report."}