{"uri": "http://www.wftv.com/news/local/officer-involved-shooting-under-investigation-in-rockledge-officials-say/472377659", "title": "Teenage burglary suspect shot by veteran Rockledge police officer, official says", "dct": "Fri, 02 Dec 2016 17:48:00 GMT", "id": "a601cd07c84174d0534dd3ddca2290cc", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nROCKLEDGE, Fla. - A 17-year-old burglary suspect was shot in Rockledge overnight by an officer after a car chase that resulted in a police cruiser being hit and the suspected getaway vehicle wrecked in a ditch, investigators said.\nPolice first responded to the area of Hawk and Cogswell streets just before midnight Thursday after receiving several calls from residents about two individuals breaking into cars, Rockledge Police Department spokeswoman Donna Seyferth said.\nThe two fled from officers in a white Toyota Corolla and at some point in the chase one of the police cruisers was hit by the suspects’ car, Seyferth said.\nRaw: Rockledge officer-involved shooting body camera video\n\"Officers tried to stop that vehicle, that vehicle fled, actually striking one of their vehicles, one of our patrol cars, as it fled,” she said.\nThe Corolla ended up crashing into a ditch at the intersection of Hawk and Cogswell streets and when the two suspects got out of the car, one was shot by Cpl. Nick Galluzzi, a 17-year-veteran of the department, Seyferth said.\nThe other individual, Anthony Pierre, 15, ran away, but was caught by officers a short time later, she said.\nMore stories on WFTV.com:\nRockledge police Chief Joseph LaSata released bodycamera video of the shooting Friday afternoon. He said he wanted to release the video in the interest of transparency and said the video speaks for itself.\n“Nothing is more important to me than the trust of our community,” LaSata said.\n“Don’t move, don’t move, don’t move,” Galluzzi said to the teen in the bodycamera video.\n“Why did you shoot me?” the 17-year-old asked.\n“You kept moving your hands,” Galluzi said.\n“I’m scared,” the teen said.\n“Just relax. We’re going to get you help. We’re going to get you help,” Galluzi said.\nThe 17-year-old told police he did not have a weapon on him. He was taken to Holmes Regional Medical Center, where he is expected to survive, police said.\nThe 17-year-old faces felony charges related to the car burglaries and pursuit, police said. The teen’s name has not been released.\nPierre was already on felony juvenile probation for car burglary.\nThe Florida Department of Law Enforcement is investigating the shooting and Galluzzi was placed on paid administrative leave, which is standard procedure in an officer-involved shooting, Seyferth said.\nRelated stories:\n© 2017 Cox Media Group."}