{"uri": "http://www.floridatoday.com/story/news/2016/12/05/warrant-issued-rockledge-teen-wounded-officer/95010472/", "title": "Teen wounded by Rockledge officer arrested, set for court", "dct": "Mon, 05 Dec 2016 00:00:00 GMT", "id": "e63be9d17ee48ea5cc0ebf5e3982f63e", "content": "A Melbourne teen shot and wounded by a Rockledge police officer following a pursuit last week has been arrested and is expected to go before a juvenile court judge Tuesday afternoon.\nThe 17-year-old, whose name is not being released by FLORIDA TODAY because of his age, was arrested after being released from the hospital where he was recovering from a gunshot wound to the shoulder.\nHe was charged with three felony counts of vehicle burglary and one felony count of grand theft in connection with what police said was a series of break-ins that led to the Dec. 1 confrontation with officers in a Rockledge neighborhood.\nA police body cam video shows that the teen was lying on the ground along a darkened ditch with his hands outstretched moments before the veteran officer and SWAT commander fired his gun. A shotgun was later found in a wrecked Toyota Camry the teen and a 15-year-old accomplice were in, police reported.\nThe Florida Department of Law Enforcement is investigating the case. The juvenile judge will hear the charges and determine whether to hold the teen in custody for the next 21 days. A delinquency hearing will be held or scheduled for the charges. The state attorney's office has not made a decision on whether to pursue charges against the teen as an adult.\nMonday, Rockledge police had turned filed a warrant for the teen's arrest. \"There is a warrant for his arrest that has been filed with the Brevard County Sheriff’s Office. We don’t know if he’s out of the hospital or not but they will pick him up,” said Investigator Bob Weigel with the Rockledge Police Department on Monday.\nThe 15-year-old driver of the Toyota Camry the 17-year-old was riding in was arrested Friday and charged with burglary and grand theft. He told investigators that he and his friend had been \"car hopping,\" or pulling car door handles to see if they could get in, according to police.\nPolice searched the Camry.\n“We found several items in the car, including a shotgun,\" Weigel said. \"We’re still doing a history on it to see if it was stolen.” The officer involved in the shooting, Cpl. Nick Galluzzi, remains on administrative leave.\nThis was the ninth reported officer-involved shooting in Brevard County this year — three of which were fatal. In 2015, nine police-related shootings were reported, with three of those were fatal, according to the state attorney's office.\n\"Galluzzi's very active in the community with the kids and volunteers his time,” said Weigel. “He’s a good guy and a good officer,” he said.\nThe incident happened just before midnight Thursday near the intersections of Hawk and Cogswell streets shortly after residents called the police to report several vehicle burglaries in the area. Officers arrived and spotted two teens – including the 15-year-old driver – in the Camry.\nPolice said the driver struck a patrol car before crashing into a nearby ditch. It was then that Cpl. Nick Galluzzi, a SWAT commander, and a firearm instructor, confronted the older teen lying on the ground.\nInvestigators said Galluzzi, with his weapon drawn, approached the ditch as police lights flashed behind him.\nWhat happened next is being examined by Florida Department of Law Enforcement investigators. The officer fired his weapon, the bullet piercing the teen’s shoulder and lodging in his chest. Galluzzi next yelled \"Don’t move! Don’t move\" as the teen screamed in pain and asked, \"why you shot me? Oh my God!\"\nGalluzzi told the teen, \"You kept moving your hands.” He then told another officer to help.\nA review of Galluzzi’s personnel file shows a number of commendations that have been noted over the years, including his participation in the Cocoa Police Department’s gun buyback program.\nIn one letter nominating him for a commendation in 2003, the writer noted that Galluzzi assisted a mother and child who were stranded in the cold and purchased several nights for them at an area hotel.\nHe also had several disciplinary notices. One included a verbal reprimand for his role in striking a Walgreen’s building, causing $420 to the structure.\nAnother case, forwarded to the Criminal Justice Standards and Training Commission in 2016, involved questions over an arrest warrant. The commission found the issue was not sustained or fell outside of the parameters of a moral violation, records show.\nThursday's incident was the first police-related shooting for the 50-officer agency since the early 1990s, said Donna Seyferth, a spokeswoman for the department.\nThe state's investigation of the shooting will be forwarded to the state attorney's office for review once it is completed.\nContact Gallop at 321-242-3642, jdgallop@floridatoday.com and Twitter at @JDGallop"}