{"uri": "http://www.tristateupdate.com/story/31973605/shooting-at-boondocks-bar-grill-leaves-one-dead-three-injured", "title": "Update: Charleston Police arrest suspect in Boondocks shooting", "dct": "Sat, 14 May 2016 14:56:00 GMT", "id": "587ba6c73c55644405253f14b7c31068", "content": "CHARLESTON, WV -\nUPDATE (9:20 p.m. 5/21/16)\nCharleston Police arrested Jacques Lamar Slade on Saturday, May 21, 2016, for the deadly shooting last weekend at the Boondocks Bar & Grill.\nJamaine Sutton of Dunbar was killed as a result of multiple gunshot wounds and the West Virginia Medical Examiner's Office ruled his death a homicide.\nSlade, 26, was identified by two witnesses present in the bar at the time of the shooting as the person who killed Sutton and those statements were corroborated by video surveillance inside Boondocks Bar & Grill on Washington Street in Charleston.\nSlade, who is from Gastonia, North Carolina, is charged with first-degree murder.\nUPDATE (7:56 p.m. 5/21/16)\nThe Charleston Police conducted a raid Saturday, May 21, 2016, on the Westside and made an arrest in connection with last weekend's deadly shooting at Boondocks Bar & Grill.\nCharleston Police said they arrested the suspect responsible for the shooting death of Jamaine Sutton of Dunbar.\nLast weekend the Charleston Police identified Donnell “Pops a lot’’ Strong as a person of interest.\nStay with 13 News for updates.\nUPDATE (5:04 p.m. 5/17/16)\nDocuments from the Magistrate Court of Kanawha County show Donnell Strong has a long criminal record. Strong is still wanted as a suspect in the fatal Boondocks shooting case.\nIn 2007 Strong faced three counts of \"unlawfully, feloniously and wantonly perform an act with the use of a firearm which created a substantial risk of death and serious bodily injury to another.\" Two of the counts were dropped in that case. He was sentenced with 6 months to 2 years in prison.\nIn 2013 Strong was charged with a felony possession of heroin with intent to deliver. He faced 1-15 years behind bars.\nUPDATE (1:38 p.m. 5/15/16)\nThe Charleston Police Department has identified a suspect Sunday, May 15, 2016, in connection with the shooting at Boondocks Bar & Grill.\nDonnell “Pops a lot’’ Strong is wanted by detectives for wanton endangerment and for being a convicted felon in possession of a firearm. He is considered armed and extremely dangerous.\nIf anyone sees or knows the whereabouts of Strong, do not approach him and call 911.\nUPDATE (4:06 p.m. 5/14/16)\nThe West Virginia Alcohol Beverage Control Administration suspended the liquor license for Boondocks Bar & Grill effective Saturday, May 14, 2016, according to spokesman Gig Robinson.\nA shooting overnight at Boondocks left one deal and three others injured.\nThe Charleston Police Department is still investigating the incident.\nStay with 13 News for the latest.\nORIGINAL\nCharleston, WV-- A shooting overnight has left one dead and three others injured according to Lt. Cooper of Charleston Police Department's Criminal Investigation Division.\nThe shooting occurred at Boondocks Bar & Grill, which is located near 2500 W. Washington St. in North Charleston, at approximately 1:45 a.m. Saturday, May 14, 2016.\nDetective Cooper stated that Jamaine Sutton, 32 of Dunbar, was killed inside the bar. Three others were injured and taken to CAMC General Hospital. He added that their injuries do not appear life threatening.\nThere have been no arrests made in connection with the shootings. However, The Charleston Police Department is currently working on a lead.\nDetective Cooper said that this was the first shooting in the area in four months."}