{"uri": "http://www.wvgazettemail.com/news/20160514/1-dead-three-others-wounded-in-charleston-bar-shooting", "title": "1 dead, three others wounded in Charleston bar shooting", "dct": "Sat, 14 May 2016 00:00:00 GMT", "id": "5ebfbb1e9880b3cfdd9ff09664d380f5", "content": "One man was killed and three others wounded during a shooting early Saturday at a Charleston bar, police say.\nThe shooting happened after 2 a.m. at the Boondocks Bar and Grill in the 2300 block of Washington Street West.\nJamaine Sutton, 32, of Dunbar, was pronounced dead at the scene, according to Lt. Steve Cooper, chief of detectives for the Charleston Police Department. Three other victims were taken to Charleston Area Medical Center General Hospital with injuries that are not life threatening, Cooper said.\n“There had been another altercation between these two groups at a different party somewhere else in Charleston; they were ejected from that location and both parties ended up at the Boondocks bar,” Cooper said.\nNumerous shots were fired from more than one shooter inside and outside the bar, Cooper said.\nA vehicle carrying shooting victims initially fled the scene to go to a hospital but police stopped it and helped get them to the hospital, Cooper said.\nOne victim was shot approximately seven times, but the man’s wounds do not appear to be life-threatening, Cooper said.\nThe incident happened during an after party for rapper Rico Richie, who according to social media posts was scheduled to perform at Beni Kedem earlier in the night.\n“[The after party] doesn’t seem to have any particular bearing on the shooting itself,” Cooper said.\nCooper said the number of guns found at the scene led investigators to believe that several people were carrying hidden firearms at the party. He declined to say how many weapons were found.\n“The Charleston Police Department has been receiving complaints about problems at Boondocks for a while,” Cooper said. “This incident last night was horrific. It’s amazing that more people weren’t hurt or killed. We had officers arriving on the scene as shots were still being fired.\n“Fortunately none of them were hurt and the officers weren’t forced to use deadly force,” Cooper said.\nNo arrest had been made Saturday evening, but Cooper said police were actively investigating a lead. Police have not released the names of the other victims.\nState Alcohol Beverage Control Administration spokesman Gig Robinson said Saturday afternoon the ABC is suspending the bar’s alcohol license to “send the message that this type of violence that’s happening in and around a licensed establishment is just not acceptable.”\nSaturday’s shooting marked the first on the West Side in four months, Cooper said. Nate Chaney, 22, of Charleston, was shot to death in broad daylight on Jan. 14 while in the parking lot at Littlepage Terrace apartments, on Washington Street West. The city’s last shooting injured two people in Kanawha City Jan. 30.\n“It’s unfortunate that this happened, but we are grateful for the four months of peace we’ve had between shootings,” Cooper said. “That’s a long time.”\nReach Lori Kersey at lori.kersey@wvgazettemail.com, 304-348-1240 or follow @LoriKerseyWV on Twitter."}