{"uri": "http://www.indystar.com/story/news/crime/2016/04/20/2-year-old-dies-self-inflicted-gunshot-would-northwest-side-police-confirm/83317528/", "title": "Child, 2, kills self with gun from mom's purse", "dct": "Wed, 20 Apr 2016 00:00:00 GMT", "id": "3a8d73ef77497b47800201cfb52c0974", "content": "Michael Anthony Adams/IndyStar\nA 2-year-old boy died Wednesday after he shot himself with a handgun he found in his mother's purse, police said.\nThe 23-year-old mother \"had momentarily stepped away,\" police said, when the child, Kiyan Shelton, climbed to a kitchen counter.\nKiyan removed a pistol from his mother's purse and shot himself about 9 p.m. in a northwest-side home in the 5200 block of Alameda Road, near 52nd Street and West Kessler Boulevard.\nOfficers arrived and found the boy with a gunshot wound to the shoulder. The child was taken in critical condition to Riley Hospital for Children at IU Health, where he later died.\nKiyan and his mother were the only people home at the time of the shooting. Police said she had a valid gun permit for the .380 Bersa semi-automatic pistol.\nIndianapolis Metropolitan Police Department Capt. Richard Riddle said Thursday afternoon that the case remains under investigation by homicide detectives. The incident has been categorized as a death investigation.\n\"Upon completion of their investigation, they will present their findings for a charging decision. The mother fully cooperated with the investigation and was released last night,\" Riddle said. \"At this point, this appears to be a tragic accident, but the (Marion County prosecutor's office) will have final decision making on whether there were any criminal culpability in this incident.\"\nDuring a Thursday morning press conference convened for unrelated reasons, IMPD Chief Troy Riggs said the shooting is a tragic situation for Kiyan's family, and stressed the importance of gun safety.\n\"Tragedies can occur and it's hard to believe that this could potentially occur to such a young person,\" he said. \"I didn't realize that this could occur until I had a gun safety class years ago, and they showed demonstrations of what young children can do with weapons. It's remarkably scary. I'll just be quite frank.\n\"So never underestimate the ability of a child to fire a weapon. No matter how young they are.\"\nIMPD suggests keeping guns unloaded, locked and out of reach of kids; storing ammunition and guns in separate locations; and storing keys for gunlocks and ammunition safes separately from house keys.\nIndyStar reporter Justin L. Mack contributed to this story.\nCall IndyStar reporter Vic Ryckaert at (317) 444-2701. Follow him on Twitter: @vicryc.\nCall IndyStar reporter Michael Anthony Adams at (317) 444-6123. Follow him on Twitter: @michaeladams317."}