{"uri": "http://wkrn.com/2015/03/06/police-search-for-suspect-in-whites-creek-shooting/", "title": "11-year-old charged in fatal shooting of north Nashville teen", "dct": "Fri, 06 Mar 2015 16:38:00 GMT", "id": "b03f4f9b02c3ce2f66a1ab98810b955d", "content": "NASHVILLE, Tenn. (WKRN) – An 11-year-old boy has been charged with criminal homicide in the shooting death of a 15-year-old in north Nashville Friday afternoon.\nPolice said the shooting happened at 3:30 p.m. while the victim, DaVontae Ziegler, was sitting outside his Gwynnwood Drive home. He was with the 11-year-old and another juvenile, all of whom were friends.\nThe 11-year-old told police he was playing with the gun, which he claims to have found, when DaVontae was shot.\nDaVontae ran to a friend’s home nearby on McCarthy Park Lane to ask for help. He was taken to Vanderbilt University Medical Center where he died during surgery.\nNews 2 spoke with DaVontae’s aunt and uncle, also his guardians. They said they are devastated by the loss.\n“How come that parent didn’t know that child had a gun? My child is gone now. I have to bury him and I can’t bury my child. I just want him to come home,” explained Amelia Griswould.\nHer husband said the 11-year-old accused in the shooting came over to their home often.\n“He would come over and play video games. He was over the other day,” said Glenn Griswould.\nThe Griswoulds said DaVontae was a well-liked football player at Hunters Lane High School. Hours before his death, he expressed excitement about getting his driver’s license this year.\nA funeral will be held for the teen next week.\nThe name of the 11-year-old will not be released since he is under the age of 14. He was released into the custody of his parents on Monday.\nThe youth was released to his family because authorities do not see him as a danger to the public.\nA settlement hearing was originally scheduled for April 13, but was continued until July 13.\nWhile Assistant District Attorney Stacy Miller did not want to address the case specifically, she talked about how juvenile defendants are treated differently than adults facing the same charges.\n“The big thing about juvenile court is that balancing of the public safety with the focus on [the fact that] these are kids. If we want these kids to grow up and have a good life, we need to really focus on what went wrong and how can we fix it, and that’s what we do,” Miller explained, “If we can allow a youth to leave detention and receive treatment, that’s really what our goal is.”\nMiller said that it was possible for charges could be dropped if the 11-year-old adheres to the treatment and rehabilitation plan laid out for him in the hearing."}