{"uri": "http://www.heraldonline.com/news/local/crime/article64405932.html", "title": "York man charged in Rock Hill shooting that killed friend", "dct": "Sun, 06 Mar 2016 12:03:00 GMT", "id": "f115bc20bc6d4d618468f8bd84391299", "content": "A York man has been arrested in connection with a string of shootings in Rock Hill, South Carolina, that left one dead and several injured.\nQuintonio Bernard Porter, 23, was being held at the York County Detention Center Sunday on a charge of attempted murder. Porter also faces charges of possession of a weapon during the commission of a violent crime and unlawful carrying of a pistol as well as drug charges.\nRock Hill police say Porter was the second man in a car with 18-year-old Jarrius Harding when gunfire erupted at the intersection of Keels Avenue and Black Street Friday afternoon.\nPolice said Sunday that Porter opened fire on unknown individuals at the intersection around 12:48 p.m. He was struck in the leg by a bullet in the shootout, then drove a car with Harding and another individual to the 600 block of Cauthen Street, where they were located by emergency responders. Harding died from injuries he received in the exchange, and Porter was transported to Piedmont Medical Center.\nWhen investigators determined Porter’s involvement in the shooting, he was arrested, denied bond in a municipal court hearing, and taken to the York County Detention Center on Sunday morning. In addition to the weapons charges, he faces charges of possession of crack with intent to distribute and possession of another controlled substance with intent to distribute. Both are second offense charges, according to a media release from the Rock Hill Police Department.\nfacebook twitter email Share\nFriends mourn teen killed in Rock Hill shooting\nFriends describe the victim who died in Friday's mid-day shooting in Rock Hill as an outgoing, typical teenager who was always smiling. Authorities have not released the teen's name as of this posting. This is Rock Hill's first homicide.\nby Teddy Kulmala\nPorter’s arrest comes days after four separate shooting incidents across Rock Hill left one dead and four injured in a matter of hours.\nOn Thursday night, Rock Hill police were called to three different homes in quick succession for reported shootings. Three people were injured at a home on 900 block of Arlington Avenue around 8:20 p.m., and transported to Piedmont Medical Center with non-life-threatening injuries. One person was shot in the arm and another two were grazed by flying bullets.\nAt about the same time as the Arlington Avenue shooting, police were called to another reported shooting at a home on Lige Street. Seven people, including a 3-year-old and a 5-year-old, were inside the home on the 600 block of Lige Street when shots were fired into it, but none were injured.\nThat same night, police were called to a third shooting at 10:50 p.m. on the 1100 block of Pearson Drive. Five people in that home were uninjured in the shooting.\nFinally, police responded just after noon Friday to a shooting on Keels Avenue, where they found several shell casings in the roadway. A short time later, several residents in the 600 block of Cauthen Street placed 911 calls requesting EMS for two men in a car with gunshot wounds.\nHarding was fatally shot, and another man in the vehicle was taken to Piedmont Medical Center. Authorities said a third man in the car was not injured and was taken to police headquarters for questioning.\nHarding’s death was the city’s first homicide of 2016. Police have been unable to say whether all four shootings were connected, and remain under investigation.\nBristow Marchant: 803-329-4062, @BristowatHome"}