{"uri": "http://sundancetimes.com/unlucky-shot/", "title": "Unlucky shot", "dct": "Thu, 08 Dec 2016 00:00:00 GMT", "id": "5174f3cc043294214736c1d9bd2d6756", "content": "Guide accidentally shot in the leg by hunter\nA hunting guide who was accidentally shot in the leg found himself in the fortunate position of being accompanied by two trauma surgeons. Rick Foster was glassing deer with his clients on a hillside at Mule Creek when he was caught by a bullet fired from across the canyon.\nAccording to reports from the Crook County Sheriff’s Office, Deputy Mike Rogers was called to Mule Creek Road on November 18. At the site, he met with the three hunters Foster had been guiding: Nick Bohl, Lenny Bhullar and Chet Royals.\nFoster was standing next to the dining room table, his leg having already been bandaged above the knee. He told the deputy that the group had been glassing deer when a loud gun shot rang out.\n“Rick advised that they could hear the bullet traveling through the air and, a second or two later, Rick stated he was struck by the bullet in his right leg,” says Rogers in his report.\n“The impact of the bullet spun him round before he fell to the ground.”\nAs Bhullar and Royals were both surgeons, they were able to tend to the wound so that the group could return to the lodge. Once there, it was cleaned and bandaged.\nFoster was sent to the hospital for further treatment while Rogers asked the rest of the group to escort him to the scene of the incident. Rogers found blood in the snow and Foster’s gloves still lying on the ground.\nRogers was able to locate tracks on the other side of the canyon from both a person and a wounded deer. He observed that the deer tracks were perfectly lined up with Foster’s position at the time he was shot and came to the conclusion that the person who shot the deer was also responsible for injuring the guide.\nBohl informed Rogers that an old trailer house that used to be used as a hunting lodge was located half a mile from the spot on New Haven Road. At the house, Rogers observed two male subjects dressed in orange.\nOne of the two men, Nicholas Helget, acknowledged he had been hunting in the area that morning and had wounded a deer. He explained that he had seen the deer shortly after first light and made a bad shot on it, hitting the animal low.\nThe deer began to run up the hill and over the ridge, so Nicholas told the deputy that he took another shot at it as it was about to top the ridge line, but shot over its back. He stated that he had tried to track the deer and did cross onto the neighbor’s property to look for it as he didn’t want it to go to waste, but did not take another shot.\nDeputy Rogers told Nicholas that the shot he took had traveled high across the canyon and hit another hunter in the leg. He explained that the horses Nicholas had seen on the ridge had been close to the area where the hunters had been located.\n“Nicholas advised that it was him for sure who took that shot,” says Rogers in his report.\n“Nicholas stated that, being from Minnesota, he is always conscious of his surroundings because of the amount of hunters in Minnesota.”\nAccording to Rogers, Helget was visibly upsetting on hearing what had happened and commented that he felt sick to his stomach. He said he had never even considered other hunters as he never sees anyone else in the area, he told the deputy.\nNicholas was issued a citation for reckless endangerment. Foster, meanwhile, recovered well from a reportedly minor injury."}