{"uri": "http://www.kwwl.com/story/30876320/2016/01/04/1-person-injured-in-overnight-dubuque-shooting", "title": "UPDATE: Toddler injured in Dubuque shooting, accidental", "dct": "Mon, 04 Jan 2016 12:13:00 GMT", "id": "5cb112a0f549c22ec73a71203d402821", "content": "DUBUQUE (KWWL) -\nUPDATE: Dubuque Police say the shooting involving 2-year-old Jeremiah Danta-Benjamin Horsley appears to have been an accident.\nCapt. Scott Engleman with the Criminal Investigation Division says they interviewed all the people in the apartment and there's no indication an adult was responsible for the discharge of the gun. It seems the victim accidentally shot himself.\nThe investigation remains ongoing and the Dubuque County Attorney will ultimately make a decision regarding whether a criminal charge is filed.\n*******************************************\nUPDATE: Dubuque Police say the boy injured in the shooting is 2-year-old Jeremiah Danta-Benjamin Horsley.\nUPDATE: KWWL News has been informed that the little boy injured in the shooting is in stable condition.\nHe is still in Iowa City at University of Iowa Hospitals and Clinics.\nPolice are still investigating and say the Department of Human Services is assisting.\nNo criminal charges have been filed.\n*****************************************************\nA calmer scene now, but Sunday night in downtown Dubuque in the 900 block of Main Street, police responded to a shooting.\n\"Our officers arrived on scene and located a small child, with injuries that were consistent with being shot. The child is almost three years old, will be three in February,\" Lt. Scott Baxter.\nIt happened just before midnight inside a multi-level apartment.\nPolice say there were several people inside, including other children.\nThere is some speculation, one of the kids got a hold of the gun. \"Some of the initial indications were that, this could've been an accidental discharge of a firearm. That's one strong possibility we're looking at,\" added Lt. Baxter.\nThe area is a part of Dubuque that's filled with many businesses, but police say the public is not in danger. Next to the apartment is a barbershop, also a Chinese restaurant. The manager there says a mom, dad and three kids live at the home, and they seem like a nice family.\nThe gun has been recovered and seized by police.\nAs for the little boy, he initially was taken to Finley Hospital in Dubuque, but then air-lifted to University of Iowa Hospitals in Iowa City, because his injuries are serious. According to the police report, he has facial wounds.\nPolice say they're conducting interviews to determine what exactly happened. At this point, no charges have been filed and no one has been arrested.\n**************************************************************\nUPDATE: Dubuque Police say a two-year-old boy is in the hospital after being shot late Sunday night.\nIt happened in an apartment at 942 Main Street.\nPolice say the child's injuries are serious and the boy is now in the hospital in Iowa City.\nPolice are looking into whether the shooting was an accident.\nKWWL will have much more on this investigation throughout the day.\n**********************************************************\nDubuque Police now say the Division of Criminal Investigation is not involved in the overnight shooting investigation.\nKWWL was told this morning by the department that the DCI was involved.\nPolice say it's possible someone confused their CID (Criminal Investigation Division) Unit with the DCI.\nAt least one person was injured in the shooting and we're waiting for more information to be released about what happened.\n********************************************************\nPolice are investigating a shooting that left one person injured in Dubuque.\nPolice were called to 942 Main Street at 11:43 p.m. Sunday night for gunshots. When police arrived, they found one person injured, who was taken to a nearby hospital.\nThe case is being investigated by the Iowa Division of Criminal Investigation. Police say this is an ongoing investigation.\nStay with KWWL as we are expected to learn more information later today.\nKWWL's Shirley Descorbeth contributed to this report."}