{"uri": "http://www.ktva.com/monster-scratched-4-year-old-hit-stray-bullet-describes-shooting-784/", "title": "‘A monster scratched me’: 4-year-old hit by stray bullet describes shooting", "dct": "Mon, 10 Oct 2016 19:49:00 GMT", "id": "74588b7ee99471aa341b9b8422debe35", "content": "ANCHORAGE –\nHayley Francy was sleeping in her East Anchorage bedroom when a stray bullet hit her last week.\nAnchorage police got called to the apartment on San Roberto Ave. near Russian Jack Park just after midnight Thursday. The four-year-old’s mom, Jessyca Francy, said she came home from work to find her daughter’s mattress covered in blood. She took her daughter to the hospital, where she learned the bullet had missed Hayley’s femoral artery by a quarter of an inch. When police arrived at the apartment to investigate, officers found a bullet hole above Hayley’s bed.\nWhen asked about that night, she said a monster hurt her.\n“A monster scratched me on the leg,” she said.\nHayley spent two days in the hospital. After being released, she refused to return to the apartment.\n“I don’t want to. Mom had to find a new home,” Hayley said, referring to the fact that Jessyca decided to move the family out of the apartment. APD said the shot was fired from a gun in a third-floor apartment. Officers interviewed someone in that unit, but no one has been charged with a crime.\n“There’s a lot of domestic violence that comes from that house,” Francy said. “Whatever happened, I want the closure of knowing how this happened and for somebody to be held accountable.”\nHayley has been staying with a family friend since she left the hospital. The Francy family is trying to move out of its apartment, but is finding it difficult to find a new home because of Francy’s criminal history.\n“I made a lot of mistakes in my past,” she said. “It does make finding a place to rent hard.”\nHayley is in good spirits, but has some difficulty walking. She said her favorite thing to do is run, and she’s hoping to be able to do it again sometime soon.\nThe family set up a GoFundMe account to help pay for the move and replacing Hayley’s mattress. It can by found by clicking here.\nKTVA 11’s Eric Ruble can be reached via email or on Facebook and Twitter."}