{"uri": "http://www.mineralwellsindex.com/news/teen-arrested-in-fatal-shooting-case/article_1a67fde0-45e0-11e6-a785-e73b2b485eac.html", "title": "Teen arrested in fatal shooting case", "dct": "Sat, 09 Jul 2016 00:00:00 GMT", "id": "b1f6b9502051a6d915ce9d75ee4dcf1f", "content": "Police say a teenager is dead in what appears to be an accidental shooting Friday night on the city’s southwest side.\nThe incident occurred shortly before 8 p.m. at a residence in the 2600 block of S.W 8th Avenue.\nOfficers and medical personnel arrived at the location and found a teenage male who had suffered a gunshot wound and who died at the scene.\nPct. 5 Justice of the Peace Bobby Hart late Saturday morning identified the victim as Brandan Sanmiguel, 18, of Mineral Wells. Hart ordered an autopsy.\nFamily members and friends of Sanmiguel are posting photos and thoughts to his Facebook page.\n“The preliminary information we have is that a group of young persons had gathered at the residence during the course of which one member of the group, another teenager, handling a weapon, discharged the weapon, striking the victim,” said Mineral Wells Police Chief Dean Sullivan.\nSullivan said officers were continuing to question everyone at the location, including the person who was handling the gun. He said the gun turned up stolen out of Oklahoma City.\nHe said stories \"began to deteriorate\" among the witnesses.\nAs a result, police arrested Andrew Reyes, 17, of Mineral Wells, on a charge of manslaughter. He was awaiting arraignment on the charge Saturday morning.\nTexas Ranger Tony Bradford was called in to assist in the investigation.\nMineral Wells ISD officials confirmed the victim was a Mineral Wells High School student. Counselors and grief support personnel were at the high school Saturday “to provide comfort and assistance to all who need it.”\n“This indeed is a sad day for our Ram Family,” the district said in a press release. “In the days ahead, there will undoubtedly be difficult moments for all of us to endure in the wake of this tragedy. While everyone will be responding to the situation in different ways, MWISD has every confidence in our professional and support staff and their ability to meet the needs of individuals as they arise.”\nStudents needing extra support in the days ahead can contact Carey Carter at the MWISD office at 940-325-6404.\n“MWISD extends our heartfelt sympathies to the family and asks that the community please remember this family in your thoughts and prayers during this difficult time,” the statement read."}