{"uri": "http://www.sltrib.com/news/2651125-155/police-family-of-four-dies-in", "title": "Police: Family of four dies in Father’s Day murder-suicide at Roy home", "dct": "Mon, 22 Jun 2015 06:42:00 GMT", "id": "348a91b984548708a9c0c3fd7019aa78", "content": "The call was made by a family member who had last heard from Shawna Smith via text message about 1 p.m. and had become concerned when he had not heard from her in hours.\nWhen police went to the home, the lieutenant said, they found the front door open and the deceased inside. All four family members appear to have died from gunshot wounds.\n\"Russell's gunshot wound looks to be self-inflicted,\" Kevin Smith said.\nA motive for the slayings remained unclear Monday. The lieutenant said the couple had no known history of domestic disputes, and police had never been called to their home before.\n\"This is a very quiet family,\" Kevin Smith said. \"There is no indication they fought before. They just kind of kept to themselves.\"\nInvestigators did not disclose where in the home they found the bodies or what type of gun was used in the shootings.\nPolice also would not say in what order they believe Russell Smith, 30, may have shot his 26-year-old wife and their children.\nNeighbors have told investigators they didn't hear or see anything unusual at the home Sunday, Smith said.\nShawna Smith was the assistant manager of the Busy Bee Playhouse child care in Roy. A center representative confirmed that she had been employed there for nearly nine years, but declined further comment.\nFamily of the Smiths did not reply to requests for comment Monday. Friends of Shawna Smith plan a candlelight vigil Tuesday at 7:30 p.m. in front of her home.\nAccording to a search of county records, Russell and Shawna Smith had lived at their Roy home since 2009. Both were graduates of Northridge High School in nearby Layton.\nA search of Utah court records revealed no criminal history for either Russell or Shawna Smith.\nThe Smiths' deaths mark the fifth time since 2013 that the perpetrator of a Utah murder-suicide killed two or more family members before taking his or her life.\nThose with violence in the home can contact the Utah Domestic Violence Council at 1-800-897-LINK or at www.udvc.org. Free and confidential help is available 24 hours a day.\n» Next page... Single page"}