{"uri": "http://www.postandcourier.com/article/20140929/PC16/140929337/1177", "title": "911 recordings shed some light on Colleton County shooting's aftermath", "dct": "Sun, 28 Sep 2014 00:00:00 GMT", "id": "623ca663b17a6e15c7bd0cc8694c4b9d", "content": "The shooting that left one dead and six others wounded Sunday near Walterboro is believed to be gang related, officials said.\nAuthorities have received \"limited cooperation\" from the victims, according to Colleton County Sheriff's Office spokeswoman Amye Stivender on Monday. But investigators knew enough to deem the violence as gang related, she said.\nConversations between witnesses and 911 dispatchers painted a chaotic scene around 6:45 a.m. Sunday at Sandy Dam Lane.\nBleeding from a gunshot wound to his leg, Shontoni Brown, 20, made his way across the dirt road of Sandy Dam Lane and knocked on his aunt's door for help, the recordings revealed.\nHe spoke briefly with a dispatcher before handing the phone to his aunt.\n\"He just showed up at my door. He's bleeding. Please send somebody ma'am,\" the aunt said during the call. Another man on her porch was barely responsive having suffered a gunshot wound to his back, she said.\nParamedics were on the way, the dispatcher insisted, as the aunt ordered someone to get in a car and rush the man to the emergency room.\n\"He needs to sit down. ... I need y'all to stay there,\" the dispatcher said. \"If you leave that house, it's a longer distance to get some help.\"\nSirens followed seconds later on the other end of the line.\nElijah Mikel, 27, of Walterboro, was shot multiple times and died at the scene.\nFirst responders found three other men with wounds near a car in the home's yard. Two more arrived at a local emergency room in a private vehicle, authorities said.\nIn addition to Brown, Stivender identified the men struck by bullets as Bryant Davis, 19; Keandre Frazier, 19; Deandre Mikel, 20; and Zaquann Hampton, 17. Another man, 17-year-old Raquann Ford, was grazed by a bullet, she said.\nIn another call to 911, a man asked the dispatcher to send a deputy in a hurry to Sandy Dam Lane.\n\"I've got somebody pinned up in the woods with a shotgun,\" the man said. He hung up the phone when the dispatcher told him law enforcement was already in the area.\nColleton Medical Center called in extra staff to help with the influx of trauma patients, authorities said. Officials with the hospital turned to law enforcement when two people with gunshot wounds showed up at the hospital in a private vehicle.\nNeither one said much on arrival, hospital officials said during calls to 911.\n\"He's not saying where he was at,\" one dispatcher asked, trying to determine whether the men were connected to the gunfire on Sandy Dam Lane.\n\"No. He had a green bandana on. That's all I can tell you,\" a hospital official responded.\nStivender said the Sheriff's Office would not name the gangs involved until investigators receive more information.\nA motive hadn't been determined Monday and no arrests made, Stivender said. The shooting remains under investigation, she said.\nAnyone with information about the shooting can contact the Sheriff's Office or Crime Stoppers at 554-1111.\nReach Christina Elmore at 937-5908 or at Twitter.com/celmorePC."}