{"uri": "http://www.news-leader.com/story/news/crime/2016/07/25/1-dead-1-injured-shooting-ava-school-parking-lot-police-say/87519312/", "title": "1 dead, 1 injured in fistfight turned shooting at Ava school parking lot, officials say", "dct": "Mon, 25 Jul 2016 00:00:00 GMT", "id": "d9867b0edc099d1ac37cdd496ffe8454", "content": "One teenager is injured and one is dead after a shooting in front of 10 to 15 witnesses in the Ava High School parking lot early Monday morning, according to Sgt. Tim Stuart of the Ava Police Department.\nAt 1:45 a.m., Ava police received a call reporting that someone was possibly headed to the school parking lot on North Jefferson Street with a gun, Stuart said.\nResponding officers heard gunshots as they pulled into the parking lot and spoke to witnesses at the scene, Stuart said.\nOne teen fired three shots at another teen at the parking lot before fatally shooting himself, Stuart said. The injured teen was taken to a hospital for surgery and as of 8:30 a.m. was reportedly in stable condition, he said.\nBoth individuals are male and both graduated from Ava High School earlier this year, Stuart said. Their approximate age is 17, he said.\nDouglas County Sheriff Chris Degase said he and his deputies were on the scene shortly after the shooting and helped Ava police with the investigation.\nDegase said that the two individuals involved were there for a mutual confrontation, likely a fistfight, and that the other 10 to 15 people were friends who came to watch. But no punches were thrown, he said.\nOne teen approached the other teen, pulled a pistol from the back of his pants and shot him from about 4 to 5 yards away, causing everyone in the parking lot to scatter, Degase said. The teen who was shot ran behind a pick-up truck and hid, then was shot twice more by the shooter who lay down to shoot beneath the truck, Degase said.\nAfter being shot three times, the injured teen then ran about 100 yards away from the scene while the shooter turned the gun on himself, Degase said.\n\"I just hate that kids get to the point where they feel this has to happen,\" Degase said of the shooting.\nInvestigators are still looking into a motive, Degase said, but emphasized that \"this was not a bullying situation.\"\nNancy Lawler, superintendent of Ava schools, affirmed that the two people involved had graduated from high school and called the shooting a \"blow to the community.\"\n\"It's always tragic when you lose students, but this is the most violent way we've lost a student,\" she said.\nThere was no summer school scheduled for Monday, Lawler said, and the school's band camp will be held as scheduled."}