{"uri": "http://www.hawaiinewsnow.com/story/33293344/two-teens-critically-injured-in-north-shore-shooting", "title": "Witnesses describe events leading up to deadly North Shore double shooting", "dct": "Sun, 02 Oct 2016 02:36:00 GMT", "id": "54011e012a129e62acca27223f33e4ef", "content": "TURTLE BAY, OAHU (HawaiiNewsNow) -\nPolice say two people are dead following a double-suicide Friday night at the Turtle Bay Resort parking lot.\nThe victims were a 17-year-old girl and a 44-year-old man. Police are not disclosing how the two knew each other.\nJust before 8:30 p.m. Lori Halemano said she pulled into the parking lot to attend a fundraising concert in the area.\n\"He was yelling and screaming at her at the top of his lungs and she was quiet at first and he just kept yelling at her,\" Halemano described.\nShe witnessed the pair arguing and pacing back and forth. \"It appeared she was trying to get away from him, so they ended up from one end of the parking lot over to another part of the parking lot.\"\nHalemano said three police cruisers then pulled up the scene as she walked into the lobby.\n\"All I heard was the guy yelling at her and her screaming back at him, then the two gunshots then everything went silent,\" she said. \"My initial reaction was I thought 'Oh my gosh he probably just shot the girl and the police officer shot him.'\"\nBut police say that's not what happened.\nAccording to homicide detectives, the man and the teenager were found inside a vehicle with self-inflicted gun shot wounds to the head.\n\"We saw them pull this guy out of the back seat, they put him on the ground and starting doing CPR,\" said another witness Steven Van Ness.\nPolice say they were both transported to the hospital where they later died.\nHawaii News Now sources identified the man as Shane Francisco.\nHonolulu Police put out a missing person report on Sunday, September 25th seeking the public's help in locating him.\nIt said Francisco was emotionally distraught and may have been driving a black Jeep Wrangler.\nSources say someone reported spotting that Jeep in the Turtle Bay parking lot Friday afternoon. Police kept an eye on it until the two arrived at the vehicle.\nHawaii News Now also learned the 17 year old girl had been missing since June and was believed to be a runaway.\nThose who knew her say she was a senior at Mililani High School but recently transferred out.\nHalemano says she doesn't understand how this case is classified as a double suicide based on what she witnessed.\n\"It's just a little strange to me with how everything transpired,\" she said. \"How he was yelling at her and she seemed threatened and she didn't want to be there near him. I find it odd that she would want to take her own life together with him at the same time.\nThe investigation is ongoing.\nAutopsies are tentatively scheduled for Monday.\nCopyright 2016 Hawaii News Now. All rights reserved."}