{"uri": "http://www.hawaiinewsnow.com/story/33309493/man-ordered-to-stay-away-from-teen-prior-to-north-shore-double-shooting", "title": "Man ordered to stay away from teen prior to North Shore shooting", "dct": "Tue, 04 Oct 2016 20:45:00 GMT", "id": "7dbc7bf69876d3a72c04f6c65ee4efb5", "content": "TURTLE BAY, OAHU (HawaiiNewsNow) -\nNew details about the relationship between a 17-year-old girl and a 44-year-old man who took their lives in a North Shore parking lot over the weekend are prompting domestic violence advocates to question whether authorities could have done more to protect the teen.\nThe Honolulu Medical Examiner's office has confirmed that both committed suicide with a firearm.\nWhile Hawaii News Now doesn't typically report on suicides, this case raises serious questions about the justice system and whether law enforcement could have intervened earlier when red flags were raised.\nThe 44-year-old man who the teen was in a relationship with has been identified as Shane Francisco, her one-time mentor. Hawaii News Now is not identifying the teen.\nLast October, the girl's mother filed a restraining order against Francisco, court documents show. Her mother told the court that her daughter's relationship with Francisco may have started three years earlier, when the girl was 13 or 14.\nWhen an officer asked if the teen wanted to press charges, the mother said her daughter became confused and disturbed -- and then ran away.\nNanci Kreidman, of the Domestic Violence Action Center, said the response wasn't surprising.\n\"It's very scary to become involved with the criminal justice system that doesn't always work and more retaliation is possible,\" she said.\nBut Kreidman is asking why police didn't charge Francisco for having sex with a minor.\nAnd despite the TRO, Hawaii News Now has learned, Francisco was still allowed to carry a gun for his military duties as a master sergeant with the Army National Guard.\nAt the same time last year, Francisco's ex-wife was also granted a restraining order. She said she felt threatened after he loaded his gun in their home.\nIf only, Kreidman says, police had intervened at that point.\n\"Possibly this young woman would be alive today,\" she said. \"Possibly, he could have gotten the help he needed and his family wouldn't be destroyed, his children would still have their father.\"\nKawika Rogers, the girl's recent boyfriend, says she appeared to be an abusive relationship with Francisco. Rogers says the girl said she was engaged to Francisco, but Rogers sensed she wanted to escape.\n\"She kept telling me she wanted to come to Washington,\" Rogers said. \"She wanted to get off the island and come stay with me.\"\nRogers, a Marine stationed on the Mainland, says Francisco called him in July -- with the teen at his side -- and forced her to choose between him or Rogers.\n\"I could hear her just crying in the background,\" Rogers said.\nRogers says the 17-year-old was afraid of Francisco and wanted out of their relationship, but Rogers had no idea she was in serious danger.\n\"There were a lot of issues with him and her and he was just trying to work his way into her life,\" said Rogers. \"She was trying to get away from the guy because I know he was causing problems.\"\nCopyright 2016 Hawaii News Now. All rights reserved."}