{"uri": "http://wncn.com/2016/11/01/at-least-1-person-shot-in-durham-tuesday-morning/", "title": "Teen dies after Durham apartment complex shooting", "dct": "Tue, 01 Nov 2016 05:21:00 GMT", "id": "82ce4682c766edc4fe5f86573bc8896a", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nUPDATE: 2 arrested in Louisiana for Durham teen’s murder\nDURHAM, N.C. (WNCN) — Durham police are investigating after a 17-year-old was shot and killed Tuesday morning at the back of an apartment complex.\nAccording to police, 17-year-old Demoraea Fennell was shot at 412 E. Pilot St. at the Eagle Point apartment complex just before 3:15 a.m.\nFennell was in the hospital with life-suffering injuries but later died, police confirmed.\nPolice have not released any suspect information.\n911 calls were made in moments after the shooting.\n“My brother is sitting here dying. He’s dead,” a caller tells dispatch.\nA second caller reported hearing gunshots.\n“I didn’t see anything, I just heard six gunshots and now I’m hearing lots of screaming. I think somebody got killed,” the caller said.\nFennell’s mother said she doesn’t think this shooting was random. Police have not confirmed that detail about the shooting.\nOne person who lives in the complex told CBS North Carolina that crime is nothing new in the area.\n“I didn’t feel safe. I have two kids that live here. It’s always something in this neighborhood. Cops are always out here. Nothing’s usually done til something happens over here,” said Keesha Wortham.\nCary's mayor strongly hinted in a blog post that a \"blue and yellow\"…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}