{"uri": "http://triblive.com/news/allegheny/11348189-74/jackson-brannigan-police?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29", "title": "Pittsburgh teen accused of Fourth of July shooting Downtown to stand trial", "dct": "Fri, 21 Oct 2016 05:42:00 GMT", "id": "6374d4553dc4cde3ca6bb5d5484af8c3", "content": "Two groups of teenagers screaming at each other drew Rich Brannigan's attention as he watched throngs of people leaving Pittsburgh's Downtown after the July 4 fireworks celebration.\nBrannigan, 47, testifying during a preliminary hearing Friday, said a teen in a black hooded sweatshirt drew a gun and fired three times at the opposing group. A girl, who didn't appear to be associated with either group, dropped immediately, Brannigan said.\n“He totally missed everybody and hit her,” he said. “It was bang, bang, bang, (and) everybody ran.”\nBrannigan couldn't identify the shooter, but Pittsburgh police say video footage culled from various surveillance cameras across the city indicates it was Kishawn Jackson, 16, of Garfield. Police identified Jackson from Brannigan's description of his clothing and images showing Jackson wearing similar clothing while boarding a bus minutes after the shooting.\nIt was enough for District Judge Randy C. Martini to hold Jackson for trial on charges of attempted homicide, aggravated assault and related counts. He is being held in the Allegheny County Jail in lieu of $300,000 bond.\nJackson's attorney, Casey White, said police charged the wrong teen.\n“No one has identified my client as the shooter,” he said, arguing that Martini should dismiss the charges.\nAssistant District Attorney Russell Broman said video evidence clearly links Jackson to the crime.\n“This is what they call a circumstantial video identification,” he said.\nThe shots on July 4 wounded four people, including a woman who was hit in the forehead. The violence that erupted as thousands of visitors crowded Downtown for one of Pittsburgh's largest annual events prompted outrage from Mayor Bill Peduto and District Attorney Stephen A. Zappala Jr.\nPolice said a feud between rival gangs from the North Side and East End led to the gunfire.\nCity and county authorities have stepped up patrols Downtown and are working with the Pittsburgh Public School District to find ways to prevent such violence incidents.\nWhite described Jackson as a high school student with good grades, who lives with family members. White said numerous people have anonymously written him and texted police that Jackson is innocent.\n“We were hopeful our client would walk free today,” White said. “Our client was not the shooter.”\nBob Bauder is a Tribune-Review staff writer. Reach him at 412-765-2312 or bbauder@tribweb.com."}