{"uri": "http://www.pittsburghpa.gov/publicsafety/article.htm?id=6249", "title": "UPDATE: DOWNTOWN SHOOTING SENDS FOUR TO HOSPITAL", "dct": "Mon, 19 Sep 2016 00:00:00 GMT", "id": "d97c3107a6e3b01831c5a5f50e00bc41", "content": "UPDATE (9/19/16): Police have identified and arrested Kishawn Jackson, 16, of Garfield, in connection with Downtown shooting on July 4. Jackson turned himself in at approximately 3 p.m. today at Police Headquarters. Jackson will be charged as an adult. His charges include two counts of criminal attempt homicide, four counts of aggravated assault, causing a catastrophe, firearms not to be carried without a license, possession of a firearm by a minor, four counts of recklessly endangering another person, and discharging a firearm within the city. A current mugshot is not yet available.\n--\nUPDATE (9/1/16): Detectives with the Group Violence Intervention Unit are seeking the identity of a person of interest in relation to the July 4 shooting Downtown. The person below was seen at the bus stop at Penn & N. Aiken in Garfield before the shooting, and then Penn & 9th Street after the shooting. Individuals with information regarding this person’s identity or any other tips related to this incident are asked to call 412-323-7151.\n###\nFOR IMMEDIATE RELEASE\nPITTSBURGH, PA – The Pittsburgh Bureau of Police are looking for two young black males in connection with a Downtown shooting shortly after 10:30 p.m. Four people have been shot.\nAccording to the investigation, the two individuals were arguing on 7th Street near the intersection of Liberty Avenue. The shooter is believed to have been wearing all black. The second male is believed to have been wearing a white dress shirt with a white shirt underneath.\nAn adult female was shot in the head and is listed in critical but stable condition. An adult male was shot in the leg and is listed in stable condition. A juvenile male was shot in the leg and is listed in stable condition. Paramedics transported the three to UPMC Mercy. A juvenile female was shot in the leg and was transported to Children's Hospital of Pittsburgh of UPMC.\nThe investigation is ongoing.\n###"}