{"uri": "http://blogs.mprnews.org/cities/2014/01/no-one-wished-him-happy-birthday-2013-gun-crime-in-hennepin-county/", "title": "No one wished him Happy Birthday: 2013 gun crime in Hennepin County", "dct": "Thu, 23 Jan 2014 15:23:00 GMT", "id": "c21cac4a1a62d4d4a3617272f978c532", "content": "More than a year ago, I started sorting through complaints and search warrants filed in Hennepin County District Court, searching for gun cases as a follow-up to the series I produced in 2011 called Following the Firearms: Gun Violence in Minneapolis.\n• Tougher gun laws may not deter most persistent offenders, data show\nThe project tracked how guns get into the hands of people who aren’t supposed to have them, and detailed how lawmakers and law enforcers are trying to prevent that from happening. Some say new gun laws or tighter restrictions are necessary to curb gun violence. Others say the laws in place are just fine, that law enforcement needs to do a better job enforcing them.\nWith this endeavor, I wanted to see whether the allegations, testimony and data contained in thousands of pages of court documents would provide useful evidence in the debate. I created this reporter’s notebook to track some gun crime cases from 2013 that stood out to me as being either fairly typical or unusual.\nJanuary\nBullets fired from upstairs\nMinneapolis police’s organized crime unit is investigating Nitelen Dereese Jackson, 23, for being a prohibited person with a firearm. The investigation is centered on a shots fired call from Jan. 2 at a residence on the 4000 block of Lyndale Ave. N. The people in the lower apartment found bullet holes in their ceiling and told cops somebody from the upstairs apartment had fired a gun. Officers searched the apt. and found a .40-caliber Glock handgun and a semi-auto rifle. They also found a cell phone, blood-like substance and spent casings. Investigating officer says Jackson is a known member of the Stick Up Boys.\nUpdate: On Aug. 6, Jackson was convicted of illegal possession of a firearm and sentenced to 36 months in the state prison at St. Cloud.\nMan shot and wounded at gas station\nAnthony Terrell Jenkins, 20, of Bloomington pleaded guilty to first-degree assault and was sentenced to 84 months in prison for shooting a man in the head, abdomen and left shoulder at the SuperAmerica at 7720 Nicollet Ave. S in Richfield on Jan. 3. The two men had argued outside the gas station when Jenkins suddenly pulled out a handgun and fired, according to the criminal complaint. The man survived.\nAttempted murder suspect brought his gun as he went to see his probation officer\nMinneapolis police say Shoulwin Melbrook Davis, 21, shot a guy in the face on Jan. 5 at 31xx Logan Ave. N. Police found Davis three days later on his way to see his probation officer. According to the criminal complaint, Davis admitted he had a gun on him. Davis was charged with attempted 1st degree murder and prohibited person in possession of a firearm.\nUpdate: On Sept. 9, Davis was found guilty of 1st degree attempted murder and sentenced to 150 months in prison.\nShooter paralyzes 17-year-old\nOn Jan. 6, Brooklyn Park police say Laltigus Rodriguez Laray Lyons, 18, shot a 17-year-old with a small caliber revolver. A bullet lodged in the victim’s spine, paralyzing him. According to the complaint, the conflict started at a party attended by some gang members.\nPolice were called to a large fight around 12:30 a.m. When they arrived at Brookdale Drive and Welcome Avenue in Brooklyn Park, they found a 17-year-old on the ground who had been shot in the back. Doctors determined that the bullet punctured a lung, lodged in his spine and left him paralyzed from the waist down.\nPolice investigators learned that the victim and some of his friends left a party and were walking along Brookdale Drive when three other young men approached. The victim shouted out, “Are you SUB?” a reference to a street gang, Stick-up Boys. The other group replied “Dirt Gang,” which is a different gang known as DGK or Dougie Ghetto Kidz. According to the criminal complaint, the two groups shouted insults at each other and then Lyons fired several shots at the victim and his friends before fleeing.\nLyons was charged with aiding and abetting – 1st degree assault committed for benefit of a gang. The penalty is 3 to 30 years in prison with no supervised release. He was also charged with first degree assault.\nUpdate: On Aug. 13, Lyons was sentenced to 74 months in prison in St. Cloud.\nComplaint: Gun owner apparently experiencing mental health crisis makes threats\nAccording to the complaint, on Jan. 7, Bradley John Gothman, 52, called the Plymouth Police Department and said he was “upset with Amy Klobuchar and Nancy Pelosi for taking away his disability benefits.” And then he stated that he was going to kill them by blowing up the buildings they work in. They say Gothman talked about guns and asked the police officer if “he knew what a .44-caliber could do to a human’s skull.”\nOfficers got a search warrant and searched his home in Greenfield — and found a Remington shotgun; Winchester rifle .177-caliber; Springfield .22 ca. rifle; a partially built Remington shotgun; Winchester 12-g shotgun; a second partially built Remington shotgun and a Golden Eagle compound bow with arrows.\nPolice spoke to Gothman’s landlord, who said about a month ago Gothman started acting strangely and rambling about a lot of things. In the complaint, police said, “The defendant stated that he believed that there were 20 or so soldiers out in the woods behind the house and that they were in some sort of training exercise.”\nAnother resident in the building told officers Gothman had mentioned wanting to kill his roommate or family members, including a cousin who works for the Plymouth PD. “She also told police she believes Gothman has been diagnosed schizophrenic and has been institutionalized in the past.”\nGothman was placed on a 72-hour hold at HCMC. He was charged with two counts of terroristic threats.\nGothman’s case was continued for dismissal. Judge Daniel Mabley granted Gothman unsupervised probation for 4 months.\nShots fired through the floor into another apartment\nMinneapolis police officers are investigating a Jan. 7 shooting at a building on Pillsbury Ave. S. The people in apt. #201 say someone in the upstairs apartment fired a shot which went through the floor/ceiling and landed in their apartment. They also say they saw two “Somali males in their 20s run out the front door.”\nGuns and drugs\nOn Jan. 11, Minneapolis police searched a residence on the 3500 block of Pierce Ave. NE and found drugs and guns they believe belong to 26-year-old Paul Michael Rubbert. According to the complaint, Rubbert lived in a room in the building where cops found eight adult pot plants, 24 juvenile plants, jars of marijuana; two rifles and ammo for a .45 cal. handgun – as well as hollow-point ammunition.\nHollow points are designed to expand and disintegrate on impact and cause more damage. Cops also found a U.S. Air Force badge with Rubbert’s name on it. According to the complaint, Rubbert’s roommates said he is “paranoid and thinks police are out to get him.” And they say Rubbert has a permit to carry and handgun and keeps one on his person at all times – even when he’s at home.\nUpdate: On July 26, Rubbert pleaded guilty and was sentenced 36 months with a 4 year stay.\nProhibited people\nOn Jan. 15, Martell Allen Brown, 25, was arrested and charged with being a prohibited person in possession of a firearm.\nUpdate: Brown pleaded guilty on Nov. 25 and was sentenced to 42 months in prison.\nOn Jan. 15, Nathan Sims Jr., 20, was caught with a “replica pistol” during a traffic stop near 24th and Logan Ave. N. He was charged with being a prohibited person in possession of a firearm.\nUpdate: On May 22, Sims pleaded guilty and was sentenced to 60 months in prison with a 3 year stay.\nOn Jan. 21, police arrested John Sorrell Bradley, 22, for illegally possessing a firearm. They described him as a confirmed member of the 1-9 Dipset street gang. Police found a Smith and Wesson semi-auto handgun in a car he was driving.\nUpdate: On April 23, Bradley pleaded guilty and sentenced to 36 months in prison.\nPermit holder fires shots near her boyfriend to ‘scare him’\nBrooklyn Center police officers arrested Nakia Shephard, 36, on Jan. 27 after she admitted firing two shots from her 9mm pistol near her boyfriend. The two had apparently not been getting along lately. “I could have shot him in the face,” she told police in a post-Miranda interview. “I just shot to scare him.”\nShephard was charged with 2nd degree assault.\nAccording to the warrant application, the boyfriend says Shepard keeps the gun in a box and has three boys in the home, ages 5, 11 and 17. Police say Shepard has a permit to carry the gun.\nShepard is scheduled to go on trial March 14, 2014.\nFebruary\nTerroristic threats\nAccording to charges filed by the Hennepin County Attorney’s Office, on Feb. 1st a woman honked at Mohamed Ahmed Elmi, 26, who was in a car blocking her way. Elmi responded by yelling at her, “I will shoot you in your mouth, b****.” And he lifted his shirt to show her a handgun. Elmi was charged with one count of terroristic threats.\nUpdate: On June 17, Elmi pleaded guilty and was sentenced to 120 days in the workhouse.\nFacebook law enforcement\nCourt documents filed in Hennepin County District Court detail an investigation into a known gang member suspected of illegally possessing a gun. Police say Osman Omar Osman, 25, a known member of the Somali Outlawz, posted pictures of himself holding a gun at Bill’s Gun Range on Feb. 2. Police say he is a felon and therefore prohibited from possessing a gun.\nOsman was charged with illegal possession in April. According to court docs, Osman was also charged with 1st degree murder in Arapahoe County, Colo., in May. Hennepin County officials say Osman was extradited to Colorado to face those charges.\nMore Facebook law enforcement\nOn New Year’s Day 2012, police were called to a loud party call at a Comfort Inn in Brooklyn Center. They found a handgun in the bathroom of the noisemakers room with a partially obliterated serial number – which is illegal.\nDNA tests eventually linked Steven Creamer, 19 to the gun. The police also found pictures on Creamer’s Facebook page (he goes by Steven “Stayfresh” Creamer) of him holding a similar handgun. He was charged with ‘prohibited person with firearm’ and police are looking into the possibility that Creamer made jailhouse calls to intimidate a would-be witness.\nWhile Creamer was out on bail, he got arrested on March 31 for aggravated 1st degree robbery with a BB gun. Creamer pleaded guilty and was sentenced to 67 months in prison.\nDad shoots daughter’s boyfriend\nOn Feb. 3, Amos McGhee Jr., 55, shot Chase Dent-Wells, 24, three times with a .22-caliber pistol. While searching the residence police found a .22-caliber Smith and Wesson that was reported stolen last year from Pequot Lakes and a 9mm pistol. McGhee is a prohibited person and police searched the residence for further evidence of the stolen gun. He was not charged.\nAccording to court documents, Dent-Wells had come to McGhee’s house at 4 a.m. to talk to McGhee’s daughter, Pearline Amy McGhee. Dent-Wells and Amy had broken up recently and he went to the house and started knocking on her bedroom window. The woman told her father what was going on, so he got his gun and came downstairs to confront Dent-Wells.\nThe man fired two warning shots with his .22-caliber pistol. But Dent-Wells didn’t leave. Instead, police say Dent-Wells pulled a gun from his waistband and pointed it at the man. The woman’s father fired at Dent-Wells and wounded him. One shot hit him in the back of the head. Dent-Wells was charged with being a prohibited person with a firearm and 2nd degree assault.\nMore on this case in a September update.\nShot in the butt with a pink gun\nMinneapolis police say on Feb. 5, Kristina “Kandy” Schultz, 21, shot a man in the buttocks with a Charter Arms Pink Lady .38 Special revolver. She was charged with second degree assault. In the criminal complaint, police say the victim was fighting with another man at her residence. Police also found a Ruger 10-22 .22-caliber rifle in her residence stored in a duffle bag in a closet.\nUpdate: On Nov. 20, a warrant was issued for Schultz after she failed to appear at a hearing.\nStick Up Boys rob Craigslist ad respondents\nAccording to a complaint filed Feb. 6, Tywin Marcell Bender, 22, and Montel DeShawn Johnson, 22, both members of a gang called the Stick Up Boys, committed three armed robberies in the month of January. They posed as a person selling an iPhone on Craigslist and would rob the person who responded to the ad. When they were arrested, police found a loaded .40-caliber Smith and Wesson pistol under the front seat.\nThe barrel was pointing toward a young child sitting in the backseat. The 4-year-old child belongs to the driver of the car, Lashunda Roberts, 23. As a result, the County Attorney included one count of child endangerment to the list of charges.\nThe pistol was also reported stolen from Eagan in 2009. The two men were charged with child endangerment, possession of a stolen gun, conspiracy to commit 1st degree aggravated robbery and illegal possession of a firearm.\nUpdate: On July 12, Bender was convicted of aggravated robbery and sentenced to 75 months in state prison at St. Cloud; Johnson pleaded guilty and was sentenced to 60 months in state prison. Roberts pleaded guilty to 1st degree aggravated robbery and sentenced to 23 months in prison – her sentence was stayed for 3 years while she serves probation.\nMan with PTSD and large quantities of ammo\nOn Feb. 11, Robbinsdale police responded to a weapons call after a woman called 911 saying that Chris Neal Erickson, 55, pointed a gun at her head. Cops found a .40 cal. Glock pistol – plus 21 other firearms and ‘large quantities of ammo.’\nOn Feb. 25, Hennepin County released the search warrant served at 39xx Crystal Lake Blvd. The man who resides there, Chris Erickson, was arrested for assaulting a woman at the residence and pointing a .40-caliber pistol at her.\nThe search warrant lists more than 30 long guns and pistols plus three pellet or BB guns. According to the woman who was allegedly assaulted, Erickson suffers from “post traumatic stress disorder.” In 1998, Erickson was charged for carrying a weapon without a permit and DWI. The weapon charge was dismissed, but Erickson was convicted for the DWI.\nRobbinsdale police say they had to call in a SWAT team to apprehend Erickson.\nUpdate: Hennepin County dropped the felony charges against Erickson. The Robbinsdale city attorney has filed misdemeanor domestic assault charges.\nCharges: abuse victim tells cops her boyfriend deals drugs, has guns\nAndy Morales, 22, allegedly beat his pregnant girlfriend at a Motel 6 in Richfield on Feb. 12. According to the criminal complaint, the woman told police that Morales is a drug dealer who keeps a gun in his car. Cops searched the car and found a handgun. He was charged with domestic assault/strangulation and illegal possession of a firearm.\nIn an amended complaint filed Feb. 15, officers got a search warrant to search Morales’ residence and found more weapons, drugs and money. Along with the .25-caliber pistol in the car, they found a .223-caliber assault rifle under his mattress as well as a .22-caliber handgun; a 12 gauge shotgun in the closet along with $12,000 in cash, drugs and ammo for .357-caliber and 9 mm guns.\nMorales pleaded guilty and was sentenced to the workhouse for domestic assault and 60 months for the gun charge.\nKids shot at\nOn Feb. 13, Minneapolis police responded to a call of “kids being shot at” near the intersection of Golden Valley Road and Queen Ave. N. They arrested Daquan Ossie Bradley, 23, nearby with a .22-caliber revolver. Bradley was charged with being a prohibited person in possession of a firearm and reckless discharge.\nUpdate: On March 28, Bradley pleaded guilty and was sentenced to 60 months in state prison in St. Cloud.\nCharges: suicidal man points gun at teenager\nHennepin County charged Jeremy Jason Hall, 32, with terroristic threats after he allegedly pointed a handgun at the head of a teenager on Feb. 27. According the complaint, Hall was in his house with the two teens and told them he was going to the store to get cigarettes but probably wasn’t coming back because he was “going to kill himself.”\nOne of the juveniles noticed he had a gun in his hand and grabbed his arm. Hall allegedly turned and pointed the gun at the kid’s temple from about four or five inches away. Police found the gun in a locked safe in Hall’s home later.\nUpdate: The charge was dismissed. County Attorney Mike Freeman wrote the court to explain the decision, “Insufficient evidence. Victims have recanted and deny incident happened.”\nMarch\nStrip club shooting\nThe Hennepin County Attorney’s Office charged three men in connection with a shooting at Augie’s strip club in downtown Minneapolis on March 3.\nOne of the men, Prince Shamir Martin, 23, is — according to MPD — a known member of the gang Young N Thuggin who goes by the nickname “Bd Boo.” Martin, Pierre Vann, 22 and Gregory Brown, 22, were all charged with two counts of second degree assault and one charge of second degree riot. According to the complaint, Martin was captured on video inside the club throwing gang signs just before the shooting.\nUpdate: The charges were dismissed against Martin and Vann. Brown pleaded not guilty to charges and will stand trial in March of 2014.\nCops say pink handgun was stolen\nOn March 4, Minneapolis police found a pink handgun in the purse of Selena Ely, 26. Ely was in a car involved in a traffic stop. Officers reported smelling marijuana coming from the car. Ely allegedly told officers she had a permit to carry the gun.\nWhen cops asked her if the gun was registered in her name, Ely allegedly “spontaneously uttered that she bought the gun on the street today because she liked it.” She was charged with receiving a stolen gun.\nThe stolen gun charge was dropped. Ely was found guilty of gross misdemeanor possession and sentenced to probation.\nMan charged after day-long standoff with police\nMinneapolis police requested a warrant to enter Jelani Jernigan’s residence on the 3800 block of Aldrich Ave. N. while they were engaged in a March 8 standoff with him.\nAccording to the warrant, police tried to get a phone inside the residence with a “robotic bobcat” but Jernigan fired his shotgun at it. They also say Jernigan fired at officers as they attempted to get OC gas inside the house.\nAfter they took him into custody, police searched and found at least one shotgun – a pump action Remington 870 (with a live round still in the chamber). Police also found a folding stock for a weapon in the garage, as well as a several discharged shotgun rounds as well as live ones.\nHennepin County ordered a Rule 20 competency exam for Jernigan who was charged with 1st and 2nd degree assault as well as illegal possession of a firearm.\nJernigan’s attorney Doug Myren says Jernigan has experienced periods of mental illness and says he doesn’t think Jernigan was in his right mind on March 8.\nHis trial is scheduled for Feb. 10, 2014.\nMore Facebook law enforcement\nMPD arrested a suspect in the double homicide at a north Mpls after-hours club on March 8. On the day of the shooting, police arrested Corey Jarrell Bryant on a “prohibited person in possession of a firearm” charge.\nPolice had also found a picture posted on Facebook of Bryant with a handgun at his feet. The Hennepin County attorney’s office charged him with illegal gun possession. Bryant posted a $20,000 bond and was released.\nAccording to a search warrant served on March 13, Bryant was arrested again at a residence on Lyndale Ave. N. — this time on a probable cause murder charge. Police investigators say witnesses from the double homicide at the club told them Bryant admitted firing shots that night. Bryant initially told police that he was NOT in the club that night, but did say he was with one of the victims of the shooting.\nAccording to the warrant, a witness told police that he/she searched people as they were coming into the club and said “some of the males had guns on them” – including Bryant. The same witness said a fight erupted on the dance floor and they saw Bryant being knocked to the ground. They say as soon as Bryant got back up gunfire erupted.\nBryant was charged with 2nd degree murder. Another man, Dominique Sinkfield, 25, pleaded guilty to 1st degree manslaughter in the shooting and was sentenced to 104 months in prison. Bryant’s trial is scheduled for April 7, 2014.\nSpeaking of Facebook\nPolice say a man named Mike Green, 38, also known as Damon Anton Young, had posted pictures of firearms on a social media website. They knew him to be a “prohibited person.”\nOn March 21, they caught Green carrying a weapons case after a brief car and foot chase. Inside the case they found a camouflaged colored AR-15 rifle and a loaded, Glock 9 mm pistol. Police say they recognized the guns as the ones pictured on the social media sites. Police also say the guns were reported stolen.\nGreen was charged with being a prohibited person in possession of a firearm. His trial is set for April 14, 2014.\nFeds sentence leader of YNT to 87 months in prison\nOn March 25 in federal court in St. Paul, the former leader of the Young N Thuggin street gang was sentenced for distributing crack cocaine. United States District Court Judge Susan Richard Nelson sentenced Trayjohn Lashawn Martin, 21, to 87 months in federal prison on one count of aiding and abetting the distribution of crack cocaine.\nWoman fires and misses\nMinneapolis police say on March 27, Meranda Erickson, 29, burst into a home on the 1600 block of Sheridan Ave. N and started waiving a short-barreled revolver around while she yelled at a man in the house, “Whose the b**** now?”\nAccording to the charges, Erickson fired at the man and missed. Police say Erickson was standing five feet away from the man, as well as two children in the living room when she pulled the trigger.\nUpdate: On Sept. 10, Erickson pleaded guilty to terroristic threats and burglary in the 1st degree and was sentenced to 24 months in Shakopee prison.\nGang feud sparks gunfire at gas station\nAccording to charges filed in Hennepin County District Court, on March 30, Troy Dean Friend, 20, and Ivan James Flyinghorse, 25, confronted some other young Native American men at the Moto Mart gas station on Hiawatha Ave in Minneapolis.\nOne man was seriously wounded when Friend allegedly pulled out a chrome colored handgun and fired two shots.\nThe wounded man later told police the men shouted “Native Mob killer” at him. Victim stated that he used to be a Project Boy gang member, but at the time of the shooting he was wearing all red – the color of Native Mob.\nFlyinghorse admitted he used to be a member of the Native Gangster Disciples, a rival gang of Native Mob. A warrant was issued for Friend’s arrest.\nUpdate: On March 19, a federal court jury convicted several members of Native Mob of racketeering charges. The trial lasted six weeks.\nApril\nPermit holder threatens to shoot dog\nMinneapolis police say on April 1, Kevin Lavern Briggs, 56, got into a confrontation with others on the city’s northeast side. According to police, Briggs pulled out a 9 mm pistol and said, “I’ll shoot your f****** dog. I have a permit to carry.” Officers confirmed the defendant did have a permit to carry a firearm.\nUpdate: Briggs was charged with making terroristic threats and is scheduled to stand trial in February 2014.\n80-year-old charged for drugs, guns\nOn April 1, police arrested John Lawrence Dickerson, 80, after finding pills and guns at an address in north Minneapolis. He allegedly admitted to police that the two guns they found, a 12 gauge shotgun and a Raven Arms semi-auto pistol stashed in a sock in a filing cabinet, were his.\nDickerson also allegedly told cops all the pills — methadone and benzodiazepam — belonged to him and he sometimes sold pills to other people. He said he also used pills for pain.\nUpdate: A Rule 20 competency exam was ordered for Dickerson and a hearing is scheduled for Feb. 28, 2014.\nCharges: self described gang member tells cop his ballistic vest won’t stop his bullets\nTyrone Mohr, 34, was arrested on a weapons charge on April 2. According to the complaint, Mohr threatened to shoot an officer. Mohr allegedly looked at the officer’s ballistic vest carrier and said, “That ain’t s*** either. When I find you I’m going to shoot right through that with my Mini 14 b****.”\nMohr also claimed to be affiliated with the Native Outlaws, a rival of the Native Mob.\nUpdate: Mohr pleaded not guilty to the weapons charges and is facing trial on Feb. 18, 2014.\nBig O needs a gun\nIn April, Osiris Fosu-Agyenkwah, 20, was charged with drug possession and for being in possession of a .25-caliber pistol with an obliterated serial number.\nAccording to a search warrant filed by investigators with the FBI’s Safe Streets Task Force, Agyenkwah is a member of the Young N Thuggin street gang and is known as Big O. A confidential informant told them Agyenkwah was in possession of the gun to protect himself and his narcotics from rival gang members. YNT, a subset of the gang Taliban, is at odds with the 1-9 Dipset gang. The warrant was served at a home on Queen Ave. N., where police say Osiris lived with his father.\nI checked and found that a Kelly Agyenkwah (born in 1953) lives at the address. I did a story on Kelly Agyenkwah back in 2009. He invented a game aimed at restoring African family values in the African American community.\nUpdate: A hearing in Fosu-Agyenkwah’s case is scheduled for Mar. 3, 2014.\nGang related\nJabari Roosevelt Johnson, 23, was tested recently for DNA to see if he possessed a 9 mm Taurus PT111 that was reported stolen. Investigators say Johnson is a “known associate of the 1-9 Dipset” gang. Johnson was charged with aid/abet aggravated robbery in the 1st degree and being a prohibited person in possession of a firearm for a Sept. 17 incident. Johnson will stand trial on March 17, 2014.\nGun burglar charged\nAndrew Scott Jacobson, 28, of St. Bonifacius was charged with two counts of 2nd degree burglary after police say he stole four firearms, ammo and jewelry from a gun safe in a Mound home. According to the complaint, Jacobson stole a Benelli 12 gauge pump shotgun, a .40-caliber handgun, Winchester 30-30 rifle and a SKS rifle.\nThe complaint said the victim told police Jacobson was an estranged acquaintance who apparently knew where the key to the gun safe was stored. Police say Jacobson admitted to being a heroin addict and stole the guns and sold them for cash.\nPolice also arrested a 23-year-old woman with one count of receiving stolen property in connection with the resale of the guns. According to the complaint, Heidi Kristen Schliesman pawned some of the firearms at shops in Bloomington and Fridley. On April 4, Schliesman allegedly pawned the Benelli shotgun at Maxit Pawn, 9432 Lyndale Ave. S., for $499.\nUpdate: Jacobson pleaded guilty to a 2nd degree burglary charge and was sentenced to a 33 month prison sentence, stayed for 3 years. No info found on Schliesman.\nReckless discharge\nOn April 21, Minneapolis police reported an altercation between a group of men in a parking ramp. According to the complaint, surveillance video shows a man later identified as Marqual Antonne Howard get out of an SUV with a gun and then fire it into the ground. In an interview with police, Howard admitted the gun belonged to his wife who was in the car with him. He said he wanted to protect her from the men.\nHoward doesn’t have a permit to carry a gun and was charged with reckless discharge of a firearm and carrying a weapon without a permit.\nUpdate: Howard pleaded guilty to a gross misdemeanor (MN624.714.1a) on June 25, and was sentenced to 180 hours of community work service.\nShots fired in gang turf\nCourt documents name Sylvester Romell Jernagin, 23, as a known member of the Bloods. A warrant ties Jernagin to a shots fired incident at Franklin and Chicago on April 25. Officers say this area is known as “10-Z gang turf.”\nUpdate: Jernagin was charged with carrying a weapon without a permit in connection with the incident. A hearing is scheduled in his case for Jan. 27, 2014.\nCharges announced in methamphetamine bust\nCourt documents identify people arrested a few weeks ago in a meth bust on April 26: Jason Vera, 23; Briseida Mendoza, 23; Juan Ramos Cirino, 64, and two other men. According to the complaint, law enforcement officers found a loaded 380 cal. pistol, $172,000 in cash and several pounds of suspected meth.\nUpdate: Vera pleaded guilty to drug charges and was sentenced to 80 months in prison. On July 19, the HCAO dropped charges against Cirino, according to Hennepin County Attorney Mike Freeman “in the interests of justice.” Charges were also dropped against Mendoza, also “in the interests of justice.” Mendoza filed an expungement/seal request which was granted in November. MPR News could not verify the status of the two other men arrested during the drug bust.\nMay\nCharges dropped when witnesses and victims don’t cooperate\nIn at least two cases last year, charges were dropped against two men because either the witnesses or victims refused to testify. Martell Dixon, 26, faced an illegal gun possession charge filed in May. However, the charge was dropped by Hennepin County Attorney’s Office.\nIn a court document, county attorney Mike Freeman wrote, “The sole witness in this case is unavailable to testify. Without the witness, the state cannot prove the defendant is guilty beyond a reasonable doubt.”\nFreeman wrote a similar explanation for his decision to drop a drive-by shooting charge filed on May 14 against Derry Darnell Evans, 21. “Victim D.P and Victim S.S. refuse to cooperate with the proceedings and refuse to testify if called before the court at this trial,” Freeman wrote. “The elements of the charged offenses cannot be established beyond a reasonable doubt without the testimony of DP and SS.”\nPermit holder accidentally shoots girlfriend, charges dismissed\nOn May 12, police officers were dispatched to North Memorial Hospital in Robbinsdale to interview a woman suffering from a bullet wound. According to the complaint, the bullet struck her in the chest and exited out of her armpit — missing vital organs.\nAfter some questioning, the woman admitted her boyfriend, Keon Latroyce Whitfield, 28, accidentally shot her while he was “playing” with his 9 mm pistol while they were sitting in his car. Police say Whitfield has a permit to carry a handgun from Hubbard County, Minn. Whitfield reportedly told police that the shooting was an accident, “but my girl thinks I meant to.” He was charged with reckless discharge of a firearm.\nUpdate: On Sept. 25, the dangerous weapons charge was dismissed. Hennepin County Attorney Mike Freeman wrote the court explaining the dismissal, “the State cannot prove the case beyond a reasonable doubt.”\nGun offender back in trouble\nJiyaad Copeland is back in trouble with guns.\nCopeland was arrested on May 22 after Minneapolis cops found him in a car with a gun on the floor under his seat.\nCopeland was released from prison last year after serving time in Lino Lakes after he pleaded guilty in May of 2010 for being a “prohibited person with a firearm.”\nI interviewed Copeland in 2011 for our Following the Firearms series. At the time, he sounded contrite and ready to change his life. I did a blog post on the arrest.\nRoad Rage episode ends in Edina Police Department parking lot\nAccording to the complaint, on May 20, Alekxander Thomas Maloney, 24, pointed a gun at a man after a road rage incident. The two men had pulled into the parking lot of the Edina police department and exited their cars.\nMaloney allegedly pointed the gun at the other man and said, “Don’t move or I’m going to shoot you.” The victim ran to the department for help. Officers retrieved the handgun from Maloney and noticed it was loaded.\nUpdate: His trial is scheduled for March 31, 2014.\nJune\nGang related\nCourt documents identify a man charged in a June 7 Brooklyn Center drive-by shooting, Demario Jefferson, 24, as a member of the Tre Tre Crips. Police also say the driver of the vehicle was a fellow Crip. A man living at the house that was shot at was unhurt.\nUpdate: Jefferson was charged with illegal gun possession, drive-by shooting and second degree assault and is scheduled to stand trial on March 17, 2014.\nMan having bad birthday fires gun\nVernon Goodman spent his 30th birthday under arrest and charged with reckless discharge of a firearm for an incident that occurred at his north Minneapolis residence on June 7. According to the complaint, Goodman fired the gun outdoors because he was mad that no one wished him “Happy Birthday.”\nUpdate: On Oct. 15, Goodman pleaded guilty and was sentenced to probation and 90 days in the workhouse.\nShooting at Pizza Luce\nOn June 9, Minneapolis police officers arrested Malik Rashad El-Amin, 30, in connection with a shooting at Pizza Luce in downtown Minneapolis. El-Amin was also charged for aggravated robbery at the MGM Liquor Warehouse in Golden Valley in March.\nUpdate: El-Amin was convicted for both incidents. He will serve 36- and 48-month sentences at the same time.\nMore gang related\nIn court documents, law enforcement officials name Marlon Rashaad Robertson, 22, as a “documented member of Young N Thuggin” who went by “Marly Snapback” on Facebook. Robertson was charged with murder in the death of Kevin Braziel. Braziel was shot on June 24 at 21xx W. Broadway in north Minneapolis. He was hospitalized at North Memorial with multiple gunshot wounds and died on July 7.\nUpdate: A hearing in Robertson’s murder trial is scheduled for Feb. 7, 2014.\nMore Facebook law enforcement\nAccording to court documents, on June 23, Hennepin County Sheriff’s Deputies were looking at the Facebook page of Glenn Danen Smith, 19, and saw a picture of him holding two guns.\nThe weapons appeared to be a .38-caliber revolver and a 9 mm pistol. On July 2, officers got a search warrant and went to his residence to find the guns. According to the complaint, officers saw Smith being wheeled out of his building by a juvenile. Smith had recently been shot in the ankle and was in a wheelchair.\nOfficers found the .38 revolver on the juvenile and a 9 mm Beretta (reported stolen) inside the residence. Smith is prohibited from possessing firearms and was charged with that felony offense. Police say Smith is a “known member” of the Young N Thuggin street gang.\nUpdate: A plea hearing in Smith’s case has been set for Jan. 21, 2014.\nJuly\nReckless shots at the river\nA couple is arrested and charged with reckless discharge of a firearm on July 24. According to the complaint, witnesses said Ai Long Xiong, 32 and Mor Lee, 24 fired as many as 20 shots from a .40-caliber pistol at the Mississippi River.\nUpdate: Xiong is scheduled to appear at a plea hearing on March 3, 2014. Xiong’s female companion, Mor Lee is also scheduled for a hearing that day.\nMalicious punishment\nA 28-year-old Brooklyn Park man has been accused of holding a gun to the head of his fiance, pistol-whipping her, threatening to kill her and abusing their small children. Hennepin County charged Txuam Vu with terroristic threats and stalking.\nAccording to the complaint, on July 24, Vu allegedly kicked his six-year-old son in the stomach three times when the child didn’t perform push-ups correctly. Vu allegedly made his children do push ups as a form of punishment. Officers found a rifle, shotgun, 9 mm pistol and “bags of ammunition” in Vu’s home.\nUpdate: On Dec. 13, Vu was convicted of malicious punishment of a child and misdemeanor domestic assault. He was sentenced to two years probation.\nPolice say felon used alias to illegally purchase gun\nBloomington police investigators say a man who used an alias to acquire a permit to purchase a handgun earlier this year made threats towards his ex-girlfriend and her son.\nAccording to a search warrant request filed in Hennepin County District Court, the man used an alias to purchase a handgun. Investigators discovered the man has a felony record that disqualifies him from lawfully possessing firearms.\nPolice interviewed the man’s ex-girlfriend, who told them he purchased a Smith and Wesson semi-automatic handgun. The girlfriend told police he was “obsessed with the gun” and posted multiple pictures of the gun on his Facebook page. The woman also told police that on July 3, he showed up at her house unannounced, drunk and armed. He allegedly told her if she had a man in her house that night he would “blow the guy’s brains on the wall.”\nThe investigator spoke with a detective about the man’s permit to purchase application. The detective told the investigator the man’s “permit would have been issued in error and that because he failed to disclose his alias in his permit application, he committed a gross misdemeanor by making a false statement.”\nGuns and children\nClinton Reginald Brown, 19, was charged with illegal possession of a firearm. According to the complaint, Brown is a felon and ineligible to possess a gun. On July 30, police searched his residence and found a .22-caliber pistol behind a throw pillow on the couch. Police say the gun had no trigger lock and was well within reach of a two-year-old girl living in the home. Brown was charged with being a prohibited person in possession of a firearm and endangerment of a child.\nUpdate: Brown’s trial was set for Jan. 6, 2014. Judge Daniel Mabley issued an arrest warrant when Brown failed to appear in court.\nAugust\nGang related\nPolice say Ramone Diego Pacheco, who was charged with being a prohibited person with a firearm, is a member of Native Mob.\nUpdate: Pacheco is scheduled to go on trial for the charge on Feb. 3, 2014, in front of Judicial Officer Tamara Garcia.\nAmmo in socks\nA search warrant served on a home on the 2100 block of Fremont Ave. N on Aug. 2 turned up an AK47, Remington .22-caliber rifle and a Mossberg 12 gauge shotgun as well as dozens of rounds of ammo stored in socks around the house. According to court documents, there were seven young men – many of them felons – in the house, as well as three children under the age of 10. Some of the weapons were found within reach of the children. The young men are all being swabbed for their DNA to see which one has been in possession of the guns.\nSeptember\nBullet hole in new apartment\nAccording to a search warrant filed in Hennepin County District Court, on Sept. 4, a person moving into an apartment on the 1100 block of Hennepin Ave. in Minneapolis, noticed a fired bullet and a hole in the closet. The person called Minneapolis police, who tried to reach the resident in the neighboring apartment. Police officers got a warrant to search the apartment and found four guns. They took the guns and left a receipt for the owner of the firearms.\nSomali gang feud fuels gun violence\nMinneapolis police are investigating a shooting at a grocery store on West Lake street on or around Sept. 22. The Hennepin County Attorney’s Office has charged Farhan Hersi, 25, of Carver, Minn., in connection with the shooting.\nAccording to the complaint, Hersi and another man, Zakaria Abdinasser Yusuf, 25, are members of the gang Madibaan With Attitude. Police say Yusuf shot and wounded a rival gang member outside the store.\nThey say the victim was a member of the Somali Outlawz. The two gangs have an ongoing feud.\nUpdate: Hersi was charged with “accomplice after the fact/crime committed for the benefit of a gang” for driving away with Yusuf. On Sept. 27, Yusuf was charged with attempted murder in the first degree in association with a criminal gang, attempted 1st degree murder and being a prohibited person in possession of a firearm.\nOn Sept. 9, police responded to a shots fired call at the Bashaal Cafe on W. 15th St. in Minneapolis. There, they found three wounded men. According to the charges, one man was bleeding profusely from a gunshot wound to his shoulder and was fading in and out of consciousness.\nAnother man was shot in the leg and other in the arm. The victims were part of a group of 7 to 8 Somali American males standing outside the cafe after it closed. Police say earlier that evening, a vehicle pulled up and two Somali men with guns stepped out and started shooting into the crowd.\nWitnesses reported hearing six to seven shots. Police say many of the males standing outside the Cafe, including the three victims, are members of and associates of the Somali Outlawz gang. Witnesses provided the license plate number of the gunmen’s vehicle. “That vehicle is known to be used by members of the St. Paul Pistol Boys, criminal street gang,” states the complaint.\nPolice say the St. Paul Pistol Boys and allied gang Madibaan with Attitude are feuding with the Somali Outlawz. Minneapolis homicide investigators believe a Somali man who was shot and killed on June 1, Mohamed Aden, was murdered due to his involvement in the 2011 killing of Guled Mohamed.\nInvestigators say Guled Mohamed was affiliated with MWA. Police say Aden was a member of the Somali Outlaws. Aden was found shot to death around 4:30 a.m. in a car parked outside an address on the 2400 block of Washington Ave. NE in Minneapolis.\nA half an hour before that shooting, police responded to a shots fired call on the 2900 block of Pleasant Ave. S. According to court documents, “Three Somali males were identified as residing at the residence that was shot at.” Police say Aden’s significant other or wife said one of the men at the residence was shot at because of his involvement in the killing of Guled Mohamed.\nThe Star Tribune outlined the feud in a recent article.\nI’ve been interested in the activities of the Somali Outlaws since I found out that the older brother of Ahmed Shire Ali — who tried to rob the Seward Market with Mahdi Ali in 2010 — is an alleged member of the Somali Outlaws.\nThe gun used in that triple homicide was stolen from the Frontiersman gun store in 2009. So was a gun found on Ali’s older brother, Abdirahman Ahmed Ali, a few months after the shooting. An official with the ATF says the burglary case is still under investigation. I still don’t know who stole those guns from the Frontiersman or know how they wound up in the hands of Somali gang members.\nSmall world\nI went to cover jury selection for the Chase Dent-Wells trial, and discovered that I used to work with Chase’s mother and had met Chase when he was just a little boy. Chase is now over 6 feet tall and charged with:\nProhibited Person In Possession of Firearm\nAssault-2nd Degree\nAssault-2nd Degree-Dangerous Weapon\nTerroristic Threats-Reckless Disregard Risk\nStalking – Repeatedly Make Telephone Calls, Sends Texts, Induce Victim to Make Calls\nTo recap the case: According to the original complaint, on Feb. 3, Chase brought a 9 mm handgun to see his ex-girlfriend, Amy Pearline McGhee, who was staying at her parent’s house in Brooklyn Park. It was early in the morning and Chase had allegedly been sending Amy threatening texts and emails. Amy’s father, Amos McGhee, shot Chase after police say Chase pointed his gun at McGhee.\nAccording to a search warrant, police say the .22-caliber handgun McGhee used to shoot Chase was reported stolen from Pequot Lakes and they say McGhee is a felon and not eligible to possess a gun. However, McGhee was not charged with a crime stemming from the shooting.\nChase is being represented by attorney Bobby Joe Champion — who is also a DFL state senator. Champion told me the real story is very different from what is outlined in the complaint.\nHe says police reports show the girlfriend and father telling divergent accounts of what happened. And he finds it peculiar that McGhee never called 911 when Chase showed up at his door – especially if he was so afraid for his daughter’s safety. The other peculiar thing, says Champion, is that McGhee shot Chase twice while he was on the ground, once in the back of the head and upper back.\nAt trial, both sides got to present their cases to a jury. The jury acquitted Dent-Wells of all charges.\nOctober\nLeaders of the Loud Pack gang sentenced\n“With the sentencing of Dementry Loyd, 20, the major contributors to a shooting and burglary spree in Minneapolis and Brooklyn Park will be locked up or on probation for several years,” Hennepin County Attorney Mike Freeman announced on Oct. 1.\nLoyd was sentenced to three years in prison for his conviction on an assault charge and 18 months for a burglary.\nMarlon Collins, 21, of Minneapolis was sentenced to 54 months in prison for an assault and a burglary. However, his sentence was stayed and he will be on probation for five years. Collins will have to spend a year in the Hennepin County workhouse. His brother, Montrelle Collins, 20, of Minneapolis, already was sentenced to 24 months on the assault he committed with Loyd and Marlon Collins.\n“All three are part of the Loud Pack gang which Loyd formed and led,” Freeman said. “Six other gang associates have been convicted of burglary and were sentenced to prison or workhouse time.”\nPolice say members of the Loud Pack specialize in burglarizing homes they believe contain guns.\nAccording to a search warrant request filed by investigators with the FBI Safe Streets Violent Gang Task Force, members of the Loud Pack gang, “target homes with American flags in the front yard because they believe these are homes or [sic] veterans and will have firearms inside them. Other items they take from these burglaries are sold on the street to various people to support the activates [sic] of the gang.”\nHospital gun\nOn Oct. 4, Robbinsdale police were called to North Memorial hospital after staff found a loaded handgun in a patient’s room. According to the complaint, patient Lakeric McCaskill, 29, told police someone brought him the gun because he was assaulted by a gang member and left for dead. McCaskill told officers he feared his life was in jeopardy.\nUpdate: McCaskill pleaded not guilty and is scheduled to appear in court March 3, 2014.\nSocrates and Picasso involved in drive-by shooting\nAccording to a complaint filed in Hennepin County District Court, at 2:02 p.m. on Oct. 13, police responded to a drive-by shooting call on the 1900 block of Lowry Ave. N. Officers found a wounded man – shot three times – at the scene. The victim identified Picasso Joseph Dejoachim, 34 as the shooter and driver. He says Picasso’s younger brother Socrates Jefferson Dejoachim, 24, was in the car. Both men were charged with attempted first degree murder and drive-by shooting.\nUpdate: Picasso pleaded not guilty to 1st degree attempted murder and drive-by shooting. His trial set for Jan. 21, 2014, was cancelled. He has a hearing scheduled for Feb. 3, 2014. Socrates is facing the same charges and has a plea hearing scheduled for Feb. 3, 2014.\nCharges: Eden Prairie man threatens to shoot ‘stupid immigrant’\nAccording to charges filed in Hennepin County District Court, on or about Oct. 26, a resident of Trillium Circle in Eden Prairie called police to report their neighbor, Ronald Bruce Stark, 70, threatened to shoot him.\n“Victim reported that he had been doing yard work when defendant [Stark] shouted to victim that defendant was going to ‘load his guns and shoot his ass,’” reads the complaint. Another neighbor, a former police officer, said he was outside nearby and overheard the conversation. Police say when they arrived on the scene, Stark was inside his home and refused to come out.\n“Officers finally made entry and arrested defendant,” says the complaint. “Officers found a shotgun inside defendant’s residence. Officers noted that defendant’s residence was cluttered and unkempt.”\nPolice say the victim reported Stark had threatened him before. “Defendant told police that victim is a ‘stupid immigrant’ and that that immigrants are the reason this country is having problems.”\nUpdate: A jury trial has been scheduled for May 19, 2014.\nAlcohol + anger + shotgun = reckless discharge\nMinneapolis police say on Oct. 30, Cha Vang, 44, was arguing with his wife just before he fired a shotgun round through the ceiling of his bedroom.\nAccording to the criminal complaint, Vang’s son told police his father has several guns, “and when he gets drunk, he starts arguments and then takes out a gun. He usually puts a round in the chamber and then lays it down on the bed between himself and his wife.” Police recovered 6 rifles and 3 shotguns from Vang’s bedroom. They also noted that the bullet from the fired shot was found lodged in the underside of a bed.\nUpdate: Vang pleaded guilty and will be sentenced on Feb. 25, 2014.\nSt. Paul gang internal shooting feud spills over into Minneapolis\nGang investigators from SPPD are looking into a series of incidents where numerous gun shots were fired into homes in St. Paul and an address in Minneapolis. According to documents filed in Hennepin County Court, two shootings occurred at a home on the 1000 block of Central Ave. W — one on Oct. 22, and another on Nov. 2.\n“On each occasion bullets were fired through the large picture window on the front of the house between 0200 and 0300 hrs,” reads the warrant. “On each occasion the residents [sic] was occupied by adults and children.”\nPolice say the intended target is a 32-year-old man who is a member of a clique called “Tycoon City” which is affiliated with the larger Selby Side criminal street gang. Police say within 30 minutes of one of the shootings, the front of a home on the 1300 block of Fremont Ave. N was hit with several .45-caliber bullets. “The home was occupied by two known Selby Side gang members,” reads the warrant.\nPolice say the two men in the home on Fremont are associates of the man living on Central Ave. W in St. Paul. They also say a confidential informant told them the shooter in both cases was a member of a rival clique of the Selby Side gang called “Hogg Life.”\nIt appears the beef between Hogg Life and Tycoon City members is not the only internecine conflict occurring within the ranks of the Selby Side gang. Another warrant filed in Hennepin County describes a battle between members of the “Gotta Have it” and the “Hustle Made” cliques.\nSPPD investigators say there has been a long on-going feud between different cliques of the Selby Side street gang that include homicides, weapons related offenses and aggravated assaults.\nThe search warrant names the men involved in the shootings. However, I didn’t name them because I couldn’t determine if charges were filed in Hennepin County in relation to the incidents.\nNovember\nGrievous gunshot wounds\nAccording to court documents, on Nov. 16, a man identified as CS went to North Memorial Hospital in Robbinsdale with a gunshot wound. Police say CS was struck three times, once in the penis. CS identified the shooter and police are investigating the case.\nMpls police: rival gang members present during Lake St. restaurant shooting death\nAccording to court documents, MPD investigators say gang members from the Latin Kings and the Sureno-13s frequented the restaurant where Luis Alejandro Torres-Sanchez, 32, was shot and killed on Nov. 25.\nPolice say Torres-Sanchez has an affiliation with the Sureno 13s. They say prior to the shooting, he approached an “admitted affiliated member of the Latin Kings and wanted to fight; no physical confrontation took place.”\nAccording to police, witnesses, including Latin Kings-affiliated customers and staff learned that the LK affiliated patrons used their cellular phones prior to the shooting.\nPolice say video footage at the scene showed, “One of the Latin King patrons goes out front and waits in a vehicle, the staff/security goes to the restroom located in the rear of the building and the third party moves away from the front window. The shooter then walks up and fires at the victims seated by front window.\nPolice are requesting, through an administrative subpoena to Sprint, T-Mobile, AT&T and Verizon, all cell tower activity on Nov. 25 between 1 and 1:45 a.m. “Your affiant further believes the requested cell tower activity…will tend to place an identified suspect in the area of 1611 E Lake st…at the time of the homicide, which would assist in establishing probable cause to make an arrest in the homicide investigation,” reads the warrant.\nDecember\nGun threat investigation focuses on man convicted in earlier gun case\nMinneapolis police are investigating charges that Mohamed Elmi, 27, pointed a gun at two people and threatened their lives. According to court documents, on Dec. 15, Elmi’s BMW was repossessed after he failed to make payments on the vehicle.\nPolice say Elmi was angry and pointed a gun at two employees of Star Auto on West Lake Street and told them, “You gonna die tonight! You not going to live!”\nHe’s the same guy who pleaded guilty to terroristic threats earlier in the year: On Feb. 1, a woman honked at Mohamed Ahmed Elmi, who was in a car blocking her way. Elmi responded by yelling at her, “I will shoot you in your mouth, b****.” And he lifted his shirt to show her a handgun. Elmi, 26, was charged with one count of terroristic threats.\nPolice say they believe Elmi is still on probation for this offense.\nAssault rifle in a diaper bag\nMinneapolis police arrested Steven Charles Perkins, 37, for illegally possessing a firearm at a home in north Minneapolis on Dec. 12. They found a loaded, semi-automatic handgun. They also found a 9 mm Kel Tec assault rifle with a 50 round drum in a diaper bag.\nPerkins was charged with illegal possession of a firearm.\nUpdate: On Jan. 13, 2014, the charges were dropped. In a court document, Hennepin County Attorney Mike Freeman explained, “Defendant does not have predicate offenses to support the felony charge.”\nReckless discharge after ‘Full Metal Jacket’\nA Maple Grove man was charged with accidentally shooting a woman in his apartment. According to the complaint, on Dec. 8, Timothy Ross Duea, 30, was showing the woman his loaded .40-caliber Sig Sauer pistol.\nOfficers say the woman told them she and Duea watched the movie “Full Metal Jacket.” After the movie the woman, “mentioned she wanted to get a conceal and carry permit and asked to see Defendant’s handgun.” She handed the gun back to Duea and when he placed his hand on the gun, “it went off.” Duea says he doesn’t remember “feeling himself pull the trigger.” He told officers the shooting was accidental.\nHospital staff later determined the bullet passed through the woman’s right index finger, entered her upper chest area and exited through her left arm. She also suffered a bruised lung and her right index finger was amputated mid knuckle. Police retrieved the handgun and an AR-15 rifle from Duea’s apartment.\nA hearing is scheduled for Feb. 7, 2014.\nMpls/FBI gang investigation of north Minneapolis street gangs continues\nSince 2010, Minneapolis police’s Violent Offenders Task Force (VOTF), as a part of the FBI’s Safe Streets task force, has used confidential reliable informants (CRIs), undercover officers and surveillance to monitor the activities of known and suspected gang members and associates.\nAccording to court documents filed in Hennepin County District Court, investigators say there is ongoing violence between members of the 1-9 Dipset gang and the Taliban.\nThe Taliban is allied with YNT — Young N Thuggin. Investigators also say YNT is loosely organized and does not appear to have a strict hierarchical structure. And they say YNT members mainly sell weed, coke and crack on the street corners of north Minneapolis. But investigators say lately, gang members have been making fake prescriptions for Oxycodone and selling the pills on the street.\nPolice also say these gangs are responsible for numerous shootings and murders in north Minneapolis.\nOn Dec. 17, the Hennepin County Attorney’s Office announced charges against four people affiliated with the 1-9 Dipset gang. According to the charges, the defendants were stocking up on weapons and ammunition to use in retaliation for the shooting death of one of their members, Tyrone Washington, 27.\nWashington was shot and killed at the Epic Nightclub in downtown Minneapolis on Nov. 3.\nMinneapolis city gun charges 2013\nThe city of Minneapolis charges misdemeanor gun cases. The city attorney prosecutes people for charges such as carrying a gun without a permit, or intoxication while carrying a gun. City attorney Susan Segal sent me these numbers:\nThe city charged 82 cases.\n73 gross misdemeanors:\n51 – carrying a pistol w/o a permit\n21 – carrying a rifle, BB gun or shotgun in public\n1 – negligent storage\n9 misdemeanors:\n1 – discharge of a dangerous weapon\n4 – replica firearm\n4 – carrying under the influence\nThe city has closed out 54 of these cases with an overall conviction rate of 81 percent (44 convictions), including 37 gross misdemeanor convictions (79 percent conviction rate) and 7 misdemeanors (100 percent conviction rate).\nTen cases were dismissed. Seven cases are pending.\nEpilogue\nTwo men charged with gun crimes in 2013 have been charged again this year.\nOn Jan. 15, 2013, Nathan Sims Jr., was charged with illegal possession of a firearm, actually a BB gun. He pleaded guilty and received three years probation. On Jan. 14, 2014, Sims was allegedly caught again with a firearm — this time a sawed-off shotgun. He was charged with “prohibited person in possession of a firearm.”\nLast year, the county dropped gun charges against Bernard Miles Jr. In a court document, Hennepin County Attorney Mike Freeman wrote his office was dropping the charges because it was, “unable to prove the case beyond a reasonable doubt as a result of the court’s order dated 10/2/2013 suppressing necessary evidence.”\nThat court order suppressed evidence of a gun found in the trunk of a car Miles was riding in.\nOn Jan. 13, 2014, Miles was arrested after police found a loaded .380-caliber pistol in the snow near a car he had been traveling in. He was charged with “aiding and abetting prohibited person in possession of a firearm.”\nbwilliams@mpr.org\nBrandt Williams is a reporter with MPR News’ Metro Unit. At MPR, Brandt has extensively covered city government, public safety and courts; race and justice; and livability issues in the city of Minneapolis. Brandt grew up in Minneapolis and graduated from the University of Minnesota with a degree in Speech Communications in 1991."}