{"uri": "http://www.azcentral.com/story/news/local/best-reads/2015/03/25/mesa-shooting-fifth-victim-recounts-shattered-hopes/70455838/", "title": "Mesa shooting: Fifth victim recounts shattered hopes", "dct": "Wed, 25 Mar 2015 00:00:00 GMT", "id": "091732c7b04d38468d2f716fc1b90349", "content": "Donovan Worker raises his hand in a fist, pressing it to his neck. It's there, he says, that the man with rage in his eyes had pointed a syringe needle just inches from his throat.\n\"He said, 'I'm going to kill you,'\" recalls Worker, a lean 24-year-old with a crew cut.\nWorker says he took a few steps backward, into his apartment bedroom, away from the man.\nThe man followed him. He demanded car keys, Worker says, and kept screaming, \"I'm going to kill you.\"\nWorker pleaded with the screaming man to believe him: No one in the apartment — not he, not his girlfriend in their room and not his terrified grandparents there in the living room — owned a car.\nNext came the punch to the nose, Worker says. Next came the gunshot.\nMesa police say the gunman who terrorized Worker and his family on March 18 is Ryan Giroux, 41. Giroux was hit with a raft of 35 charges ranging from murder to kidnapping.\nWorker was the fifth man wounded in the Mesa shooting spree last week that injured five people and left one man dead.\nUltimately, police say, the gunman fled Worker's grandparents' apartment on foot across the street and shot the sixth and final victim, Marcus Butler, 25, who survived.\nThe morning manhunt ended when police arrested Giroux at a condo complex just east of where Worker and Butler were shot.\nThe Republic's interview was the first for Worker and his girlfriend, Calisha Nez. Worker says his grandparents, Madeleine and Joe Holiday, are too scared to talk about the shooting.\nIn one sense, Worker was victim number five in a string of six shootings — after the first, which killed a man David Williams at the Tri-City Inn in Mesa, the gunshots were seemingly random, the victims happening to step into the gunman's meandering path as he attempted to steal vehicles and flee.\nBut in another sense, the family at the Mesa apartment was unique in their terror: Unlike the others, their home was invaded. When the gunman forced his way into their apartment, Worker says, he stole their sense of security.\nPhotos: Mesa shooting\nA better life\nThis small apartment, an upstairs unit on the eastern end of an apartment complex called Sorrento, is where Worker and Nez planned to make their dreams come true. The young couple have dated for five years. They had saved money to leave their home in Page and move to the city.\nWorker would start barber school while Nez studied massage therapy.\nWorker's grandparents had been living in the Valley with an uncle. The four would find an apartment to share at Sorrento, near Emelita Avenue and Dobson Road.\nNez got a job at Talking Stick Resort in Scottsdale. They learned how to use the bus system, and got lost so often that they taped a transit map to their living-room wall.\nThey saved money for school by living together as a family, sharing expenses. Slowly, they were making a home in the city, Nez said.\nUntil that morning when a gunman, who had seen Worker's grandmother on the balcony, knocked on the Army-green door.\nIt's difficult to relive what happened that day because the terror is still fresh, said Nez and Worker, speaking from the doorway of their second-floor apartment.\nIt was morning. No one inside the apartment could have imagined a gunman had already shot four people and was now on their doorstep. Worker said his grandparents unknowingly answered the door.\nWhen Worker heard voices in the living room, he came out of his bedroom, where he had been asleep with Nez. He figured it was a friend or a relative.\nThat's when the man grabbed one of his grandfather's insulin needles and threatened to kill Worker, he says. That's when Worker stepped back into his room.\nWorker's girlfriend, Calisha Nez, a petite 24-year-old with raven-black hair, had been sleeping next to Worker that morning. It was her day off work. She had planned to tackle chores and take her family out to eat.\nShe woke that morning to the sound of a stranger attacking her boyfriend. She sat paralyzed with terror as Worker bargained for their lives.\n\"I told him we don't have a car,\" Worker says. The man didn't believe him.\n\"He punched me,\" Worker says, putting his hand to his nose where he had been struck. The blow caused Worker to fall. The man raised a gun. He loomed over Worker's body.\n\"He shot me,\" Worker says, his eyes growing wide with fear as he relived the attack. He glanced at his arm where a bullet had ripped through his muscle, fracturing his bone.\nHaving just wounded Worker, Nez says, the gunman ran from the apartment as quickly as he'd forced his way in.\nNez, with her eyes cast down, fixed on the ground, recalls rushing to Worker's grandparents in the living room. \"I said stay in the house, lock the door,\" she said. \"I ran back to Donovan.\"\nShe found her boyfriend on ground. There was blood everywhere.\n\"I called 911,\" she says. Nez waited by Worker's side. Soon a police SWAT team arrived. They rushed Worker to an ambulance that took him to Chandler Regional Medical Center.\nFear remains\nWorker was released that day. But the family didn't return to their home until Sunday, four days after the shooting, Nez said. Reporters had left them notes asking for interviews.\n\"We didn't want to talk about it,\" Nez says.\nThey can't find peace of mind there.\n\"There's ambulances all the time around here,\" Nez says. \"Grandma and Grandpa hear that and get scared.\"\nNow, a knock at the door brings to mind the sound of gunshots. And the sick fear of death.\nFear keeps Worker's grandparents awake at night. Nez hasn't been able to go back to work. Worker looks out the small kitchen window before answering the door.\nHis arm and shoulder are covered with purplish-black bruises from the bullet wound. Doctors haven't said how long it will take for Worker to regain use of his hand. He worries the injury will delay his job search and his dream of starting barber school.\nNez is sad when she says that they are moving out. It's the only way they can think to shake their fears.\nThey are hoping apartment managers will understand and let them out of their lease.\nThey're worried about money, but hopeful for a fresh start in a new apartment. They imagine a place with a locked gate, high fences and security cameras to monitor the grounds.\n\"Somewhere we'll feel safe,\" Nez says."}