{"uri": "http://www.azcentral.com/story/news/local/mesa/2015/03/18/mesa-shooting-victim-gunshot-selfies/24994405/", "title": "Mesa shooting victim takes a bullet, then a selfie", "dct": "Wed, 18 Mar 2015 00:00:00 GMT", "id": "641431960d21dd53d8732a04a205f78f", "content": "So what's the first thing you'd do if you got shot?\nIf you're Isaac Martinez, you take a picture of yourself and post it on social media.\nMartinez, 20, works at Bistro 13, a restaurant operated by the East Valley Institute of Technology. He found himself in the middle of Mesa's shooting spree Wednesday morning, after suspect Ryan E. Giroux allegedly approached him and demanded that he turn over the keys to his car.\nWhen Martinez said no, Giroux allegedly shot him. Martinez immediately posted a photo of himself, blood staining and dripping from the shoulder area of his white uniform, on the social app Snapchat.\nAfter he was taken to the hospital, Martinez posted another photo of himself in a hospital bed, with his gunshot wound clearly visible. He was treated and released.\nOn Facebook, he updated his some 1,200 friends on his status.\n\"So im home and well! I have no complicated injuries and should heal fine,\" Martinez's Facebook posts says. \"I had a bullet hit me from behind and go through my shoulder and out my coller area. Any higher or lower it coulda hit a artery, or shatter my shoulder blade. It was a miracle hit.\"\nHe also detailed the shooting scene as it unfolded.\n\"He (the suspect) came in and demanded my keys for a getaway car. Of course i said no, and next was him pulling out a gun and cocking it. Soon as i saw it i started stepping back. And yelled for everyone to step back and get down. Next thing i knew i was hitting the ground, got up as fast as i fell, and ran out the back exit. At the same time the assailant had started taking off in my chef instructors car. When i saw he had gone. I noticed the cops and fire trucks down the street and went there.\"\nPerhaps not ironically, Martinez lists \"sh** happens\" as his favorite quote on his Facebook page."}