{"uri": "http://www.azcentral.com/story/news/local/mesa/2015/03/18/mesa-shooting-near-light-rail/24961403/", "title": "Mesa shooting: Ryan Giroux confirmed as suspect", "dct": "Wed, 18 Mar 2015 00:00:00 GMT", "id": "db4e1232fd4386dc7be4ddd0b23da94c", "content": "An ex-convict with a history of violence and drug use is accused of gunning down a man in a Mesa motel Wednesday morning, then going on a shooting spree that left five others, including a culinary student, injured.\nA Mesa SWAT team took Ryan Giroux, 41, into custody around 1 p.m., in a vacant condominium near Longmore and Emelita Avenue after a massive manhunt that included four other law-enforcement agencies.\nGiroux was shot with a Taser, taken to Banner Desert Medical Center in Mesa for treatment, then questioned late into Wednesday evening by detectives and investigators. He was expected to be booked into Maricopa County's Fourth Avenue Jail on multiple charges.\nThe violence began shortly after 8 a.m. at the Tri-City Inn, a sherbet-orange, one-story motel at 1504 W. Main St. that is flanked by a used-tire store and a custom motorcycle shop. It offers kitchenettes, phones and HBO, renting primarily on a long-term basis.\nREAD: Official City of Mesa statement\nGiroux is suspected of having walked into one of the rooms there, where a dispute erupted and bullets began to fly. Afterward, one man lay dead and two women were wounded.\nThough Mesa police declined to release victim names, witnesses identified the dead man as David Williams, 29, who lived at the motel.\nOne of the wounded at the motel was identified as Lydia Nielsen, Williams' mother. A spokeswoman for Scottsdale Osborn Medical Center said Nielsen had been treated and released.\n\"We don't know exactly what he (Giroux) was doing there, but he was asking for something in particular. We don't know if it was drugs, money — those things will be worked out through the investigation,\" said Mesa police Detective Esteban Flores.\nMesa Detective Steve Berry called the incident a homicide that \"had nothing to do with gang affiliation or a hate crime.\"\nVeronica Ehrig, Williams' girlfriend, said she worked at the motel as a housekeeper while Williams did maintenance work. Motel owner Sumantrai Patel described them as an unemployed couple who had lived at the residential motel for about three months, working in exchange for rent and sometimes food.\nAt around 8 a.m., Ehrig said, she was outside the room where the shooting occurred. Williams was inside with his mother.\n\"He (Giroux) said something to David,\" Ehrig said. \"David said something back, and that dude just pulled out a gun and point blank just shot David and shot his mom.\"\nEhrig said she ran into the room, \"but there was no helping him. There was blood everywhere.\"\nEhrig thinks that Williams knew the suspect, but she had never seen him before. Records show the men served time in state prison several years ago, but state corrections officials say they never were housed in the same unit.\nPolice have not disclosed any information about the third victim at the motel, other than to indicate that it was a woman.\nThe shooter fled the motel to Bistro 13, just down Main Street, where he stole a car. The restaurant is run by the East Valley Institute of Technology, which provides career training to mostly high-school students.\nThere, the gunman approached EVIT student Isaac Martinez and demanded that he turn over the keys to his car, Martinez said. When he refused, the gunman shot him in the shoulder, according to police. In an odd twist, Martinez immediately posted a photo of himself on the social-media app Snapchat, a large blood stain clearly visible on the shoulder area of his white uniform.\nSeven students and one instructor were working in the Bistro when the shooting occurred. Immediately after gunshots were heard, Mesa police ordered the EVIT campus into lockdown, where all doors were locked and students were moved into locked rooms. Parents of the affected students were notified.\nThe gunman took the stolen car and traveled to 901 S. Dobson Road, where he he barged into an apartment and shot a fifth victim during an unsuccessful robbery attempt.\nFleeing that location, the gunman ended his spree at the Villetta Apartments, 1840 W. Emelita Ave., where the last victim, a maintenance worker, was shot and wounded.\nJacen Clements, a resident at Villetta, said he was on his patio when he saw the man walking by the pool near the maintenance worker.\n\"Then I hear the shots — it was five really quick in succession, like pop, pop, pop, pop, pop. And then there was a pause, and then I heard four really quick shots.\"\nThe injured maintenance worker was not identified.\nLater, yellow police tape cordoned off the parking lot and section of Villetta Apartments where the man was shot as investigators combed the location. A Forensics Services Crime Scene Unit van was parked nearby.\nPolice officers set orange and green markers in the lot where the gunman had held a person named Luis Lopez at gunpoint. Lopez said the gunman struggled to get into his vehicle. The gunman panicked, gave up and jumped the fence, Lopez said. He then ran across the street to Emelita Condos.\nLater in the day, residents were still standing on the sidewalk as rain started to fall, pointing at the upstairs unit where police finally cornered the suspect.\nWilliam Miller was walking his dog in front of the condos.\n\"That's where they got him,\" Miller said, pointing to the second floor. \"No one lives there. I don't know why he (the suspect) came out (to the balcony) ... He could have stayed holed up in there for days. No one would have known.\"\nMesa Mayor John Giles later released a statement saying: \"I would like to extend our heartfelt thoughts and prayers to the shooting victims and their families ... Mesa is a resilient community and part of a region that comes together in times of crisis.\"\nBy early afternoon, television cameras had captured authorities walking Giroux to a waiting police vehicle. He was covered from head to toe in a white biological evidence suit. The suit was hooded and Giroux's hands were shackled in front of him.\nThe biological protective suit is used on suspects whose clothing has been taken so that authorities may collect DNA evidence.\nGiroux, who has had the words \"Skin Head\" tattooed on his eyebrows, is a former Arizona Department of Corrections inmate with a history of police assaults and illegal drug use, according to police and prison records.\nHis criminal record dates to the early 1990s, and includes convictions for drug possession, theft and aggravated assault, according to DOC records. He also served a two-month county jail sentence last year for violating terms of his probation.\nGiroux's DOC photo shows him with numerous tattoos on his neck and face that Richard Valdemar, a Los Angeles-based gang task force expert, said is a \"pretty clear indicator of gang sympathies.\"\nRepublic reporters Sean Holstege, Robert Anglen, Matthew Casey, Parker Leavitt, Ken Alltucker, Dianna M. Náñez and Amy B Wang contributed to this article."}