{"uri": "http://www.nbcnews.com/news/us-news/mesa-arizona-shooting-least-four-people-shot-suspect-loose-n325851", "title": "Mesa Shooting: Police ID Suspected Gunman as Neo-Nazi With Long Record", "dct": "Thu, 19 Mar 2015 03:23:00 GMT", "id": "f2579ecab3537b5f50937fa664022570", "content": "The man accused of shooting six people, one of them fatally, in Mesa, Arizona, is a 41-year-old neo-Nazi skinhead named Ryan Elliot Giroux with a long prison record, police and human rights activists said Wednesday.\nGiroux, whose identity Mesa police confirmed Wednesday night, has done several stretches in Arizona prisons for a variety of crimes, including assault, burglary and theft. He also racked up a list of violations while in prison. His last sentence ended in 2013, and he was released from parole supervision in October of last year, records show.\nMark Potok, editor of Hatewatch, a bulletin on hate crimes published by the Southern Poverty Law Center, reported that the many tattoos on Giroux's face and torso were associated with neo-Nazi and white supremacist groups. Specifically, Potok wrote, the number 88 on his left temple is neo-Nazi code for \"Heil Hitler,\" since H is the eighth letter of the alphabet.\nPotok quoted a retired Mesa police detective who identified Giroux as a member of a skinhead group called Hammerskin Nation.\nGiroux was shot with a Taser and taken into custody just after 1 p.m. (3 p.m. ET), Mesa police said. He was found during a search of a condominium complex in which police spotted him on a balcony of a vacant home, police spokesman Esteban Flores said.\nThe rampage began at 8:40 a.m. at the Tri-City Motel Inn on West Main Street, where an argument exploded into gunfire, police said. One man died at the scene, and two women were taken to a hospital with gunshot wounds.\nNot long after, gunfire erupted at a nearby restaurant called Bistro-13, across the street from East Valley Institute of Technology, Flores said. An EVIT student was shot at the restaurant, where Giroux crajcked a gray Honda Accord driven by a teacher and drove to an apartment complex less than two miles away on South Dobson Road, police said.\nGiroux forced his way into an apartment, where he shot a man, police said. That victim is also expected to survive.\nThen came reports of another shooting victim at an apartment complex about a quarter-mile away. A man shot there remains in critical condition, Flores said.\nGiroux is believed to have acted alone. Police said they were still interviewing him and had discovered no motive."}