{"uri": "http://fox6now.com/2014/12/28/mayor-barrett-mpd-to-hold-news-conference-after-13-month-old-boy-shot-killed/", "title": "“Nobody deserves this:” 13-month-old boy loses his life after “dozens” of shots fired into home", "dct": "Sun, 28 Dec 2014 13:27:00 GMT", "id": "b3977a810a93e8f6026bab86707609c2", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nMILWAUKEE (WITI) -- A 13-month-old boy is dead after police say \"dozens\" of shots were fired into a home near 73rd and Mill on Milwaukee's northwest side on Saturday evening, December 27th. Bill Thao died at the hospital. Police said in a news conference Sunday afternoon at the scene they are following up on \"at least one very positive lead\" that is pointing police in the direction of \"one or more people.\" Police also say they're analyzing ballistic evidence from more than one gun.\n\"Dozens of shots rang out, breaking the silence of a normally very peaceful neighborhood,\" Milwaukee Police Captain Aaron Rapp said during a Sunday afternoon news conference held at the scene.\n\"Two days after Christmas, Bill Thao, 13 months old, at a family gathering, in a home, lost his life,\" Milwaukee Mayor Tom Barrett said Sunday.\nPolice say the home was occupied by several people, and the child was in a front room of the home when several rounds entered through front windows. Police say the child and his mother were visiting the home at the time of the shooting.\n\"Dozens. Dozens of bullets into a home. There were plenty that didn't make it into the house,\" Captain Rapp said.\n\"I don't know if the shooters were stupid, on drugs. I don't know if they had the wrong house -- but as far as we can tell, the people in this home had nothing to do with those shots being fired,\" Mayor Barrett said.\nPolice were called out to the scene just before 6:30 p.m. Saturday, December 27th. The boy was conscious and breathing when he was taken from the scene to the hospital. He later died at the hospital.\nNo one is in custody.\nYou need to have the Adobe Flash Player to view this content. Please click here to continue.\nPolice say no motive for the shooting has been developed, and it isn't clear whether the family was specifically targeted by the shooter(s).\nCaptain Rapp said during Sunday's news conference the bullet that hit the child appeared to have read: \"To Whom It May Concern.\"\n\"This is concerning to all of us. If you know something, it is incumbent upon you to say something. We will find and bring the societal vermins to justice,\" Captain Rapp said.\nCaptain Rapp says MPD is processing a \"fair amount\" of items of evidentiary value found at the scene.\nAdditionally, during Sunday's news conference, Captain Rapp made mention of a shots fired complaint that came in from the area \"a day or two\" before Saturday's incident. He wouldn't elaborate on exactly where those shots were fired. He said that shots fired incident may be released to Saturday's incident, or it may not.\nLoved ones and strangers gathered for a vigil at the scene Sunday evening. The young boy's family is heartbroken over what happened.\n\"I feel sad. I feel really sad. We just gather together and cry for the innocent child,\" the boy's uncle, Be Thao said.\nThe boy's cousin, Kou Thao says the boy had only been at the home for about 15 minutes before he was shot.\nYou need to have the Adobe Flash Player to view this content. Please click here to continue.\n\"He was standing -- playing with toys on a table. We got some veterans from the Vietnam War. When they heard the shots they just grabbed all the kids and put them down -- so that really helped,\" Kou Thao said.\nDisheartened another innocent child has been killed by gunfire in Milwaukee, Amy Ludin stopped by the home Sunday to place a teddy bear and some words of peace on the lawn.\n\"It breaks my heart. I`m hurting for the family more than anything. Last night I did nothing but cry. I didn`t sleep thinking this could be our child, could be our grandchild, anybody. Nobody deserves this,\" Ludin said.\n\"Everyone, like I said, is in shock and scared,\" Kou Thao said.\nLittle Bill Thao's family says the boy had just started walking.\n\"The callus disregard for this criminal element to pull the trigger not knowing where the bullets will go is beyond belief,\" MPD Assistant Chief James Harpole said during Sunday's news conference.\nDuring the news conference, Harpole discussed a program involving MPD and its federal partners that can assist folks in escaping \"crews, groups and gangs\" with which they no longer wish to be associated.\n\"Folks who want to get out of their crews, groups or gangs are encouraged to call MPD. We will help you,\" Harpole said.\nBut if member(s) of a gang are found to be responsible for a violent crime like this one...\n\"The full force of law enforcement will come down on the entire crew. The entire crew,\" Harpole said.\nYou need to have the Adobe Flash Player to view this content. Please click here to continue.\nMPD tells FOX6 News they have no reason to suspect this incident is connected to Asian or Hmong gangs.\nMayor Barrett encouraged folks who may know who is responsible for this incident to contact police.\n\"I want to talk about the people who know the individuals who are involved in these shootings. As far as we can tell, the people in the home had nothign to do with those shots being fired. Dozens of shots were fired, and a 13-month-old boy lost his life. We are talking about individuals committing these crimes who have no moral compass. Our police department is going to do everything it can to bring to justice whoever it was who ended Bill Thao's life,\" Mayor Barrett said.\nPolice are asking for the public's assistance in finding the person or persons responsible for this shooting. Anyone with information is asked to call police at (414) 935-7360.\nDuring Sunday's news conference, Mayor Barrett made reference to the shooting deaths of 10-year-old Sierra Guyton (who died at the hospital in July after she was shot in the head while playing on the playground in May) and five-year-old Laylah Petersen (who died after she was shot while sitting on her grandfather's lap in November).\n\"We want all people to feel safe. The vast majority of people in this community are very safe. But there have been three incidents in seven months I would describe as a parent's worst nightmare. People are shooting guns with absolutely no regard for human life,\" Mayor Barrett said.\nYou need to have the Adobe Flash Player to view this content. Please click here to continue.\nMilwaukee Alderman Robert Puente issued the following statement in relation to this case:\n\"I extend my sincere condolences to the parents and loved ones of 13-month-old Bill Thao, who died Saturday night after he was shot while inside a home in the 6400 block of N. 73rd St. A person or persons riddled the home with dozens of gunshots, and the result is an unimaginable loss for the family, and an unspeakable crime for our city.\n\"Milwaukee Police Department investigators are working diligently to find the person or persons responsible for this cowardly and outrageous act of deadly violence, and I urge anyone with information about the shooting to contact the MPD at 414-935-7360.\""}