{"uri": "http://www.rgj.com/story/news/2016/10/23/three-injured-sunday-morning-reno-shooting/92644384/", "title": "UPDATE: Reno police still probe deadly shooting", "dct": "Sun, 23 Oct 2016 00:00:00 GMT", "id": "f7ce47e61363f9d1603c371934a5844e", "content": "12:52 p.m. Monday update:\nReno police continue to probe a shooting that killed one girl and injured two teenage boys over the weekend.\nThe shooting was reported at about 1 a.m. Sunday in the area of Douglas Alley and North Virginia Street in downtown Reno. The name of the 17-year-old teenage girl, who died of her injuries at a local hospital, was not immediately released.\nPolice also did not identify the two teenage boys.\nPolice is still investigating the shooting, and no arrests were made as of late Monday morning.\nOriginal update:\nA teenage girl died and two teenage boys were hospitalized after a shooting in Reno early Sunday morning.\nThe 17-year-old girl, whose name was not released due to her age, succumbed to her injuries Sunday afternoon, according to a news release from the Reno Police Department.\nAt about 1 a.m. Sunday morning, Reno Police officers heard gunshots in the area of Douglas Alley and North Virginia Street in downtown Reno. The officers located a male and female who had both been shot, according to the release.\nBoth victims were transported to Renown Regional Medical Center, where they were treated for their injuries, Reno Police spokesman Tim Broadway said. The male victim, 16, needed surgery but is expected to survive.\nA third shooting victim, an 18-year-old man, arrived at Renown later that morning and was treated and released for non-life-threatening injuries, according to the release.\nOfficials believe the shooting to be gang-related. The case is being investigated by the Reno Police Robbery Homicide Unit with the assistance from the Regional Gang Unit.\nSecret Witness is offering a reward of $2,500 for information leading to the arrest and prosecution of the suspect or suspects. Anyone with information about this case is asked to contact the Reno Police Department at 775-334-2188, Secret Witness at 775-322-4900, www.secretwitness.com or text the tip to 847411 (TIP 411) keyword SW.\n(EDITOR'S NOTE: A previous version of this story included a suspect surveillance photo that accompanied a Secret Witness news release about the reward. That photo did not depict the suspect and has been removed.)"}