{"uri": "http://www.stltoday.com/news/local/crime-and-courts/pine-lawn-teen-gunned-down-in-street-is-identified-police/article_5c022fb3-9b7d-5c8b-a150-01390c63ca8e.html", "title": "Pine Lawn teen gunned down in street is identified; police looking for orange Dodge Charger", "dct": "Tue, 21 Jun 2016 00:00:00 GMT", "id": "8ff7728ff0cce2b4f76cb95f6cb4406f", "content": "PINE LAWN • Was a Pine Lawn teen killed over a pair of jeans?\nPolice say that is one possibility they are investigating as they hunt for the killer of 15-year-old Jirah Campbell. They are searching for an orange Dodge Charger and two people who fled the scene.\nJirah, of Pine Lawn, was gunned down Monday in the street, in the 6300 block of Dardanella Avenue in Pine Lawn. He had been shot multiple times.\nThe killer wasn’t after any clothes Jirah was wearing; instead, police say, Jirah may have been carrying a pair of jeans in a bag.\nFlorissant police Lt. Dan Biermann, who is leading the Major Case Squad detectives, confirmed that investigators have weighed that as a possible motive.\n“We’re looking at it,” he said. “We can’t discount it” until the killer is found.\nDemetris Blackmon, 33, who lives nearby, said his child and his girlfriend’s child were playing outside Monday and saw an orange Dodge Charger circle the block.\nWitnesses said they saw a woman driving and a man jump out of the car and approach Jirah.\n“They said he rolled up on the little guy (Jirah) and said, ‘Give me the bag. Why’d you take my jeans?’” Blackmon said.\nBlackmon said there is a popular brand of Rock Revival jeans, which can sell for upwards of $200, and that the man was accusing the victim of stealing them. Such jeans are a must-have among some young men, Blackmon said. “That’s what everyone’s getting now.”\nBlackmon said Jirah was a good kid who largely kept to himself.\nBiermann, leading the police investigation, said Tuesday that no one was in custody. He said police had no suspects and no concrete motive.\nJirah lived in the 2500 block of Arden Avenue. His aunt, Khalil Thomas, said a fundraising effort is under way for the family to help pay for funeral expenses.\nHis grandfather, Byron Mischeaux, said Jirah lived with his mother, brother, sister and stepfather. He was a hard worker who did just about every job at Mischeaux's barbecue restaurant on Union Avenue, Mischeaux said.\nJirah also loved animals and would \"constantly\" be bringing stray dogs home, Mischeaux said. A few days ago, Jirah found a turtle.\n\"He was crazy about it,\" Mischeaux said.\nHe had the turtle in a bag, in fact, the day he was killed. Mischeaux said Jirah may have had jeans in a red book bag, but Mischeaux doesn't know what to make of the theory about the jeans.\n\"I'm kinda thinking it was over colors,\" the grandfather said. \"He had on a red shirt, red shoes, a red bag ... I just don't know. I'm turning it over to the Lord.\"\nPolice in Pine Lawn were called to Dardanella for the shooting at about 5 p.m. Monday. They arrived to find Jirah dead in the street.\nWitnesses said the gunman fled in the Charger. Police say a search came up with a list of several dozen such cars in the St. Louis area.\nThe gunman was described as a black man in his late teens or early 20s, 5-foot-9 to 5-foot-10, weighing 140 to 150 pounds.\nThe driver of the car was a woman with her hair in braids.\nIt’s not clear if the car had Missouri or Illinois plates.\nAnyone with information is asked to call Detective Doug Barber of the Major Case Squad at 314-574-4041.\nTipsters who want to remain anonymous can call CrimeStoppers at 314-725-8477.\nThe North County Police Cooperative, which patrols Pine Lawn, asked the squad to take over the investigation."}