{"uri": "http://www.kctv5.com/story/29985962/infant-among-3-murdered-in-south-kansas-city-home", "title": "Infant, 2 teens murdered inside south Kansas City home", "dct": "Wed, 09 Sep 2015 03:01:00 GMT", "id": "9a1f085248cd72db6169b9f47b427e23", "content": "KANSAS CITY, MO (KCTV) -\nTwo teens and a 1-year-old child were found slain inside a south Kansas City home, and police are searching for the gunman.\nLoved ones say Bianca Fletcher, 17, and her 1-year-old son, Joseph were two of the victims. Fletcher was a senior at Raytown South High School. The infant was affectionately called JoJo.\nFriends say Fletcher broke up with JoJo's father several months ago, and some believe the breakup was contentious. The third victim was Shannon Rollins Jr., who Fletcher had recently started dating, family members say.\nInvestigators said the triple shooting is being investigated as a triple murder and not a murder-suicide. Police have provided few details publicly.\nIt was Fletcher's 16-year-old brother, Brandon, who found the three victims dead inside a home at East 84th Street and Hillcrest Road, located just west of Interstate 435. Police were called to the scene shortly before 9:30 p.m. Tuesday.\n\"He walked in and they were all dead,\" neighbor Brandon Wahnon said. \"I just can't believe it.\"\nFletcher's younger brother is a junior at Raytown South. Because police haven't released the identities, district officials declined to discuss the situation.\nClassmates and friends who were in class with Fletcher on Tuesday are devastated.\nKyri Jones said he and Fletcher had been friends since seventh grade. He said they chatted via phone after classes on Tuesday.\n\"It's just very weird seeing her yesterday and now she's gone,\" said Jones who came to the neighborhood in disbelief on Wednesday. \"This will be my last time coming up here. No reason to come up here now so just looking at the house for the last time. It's just weird seeing police at the house where your best friend was murdered.\"\nA makeshift memorial is growing outside the residence.\nFletcher had two older sisters. Her grieving father, brother and other family members are staying with one of the older women now.\nThe home's owner said she has rented the residence to Rick Fletcher for the past three years. She said the man lived at the home with his adopted children and his daughter's baby. She said they were a nice family who paid on time and there were never any problems.\nJones said his friend adored her baby boy.\n\"That was her world right there. She was in love with that baby,\" he said. \"Anytime you found Bianca you found Joseph with her.\"\nRodney Long lives two doors down from the Fletcher family. He noticed two cars turning around at the street's dead end about 30 minutes before the boy came home.\n\"I can't even fathom someone hurting and killing an innocent baby. It's sad,\" he said. \"Enough they killed the couple but the baby? That's a sick individual and I hope they find him and put him as far underground as they can get him. That's just evil.\"\nJackson County Prosecutor Jean Peters Baker echoed those comments.\n\"It was preventable but it was not prevented,\" she said during an interview with KCTV5. \"This baby didn't have to die.\"\nBaker, Kansas City Mayor Sly James and Police Chief Darryl Forte all rushed to the crime scene Tuesday night. The mayor expressed his frustration over the growing number of gun-related deaths in the city.\n\"Idiots who have guns are going to use those guns for bad things. And until we come to grips with that and start taking the guns out of the hands of people who shouldn’t have them, we’re going to continue to have this. It’s just that simple,\" James said, \"If people want this to stop, they need to rise up and make it stop. It’s not just him. It is not just me. It is everybody in this city.\"\nJames said the fact an infant is a victim makes him even more upset.\n\"It is absolutely ridiculous. There is no reason that I can think of why any child should ever be at the end of a bullet. I don't know how to deal with that. Don't know how to deal with that,\" he said.\nBaker said she is also frustrated, just like the community.\n\"I’m angry. But it is also important to note that this problem, of all the problems our city faces, this problem is 100 percent preventable. We can prevent another child death from happening. This is not a police issue, this is not a prosecutor issue, it’s a community issue,\" she said.\nPolice do not yet have a description of a suspect. Some claim the baby's father had been hostile even threatening to shoot one person and his dog.\nBaker is begging people to come forward and tell police what they know about the cases.\n\"Any homicide in a community is one too many. But I want to know what the community knows so that we can bring justice to this community,\" she said.\nWahnon is among the many hoping for justice, saying the killer is sick.\n\"I don't know how someone could sleep at night doing that to a little kid,\" he said.\nKCTV5's Josh Marshall, Brandon Richard, DeAnn Smith and Jonathan Carter contributed to this report.\nCopyright 2015 KCTV (Meredith Corp.) All rights reserved."}