{"uri": "http://www.seattlepi.com/local/komo/article/5-injured-after-drive-by-shooting-on-Capitol-Hill-6650198.php", "title": "5 injured after drive-by shooting on Capitol Hill", "dct": "Mon, 23 Nov 2015 00:00:00 GMT", "id": "8ba6f1200e0f30f9abc740d58ceb9b2c", "content": "Police are trying to sort out a shooting early Sunday that left five people wounded on Capitol Hill.\nThe shooting happened around 1 A.M. near East Pike Street and Broadway, an area that's typically busy on Friday and Saturday nights.\nFour people -- including three women in their 20's -- had been shot, and one person had been hit by glass fragments after a QFC grocery store window shattered. The Seattle Fire Department said there were no serious injuries, despite a chaotic scene and earlier reports.\nWitnesses told police they heard an argument between a group of people before shots were fired. The shots were fired from a silver sedan that sped away, witnesses said.\n\"I kinda knew immediately that those are gunshots, you know what I mean?\" said Sam Osborne, who lives about a block away from the shooting scene.\nGang unit detectives processed the scene and located multiple shell casings. No suspects or suspect descriptions have been released by police.\n\"I just hate that now I have to worry about that, you know? I have to worry about a stray bullet coming into my apartment,\" said Osborne.\nOsborne has noticed a change in the neighborhood over the past two years after several shootings and other acts of violence, he said. The shooting Sunday morning was the closest to his home.\n\"My main fear is that's going to happen to somebody that I know. Not necessarily that they're going to be a target, but they're going to be hurt,\" Osborne said.\nSeattle Mayor Ed Murray met briefly with QFC employees Sunday evening near the shooting scene.\nOfficers arrived at the scene shortly after the shots were fired, he said. Detectives are doing everything they can to identify everyone involved, he added.\n\"This is a vibrant neighborhood and it's also a safe neighborhood. It's actually my neighborhood. I've lived here for the last 31 years,\" Murray said.\nAnyone with information about the shooting is asked to contact the Seattle Police Department."}