{"uri": "http://www.kansascity.com/news/local/crime/article113148463.html", "title": "KC man accused of accidentally shooting himself and 1-year-old daughter", "dct": "Mon, 07 Nov 2016 16:56:00 GMT", "id": "c8e55d7bc3e5639020f0c778ee9051ad", "content": "A-29-year-old Kansas City man cleaning his 9 mm handgun Sunday accidentally shot himself and his 1-year-old daughter, Jackson County prosecutors alleged.\nGeorge R. Turrentine faces charges of child endangerment, armed criminal action and possession of marijuana in the incident inside an apartment in the 1700 block of Concord Court.\nProsecutors requested a bond of $50,000.\nAuthorities said Monday that Turrentine was cleaning a Smith & Wesson handgun when it went off. The bullet ripped through Turrentine’s arm and struck the toddler, damaging her pelvis and spine. Turrentine and the child’s mother scooped up the girl and rushed to Research Medical Center.\nThe girl had multiple bone and bullet fragments in her when she underwent surgery Monday at Children’s Mercy Hospital. Doctors performed exploratory surgery to look for more damage. It was unknown if she would be permanently paralyzed, according to court records.\n“If you have a gun and you don’t know how to safely use it, safely clean it and someone in your home gets injured because of your own negligence or recklessness, you are going to be held accountable for that,” said Jackson County Prosecutor Jean Peters Baker.\n“All I can say is the consequences that I can level are so much smaller than the consequences in having the knowledge that a child was injured because you did not properly secure your weapon. There’s nothing I can do that is going to match that.”\nAccording to court records, the child’s mother told investigators that she and her daughter were lying on the bed playing with her cellphone when she heard a “pow,” and realized that Turrentine and the child had been shot.\nTurrentine and the child were both listed in stable condition Monday.\nTurrentine reportedly later told police he was moving too fast and when the handgun went off. Detectives obtained a search warrant for Turrentine’s apartment. They found the 9 mm handgun, an AR-15 style rifle, multiple containers of a green leafy substance they believed to be marijuana, a 9 mm shell casing and apparent blood.\nBaker said she went to the crime scene to guide investigators. She later took to Twitter on Monday to express her thoughts of another child shooting. The 1-year-old girl was the third child in the area accidentally shot recently. Two others shot earlier died.\nAnother child shot. Infuriating! Some problems are complex. But not this one-kids can be safe w/ simple &amp; inexpensive gun safety measures.\n&mdash; Jean Peters Baker (@jeanpetersbaker) November 7, 2016\nBaker said those who own firearms must take safety precautions to ensure that no one is injured. Baker said her office and several police and law enforcement agencies give away gun locks at no charge.\n“This is unnecessary,” she said. “That child is fighting for her life, and I can’t explain to anyone why that happened and why that couldn’t have been prevented. I will continue to speak.”\nOn Friday, 1-year-old Antonio Rucker Jr. died after he was mortally wounded in an apparent accidental shooting in Kansas City, Kan. A 3-year-old died from gunfire in Kansas City nine days earlier.\n“It’s heartbreaking to hear the news of yet another preventable death of a child. People must recognize the sacredness of life,” said Damon Daniel, executive director of the Ad Hoc Group Against Crime.\n“Far too many people carelessly leave firearms within reach of children, or recklessly shoot into crowds or homes, with no regard for innocent bystanders, nor the collateral damage they inflict upon the unintended targets, family, community or their own families.\n“Where is the honor? Where is the courage?” Daniel said.\nGlenn E. Rice: 816-234-4341, @GRicekcstar"}