{"uri": "http://cbs12.com/news/local/riviera-beach-police-investigate-shooting", "title": "Teenage girl shot in the head in Riviera Beach drive-by dies", "dct": "Fri, 23 Dec 2016 00:00:00 GMT", "id": "8c10a20bcac3a229b41c8a8bc7d117e6", "content": "The family of 15-year-old Makayla Dennard tells Riviera Beach Police the teen passed on Tuesday, after four days on life support at St. Mary's Medical Center.\nRIVIERA BEACH (CBS12) — A teenager shot in the head in her own front yard has died.\nThe family of 15-year-old Makayla Dennard tells Riviera Beach Police the teen passed on Tuesday, after four days on life support at St. Mary's Medical Center.\nDennard was shot on Friday, December 23rd in the driveway of her home on West 36th Street in Riviera Beach.\nShe was declared brain dead upon arrival at St. Mary's.\nA man, recently identified as 20-year-old Nikobra Stringer, was also shot and received non-life threatening injuries. Stringer has since been released from the hospital.\nSuspects in that shooting have been identified.\nPolice say the victims were shot in the yard of the home when a group of individuals opened fire from a stolen vehicle. The vehicle was later located after the suspects abandoned it nearby.\nThe vehicle had been reported stolen from Boca Raton, Florida on December 10th, according to police.\nPolice arrested one of the suspects after a search of the area. He was questioned Friday night, and later released.\nInvestigators are still searching for at least two additional suspects. They are working with the State's Attorney's Office to find those responsible.\nThis incident occurred at the same address where three people were shot on November 19, 2016. In that incident, a 25 year-old male, 14 year-old male, and 17 year-old female were shot. All survived the shooting, according to officials.\nSuspects in that shooting have been identified but not yet apprehended.\nAnyone with information related to this shooting is asked to call Riviera Beach Police on (561) 845-4123 or Crime Stoppers on (800) 458-TIPS.\nIf you would like to help the Dennard family, visit: https://www.gofundme.com/raise-money-for-kayla"}