{"uri": "http://www.rgj.com/story/news/crime/2014/11/09/community-reaches-reno-mother-children-shot-death/18778117/", "title": "Community reaches out to mom of 2 killed in Reno shooting", "dct": "Sun, 09 Nov 2014 00:00:00 GMT", "id": "55d93778e1b019683147adf0d2650a7d", "content": "As police continued investigating the shooting deaths of two children and a man in a northwest Reno home, the community reached out to the kids' mother with messages of love and support.\nFriends and community members created a Facebook page in support of the mother, Ashley Deane, an effort that within hours had attracted hundreds of supporters.\nDeane on Sunday identified the deceased as her children, Austin, 2, and Jacob, 7, and her husband, Rob Deane, whose LinkedIn profile lists him as a Reno-area car salesman.\nNo one else was inside the home besides the three, whose bodies were found in Stone Valley Drive residence on Saturday afternoon, police reported, saying they were not looking for any suspects.\nFacebook group reaches out\nBy early Sunday afternoon, \"Friends of Ashley Deane\" on Facebook had reached nearly 800 members.\n\"This is a group of people who are grieving the loss of two young boys and want to help support their mother Ashley Deane,\" Anicia Beckwith wrote on the group's Facebook page.\n\"Please join our efforts to support our friend Ashley,\" Beckwith said in a separate post. \"Her boys were taken from this world, and the community is wrapping our love around her during this unimaginable time of loss.\"\n\"Friends of Ashley Deane\" said a candlelight vigil to \"show our support and love for Ashley and her beautiful babies\" is planned for 6 p.m. Nov. 16 at Studio Inspire, 8521 White Fir St., Suite C-3 in Reno.\nAshley Deane is a Reno-area professional photographer.\n\"The photography community has come together to help her out and do what we can,\" Sally Casas, another Reno-area professional photographer, said via telephone on Sunday.\nCasas said she does not know Deane but has a mutual friends, including Beckwith, whom Casas credits with spearheading the friends group.\n\"It happened very, very quickly,\" Casas said of the show of support for Deane.\nOther efforts underway include an online fundraiser to cover costs for any needs the family may encounter, Casas said.\n\"In the meantime, please stay tuned to this page so that we can update you on the coordinated effort to bring the community together during this tragic time,\" Casas wrote in a message on the \"Friends of Ashley Deane\" Facebook page.\nReno police investigation\nCircumstances of the shooting were not clear Sunday. Reno police have said they did not expect to have more information until at least Monday.\nThe shooting, which police said involved a handgun, was reported about 4:30 p.m. Saturday in the 6300 block Stone Valley Drive near Mae Anne Avenue.\nNeighbors described hearing the screams of an unidentified woman outside the home.\nDeone Hemler said that the woman coming out of the house was holding a child and that paramedics arrived a short time later.\n\"She said, 'Help him, help him,'\" Hemler recalled Sunday when she looked across the street at Deane family's home.\n\"It's heartbreaking when you think of those kids,\" Hemler said.\nIF YOU GO\n• \"Friends of Ashley Deane\" candlelight vigil 6 p.m. Nov. 16 at Studio Inspire, a photo studio 8521 White Fir, Suite C-3 in Reno.\n• More information is available on the \"Friends of Ashley Deane\" Facebook page\nHOW TO HELP\n• To make a monetary donation, go to moveyourmountain.org/campaign/AshleyDeane#story\nThe group had raised $4,000 by Sunday afternoon but is seeking to raise $12,000.\nSource: organizers\nRGJ.com\nCheck RGJ.com for updates on this story"}