{"uri": "http://www.al.com/news/birmingham/index.ssf/2015/04/10-year-old_wounded_in_center.html", "title": "11-year-old boy shot in stomach with bullet intended for dog", "dct": "Thu, 02 Apr 2015 11:07:14 GMT", "id": "4461e1b80a7f5607ccb21b4b504418eb", "content": "Authorities are on the scene of a shooting in Center Point that seriously wounded a child.\nThe shooting happened just before 1 p.m. in the 1600 block of 1st Street N.W.\nJefferson County sheriff's deputies responded to reports of gunfire, and arrived on the scene to find a 11-year-old boy suffering from an apparent gun shot wound to the stomach, said sheriff's Sgt. Jack Self.\nThe boy has been taken to Children's Of Alabama. Relatives say he is undergoing surgery, and reported to be in stable condition. A second person, an adult, was also wounded. That victim was treated on the scene, said Center Point Fire Chief Donnie West.\nCenter Point Mayor Tom Henderson told AL.com that a man was walking down the street from his home to visit another home when a dog started chasing him. Someone fired shots at the dog, but instead hit the adult man in the buttocks and the child in the stomach.\nHenderson said the shooting was senseless. \"There shouldn't be any guns being shot in that incident,'' the mayor said.\nA family member identified the boy as Danel Hall Jr. She said the boy was inside when the bullet came into the home and struck him.\nMary Brooks, Danel's great aunt, said she rushed home from work when she got word of the shooting. \"When I got here, the baby was gone,'' she said. \"They just told me he was going to be alright.\"\n\"I can't even tell you what went through my mind,'' Brooks said. \"I prayed all the way that he'd be alright. And that's all that matters.\"\nBrooks said the details were still unclear. \"This don't make sense,'' she said. \"These children got to wake up. These guns are stupid, and I'm fed up. I thought it would never hit home this close, and it did.\"\nSelf said deputies are in the area trying to find the person who who fired the shots. The investigation is ongoing. Anyone with information is asked to contact the sheriff's office at 205-325-1450.\nAL.com photographer Tamika Moore contributed to this report.\nCorrection: This story originally reported the boy's age as 10. Read the latest on this story here."}