{"uri": "http://www.baltimoresun.com/news/maryland/crime/bs-md-ci-mason-double-murder-plea-20150203-story.html", "title": "Two life sentences for man accused in Pigtown double murder", "dct": "Tue, 03 Feb 2015 20:43:00 GMT", "id": "6273a6643c96f5ab91b88e578b9b3279", "content": "Rhonda Monroe holds up pictures of her son William and his girlfriend Meaghan Kerrigan, who were killed by Melville Mason in Pigtown in 2013. Rhonda Monroe was shot as well but survived. Mason pleaded guilty and received two life sentences. (Photo by Justin Fenton)\nA Baltimore man received two consecutive life sentences after pleading guilty to murdering a young couple in Pigtown, wounding two others and leaving an infant child among the carnage.\nMelville Mason, 37, pleaded guilty Monday for the shooting Aug. 20, 2013, that left William Monroe, 21, and Meghan Kerrigan, 22, dead. Police said at the time that Kerrigan's 1-year-old daughter was found sitting next to her mother, patting her body.\nThe motive for the killing was said to be a dispute over $10, and Mason reportedly said, \"I am the Reaper\" and \"This is your worst nightmare,\" after kicking in the door, witnesses said.\nMonroe's mother, Rhonda, attended the sentencing hearing with pictures of the couple's daughter, and wearing a T-shirt with Monroe's and Kerrigan's pictures. Rhonda Monroe was one of the two women wounded in the attack, and she said the bullet is still lodged in her arm.\n\"I still hear my son screaming, the gunshots,\" she said after the plea hearing. \"It's terrible.\"\nBrandon Kerrigan said his sister was an \"incredible mother\" who was hoping to go back to school to work with pets. \"I just can't understand how anyone could do that to her,\" he said of the shooting.\nThe couple's daughter has been adopted by Monroe's brother, who moved from Baltimore \"to get her away from all this,\" Brandon Kerrigan said.\nWitnesses told police that Mason, known as \"P.J.,\" broke into the home through a first-floor window propped open with a window fan and began firing a 9 mm handgun. Mason then allegedly left the home, obtained a new handgun, and returned through the same window and began firing again.\nKerrigan was on the phone with 911 operators when she was killed, prosecutors said.\n\"It took me three days to get over [the final moments of the tape],\" Assistant State's Attorney Beth Durand said in a news release from the state's attorney's office. \"Every time I closed my eyes the only thing I could hear was their screams.\"\nAt the plea hearing, Mason apologized to the family but claimed that Monroe had threatened him with a gun days earlier.\nThe shooting occurred during a violent weekend in Baltimore that saw 20 people shot over a span of 80 hours."}