{"uri": "http://www.baltimoresun.com/news/maryland/crime/bs-md-pigtown-shooting-20130820-story.html", "title": "Fatal Pigtown shooting brings city count to 20 in 80 hours", "dct": "Tue, 20 Aug 2013 22:14:00 GMT", "id": "dd3ae27a14899b7e32c27703e40c9082", "content": "An infant child was found next to her dying mother just before dawn Tuesday after police say a man broke into a Pigtown home, killed a young couple and shot two others — a grisly scene that brought to 20 the number of people shot in the city in a span of 80 hours.\nPolice said they had charged 35-year-old Melville Mason, who they said was caught trying to escape the home. The arrest came as officials sought to address concerns about spiking crime amid a violent summer and a recent outburst of street robberies throughout the city.\n\"The biggest fear is the threat of retaliation, and that's what we need to get in front of,\" Deputy Commissioner Dean Palmere said at an afternoon news conference at police headquarters.\nOfficials said they would pull officers from administrative roles to bolster patrol ranks, and announced arrests in other cases — including a fatal stabbing of a teen after the Ravens' Super Bowl victory parade.\nMurders and non-fatal shootings both remain higher than at this time last year by double-digit percentages, and the city is in danger of reversing six consecutive years of declines in non-fatal shootings.\nIn the Pigtown shooting, sources with knowledge of the case said police believe Mason may have been involved in a dispute with one of the victims days earlier, broke in and opened fire. He then left, retrieved another gun and returned, according to the sources.\nBaltimore City Council Vice President Edward Reisinger, who represents the Pigtown neighborhood where Tuesday's shooting occurred, said he's been told by police that many of the recent shootings stem from drug disputes.\n\"When you see a spike — especially if it's shootings and homicides — even if it's drug-related, the people who live in that neighborhood, the families, the kids, the grandmothers, they don't know what's going to happen,\" he said.\nWomen and children have been caught up in the violent spate. In addition to Tuesday's shooting of three women, a woman was shot in the leg Monday night in Perkins Homes housing project in Southeast Baltimore and a 7-year-old boy was among three people shot Saturday night in Johnston Square.\n\"We've had a rough couple of weeks,\" said Jerry Rodriguez, another deputy commissioner.\nHe said police would be out in force \"to reassure that we, as your Police Department, are doing everything we can to … guarantee your safety.\" The commanders said citizen tips have helped police close cases, but they would need more help.\n\"We want you to understand we can only do so much,\" he said. \"We're asking the community to please share in our frustration and share in our anger and provide us with information.\"\nMayor Stephanie Rawlings-Blake said in a statement that \"senseless acts of bloodshed are unacceptable and strengthens my resolves to make our neighborhoods safer.\"\n\"I have confidence that police are taking steps to get violent offenders off the street,\" she said.\nIn Pigtown, about 30 residents stood on sidewalks or porches Tuesday, watching police officers, homicide detectives and crime scene technicians go into and out of the two-story rowhouse in the 1200 block of S. Carey St.\n\"It's so peaceful around here, there's no crime,\" said neighbor Margit Clokey. \"This is a shocker. It's so close to home.\"\nAbout 5:47 a.m., officers arriving on the block said, they saw Mason crawling out of a rowhouse window.\nPolice, who said they recovered at least one weapon, took him into custody, entered the house and found Meghan Kerrigan, 22, and William Monroe, 21, fatally shot. Neighbors say Kerrigan and Monroe were the parents of the infant, who was unharmed inside. Police said they turned the child over to relatives.\nTwo women believed to be in their 40s were also found and taken to area hospitals. One was listed in critical condition Tuesday and one was in stable condition. Neighbors say one of them is Monroe's mother, who has lived in the rowhouse for more than two decades.\nNeighbors say the family worked in the scrap metal and recycling business, while Monroe also worked as a roofer. They were well liked and kept to themselves, caring for their child, Clokey said.\nMason, neighbors said, lived just a few houses away at the corner of South Carey and Carroll streets in a basement apartment. He has prior addresses in Sykesville, court records show.\nEvelyn Lawson, Mason's grandmother, said he is a churchgoing, married man and a good father to his 1-year-old daughter. She said she could not believe the allegations.\n\"This is all news to me about what happened,\" she said. \"His family all loves him. We all love him. This is a terrible tragedy.\"\nPolice have not released specifics of the charges, and Mason does not have a lawyer listed in online court records on these allegations. Online court records show multiple arrests and assault and drug convictions.\nSeveral residents knew Mason as \"P.J.,\" and said he often parked his four vehicles — two Trans Ams, a Subaru Outback and a blue pickup truck — on the street next to his house, taking up every nearby space.\nHenry Ott, 67, lived next door and said he often argued with Mason. The two had feuded because Ott kept watch of Mason's comings and goings.\n\"He tried to rule the neighborhood and tell the people how to live,\" Ott said.\nMelissa Borck, who grew up in the neighborhood, said Mason could be standoffish. His treasured cars were \"all he talked about,\" she said.\nShe said she was headed to the store at about 5 a.m. on Tuesday when she saw Mason sitting in one of his black sports cars across from his home. He motioned for her to come over, Brock said, but she refused.\n\"Happened right after that,\" she said. \"I'm shocked. Maybe I'll cry later when I see it [on the news]. I'm still shocked.\"\nAs detectives overheard neighbors talk openly about Mason, police cordoned off his home and knocked on the door. No one answered, and police soon summoned a red tow truck with flames on the hood to tow away one of Mason's cars parked on Carroll Street.\nIn addition to Mason's arrest, police said they had charged a 16-year-old, Nazir Williams, in a fatal stabbing that occurred downtown after the Super Bowl parade in February.\nBaltimore Sun reporter Kevin Rector contributed to this article."}