{"uri": "http://www.kfvs12.com/story/34014170/police-arrest-suspect-in-connection-to-shooting-death-of-scott-co-hs-senior", "title": "Funeral arrangements made for Scott Co. H.S. senior Cole Kirkpatrick", "dct": "Mon, 12 Dec 2016 21:16:00 GMT", "id": "ceaacd868f7991a5bdc088ba29c4b5c2", "content": "SCOTT COUNTY, MO (KFVS) -\nFuneral arrangement information for Cole Kirkpatrick was announced on Monday, December 12.\nThe Scott County School District confirmed funeral arrangements will be Tuesday, Dec. 13 at Scott County Central in the Ronnie Cookson Gymnasium. Visitation will be from 11 a.m. to 1 p.m. and the funeral service will start at 1 p.m., immediately after the visitation.\nAccording to Scott County Sheriff Rick Walter, a suspect was arrested on Friday in connection to the shooting that left a high school senior dead on Thursday night.\nCoroner Scott Amick said Cole Kirkpatrick, 19, died on Thursday around 6 p.m. from a shot to the head with a 20 gauge shotgun.\nSean Thomas, 18, was arrested and charged with armed criminal action and involuntary manslaughter.\nHis bond was set at $5,000 and Thomas bonded out of jail on Dec. 9.\nAccording to court documents, the sheriff's office received a 911 call around 4:56 p.m. on Thursday, Dec. 8 from a man who identified himself as Thomas.\nThomas allegedly told dispatch his friend, later identified as Cole Kirkpatrick, had been shot and he indicated he thought Kirkpatrick was dead.\nHe allegedly said they were playing around with a gun, which he thought was a BB gun, and that Kirkpatrick was shot in the head.\nDeputies arrived on the scene on Myers and found Kirkpatrick dead, lying in a bed, in the northeast bedroom.\nAccording to court documents, a single-shot .20 gauge shotgun was lying on the bed next to the body.\nOfficers said it was lying parallel to the body with a shirt lying over the chamber portion. A .20 gauge shell casing was inside the chamber.\nInvestigators talked to another man who said Thomas went to pick up Kirkpatrick at Kirkpatrick's home. The two were supposed to return to Thomas' home so they could all ride together to a Christmas program.\nAt around 5 p.m., the man told investigators he received a call from Thomas, whom he said was in a panic and begging him to come to Kirkpatrick's home to help him.\nThomas allegedly told the man he shot Kirkpatrick and he needed his help.\nHe also allegedly told him that he and Kirkpatrick were playing around and he accidentally shot him. He allegedly told the man he thought the gun was a BB gun.\nInvestigators also talked to a woman who told them Thomas went to pick up Kirkpatrick in her vehicle. Shortly after he left, she said the man got a call from him stating he accidentally shot Kirkpatrick with what he initially thought was a BB gun.\nThe woman told investigators she went to Kirkpatrick's house and found Thomas standing in the front yard.\nHe allegedly told her he accidentally shot Kirkpatrick when he pointed the gun at him.\nDuring an interview with investigators, Thomas said he was home on leave from the Army and had recently completed basic training.\nAccording to court documents, he said he went to Kirkpatrick's home to pick him up.\nWhen asked what happened at the home, investigators said he indicated he wished to speak to an attorney and did not want to answer any further questions.\nThe Major Case Squad is also investigating.\nAn autopsy was performed on Kirkpatrick on Friday morning, December 9 in Farmington, Mo.\nDownload the KFVS News app: iPhone | Android\nCopyright 2016 KFVS. All rights reserved."}