{"uri": "http://pittsburgh.cbslocal.com/2016/01/01/fatal-shooting-of-mt-oliver-boy-11-remains-unsolved-after-2-months/", "title": "Fatal Shooting Of Mt. Oliver Boy, 11, Remains Unsolved After 2 Months", "dct": "Fri, 01 Jan 2016 16:10:00 GMT", "id": "512d9f599b1c9bbffe8f2a4e746fa841", "content": "MOUNT OLIVER (KDKA) – The family of an 11-year-old boy who was shot and killed last year is hoping the New Year will bring them some answers.\nIt’s been two months since 11-year-old David McIntyre was shot and killed inside his home as he played a video game with his brother.\nHis mother, Amanda McKnight, spoke to reporters.\n“It’s not about the who right now, it’s why,” she said. “Why step into the doorway, stand there, not say a word and end up firing on innocent children?”\nOn the cold and windy first day of the New Year, Amanda McKnight begged for answers.\nA small group came to support her with a candlelight vigil in front of her home in Mount Oliver, the second vigil since the shooting.\nIt was Nov. 1, just before 9 p.m. Police say a white male in his 30s or 40s, about 6 feet tall, entered the house and began shooting the boys.\nDavid was killed. His 16-year-old brother, C.J. Mikula-Conrad, was critically injured but is now doing well.\n“Let’s start the New Year off on the right foot and bring this person to justice,” McKnight said. “That’s my New Year’s wish.”\nThere were comforting hugs and words of encouragement.\nAutumn Perkins is with the group Mothers With a Voice.\n“When I heard this story, it broke my heart,” she said. “No 11-year-old child deserves to be murdered like that, and he needs justice. Something has to be done. This killer has to be brought to justice.”\nThe reward for information leading to an arrest is now up to $2,000. The family says there will be a candlelight vigil in front of the house on the first day of every month until the killer is caught.\nAllegheny County Police say there is nothing new in this case."}