{"uri": "http://www.cbs46.com/story/32309778/5-shot-1-killed-in-shooting-at-atlanta-club", "title": "5 shot, 1 killed in shooting at Atlanta club", "dct": "Sun, 26 Jun 2016 17:06:00 GMT", "id": "2387da75444a0a7b4923c8f874508a35", "content": "ATLANTA (CBS46) -\nPolice say a total of five people were shot and one person killed at an Atlanta motorcycle club early Sunday.\nThe shooting occurred at Strikers Club, located in the 1500 block of Moreland Avenue SE.\nAnthony Sheppard Sr. says Strikers was packed Saturday night into Sunday morning with hundreds of people celebrating the motorcycle club's 38th anniversary. He says chaos erupted after a fight broke out and shots were fired at around 3am.\n\"Shots just rang out. We didn't know where the shots were coming from. It was just pow pow pow pow,\" Sheppard told CBS46.\n44-year-old Fernando Wingfield was shot and killed. Sheppard said Wingfield wasn't a member of the club but visited there often.\n\"He always came to the Strikers. You know, he came to see us and he just was a good brother,\" Sheppard said.\nAnother male victim had surgery Sunday morning after suffering from multiple gun shot wounds. Two females were also shot and listed in stable condition. Information on the fifth victim was not immediately available.\nLast July a man was killed after a shootout ensued in the parking lot next door to Strikers.\nPolice won't say if they believe Sunday morning's shooting had anything to do with gang activity but one person in the area says gangs are becoming a huge problem.\n\"There's gangs everywhere, especially in Atlanta, in this area that you're in right now,\" a passerby told CBS46.\nCheck back with CBS46, CBS46.com and our social channels for the latest developments.\nCopyright 2016 WGCL-TV (Meredith Corporation). All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}