{"uri": "http://wdtn.com/2016/01/18/man-arrested-in-swat-standoff-believed-to-be-linked-to-childs-murder/", "title": "Man arrested in SWAT standoff believed to be linked to child’s murder", "dct": "Mon, 18 Jan 2016 16:02:00 GMT", "id": "aa4360851f572e6f1a65635ea700fbb2", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nDAYTON, Ohio (WDTN) – Following a three-hour standoff in the early morning hours Monday, Dayton police now tell 2 NEWS that 25-year-old Shawn Smith is believed to be linked to the shooting death of 13-month-old Elijah Johnson last week.\nDayton Police confirmed the suspected connection between Smith and the shooting that occurred Thursday night on Queens Avenue.\nAccording to jail records, Shawn Smith, 25, is being charged with murder. Police say a woman was also in the home during the standoff. Jade Taylor, 22, is being charged on interfering with law enforcement.\nPolice originally were dispatched to the home to make an arrest on Smith–a homicide suspect; however, Smith and Taylor would not leave the house when asked.\nSWAT and hostage negotiators were in a standoff with the suspects for more than three hours.\nDayton Police tell 2 NEWS an armored vehicle had to bust through a front door of the home, in order for Smith and Taylor to turn themselves in.\nNo shots were fired, and police were able to make the arrests without incident.\nSmith is due in court on Tuesday at 1:45 p.m.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}