{"uri": "http://www.macon.com/2014/09/08/3294242/grants-lounge-changes-policies.html", "title": "Grant’s Lounge changes policies after weekend shooting left five wounded", "dct": "Mon, 08 Sep 2014 17:16:00 GMT", "id": "f263be7a74de64feb04f29bf21d2361e", "content": "After a Macon man fired shots into a crowd and wounded five people on Poplar Street Saturday morning, the owner of nearby Grant’s Lounge is changing its policies.\nEdward Grant Jr., who co-owns the bar with his sister Cheryl Louder, said Grant’s Lounge has only had three incidents since it opened in February 1971: a fight in 1983 inside the club, a gun fired outside in April and Saturday’s shooting.\nGrant said if there had been a law enforcement presence on Poplar Street in April and early Saturday, the incidents never would have happened.\n“Usually there’s five to seven police cars on Cherry Street during First Friday, and on Saturdays, but no police presence on Poplar Street,” Grant said. “So we had to pay the officers (since April’s incident).”\nGrant said he understands the Bibb County Sheriff’s Office is facing challenges due to downtown’s growth.\n“We’re having growing pains,” Grant said. “Three (or) four years ago there wasn’t this many people downtown, there wasn’t this much activity downtown. And maybe (the sheriff’s office) has maybe had a problem ... keeping up with that.”\nJosh Rogers, chief executive officer of NewTown Macon, said that despite Saturday’s shooting, downtown remains one of the safest precincts month to month.\n“I don’t think this is entirely a policing issue,” Rogers said. “I think all of us have some responsibility here to adapt and change and make sure that we’re providing the safest environment possible. ...I think the business community needs to respond with a unanimous voice that we’ve got really high expectations for business owners operating safe businesses. And that means adhering to local laws but also shutting down at the hours that bars are supposed to close at 2 a.m., and making sure people get home safely and not serving people beyond the time that they’re intoxicated.”\nGrant announced Monday that the lounge is changing its policies. It will no longer allow anyone under the age of 21 to enter the business. In a news release, Grant said he plans to meet with the sheriff’s office this week in hopes of increasing a law enforcement presence on Poplar Street. Starting this week, Grant said, the lounge will open at 2 p.m. instead of 7 p.m. and close at 2 a.m. instead of 2:30 a.m.\nRogers said Saturday morning’s shooting was a setback to downtown’s image.\n“I think we’ve got to express on the front end that we want business owners to operate to the highest standards now and always (so) people are going to be safe when they come downtown,” he said.\nThe nightlife crowd has doubled or even tripled over the past year, Rogers said, and people are no longer coming downtown to hear just one band or visit one single venue. Instead, they’re coming to visit several venues.\n“I think this is a growing pain and a challenge (for downtown Macon),” Rogers said of the weekend shooting. “We’ve all got to band together -- the business community, our local legislators and the sheriff’s department -- so that we’re responding properly.”\nMel Howard, who operates Grant’s Lounge and who was there early Saturday, said two men who left Grant’s started fighting in the middle of Poplar Street. About 15 people surrounded the tussle. Though there were seven security officers working at Grant’s at the time, Howard said none of them could intervene.\n“My security officers aren’t really allowed to go in the street to try to break up anything, so we made the (911) phone calls,” Howard said. “The next thing we knew there was gunshots.”\nAccording to a sheriff’s office incident report, a large fight broke out and several shots were fired during the brawl. Jamel Ramon Nolton, 37, of Macon, was arrested near Poplar and Third streets.\nThe report said one of the wounded victims was lying on the ground when he looked up and told an officer, “That’s the guy who shot me,” as Nolton was being apprehended.\nA sheriff’s office news release said five people were wounded in the shooting. Nolton was charged with five counts of aggravated assault, one count of violation of probation, possession of a firearm by a convicted felon and giving a false name to a law enforcement officer. He was denied bond on all charges at a hearing Monday and is being held in the Bibb County jail.\nTo contact writer Laura Corley, call 744-4382."}