{"uri": "http://wkrn.com/2016/05/25/east-nashville-teenager-dies-in-accidental-shooting/", "title": "East Nashville teenager dies in accidental shooting", "dct": "Wed, 25 May 2016 20:04:00 GMT", "id": "fb49f483294e94caeec51513545d3604", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nNASHVILLE, Tenn. (WKRN) – Metro police are investigating the accidental shooting death of an 18-year-old.\nDeAndre Kpana-Quamoh had just graduated from East Literature Magnet High School two weeks ago and was ready to compete in the state track championships this weekend.\nHe also a had a full academic scholarship to Alabama State University.\n“He was a special young man,” said DeAndre’s dad, Sam Kpana-Quamoh. “I love that young man; he’s gone too soon.”\nIt wasn’t just DeAndre’s parents that had great things to say about him. In addition to being captain of the track tream and maintaining good grades in school, DeAndre also worked weekends at Inglewood Kroger on Gallatin Pike.\n“He was very smart and very talented,” said DeAndre’s boss at Kroger, Clarissa Whitfield. “He could sing, he could run. He was amazing.”\nThat’s why Whitfield said she was surprised when she heard after his shift Sunday night, he went to a friend’s house where there was a gun.\nThe teens thought it was unloaded, but it went off. DeAndre was shot and died that night.\nAccording to the Safe Tennessee Project, DeAndre is the eighth person to be accidentally shot and killed in Tennessee so far this year.\nWhat’s more, accidental shootings in 2016 are way up from last year. Their data shows at this time last year, 9 adults were unintentionally shot and there were no injuries.\nSo far this year, 21 adults have been accidentally shot. DeAndre is the fifth adult to have died.\nDeAndre’s parents hope other young people learn from their son’s story.\n“What’s keeping me going is hearing other people describe him,” said DeAndre’s mom, Terrice Ramey. “He lit up a room when he went in, the energy and spirit he exuded to other people. This was the child that I had; that was loved by so many.”\n“Our young people are being taken away way too soon by accident or intentional,” said father Kpana-Quamoh. “I always taught my son and I encourage young people to do that same: stand up for what’s right.”\nDeAndre was often at the Margaret Maddox Family YMCA in East Nashville. They have a teen center that provides a safe place for teens to go after school.\n“I have nothing but nice things to say about my interactions with him,” said the former Teen Center director Moses Olomo. “The Teen Center is great for kids around DeAndre’s age because it’s good to give teens opportunities and options to do different things and it keeps them out of trouble.”\nInstructors there are helping spread the word about a GoFundMe page for DeAndre. Click here to donate.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}