{"uri": "http://wavy.com/2016/01/27/six-dead-in-chesapeake-murder-suicide/", "title": "Investigators working to determine timeline, motive of Chesapeake murder-suicide", "dct": "Wed, 27 Jan 2016 20:26:00 GMT", "id": "1c750c87b7e421b6ab9447f18e1c5fad", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCHESAPEAKE, Va. (WAVY) — Forensics investigators were back at the scene Friday collecting more evidence from a Chesapeake home where a family was killed.\nSix members of the same family were found dead early Thursday morning following an apparent murder-suicide in the Deep Creek section of Chesapeake.\nThe suspect has been identified as 26-year-old Cameron Dooley.\nHe is accused of killing his 17-year-old sister Brooke, his 22-year-old brother Landon, his mother Lori, his father Steven “Todd” and his grandmother Doris Dooley.\nAll of the victims were shot, according to police.\nInvestigators are now working to put together the timeline of the incident as well as a possible motive for the shooting.\nOn Thursday, police released a preliminary timeline of the events leading up to the discovery that the family members had been killed.\nAccording to Kelly O’Sullivan with Chesapeake Police, officers were called to the 2300 block of Wildwood Road around 3:35 p.m. Wednesday to check on the welfare of a person.\nThat is when they found Landon Dooley dead inside the home.\nPhotos: Six dead in Chesapeake murder-suicide\nFurther investigation by police at Wildwood Road led them to another home at the intersection of North George Washington Highway and Wintergreen Drive — a few blocks from the first scene.\nOnce there, officers found an armed person who would not come out of the home, now identified as Cameron Dooley.\nPolice blocked off the neighborhood and tried to negotiate with the person to get him to come out of the house.\nAfter several hours, officers entered the home in the early morning hours of Thursday, and found five people dead — including Cameron, who shot himself.\nAccording to O’Sullivan, investigators believe Cameron killed his family members before officers got to the home Wednesday evening.\n“We lived across the street from them about eight years ago or seven years, and I knew them and I went to school with them, and it was like I didn’t believe it,” said Brittni Phillips who attended Deep Creek High School with Cameron Dooley.\nPhillips added, “They were a church family. It’s something that you don’t expect coming from a family like that. They were a very close-knit family and had a lot of ties to the community.\nA WAVY Viewer sent 10 On Your Side an 18-minute video from the night of the incident:\nPlease install the latest Adobe Flash Player Plugin to watch this content.\n“I heard the loud speakers from the SWAT team. I heard some shots,” said Kimberly Karika, who lives nearby. “I live on Canal and so I heard most of what went on, so I was up a lot of the night and heard everything that was going on…I just couldn’t believe it; I was in complete shock.”\nInvestigators say they believe this all stemmed from a domestic incident.\nMedical examiners arrived on the scene at Wintergreen Drive around 6:45 a.m. to remove the victims’ bodies from the home.\nAt one point, a local chaplain went out to the scene to talk to police officers.\nThe deadly shooting has left residents of the Deep Creek community shocked.\nBen Pilkington was friends with the youngest victim, 17-year-old Brooke Dooley, who was a cheerleader at Deep Creek High School. He said, “She was a great person and never hurt anybody.”\nTodd Dooley was a former Chesapeake Marine Police Officer. “I describe him as an all round great guy,” said Lindsey Hillier-Hotchkiss. “He was a church going, good family man and loved his work as a police officer.”\nTodd retired from the department and started working at the Lynnhaven Dive Center in Virginia Beach in October. He didn’t show up for work on Tuesday. It is unknown why.\nFamily friends said the grandmother, Doris Dooley, was very involved in her church Temple Baptist right down the street from her home. Her late husband was once pastor of the church.\nA neighbor across the street talked to 10 On Your Side’s Rico Bush, and gave his reaction to the traumatic events.\n“It’s crazy, it’s too much. I’m right beside it,” Demetrius Peacock said. “My family and I don’t feel safe.”\nA man who lives near the house on Wintergreen said, “It hits Deep Creek hard. But, knowing Deep Creek, we’re going to be able get through this. We just have to be able to get away from the sad parts, and look at the memories of Brooke her family — and remember the good things about them.”\nA GoFundMe account has been set up to help the family pay for funeral expenses, according to family members.\n10 On Your Side’s Andy Fox is in Chesapeake working to get more information. Look for more coverage on WAVY News 10 starting at 4 p.m.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}