{"uri": "http://www.nbc-2.com/story/30995652/fmpd-5-year-old-shot-in-fort-myers-shooter-on-the-loose#.Vp233_Hahpk", "title": "Police: 'Strong possibility' shootings were connected", "dct": "Tue, 19 Jan 2016 03:41:00 GMT", "id": "597bd977888f1d0c0886c342f4f68dfc", "content": "There's a \"strong possibility\" the shooting that injured a 6-year-old boy in Fort Myers Monday night was connected to a 2015 shooting incident in which the boy's 5-year-old cousin was wounded.\nThat according to interim Fort Myers Police Chief Dennis Eads, who said that both the 6-year-old victim from Monday -- identified by family members as Malcolm Wilcox -- and the boy's mother, Jatravia Isom, were also in a car that was shot up last September.\n- Using our app? WATCH VIDEO HERE\n\"I think it's a small group, or niche, of individuals that have a small beef and are going back and forth,\" Eads said. \"It's obviously not rampant all over the city of Fort Myers. It just happened to be where it was. But I think it's isolated to individuals, not location.\"\nFamily members said Wilcox was hit in the upper thigh Monday and is expected to be in the hospital for the next few days as he recovers. From there, he'll have to re-learn how to walk.\nThe incident happened at the Landings at East Pointe apartment complex on Nelson Tillis Boulevard, near the corner of Dr. Martin Luther King Jr. and Veronica S. Shoemaker boulevards.\nPolice said they were patrolling the area when they heard gunshots at 10:10 p.m. Officers found the boy suffering from a gunshot wound and one fashioned a tourniquet around his thigh to stem the bleeding.\nThey said he was alert and conscious during transport to Lee Memorial Hospital. Police said two suspects pulled into the apartment complex in an SUV and began shooting.\nEads said both people inside of the suspect SUV were firing, and he believes a male associate of Wilcox's mother may have been the target. He also said there may be surveillance video from the apartment complex that could assist detectives.\nAnyone with information is asked to call the Fort Myers Police Department at (239) 321-7700, or Crime Stoppers at 1-800-780-TIPS or text message C-R-I-M-E-S (274637) Keyword FMPD. Tipsters can remain anonymous."}