{"uri": "http://nbc4i.com/2015/08/12/second-suspect-in-hudson-street-quadruple-murder-arrested/", "title": "Neighbors relieved after Hudson Street quadruple murder suspect arrested", "dct": "Wed, 12 Aug 2015 11:18:00 GMT", "id": "01da5fcb5af5ccec1fbbccaefc8f1c6c", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCOLUMBUS, Ohio (WCMH)- Robert Lee Adams Jr., the second suspect in the Hudson Street quadruple murder that happened in June, has been arrested in Mississippi.\nHe was on the run for nearly 9 weeks after a fatal shooting that claimed the lives of four people in Columbus.\nJoyce Hasan, who lives nearby, said Wednesday was “a very good day for us.”\n“We didn’t think he would be caught,” she said. “It’s been heartbreaking. It’s something that you hear and you hope it’s not real.”\nTricia Banks said the shock of finding out about the murders has not dissipated.\n“It’s still shocking. It’s still like you’re in a trance that will never go away.”\nPolice had been looking for Adams, 27, after arresting 16-year-old Jordyn D. Wade, who is also been charged in the murder. Police said Adams is the alleged gunman.\n“Obviously, this person needs to be taken off the street,” Columbus Police sergeant Rich Weiner shared Wednesday afternoon.\n“The investigators have been working around the clock, trying to find out the whereabouts of where this guy was,” Weiner said.\nThey also re-interviewed witnesses and spoke to other suspects, working every possible lead and tips that were called into Crime Stoppers.\nColumbus Police say they were told that Adams was hiding out in Mississippi and they shared that tip with the U.S. Marshals.\nWednesday morning Marshals checked two addresses in rural Oktibbeha County and found Adams hiding in a closet.\nAccording to Oktibbeha County deputies, Adams was with a relative at the time he was arrested. Columbus detectives will travel to Mississippi to interview Adams before he will be extradited back to Ohio.\nAccording to police, Adams robbed and shot five people at the residence in the 1600 block of E. Hudson Street June 13. Four of the five people shot, died as a result of their injuries.\nPolice have identified the victims as Angela D. Harrison, 35; Tyajah Nelson, 18; Daniel Sharp, 36; and Michael Ballour, 41.\nAccording to court documents Wade wasn’t the shooter in the deaths of the four victims, but he did allegedly hold the victims at gunpoint and allowed another person to kill them.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}