{"uri": "http://www.dispatch.com/content/stories/local/2015/06/13/0613-linden-shooting.html", "title": "'Ugly scene': 2 men, 2 women shot to death in South Linden house", "dct": "Thu, 19 May 2016 00:00:00 GMT", "id": "bd7c0f550f7f66e114993012ad6dfd43", "content": "As many as 100 people paced outside a South Linden house in the heat for hours on Saturday waiting to learn whether a relative or friend was among four people slain inside. Police said they would not release the names of the two men and two women, possibly until today, or whether a well-known occupant of the house at 1623 E. Hudson St. was among the four shot dead.\nAs many as 100 people paced outside a South Linden house in the heat for hours on Saturday waiting to learn whether a relative or friend was among four people slain inside.\nPolice said they would not release the names of the two men and two women, possibly until today, or whether a well-known occupant of the house on E. Hudson St. was among the four shot dead.\n\"It's a tragedy. My dad and sister got killed in the basement, and my other sister is in the hospital,\" a man who identified himself as Adrian Beard said before storming off.\n>>UPDATE: 16-year-old arrested in quadruple homicide, second suspect sought\nThomas Pringle, 52, said he was leaving his E. Hudson Street house about 5:30 a.m. to get ice for a cookout when he saw a man and woman run out of the house across the street. After he returned home, he saw a different woman sitting on the sidewalk across the street being helped by a passer-by.\n\"I heard her holler. She said, 'They are dead, they are dead! Oh, my God, they are dead! I'm shot!'??\"\nPringle said the woman got up and walked down the street. That's when he heard sirens and saw the police cruisers pulling up.\nPolice said they had received a report at 7:26 a.m. about a woman with blood on her. She eventually was found in an alley near the house and told officers that people had been shot in the house.\nShow more...\n\"It's littered with four bodies, and it's a pretty ugly scene inside,\" Sgt. David Sicilian of the Columbus homicide squad said. The house is just east of Cleveland Avenue.\nA police dispatcher said two bodies were found in the basement of the house, but detectives at the scene would say only that the bodies were found in different locations.\nThe injured woman was treated at OhioHealth Grant Medical Center and released, according to a statement from police.\nPolice did not identify a motive or suspect in the slayings.\n\"We obviously have a homicidal suspect out here who's not afraid to kill somebody,\" Sicilian said. \"We need to quickly find out who that is or the persons responsible for this.\"\nLate in the afternoon, police detective Robert Connor announced that the identities of the victims would not be released and that police planned no more news briefings on Saturday.\nAuthorities removed the bodies from the house for transport to the Franklin County coroner's office to confirm their identities and have autopsies performed, Connor said.\nThe crowd of onlookers swelled throughout the day as temperatures reached 90 degrees. Some sought refuge from the sun in the bays of an abandoned carwash or in air-conditioned vehicles. Several children ran around a fenced-in yard throwing cups of water and ice cubes to stay cool.\n\"It looks like a reunion,\" said one woman, who wouldn't give her name. \"I'm just glad it's peaceful.\"\nA woman collapsed and cried uncontrollably as police interviewed a group of people in front of the house. About 1 p.m., another hysterical woman was led from the crime scene by police after she emerged from the house sobbing.\nOne woman said she was searching for news about one of her son-in-law's close friends. \"I pray to God he wasn't in that home,\" she said. \"It's just so sad. I hate that I keep meeting people I know at scenes like this, or at funeral homes.\"\nMany people said they were drawn to the scene because their loved ones frequently dropped by the house and they couldn't reach them by phone on Saturday.\nLavelle W. Smith, 34, said his cousin, Michael Ballour, 41, lived at the house with other people and that Ballour's mother owns the property. He said the house is a spot where relatives gather for dinners, recreation and other activities.\n\"It's a million-dollar tragedy,\" Smith said.\nPolice obtained a warrant to search the house, and officers canvassed the neighborhood for any witnesses.\nThe house has been owned by a Myra Green since 1979, according to Franklin County records. Family members gathered at Green's home elsewhere on Hudson Street. They said they didn't want to talk and would not verify whether Green is Ballour's mother.\nFranklin County court records show that Michael Ballour lived in the house in 1992, when he was 18 and was convicted of aggravated drug trafficking. He was sentenced to a year in prison.\nThe following year, he was convicted of corrupting a minor and sentenced to two years in prison.\nIn 2011, Ballour was ordered to serve 10 months in prison after being convicted of nonsupport of dependents in Delaware County.\nHe was arrested by Columbus police at the E. Hudson Street home on Jan. 21 and charged with felony drug possession or abuse.\nA neighbor who didn't give her name, thinking Ballour might be among the dead, said he was kindhearted, loved his children and had a great sense of humor.\n\"He often gave my children $1 bills or bought them drinks or ice cream when getting this for his own kids,\" she said.\nHe also mowed many of the lawns in the neighborhood, she said.\nPolice are asking anyone with information about the slayings to call homicide detectives at 614-645-4730 or Crime Stoppers at 614-645-TIPS.\nThe deaths were the 39th to 42nd homicides in the city this year.\nepyle@dispatch.com\n@EncarnitaPyle\n@RandyLudlow"}