{"uri": "http://www.dispatch.com/content/stories/local/2015/06/15/waived-appearance-juvenile-court.html", "title": "Trump orders strict new refugee screening, citing terrorists", "dct": "NODATE", "id": "d4258a436c6b45cc7c6cf100238b0c53", "content": "WASHINGTON (AP) - Setting a hard-line tone on national security, President Donald Trump on Friday suspended the nation's refugee program for four months, aiming to keep \"radical Islamic terrorists\" out of the United States. Trump traveled to the Pentagon, where he joined Defense Secretary Jim Mattis for the signing of an executive action to bring sweeping changes to the nation's refugee policies and put in motion his plans to build up the nation's military. \"We want to ensure that we are not admitting into our country the very threats our soldiers are fighting overseas,\" he said...\nRead more\nWhen Eric Gnezda and Jack FitzGerald originally shared with TV station managers their vision of a musical segment based in Columbus but aired nationally, they were met with shrugs of indifference. Two years later, their pet project is being welcomed with wide-open arms. \"Songs at the Center,\" a half-hour program on PBS, features both local and national singer-songwriters playing short sets in front of a live audience at the McConnell Arts Center in Worthington. In its short history - the final season-three taping is scheduled for tonight - the show has expanded its exposure from a single station (local affiliate WOSU-TV) to 147 stations nationwide...\nRead more\nReview: CATCO's 'Baskerville: A Sherlock Holmes Mystery' opens to large laughs\nCATCO is off to a rollicking start in 2017 with a comedy-mystery that pays deft tribute to legendary characters. \"Baskerville: A Sherlock Holmes Mystery,\" which opened to a large audience and large laughs Friday night in the Riffe Center's Studio One Theatre, delivers sure-fire entertainment with breezy wit and split-second slapstick. Director David Hemsley Caldwell weaves the deliciously devious, transparently stagy and archly melodramatic aspects of the script into a mock-Victorian mystery-farce worthy of modern audiences...\nRead more\nUnited Way's change of focus has some nonprofits scrambling\nSome nonprofit organizations that had relied on the United Way of Central Ohio to fund programs are scrambling to figure out how to save them. For years, the United Way has been moving toward a new funding model that focuses on eradicating poverty in Franklin County. This year represented the biggest change yet, though, and organizations that relied on United Way grants for years now must continue without them. So far that has meant closing community centers, ending education programs and looking for other funding sources, including taxpayer money...\nRead more\nWhen they kicked off their stroke survivors group in Taiwan, Dan Kuhn sat in a wheelchair as his wife, Bridget, pushed him along. He then put on a golf hat, stood up and hit a long putt down the aisle. \"I said, 'I am a stroke survivor and I do things.'\" The Kuhns, of Worthington Hills, started the group about five years ago, modeled after OhioHealth groups they had attended after Dan suffered a stroke in 2003 that immobilized the right side of his body. In Taiwan, the couple said, stroke survivors mostly stay home, with families hiding them from view...\nRead more\nPeople waste less food if told of harm to environment\nA piece of advice for green-minded restaurants and food service businesses - hide that compost bin. That's because when diners know their scraps will be composted, they end up wasting more food, according to new research from Ohio State University. \"Do it, but just don't brag about it,\" said Danyi Qi, an agricultural economics researcher at OSU who co-led the study, which is under peer review. On the flip side, consumers will minimize their leftovers after learning about shrinking landfill space and greenhouse-gas emissions related to food waste, the study also found...\nRead more\nAuthorities arrested a member of the Rhoden family in Pike County Thursday on a charge of felony drug trafficking, but the county sheriff said the arrest is not connected to the killings of eight members of that family in April. Josh Rhoden, 38, is charged with felony drug trafficking. Police also arrested his neighbor, 63-year-old John McJunkin, and charged him with felony drug possession. Search warrants were executed late Thursday at their homes on the 3000 block of Grassy Fork Road in western Pike County...\nRead more\nRegular readers know that candidate Donald Trump had difficulty with facts. Now that Trump is president, he continues to make misleading statements, based on incomplete information, inaccurate statistics or flights of fancy. Here's an accounting of his public statements in the first seven days as president, not counting his error-plagued inauguration speech (which had eight problematic claims). - \"I remember hearing [when I was young] from one of my instructors, 'The United States has never lost a war...\nRead more"}