{"uri": "http://bnonews.com/news/index.php/news/id4223", "title": "4 federal officers shot at Country Club motel in Topeka, Kansas", "dct": "Sun, 24 Apr 2016 04:15:00 GMT", "id": "23d465d3443bdeaebf6f0ea7e4d1b720", "content": "Four federal law enforcement officers have been shot in Kansas while attempting to locate a suspect at the Country Club motel on SW Topeka Boulevard in Topeka, police say. The status of the gunman is unknown. (more)\nThe incident began at about 9:56 p.m. CT on Saturday when agents with the Fugitive Task Force of the U.S. Marshal Service attempted to contact a suspect who was believed to be located at the Country Club motel.\n\"Unknown person(s) and the Task Force exchanged gunfire outside the motel and a fire occurred during these events,\" said Lt. Colleen Stuart of the Topeka Police Department. Local journalists who responded to the scene reported hearing dozens of gunshots.\nAs the exchange of gunfire continued, a fire broke out at the motel that caused heavy smoke in the area before the fire intensified at around midnight, destroying large parts of the building before the blaze was brought under control.\nTopeka Police confirmed that a total of four federal law enforcement officers were shot and injured, including 2 U.S. Marshals and an agent with the Federal Bureau of Investigation (FBI). They all suffered non-life-threatening injuries and were taken to area hospitals.\nIt remained unclear on early Sunday whether the suspect had managed to escape or whether he was killed in the fire. Police did not immediately identify the suspect, though federal agents in the area have been searching for a suspect who is wanted in multiple armed robberies.\nThis is a breaking news alert. Please check back or follow @BNONews on Twitter as details become available. If you want to receive breaking news alerts by email, click here to sign up. You can also like BNO News on Facebook by clicking here.\nTopeka Blvd is filled with suffocating smoke after a fire at an area motel #Iam580wibw pic.twitter.com/sbsdNJOfgB\n— WIBW News (@WIBWNews) April 24, 2016\nThe fire continues to burn at 37th and Topeka #wibw @wibw pic.twitter.com/WPeT0mPBWw\n— Jonathan Deutsch (@wibwJonathan) April 24, 2016"}