{"uri": "http://www.wsoctv.com/news/news/local/police-11-year-old-dead-after-shooting-herself-mot/nhP4B/", "title": "Police: 11-year-old dead after shooting herself with mom's gun", "dct": "Thu, 18 Sep 2014 12:00:00 GMT", "id": "6a2bdbd4dc138e677ffe51790e96b444", "content": "GASTON COUNTY, N.C. - Police are investigating a shooting out of Gaston County that took the life of an 11-year-old girl.\nInvestigators said she shot and killed herself Wednesday afternoon with her mother’s gun.\nThe girl went to Holbrook Middle School.\nPolice said determining why this happened is tough.\nThey know the sixth-grader got on the bus at the school Wednesday afternoon and went home.\nInvestigators told Channel 9 they may never know whether it was an accident or intentional.\n“I think it’s terrible. It really is,” said student Cameron Cash.\n“We’ll have some more talks about guns. We have to,” said parent Cynthia Holland.\nA team of counselors spent the day at school talking to students look for direction.\nSome students also talked to police.\nThey wanted to know if the girl was bullied or had problems that may have led to the shooting.\nSo far, they have not learned anything to give a clue as to what happened at the family's home where the girl lived with her mother.\nNeighbor Summer Lee saw the girl get off the school bus in front of this house Wednesday.\n\"I wish I would have known so I could walk up there and talk to her and at least been able to stop it,” Lee said.\nShe said the girl ran inside.\nPolice said the child called her mother to let her know she was home safe.\nMinutes later she died from a single shot.\nLee said about 4:10 p.m. she heard what she now believes was the gunshot.\n\"It sounded like a piece of wood getting smacked against a house,\" Lee said.\nPolice said the girl’s mother had a gun. They are not sure if it was secured, but it was not in a place easy to find.\nThe girl knew it was in the house, police said.\n\"Why was it not in a safe place and why was it in her hands?\" asked student Carlos Brooks.\nThe girl’s mother came home from work and found her daughter already dead.\nHer neighbors said the mother was visibly shaken. The mother and daughter lived in the house alone.\n“Mother and daughter seemed like they were so close. I mean, I couldn't image losing my child like that,” said neighbor Debra Swayney.\nPolice are trying to determine if the girl had access to the gun.\nHer mother can be charged if it wasn't secured, police said."}