{"uri": "http://www.khou.com/story/news/crime/2014/08/12/8-year-old-shot-scared-to-leave-house/13982227/", "title": "8-year-old girl shot in thigh scared to leave the house", "dct": "Tue, 12 Aug 2014 00:00:00 GMT", "id": "bf098342fac34ea74624bba21e44415c", "content": "HOUSTON -- For the first time, we are seeing and hearing from the 8-year-old girl who was shot during the crossfire last week.\nIt happened in the parking lot of an HEB on Beechnut near the Sam Houston Tollway.\nThe girl and her mother didn't want to show their faces because of what they went through. The mother and her two young children were at the Ace Cash Express disputing money they lost.\nThe kids got hungry and wanted something to eat. They walked out, and that's when they got caught in the crossfire. The little girl will be confined to a wheelchair until she is ready to walk.\n\"The shot came in from here and went out through here,\" said the mother. \"We were walking to buy some stuff. I see some guys arguing for drugs or something like that.\"\nThe mother told her children to turn around and mind their business.\n\"When she turn around she kept walking, and she got shot in her leg,\" said the mother.\nThe shooting happened after a suspected drug deal with three other men in a green Buick. The Buick collided with another car and they tried to make a run for it towards the McDonald's parking lot. Two undercover officers with a drug task force called HIDTA happened to drive by.\nThey saw one suspect with large bags on them. Officers said they identified themselves and saw one suspect with a gun. Officers fired their gun through the glass. The girl and her brother were shot, hitting the girl in the thigh.\n\"I was like, oh I lost my baby,\" said the mother. \"She is the only girl that I have. She say mom I can't walk. She just scream.\"\nNow the little girl doesn't even want to leave the house. She is keeping herself occupied by playing video games. The mother is just thankful her kids are alive.\n\"Any second you don't know what's going to happen today,\" said the mother. \"Hold their hands and forget everything.\"\nPolice arrested two men. Others are still on the run."}