{"uri": "http://www.wsmv.com/story/31820573/investigation-continues-into-nashville-bus-station-shooting", "title": "Investigation continues into Nashville bus station shooting", "dct": "Tue, 26 Apr 2016 18:03:00 GMT", "id": "5f145259abfc59696e043c86bb113fae", "content": "NASHVILLE, TN (WSMV) -\nInvestigators are still seeking answers about what led up to the shooting that injured four people at Music City Central on Monday afternoon.\nMetro Police spokesman Don Aaron said 18-year-old Javious Chatman, the only victim with serious injuries, is now in stable condition and is expected to survive.\nThe other three victims have already been released from the hospital with minor injuries.\nTuesday night, Metro police identified the alleged gunman as 16-year-old Demarcus Amos. He is wanted on one count of attempted murder and three counts of aggravated assault.\nThe two 17-year-olds who were taken in for questioning on Monday have been released. They have not been charged.\nAaron said police believe Chatman was targeted specifically by the gunman.\nChannel 4 spoke with some riders about their safety concerns. Most said they were surprised to hear about the shooting, but it won't keep them from riding the bus.\n“It was scary, but I’m not going to stop riding the bus,” said Raquel Pinkiwsky, a Nashville School of the Arts student.\nAn increased police presence will continue through Tuesday afternoon. More than 4,000 students pass through the bus stop every day.\n“The police department’s flex units will be there, in addition to those that were already there through MTA,” Aaron said.\nOfficials with the Metro Transit Authority said this is the most severe security incident they have ever experienced. At a press conference on Tuesday, they wanted to reassure the public, especially Metro Schools students, that their facilities and buses are safe.\n“We expect to do full debriefing with police and our own staff to look for ways that we can make this an even better and more secure facility and transit system,” said MTA CEO Steve Bland. “But above all, I want to reassure the traveling public that this is a very safe place. It is one of the most patrolled and observed locations in downtown Nashville with 44 video surveillance cameras on site.”\nPolice said strong images from the surveillance video inside the bus station helped them identify the shooting suspect.\nCopyright 2016 WSMV (Meredith Corporation). All rights reserved."}