{"uri": "http://www.wsmv.com/story/31833673/search-continues-for-suspect-in-bus-station-shooting", "title": "Search continues for suspect in bus station shooting", "dct": "Wed, 27 Apr 2016 21:43:00 GMT", "id": "6f8261c91b27e2b7756524ef3b693ee6", "content": "NASHVILLE, TN (WSMV) -\nAs police continue to search for the suspect in the shooting at a downtown Nashville bus station, community leaders vowed to curb violence.\nPolice believe the gunman who opened fire at the Music City Central bus station on Monday, injuring four people, is 16-year-old Demarcus Amos.\nPolice said Amos did not show up at his school, Johnson Alternative, on Tuesday.\nJerock Walker was at the bus station when the shooting happened. He said the bullets missed him by inches.\n“Kids were actually jumping off the sides of them buildings over there,” Walker said. “People were actually ducking, sliding down the elevator ourselves.”\nThe shooting sent shock waves across the city.\nAt a meeting of the Interdenominational Minsters Fellowship, ministers made more plans to combat violence.\n“The question I want to ask the people involved is what did they think was going to happen after they shot the person? What kind of life did they want for themselves?” said Rep. Harold Love, D-Nashville, a member of the fellowship.\nLove told members they will make moves to assist Mayor Megan Barry in her youth violence initiatives that will resonate with young people who may be without hope.\n“I asked myself what was he thinking about at 16? His day was focused on finding someone and shooting them and possibly ending their life. So when a 16-year-old comes to the conclusion that that’s how they want to end their day, that’s the direction they want for their lives, we again have a serious problem in our society we need to address head-on. We can’t put a Band-Aid on this. We have to find some way to find some hope for these young men,” Love said.\nPolice said they are still trying to confirm the motive behind the shooting.\nThree Metro students who were hit by stray bullets were treated and released from the hospital on Monday. One victim, 18-year-old Javious Chatman, remains hospitalized in stable condition.\nAnyone with information about the shooting or Amos’ whereabouts is asked to call police or Crime Stoppers at 615-742-7463.\nCopyright 2016 WSMV (Meredith Corporation). All rights reserved."}