{"uri": "http://wkrn.com/2016/04/25/metro-police-respond-to-shooting-at-mta-station-near-capitol/", "title": "4 teens shot at downtown Nashville bus station; 2 other teens detained", "dct": "Mon, 25 Apr 2016 15:55:00 GMT", "id": "9d9c778f510ddefdc340c5fdcd1c7eae", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nNASHVILLE, Tenn. (WKRN) – Four teenagers were injured, one critically, in a shooting at the downtown Nashville MTA bus station Monday afternoon.\nMetro-Nashville police have detained two 17-year-olds for questioning since the 3:30 p.m. shooting at Music City Central, which is located at Fifth and Charlotte avenues just blocks from the Tennessee State Capitol.\nPHOTOS: Bus terminal shooting in downtown Nashville\nAccording to authorities, surveillance video shows 18-year-old Javious Chatman exiting an escalator inside the bus station.\nChatman spoke to other people and milled around the bottom of the escalator before a number of shots were fired, according to police spokesman Don Aaron.\nThe 18-year-old was hit in his stomach area and suffered critical injuries. He was transported to Vanderbilt University Medical Center where he was listed as stable Tuesday.\nThree other teenagers were also injured by gunshot wounds and taken to Vanderbilt with non-life threatening injuries. They’ve been identified as Nathaniel Webb and Jonathan Stoner, both 16, and Jalen Jeffries, 17.\nWitness Verronica Lynch told News 2, “I was standing in the bus station when I heard the gunshots and all the kids started running, so I walked up to see what was going on and I saw one man lying beside the bus with a gunshot to his leg, and I saw another laying by the escalator with a gun shot wound to the side, and the police stared telling us to get back, telling us to step back.”\nPolice said a window washer at the nearby John Sevier State Office Building witnessed a crowd running from the bus terminal onto sidewalks and up the street.\nThe washer reported he witnessed two men run up and down the steps of the office building before tossing a gun into nearby bushes.\nOfficers arrived moments later, and he window washer yelled from his perch, “Stop them! Stop them!” and pointed police in the direction of the two men.\nThose two men, identified as 17-year-olds, were then taken into custody for questioning. A semi-automatic pistol was recovered from the bushes.\nIt has not been determined if that was the gun used in the shooting or how those teens came to possess it.\nThe teens are being questioned; no charges have been filed at this time.\nTwo officers, along with at least two former officers working in a security capacity, were at Music City Central at the time of the shooting but not near the incident.\nPolice spokesman Aaron said in a press conference the shooting “does not appear at all to be a random, happenstance event.” He said surveillance shows the teenagers riding the escalators up and down, up and down, “as if they were looking for someone” and “looking to do harm” against someone else.\nAaron noted there are multiple camera angles inside the MTA bus terminal and surveillance is “really good.” The footage will be investigated as they follow a number of leads.\n“We are trying to develop a complete picture of what happened and why,” he told the media.\nThere will also be a strong police presence Tuesday during the early morning and late afternoon rush hours as students transfer to other buses to get to and from school. It is estimated that more than 4,000 young people pass through Music City Central to transfer buses each day.\nMORE: Security heightened at downtown bus station after 4 teens shot\nDetectives, aided by surveillance video, are pursuing a number of leads as they work to identify the shooter. Anyone with information is urged to contact Crime Stoppers at 615-742-7463.\nCallers to Crime Stoppers can remain anonymous and qualify for a cash reward. Persons can also send an electronic tip by texting the word “CASH” along with the message to 274637 (CRIMES), or online at www.nashvillecrimestoppers.com.\nSon of Safe Tennessee Project’s executive director was near shooting\nBeth Joslin Roth, who is the executive director of the Safe Tennessee Project, learned about the shooting from her teenage son, who was nearby when it took place.\nHer son was riding another MTA bus home from school in East Nashville. As that bus entered the Music City Central station, the passengers heard gunfire. The driver didn’t stop and left the scene.\nRoth talked to News 2 after the incident.\n“It’s awful. How any 17-year-old gets their hand on a gun is certainly concerning,” she said. “Any time there is an incident that involves anybody with a gun, but especially a teenager with a gun, my first question is: How did they get the gun?”\nSafe Tennessee Project is aimed and dedicated toward addressing the epidemic of gun-related injuries and gun violence across the state.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nMetro Schools releases statement on student safety, security\nAccording to Metro Schools spokesman Joe Bass, 18-year-old Chatman is a student at W.A. Bass Adult High School, which is where adults who did not complete high school can get a GED.\nWebb, 16, is a student at W.A. Bass Alterative Learning Center, which is where students who are expelled from regular schools are sent.\nStoner, also 16, attends Hunter’s Lane High School, according to school records.\nJeffries, 17, is a student at the Cohn Learning Center, which is a transition school that helps students who have fallen behind to get them caught up on credits.\nThose four teenagers are among nearly 4,500 who use the city’s transit system every day.\n“We are disappointed and saddened by this latest incident of youth violence. We are grateful that the victims are recovering, and we are cooperating with Metro Police in their investigation,” said spokesman Bass.\nMetro Schools said it works closely with police and MTA to keep the buses and bus stations safe and will help keep even more officers at the bus terminal and other places where young people gather for the remainder of the school year.\nBass also said the district is working closely with the Mayor’s Office and other partners to address Nashville’s serious issue of youth violence.\n“Together, we are looking at the root causes of young people resorting to violence and working to find ways to address them,” a press release stated. “We are grateful for Mayor Barry’s leadership in this area and for pulling together the necessary people in our community to make real change. We look forward to continuing the work to implement the recommendations of the Youth Violence Taskforce and the on-going conversations around these important issues.”\nFor those who were at the bus terminal during the incident and for anyone who may be concerned about their child riding an MTA bus, Metro Schools has counselors available to talk.\nParents can call the district’s Family Information Center at 615-259-INFO to access this resource.\nNashville’s mayor responds to Music City Central shooting\nMayor Megan Barry said Monday the shooting is a “tragic reminder of the plague of gun violence in our society, where one person with a gun can devastate lives and bring the city to a halt in a moment’s notice.”\nShe continued, “My heart sank when I heard that youth were the victims in this shooting, and my hope and prayer for those victims and their families is that they have a full and speedy recovery.”\nThe mayor said as “as a clearer picture of the shooting” comes into view, she plans to meet with Metro-Nashville police and MTA officials to see how they better security at the terminal and prevent incidents like this in the future.\n“As Mayor, as a Nashvillian, and as a mother, I will never accept a status quo where our children fear being victims of violence when getting on a bus, going to school, or walking in their neighborhoods. I remain committed to working with our entire community to implement recommendations from the Youth Violence Summit Report and create better outcomes for all of our children,” Barry concluded.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}