{"uri": "http://www.tennessean.com/story/news/crime/2016/04/26/teen-shot-critically-injured-bus-station-now-stable/83537760/", "title": "Nashville tries to make sense of bloody day", "dct": "Tue, 26 Apr 2016 00:00:00 GMT", "id": "c2920acb16eeec72eae75342e4105b88", "content": "Andrew Nelles / The Tennessean\nJerock Walker recalls the mob of chaos as the gunshots sliced through the noise of a busy afternoon at downtown Nashville's Music City Central.\n\"I was shocked that they would just come and do that, with three hundred people right there, they’d just start shooting anywhere and everywhere,\" said the 16-year-old, who was at the bus station when shots rang out on Monday afternoon.\nWalker returned the next day to rally against violence at the site where the shooting left four teenagers injured, including one critically. The teen was listed in stable condition Tuesday morning.\nAlong with Walker, the city tried to make sense Tuesday of one of the bloodiest days in Nashville in some time — particularly for teens and young adults.\nEight people were injured in two separate quadruple shootings in just a 14-hour period. Police believe four people also were shot at a Goodlettsville home during an unrelated argument over a rap song.\nIn the bus station shooting, police identified Demarcus Kavel Amos, 16, as the suspect and are seeking him on one count of attempted murder and three counts of aggravated assault. Police have yet to find the teen at his home and school and are seeking help in locating him.\nSecurity boost\nIn the wake of the violence, officials tried to calm the fears of those who use the downtown transit to get to work, school or elsewhere across Music City. Extra police were stationed there Tuesday to aid in that effort.\nMetro Transit Authority CEO Steve Bland said the shooting was an unfortunate and rare incident.\nMore than 15,000 people pass through the building every day, which is like selling out Bridgestone Arena, Bland said. The shooting is the most serious event in the building's eight-year history.\n\"This is one of the safest places in Nashville,\" he said.\nBland said that at least eight police officers or security patrols are on site at any given time. The station has 44 cameras. And police and security were within 75 feet of the shooting and responded within 10 seconds, he said.\nBut the scene of people scrambling for cover as the shots rang out has left its mark.\nWalker, a student at Johnson Alternative Learning Center, said students were running in every direction when the gunfire struck the four teenagers. The wounded included the intended target of the shooting — 18-year-old Javious Chatman, Metro Police spokesman Don Aaron said.\nChatman suffered a gunshot wound to the torso and was taken by ambulance to Vanderbilt University Medical Center, where he was first in critical condition but stable by Tuesday, police said.\nTwo 16-year-olds, Nathaniel Webb and Jonathan Stoner, and 17-year-old Jalen Jeffries suffered minor injuries. They also were taken to Vanderbilt's hospital, where they were treated and released, according to police.\n'Send the police. Oh my God'\nA 911 call made to dispatch on Monday also helped paint the scene where hundreds of students were traveling home from school.\n\"We're laying on the ground, ma'am, send the police. Oh my God,\" a frantic woman tells a dispatcher. \"There's been a shooting down here at MTA, a guy just got shot.\"\nAbout 4,500 students pass through the station on a school day, said Joe Bass, Metro Schools spokesman.\nMetro Nashville Public Schools magnet students have been able to ride the buses for free or at a reduced cost for years, Bass said. And all high school students were allowed to ride the bus for free in 2014 under former Mayor Karl Dean's administration.\nBass called the bus station safe, but said the district plans to work with city leaders in addressing any safety concerns. The school district helps pay for security at the station.\n\"Our goal is to do what it takes to keep our kids safe, and that includes school-related places, bus stops, athletic events and graduation events,” he said.\nWalker hoped his actions and that of those gathered at the peace rally held by the Oasis Center helped to say the space was safe for all.\nAlthough he said feels uneasy about riding the bus after Monday, the city’s reaction meant a lot to him.\n\"They are letting us know we are safe in this community,\" Walker said. \"And that this property is ours. We don't have to worry about coming out here and getting shot.\"\nReach Jason Gonzales at 615-259-8047 and on Twitter @ByJasonGonzales. Reach Natalie Neysa Alund at 615-259-8072 and on Twitter @nataliealund.\nPolice searching for suspect\nPolice are asking for help finding Demarcus Kavel Amos, and anyone seeing him or knowing his whereabouts is asked to immediately contact the Emergency Communications Center at 615-862-8600 or Crime Stoppers at 615-742-7463.\nCallers to Crime Stoppers can remain anonymous and qualify for a cash reward. Electronic tips also can be sent to police by texting the word “CASH” along with the message to 274637 (CRIMES), or online at www.nashvillecrimestoppers.com.\nGoodlettsville shooting\nIn a different incident Monday, cousins Christopher Christian II, 22, and Ryan Bowden, 20, told police they were shot about 2 a.m. after fighting with three men about recording a rap song in a studio they run out of a garage at a home in the 500 block of Cunniff Parkway.\nThe cousins were taken to Vanderbilt Medical Center with minor injuries. Police say Christian and Bowden have each been convicted of aggravated robbery and burglary in Cheatham County.\nShortly after responding to Cunniff Parkway, Antonio Doval, 23, and Brandon Richardson, 24, arrived at Skyline Medical Center with gunshot wounds. Richardson had been shot in the hip, and Doval was struck in the arm. Police say both have been convicted of robberies.\nDuring interviews, neither man could tell detectives where the shooting had occurred or who shot them, according to police."}