{"uri": "http://www.nbcdfw.com/news/local/Terrell-Toddler-Shot-in-Fathers-Truck-392557841.html", "title": "Toddler Accidentally Shot in Shoulder by Sister: Terrell Police", "dct": "Wed, 07 Sep 2016 11:27:00 GMT", "id": "e444eb7d8ec9d8fcd00f3e2079fa6f83", "content": "A toddler accidentally shot in the neck by her sibling while sitting inside her father's truck Tuesday is expected to be released from the ICU Wednesday, police say.\nTerrell police said the 22-month-old toddler was left in her father's truck along with a 2-year-old sibling and an unsecured, loaded weapon under the truck seat.\nThe father, 25-year-old Elroy Middleton, told police he worked security at Southwest Christian College and, though he was off-duty at the time, responded to a call for a fallen tree.\nMiddleton told police he left the children in his truck while he worked, but soon after heard a gunshot coming from the direction of his vehicle. Middleton ran to the truck and found younger daughter had been shot.\nThe girl was taken by CareFlite to Children's Medical Center in Dallas, where she remained in serious but stable condition. Terrell police said Wednesday afternoon that the child's condition had greatly improved and would likely be moved from the ICU later in the day.\nIt was initially believed the child had been struck in the neck, but police later said the girl was hit in the upper left shoulder near her clavicle. The bullet entered and exited the child before passing through the truck's door.\nPolice said the older sibling picked up the weapon and inadvertently fired it, hitting her sister. The child is doing well and is expected to make a full recovery.\nDuring their investigation of the shooting, officers found a 9mm handgun inside the truck. Police told The Dallas Morning News that Middleton is not a state-licensed security officer and does not have a license to carry.\nPolice have not said if Middleton will face charges, but he could be cited for making a firearm accessible to a child."}