{"uri": "http://www.morgancountycitizen.com/cops-probe-fatal-shooting/", "title": "Cops probe fatal shooting", "dct": "Thu, 11 Feb 2016 00:00:00 GMT", "id": "030eb6d6a6f14239030c63a412f8a805", "content": "A domestic violence complaint on Aqua Road elevated into a death investigation after a man either intentionally or accidentally shot himself in the head. His wife was struck by the same bullet in the arm.\nAccording to Morgan County Sheriff’s Office reports, Robert T. Edwards, 41, was pronounced dead at Morgan Memorial Hospital after a single gunshot from a Taurus 9mm pistol struck him in the head. Reports state that his wife, Jamie Renee Edwards, 48, was struck in her right bicep with a “through and through” wound. Morgan County Sheriff Robert Markley said the bullet came to rest in the wall of the bedroom of the couple’s Aqua Road residence. Capt. Chris Bish, Investigations Division, Morgan County Sheriff’s Office, said investigators are treating the shooting as “a death investigation.” “We are trying to determine if it was accidental or intentional.”\nThe shooting occurred, reports state, at approximately 12:45 a.m. on Saturday, February 6. Bish said the couple and other family members had been at a Madison restaurant earlier in the evening and on the way home Robert Edwards stopped to aid a stranded motorist at the BP gas station on Highway 83. Later that night, Bish said, the couple began to argue and the argument became physical. He said both had consumed alcohol. An autopsy was completed by the Georgia Bureau of Investigation Crime Lab on Monday, Bish said, and preliminary results show that the fatal shot “appears to be self–inflicted.” Bish said the “series of disputes that led up to the shooting” were on–going. The dispute at some point turned physical, Bish said, and investigators believe Jamie Edwards “may have had her arm wrapped around his head,” when the shot was fired. Jamie Edwards was treated at Morgan Memorial and released. Bish said Robert Edwards was killed with a pistol that belonged to his wife and investigators are attempting to try and understand why he had her pistol and her holster. “It appears it was the wife’s weapon,” Bish said. “He had her weapon on his right hip.”"}