{"uri": "http://www.kmov.com/story/29834250/girl-9-killed-mother-injured-in-ferguson-shooting", "title": "Search for gunman after girl, 9, killed in Ferguson - KMOV.com", "dct": "Thu, 20 Aug 2015 00:00:00 GMT", "id": "bbb2998ae5158d147dfb7a2333b00e25", "content": "FERGUSON, Mo. (KMOV.com) -- Officers with the Ferguson, Missouri Police Department are investigating the fatal shooting of a 9-year-old girl Tuesday night as she laid in bed.\nThe father of Jamyla Bolden said the girl was in bed doing homework inside a home in the 9200 block of Ellison when she was shot around 9:30 p.m. Her mother was also shot in the leg, she has since been released from the hospital.\nPolice said the bullets came from outside of the home.\nThe St. Louis County coroner said the girl died of a gunshot wound. Officials with the girl's school also confirmed her death.\n\"I never in a million years thought that I'd be laying my daughter to rest,\" said James Bolden, the 9-year-old's father.\nPastor Willis Johnson has been part of an effort to bring peace to Ferguson over the past year. He said the violence must cease.\n\"There needs to be a reevaluation of human life: [whether] black, white, young, seasoned, whether in Ferguson, or areas considered affluent,\" said Johnson. \"This has to stop. This epidemic of lost life under false pretense and of no real significant reason has to change.\"\nNo arrests have been made, but police said they have received several tips. Officials also said they do not believe there is a public safety risk.\nAlderman Wesley Bell said he is confident the community will hear from law enforcement officials soon.\n\"I know that they're working on it,\" said Bell. \"I know that the chief is very concerned, and so I think in due time they'll be ready to talk more publicly. But right now, rest assured they are doing their job.\"\nThe victim's family, along with police, urge anyone with information about the shooting to contact CrimeStoppers or the Ferguson Police Department.\n\"Don't just do it for me. Do it for her. Do it for a 9-year-old child that didn't even get to see the rest of the world,\" said Bolden.\nCopyright 2015 KMOV (Meredith Corporation). All rights reserved."}