{"uri": "http://www.local10.com/news/crime/man-arrested-in-fatal-shooting-of-mother-2-teens-in-southwest-miami-dade", "title": "Man arrested in fatal shooting of mother, 2 teens in southwest Miami-Dade", "dct": "Wed, 03 Aug 2016 14:27:00 GMT", "id": "e27e38c957cfe9b1becc5ccdec56ccc4", "content": "MIAMI-DADE COUNTY, Fla. - A man was arrested Wednesday in the fatal shooting of a South Florida woman and two of her children, police said.\nMiami-Dade police had been searching for Antwon Fair since early Sunday when shots were fired at the woman's home near Southwest 203rd Terrace and Southwest 115th Avenue.\nSuspect identified in fatal shooting of mother, 2 teens\nFair was found Wednesday in Savannah, Georgia.\nTakeeya \"KeKe\" Fulton, a 39-year-old mother of six, and her daughter, Nuckeria \"Keria\" Harris, 19, were shot inside the home after Fulton got into an argument with Fair, relatives told Local 10 News.\nSources said Harris was trying to defend her mother when she was killed.\nFulton's son, Corey \"CJ\" Johnson, 17, was sleeping in his bedroom when he was shot. He later died at Kendall Regional Medical Center.\nFulton's 12-year-old son was also shot and taken to Kendall Regional Medical Center. He is listed in stable condition, but relatives told Local 10 News reporter Andrew Perez that he goes in and out of consciousness.\nA relative was granted custody of Fulton's surviving children this week.\n\"I mean, I don't understand how anyone can do this to their kids' mother, your step-kids or your own kids,\" the children's uncle said.\nCourt records show that Fair has been on probation for more than year for a weapons charge. He's previously been arrested on charges of assault, battery and drug possession.\nFair is the father of three of Fulton's children.\nMiami-Dade police said he was taken into custody with the assistance of other law enforcement agencies. Fair is expected to be extradited to Miami-Dade County to face murder charges.\nA GoFundMe account has been created to help the surviving family members.\nCopyright 2016 by WPLG Local10.com - All rights reserved."}