{"uri": "http://www.wcjb.com/local-news/2013/10/judge-declares-mistrial-williston-crab-fest-shooting", "title": "Judge Declares Mistrial in Williston Crab Fest Shooting", "dct": "Wed, 30 Oct 2013 00:00:00 GMT", "id": "8f2cb9b709060d5766785b2c23eddd65", "content": "Error loading player:\nNo playable sources found\nBRONSON - A judge has granted a mistrial in the case of the man accused of shooting up the Williston crab fest in April.\nDevonte Ocasio requested and was granted a speedy trial after being accused of killing one person and shooting four others.\nBut now - after just one full day of testimony - the trial has been thrown out because of an oversight.\nThe State Attorney's Office is taking the blame for the early ending of this week's trial, after they forgot to give information about a police report to the defense in time to prepare.\nDarry Lloyd, State Attorney's Office: \"Any and all information...which is called the discovery information...is supposed to be delivered to the defendant.\"\nThat information surrounds the siezure of the firearm in this case, when the defendant was stopped and arrested in Marion County days after the crab festival.\nThe defense made the request for the mistrial saying they would have presented their case differently if they had the report in time.\nNow Ocasio waits until a new trial is scheduled, and both sides go back to the drawing board.\nDarry Lloyd, State Attorney's Office: \"It gives us more time. It gives the state more time...it gives the defense more time to put on proper cases. This was a speedy trial. We were trying to do what is required of a marathon in a sprint.\"\nJudge Stan Griffis - who was in charge of the trial - ruled that the discovery violation was an accident.\nHad it been determined the prosecution purposely kept this report from the defense, that would have been ruled misconduct, and the defendant would have walked away because you cannot try a person for the same crime twice.\nThough that was not the case here, a mistrial costs money because witnesses must be transported again for testimony and experts brought in again.\nThe family suffers too as the whole process is begun once more.\nOocasio did waive his right for a speedy trial the second time around and he will remain in jail until a new trial date is set.\nWhen the new trial does get underway... a new jury must also be selected."}