{"uri": "http://www.wfsb.com/story/27018695/ksp-investigating-four-deaths-at-a-trigg-county-home", "title": "Suspect identified in shooting at Trigg County home", "dct": "Sun, 26 Oct 2014 20:30:00 GMT", "id": "dbbcced065b483b3257b1f52d396ab95", "content": "CADIZ, KY (WSMV) -\nOfficials have released the names of the four people who were killed in a shooting at a Trigg County home Sunday morning.\nPolice say 22-year-old Vito Riservato is accusing of shooting and killing 62-year-old Boyd Lindsey Champion, 60-year-old Joy A. Champion and 31-year-old Emily K. Champion.\nAccording to the coroner's office, all four people died from gunshot wounds.\nA spokesman said another family member was also involved in the shooting situation. He could not provide more details about his identity or involvement.\nLindsey and Joy Champion lived at the residence, and their daughter, Emily, had been visiting, according to Tfc. Jay Thomas, a spokesman for the Kentucky State Police.\nOfficers received a call about a shooting on the 1400 block of Old Dover Road at 11:44 a.m. They arrived on the the scene to find four people who had been shot to death. Police located the bodies in and around the home.\n\"This is a pretty gruesome crime for something like this to have happened,\" Thomas said.\nInvestigators spent the day processing evidence both inside and outside the home. Police and the commonwealth attorney obtained a search warrant to further examine the residence.\nThomas said the suspect briefly met the Champions last week, and his driver's license indicated he had previously lived in Hopkinsville.\nConnecticut State Police have made a second arrest in the case of the…\nLindsey Champion was an elder at the Cadiz Church of Christ.\n\"He would often teach Bible classes,\" said Randall Evans of the Cadiz Church of Christ. \"He and his wife, Joy, were very active members of the congregation.\"\nEvans said the Champions had attended church that same morning.\n\"The relationship we have doesn't end. It carries on in another place, a much better place than here. It's a beautiful day here, but they're in a beautiful place right now,\" Evans said.\nAutopsies for all four victims have been scheduled for Monday at the Kentucky Medical Examiner's Office in Louisville.\nCopyright 2014 WSMV (Meredith Corporation). All rights reserved."}