{"uri": "http://kdvr.com/2016/08/07/2-killed-2-injured-in-adams-county-shooting/", "title": "2 arrested in shooting that left 2 dead in Adams County", "dct": "Sun, 07 Aug 2016 09:04:00 GMT", "id": "3010985add17bd79fbd4c977e3ffa0f5", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nADAMS COUNTY, Colo. -- A quadruple shooting early Sunday morning left two men dead and two other people injured, the Adams County Sheriff's Office said.\nNeighbors said it started as a dispute between ex's and escalated quickly.\nThe shooting happened just after midnight at the Berkeley Village Mobile Home Park near West 54th Avenue and Sheridan Boulevard.\n“I'm sad, I'm angry, I'm torn down,” Lorenzo Heredia said. “To see my friend die in front of my face.\"\nHeredia said he spent the night outside his brother's trailer drinking with family and friends. It was quiet, he said, until a truck pulled up to the neighboring home.\n“About five guys and a girl got out and went to the neighbor's house. We heard a lot of banging and they pulled him out of the house and started beating him up,” he said.\nHeredia said they stepped in to help. He said his brother, Rojelio, fired two rounds into the air to scare off the group.\n“When they were leaving they shot back at us and hit my friend. My cousin was shot. My neighbor was shot,” he said.\n“I heard the car speed off and hit these bumps over here,” said Carlos, who lives a block from where the first shooting happened.\nHe said people in a car fleeing the scene fired more shots.\n“After that you can tell he still shot off a couple rounds. They found the shells right there,” Carlos said.\n“It seemed to be nothing but a vengeance shooting,” said Don Davidson, another neighbor and friend of the Heredia’s.\nRojelio Heredia, 24, is in custody facing a charge of first-degree murder with extreme indifference. From the other group, Brandon Karr, 24, is also facing the same charge.\nNeighbors said whatever happened, it should have never escalated to the violent point that it did.\n“Everyone wants their guns and everyone wants their safety, but no one really uses their guns responsibly anymore.\"\nAdams County detectives said they are confident all suspects are in custody and there is no danger to the community."}