{"uri": "http://www.pennlive.com/news/2016/01/questions_on_perry_county_shoo.html", "title": "Who was shot to death during Perry County eviction Monday? Reports say a child", "dct": "Tue, 12 Jan 2016 09:59:00 GMT", "id": "c9faf360dada78795b17d1f9f6599330", "content": "UPDATE:\nA 12-year-old Penn Township girl died in a shooting that occurred Monday as a constable tried to evict her family.\nQuestions remain on the shooting that killed one person and wounded another Monday morning in Penn Township, Perry County.\nState police have said more information may be coming today on the incident that occurred at 10:05 a.m. in building 11 of Pfautz Rentals on Rebecca Drive outside Duncannon.\nTrooper Rob Hicks said Monday that the shooting occurred when a constable was serving an eviction warrant at the apartment.\nOne person was fatally shot and another injured during an eviction at a Perry County apartment complex, according to state police investigators.\nIn addition to the identities of the victims and their ages, who shot first and how many shots were fired are questions that still have not been answered by police.\nWhether or not the victim was a Susquenita School District student has not yet been confirmed by police, although friends and family are posting condolences on Facebook.\nABC27 reports the student was Ciara Meyer, 12, according to a family member. Perry County Coroner Michael J. Shalonis would not confirm the information to PennLive.\nFamily identifies 12 yo Ciara Meyer as victim in shooting at Pfautz Apartments, Duncannon. @abc27News pic.twitter.com/tj0ySu3n3y\n-- Kendra Nichols (@KNichols_abc27) January 12, 2016\nThe school district issued a statement Monday that a police incident had occurred at Pfautz apartments and that the administration was \"working now to address potential impacts of this incident on our staff and students.\" No additional information was available today from the school district.\nHicks said Monday a man wounded in the shooting was taken to a hospital for treatment and that his condition was not known. He also said there was no danger to the public.\n_________\nBelow you'll find PennLive's interactive 2016 homicide tracker, based on news and police reports in the Midstate. You can use the map to see where homicides have occurred this year, and can click on individual icons for more information.\nBelow the map is a table which also displays pertinent information about each slaying, as well as a link to stories about each homicide."}