{"uri": "http://www.denverpost.com/2016/11/22/former-deputy-accused-child-abuse-shotgun-death-boy/", "title": "Ex-sheriff’s deputy accused of child abuse in Park County shotgun death of 2-year-old boy", "dct": "Tue, 22 Nov 2016 17:11:00 GMT", "id": "577c33f119adaba880ecc40c3c98d71f", "content": "A former Adams County sheriff’s deputy has been charged with child abuse in the Park County shotgun death earlier this month of his girlfriend’s 2-year-old son.\nJason William Belmont, 45, is accused of several felony counts in the case, including reckless or knowing child abuse resulting in death and negligent child abuse resulting in death. An arrest warrant was issued Monday and Belmont was taken into custody in neighboring Chaffee County.\nOfficials say he was moved to the Park County jail before posting $50,000 bail.\nAuthorities say Belmont and his girlfriend stored a loaded shotgun in a children’s play area in a home just southwest of Fairplay and that the firearm in turn caused the death of the toddler through means investigators are still working to uncover. The boy’s name has not released.\nInvestigators indicated in the warrant that the shotgun possibly fell from a rack, discharging into the boy’s upper body. Park County Undersheriff Dave Wohlers said, however, that officials might never know exactly what transpired.\n“We may never know. I think we’re just not sure exactly how the weapon discharged,” he said. “That’s still a work in progress. Obviously it’s concerning to have a loaded firearm just laying around where it can fall to the ground or be mishandled.”\nBelmont’s girlfriend, 30-year-old Stefanie Marie Wray, is also facing parallel charges in the case. She was arrested on Tuesday and was being held at the Jefferson County jail before posting $50,000 bail as well.\n“It also appears all of the other children living in this home were subjected to conditions threatening their life and death,” the warrant says. Wohlers says the other children were between the 4 and 13 years old and that he didn’t know of any prior law enforcement calls out to the home.\nInvestigators say they also found a loaded, .380-caliber pistol and a loaded, large-caliber rifle that were easily within in reach of the several children living in the house. According to the warrant, there was also a strong odor of urine and feces in the home as well as glass shards on the floor, dirty dishes strung about and “a number of capped syringe needles.”\nWhen Park County sheriff’s deputies arrived at the Nov. 13 shooting scene, they found the young boy’s lifeless body in a bathtub clothed only with a diaper. It appears other children living in the home had seen the bloody scene.\nAuthorities were alerted to the shooting by someone who came to the North-West Fire Protection District station in Fairplay.\nThe boy’s death was not made public until it was first reported Tuesday by KDVR-Channel 31. The Colorado Bureau of Investigation assisted prosecutors and sheriff’s investigators with their probe.\n“It remains under investigation so there’s nothing I can tell you right now,” David Kintz, Park County’s coroner, told The Denver Post.\nIn June 2014, Belmont was charged with sexual assault and accused of raping his estranged wife and briefly holding her captive in Aurora. Those accusations were later dismissed by prosecutors.\nAdams County deputy accused of sexually assaulting estranged wife: http://t.co/PWUjtoRLny\nAt the time of his arrest, Belmont had been working for the Adams County Sheriff’s Office since 2004. When contacted Tuesday by The Denver Post, a department spokesman declined to discuss Belmont’s employment, but said no one with his name is currently an Adams County deputy.\nSponsored Links\n.\nVital Reds SupplementHow To Fix Your Fatigue (Do This Every Day)Vital Reds Supplement\nForge Of Empires - Free Online GameThe most addictive game of the year! Play with 14 million Players now!Forge Of Empires - Free Online Game\nGreeningzMonica Lewinsky's Net Worth Left Us Jaw DroppedGreeningz\nMy Snoring SolutionEnd Your Nightly Snoring Nightmare With This Simple SolutionMy Snoring Solution\nelitesingles.comFinding Meaningful Dating and Lasting Love in Fremontelitesingles.com\nTrackr BravoNow You Can Track Your Car Using Your SmartphoneTrackr Bravo\nSponsored\nRumors Have Been Confirmed, Jolie Comes Clean\nThe Rumors Have Been Confirmed, Jolie Comes Clean - Will Family And Friends Forgive Her? Learn More Sponsored by Chatter Box Daily\nSponsored\nLegal Weed Stocks Set to Create Millions in New Wealth\nA growing number of Americans are becoming millionaires... Learn More Sponsored by mmptrack.com"}