{"uri": "http://www.gwinnettdailypost.com/local/cities/norcross/police-boy-accidentally-shoots-self-in-head-with-stolen-gun/article_1463f6ff-b4fc-5715-a424-422cc27be6b9.html", "title": "Police: Boy, 14, accidentally shoots self in head with stolen gun", "dct": "Mon, 26 Sep 2016 00:00:00 GMT", "id": "42573bc4efdc0f086f25d7be5c615184", "content": "NORCROSS — Gwinnett police are trying to find out how a 14-year-old boy got a handgun that led to him accidentally shooting himself in the face at a friend’s house Monday evening.\nOn Tuesday morning, Gwinnett police identified the boy as Fredis Albayero-Rodriguez. He was taken to Children’s Healthcare of Atlanta in critical condition, but his current status is unknown, Cpl. Michele Pihera, a police department spokeswoman, said.\nPolice said the boy took the .40 caliber Smith and Wesson handgun, which police later learned was stolen from Marietta, to his friend's home near Harbins Road. The weapon was stolen June 24, 2016, according to police.\n“We’re going to work hard to figure out exactly how this teen gained access to the weapon,” said Cpl. Deon Washington, a police department spokesman. “At this point we’re just hoping that he survives this injury.”\nPolice said the teens, who live in the same neighborhood, were sitting on a sofa where Albayero-Rodriguez was playing with the handgun and it fired at his head. Others were at the house in different rooms including children between the ages of 5 to 16, police said. Someone called 911 and tended to the victim until paramedics and police arrived shortly before 6 p.m.\n“A gunshot wound to the head is very serious, especially when it involves a child,” Washington said at the scene at 1413 Wingfoot Way.\nPolice said once the boy was shot, his friend picked up the gun, tried to unload it, and fired another round. That’s when the boy dropped the weapon, Washington said.\n“(The teen) did not live at the home, and the adults that live here had no knowledge of a firearm being inside of the home,” he said.\nAlbayero-Rodriguez's parents were notified and joined him at the hospital.\n“This is a serious reminder of how important it is to keep firearms out of the hands of children. … This was merely a horrible accident,” Washington said.\nPolice do not expect to charge the two adults, Washington said."}