{"uri": "http://www.cbs46.com/story/33239068/police-14-year-old-accidentally-shoots-self-in-head-in-gwinnett-county?autostart=true", "title": "Police: 14-year-old accidentally shoots self in head in Gwinnett County", "dct": "Mon, 24 Oct 2016 22:29:00 GMT", "id": "4953eadd7796247ac4e8918e3090d980", "content": "GWINNETT COUNTY, GA (CBS46) -\nPolice say a 14-year-old accidentally shot himself in the head at a residence in the 1400 block of Wingfoot Way in Norcross on Monday.\nPolice say Fredis Albaybro-Rodriguez was playing with a stolen 40 caliber Smith and Wesson handgun at his friend's house. The handgun discharged and struck him in the head.\nAlbaybro-Rodriguez was taken to Children's Healthcare of Atlanta and is in serious condition, according to a spokesperson with Gwinnett County police. Two adults and four children were in the residence at the time of the shooting.\nDetectives say the gun was stolen out of Marietta in June and they're trying to determine how the teen obtained the weapon. The teen's 12 year-old friend, who didn't want to be identified, said he didn't know how to react.\n\"It left me deaf in my right ear and I couldn't hear and I just went into shock,\" said the friend. \"Finally, when I opened my eyes, I just saw him laying face down on a pillow and there was just blood everywhere.\"\nThere are no charges expected against the adults who were inside the home. This case is serious illustration of how dangerous firearms can be in the hands of children.\nCopyright 2016 WGCL-TV (Meredith Corporation). All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}