{"uri": "http://fox8.com/2016/09/17/philadelphia-shooting-spree-leaves-two-police-officers-shot-1-other-person-dead/", "title": "Philadelphia shooting spree leaves two police officers shot, 1 other person dead", "dct": "Sat, 17 Sep 2016 11:16:00 GMT", "id": "0b53ec5dbd92a38ff440b29951fe676a", "content": "PHILADELPHIA, PA - A gunman with a reported hatred of law enforcement went on a deadly tear late Friday in Philadelphia, ambushing a police sergeant and firing rounds into a tavern and a car before police shot him dead, authorities said.\nThe rampage left a 25-year-old woman dead after she was shot seven times in the torso, police said. Two police officers and three others -- two men and a woman -- also were wounded.\n\"Right now we have a lot of questions. This is completely a bizarre situation,\" Philadelphia police Commissioner Richard Ross Jr. said at a press conference Saturday.\nRoss said police found a rambling note at the scene that said the gunman hated police and probation officers and it mentions a \"particular probation officer.\"\n\"Obviously we are trying to track that individual down to make sure they are OK first and foremost,\" he said.\nSergeant shot in protective vest\nThe shooting occurred at about 11:20 p.m. Friday when a man approached a police car and fired through the window at Sgt. Sylvia Young, who was sitting in her cruiser at 52nd and Samson streets in west Philadelphia, police said.\nNo words were exchanged, according to Ross.\nYoung, a 19-year veteran of the force, was struck in her left arm and her protective vest. She is in stable condition at a hospital, police said. Ross said she is talking and is going to be OK.\nOfficers nearby heard the gunfire and responded, chasing down the man as he fled.\nCornered in an alley\nThe gunman fired into a bar, which had its door open, injuring a security guard, police said. He then grabbed a woman and used her as a human shield, shooting her in the leg, authorities said.\nHe discharged further rounds into a car, striking a man and woman inside, police said.\nThe man ran into an alley before a University of Pennsylvania police officer and two others from the city police cornered him. Police said they shot and killed him, and he was declared dead at the scene.\nCNN affiliate KYW said a University of Pennsylvania officer was also wounded and is in stable condition at a hospital.\nFour officers were believed to have discharged their weapons, police said.\nThere was no immediate information on the identity of the gunman, but police said they don't believe anyone else was involved at this time.\nCNN affiliate WPVI reported that \"officers will be riding two to a car until further notice.\""}