{"uri": "http://www.nbcphiladelphia.com/news/local/Philadelphia-Police-Officer-Shot-in-SW-Philly-393797511.html", "title": "Investigation Continues Into Motive Behind Shooting Rampage That Killed Woman, Injured 2 Officers & 3 Others in Philadelphia", "dct": "Sat, 17 Sep 2016 00:00:00 GMT", "id": "b4a3c913c70b8b9c2ba9ca6aa369bd69", "content": "Nearly 48 hours after a lone gunman went on a shooting spree through a Philadelphia neighborhood that left a woman dead and 5 others injured, investigators are digging into the shooter's past to determine a motive.\nPolice say Nicholas Glenn took a handgun with obliterated serial number and a cache of extra magazines and began his rampage after 11 p.m. Friday on Sansom Street near 52nd in West Philadelphia. In the span of a few minutes, Glenn shot two police officers and four civilians, leaving one young woman with injuries that would later kill her.\nOfficers eventually shot Glenn to death after his four-block shooting spree, and found a raving, barely coherent note that was addressed to \"doomed people.\" The note, written in the first person, has been described by officials as \"a bunch of ramblings.\"\nWATCH: Chaos during shooting rampage captured by surveillance cameras:\nThe note, written in the first person, has been described by officials as \"a bunch of ramblings \"which apparently was meant for anyone he came across,\" Philadelphia Police Commissioner Richard Ross said Saturday afternoon. \"Other than the rantings he had in that letter, we don't know what he was motivated by. Unfortunately, we may never know.\"\nPolice were interviewing Glenn's relatives and friends in hopes of determining what led him to go on his rampage, shooting random people whom he didn't even know. Investigators also want to know where Glenn got the 9mm handgun he used, but tracing it will be a more daunting task without the weapon's serial number.\nNBC10's George Spencer has the detailed timline of the rampage shooting in West Philadelphia that left a woman dead and five others, including two police officers, injured. (Published Saturday, Sept. 17, 2016)\nGlenn, 25, allegedly mentioned his parole officer in the letter that police found after shooting him dead in an alley near 48th and Sansom streets. Ross said he has no apparent ties to any larger organization.\nThe rampage started about 11:20 p.m. Friday when Glenn walked up to Sgt. Sylvia Young's marked police cruiser on 52nd and Sansom streets. Young, who is assigned to the 22nd District, was working a patrol detail in the 18th District. As Young sat inside her vehicle, Glenn opened fire at the driver's side, police said.\nYoung, who was wearing a bulletproof vest, was struck eight times in the left shoulder, arm and torso.\n\"Help me, please!\" Young yelled on police radio moments after the shooting.\nRoss said it's a miracle the 19-year veteran wasn't killed, considering Glenn fired 18 rounds before he started his seemingly random shooting spree east on Sansom Street. Following the shooting, Young was taken to Penn-Presbyterian Hospital where she was in stable condition.\nNBC10 obtained surveillance video that sources say shows Glenn walking away shortly after shooting Young.\nWATCH: Surveillance video of suspect in rampage shooting: https://t.co/hBnMaWEDQ3pic.twitter.com/Lt7TNm6RNl\n— NBC10 Philadelphia (@NBCPhiladelphia) September 17, 2016\nAs Glenn continued walking, he passed the Maximum Level Lounge on 5118 Sansom Street, where a 42-year-old manager and a 41-year-old bartender were in the open doorway attending to a wheelchair-bound patron, police said. Glenn then fired about five rounds into the doorway, striking the manager in both legs and the woman in the right ankle. The two victims were taken to Penn-Presbyterian Hospital, where they were listed in stable condition.\nGlenn then continued running eastbound on Sansom Street and approached a 2011 Nissan Altima with a 36-year-old man and 27-year-old Sara Salih inside. Police say Glenn opened fire, striking the man in his arm and chest and Salih several times in her chest. Both victims were taken to Penn-Presbyterian Hospital, where Salih succumbed to her injuries. The man was in critical condition.\nWe're learning more about the slain suspect in a rampage shooting that left a woman dead and five people, including two police officers in West Philadelphia. NBC10's Deanna Durante has the details. (Published Saturday, Sept. 17, 2016)\nGlenn then continued eastbound on Sansom Street and was pursued by two 16th District officers in a marked police Ford Explorer, officials said. Glenn opened fire on the officers, striking their vehicle on the hood and driver's side door, according to police. The officers were not injured during the shooting.\nGlenn continued running from police and was confronted in the 100 block of South 48th Street by University of Pennsylvania Police officer Edward Miller, police said. Glenn opened fire and struck Miller in the hip and leg area.\nNBC10 obtained surveillance video of an officer who falls to the ground and then limps to safety during the shooting. The video then shows other responding officers rush to the scene.\nMiller was taken to Penn Presbyterian, where he was in stable condition.\nGlenn then continued exchanging gunfire with the responding officers. Glenn was struck several times during the shootout and finally died from his wounds at 11:45 p.m., officials said.\nPolice say Glenn was in possession of a note with the headline, \"Doomed People.\" They also said the note included rambling, unclear statements that indicated Glenn's hatred toward his probation/parole officers as well as police.\n\"It is rambling,\" Ross said. \"It would be very difficult to glean anything from that. It's more about himself than it is about who he wanted to harm.\"\nPolice recovered Glenn's weapon, a Ruger Model SR9, 9mm semi-automatic pistol. Officials say the gun was loaded with 14 live 9mm rounds. There were also three empty magazines throughout the scene that Glenn had discarded as he emptied the magazines and reloaded, police said. In all, Glenn discharged his gun at least 51 times during the incident, according to investigators.\nYoung and Miller were awake and talking with relatives after being hospitalized, Mayor Jim Kenney said.\n\"[Miller] actually was cracking jokes with his kids and wife. The other officer [Young] was talking with her family,\" Kenney said. \"We’re very blessed that that’s the way it turned out. But we have to keep in our prayers the civilians.\"\nPenn Safety Director Maureen Rush said Miller served 33 years on the Philadelphia police department, retiring as a sergeant, before joining the Penn PD.\nRoss, who termed the shooter's note a \"bunch of rantings,\" said officers would patrol in pairs following the incident.\nKenney asked that everyone pray for the injured officers and civilians.\n\"All in all it was a really terrible, scary night,\" he said.\nThe Fraternal Order of Police announced that proceeds from their 4th annual Monday Night Football tailgate party would go to Sergeant Young and Officer Miller.\nPlease share! pic.twitter.com/07hW1GoGPR\nPolice sources told NBC10 Glenn had a lengthy criminal record and was arrested more than a dozen times. Glenn's attorney Anthony Petrone also told NBC10 that he spent much of his prison time in solitary due to fighting.\n“I did notice with him a serious change in his attitude and overall demeanor during the period of time that he was incarcerated up in the county prison,” Petrone said. “I remember visiting him frequently and he had to be pulled out of solitary and I remember he was having a very difficult time in dealing with the solitary confinement.”"}