{"uri": "https://www.dnainfo.com/chicago/20160221/west-englewood/3-year-old-boy-shot-while-playing-outside-saturday-afternoon-police", "title": "Kids Have Grown 'Used To' Violence, Neighbor Says After 3-Year-Old Shot", "dct": "Sun, 21 Feb 2016 14:45:00 GMT", "id": "4d4da1818c4f0ab8bc7104d049d95165", "content": "CHICAGO — Just 24 hours after a 3-year-old boy was shot and hurt while playing outside on a West Englewood block, neighborhood kids did not seem deterred from enjoying the outdoors, as one neighbor said children have grown \"hard\" due to frequent shootings.\nThe boy was standing on the sidewalk in the 5600 block of South Wolcott Avenue at 3p.m. Saturday when someone fired shots, hitting the boy in his right leg, said Officer Jose Estrada, a Chicago Police spokesman. He was taken to Comer Children's Hospital, where he was in \"stable\" condition.\nPolice don't believe the boy was the intended target.\nThe boy was playing outside with an adult male relative, who left after the shooting, according to the Tribune. Family members of the boy could not be reached Sunday afternoon.\nOn Sunday afternoon, kids played basketball and young girls climbed on a jungle gym at Henderson Elementary School, 5650 S. Wolcott Ave., in the same block as the shooting.\n\"Hola! That means 'hello!'\" the girls cried to passersby, laughing.\nA man who has lived in the area for 16 years said the street is normally safe and many families with children live nearby. In June, a 38-year-old man was shot and wounded on the same block as Saturday's shooting, but there have been no shootings reported in nearby streets since October.\n\"It ain't good, somebody getting shot,\" said the man, who asked not to be named. \"It ain't normally like that.\"\nNearby, a sign for the 55th Wolcott Block Club snapped in the wind: \"This block is nice, quiet & clean & keep it that way. NO loud music, car washing or repairs, selling drugs, loitering or gang activity.\"\nMaurice Austin, who's lived in the area for eight years, said shootings and violence don't occur \"too often.\" But he tries to keep inside his home, leaving only when he has to, because he does not feel \"100 percent\" safe.\n\"I don't want to put myself in a situation where I would be in the wrong place at the wrong time,\" Austin said.\nThere are many children who live nearby, Austin said, and he expects to see more kids playing outside as the weather gets warmer. Saturday's shooting will keep some kids inside, he said, but not all of them.\n\"Some kids are so hard, so used to it, they'll still come outside,\" he said.\nNo one was in custody.\nFor more neighborhood news, listen to DNAinfo Radio here:"}