{"uri": "https://www.dnainfo.com/chicago/20160223/englewood/west-englewood-residents-unite-for-operation-wake-up-stop-shootings", "title": "It's Time For Englewood Residents To Make Gangs Feel Unsafe: Police", "dct": "Tue, 23 Feb 2016 15:30:00 GMT", "id": "ff1ca149080b67a4a0c15bb48229e724", "content": "WEST ENGLEWOOD — After a Saturday shooting left a 3-year-old boy wounded, police and community leaders gathered on a West Englewood block Monday night with a simple message to residents: stop letting gangs run your block.\n“Operation Wake-Up” seeks to recruit local residents to work with the police. Ald. Raymond Lopez (15th) and the Englewood Police District CAPS organized the rally, which was held in the 5600 block of South Wolcott Avenue.\nThe Rev. Dwayne Grant of Xperience Church Chicago, who's also a community activist, arrived early to distribute fliers and knock on doors. He said the rally was in response to Saturday’s shooting that wounded 3-year-old Ayden Deer.\nEnglewood District Cmdr. Larry Watson called the shooting a “tragedy” and said that for there to be an “effective” change, the community must take action.\n“This is a problem we can fix,” he said. “No one will operate in a community where they don’t feel safe,” he said referring to the shooters. “They do it because they know no one will say anything.”\nAyden’s uncle Kelvin Conley attended the event and said he’s not certain that what the police are trying to do will be effective, but it’s worth a try.\n“It’s a start,” he said.\nWhat happened to his nephew was a surprise, Conley said, because the block is usually safe.\n“This the first time something happened like this in like a year and a half,” he said. “It goes on around here, just not this block. This block is nice.”\nThe older men on the block keep it safe by telling anyone who looks like trouble to leave, he said.\nConley said he gets respect on the block and that he’s willing to work with the community and police to help prevent what happened to Ayden from happening to anyone else.\nCelisa Gardner has lived in the community for 36 years. She came out of her home in the 5700 block of South Winchester Street when she saw the police lights. The solution to her is to provide more places for neighborhood children to go.\n“If they have somewhere to go, they won’t be on the street,” she said. “They say the village can raise a child, no, the village is sick. We can’t raise the child anymore.”\nGlen Brooks, Area South coordinator for the Chicago Police, said there will be a father-daughter dance in May. Lopez is also working on getting a community soccer team started. There’s also the Englewood Police Youth Baseball League. Brooks encouraged people to sign the list that Sgt. Kimberly D. Woods passed around.\n“The first step is to organize ... none of us can do this alone,” Brooks said.\nLopez came out to take a stand against the violence too.\n“I’m tired of all the shootings in our neighborhood,” he said. “Our kids need the opportunity to become adults, and until all our neighborhoods start standing up and fighting back, that’s not going to happen. Our children are not targets for gangbangers who don't know how to shoot.”\nWhen he addressed the gathering of about two dozen he asked them “Whose neighborhood is this?” They shouted back “Ours.”\nFor more neighborhood news, listen to DNAinfo Radio here:"}