{"uri": "http://qctimes.com/news/local/crime-and-courts/two-teens-arrested-in-fatal-davenport-shooting/article_69909407-df21-5110-9a37-17624b54f990.html", "title": "Two teens arrested in fatal Davenport shooting", "dct": "Thu, 07 Jul 2016 00:00:00 GMT", "id": "85aacb7c2a9f411b089a6ac89f816fac", "content": "Two Davenport teenagers with a history of gun offenses have been charged in connection with the June 26 fatal shooting of 15-year-old Ayana Culbreath.\nTrevor Demyjaleek Owens, 17, and Kamario Corleone Hill, 14, faces charges of first-degree murder and intimidation with a dangerous weapon with intent.\nOwens, who has been charged as an adult, also faces a charge of being a felon in possession of a firearm. Records were not available Wednesday for Hill, who has been charged as a juvenile.\nBoth were in custody — Owens at the Scott County Jail and Hill at the juvenile detention center — on unrelated charges when Davenport police announced the charges Wednesday, according to court records.\nA juvenile who is 16 or older and who is accused of a forcible felony is automatically tried as an adult.\nPolice were called around 12:31 a.m. June 26 to 4233 Warren St. for a report of a shooting during a backyard gathering. Culbreath was taken to Genesis Medical Center-East Rusholme Street, Davenport, where she was pronounced dead.\nAn autopsy determined that she died from a gunshot wound to the chest.\nArrest affidavits released Wednesday by police claim that Owens and Hill fired a handgun toward an “assembly of people” with the intent to injure or provoke fear.\nBoth Hill and Owens were identified as being involved in the shooting, according to the affidavit.\nDavenport Police Capt. Brent Biggs declined to say exactly how the two were identified, citing the ongoing investigation.\nThe arrests of the teens comes one day after Ayana’s family and friends laid her to rest.\nHer aunt, Janice Collins, said Wednesday that the family was “just happy that they did have people arrested.” She said the family has been taking things “one day at a time.”\nDawn Saul, spokeswoman of the Davenport Community School District, said Hill is enrolled at the Keystone Academy for the 2016-2017 school year. Saul said Owens was not listed in the district’s system.\nOwens, who turns 18 next month, appeared Wednesday in Scott County District Court in an unrelated case and pleaded guilty to possession of marijuana, a serious misdemeanor, and operating a motor vehicle without owner’s consent, an aggravated misdemeanor.\nHe was sentenced the same day to a suspended jail sentence, one year of probation and $940 in fines. He also pleaded guilty to theft in a separate case. He will be sentenced Aug. 17 in that case.\nIn December 2014, Owens was charged in connection with a shooting at Save-A-Lot, 405 E. Locust St., Davenport.\nAccording to court documents, Owens and a co-defendant got into a verbal altercation with others in the parking lot when he produced a handgun and fired at least twice in the direction of at least three people, occupied vehicles in the parking lot and the building.\nOwens pleaded guilty in juvenile court to assault while participating in a felony in February 2015 and served about seven months in the State Training School in Eldora. He was released to the custody of his mother in October, according to court documents.\nIn March 2015, Hill was charged as a juvenile with intimidation with a dangerous weapon, reckless use of a firearm resulting in serious injury and assault use/display of a weapon. He was 12 at the time, according to court records.\nAccording to court documents filed in the case, Hill fired a gun at a juvenile victim who was walking with a group of friends in the 700 block of West 14th Street. The victim was hit in the lower leg.\nHe was found guilty in June 2015 on charges of intimidation with a dangerous weapon, reckless use of a firearm causing bodily injury and assault while displaying a dangerous weapon. He was placed into the custody of the Department of Human Services and placed at the Wittenmyer Youth Center’s Leslie Program.\nIn May, he was returned to live with family and placed on supervised probation.\nOn June 28, Assistant Scott County Attorney Elizabeth Cervantes filed a motion seeking to have Hill placed into custody of the Iowa Department of Human Services and claimed he had been in an altercation at a late-night party “where he was witnessed shooting a firearm” that involved multiple shots and led to Ayana’s death.\nA judge approved the request the same day."}