{"uri": "http://6abc.com/news/triple-shooting-in-southwest-philadelphia/1422950/", "title": "Victim of basketball rivalry shooting remembered in Southwest Philadelphia", "dct": "Tue, 12 Jul 2016 00:00:00 GMT", "id": "151a33755a7ccc5e7e488dee7f99de58", "content": "SOUTHWEST PHILADELPHIA (WPVI) --\nA vigil was held Tuesday night for a teenager killed in what police say was an ambush shooting over a basketball game dispute.\n200 relatives and friends of 15-year-old Tyhir Barnes gathered in Southwest Philadelphia.\nMany of his friends also knew him as Jaquil.\nAmong those at the vigil was Tyhir's mother Tanisha Pratt-Thomas.\n\"He was loved, he was loved. And whoever did it, they know, that's why they had to do that, because they're cowards. Punks. Bums,\" Pratt-Thomas said.\nPolice say the shooting happened around 10 p.m. Monday at 60th Street and Baltimore Avenue.\nTyhir, 14-year-old Glenn Butler, and a 16-year-old friend were walking home from a basketball game when shots suddenly rang out.\nBarnes died after being shot in the face.\nButler, who was shot in the arm, and the 16-year-old, who was shot in the leg, survived.\n\"I just started running. I seen the first shot. My man got hit, he died right in front of me. He just fell,\" Butler told Action News Tuesday afternoon.\nPolice say the gunman was a member of the rival 56th and Christian basketball team.\nThey believe the gunman was motivated by the outcome of a post-game dispute between the two teams that happened last Thursday night, after the 60th and Baltimore team beat the 56th and Christian team in the last seconds of the game with a buzzer-beater shot.\nAn argument ensued, said police, and words were exchanged.\nAn ongoing investigation reveals the shooter was lying in wait and ambushed the boys.\n\"We know for a fact he's young, in that 15 to 17 years of age. It really just doesn't make any sense. It's all over a basketball game,\" Philadelphia Police Captain James Clark said.\nButler's mother Karon Simmons is still shaken by the whole thing.\n\"It could have hit an artery, it could've paralyzed him on his right side. Anything could've happened,\" Simmons said.\nFor some residents, this was more than just another teenager being shot and killed on the streets of Philadelphia.\n\"At some point, we have to look at ourselves within and say. 'listen, something is inherently wrong with us' that we think this is fine, that we will be desensitized to this in the next two or three days as if nothing ever happen,\" family friend Darren Toliver said.\nTyhir's mother had one more thing to add.\n\"Everyone gets upset with this police brutality and everyone's mad because the white cop killed the black kid. But a black kid killed another black kid. Be mad about that, be mad about that. Put that in your heart and you rally about that,\" Pratt-Thomas said.\nMeanwhile, the co-founder of the Youth Basketball League, Tyrone Sims, says this organization was created specifically to keep these kids away from this type of violence and now says he may have to rethink it all together.\n\"I'm afraid that if we don't get the right protection or support that we can't continue,\" Sims said.\nDetectives are going through team rosters and interviewing players.\nAt the end of the vigil, Tyhir's friends released dozens of balloons in his memory.\nPolice tell Action News they have the name of the suspect and are extremely confident that they will make an arrest soon.\nAs for the victims, it turns out, Tyhir Barnes was an aspiring rapper. His producer says he was due to release his first mix tape this September. It will be called, 'Jaquil Forever.'"}