{"uri": "http://6abc.com/news/teen-arrested-in-deadly-shooting-over-basketball-game/1436624/", "title": "Teen arrested in deadly Southwest Philadelphia shooting over basketball game", "dct": "Fri, 22 Jul 2016 00:00:00 GMT", "id": "e5affe8b6a334ddeef687d9d480d6283", "content": "SOUTHWEST PHILADELPHIA (WPVI) --\nPhiladelphia police arrested one teenager and are seeking another for the murder of a 15-year-old boy as he left a basketball game.\nTyhir Barnes was shot in the face near 60th Street and Baltimore Avenue in Southwest Philadelphia on July 11th.\n16-year-old Josh Richardson was arrested around 6 a.m. Thursday and charged in the killing.\nPolice are continuing to search for 16-year-old Kywayne Hill who is considered armed and dangerous.\n\"Just why? I want answers. Why is the biggest one word question I have. Why?\" Tyhir's mother Tanisha Pratt-Thomas told Action News.\nPolice say Tyhir, 14-year-old Glenn Butler, and a 16-year-old friend were walking home from a basketball game around 10 p.m. that night when shots suddenly rang out.\nBarnes died after being shot in the face.\nButler, who was shot in the arm, and the 16-year-old, who was shot in the leg, survived.\nPolice say the gunman was a member of the rival 56th and Christian basketball team.\nThey believe the gunman was motivated by the outcome of a post-game dispute between the two teams that happened last Thursday night, after the 60th and Baltimore team beat the 56th and Christian team in the last seconds of the game with a buzzer-beater shot.\n\"This is one of the more senseless homicides,\" Philadelphia Police Captain James Clark said.\nPratt-Thomas, now preparing to bury her second oldest son, wonders about the 16-year-old who was arrested at his family home.\n\"I just want to know why. Where's the guidance at in his life? Where's the parents at in his life?\" Pratt-Thomas said.\nPhiladelphia police say they have one person in custody and are seeking another for the murder of a 15-year-old boy as he left a basketball game. (WPVI)"}