{"uri": "http://www.wxyz.com/news/detroit-police-say-11-year-old-boy-accidentally-shot-himself", "title": "Father arrested after 11-year-old son accidentally shoots himself in the butt", "dct": "Thu, 07 Apr 2016 09:57:00 GMT", "id": "9aa4d13738fd38ac6bca035717db2534", "content": "Autoplay:Father arrested after 11-year-old son accidentally shoots himself in the buttCONNECTING...X11-year-old accidentally shoots himself in buttocks\n(WXYZ) - An 11-year-old boy is in the hospital after accidentally shooting himself Thursday morning. It happened in an apartment at the corner of Vernor and Hubbard in southwest Detroit.\n“He was home alone,” said Commander Whitney Walton. “His father had left early for work and what our information is, he told the son, there is a rifle in the house if anything happens.”\nThe boy somehow found the loaded weapon. According to police, he started playing with it and it went off.\nThe child was in the buttocks. With no one phones in the home to call for help, he alerted his dad about the shooting through Facebook.\n“The son had a cell phone but apparently recently lost it,” said Commander Walton. “I guess there was not a home phone for him to call his father so that was the only tool he had was social media to reach out to his father through instant message.”\nHis dad immediately called 911 and returned home. The boy was taken to the hospital where we are told he is in stable condition and walking.\n“I think leaving an 11-year-old with a loaded rifle is a reckless act,” said Commander Walton. “I mean, you should not have an 11-year-old home alone with a rifle you have made them aware of. I mean, you need to have your weapon secured, put somewhere. Children are children. They’re going be curious.”\nPolice are still investigating to see how the child was able to shoot himself in the butt.\nThe child’s father is cooperating with police. Neighbors are relieved the child is okay.\n“I don’t know how he had access to the gun,” said neighbor Alicia Dixon. “But from what I see and what I know his father is a terrific dad. I can tell by the way they interact with each other.”\nThe father has been arrested and could face charges. The case is being investigated by DPD’s Child Abuse Unit and Child Protective Services."}