{"uri": "http://www.ibtimes.com/who-ali-syed-oc-gunman-leaves-4-dead-3-victims-identified-1095082", "title": "Who Is Ali Syed? O.C. Gunman Leaves 4 Dead, 3 Victims Identified", "dct": "Tue, 19 Feb 2013 21:05:00 GMT", "id": "693811fb8782501424038a0b28389fc8", "content": "Ali Syed, a 20-year-old community college student, has been identified as the gunman who killed three people and then himself in Orange County, Calif., Tuesday, the Los Angeles Times reports.\nPolice still don’t have a motive for the rampage, which began with the death of a woman at Syed’s home in south Orange County.\nAccording to the Associated Press, 20 minutes after that shooting Syed told his first carjacking victim: “I don’t want to hurt you.”\nAuthorities revealed he went up to a man who was pumping gas in Tustin and demanded: \"I just killed someone. Give me your keys. This is my last day.\"\nEven he claimed he meant no harm, the shooter killed three victims and wounded several others before taking his own life, Orange County sheriff's spokesman Jim Amormino said.\nHis 25-mile rampage stretched from Tustin to Orange, police said in a news conference.\n\"There is no conspiracy here, there are no outstanding suspects, it was a very, very unfortunate situation, but I don't think the people here in Orange County have to be worried about their safety,\" Tustin Police Chief Scott Jordan assured residents in a statement.\nSyed was said to be an unemployed man who was taking a class at Saddleback College. The student didn’t have a criminal record and reportedly lived at home with his parents in Ladera Ranch, the same place where first person was slain.\nOfficers were called to the home around 4:45 a.m. PST, according to reports, after Syed's parents reported a shooting after fleeing the house. Police found a dead unidentified woman who had been shot several times. The relationship between her and the shooter is unclear, but the L.A. Times reported they were not related.\nThough other family members were home at the time of the shooting, including children, no other injuries were reported.\nSyed took off soon after, attempting a carjacking around 5:10 a.m. and opening fire where he killed Melvin Edwards, a 69-year-old from Laguna Hills, after forcing the man get out of his BMW.\n\"He was basically executed,\" Santa Ana Police Cpl. Anthony Bertagna said in a statement. \"There were at least six witnesses.\"\nFive minutes later police were being flooded with reports of a man with a gun opening fire on the 55 Freeway. They’re not sure if he started to fire while driving or stopped the vehicle.\nSyed then stopped at the Micro Center where he shot and killed construction worker Jeremy Lewis, 26, of Fullerton and injured another, police said.\nHe took Lewis’ construction truck with California Highway Patrol officers in pursuit. Once he reached an intersection he jumped out of the vehicle in Orange and shot himself immediately with a shotgun, Jordan said.\nThe weapon was recovered at the scene.\n100%PAUSEDN/AN/AN/AN/A"}