{"uri": "http://www.dailymail.co.uk/news/article-2281171/California-shooting-suspect-Ali-Syed-gunned-woman-bloody-25-minute-murder-spree.html", "title": "Pictured: The two male victims of OC student, 20, who gunned down a woman in his family home before stealing five cars to go on a bloody 25-minute murder spree", "dct": "Tue, 19 Feb 2013 17:26:00 GMT", "id": "d92af77558fd3e864af71ba8550e0918", "content": "Suspect identified as 20-year-old Ali Syed, an unemployed college student\nFirst victim was unidentified woman in her 20s at his parents' home in Ladera Ranch\nOther victims identified as construction worker Jeremy Lewis, 26, and business owner Melvin Lee Edwards, 69\nPolice report at least five crime scenes of dead or injured victims\nSyed was also shooting at passing cars on the freeway\nGunman followed by cops as he drove to middle of an intersection, where he got out of his car and shot himself\nThe two male victims of a 20-year-old college student were identified on Tuesday night after they were shot dead in the street during a murder and carjacking spree.\nBusiness owner Melvin Lee Edwards, 69, was on his way to work when he crossed paths with shooter Ali Syed, of Ladera Ranch, California and was killed 'execution-style', witnesses said.\nThe second male victim, 26-year-old construction worker Jeremy Lewis of Fullerton, was killed a short time later at an electronics store and his small truck carjacked.\nSyed was identified by police on Tuesday afternoon, hours after the early morning massacre which began at his family home.\nHis first victim, described as a woman in her 20s, was not identified.\nShe was not related to the shooter and it is unclear what she was doing at the home.\nSyed's 25-minute shooting spree through Orange County left a bloody trail of dead and injured victims in a series of carjackings and gunfire, police said.\nAuthorities reported at least five places where victims had been shot in the early morning violence - and at least four are dead - including Syed who took his own life.\nAuthorities said Syed was taking one course at Saddleback College, a two-year community college.\nThe shootings began at 4.45am when deputies responding to a call found the body of a female who was shot multiple times in a house in Ladera Ranch, Orange County sheriff's spokesman Jim Amormino said.\nPolice said Syed's parents and several children were in the home at the time, but were not injured.\nFrom Ladera Ranch, police said the gunman, armed with a shotgun, headed north and within 30 minutes carjacked a Dodge pickup truck in Tustin, 20 miles away. The driver was uninjured, but a bystander was hit by gunfire and hospitalized.\nScroll down for video\nAccording to police, Syed told one of the men: 'I don’t want to hurt you. I killed somebody. Today’s my last day, give me your keys.'\nBetween 5.30am. to 5.55am, Tustin police received numerous calls about shootings in several locations, he said.\nThe first call that came in was at Red Hill Avenue and Interstate 5, where a truck was stolen from a Mobil gas station.\nAfter that carjacking, Syed then began spraying the freeway with bullets, hitting several drivers.\nThree people reported being targeted, including one who suffered a minor injury, Tustin police Lt Paul Garaven said. Two cars were damaged.\nWhen the truck got low on gas a short time later, Sayed stopped at State Route 55 and McFadden Avenue in Santa Ana, where he forced the driver out of the car, killed him, and took his BMW.\nThe driver was identified as business owner Melvin Lee Edwards, 69, who was on his way to work when he crossed paths with Syed. Santa Ana police Cpl Anthony Bertagna said: 'He was basically executed. There were at least six witnesses.'\nThe shooter then drove to a Tustin Micro Center electronics store and carjacked another small truck, after killing its driver, identified as 26-year-old construction worker Jeremy Lewis of Fullerton.\nWhen another worker at a nearby construction site approached Syed, the gunman told him to run - and with his back turned - Syed shot him, striking him in the arm. He then drove off.\nBut his shooting and car-stealing spree ran came to an end as officers from the California Highway Patrol located Syed and followed him into the city of Orange, Garaven said.\nOrange County sheriff's spokesman Jim Amormino said: There wasn’t a confrontation at that very end. It happened so quickly.'\nHe pulled into the intersection of Katella Avenue and Wanda Road, exited the still-moving vehicle, where he quickly shot himself in the head with the same shotgun.\nThe motive for the shootings is still unclear.\nTustin is about 35 miles southeast of downtown Los Angeles.\nWatch video here"}