{"uri": "http://www.wftv.com/news/local/boy-16-accused-of-fatally-shooting-15-year-old-girl-in-apopka/169580168", "title": "Trigger pulled twice before 15-year-old girl fatally shot, Apopka police say", "dct": "Mon, 21 Mar 2016 18:38:00 GMT", "id": "8a1e59df4f4fc827167db2e3eedf5d87", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nAPOPKA, Fla. - Quashun Massey, 16, was lying in bed with his girlfriend of five years when he pulled the trigger of a revolver pointed directly at her, Apopka police said.\nThen he pulled it again and again, they said.\nIt was the third pull of the trigger that sent a bullet into Destiny Bargman, 15, and killed her, investigators said.\nThe shooting happened at about 1:30 p.m. Saturday at a home in the 1000 block of Sheeler Hills Drive.\nMassey told officers that he had spent the night at the home and was with Bargman that morning, an Apopka police report said.\nAt some point he left her bedroom and got the revolver, which he and other people at the residence had been shooting earlier, it said.\nMassey knew the handgun was functional but thought it was unloaded, he reportedly told investigators.\nHe got in bed with Bargman and pointed the gun at her and pulled the trigger, the report said.\nBargman told him to stop, but Massey pulled the trigger again, it said.\nThe third time he pulled the trigger, the gun went off and Bargman was shot, investigators said.\nMassey immediately left the room and put the gun in the kitchen before returning to Bargman, who was unconscious, to call 911, the report said.\nClarrisa Woodside told Channel 9 she was Bargman’s best friend and said she was in the home when the shooting happened.\n“[I heard] ‘Pow!’ And then I ran to the room and I saw him. He was running out of the room,” Bargman’s friend Clarrisa Woodside told Channel 9. “I said, ‘What happened?’ He said, ‘Destiny just got shot.’”\nBargman died from the gunshot wound, investigators said.\nFamily and friends held a vigil Sunday for Bargman.\n\"Very bright girl. Very bright girl that died a little too soon,\" said the victim's aunt, Vostelle Williams.\nMassey was arrested and charged with second-degree murder in Bargman’s death.\n© 2017 Cox Media Group."}