{"uri": "http://www.kshb.com/news/crime/motorcycle-club-scene-of-weekend-shooting-had-no-permits-for-events-alcohol-sales", "title": "Motorcycle club, scene of weekend shooting, had no permits for events, alcohol sales", "dct": "Mon, 24 Jun 2013 16:03:00 GMT", "id": "95efd4c16cc8e699e78ac7324e9187fa", "content": "Autoplay:XMotorcycle club, scene of weekend shooting, had no permits for events, alcohol sales\nKANSAS CITY, Mo. - Kansas City police are searching for those responsible for a weekend shooting that killed one person and injured eight others at a private club Sunday morning.\nThe shooting happened around 3:30 a.m. at 1917 Prospect Ave. Members of the club said the building was the \"Redline Motorcycle Club.\"\nMarlon Randolph, 23, was killed and another woman is still on life support.\nRELATED | Shooting at KC club kills one, injures eight - http://bit.ly/15w6vtS\nThe motorcycle group says they work to promote peace advertising a \"Peace Ride\" coming up in July but the group was missing a few things Sunday.\nAccording to Kansas City Regulated Industries, the business running the after-hours \"Redline Motorcycle Club\" did not have any permits to sell alcohol, hold events or stay open past 3 a.m.\nJim Ready, Manager of the city's Regulated Industries said, \"there is a 3 o'clock license that is available as long as you meet the qualifications for that but otherwise the party stops at 3 o'clock there's nothing that's going to go on afterwards legally in the city.\"\nAl Nicholson, a member of the motorcycle club, said it's normally a fun place to be.\n\"It's pretty big inside. The front is just for dancing and you've got the back where you can lounge and hang out. It's a nice atmosphere I can't believe anything like this happened. The bike riders usually have everything under control and search the people, I don't know how they could get anything in there,\" Nicholson said.\nKansas City Chief of Police Darryl Forte said they are using their resources to find the suspect and have not looked into the licenses. However, Forte said police need more community support.\n\"You can have police all over the place. We can be out front, if someone is being unruly on the inside and failing to exercise self-control, we can't do anything,\" Chief Forte said.\nThe city now has had 45 homicides in 2013, that's two behind the number of homicides at the same time last year."}