{"uri": "http://www.kctv5.com/story/22698637/family-of-girl-clinging-to-life-after-shooting-seeks-answers", "title": "Motorcycle club, site of deadly shooting, shut down", "dct": "Thu, 27 Jun 2013 01:55:00 GMT", "id": "c5974e38501a9b2f4ad2551e970367a1", "content": "KANSAS CITY, MO (KCTV) -\nThe site of a deadly shooting that killed one person and wounded eight others over the weekend has been shut down.\nKansas City, MO, Police Chief Darryl Forte said via his Twitter account Friday morning that the motorcycle club has been shut down by city code inspectors and the fire marshal.\nThe Drug Abatement Response Team (DART) investigated possible drug activity after the Sunday morning shooting, but the prosecutor's office said nothing was found. DART did call in code inspectors who found several hazards, like faulty electrical wiring, broken smoke detectors and no place of assembly permit.\nThe Kansas City Police Department also issued a nuisance business violation which means the business is considered a public safety hazard.\nMeanwhile, the family of a 17-year-old girl shot outside the motorcycle club is seeking answers as to what led to the shooting that has their loved one clinging to life.\nChloe Johnson is said to be fighting for her life, and her family is sitting vigil at her bedside. While they were too upset to speak, a family friend who spoke on their behalf said they're all hoping for the best.\nPolice have confirmed Johnson was not the intended target of the shooting outside the Redline Motorcycle Club near East 19th Street and Prospect Avenue, but the news is little consolation to her family and friends.\n\"This tragedy has really affected and hurt a lot of people in this community due to just her outgoing personality and who she is to so many people,\" Carletta Temple said.\nJohnson was one of nine people shot outside the club early Sunday morning. Marlon Randolph, 23, the nephew of the club's owner, has since died. Police have made no arrest and so far they aren't sure what led to the shooting.\n\"That's kind of where the family is hoping that someone could speak out and help get some type of closure or some type of answers,\" Temple said.\nThe AdHoc Group Against Crime held a prayer vigil for Johnson Friday night.\n\"She's fighting for her life so, at this time, we're just asking for the community to just continue their prayers and support and leave it in God's hands,\" Temple said.\nThe prayer vigil was held at a park near 19th and Prospect about 7 p.m., close to the scene of the shootings. There was a huge show of support as family and friends gathered in a circle and prayed for her recovery. They also released balloons in her honor.\nAt the vigil, one of her aunts said she's showing some improvement.\n\"She's getting a little better but she's still needs everybody's prayer, but she's getting her strength back,\" Patricia Johnson said.\nAnyone with information about the deadly shooting is asked to call the TIPS Hotline at 816-474-TIPS.\nAdHoc also said they will help keep witnesses safe. If you want more information, call the AdHoc Office at 816-861-5500.\nCopyright 2013 KCTV (Meredith Corp.) All rights reserved."}