{"uri": "http://www.ydr.com/story/news/local/2015/11/15/12-year-old-accidentally-shot-york/75822722/", "title": "12-year-old dies in accidental shooting", "dct": "Sun, 15 Nov 2015 00:00:00 GMT", "id": "d35d219514cce534343decbc1a15484f", "content": "Ted Czech - York Daily Record/Sunday News\nYork County Coroner Pam Gay confirmed a 12-year-old boy accidentally shot Sunday morning on the 200 block of North Richland Avenue in York died hours later at York Hospital.\nThe coroner's office identified the victim as Marlin Banks Jr., 12, of the 200 block of North Richland Avenue. He was pronounced dead at York Hospital's Emergency Department at 8:12 a.m. by Deputy Coroner Steve Cosey.\nAn autopsy is scheduled for Monday at Lehigh Valley Hospital in Allentown. Following the autopsy, the coroner expects to release further details, according to the office's Twitter account.\nPolice and emergency personnel were called to the home at 7:40 a.m., according to York County 911.\nYork City Police Sgt. William Wentz said investigators are unsure whether the boy accidentally shot himself or if someone else shot him.\nBy Sunday afternoon, that piece of the investigation remained unsolved, he said.\n\"That's still to be determined,\" Wentz said.\nWentz said interviews still need to be conducted with family who were home at the time of the shooting.\nWentz said the weapon was a .40-caliber handgun, but he was not sure who owned the gun.\n\"Ownership at this point is unclear,\" he said.\nWentz said an adult male who was home during the shooting suffered a cut to his hand when he punched a wall after the boy was shot. He said the man punched the wall because he was \"upset\" over the accidental shooting.\nYork City Police are classifying the shooting as an attended death.\nWentz said a nearby stabbing on Linden Avenue was unrelated to the shooting.\n\"Additional details will be released pending notification of family,\" the coroner's office tweeted just after 10 a.m.\nContact Ted Czech at 717-771-2033."}