{"uri": "http://www.wral.com/2-year-old-shot-in-north-raleigh/14558762/", "title": "Raleigh toddler accidentally shoots self; 34-year-old charged", "dct": "Fri, 03 Apr 2015 00:00:00 GMT", "id": "54063bb548bc121ca42bf14184b5daad", "content": "Video Playback Not Supported\nPlay Video\nPlay\nMute\nCurrent Time 0:00\n/\nDuration Time 0:00\nLoaded: 0%\nProgress: 0%\nStream TypeLIVE\nRemaining Time -0:00\nPlayback Rate\n1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptions\nFullscreen\nAutoplay:\nOn / Off\nThis is a modal window.\nThis video is not supported on your platform. Please make sure flash is installed.\nCaptions Settings Dialog\nBeginning of dialog window. Escape will cancel and close the window.\nText Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps\nDefaults Done\nToddler shot in north Raleigh\nAre you still watching?\nYes, ContinueNo\nFind News Near Me\nRaleigh, N.C. — A 34-year-old man was charged Friday night after a 2-year-old boy shot himself in the face at a home in north Raleigh, police said.\nJamick Dakota Corley was charged with possession of a firearm by a convicted felon, possession of a firearm with an altered or obliterated serial number, failure to store a firearm safely to protect a minor, and contributing to the delinquency of a minor, according to police.\nAccording to authorities, the toddler shot himself in the face at about 4 p.m. at a home in the 5200 block of Evergreen Forest Way, near Capital Boulevard, in north Raleigh. Corley lives at the home, police said.\nThe toddler was taken to WakeMed but later transferred to Duke Hospital, where he was being treated for non-life-threatening injuries, authorities said.\nIn a 911 call released by authorities Saturday afternoon, a woman can be heard screaming as she tells dispatchers that the child shot himself.\n\"I heard a pop and ran upstairs and he was bleeding from the mouth,\" the woman said.\nAfter telling authorities that the child shot himself in the chin, the woman said the boy was starting to go to sleep.\n\"His eyes are getting weak. He's breathing and gurgling,\" she said.\nShortly after law enforcement officials arrived at the home, the caller said that the boy was awake and talking.\nDanny Royale lives in the neighborhood. He said the child was quickly rushed out of the home.\n\"The infant was only wearing diapers and they rushed out of here so fast. We didn't know what was happening,\" Royale said.\nIt was not immediately clear if Corley was related to the toddler. Corley was being held in the Wake County Detention Center.\nAn investigation of the incident is ongoing."}