{"uri": "http://www.ajc.com/news/news/breaking-news/two-indicted-for-killing-baby-in-dekalb-home-invas/nhDpm/", "title": "Two indicted for killing baby in DeKalb home invasion", "dct": "Tue, 02 Sep 2014 00:00:00 GMT", "id": "536e49d45602d168c9f8a64c146abff1", "content": "Two gang members accused of killing a 9-month-old boy in May have now been indicted on eight charges that include murder and aggravated assault.\nMarco Watson, 36, and Devin Thomas, 18, both members of the Bloods street gang, were already in the DeKalb County Jail for an unrelated crime when they were charged a month after the May 10 home invasion during which KenDarious Edwards Jr. was killed and the baby’s mother, grandmother and a family friend were critically wounded.\nThe series of violence started at a May 3 party, leading gang members to retaliate against each other and to kill a witness, according to charges.\nThe first fatal shooting in May was during a party at the Mountain Lake apartments where people were gathered to watch a Floyd Mayweather championship fight. Some of the guests were not invited.\nWhile the fight was on the television inside one of the garden apartments, some of the party-goers took their drinking and socializing outside into a grassy area.\nEventually there was an argument and 29-year-old Michael Phillips, though his hand were raised in surrender, was shot in the head.\nA week later, a potential witness to Phillips’ shooting was found dead.\nOslushla Smith, 19 and known to fellow gang members as Budda or Boo, and Cutrez Johnson, 16, known as Lil Red, were charged several weeks ago with killing Phillips at the May 3 party and with killing Alexis Malone, the witness, seven days later.\nAnother woman, Kayla Dixon, 19, is also charged with murdering Malone, who was a friend of Thomas. Dixon was indicted in early August.\nJust a few hours after an anonymous tip led police to Malone’s body on Agape Way in DeKalb County, men wearing bandanas to hide their faces kicked in the back door of the home on Lani Farm Road. Three terrified women inside grabbed the baby, ran upstairs and tried to lock themselves into a bathroom, but the gunmen kicked it in and fired at them multiple times.\nThe baby was Smith’s nephew.\n“This senseless act ended the life of an innocent child,” DeKalb County District Attorney Robert James said in a statement. “Far too often we see the impact of gang violence and other mindless acts of terror spilling into our schools, neighborhoods and even our homes.”"}