{"uri": "http://www.local10.com/news/crime/16-year-old-killed-1-injured-in-miami-shooting", "title": "16-year-old killed, 1 injured in Miami shooting", "dct": "Tue, 22 Nov 2016 22:29:00 GMT", "id": "86b9dbe853e2eda27524bd5b590a8310", "content": "MIAMI - A 16-year-old who was shot multiple times Tuesday night in Miami has died, police said.\nThe shooting was reported about 8:30 p.m. near Northwest 17th Avenue and Northwest 31st Street.\n\"It breaks my heart because I have grandchildren, great grandchildren, and it's a life,\" Elsie Figueroa, who knew the victim, said.\nAccording to police, two friends were walking in the area when they were confronted by two males, who are possibly juveniles.\nPolice said both males pulled out gun and fired at the victims, striking one of them multiple times. A bystander, who was not related to the victims, was struck once in the arm.\nThe teenager, identified as Damien Ramirez, was taken to Jackson Memorial Hospital in critical condition. He was pronounced dead a short time later.\n\"Five bullets hit him,\" Figueroa said. \"I don't know if they know who did it (or) why they did it, but he was not into gangs. He was not into drugs. He was a good 16-year-old boy.\"\nThe person who was shot in the arm was also taken to JMH in stable condition and is expected to make a full recovery.\nMiami-Dade County Public Schools superintendent Alberto Carvalho called out to the community to come forward with information about the shooting. He said there is no excuse for violence in the community to continue.\n\"We've lost dozens of kids, school-aged kids, over the past few years to gun violence and it must stop,\" he said.\nOur community, once again, grieves over the senseless shooting of a 16-year old child in Miami. Stop the cowardly code of silence. #Enough\n— Alberto M. Carvalho (@MiamiSup) November 23, 2016\nNo information about the shooter was immediately available.\nA motive remains unknown.\nAnyone with information about the shooting is asked to call Miami-Dade Crime Stoppers at 305-471-TIPS.\nCopyright 2016 by WPLG Local10.com - All rights reserved."}