{"uri": "http://www.seattletimes.com/seattle-news/crime/sheriff-idaho-child-dies-after-accidentally-shooting-himself/?utm_source=RSS&utm_medium=Referral&utm_campaign=RSS_seattle-news", "title": "Idaho boy, 6, dies after accidentally shooting himself, sheriff says", "dct": "Mon, 08 Aug 2016 09:56:00 GMT", "id": "dc006e56962a6c1bb5675dc29d7cc9fc", "content": "WEISER, Idaho — Law-enforcement officials in southern Idaho say they believe a child accidentally shot and killed himself while playing with a gun over the weekend.\nWashington County Sheriff Matt Thomas says the 6-year-old boy died Saturday afternoon in Weiser.\nAccording to Thomas, the boy went inside the home while his mother and her boyfriend were working outside. The child found the gun in the bedroom and started playing with it when it fired. A bullet hit the boy in the head.\nNo charges have been filed in connection with the death although an investigation has been launched. Officials have not released the boy’s name or what kind of gun was involved.\nPlay VideoPlayMuteCurrent Time 0:00/Duration Time 0:00Loaded: 0%Progress: 0%Stream TypeLIVERemaining Time -0:00Playback Rate1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptionsAudio TrackFullscreen\nThis is a modal window.\nCaptions Settings Dialog Beginning of dialog window. Escape will cancel and close the window. Text Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps Defaults Done"}