{"uri": "http://www.wibw.com/content/news/Multiple-shots-fired-at-Topeka-motel-Law-enforcement-have-area-blocked-off-376872351.html", "title": "FBI: Task Force trying to capture Orlando Collins at time of shootout, large fire; Body found", "dct": "Sat, 23 Apr 2016 22:42:00 GMT", "id": "03a3be6c53d3ba8ed0abdb33a7190a59", "content": "TOPEKA, Kan. (WIBW) -- The U.S. Marshals Service Fugitive Task Force was trying to capture Orlando Collins at the time of a shootout that injured three federal agents, the FBI confirms. A large blaze following the gunfire destroyed the motel where it occurred.\nThe 28 year-old suspect was on the Northeast Kansas Most Wanted List when investigators determined he may be at the Country Club Motel and went there Saturday to arrest him. Collins had been linked to armed robberies that occurred as recently as the day before and was considered armed and dangerous.\nThe FBI said a body was found inside the motel room where Collins was believed to be, but they have not identified it. Sunday night, an FBI spokesperson confirmed the unidentified body has been released to the Shawnee County Medical Examiner.\nTwo Deputy U.S. Marshals and an FBI agent were wounded during the firefight, suffering non-life threatening injuries. The hotel had been evacuated and no one else staying there was injured, the FBI said.\nAccording to the FBI, the Task Force was serving an arrest warrant for Collins at the motel, 3732 SW Topeka Blvd., around 10:00 p.m. when gun fire erupted as they approached the hotel room door. Witnesses told 13 NEWS they heard dozens of shots fired.\nDuring the barrage, a fire started in the room and spread to envelop the entire motel. Authorities described it as a total loss.\nThe FBI is still processing the crime scene, while ATF and the fire marshal are conducting the fire investigation. The Topeka Police Dept., Shawnee Co. Sheriff's Office, and Kansas Highway Patrol are assisting with the investigation.\nThe U.S. Marshals Service Fugitive Task Force is comprised of members of the TPD, Shawnee Co. Sheriff's Office, FBI, and Marshals Service.\nCollins was already on the Northeast Kansas Most Wanted list and was being sought on charges of Attempted Aggravated Robbery and two counts of Criminal Damage to property when police say he robbed a store in the 100 block of SW 37th St., early Friday afternoon.\nHe had reportedly stolen a 2011 Nisssan Sentra and about 15 minutes after the robbery, authorities found the getaway car had been set on fire in the 1000 block of SE Vine.\nCollins had already been identified as a person of interest in recent armed robberies at the Brookwood Dillon's store and an area Kwik Shop. Authorities found a 1996 Audi on fire following that incident.\nNOTE: Initial reports from authorities indicated there were four federal agents wounded. Following an update from the FBI that number has been reduced to three."}