{"uri": "http://www.delcotimes.com/general-news/20150503/cops-teen-critically-wounded-after-shooting-himself-with-sawed-off-shotgun", "title": "Cops: Teen critically wounded after shooting himself with sawed-off shotgun", "dct": "Mon, 04 May 2015 02:59:00 GMT", "id": "b1fa8765d604940d068e6b18ec4ecada", "content": "UPPER DARBY >> A 16-year-old Chester youth, who police believe almost blew off his foot with a sawed-off shotgun, remains hospitalized Sunday in critical condition.\nThe youth was found in an alleyway on the 7000 block of Ruskin Lane at 10:30 p.m. on Saturday.\n“We initially received a 911 call for a report of shots fired in the vicinity of Guilford and Littlecroft roads and police responded” to the Stonehurst Hills section, Police Superintendent Michael Chitwood said. “Next we received a call for a hospital case in the alley on Ruskin Lane within a block of the shots fired call. We found a male who was shot in the foot, the ankle area, at close range. He was shot one time. We found the wadding from the shell casing in his shoe. Right now it looks like it was self-inflicted.”\nThe youth was transported to Children’s Hospital of Philadelphia in critical condition for emergency surgery.\nAdvertisement\nAccording to Chitwood, police reported the youth was in the company of two boys who ran off when the sawed-off shotgun was fired.\n“We don’t know who they are but would like to talk to them,” Chitwood said. “We haven’t been able to talk the boy yet. He’s still unconscious. He almost blew off his foot.”\nPolice found the stock of the gun next to the boy’s body.\n“We didn’t find the barrel of the gun,” Chitwood said. “My question is, what was a 16-year-old boy from Chester doing in Upper Darby at 10:30 at night with a sawed-off shotgun? Why? Add that all up and it’s not good. We’re still investigating.”\nAnyone with information should call police at 610-734-7677."}