{"uri": "http://www.news4jax.com/news/jso-swat-team-responding-to-a-call-in-moncrief-park", "title": "Person of interest in mass shooting arrested after SWAT standoff", "dct": "Wed, 16 Nov 2016 08:16:00 GMT", "id": "6de461f7c3029c7d7c70e31846d27917", "content": "JACKSONVILLE, Fla. - The boyfriend of one of the victims of Sunday's mass shooting in Northwest Jacksonville was arrested Wednesday after a SWAT standoff in the Moncrief Park area.\nPolice said David Anderson, 21, has been identified as a person of interest in the deadly shooting that left his girlfriend, 18-year-old Xacia Burnem, dead. Kadejah Williams, 22, and her son, 11-month-old Tedashii, were also killed. Two other people were wounded but survived.\nBurnem's mother confirmed to News4Jax on Wednesday that her daughter was pregnant when she was killed.\nPamela Williams said she and her family were devastated again when they learned of Burnem's pregnancy.\n“What about my unborn grandbaby?” she said.\nAnderson has not been charged in connection with the triple murder.\n“This has brought forth a lot of assistance from the community,” Sheriff Mike Williams said Wednesday. “We've gotten lots of cooperation from the community. We would ask that that continue. We still have lots of pieces of the puzzle to put together.”\nRELATED: Police seek help to ID witnesses from mass shooting surveillance video\nAnderson was identified by witnesses and information developed during the investigation as a person who was at the mass shooting scene Sunday night with a weapon, Sheriff Williams said. That led to an arrest warrant for Anderson on the charge of possession of a firearm by a convicted felon.\n\"They want to make sure that he is the actual person involved and by calling him a suspect, people may decide not to come forward because people tend to think, 'Now they have a suspect, I don't need to come forward and give information,\" said Gil Smith, News4Jax crime and safety analyst.\nAccording to the arrest report, the handgun Anderson had was discharged Sunday night, but no details were provided about whether his weapon was involved in the fatal shootings.\nVictim's mother helps resolve standoff\nPolice initially looked for Anderson at his listed address on West 10th Street, but he wasn't there, according to neighbors.\nPolice then learned Anderson might be on West 29th Street and came to arrest him about 7:30 a.m. Wednesday. Anderson barricaded himself in a home that was between Wilson Street and Myrtle Avenue.\nAnderson was believed to be armed and dangerous and made suicidal threats, so the SWAT team was called in, JSO spokeswoman Officer Melissa Bujeda said.\n“Whenever you have someone with a warrant inside making suicidal threats toward themselves, police have to take every measure possible to make it a safe situation for everybody,\" Bujeda said. \"With him having a warrant of possession of a firearm by a convicted felon, the likeliness of him being armed is very high, so we took every precautionary measure possible to make it a safe resolution for everybody.”\nOne measure police took was to contact Pamela Williams at Anderson's request.\n“He said he wanted to come out and surrender, but he wanted to hear my voice,” Pamela Williams said.\nVIDEO: Family of victims speak about arrest\nShe said she rushed over to the Moncrief Park neighborhood, where Anderson was barricaded, and police had her record a video statement for Anderson.\nA little while later, he came out of the house, surrendered and was taken into custody. He was the only person in the home, and no one was injured in the SWAT standoff, Bujeda said.\nPamela Williams said the she had no idea who Anderson was or what his connection might be to the shooting, but she believes he wants to get something off his chest.\n“For him to even ask to speak to me, you must want to tell me something,” she said. “If the guy knows something, I, at least, want him to have a chance to be able to tell what really happened.”\nShe said her next step is to lay her daughter to rest as she waits to learn the truth about Sunday night. She has set up a GoFundMe account to raise money for funeral expenses.\nWilma Alexander, the grandmother of Kadejah Williams and great-grandmother of Tedashii, also wants answers, but holds onto hope that someone will come forward with information.\n\"I always had a feeling, and I still do, that they are going to catch this person. No doubt in my mind. I have faith in my mayor and faith in my police department and I see them as a helping hand to me. They truly have been a helping hand to me and my family,\" Alexander said.\nAlexander said there are no words to describe the feeling when she learned she would never see her granddaughter's smiling face again or hold Tedashii in her arms, but knows Pamela Williams is in just as much pain.\n\"I can say I know how you feel,\" Alexander said. \"My heart goes out to her. I know she's grieving just like we are.\"\nStill seeking answers\nPolice said that after he was taken into custody, Anderson declined to cooperate with them and banged his head repeatedly on the cage of the police car to try to injure himself. Rescue workers responded and evaluated Anderson, who made more suicidal threats and was taken to the Duval County Jail.\nIn the mugshot JSO released of Anderson, he is wearing a red jumpsuit, an indication that he is on suicide watch. His head is also being held up by two officers.\n\"It tells that he's really struggling. He's feeling really bad about something, more than likely, about the shooting,\" Gil Smith said about the mugshot.\nAnderson was previously arrested in 2014 for possession of marijuana, assault on a police officer, resisting police, and possession of a firearm by a delinquent adult. He served two years in prison and was released on July 16 of this year.\nSheriff Williams said that police believe multiple witnesses at the scene of the mass shooting have not come forward yet to provide information in the case.\nVIDEO: Sheriff gives update on mass shooting\n“If there is anybody else with additional information that can shed any more light on the situation, we would ask them to come forward and give us information,\" he said. “We need more help closing this loop and completing this investigation, so we're asking the community for that help.”\nThe sheriff said that many of the community's ministers have opened their sanctuaries to provide a safe haven for any witnesses and have been a conduit of information for police.\nAnyone with information can also call Crime Stoppers anonymously at 1-866-845-TIPS and could be eligible for a cash reward. Police said it's important to know that even when a reward is collected from Crime Stoppers, the tipsters remain anonymous, and police never know who submitted the tip.\nCopyright 2016 by WJXT News4Jax - All rights reserved."}