{"uri": "http://www.denverpost.com/2016/12/27/nathaniel-griego-reckless-gun-death/", "title": "Colorado teen who died after being shot by friend in reckless gun incident identified", "dct": "Tue, 27 Dec 2016 14:22:00 GMT", "id": "ce7499219ec0330b0910649cc79e2978", "content": "Authorities have named a 14-year-old boy who was fatally shot by a friend in Jefferson County on Friday in what authorities are calling a “terribly tragic story.”\nNathaniel Griego, who lived with his grandparents in a Jefferson County neighborhood, died Monday, three days after he was shot, according to Mark Techmeyer, spokesman for the Jefferson County Sheriff’s Department. Griego was a freshman at Dakota Ridge High School.\n“Everyone is stunned,” Techmeyer said. “There was no deliberation, no pre-planning, no premeditation, no intent to kill.”\nThe 15-year-old suspect is being held at the Mountain View Detention Facility for investigation of a possible charge of suspicion of reckless manslaughter and being a juvenile in possession of a handgun, Techmeyer said. He declined to name the suspect because he is a juvenile.\n“They were good friends,” Techmeyer said. “One of them got a hold of a gun and the result is we’ve got a dead boy.”\nThe incident happened Friday afternoon around 3 p.m. inside a home near West Bowles Place and South Simms Street. The suspect had possession of a gun owned by one of the families.\nTechmeyer said he is not releasing details about the circumstances that led to the shooting.\nAfter shooting his friend, the suspect took the handgun he used and ran from the house, Techmeyer said. He ditched the gun on one of the hogback ridges near C-470 and Bowles Avenue.\nTechmeyer said because he ditched the gun, the teen is also being investigated for tampering with evidence. After his arrest, the boy led deputies to the location where he hid the gun.\n“He talked with investigators. We have no concerns there was anything else that was going on,” Techmeyer said. “This type of situation — everyone involved had their life altered in some way.”\nOfficials at Dakota Ridge High School said they will have support staff available to students on the afternoon of Jan. 5 when the staff returns from winter break and again on Jan. 9 when students return from the break.\nA gofundme page has been set up to help the family pay for funeral arrangements.\nSponsored Links\n.\nElvenar - Free Online GameWomen: Have You Tried this Addictive Game Yet ?Elvenar - Free Online Game\nGreeningzGeorge W. Bush's IQ Is Insanely HighGreeningz\nHome Solar QuotesThinking About Going Solar In 2017? Read This FirstHome Solar Quotes\nPrimal Plants Supplement - Gundry MDThis Simple Skin Fix May Surprise YouPrimal Plants Supplement - Gundry MD\nTophatterThe Most Addicting Shopping Site For WomenTophatter\nTruthFinder People Search SubscriptionType in Any Name, Wait 15 Seconds, Brace For ResultsTruthFinder People Search Subscription"}