{"uri": "http://www.usatoday.com/story/news/nation/2013/08/28/workplace-shooting-florida/2712227/", "title": "Third victim dies after Florida mass shooting", "dct": "Wed, 28 Aug 2013 00:00:00 GMT", "id": "f103b5909b0a4d04f6ca83649b4f31c1", "content": "WTLV- and WJXX-TV, Jacksonville, Fla.\nLAKE BUTLER, Fla. — A third man, shot in the stomach Saturday by a former trucking company employee who went on a rampage, has died from his wounds.\nDavid Griffis, 44, who had been in critical condition after shooter Hubert Allen Jr., 72, shot four co-workers from Pritchett Trucking Company in this northern Florida community about 50 miles southwest of Jacksonville, succumbed to his wounds Tuesday, Union County sheriff's officials said.\n\"I'm very well heartsick because he was a friend of mine,\" Ricky Waller said. \"He was always very cheerful and a hard working man who loved his family -- and his friends. And he was a friend to me,\"\nThe Rev. Patrick Maxwell of Victory Christian Center said even family members do not know why Allen went on the shooting spree. Allen's daughter and grandchildren are members of Maxwell's church.\nOn Saturday, Allen drove to a location owned by his former boss, Marvin Pritchett, the trucking company's founder. He shot and killed former co-worker Rolando Gonzalez-Delgado, 28, around 9 a.m., then went a short distance and killed Pritchett, 80, who began the company in 1980. At one time Allen, the step-grandfather of Buffalo Bills running back C.J. Spiller, was considered his top assistant.\nA few minutes later, Allen saw another former co-worker, Lewis Mabrey Jr., 66, driving a farm tractor, exchanged words with him and fired a shotgun, authorities said. Mabrey was released from the hospital Tuesday.\nAllen then went to company headquarters here and shot Griffis.\nAfterward, Allen went home and killed himself. Deputies recovered a .22-caliber rifle, a .410-small-bore shotgun and an unfired .32-caliber handgun.\nWaller said he'll focus on the positive and the good times he had with Griffis.\n\"He was just always smiling,\" Waller said. \"He didn't deserve what he got.\"\nPritchett Trucking, which employs 400 people and owns hundreds of vehicles that operate nationwide, released a statement on Griffis' death.\n\"David was a remarkable man who personified true work ethic and integrity and who was an integral part of our company-and of our lives,\" company officials said. \"David will always be a part of our family.\"\nAllen left behind a list of people he intended to kill. One person on the list wasn't shot and was never in danger, said Lt. Lyn Williams, a Union County Sheriff's Office spokesman.\nBefore a Tuesday service honoring the victims, Maxwell said the service had a clear purpose.\n\"We hope that we're able to come together and this will be an outpouring of love from person to person, that there will be an increase in love in parts our community and there be no ill will whatsoever,\" he said. \"And that is our prayer for tonight.\"\nContributing: The Associated Press"}