{"uri": "http://thepolicenews.net/default.aspx?act=Newsletter.aspx&category=News+1-2&newsletterid=64142&menugroup=Home", "title": "Follow-Up to Investigation into Active Shooter Incident at 4000 Law Street", "dct": "Wed, 19 Oct 2016 21:24:12 GMT", "id": "2744619291b1f84a7927cd1e03562d7f", "content": "FOR IMMEDIATE RELEASE\nFollow-Up to Investigation into Active Shooter Incident at 4000 Law Street\nHouston police continue to investigate an active shooter incident in which HPD, Bellaire Police and West University Place Police officers discharged their duty weapons at a suspect who shot or caused injuries to nine people at 4000 Law Street about 6:30 a.m. on September 26.\nThe suspect, Nathan Desai (w/m, 46), suffered multiple gunshot wounds and was pronounced dead at the scene.\nNone of the officers who discharged weapons was injured in this incident.\nThe HPD officers who discharged their weapons are:\nSergeant G. Batcheler, sworn in in February 1986 and assigned to the Central Patrol Division\nSenior Police Officer B. Schmidt, sworn in in September 1993 and assigned to the Tactical Operations Division\nOfficer M. Muskiet, sworn in in January 2008 and assigned to the Central Patrol Division\nThe Bellaire Police Department officers who discharged their weapons are:\nLieutenant R. Brown, start date February 1994 and assigned to Information Management/Dispatch\nThe West University Place Police Department officer who discharged his weapon is:\nHPD Homicide Division Sergeant M. Brady reported:\nPolice were called to the scene following reports that the suspect, Desai, who was armed with a pistol, was standing on the sidewalk at the above address shooting at cars driving in the area. Nine citizens were shot or suffered various injuries, none fatally.\nOfficers from the Houston Police Department, Bellaire Police Department and the West University Place Police Department responded and almost immediately were fired upon by Desai. The suspect used a tree as cover and took advantage of the dark lighting to continue exchanging gunfire with officers for almost 30 minutes. The officers, taking tactical positions and engaging the suspect, were able to prevent him from leaving his position and doing more harm or from retrieving a rifle and hundreds of rounds of ammunition in his vehicle parked nearby.\nAt the time of the incident, the suspect was wearing a replica World War II German SS general’s uniform. A search of his apartment resulted in the recovery of additional weapons, ammunition and body armor.\nThe suspect has no known history of mental health issues and no known criminal history. He did have a current Texas License to Carry a Handgun (LCH).\nAs is customary when an officer discharges a weapon in the city limits, causing an injury, this case is being investigated by the HPD Homicide and Internal Affairs Divisions as well as the Harris County District Attorney's Office.\nKJS/MMB/JFC 10-19-16\nInc #123203516\nPost a comment\nName/Nickname:\n(required)\nEmail Address: (must be a valid address)\n(will not be published or shared)\nComments: (plain text only)"}