{"uri": "http://www.nbcwashington.com/news/local/Prince-William-Police-Investigation-Shooting-370388531.html", "title": "Family, Community in Mourning After Officer's Death", "dct": "Sun, 28 Feb 2016 00:00:00 GMT", "id": "681f8e4fc79aee62c6d01e0b8e654b3d", "content": "More than 100 patrol cars lined the roads outside Inova Fairfax Hospital in Northern Virginia early Sunday morning to stand vigil and provide escort to the medical examiner for the body of a slain Prince William County police officer.\nPrince William County police say Officer Ashley Guindon, 28, was shot and killed Saturday responding to a domestic violence call in Woodbridge, Virginia. A woman was also killed and two other officers were injured in the shooting.\n“It is a sad day for everyone in this room. A sad day for law enforcement,” Prince William County police Chief Stephan Hudson said during a news conference Sunday. “We extend our condolences to Ashley’s mother and extended family.”\nHudson said the woman killed in the domestic dispute was Crystal Hamilton, the wife of the alleged shooter, identified as 32-year-old Ronald Hamilton. He said she was apparently shot and killed before the officers arrived.\nHamilton is being held without bond in the Prince William County Adult Detention Center on charges that include murder of a law enforcement officer. He is an active duty Army staff sergeant assigned to the Joint Staff Support Center at the Pentagon, according to Cindy Your, a Defense Information Systems Agency spokeswoman based at Fort Meade, Maryland.\nThe two injured officers were identified as Officer David McKeown, 33, and Officer Jesse Hempen, 31. They are currently being treated at INOVA Hospital, and Hudson said both have a long road ahead for their recovery.\nAccording to Hudson, Guindon went through training with the department last year before leaving for personal reasons. She rejoined the department this year and had been sworn in as an officer on Friday. She was on her first shift Saturday when she was shot.\n\"We were struck by her passion to do this job,\" Hudson said. \"She did share with us when we rehired her that she felt like she wanted to do this job. She couldn't get it out of her blood.\"\nHudson thanked the community and surrounding jurisdictions for their support. He said the Prince William County Police Department was in very “deep mourning” over the loss of Guindon.\nAccording to a police press release from June 2015 when Guindon graduated from basic recruit school, she was a graduate of Embry Riddle Aeronautical University in Daytona Beach, Fla.\nShe served in the U.S. Marine Corps Reserve and has family in law enforcement, the press release said.\nThe principal of Merrimack High School said a moment of silence will be held in honor of Guindon, qho was a 2005 graduate of the high school.\nPrincipal Ken Johnson said in a letter to the school board and staff that he had \"sad and tragic news, the loss of a student.\"\nThe shooting happened around 5:30 p.m. in the 13000 block of Lashmere Court in Woodbridge, Virginia. Neighbors reported hearing several rapid gunshots ring out as young people played outside.\n\"We heard three to four gunshots, so we started running, and then when we got up here we saw all the cops,\" said one young witness, who asked not to be identified. \"They told us to go inside.\"\n\"I can't believe this is my neighborhood,\" said neighbor Saher Jan. \"I was just in front of that house. I just couldn't imagine that it happened right there. They seemed like nice people.\"\nHudson said the officers were fired upon after responding to a domestic disturbance call. He said after other officers arrived, Hamilton surrendered to police.\nThe three officers who were shot were transported to INOVA Hospital. Hudson said Guindon passed away during treatment.\nOfficers found the body of Crystal Hamilton inside the home, Hudson said, adding that law enforcement officials also found an 11-year-old boy inside. He was unharmed.\nAs Guindon was sworn in on Friday, Prince William County police tweeted a message of welcome to her and another new officer. Featuring a photo of the two rookies in uniform, the tweet read, \"Be safe!\"\nWelcome Officers Steven Kendall & Ashley Guindon who were sworn in today & begin their shifts this weekend.Be safe! pic.twitter.com/92c2YLjcQx\n— Prince William Co PD (@PWCPoliceDept) February 26, 2016\nOn Sunday, the department tweeted a photo of Guidon's police cruiser embellished with bows and a wreath. The caption read: \"Blessed are the peacemakers, for they will be called children of God. #RIPAshleyGuindon.\"\n\"Blessed are the peacemakers, for they will be called children of God\". #RIPAshleyGuindonpic.twitter.com/AyG7NmYDNt\nThe death of Ashley Guindon was just the latest tragedy to strike the family. Her father, David, committed suicide upon returning from Iraq, where he served with the New Hampshire Air National Guard.\n\"He came home and took his own life,\" said Dorothy Guindon, Ashley's grandmother.\nShe said Ashley was born in Springfield, Massachusetts. The family later moved to Merrimack, New Hampshire.\n\"This is really a shock to us,\" Dorothy Guindon said. \"Ashley was such a nice person.\""}