{"uri": "http://www.wrcbtv.com/story/29392336/crime-stoppers-two-years-since-demetrius-davis-was-murdered", "title": "Crime Stoppers: Family of Demetrius Davis waits for justice in 2013 homicide", "dct": "Wed, 24 Jun 2015 02:06:00 GMT", "id": "f9167992964c5139b3aca0bf03ae31c2", "content": "CHATTANOOGA, TN (WRCB) -\nMona Davis' 19-year-old son Demetrius, \"Meechy\" to his family, was shot and killed two years ago. Thus far, the investigation has yielded naught.\n\"We want justice, she said. \"We want answers.\"\nThey gathered at his resting place on the anniversary of his death to remember the Howard High School graduate and Volkswagen employee.\n\"He was a hard worker and he was a good son,\" Mona remembered. \"I didn't have any trouble out of him other than the typical teenager.\"\n\"We have no indication that he was doing anything wrong,\" said Chattanooga Police Sgt. Michael Wenger. \"He was hanging out in the parking lot and was gunned down at the early age of 19.\"\nIt was late June 23, 2013. Davis and friends had been at an after hours nightclub on Dodds Avenue when an argument closed the place down.\n\"There were clearly multiple people on the lot that night, as many as 50 or more,\" Wenger explained, \"And we haven't had anyone call in, thus far, to give us information.\"\nShots were fired at Davis as he and three others were sitting in a car, but not in a drive-by fashion that has become so prevalent in Chattanooga.\n\"In this case, it was an actual individual standing in the parking lot across from the shooter,\" said Wenger. \"So the suspect should have been clearly visible to the people of the community that were out there.\"\nThere were many potential eyewitnesses to the murder, but still no one has provided an explanation to police or to the family.\n\"You know, it's been very, very hard,\" Mona Davis said. \"We haven't had any answers, any leads. We just want someone to reach out and let us know that they care you, care about your community. We need to come together.\"\nIt is a community shared by many.\nSgt. Wenger added, \"We believe that this is our community and that we, we along with the people that live here and have to deal with that, need to find a way to solve these crimes.\"\nIt's a time for unity against the lawless.\n\"There's too many killings going on around here and no one's coming together to solve these crimes with our, these young men,\" said Davis. \"It's senseless and it tears families apart on both ends.\"\nIf the civic responsibility does not speak to you, maybe up to $1,000 reward cash does. If you are scared the wrong people will find out you told, do not be. We will never ask your name.\nCall Crime Stoppers: 423-698-3333.\nHelp turn the tide against the criminals in our neighborhoods and give this family some answers."}