{"uri": "http://fox59.com/2016/07/26/impd-to-provide-update-on-officer-injured-in-shooting-suspect-killed-after-pursuit/", "title": "IMPD: Officers fired 200 rounds during exchange with suspect in officer’s shooting", "dct": "Tue, 26 Jul 2016 13:29:00 GMT", "id": "b4392139d6c8c853abac5846874d10b0", "content": "INDIANAPOLIS, Ind.-- The Indianapolis Metropolitan Police Department provided an update Tuesday regarding an officer-involved shooting that occurred Monday evening.\nAround 6:37 p.m. Monday, the one-year veteran officer reportedly stopped the suspect’s vehicle at the Marathon Gas Station at 7100 Georgetown because it matched the description of a vehicle involved in an armed robbery on July 21.\nThe officer requested backup and approached the vehicle. Police say that’s when the driver, Jeff Tyson, became “belligerent,” would not identify himself and began rolling up his window, ignoring the officers’ commands.\nPolice said Tyson matched the description of the suspect in that armed robbery, but it is unclear if he was actually involved at this point.\nVideo of the moments at the gas station surfaced online, but was later deleted. A second video was also deleted.\nPolice said the video shows officers clearly giving commands and Tyson not complying. IMPD says he slapped officers' hands away as they tried to unlock his car door.\nA female passenger bailed out of the car is either the girlfriend or wife of the suspect, police said. She was taken into custody to be questioned. Police have not said if she’s been arrested or charged.\nThe officers fired pepper balls into the car to subdue him and Tyson sped off.\nA pursuit began, and Tyson fired shots and struck an officer after performing a U-turn on Georgetown Road. A second officer was injured by debris.\nIMPD said Tyson fired multiple times during the pursuit, but police did not fire back until the chase ended.\nTyson exited the car at Newton Street and Rural Street and fired into an occupied IMPD vehicle. Nobody inside the vehicle was injured.\nAn officer in the car took cover and began returning fire. The ensuing gun battle ended with 16 officers firing 200 rounds. An additional 24 officers were on the scene. Tyson was killed.\nInvestigators are still working to determine how many shots Tyson fired during the incident.\nSome reports indicated Tyson was armed with a rifle, but IMPD has not been able to confirm that information. A handgun was recovered at the scene of the final shootout.\nThe officer who was shot was released from the hospital. His injuries were non-life threatening.\nIMPD released audio of the radio traffic during the incident. Listen to it here.\nTyson's family issued this statement regarding the videos posted online:\n“Now we hear that it was pepper balls but never saw a pepper ball pierce a car!!! But what we feel is very important to know is that JT was our family and he’s so much more than the criminal record and the public smears he’s getting right now!!! He was a good husband, brother, uncle and friend to us all that were in his life and the world will never know how special and great he was to a lot of people. Nobody knows how he came to my house EVERYDAY to be a part of my kids life. To wrestle and play with them and to teach them about life and man things that I can’t teach my boys and he took time out of everyday to be here and me, my children and friends will never be the same without him. He was not the person he’s being painted to be!!!! He was a gift to me and my kids and anyone that was blessed enough to be able to spend time around his amazing personality. He had a laugh and smile that would light up a room. And he was my family and I love him and will miss him forever.”"}