{"uri": "http://www.11alive.com/story/news/2015/02/07/multiple-people-shot-in-douglas-county/23048925/", "title": "Father shot ex-wife, children after fight over money", "dct": "Tue, 10 Feb 2015 00:00:00 GMT", "id": "6e4592f6126e81bf4774c6966e991f8b", "content": "DOUGLAS COUNTY -- Investigators say the shooting that ended five lives and critically injured two others started with a fight over taxes and child support.\nDouglas County Capt. Bruce Ferguson shared the horror of responding to the scene on Willow Tree Circle Saturday afternoon: \"I'll be honest with you picking up that 7 year old and putting her in that body bag is….I gotta stop thinking about it, lets put it that way.\"\nThe bodies of three adults and two children were found dead inside and on the street near the family's home on Willow Treet Circle in in Douglas County.\n\"It tears at your heart. It doesn't make any sense,\" said Lt. Glenn Daniel of the Douglas County Sheriff's Department.\n(Photo: Fulton Co. Sheriff's Office)\nPolice say Cedric G. Prather, 33, shot six people before killing himself. Investigators say he shot his ex-wife, Latoya Andrews, and her boyfriend 33-year-old Joseph Terry Brown. He also shot and killed two of the children he and Andrews had together: seven-year-old daughter London Prather and nine-year-old son Jerimiah Prather. Fifteen-year-old Demesha Owens was also shot, but survived. She is Andrew's daughter but was raised by Prather. Seven-year-old Jada Brown, the daughter of Andrews, also survived the shooting. Another teenage boy, 13-year-old Jarrod Prather, was not at the home at the time of the shooting.\nDemesha Owens underwent facial surgery on Monday and was listed in stable condition on Tuesday. Jada Brown was also listed in stable condition on Tuesday.\nPrather was Andrews' ex-husband; she lived in the home with their children and her boyfriend. The two divorced about five years ago after being married eleven years. The Douglas County Sheriff's Department said they haven't found any evidence of domestic violence at the home in the years leading up to the shooting. 11Alive uncovered a booking photo of Prather from 2007 when he was charged with robbery by force/ intimidation.\nPolice said Andrews and Prather fought over taxes and child support costs in the weeks leading up to the shooting. \"All I can say is he snapped or he had enough,\" Douglas County Sheriff Capt. Bruce Ferguson said.\nFerguson said Prather was on the phone with a friend at the time of the shooting. \"My understanding he was trying to talk him out of it, trying to calm him down,\" Capt. Ferguson said.\n\"Inside the home, I could see the wife was on the floor and a man was still moving,\" said neighbor Andrews Ansah.\nAnsah said the 7 and 8 year old were always playing with his own children.\n\"We just had the little girl and boy over yesterday. My son and daughter are their same ages,\" said Ansah\nInvestigators said Prather purposely parked his car up the hill away from the home, walked up to it and started shooting. His car was later towed away as a piece of evidence."}