{"uri": "http://www.nydailynews.com/news/national/3-men-arrested-milwaukee-girl-5-fatally-shot-head-article-1.2404625", "title": "3 men arrested after 5-year-old Milwaukee girl shot dead sitting on grandfather’s lap", "dct": "Tue, 20 Oct 2015 15:38:00 GMT", "id": "27ee2e7f1bf17a478281639f434f0d9e", "content": "Three suspects have been arrested in connection with the horrific killing of a 5-year-old Milwaukee girl who was shot in the head nearly a year ago while sitting on her grandfather's lap, authorities said Tuesday.\nLittle Laylah Petersen's reeling family finally got a sense of closure after the senseless shooting last November shook cops and the entire city.\nThe girl was watching TV at her grandfather's house when police say two callous gunmen seeking revenge fired a barrage of bullets into the wrong home.\n\"Last night, I got the first peaceful night of sleep that I've had in a very long time, and I would just like to thank (the police) from the bottom of my heart for finally bringing some justice for Laylah,\" Laylah's father R.J. Petersen said Tuesday at an emotional news conference.\nPaul Farr, 24, and 20-year-old Carl Barrett were arrested in Milwaukee last Wednesday, police said. The third suspect, 23-year-old Arlis Gordon, was cuffed in suburban Chicago a few days later.\n\"This was a completely reckless act by suspects with no regard for human life,\" Milwaukee Police Chief Edward Flynn said in a statement.\nThe choked-up police chief told reporters Tuesday that he had been walking around with Laylah's photo in his chest pocket during the entire homicide investigation.\n\"I've been carrying something around with me, and it's Laylah,\" he said, according to the Journal Sentinel. \"I'd like to think we can put her to rest now.\"\nBarrett and Gordon were out for blood that day after a man who was being tried for killing Gordon's brother was found not guilty, according to a criminal complaint.\n\"He killed my brother and he's getting out!\" Gordon allegedly said. \"This can't be going on. I'm gonna do something about it!\"\nThe trio pulled up to a house they believed to either Gordon's brother's alleged murderer lived or the mother of his child.\nBarrett and Gordon unloaded a hail of a dozen bullets into the residence before Farr drove them away, the complaint said.\nThe group then bragged and laughed about the shooting, authorities said.\n\"I emptied the whole clip,\" Gordon allegedly boasted, according to court documents. \"We lit the whole motherf----- up!\"\nBarrett and Gordon were both charged with first-degree reckless homicide-party to a crime, police said. Farr has been charged with two counts of harboring or aiding a felon.\nThe alleged gunmen face up to 60 years in prison, while Farr could be sentenced to up to 10 years behind bars, authorities said.\nThe suspects were turned in by tips from their \"associates,\" Milwaukee police said.\nLittle Laylah continues to live on after her heart was donated to another child following her passing, her family said.\n\"She stands for good things about Milwaukee: innocence, a safe place to raise children, a place of opportunity,\" Flynn said in May, according to the Journal Sentinel.\n\"But she also stands for the tragedy of Milwaukee,” he added. “that there's too much violence, too many guns in the hands of criminals, too much bloodshed, too many lives lost, too many opportunities never realized.\""}