{"uri": "http://www.cleveland.com/akron/index.ssf/2016/01/akron_teen_accidentally_shoots.html", "title": "Akron teen accidentally shoots girlfriend with dad's gun, police say", "dct": "Tue, 26 Jan 2016 17:13:24 GMT", "id": "2248473d182b1905265ffb5ac8b55761", "content": "(File photo)\nAKRON, Ohio -- An Akron teen accidentally shot his 13-year-old-girlfriend in the stomach with his father's gun, Akron police said.\nThe teen was arrested on charges of felonious assault. His case is in Summit County Juvenile Court.\nThe boy's father, Tony Cox, 43, is charged with possessing a weapon despite having a felony record. His case has been bound over to Summit County Common Pleas Court.\nThe teen and his girlfriend attended First Night Akron on New Year's Eve at Lock 3 park. They left about 10 p.m. and went back to the teen's house in the 800 block of East Crosier Street. He grabbed his father's gun and began shooting at a garbage can with a target painted on the side for practice, according to court records.\nThe teen accidentally shot his girlfriend in the stomach. He drove her to his grandmother's house. The grandmother drove the girl to Akron Children's Hospital, court records say.\nThe two teens initially told police that a fight broke out at Lock 3 near the parking deck. They said a group of men started fighting, someone fired gunshots and that they ran back to their car and discovered that the girl had been shot.\nDetectives asked officers working security at the event about a shooting. No one called to report gunshots or fighting from the Lock 3 that night, police said.\nOfficers questioned the teens again. They both admitted they made up the story about the Lock 3 fight, police said. The boy then told police he used his father's gun for the shooting.\nAkron officers found the revolver on top of the refrigerator in the home, according to court records.\nCox is not allowed to possess a gun because of a criminal history that includes two convictions for engaging in a pattern of corrupt activity in crack cocaine trafficking cases.\nHe was sentenced to serve four years in prison in 2010 in one case and three years of probation in a similar case in 2000.\nHe also was sentenced to one year in prison in 2008 for two counts of domestic violence and one count of possessing a weapon as a felon."}