{"uri": "http://www.statesman.com/news/news/local/bastrop-police-identify-shooter-in-murder-suicide-/nr59W/", "title": "Bastrop police identify shooter in murder-suicide that left 4 dead", "dct": "Wed, 27 Jul 2016 00:00:00 GMT", "id": "a1485202aa4ef0654d9c5ff4201b7a72", "content": "Funeral services for four dead in Bastrop shooting —\nPaula Nino: Visitation will be held Thurs. July 28 from 6 to 8 p.m. at Bastrop Providence Funeral Home and funeral services will be held Fri. July 29 at 10 a.m. at Primera Baptist Church in Bastrop.\nErica & Alejandro Rodriguez: Visitation will be held Thurs. July 28 at 6 p.m. at Bastrop Providence Funeral Home, followed by a rosary from 7 to 8 p.m. A funeral mass will be held Fri. July 29 at 2 p.m. at Ascension Catholic Church in Bastrop.\nServices for Alejandro Martinez are private and closed to the public.\nBastrop police identified Alejandro Martinez as the shooter in the gruesome murder-suicide that left four people dead, including a toddler, last weekend at a Bastrop apartment complex.\nAccording to police, Martinez, 20, was fighting with his girlfriend Erica Rodriguez, 21, when he grabbed his rifle and shot her, as well as her 20-year-old friend Paula Nino and his own three-year-old son, Alejandro Rodriguez.\nMartinez then turned the gun on himself and died by suicide, police said.\nA second child, Nino’s daughter, sustained minor injuries in the shooting and was taken to a local hospital.\nPolice responded to the call of shots fired around 6:15 p.m. July 23 at the Arbors of Bastrop Apartments on Childers St. and found all four dead in the lawn outside their apartment. With help from the Bastrop County Sheriff’s Office and Texas Rangers, police processed evidence at the crime scene until about 2 a.m. Neighbors huddled in masses around the crime scene in disbelief.\n“The City of Bastrop Police would like to express our most heartfelt condolences to the family and friends of these individuals,” detective Vicky Steffanic wrote in a press release Wednesday. “We would also like to convey our gratitude to the Bastrop County Sheriff’s Office, the Texas Rangers, and all other responding agencies that provided assistance and support during this tragic event.”\nFriends and neighbors created a makeshift memorial at the complex, between the four orange markings that outlined where the bodies had lain.\nNino, a teacher at the Wee Care Learning Center in Bastrop, was honored on Facebook by her employees and family members, who called her a kind and positive woman, always smiling and willing to help the children.\n“Please pray for her family as they grieve the shock of her loss. Keep her young daughter in your daily thoughts and prayers. Comfort one another, and reach out,” the statement read. “Life is too short.”\nEmployees at the center will wear blue – Nino’s favorite color – on Thursday, to honor and celebrate her life. On Friday, the center will be closed for her funeral services.\nA GoFundMe page was set up to raise money for Nino’s funeral expenses and one for Rodriguez and her son.\nEach account had raised nearly $4,000 Tuesday.\nRodriguez’s sister described her as “a great sister, a precious daughter and loving mother to her son.”\nLittle has been said publicly about Martinez, the shooter. Neighbors described him as a hard-worker but heavy drinker. He and Rodriguez, his longtime girlfriend, had been a normal, happy family, neighbors said, who took their son to the pool on weekends and grilled with friends.\nHT Fitness Center on Texas 71 will host a Zumba-thon fundraiser Saturday from noon to 3 p.m. to raise money for the families affected by the shooting. Nino loved Zumba, according to the Facebook post advertising the event."}