{"uri": "http://fox8.com/2014/03/09/shock-sadness-after-3-killed-in-fremont-bar-shooting/", "title": "Police Name Suspect in Fatal Bar Shooting", "dct": "Sun, 09 Mar 2014 22:56:00 GMT", "id": "ef30cb742c0b28909ce94a0a2798f3e2", "content": "FREMONT, Ohio – Authorities have named the alleged suspect in a fatal bar shooting in Fremont, Ohio.\nPolice are searching for Igmidio Mista, 33, and say he should be considered armed and dangerous.\nThree people including an off-duty police officer are dead and another is in the hospital after a shooting in Fremont, Sunday morning.\nPolice said they were called to the Last Call Bar around 1:30 a.m. for reports of shots fired.\nFriends of the victims told FOX 8 News the shooting may have been the result of an argument that escalated.\nAmong the deceased is Officer Jose 'Andy' Chavez of the Elmore, Ohio Police Department.\nElmore Sgt. Jeffrey Harrison described Chavez as \"a great guy.\"\nChavez was a full time officer, one of only six officers in the department including the police chief.\nHe was a father of two young children, ages 16 months and 6 years.\nHarrison said Chavez was out celebrating a belated 26th birthday with friends when the shooting started.\nAlso among the victims is Ramiro Sanchez, 28, an employee of the bar and a local musician whose friends said enjoyed working with other musicians in the area.\n\"He's real big into helping people get bigger. He helps publicize. He helps do all their fliers, helps get all their shows going, you know. He tries to help out a lot. He would give you the shirt off of his back if you asked for it,\" said Robert Saudeda.\nPolice identified the third victim as Daniel Ramirez, a patron of the bar who may have been there helping celebrate with Chavez.\nA fourth victim, Ramiro Arrola, 25, was flown to a Toledo hospital. His condition was not known on Sunday.\nLittle is known about what led to the shooting.\nNeighbor, Chris Page, was shocked. \"It was a very quiet bar. It was families and couples involved with it. It was family-owned and that's all you would see going in there was couples,\" said Page.\nAgents with the Bureau of Criminal Identification were assisting Sandusky County Sheriff's deputies, The Ohio Highway Patrol, and local police with the investigation.\nAccording to the Fremont Police, Mista is wanted on three murder charges for the shooting. Each charge is a first degree felony with a maximum penalty of 15 years to life in prison and a $15,000 fine.\nThey’re asking anyone with information to contact them at 419-332-6464.\nCLICK HERE for more."}