{"uri": "http://www.denverpost.com/2016/07/27/stolen-littleton-handguns-involved-accidental-edgewater-shooting/", "title": "Handgun stolen from Littleton firearm shop involved in accidental shooting of 13-year-old boy", "dct": "Wed, 27 Jul 2016 14:29:00 GMT", "id": "63dd467cb530b8c30809118845f45f92", "content": "A handgun stolen from one of two firearm store burglaries last month in Littleton was used in the accidental shooting of a 13-year-old boy in Edgewater, police and federal authorities say.\nEdgewater Police Chief John Mackey said investigators used the weapon’s serial number to link it to the July 14 shooting.\n“Our officers met the young man and his mother at St. Anthony (Hospital), and the young man reported that he was shot during a street robbery in Edgewater,” Mackey said in an interview Wednesday. “His story unraveled, and it turned out it was an accidental shooting between friends, essentially.”\nThe handgun was found at an apartment where police think the shooting occurred.\nAuthorities are working to determine how the handgun wound up in Edgewater, a town on Denver’s western edge, and in the possession of four boys, two of whom are facing charges. The other two remain under investigation. The link to the Littleton burglaries was first reported by KDVR-TV.\n“We are still investigating, including how that firearm ended up in Edgewater,” said Lisa Meiman, spokeswoman for the Bureau of Alcohol, Tobacco, Firearms and Explosives.\nMackey said the 13-year-old had a through-and-through gunshot to his lower leg.\n“This is real concerning that it ends up here in Edgewater,” he said. “The bottom line is, we’re fortunate it wasn’t worse. The shooting could have resulted in a homicide. The doctor said he was just a very lucky young man.”\nThe gun shop burglaries happened on consecutive days, June 21 and 22.\nIn the first, 29 handguns were stolen from Colorado Gun Broker on West Bowles Avenue. The next day, burglars crashed a van into the entrance of Triple J Armory, on East County Line Road, stealing numerous firearms, most of them handguns.\nThe ATF said both burglaries remain under investigation. Mackey said it wasn’t clear from which store the handgun involved in the teen’s shooting was taken.\nEdgewater police, the ATF and Littleton police are investigating the gun thefts.\nSponsored Links\n.\nVital Reds SupplementHow To Fix Your Fatigue (Do This Every Day)Vital Reds Supplement\nScribolHikers Found This Horse Alone In The Woods. Then They Looked At His Face and Realized…Scribol\nGreeningzMonica Lewinsky's Net Worth Left Us Jaw DroppedGreeningz\nLowerMyBillsCongress Gives Homeowners Who Owe Less Than $300-625k A Once In A Lifetime Mortgage BailoutLowerMyBills\nTrend Chaser9 Out Of 10 People Can't Get Through These Photos, Can You?Trend Chaser\nBeverly Hills MD Skincare SupplementDon't Pay For A Facial Until You See ThisBeverly Hills MD Skincare Supplement"}