{"uri": "http://www.mlive.com/news/flint/index.ssf/2016/05/man_pleads_guilty_to_fatal_sho.html#incart_river_index", "title": "Man pleads guilty to fatal shooting of 11-year-old cousin", "dct": "Tue, 10 May 2016 13:30:00 GMT", "id": "07b58064113e9f587c258a37ff971e36", "content": "FLINT, MI - A Flint man has pleaded guilty after he said he inadvertently fired the fatal shots that killed his 11-year-old cousin.\nTovonte Kyjuan Jones pleaded guilty Tuesday, May 10, to involuntary manslaughter following the March 2015 death of 11-year-old William Lee Coppage. Jones initially faced a charge of second-degree murder and felony firearm, but those charges were dismissed as part of the plea agreement.\n\"It was a very fair disposition,\" said Jones' attorney, Frank J. Manley. \"There's no question it was accidental.\"\nProsecutors charged Jones, 25, after police were called to the 1800 block of Barks Street about 6:15 p.m. March 13, 2015, and found Coppage had been shot.\nCoppage's 15-year-old sister testified previously during a preliminary exam that she and her three brothers were outside playing when Jones arrived at their home.\nShe said Jones played basketball and wrestled with Coppage prior to the shooting. Jones then retrieved the gun to show it to the girl's aunt, who lived next door.\nThe girl said she and Coppage were standing near the porch when she heard a gunshot.\nAfter being hit, Coppage went onto the home's porch and collapsed.\nFamily members tried to help Coppage as they waited for emergency responders to arrive. Jones also went onto the porch to see to his young cousin.\n\"He was telling William to breathe,\" the girl said.\nManley said Jones admitted to mishandling the firearm, inadvertently shooting his cousin.\nProsecutors agreed.\n\"It certainly appeared to us that it was an accident after having it reviewed by a number of different people,\" Leyton said.\nThe plea agreement calls for Jones to serve one year in jail and five years of probation. The charge will be reduced to reckless discharge of a firearm causing death if he successfully completes probation.\nJones can withdraw his plea if Genesee Circuit Judge Judith Fullerton decides not to use the sentencing agreement. Manslaughter is punishable by up to 15 years in prison.\nHe had no criminal record and possessed a concealed pistol license at the time of the shooting."}