{"uri": "http://www.nydailynews.com/new-york/queens/girl-15-shot-queens-play-wrestling-gun-fired-article-1.2358204", "title": "Girl, 15, fatally shot in Queens apartment was play wrestling with friend before gun fired: ‘He just kept saying he didn’t mean to’", "dct": "Sat, 12 Sep 2015 22:59:55 GMT", "id": "3ead41d01e3d78a409ef8b8ab5175688", "content": "A pair of 15-year-olds playfighting with a loaded gun left one of them dead and the other being questioned by police, authorities and witnesses said Saturday.\nWilta Wordsworth, who stayed home from school on Friday, had invited a pair of boys over to her Queens apartment to hang out.\nShe was play wrestling with one of the boys when he pulled a gun and blasted her in the head by accident, Nia Skrine, the doomed girl’s friend said Saturday.\n“He was scared. He just kept saying he didn’t mean to. It was an accident,” said Nia, 15, who had slept over Wilta’s Far Rockaway apartment the night before and witnessed the tragedy.\nWilta’s mother Miatta Teage, 39, was inconsolable when reached by phone Saturday.\n“She was very good, I don’t know what went wrong.” she said, sobbing uncontrollably.\n“I am angry because people are walking around with guns. All kinds of people on the street have guns”\nThe horror unfolded just after noon Friday inside Wilta’s seventh-floor apartment on Collier Ave., officials said.\nWilta, who also went by the nickname Taya, skipped school Friday to avoid a fight, Skrine said. Wilta’s mother was at work, so she decided to invite two boys, both 15, over, according to Nia.\n“She let them in,” Nia said. “(Wilta and the shooter) were play fighting and he just pulled it out and he shot her.”\n“I couldn't believe it,” Nia added. “I kept touching her and she wouldn't wake up.”\nNia, still dressed only in her undergarments from the sleepover, ran out of the apartment and began pounding on neighbors’ doors for help.\n“She came to ask to use my phone to call the police,” said building super German Tejata.\nTejata raced up to the apartment and found Wilta unconscious in her bedroom.\n“She was halfway in bed and on the floor,” he said.\nThe doomed teen died at St. John’s Hospital early Saturday, police said.\nSurveillance footage showed one of the boy’s fleeing in the moments after the shooting, according to the super. The second boy whispered something in Nia’s ear before also dashing off, the super said.\nCops caught up with the boys and charged both of them with manslaughter, weapons possession and tampering with physical evidence. The two were charged as minors, officials said.\n“We were all friends and it was an accident,” Nia said.\n“I don’t want anything bad to happen to them but they’re gonna have to suffer the consequences.”\nWilta, who attended nearby Middle School 53, had just moved into the building over the summer, neighbors said.\n“She didn’t deserve it,” Nia said. \"That was my best friend. That was like my sister.”\nTeague knew that her daughter had a sleepover and was skipping school on Friday.\nTeague said she immigrated from Liberia to the U.S. in 1999 so Wilta — and later Wilta’s 7-year-old brother Maxwell could be born American citizens.\nThe proud mom hoped Wilta would have a better life than she did, she said.\n\"They took away my American dream,\" she cried."}