{"uri": "http://www.rochesterfirst.com/news/local-news/mexican-village-owner-reacts-to-shooting-outside-bar", "title": "Mexican Village owner reacts to shooting outside bar", "dct": "Sun, 07 Feb 2016 23:24:00 GMT", "id": "46c807a749fc3c92f6a621845aab7aa6", "content": "Error loading player: No playable sources found\nROCHESTER, N.Y.\nEight people were shot around 2 a.m. on Sunday in front of the Mexican Village nightclub, where a 29-year-old man was found dead on the scene.\nThe victims all range in age from 21 to 30, and their names are not being released by police, though they say seven men and one woman were shot in total.\nThe scene on State St. remained taped off throughout the afternoon Sunday, with police investigating, and countless evidence markers outside the bar and flooding the street.\nPolice have yet to say whether there was more than one shooter, but Mexican Village owner Victor Canela says police told him those evidence markers included three different types of bullet casings.\nCanela showed media outlets surveillance video depicting the before-and-after of the situation, but the videos did not capture the shooting itself.\nHe says one of the victims re-entered the bar after being shot, and that several of the victims suffered bullet wounds to their legs.\nThe City of Rochester does keep tabs on nightspots that attract violence and crime, but it's not clear whether Canela will see any consequences after the shooting outside his bar. He did not want to speak on camera, but was visibly shaken up over the situation.\n\"We don't want those things but people bring it to us. How can I avoid it? I think nobody can avoid it. Maybe I'm not the first, maybe I won't be the last…but I wish those things don't happen to nobody,\" said Canela.\nRochester Police say there is no threat to the general public. According to Chief Michael Ciminelli, a dispute happened inside the bar before the shooting.\nTwo of the victims who survived were released from the hospital. Police do not have anyone in custody.\nCopyright 2017 Nexstar Broadcasting, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}