{"uri": "http://www.whec.com/news/four-people-arrested-mexican-village-shooting/4280396/", "title": "Four people arrested in connection with Mexican Village shooting", "dct": "Tue, 04 Oct 2016 13:02:00 GMT", "id": "6bc2ba12a7beb7f7f83b4899bbc67260", "content": "Rochester police have made four arrests in a deadly mass shooting that took place in February 2016.\nOn Monday, Police Chief Michael Ciminelli announced that four people had been arrested. On February 7, eight people were shot and one was killed outside the Mexican Village bar, located at 547 State Street.\nLt. Frank Umbrino called the crime scene “complicated and complex.” He says three guns were used and 25 shots were fired. In total eight people were hit with bullets.\nJuan Luis-Garcia and Josue DelGado-Rivera are both charged with second degree murder. Jaime Fontanez-Baez and Efrain Figueroa are charged with assault.\nOn September 29, felony complaints were filed against Jaime Fontanez-Baez, Juan Luis-Garcia, and Josue DelGado-Ortiz. Delgado-Ortiz was taken into custody by Rochester police. Police Baez and Luis-Garcia were already in the Monroe County Jail on unrelated weapon and drug charges resulting from the homicide investigation.\nOn October 1, Efrain Figueroa was taken into custody by Rochester police. According to police, at the time of his arrest he was in possession of a loaded 9mm handgun and almost 90 bags of heroin. Figueroa was also charged with criminal possession of a weapon and criminal possession of a controlled substance.\nErnesto Ayber, 29, was killed in the shooting. Court paperwork indicates one of the surviving victims lost a part of their colon and still has nerve damage in their leg. Aside from releasing the names of the suspects, Rochester police gave us more information on their investigation, saying that it started as an argument inside the Mexican Village over money.\n\"We did get a lot of good information that night,” says Lt. Frank Umbrino. “We talked to dozens and dozens of people both that night and since the time of the incident so as in every case, at the end of the day the bottom line is people need to step up and come forward and talk with us.”\nAll four have been arraigned. DelGado-Rivera and Garcia are both being held on no bail.\nOn Monday, we spoke with the bar's owner. Among the people shot was one of his employees -- a bouncer. We saw the bouncer on Monday and his body language said it all -- he had a smile as wide as a football field.\nThe owner, Victor Canela, was also there on the night of the shooting.\n\"I'm happy because I think anybody who does something wrong, we need to pay,\" he says. \"I do something wrong, I need to pay. They did something wrong, they need to pay for it.\"\n\"There was a verbal altercation that occurred inside the bar, Mexican Village, on State Street,\" said Lt. Umbrino. \"The altercation was over some alleged stolen money.\"\nAn argument that officers say led up to the shooting, but Canela disputes that. He says there was no fight in his bar where he says business has slowed since the shooting.\n\"Unfortunately, people go to the nightclubs and do stupid things and we end up paying for their mistakes,\" says Canela. \"But don't blame it on us; we're trying to do our best.\""}