{"uri": "http://www.kvue.com/story/news/local/2014/06/23/suspicious-death-south-austin/11255593/", "title": "Police: Suspects used stolen police gun in homicide", "dct": "Thu, 03 Jul 2014 00:00:00 GMT", "id": "9360cc94f24f0ad6f51e9162cd5f0dec", "content": "(Photo: APD)\nAUSTIN -- Two men are charged in connection with the shooting death of a 17-year-old.\nJustice Rain Presto, 17, died on June 22. Police have charged Patrick Molina, 18, and Kent Haley, 19.\nBoth are charged with tampering with physical evidence. Molina is also charged with manslaughter.\nAccording to the arrest affidavit, witnesses told police Molina shot Presto by accident, then Haley helped him move the body. Austin police say the gun used in the shooting was stolen from a police car at a home in Pflugerville. Pflugerville police say it was a UTPD police car.\n\"There was a lot of blood going up the stairs,\" said neighbor Alexs, who didn't want to provide his full name.\nAlexs said he came home that Sunday night to find police lights and caution tape.\n\"So close, I mean, it was frightening and everything,\" he said.\nAccording to an arrest affidavit, police also found a bullet proof vest, police handcuffs, glock magazines and a police baton from the car.\nAnonymous tips to police claim Molina showed all his friends the stolen property that night, and witnesses told police he shot Presto as he tried to unload the pistol.\nAfter it happened, police say, Molina and Haley drove his body a few blocks away to Lareina Drive. Then Haley called 911.\n\"When I got to see, you know, what happened and I heard everything that was going on and stuff, it shocked me,\" Alexs said.\nFriends and family have taken to social media, posting pictures and memories of Presto to a memorial page on Facebook. They describe him as a vibrant, fun-loving teenager, gone too soon.\nNeither of the men charged is in police custody. Police expect them to turn themselves in within the next couple days. Both have a bond set at $25,000."}