{"uri": "http://www.al.com/news/birmingham/index.ssf/2016/11/armed_and_dangerous_suspects_c.html", "title": "'Armed and dangerous' suspects charged, on the run in shooting of 6-year-old Bessemer girl", "dct": "Sun, 20 Nov 2016 11:38:44 GMT", "id": "6f986241f92490587af5aba345d7704b", "content": "(Bessemer Police)\nTwo men are now charged in the shooting of a 6-year-old girl wounded when gunfire pelted her Bessemer home.\nDeanthony Siquan Billingsley, 20, of Bessemer, and Cardamlen Demun Braxton Cooper, 21, of Hueytown, are charged with two counts of attempted murder and one count of shooting into an occupied dwelling. Both suspects remain at large, and should be considered armed and dangerous, said Bessemer police Sgt. Cortice Miles.\nBessemer police and U.S. Marshals are searching for Billingsley and Cooper. One of them has outstanding warrants in Jefferson County and in Hoover, and both are know to law enforcement officers. \"This isn't their first rodeo,'' Miles said.\nAlexis Davis was asleep on the couch of her family's home in the 400 block of 30th Street in Bessemer. Gunfire peppered their home shortly after 11 p.m., but family members and police didn't realize Alexis was shot in the back until more than two hours later when she got up to use the restroom. That's when she complained of pain in her stomach, and blood was found on her and the couch.\nBessemer police said the girl was found shot about 1:30 a.m. in the 400 block of 30th Street South. A man had been shot earlier at the convenience store across the street.\nShe was taken to Children's of Alabama where she remains in the Intensive Care Unit this afternoon after undergoing surgery. She is listed in stable condition.\nAbout 11:10 p.m., officers were dispatched on a shooting at the Dartmouth Avenue Convenience Store, located at 2931 Dartmouth Avenue. Miles said officers found a black male lying outside the store on his back with a single gunshot wound to the arm. The victim told officers he was shot in the arm while inside of the store by a person that he knows. He was taken to UAB Hospital, but was released a short time later.\nMiles said detectives believe that Billingsley and Cooper shot the male victim at the store as part of an ongoing dispute. \"It is believed that Billingsley and Cooper went across the street and shot into the residence,'' Miles said.\nHe said police received simultaneous calls about the shootings at convenience store and the gunfire at Alexis's home. It wasn't until 1:30 a.m. they discovered Alexis shot. \"She didn't act like she had been shot,'' said her grandfather, J.D. Lucius. \"She was laughing and everything.\"\nJ.D. Lucius said his 6-year-old granddaughter was asleep on his couch when multiple rounds of gunfire hit his Bessemer home late Thursday night.\nMiles said their investigation shows that Billingsley and Cooper intentionally shot into the home where Alexis was sleeping because they knew their intended victim - the man shot in the arm - had associations with that home.\nOnce captured, the suspects will be held on more than $2 million bond each.\n\"We pray that this innocent young child recovers physically from this assault. It is also our prayer that she is able to overcome the indelible emotional scar that she will have to carry through life,\" said Bessemer police Chief Nathaniel Rutledge. \"It is concerning that people are so reckless as to discharge weapons with no regard to where the bullet strikes.\"\nAnyone with any information on these cases is asked to call the Bessemer Police Department at (205) 425-2411 or the TipLine at (205)428-3541."}