{"uri": "http://www.live5news.com/story/33743193/family-6-year-old-girl-shot-in-the-back-by-stray-bullet", "title": "2 suspects charged in shooting that injured 6-year-old girl in Bessemer", "dct": "Fri, 18 Nov 2016 11:53:00 GMT", "id": "d97212db496e9432fc21fb1d6a442133", "content": "BESSEMER, AL (WBRC) -\nBessemer police have identified and charged two suspects in two shootings that injured a 6-year-old girl at her home and a man at a convenience store across the street.\nDeanthony Shiquan Billingsley, 20, of Bessemer, and Cardamien Demun Braxon Cooper, 21, of Hueytown, are both charged with two counts of attempted murder and one count of shooting into an occupied dwelling.\nNeither suspect is in custody and police say they are considered armed and dangerous.\nSix-year-old Alexis Davis is recovering from surgery after her family says that she was struck by a bullet on Thursday night.\nDavis was shot in the back while she was asleep on the couch at a home in the 400 block of 30th Street South around 11:15 p.m., according to her grandfather, Pastor J.D. Lucius.\n“We were all really getting ready for bed and they just started shooting. Shot that window out. We hit the floor. I didn’t know they had shot five times. God knows I didn’t know that,\" Lucius said.\nLucius said that a family friend they hadn’t seen in a while stopped by to visit prior to the shooting.\n“He left and five minutes after he left then rat-tat-tat, they started shooting up my house,” Lucius said.\nLucius said they didn't realize the little girl had been shot for about an hour after the shooting, until she got up to go to the bathroom.\n\"It appears that the child was asleep on the couch when the shooting occurred and did not wake up. The child woke up later complaining of pain in her stomach,\" Sgt. Cortice Miles said.\nThe girl's mother then called 911. Police said Davis was conscious and transported to Children's of Alabama Hospital in serious condition.\nShe is now in stable condition at the ICU at Children's, according to Lucius and the child's mother. The shooting damaged her intestines and she will have to undergo a second surgery on Sunday.\nLucius said the family friend was also shot at a gas station around the corner.\nMiles said they received simultaneous calls about a person shot at the Dartmouth Avenue Convenience Store in the 2900 block of Dartmouth Avenue around 11:10 p.m. Thursday, and a call about a home across the street that had been shot into.\nOfficers found the male victim suffering from a single gunshot wound in his arm at the convenience store. He told them that someone he knew shot him at the store. The victim was taken to UAB Hospital for treatment.\nMiles said officers were not aware of any other person being shot when they responded to the convenience store shooting.\nAround 1:30 a.m. Friday, Nov. 18, they responded to the house where the 6-year-old girl had been shot, after her family realized she had been hit by a stray bullet.\nDetectives believe Billingsley and Cooper shot the male victim at the convenience store as part of an ongoing dispute, Miles said. They think the suspects then went across the street and shot into the home where the little girl was sleeping.\nMiles said each charge for attempted murder has a $1 million bond, and each of the shooting into an occupied dwelling has a $30,000 bond, bringing the total bond for each of the suspects to $2,030,000.\nPolice say Billingsley does not have any other active warrants, but Cooper has a felony warrant for burglary without bond with the Jefferson County Sheriff's Office and a misdemeanor warrant with the Hoover Police Department.\n\"Detectives are still actively investigating these cases, and strongly believe that more charges against Billingsley and Cooper will follow,\" Miles said.\nAnyone with information is asked to call Bessemer police at 205-425-2411 or the tip line at 205-428-3541.\nCopyright 2016 WBRC. All rights reserved."}