{"uri": "http://www.abc15.com/news/region-phoenix-metro/south-phoenix/phoenix-pd-deadly-shooting-involved-rival-gang-members", "title": "Nora Osman update: House party shooting death involved rival gangs, Phoenix police say", "dct": "Wed, 22 Jan 2014 13:18:00 GMT", "id": "101d7aa8c51c886900561b248db2b7d2", "content": "PHOENIX - Authorities have charged five people in the November 9 shooting death of a 19-year-old woman in Phoenix.\nPhoenix police say Nora Osman was at a house party near 51st and Southern avenues and as she was standing out front with a group of friends around 11 p.m. a vehicle drove by and the suspects fired over 30 rounds into the group.\nPolice say the suspects had driven by the house earlier and noticed members from a rival gang were attending the party.\nThe shooting suspects loaded into one vehicle and a comment was made about \"shutting down the party,\" according to police.\nThe suspects circled back by the house and all the occupants in the vehicle, including the driver, allegedly opened fire on the group of people standing out front.\nPolice say Nora Osman was an unintended victim of the gang violence. Three other people were injured. Police say they took themselves to the hospital where they were treated and released.\nDuring the investigation it was determined those responsible for the shooting were rival gang members.\nThe Phoenix Police Department and Maricopa County Attorney's Office announced charges on the following five suspects:\nAbraham Ntiamoah, 15, faces charges of first-degree murder, felony murder, drive-by shooting, conspiracy to commit murder, leading/assisting a criminal street gang, aggravated assault.\nTheodore Montgomery, 18, faces charges of first-degree murder, felony murder, drive-by shooting, conspiracy to commit murder, leading/assisting a criminal street gang, aggravated assault.\nD'Drique Price, 18, faces charges of first-degree murder, felony murder, drive-by shooting, conspiracy to commit murder, leading/assisting a criminal street gang, aggravated assault.\nMarquis Young, 18, faces charges of first-degree murder, felony murder, drive-by shooting, conspiracy to commit murder, leading/assisting a criminal street gang, aggravated assault.\nJacorian White, 21, faces charges of conspiracy to commit murder, leading/assisting a criminal street gang."}