{"uri": "https://www.dnainfo.com/chicago/20160706/west-englewood/after-child-shot-neighbors-urged-step-it-up-reveal-gangbangers", "title": "After Children Shot, Neighbors Urged To Turn In 'Grandsons, Nephews'", "dct": "Wed, 06 Jul 2016 11:29:00 GMT", "id": "730c7acc60d29b584b0a06eb8eae4c6d", "content": "WEST ENGLEWOOD — The Fourth of July shooting of two children prompted a neighborhood meeting on a street corner Tuesday night, with some speakers urging the community to turn in the criminals.\n\"When our grandsons and nephews do the shooting, we run into the house and lock the door. It's time to stand up and say 'This will not be accepted,' \" said Devry Graham, president of Graham Funeral Directors and Cremation Services.\nThe gathering of about 100 people, at 56th Street and Hermitage Avenue, included 15th Ward Ald. Raymond Lopez and Englewood District Cmdr. Larry Watson.\nGraham told the group that the community needs to have a better relationship with police.\n\"The police have families just like the rest of us, and we can't blame the police for everything,\" Graham said.\nLopez echoed Graham, saying \"In every community we've seen bullets hit community members. We know who these offenders are, but we as a community need to step it up and say that we will work with the police to get these situation rectified.\"\nOne attendee, Demetrius Nash, said the meeting was a good start, but change won't come until systemic issues that plague neighborhoods like West Englewood are seriously addressed by elected officials.\n\"It's about resources. It's disrespectful to make decisions about young people we don't even engage,\" Nash said. \"You have to engage the young people in order understand your constituents. If you don't go out of your way to engage the youth, you are doing a disservice as a leader.\"\nMeanwhile, a 5-year-old girl who was wounded in the Monday night shooting while playing with fireworks in front of her house has returned home from the hospital and is being cared for by her mother.\n\"There was no need for this,\" said Natasha Williams, the mother of Taniyah Williams.\nThe child was with friends toward the end of the Fourth of July weekend, around 11 p.m., just steps from her home in the 5500 block of South Hermitage Avenue when two shooters appeared from a nearby gangway and opened fire, police said.\nA cousin of Taniyah, 7-year-old Corey Bondurant Jr., also was shot and hospitalized.\nA 30-year-old woman was shot in her left leg, and a 19-year-old man also was shot in his left leg. Police said they think the shooting was gang-related. No one has been arrested.\n\"I had just gone back inside when my son ran back in and said someone was shooting outside,\" the girl's mother said. \"My son saw my baby limping, and he picked her up and brought her on the porch.\"\nWilliams said Taniyah is home from the hospital.\n\"It's sad. She doesn't have crutches, so I have to carry her around to the bathroom and such,\" Williams said, adding that neighborhood \"is usually quiet around here.\"\nCorey Bondurant, father of Corey Jr., released a statement Tuesday, saying “Corey is out of surgery and is in stable condition.\"\nThe shooting was seven blocks west of a March 23 shooting of four people in front of Computer Preschool Academy, in which a stray bullet left a hole in one of the preschool's windows.\nFor more neighborhood news, listen to DNAinfo Radio here:"}