{"uri": "http://newyork.cbslocal.com/2013/08/11/police-searching-for-suspect-who-opened-fire-at-e-flatbush-house-party/http://newyork.cbslocal.com/2013/08/11/police-searching-for-suspect-who-opened-fire-at-e-flatbush-house-party/", "title": "Police Searching For Suspect Who Opened Fire At East Flatbush House Party", "dct": "Sun, 11 Aug 2013 10:07:00 GMT", "id": "9e0f34218c0c83a3b99eb4199cd85aba", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nNEW YORK (CBSNewYork) – Four people remained hospitalized after being shot at a house party in East Flatbush early Sunday morning.\nAs CBS 2’s Janelle Burrell reported, shots rang out as the gathering was wrapping up around 1:30 a.m.\nAn altercation inside the party spilled out onto the sidewalk along East 48th Street and Church Avenue, Burrell reported.\n“That’s scary because I can walk in the street and I can be caught in the crossfire,” resident Eric Phipps told Burrell.\nPeople who live on the block said shootings have become a common occurrence.\n“Since I lived here, there’s been shootings every year,” one man told Burrell.\n“Not surprised, no surprise at all,” said another resident.\nIn late June, there was a similar incident just a few blocks away.\nIn that incident, a man opening fire during a large party, striking nine people.\nA suspect was recently arrested.\nThe frequency of party violence has prompted City Councilman Jumaane Williams to propose legislation that would require party hosts of gatherings of more than 40 to register their events with their community board and local precinct.\n“All we said is that you would have to just inform the precinct and inform the community board. You wouldn’t have to ask for approval, you wouldn’t have to ask for permission,” Williams said.\nDetectives were still on the scene Sunday morning looking for clues\nThe victims are all in their early 20s and are expected to survive.\nPolice have not named any suspects in the shooting and no arrests have been made.\nYou May Also Be Interested In These Stories"}