{"uri": "http://www.kctv5.com/story/29966011/boy-4-dies-after-being-shot-in-the-head#.VeugCahdAr4.twitter", "title": "Mother charged in 5-year-old boy's shooting death", "dct": "Sat, 05 Sep 2015 15:22:00 GMT", "id": "99cce60d3a6374fb342a7604c6542764", "content": "KANSAS CITY, MO (KCTV) -\nCharges have been filed against a Kansas City mother in the shooting death of her 5-year-old son.\nLisa Marie Hall, 23, faces child endangerment and unlawful use of a weapon charges. Both are considered felonies.\nAccording to court records, the child died about 7 a.m.Saturday.\nWitnesses told police that Hall and her boyfriend were drinking and had been bickering in a bedroom inside a home in the 400 block of North Elmwood Avenue.\nA gunshot was then heard and Hall ran from the bedroom carrying her child who was suffering a gunshot wound to the head. He died at the hospital. Kansas City police originally said the child was a 4-year-old.\nNo other adults were in the bedroom at the time of the argument and shooting, a witness said.\nThe boyfriend told police that he and Hall had purchased a hand gun the day before.\nBoth Hall and her boyfriend first told police someone called \"504\" had confronted them in the bedroom when the boy was shot.\nLater, the boyfriend told police that he and Hall had been in an argument. Hall was seated on the bed and her son was standing next to the boyfriend, when Hall pulled a handgun from her waist and fired at him.\nHall’s son, Jesse, fell to the floor, the witness told police.\nPolice found a live 9mm round and a spent bullet in a closet in the bedroom.\nHall's best friend staying at the home Friday night.\n“This morning in the back of my mind I'm thinking, ‘OK, they're just arguing again,’ but then, wait a minute, I look down and there is blood droplets on my arm. I get up, I go outside and see my best friend go across the street with blood everywhere, there was blood everywhere,\" Monique Smith said.\nPolice interviewed Smith and took her clothes as evidence.\nProsecutors have requested a bond of $150,000. The case remains under investigation.\nCopyright 2015 KCTV (Meredith Corp.) All rights reserved."}