{"uri": "http://www.ledger-enquirer.com/news/local/crime/article81838907.html", "title": "Eufaula, Ala., police kill gunman after shooting rampage injures three", "dct": "Sat, 04 Jun 2016 18:49:00 GMT", "id": "929b8144eeb70b06d5062b0f0c41858c", "content": "A gunman was shot and killed by Eufaula, Ala., police after a man went on a shooting rampage that included a 2-year-old girl among three victims, police said Saturday.\nDemarco Rhymes, 35, was shot and killed by police after he was identified as a suspect in a shooting that erupted at 7:54 a.m. at Level Acres Mobile Home Park. Rhymes was pronounced dead at Medical Center Barbour.\nThe toddler was airlifted to a Birmingham hospital while a 39-year-old man and 42-year-old woman were treated at a Dothan hospital. They were in critical condition, Chief Steve Watkins said in a statement. No officers were injured.\n“Our prayers are with the victims, officers and all those affected by this incident,” the chief said. “Our highly trained officers are prepared to address such incidents and I commend the officers who responded and deployed their training both effectively and efficiently this morning.”\nThe first report of a shooting came at 7:54 a.m. at the mobile home park. After the girl was shot in the leg, police said Rhymes is accused of going to Davis Street where a 42-year-old woman was shot. The third shooting was on Norman Street where a man was hit with multiple gunshots. Police made contact with Rhymes at Zion Church where he allegedly fired at responding officers. Police pursued Rhymes by vehicle and on foot. Officers fired on Rhymes to stop the imminent deadly threat posed by the suspect, police said.\nOfficers involved in the shooting have been placed on paid administrative leave and are under investigation by the Alabama State Bureau of Investigation. Shootings of the three victims remain under investigation by the Eufaula Police Department.\nA preliminary report indicates that domestic disputes are possible motives in the shooting rampage, the chief said in a release.\nBen Wright: 706-571-8576, @bfwright87"}