{"uri": "http://www.wsaz.com/news/headlines/Woman-Accidentally-Shot-in-the-Leg-in-Cedar-Grove-333306041.html", "title": "UPDATE: Neighbors Aid Woman Accidentally Shot by Grandson", "dct": "Fri, 16 Oct 2015 23:29:00 GMT", "id": "e6d7cf09b8f5843ebd264ce5d86ce145", "content": "UPDATE 10/16/15 @ 11:30 p.m.\nCEDAR GROVE, W.Va. (WSAZ) -- Neighbors in Cedar Grove say things are quiet now. But an accidental shooting made Friday afternoon a busy one for folks in town.\nAccording to the Kanawha County Sheriff's Department, Pamela Gibson, 53, was shot in the hip.\nHer family says the shooter was Gibson's 2-year-old grandson, who pulled the trigger by accident.\n\"It's very unusual,\" neighbor Terri Kelley said. \"I've been here my whole life. I'm 40-years-old ... this has never happened here.\"\nBut Gibson's longtime friend and neighbor, Nancy Lawhorn, says one thing that is usual in Cedar Grove is tragedy.\n\"We have lost five deaths since July,\" Lawhorn said.\nDetermined to avoid another casualty, neighbors like Lawhorn sprang into action Friday to help Gibson.\n\"Everybody knows everybody here, and when someone hollers we all run,\" Lawhorn said. \"I ran and when I got over there she was bleeding in the back door, and we helped her and we put her in the ambulance.\"\nEvery second counted.\nGibson's family says the bullet hit an artery. But an ambulance, called by a neighbor, got there with enough time to allow medics to stabilize Gibson on the way to the hospital.\n\"Hopefully she'll be alright and she knows we love her,\" Lawhorn said.\nThe Kanawha County Sheriff's Department says Gibson was transported and treated at CAMC General.\nThere's no word on her condition right now. But family members say they're hopeful she'll be OK.\nUPDATE 10/16/15 @ 4:50 p.m.\nCEDAR GROVE, W.Va. (WSAZ) -- Deputies were dispatched to Williams Street Friday afternoon for a shooting incident.\nAccording to a release from the Kanawha County Sheriff's Department, the call came in just after 1:00 p.m.\nDeputy D. Cadle arrived on scene to discover Pamela Gibson, 53, had been shot in the hip.\nAccording to the release, KCSO detectives arrived on scene shortly after to interview witnesses and collect evidence. Based on their information obtained, it appears a 2-year-old child who lives at the residence was able to obtain a pistol.\nThe release states that the 2-year-old child accidentally discharged the weapon while near Gibson, causing her to get hit by the bullet.\nGibson was transported to CAMC General Hospital. She is currently being treated by hospital staff.\nThe name of the 2-year-old child will not be released.\nWSAZ has a crew on the scene.\nKeep clicking on WSAZ Mobile and WSAZ.com for updates.\nORIGINAL STORY 10/16/15\nCEDAR GROVE, W.Va. (WSAZ) -- Emergency crews are on scene where a woman was accidentally shot in the leg.\nAccording to the victim's son, the woman was inside of the home, on the 200 block of William Street, when her husband opened up their gun cabinet.\nThe family member says the woman's grandson somehow got ahold of a pistol that was in the cabinet and then fired a shot.\nThe bullet went into the woman's leg and exited through her hip. She was transported to the hospital.\nThe family member says she is in surgery at this time.\nKanawha County Sheriff's Department is further investigating the incident.\nWSAZ has a crew at the scene.\nKeep clicking on WSAZ Mobile and WSAZ.com for updates."}