{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-shootings-violence-20161231-story.html", "title": "2017 opens with 3 killed, 16 wounded after violent 2016 has its last homicide on New Year's Eve", "dct": "Tue, 03 Jan 2017 06:25:00 GMT", "id": "9fcc419f0cf59942539b94090b31eb27", "content": "Three people were killed and 16 others were wounded during the first six hours of the year as the city ended a year that brought levels of violence that had not been seen in the city since the 1990s.\nIn total, four people were killed and 25 other people were wounded in separate shootings from New Year's Eve to early Sunday.\nAround 2:30 a.m. an unnamed man was shot by a Chicago police officer, authorities said at a news conference Sunday, about 12 hours after the shooting. They reported that a man led cops on a car chase and physically resisted once he was finally stopped. The man, who is in critical condition, was shot after a scuffle, police said.\nAbout two hours later, two men were killed in the year's first fatal shooting, which took place at 4:25 a.m. Sunday in the 4600 block of North Broadway in the city's Uptown neighborhood on the North Side.\nA 38-year-old man was shot in the chest and the right leg. He was identified as Maurice Delaney, 38, of the 9000 block of Skokie Boulevard in Skokie, according to the Cook County medical examiner's office.\nA second man, who police believed to be 35 to 40 years old, was shot multiple times on his right side. He was later identified as Ali Mohamed, of the 7000 block of North Kenton Avenue in Skokie.\nBoth men were taken to Illinois Masonic Medical Center, where they were later pronounced dead at 5:19 a.m.\nThey were shooting at each other inside a business on that block, police said.\nOn the West Side just before 5:55 a.m., a 39-year-old man was shot to death in the West Garfield Park neighborhood. He was identified as John Warship, of the 4400 block of West Wilcox Street, according to the Cook County medical examiner's office.\nOfficers found Warship on the sidewalk in the 4600 block of West Monroe Street after responding to a call of shots fired. He had been shot multiple times and was pronounced dead at the scene at 6:10 a.m.\nOfficers guarded his body, which was covered by a white sheet. Warship was killed in front of two brick multiunit buildings. Police placed multiple evidence markers near the body.\nA woman delivered newspapers to the quiet neighborhood, and a resident inside a home that was part of the crime scene played religious music as the sun began to rise.\nThe last homicide of 2016 happened about 12:30 p.m. Saturday while a man was driving in the 4800 block of West Chicago Avenue in the South Austin neighborhood. The man was reportedly sideswiped by a Mercedes-Benz. The driver of the Mercedes got out of the vehicle and an argument started, police said.\nThe man was later identified as Kenneth Weaver, 22, according to the Cook County medical examiner's office. He died from a gunshot wound to the torso, the office determined following an autopsy Sunday.\nAt some point, the Mercedes driver pulled out a gun and shot the man in the left side. He was taken in critical condition to Stroger Hospital, where he was pronounced dead, police said.\nAt a brief news conference late Saturday afternoon at the North Side's Town Hall police district, 850 W. Addison St., police Superintendent Eddie Johnson said the city added about 1,000 more police officers on the streets, including undercover police, for New Year’s Eve.\nThere were gang teams in neighborhoods as well as officers around Chi-Town Rising and Navy Pier celebrations.\n“Basically the message we want to send Chicago is that we’ve prepared,” Johnson said. “We want everybody to celebrate but we want everybody to celebrate responsibly.”\nOther shootings:\nIn the Back of the Yards neighborhood, a 52-year-old man was shot in the right leg after gunfire went through his home, police said. He was inside his home about 5:30 a.m. Sunday in the 4800 block of South Racine Avenue when a bullet hit his right leg. He was taken in good condition to Holy Cross Hospital.\nA 26-year-old man was grazed in the head by a bullet at 3:55 a.m. in the 200 block of West 63rd Street in the Englewood neighborhood. He was in a vehicle when three people got out of a car and shot at him, police said. He was in good condition at Stroger Hospital.\nOn the Far South Side, three people were shot about 3:45 a.m. in the Morgan Park neighborhood, police said. A 19-year-old man was shot in the lower right back in the 11200 block of South Longwood Drive. His condition was stabilized at Advocate Christ Medical Center in Oak Lawn. Officers who were responding to the shooting found two other victims, who told police that they had also been shot in the same area as the 19-year-old man. A 21-year-old man was shot in the throat, and he was taken in critical condition to the same hospital. A 20-year-old man was shot in the left shoulder, and his condition was stabilized at the same hospital.\nAbout 2:30 a.m., a 24-year-old man was wounded in a drive-by shooting in the 9200 block of South Parnell Avenue in the Brainerd neighborhood. He was going inside a home when someone in a passing car shot at him, striking him in the right leg, police said. His condition was stabilized at Little Company of Mary Hospital.\nIn the Englewood neighborhood, a 26-year-old woman was shot in the left arm in a drive-by shooting about 2:20 a.m. in the 200 block of West 71st Street, police said. She was getting out of her car when someone in a passing car opened fire, wounding her in the arm. She was in good condition at St. Bernard Hospital.\nAbout 2:15 a.m. on the Far South Side, a 29-year-old woman was grazed in the left leg while she was on the sidewalk in the 9500 block of South State Street in the Longwood Manor neighborhood, police said. She was with a group of people when someone began shooting at them. She was treated by paramedics at the scene, but she did not want to seek further medical attention.\nJust before 2:15 a.m. on the South Side, a 22-year-old man was grazed in the eyebrow during a shooting in the 200 block of East Pershing Road in Bronzeville, police said. His condition was stabilized at Stroger Hospital.\nThree people were shot at a house party about 2 a.m. in the 4400 block of South Indiana Avenue in the Bronzeville neighborhood. An unidentified man entered the party and opened fire. A 31-year-old woman and a 33-year-old man were each shot in the chest. Both were taken to Stroger Hospital, where their conditions were stabilized. A 20-year-old man was shot in the left hand, and he was in good condition at Mercy Hospital.\nIn the Near West Side neighborhood, a 23-year-old woman was shot in the back in a drive-by shooting about 1:40 a.m. in the 2300 block of West Jackson Boulevard, police said. The victim was inside a car when someone inside another car began shooting. Her condition was stabilized at Stroger Hospital.\nTwo people were wounded in a drive-by shooting about 1:05 a.m. in the 5500 block of West Drummond Place in the Cragin neighborhood, police said. A 21-year-old man was shot in the chest, and he was taken in serious condition to Loyola University Medical Center in Maywood. A 19-year-old man was shot in the back, and his condition was stabilized at Loyola University Medical Center.\nAbout 11:20 p.m. Saturday, two people were shot while they were standing on a porch in the 900 block of North Karlov Avenue in the Humboldt Park neighborhood, police said. A 23-year-old woman was wounded in the chest and right hand. She was in serious condition at Stroger Hospital. A 25-year-old man was shot in the right leg, and his condition was stabilized at Mount Sinai Hospital.\nAbout 8:35 p.m., a 19-year-old man was shot in the right arm and groin while he was in the alley of the 7200 block of South Coles Avenue, police said. His condition was stabilized at Northwestern Memorial Hospital.\nA 38-year-old man was shot about 6:20 p.m. in the 3700 block of South Wabash Avenue in the Bronzeville neighborhood. He was standing outside when someone inside a brown sedan shot at him before driving away. The 38-year-old man was taken in good condition to Northwestern Memorial Hospital.\nAnother shooting happened about 5:30 p.m. in the 4300 block of South Wolcott Avenue in the Back of the Yards neighborhood. A 32-year-old man was walking when a red car pulled up and he heard shots and realized he'd been shot in the elbow. He was taken to Stroger Hospital in good condition, police said.\nAbout 3:50 p.m. in the 4400 block of South Marshfield Avenue in the Back of the Yards neighborhood, two men were shot. According to preliminary reports, the two men, ages 22 and 27, were outside standing next to a vehicle when a green van pulled up and someone inside opened fire, police said. The younger man was shot in the buttocks, and the other man suffered a graze wound to the arm. The men drove to Stroger Hospital, where they were listed in good condition, police said.\nAbout 1:55 p.m., a 32-year-old man was wounded in the 4000 block of West 21st Place in the city's Lawndale neighborhood, police said. He was shot in the hip and arm, and he was taken in good condition to Mount Sinai Hospital, police said.\nAnother shooting happened shortly before 1 p.m. in the 5600 block of Corcoran Place and seriously wounded a 15-year-old boy. The boy was outside when an altercation began inside a business that then spilled outside. During the fight, a shot was fired and the boy was struck in the abdomen, police said. He was taken to Stroger Hospital in serious condition, police said.\nChicago Tribune's Gregory Pratt and Katherine Rosenberg-Douglas contributed."}