{"uri": "http://www.burlingtonfreepress.com/story/news/local/2015/08/08/berlin-police-investigate-multiple-deaths-home/31332927/", "title": "Relative: 3 slain in Berlin linked to DCF suspect", "dct": "Sat, 08 Aug 2015 00:00:00 GMT", "id": "35ee883696a46f2d1e5d61cb6855f06a", "content": "GLENN RUSSELL/FREE PRESS\nBERLIN — Three people found slain Saturday morning in Berlin are relatives of the woman suspected of killing a Vermont social worker Friday in Barre following a child-custody dispute, a daughter of one of the latest victims says.\nDead are two sisters, Rhonda Herring and Regina Herring, and their mother, Julie Ann Falzarano, according to a family member.\nThe sisters are in their 40s, said Tiffany Herring, 23, who identified herself as the daughter of Rhonda Herring. Falzarano is in her 70s. The information about the victims was confirmed by Gov. Peter Shumlin and other Vermont public-safety officials during a Saturday-night news conference.\nTiffany Herring said she discovered the bodies at about 8 a.m. Saturday when she and a friend went to the family's farmhouse on Airport Road in Berlin.\n\"Both doors were wide open, and I walked into the living room, and that's where I saw my mom dead,\" Tiffany Herring told the Burlington Free Press.\nTiffany Herring said Rhonda and Regina Herring are cousins of Jody Herring, 40, the suspect in Friday's killing.\nJody Herring of Barre Town was tackled by bystanders and witnesses at about 4:45 p.m. Friday after fatally shooting Vermont Department for Children and Families case worker Lara Sobel outside her office building in downtown Barre, police said.\nBarre police immediately arrested her. The shooting, authorities said, was connected to Jody Herring's loss of custody of her 9-year-old daughter July 10.\nBarre City Police Chief Tim Bombardier said during a Friday evening news conference the two women on Friday had known each other \"as a result of cases in family court involving DCF and Jody Herring and some child custody issues, child welfare issues, the last one of these being July 10 of this year.\"\nJody Herring is being held without bail on a first-degree murder charge at the Chittenden Regional Correctional Facility in South Burlington, a jail spokesman said. She is due in court at 1 p.m. Monday on charges related to that ambush. The police had provided no new information by 5:30 p.m. Saturday about whether additional charges would be added.\nThe three victims in Berlin were shot to death, Tiffany Herring said.\nIt was not immediately clear who owned the Airport Road home.\nThe police and Vermont Public Safety Commissioner Keith Flynn have said only that they are investigating a possible link between the Berlin slayings and Friday's shooting in Barre.\nBerlin police said Saturday morning it was premature to comment on the victims' cause of death. They declined to provide additional details, including when the three victims are believed to have been killed.\nNo information was available from the authorities about the filing of charges related to Saturday's incident. Police, who held a news conference about four hours after Friday's fatal shooting, said they did not plan to hold a news conference Saturday.\nTiffany Herring told the Burlington Free Press that it appeared Folzorano was shot in bed, while Rhonda Herring showed signs of a struggle.\nJody Herring had called Rhonda Herring on Friday morning, Tiffany Herring said.\n\"My mother got a call in the morning, maybe 7:30 or 8 o'clock, saying it was Jody Herring, saying 'You guys need to stop calling DCF unless you guys are going to have it coming to you,'\" Tiffany Herring said.\nSaturday, a joint command post was being established in Barre City, the Berlin police said.\nPolice and prosecutors eventually issued a joint new release shortly after 3:30 p.m., but offered few new details that the Herring family and others had not provided throughout the day. It offered confirmation for some of the Free Press news reports posted online during the day.\nWhile Herring family members provided the names of the victims to the Free Press, the news release said investigators wanted to withhold the names until family members could be notified and identities confirmed.\nThe release confirmed Berlin police received a 911 call at 8:02 a.m. Saturday from a woman saying there was three dead women inside a home at 3168 Airport Road. A Berlin Police officer later confirmed the three women were deceased and reported shell casings were at the scene. At least two victims had apparent gunshot wounds.\nThe release confirmed other statements from Herring family members that the victims were related to Jody Herring, who was arrested on charges she fatally shot a DCF worker in Barre City on Friday afternoon.\nThe release also confirmed statements made by police Saturday morning that investigators are exploring the possible connection between the shooting on Friday and the bodies found on Saturday.\nThe bodies were to be transported to the Office of the Chief Medical Examiner in Burlington for autopsies to determine cause and manner of death.\nThe release said Berlin police requested help from state police. Detectives and members of the Major Crime Unit, the Crime Scene Search Team and Mobile Command Post responded.\nThe police and prosecutors said they would not provide the public any additional information pending further investigation.\nSaturday's investigation is centered on a white farmhouse at 3182 Airport Road across from the entrance to an office for Blue Cross/Blue Shield of Vermont.\nThe site had been cordoned off with yellow crime scene security tape, while investigators wait for the Vermont State Police Crime Lab staff to arrive and to apply for search warrants.\nAn SUV and a sedan were parked in the driveway Saturday. Two folding picnic chairs — one red and one blue — were on the porch.\nTwo marked police cruisers from the state police and one from the Berlin police also were securing the scene. Barre City and state police officers stopped by to check in and continued on throughout the day.\nAt one point around noon, about 200 motorcyclists carrying toys as part of a morning toy run had passed by the scene\nFriday's victim, Lara Sobel, worked for DCF for more than 14 years. She was shot twice with a \"fairly high caliber hunting rifle\" as she left the office at about 4:45 p.m., the police said Friday.\nShumlin issued this statement Saturday:\n\"The Vermont State Police are working collaboratively with the Barre and Berlin police and the investigation remains ongoing. Vermonters should know that there is no indication of a broader threat at this time to state employees or the general public. The tragedy that has gripped our state over the past 20 hours is immense. In the coming days we will need to pull together as a state to come to terms with these heinous events. My heart goes out to all the families, friends, and loved ones who have been affected by these tragedies.\"\nVigil for Lara Sobel on Sunday\nDepartment for Children and Family workers and members of the Vermont State Employee Association will hold a vigil Sunday in memory of shooting victim Lara Sobel. VSEA posted this information on their Facebook page.\nAt 4 p.m. Sunday, vigil participants will gather at Old Labor Hall, 46 Granite St. in Barre and then at 5 p.m. they will march to Barre Place, scene of the shooting.\nSen. Bernie Sanders, I-Vt., statement:\n\"Today is tragic day for Vermont. In the past 24 hours, a public servant was murdered and three other Vermonters were killed in circumstances that are not yet clear. My thoughts and prayers are with the victims' families and friends. As is always the case, I know Vermonters will rally together in the aftermath of this horrible tragedy because that is what we do in a crisis. I have contacted Gov. Shumlin and I am confident there will be a full investigation into what happened and why.\"\nThis story was first posted online Saturday, Aug. 8, 2015. Contact Mike Donoghue at 660-1845 or mdonoghue@freeepressmedia.com. Contact Zach Despart at 651-4826 or zdespart@freepressmedia.com."}