{"uri": "http://nbc4i.com/2016/10/26/family-searching-for-answers-after-two-year-old-shot-and-killed/", "title": "Family searching for answers after two-year-old shot and killed", "dct": "Wed, 26 Oct 2016 21:39:00 GMT", "id": "9b8ab32f4f46ed1aad91b7dd5ea2bf90", "content": "COLUMBUS (WCMH) – Leslie Stanford stared into the distance as she recalled the wrenching moment her husband told her their granddaughter had been shot and killed.\n“He threw his keys on the kitchen table, and I said, ‘Where’s the baby?’”Stanford said. “And he said, ‘She’s dead. She’s dead. They killed her. They killed our baby.’”\nAmiyah Bice, who turned two years old on Sunday, died Tuesday in a shooting in southwest Columbus. Her parents, Jessica Stanford and Julian Bice, were taken to the hospital with gunshot wounds.\n“Amiyah was the apple of everybody’s eye,” Leslie Stanford said. “She was a very smart child, smarter than any two-year-old should be.”\nThe shooting happened just after 6 p.m. on Parkwick Drive in southwest Columbus. Police said Norman Robert Burke and another unidentified suspect fired multiple shots at the victims.\nBurke was also shot in the incident, though it wasn’t clear by whom he was shot. Police said they found Burke east of the crime scene.\nAmiyah died at Nationwide Children’s Hospital Tuesday evening. According to Leslie Stanford, her daughter Jessica, 25, went into surgery on Tuesday and was doing well.\n“This monster who shot her—my daughter who was once beautiful is now going to be scarred for life,” Stanford said. “She was shot in the face. She has a bullet lodged in her cheek.”\nJessica was released from the hospital on Friday.\nBurke, who was taken to Grant Medical Center, has been charged with two counts of felonious assault and one count of murder.\nLeslie Stanford said she wants the second, still-unidentified suspect in the shooting to turn himself or herself in to police.\n“You know who you are, and anyone who knows who they are, turn yourself in,” Stanford said. “If it was your baby, your grandbaby, you would want the same.”"}