{"uri": "http://www.wrcbtv.com/story/31476389/woman-shot-on-lewis-street", "title": "UPDATE: Autopsy report says woman died due to shotgun wound to neck", "dct": "Tue, 15 Mar 2016 19:24:00 GMT", "id": "64e09ae128589f6083de879f24404e6a", "content": "CHATTANOOGA, TN (WRCB) -\nUPDATE: An autopsy report says 19-year old, Carly Ellis died as a result of a shotgun wound of neck and chest.\nIn March, Ellis was shot and killed due to negligence discharge of a firearm.\nA man discharged the shotgun from an adjacent room, the bullet traveled through a door and a wall and struck Ellis in the neck. ?\nPREVIOUS STORY: Barbara Nolan who doesn't want her face shown says she was in the bed when Carly Ellis was shot in the neck at this home on Lewis Street.\n“And I had a knock on the door, and the neighbor said there has been a shooting. So I got up and went out the door,” said Nolan\nChattanooga Police says the suspect shot a gun in the room next to where Ellis was located.\nThe bullet went through the wall, killing the 19-year-old girl.\nNolan said she just couldn't believe it.\n“I’m still sad that it happened, and the tragedy that's happened along with it,” said Nolan.\nShe says most of the gunfire happens blocks from her house.\n“We may have some petty thievery around here, but not shootings,” said Nolan.\nWhen she found out more details, Nolan says it brought back chilling memories from events in her own life.\n“I’ve had a lot of experiences, and personal experiences with tragedy, and those with other memories of the community,” said Nolan.\nNolan who is a gun advocate wants people to be careful around them.\n“As far as I’m concerned, there is no such thing as an unloaded gun. I’m 73 and I can say that,” said Nolan.\nChattanooga Violent Crimes Investigators are consulting with Hamilton County’s District Attorney to determine if charges will be filed against the 22-year-old male suspect.\nPREVIOUS STORY: A woman was shot and killed due to negligent discharge of a firearm, on Tuesday afternoon.\nChattanooga Police responded to the 1200 block of Lewis Street on the report of a person shot. Police found one victim suffering from a single gunshot wound to the neck.\nThe man discharged a weapon in a room adjacent to the victim's location. The victim, Carly Ellis, 19, was struck in the neck by a bullet which came through a wall, and succumbed to her injuries.\nChattanooga Violent Crimes Investigators detained and interviewed the man. Chattanooga Violent Crime Investigators are consulting with Hamilton County District Attorney to determine if charges will be filed.\nStay with Channel 3 as this story develops."}