{"uri": "http://www.kxxv.com/story/29085892/police-respond-to-shooting-between-biker-gangs-at-restaurant", "title": "9 dead, dozens injured in biker gang shooting at local restaurant", "dct": "Sun, 17 May 2015 18:18:00 GMT", "id": "d94f9e5e560bd9d3d84138489091cc44", "content": "WACO, TX (KXXV) - Police have confirmed nine motorcycle gang members are dead as a result of a shooting between rival biker gangs in the parking lot outside Twin Peaks located in the Central Texas Marketplace in Waco.\nPolice on scene confirm the shooting started about 12:15 p.m. Sunday afternoon and involved as many as five biker gangs and close to 200 bikers. The shooting reportedly started after an argument inside the Twin Peaks bathroom escalated to the parking lot.\nWaco PD Sgt. Patrick Swanton says the fight \"started as a fist fight, escalated to a knife fight, then to a gun fight.\" Police report there were shots fired both inside and outside the restaurant.\nPolice say restaurant management had been aware that the gangs frequented their restaurant and officers had been out to that restaurant before to deal with these types of problems.\nThere were nine fatalities and dozens of injuries reported, but no word yet on the exact number of those injured or their condition. Police say all those injured were gang members.\n\"In my 35 years in law enforcement, this is the most violent and gruesome experience I have dealt with in that time period,\" Sgt. Swanton said.\nNo police officers were injured during the shooting. At least 18 gang members were taken to local hospitals, mostly with gunshot or stab wounds. Police are still going over the crime scene, and as of 7 p.m. Sunday, there were still bodies in the Twin Peaks parking lot as police worked the scene.\nWe're told police officers and SWAT had been warned and were there as it unfolded. Some customers inside the local restaurants crawled into the freezer and hid as gunfire started.\nPolice recovered chains, knives, bats, clubs, and firearms from the scene. There could have possibly been over 100 weapons. As of Monday morning, 192 people were arrested and booked into the McLennan County Jail on organized crime charges.\nArrests had also been made earlier in the day, before the shooting. Police say bikers from across the state could be flocking to Waco. They have upped presence even more in Waco and McLennan County.\nMultiple law enforcement agencies have been called to assist. Medical personnel from as far away as Limestone County are being called to the scene.\nNearby restaurants Don Carlos and Twin Peaks were locked down for a time and later cleared. Police closed the entire Central Texas Marketplace for safety reasons Sunday evening. The nearby Walmart on Franklin Ave. was also closed Sunday night.\nStores between Cabela's and Best Buy in Central Texas Marketplace will be closed Monday as the investigation continues. Stores from Ashley's Furniture to Kohl's will be open.\nTABC has confirmed they have suspended Twin Peaks liquor license for seven days to investigate if they were negligent as it concerns to customer safety. They could extend that suspension. The restaurant will be closed for a week.\nTwin Peaks sent out the following tweet following the deadly shooting: \"Our thoughts and prayers are with the families and victims of the tragedy at franchise partner's restaurant in Waco.\"\nJay Patel, Operating Partner for the Twin Peaks Waco franchise issued the following statement:\n\"We are horrified by the criminal, violent acts that occurred outside of our Waco restaurant today. We share in the community's trauma. Our priority is to provide a safe and enjoyable environment for our customers and employees, and we consider the police our partners in doing so. Our management team has had ongoing and positive communications with the police and we will continue to work with them as we all want to keep violent crime out of our businesses and community. We will continue to cooperate with the police as they investigate this terrible crime.\"\nStay with News Channel 25 for new information as it becomes available."}