{"uri": "http://www.latinospost.com/articles/24297/20130724/5-shot-revenge-shooting-brooklyn-park-suspect-police-custody-massachusetts.htm", "title": "5 Shot in Revenge Shooting in Brooklyn Park, Suspect in Police Custody in Massachusetts", "dct": "Wed, 24 Jul 2013 20:37:00 GMT", "id": "6dcf0bf5ea727cd31ce3d1525c4eecd5", "content": "A 23-year-old man, identified as Curtis Peterson, shot and wounded five people in Brookly on Saturday, reported Metro. Police confirmed that Peterson is under custody in Massachussets, according to Brooklyn News, and that he will be brought back to New York to face charges.\nThe victims were two women, ages 37 and 52, and three men, ages 22, 45 and 67. All victims were taken to the hospital and are listed to be in stable condition. The incident took place near 191 Menahan St. in Bushwick at around 2 p.m., when Peterson allegedly pulled out a gun and started shooting the group, Metro reported. After he finished, he fled, police said.\nWhen the shooter opened fire, Wanda Espinoza, 52, was sitting outside her house with Manuel Rivera, 62. She was shot in the stomach, while the man was hit in a leg.\nThe police stated a 9mm Taurus semiautomatic handgun was found at the shooting scene. According to the New York Post, Peterson may have committed an act of revenge against Rolando Pizarro, the 45 year-old, who was allegedly the intended target.\nPizarro was walking with his wife, Melody Amil, 37, and son, Rolando Jr., 22, when the shooting started. On Friday, he had filed a police report against the shooter because Peterson was harassing his daughter at the McDonald's she worked at, reported the New York Post.\nPeterson and several other men flirted with Pizarro's 18 year-old daughter at the fast food restaurant located on Knickerbocker Avenue. Her family reported that after the girl turned them down, one of the men threw a milkshake in her face.\n\"They were making advances and teasing her and harassing her,\" said Ivette Miranda, a family friend. \"She called her dad, and he went there, to the McDonald's, and called the cops. He filed a police report right there.\"\nThe manager of the restaurant said Pizzaro warned the men to leave his daughter alone. \"Those guys are bad men. They wanted to get back at Rolando,\" Miranda said, according to the New York Post.\nAmil's sister, Lisa, said \"Melody was shot in the knee. She'll be OK. I can't believe they would shoot into a street full of people. This is just over a girl or something. It's just so senseless.\"\nResidents and community leaders are requesting stricter gun laws. The NYPD released a surveillance video where Peterson can be seen shooting the crowd outside Hope Ballfield on Menahan Street."}