{"uri": "http://www.thegazette.com/subject/news/public-safety/linn-county/three-in-custody-in-cedar-rapids-following-reports-of-woman-shot-in-the-head-20160927", "title": "Vigil mourns 13-year-old girl killed in Tuesday shooting", "dct": "Tue, 27 Sep 2016 22:17:00 GMT", "id": "978420788f553d519c6c7e0e119bc70a", "content": "CEDAR RAPIDS — More than a hundred people gathered Tuesday night near the 1500 block of Eighth Avenue SE Rapids — the scene where police said a 13-year-old girl died from a gunshot to the head hours earlier.\nFamily, friends and community members held candles and balloons in remembrance of the girl, who they named as Reshia, as many pleaded with the young people present to stand against gun violence.\n“I never get to see my sister again,” Reshia’s sister said to the crowd through tears. “You don’t know how I feel. She’s 13 years old. My sister is 13. Put your guns down.”\nPolice had not yet released the name of the girl. Three suspects in her death — two juveniles and one young adult — were in custody and a homicide investigation was underway, Cedar Rapids Police Chief Wayne Jerman said Tuesday.\nPolice said they had not yet determined what led to the shooting, but a firearm was recovered.\nMany people at the vigil were distraught and frustrated at the number of recent shooting deaths that have been linked to Cedar Rapids teenagers.\nThree have been charged in connection to shooting deaths in a little more than a year.\n“I pray God makes them understand these guns are not toys,” Tammi Williams, a mother at the vigil, said. “These are babies. So many guns are among these babies.”\nLast September, Robert Humbles, then 14, shot and killed Aaron Richardson, 15. In March, 15-year-old Senquez Jackson died less than 24 hours after police say he was shot by 13-year-old Dennis Warren.\nThe day after Jackson was shot in March, Kanyauta Vesey-Keith, 16, shot Brandon Johnson, 21, and a 16-year-old during a fight, police said. Johnson died from his injuries.\nIn this shooting, Cedar Rapids Public Safety spokesman Greg Buelow said police received a call at 7:52 a.m.\nWithin 10 minutes, officers were on the scene and saw three young men running in the area. Following a foot chase involving a police dog, Buelow said two of the suspects were caught in the 1500 block of Bever Avenue SE and the other was caught in the 1500 block of Washington Avenue SE.\nPolice believe that all suspects involved in the shooting are in custody.\nThe victim was found outside, but Buelow said police are investigating whether she was in a car parked in a driveway in the 1500 block of Eighth Avenue SE at the time of the shooting.\nBuelow said witnesses reported hearing three men in the alley between 15th and 16th Avenues.\nThe 13-year-old girl was taken to a local hospital and then to the University of Iowa Hospitals and Clinics, Buelow said. She was pronounced dead at the UI hospital.\nJerman said he was “disgusted” by the violence.\n“With everything the city has been facing, whatever caused this, I just don’t understand,” he said.\nLee Hermiston of The Gazette contributed to this report."}