{"uri": "http://5newsonline.com/2016/08/10/sebastian-county-deputy-hackett-police-chief-shot-in-sebastian-county/", "title": "Sebastian County Deputy Killed, Hackett Police Chief Grazed By Bullet, Suspect Taken Into Custody", "dct": "Wed, 10 Aug 2016 07:55:00 GMT", "id": "4bbb0ac96ca68fb359ed180149a197fc", "content": "SEBASTIAN COUNTY (KFSM) — A Sebastian County deputy was killed Wednesday (Aug. 10) and the Hackett police chief was grazed by a bullet while responding to a call of a disturbance, according to Sebastian County Sheriff Bill Hollenbeck.\nSebastian County Deputy Bill Cooper and Hackett Police Chief Darrell Spells were both shot just after 7:30 a.m. while responding to a call at a home at 4722 Highway 253 in Greenwood. Both officers were taken to Sparks Hospital in Fort Smith.\nCooper was shot in the neck and underwent surgery for his injuries, but was pronounced dead at 1:15 p.m., Hollenbeck said.\nChief Spells was released from the hospital shortly after 10:30 a.m. A woman who claims to be Spells’ mother said her son’s head was grazed by a bullet.\nAuthorities identified the suspect as Billy Monroe Jones, 35, of Greenwood.\nDispatchers received a call around 7 a.m. that Jones had come to his father’s home to take some tools and pulled a gun on his father, according to Hollenbeck.\nOfficers began arriving at the home just before 7:10 a.m. and reported Jones had a rifle pointed at law enforcement and may have been wearing some sort of ballistic vest, Hollenbeck said. Authorities were informed Jones had been due in court Wednesday morning on a petition to revoke a suspended sentence, according to the sheriff’s office.\nJones started shooting at officers around 7:15 a.m. and Cooper was shot around 7:40 a.m., Hollenbeck said. A few minutes later, Spells was grazed by a bullet, he said.\n“Immediately when three officers got [to the house] they were basically ambushed,” Sgt. Daniel Grubbs with the Fort Smith Police Department said. “The information we have received right now is it appears this guy was waiting for us to get here. It seems [he had] full intent to inflict violence against us.”\nOther deputies braved gunfire to pull Cooper and Spells from the scene to bring them to EMS, so they could be taken to the hospital, according to the sheriff’s office.\n“When the shots were fired, [the officers] were pinned down for quite a time before we could get them out and to medical attention,” Grubbs said.\nA Greenwood K-9 was also believed to have been shot during the gunfire exchange with Jones, according to Greenwood Police Chief Will Dawson.\nJones also shot a police robot and disabled it. He eventually surrendered to authorities around 11:45 a.m., according to Hollenbeck. He waved a white towel out the window, walked out of the home with his hands up, and laid down on the ground to be handcuffed, authorities at the scene said. A bomb squad was also called to Jones’ home because investigators heard he had a license to work with explosives.\nHighway 253 was blocked in both the north and southbound directions for several hours while the incident unfolded. About 300 personnel from multiple law enforcement agencies responded to aid in the search and then later the negotiation with Jones.\nJones was taken to the Crawford County Detention Center, authorities said.\nCurrently, Jones is facing charges of two counts of felony first-degree battery and possession of firearms by certain persons, according to the Sebastian County prosecutor’s office. Formal charges have not yet been filed and more charges are likely to be added.\nJones’ prior court records include:\n2007: manufacture and possession of a controlled substance, schedule IV, V\nSentenced to 60 months suspended sentence\n2011: theft of property\nSentenced to 60 months suspended sentence\nFebruary 2016: possession of firearms by certain persons, possession of a controlled substance, scheduled I and II\nFlags were lowered to half-staff at the Sebastian County Sheriff’s Office in honor of Deputy Cooper and Police Chief Spells.\nCooper had been with the Sebastian County Sheriff’s Office since 2001 and prior to that had been employed by the Fort Smith Police Department for five years. He was also a Marine Corps veteran.\nA Deputy Bill Cooper Memorial Fund has been set up at Farmer’s Bank, and donations can be made at any branch of the bank in the area, according to a SCSO post. Cooper’s family will receive 100% of the donations.\nAdditionally, there is also a donation fund for K-9 officer Kina set up in Farmer’s Bank, which is under Kina Sebastian County Canine Unit.\nArkansas Gov. Asa Hutchinson released the following statement in response to Cooper’s death:\nI am deeply saddened by the news that Sebastian County Sheriffs Deputy Bill Cooper has passed away after being shot in the line of duty this morning. Today’s shooting incident, which also resulted in injuries to Hackett Chief of Police Darrell Spells, tragically illustrates the dangers our law enforcement officers face each and every day to keep us safe.\nOn behalf of all Arkansans, I want to extend our heartfelt condolences to Deputy Cooper’s loved ones and our entire law enforcement community. We stand with you during this difficult time.\nArkansas Attorney General Leslie Rutledge also released a statement:\nSheriff’s Deputy Bill Cooper gave his life protecting the citizens of Sebastian County and for that we are forever grateful,” said Attorney General Rutledge. “Deputy Cooper showed enormous courage in the line of duty and in the face of incredible danger. This terrible incident is a reminder to all Arkansans of the threatening situations members of law enforcement put themselves in each and every day in order to shield their neighbors from harm. They deserve our support and appreciation for all they do. As Arkansas’s chief law enforcement officer, I extend my thoughts and prayers to Deputy Cooper’s family, friends and brothers and sisters in law enforcement across our State, as well as Hackett Chief of Police Darrell Spells, who was also injured in today’s tragic incident.\nArkansas U.S. Sen. John Boozman also released this statement:\nDeputy Cooper was a dedicated member of the Sebastian County Sheriff’s Office who put his life on the line every day to defend our community. He was a brave hero who led a life of service and died serving and protecting the people of Arkansas. I join with all Arkansans as we mourn the passing of this selfless servant and keep his family and loved ones and all of the law enforcement community in our thoughts and prayers.\nA statement was also released by Arkansas U.S. Sen. Tom Cotton:\nI join all Arkansans in mourning the death of Sebastian County Deputy Bill Cooper. A military veteran and 20-year member of Arkansas law enforcement, Deputy Cooper dedicated his life to protecting our state and our country. He served honorably and put his life on the line each and every day to make Arkansas a safer place. I extend my deepest condolences to Deputy Cooper’s loved ones and I will continue to lift them up in prayer. I hope that in their pain, they can take comfort knowing Arkansas is a better place because of Deputy Cooper and those who served with him."}