{"uri": "http://abcnews.go.com/US/police-officers-shot-sebastian-county-arkansas/story?id=41267262", "title": "1 Police Officer Dead, Another Injured in Arkansas Shooting", "dct": "Wed, 10 Aug 2016 17:16:00 GMT", "id": "ca01ddd0fe7471b4b17a609559d73c45", "content": "A standoff at an Arkansas home Wednesday morning has killed one police officer and injured another, Sebastian County Sheriff Bill Hollenbeck said in a press conference today.\nAround 7 a.m. local time, a 911 call was made by the father of 35-year-old Billy Monroe Jones, Hollenbeck said. Jones had reportedly pulled a gun on his father. Police were dispatched to Jones’ home in Sebastian County, Arkansas, and found him holding a rifle and wearing body armor, Hollenbeck said. The officers then took cover as Jones began to fire multiple rounds.\nMembers of several SWAT teams responded to the scene and rescued citizens who were trapped in the line of fire, Hollenbeck added.\nJones continued to fire rounds from \"time to time,\" Hollenbeck said. He also shot and disabled a police robot that was being used to gather intelligence. Jones surrendered to police nearly five hours later and was taken into custody by Arkansas State Police.\nA total of 200 law enforcement personnel responded to the scene, Hollenbeck said.\nA search of the home revealed a \"certain amount of explosive materials,\" Hollenbeck said. The fire department's bomb squad was deployed to clear the home, which is still an active crime scene.\nSebastian County Sheriff's Deputy Bill Cooper was pronounced dead at 1:15 p.m. after undergoing several surgeries. He sustained a gunshot wound to his neck, Hollenbeck said. The 65-year-old had been employed with the Sebastian County Sheriff's Office since 2001 and was nearing retirement. He \"loved his job,\" Hollenbeck said.\nHackett Chief of Police Darrell Spells was grazed by a bullet and has been released from the hospital, according to the Hackett City Police Department. A police dog was also shot on the scene.\nJones was due in court today for previous charges, Hollenbeck said.\nArkansas Gov. Asa Hutchinson said in a statement that he was \"deeply saddened\" by the shooting.\n\"I am deeply saddened by the news that Sebastian County Sheriffs Deputy Bill Cooper has passed away after being shot in the line of duty this morning,\" Hutchinson said. \"Today’s shooting incident, which also resulted in injuries to Hackett Chief of Police Darrell Spells, tragically illustrates the dangers our law enforcement officers face each and every day to keep us safe.\""}