{"uri": "http://www.wbir.com/story/news/2015/10/04/fatal-shooting/73329258/", "title": "Services set for 8-year-old White Pine shooting victim", "dct": "Mon, 05 Oct 2015 00:00:00 GMT", "id": "a1301639d09a1112d02f47a1f4dd89fc", "content": "UPDATED STORY: (WBIR - WHITE PINE) The family of an 8-year-old White Pine girl who authorities say was shot and killed by an 11-year-old neighbor will receive friends Wednesday night.\nMaKayla Dyer died Saturday night, according to Jefferson County Sheriff Bud McCoig, after the boy shot her with a shotgun in the chest. Deputies were called to Robin Road in White Pine around 7:30 p.m. Saturday.\nShe attended second grade at White Pine Elementary School, the same school attended by the boy, according to McCoig.\nThe family will receive friends 5-7 p.m. Wednesday, and funeral services will follow at Cooke-Campbell Mortuary Chapel.\nInterment will be at 2 p.m. Thursday at the Haun Cemetery in Luttrell.\nThe family is asking that in lieu of flowers, donations be made to help with funeral expenses at Cooke-Campbell Mortuary in Maynardville.\nThe boy has been charged as a juvenile in the case. His name has not been released.\nAccording to neighbor Chasity Arwood, the boy was in his home at the time of the shooting, in a bedroom. The shooting happened near her home, Arwood said. She said MaKayla lived nearby with her two older siblings and mother.\nAt the time, MaKayla was playing across the road with neighbors -- outside the boy's home-- when she and the boy had a conversation through his open window.\n\"He asked the little girl to see her puppies. She said no and laughed and then turned around, looked at her friend and said, 'Let's go get the --' and never got 'puppies' out.\"\nThe boy had shot Makayla with a shotgun, according to Arwood.\n\"Seeing a baby laying there and not being able to help - it is really heartbreaking. I mean, it is. It's heartbreaking,\" she told 10News.\nThe family was grief-stricken.\n\"Trying to comfort her mama and her aunt and her grandma and her grandpa and her sister and her brother was the hardest thing I ever had to do. Ever had to do.\"\nWhite Pine School principal Bill Walker says there are extra counselors this week, as students return from the weekend to a school that is now without one of its own.\n\"It's not just the school that's hurting, it's the whole community.\"\nHe said MaKayla was a beautiful little girl and a great student.\n\"We remember her smile and her beautiful face and her interaction with her classmates with all of us as a and staff.\">\nPREVIOUS STORY: The Jefferson County sheriff said that an 11-year-old boy shot and killed an 8-year-old girl who lived next door.\nAuthorities were called to Robin Road in White Pine around 7:30 p.m. Saturday on a report of a shooting.\nDeputies found the girl on the ground with a gunshot wound to the chest. She was taken to Morristown-Hamblen Hospital, where she was pronounced dead.\nSheriff Bud McCoig said the young girl's next-door neighbor, a fifth grader at White Pine Elementary School, used his father's 12-gauge single-shot shotgun to shoot and kill the girl from inside his house. The victim was in second grade at the same school.\nOfficials have not released the name of the shooter or the victim, but neighbors identified the victim as Maykayla Dyer.\nWhite Pine Elementary School principal Bill Walker held a news conference on Monday morning.\n\"The emotions of our staff are so great when something like this happens that we're all trying to love on and pray for and protect all of students,\" Walker said. \"We got together as a staff yesterday and had our emotional time with each other, to try to prepare for today. I don't think that you can prepare for when you walk in and see students that are hurting.\"\nWalker also issued a statement before taking questions from the media on Monday.\n\"White Pine community has experienced a tragedy, with a shooting death of a student. The staff of White Pine School and Jefferson County Schools are saddened by this incident, but want to assure parents and community that counselors are on site to assist students and staff,\" Walker said. \"Resources are available for parents. Support will be continued, as needed, for the school. Our thoughts and prayers are with those involved from both families.\"\nSheriff McCoig would not release any details on a possible motive, but neighbors say the two were arguing over a puppy.\n\"Wanting to see a puppy, the little girl laughed and told him no, and that was it,\" neighbor Chasity Arwood said.\nThe boy was charged with first-degree murder in juvenile court and is in custody. A detention hearing is scheduled for 11 a.m. on Monday. A judge could determine at a later date if the cause should be transferred to adult court.\nSheriff McCoig said this has been a very tough case for his department to handle. He said the entire community was hurting and they're getting through it \"by the grace of God.\"\nJefferson County Sheriff's Department, White Pine Police Department and Jefferson County EMS responded. Sheriff McCoig says an autopsy has been ordered for the victim.\n\"We lost an 8-year-old child, and our department is hurting,\" McCoig said.\nSheriff McCoig said the shooting happened in a neighborhood where all the kids knew each other and played together. The murder has shaken up the neighborhood and parents say their children are having a tough time handling it.\n\"Watching the Tennessee football game, heard the bang,\" neighbor Chasity Arwood said. \"And then everybody screaming that he shot her baby girl.\"\n\"It breaks my heart because it's my niece and daughter's best friend,\" neighbor Misty Edwards said. Edward's niece, Hannah, was playing with Makayala and witnessed what happened.\nSheriff McCoig said the boy came from a family with six children. They can not say if he had any mental problems right now, but DCS is investigating.\n\"Guns should be under lock and key if you have a child, nowhere in arms reach of a child,\" Chasity Arwood said.\nPrevious story\nAn 8-year-old girl is dead following a shooting in Jefferson County. Authorities responded to Robin Road in White Pine at around 7:30 p.m. Saturday. Jefferson County Sheriff's Office, White Pine Police and Jefferson County EMS responded to that call.\nWhen they arrived, they found the 8-year-old lying on the ground with a gunshot wound in the chest. Crews took the girl to Morristown Hamblen Hospital, where she later died.\nOfficials recovered a 12-gauge shotgun and BB pistol. An 11-year-old boy is in custody and charged with first degree murder. An investigation in ongoing."}