{"uri": "http://www.thebrunswicknews.com/breaking/husband-and-wife-dead-daughter-in-hospital-after-apparent-murder/article_64785992-989d-5a5e-89c0-b23e92c33dcd.html", "title": "Husband and wife dead, daughter in hospital after apparent murder/suicide", "dct": "Sun, 21 Aug 2016 00:00:00 GMT", "id": "f3d5002868819125cc320ea3ecde14dc", "content": "Jesus Diaz, 24, displayed typical good nature during his night shift Saturday at a resort on St. Simons Island, said Lila Panek, the man’s friend and co-worker.\nNothing in his behavior indicated that several hours later he would shoot his 21-year-old wife, Emiko Diaz dead, wound his 6-year-old daughter, Eva Diaz, and turn the gun on himself in a murder-suicide early Sunday morning at the Westminster Club Apartments at 3901 U.S. 17 in Glynn County.\nBut that is what happened at 1 a.m. Sunday in the couple’s apartment, county Police Chief Matt Doering said. After being hit with a bullet, Eva Diaz ran to a neighbor’s house, and was later flown by helicopter to a hospital trauma center in Savannah, Doering said. Her mother and father were pronounced dead at the scene at 1:55 a.m. by assistant county coroner Chris Stewart.\nEva is in stable, said Krystal Morales, the daughter of Panek and a childhood friend of Emiko Diaz.\nPanek and Morales stood in the parking lot at the Westminster Club Apartments at around noon Sunday, grieving and trying to make sense of this deadly tragedy that destroyed this young family that was so close to them. They were consoled by Nick Olivas, the older brother and son, and by Morales’ husband, Mariano Morales.\nKrystal Morales had known Emiko Diaz since they met at Oglethorpe Point Elementary School on St. Simons Island in fourth grade, she said. They had been best friends since that time. They also went to Brunswick High School together, she said.\nEmiko had been working two jobs while attending College of Coastal Georgia, from where she had just graduated, Morales said. She had worked at Kyoto Express and at AppleCare medical center, Morales said.\n“She was an amazing person,” Morales said. “Work, school and family — that was all she cared about. Her family was everything to her. She was never a fighter, never a person to look for problems.”\nPanek works at the King and Prince, and said Jesus Diaz worked there as well. Now that Emiko had graduated, he planned to begin attending college, she said.\nThey appeared to be a happy family, all agreed. Nothing gave hints of the violent and deadly outburst that was to come.\n“She loved life,” Krystal Morales said. “You could be having the worst day ever, and she would walk up to you and make everything feel better.”\nThe murder/suicide marked the second murder in Glynn County in 2016. A Japanese national is accused of strangling a 65-year-old widow to death in her Brunswick home on Third Avenue on May 1. Ogho Tokimasa, 35, remains in the Glynn County Detention Center, charged with the murder of Japanese-born American citizen Naomi Acres.\nCounty police continue to investigate Sunday’s shooting incident. Anyone with information is asked to call Glynn County police at 554-3645."}