{"uri": "http://chicago.cbslocal.com/2013/03/21/7-shot-during-rap-video-release-party-at-gresham-nightclub/", "title": "7 Shot During Rap Video Release Party At Gresham Nightclub", "dct": "Thu, 21 Mar 2013 05:03:00 GMT", "id": "7cc7a782d874c36cdc5be1eceed4bae6", "content": "CHICAGO (STMW) — The owner of a South Side nightclub where seven people were injured early Thursday when gunfire erupted inside during a rap video release party says nothing like it has ever occurred at the club and he is conducting a review of all security measures.\nPolice said three people pulled out handguns and started firing shots both inside and outside Mr. G’s Supper Club and Entertainment Center at 87th and Ashland about 1:13 a.m. Thursday.\nThe Auburn Gresham neighborhood shooting was gang-related, police News Affairs Officer Hector Alfaro said. A promotional poster indicated rap artists Nino, King Samson and Lil Mouse performed at the event.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nA YouTube video for the Lil Mouse song “Im 4real” shows the rapper and his crew wearing apparel emblazoned with the phrase “no talking” — an apparent reference to the no-snitch code that governs much of the city’s gang violence. The song lyrics feature gratuitous allusions to gun violence.\nThree people — a 19-year-old woman, 21-year-old man and 23-year-old man — were driven to Advocate Christ Medical Center in Oak Lawn with gunshot wounds, Alfaro said. The 19-year-old woman was shot seven times, according to dispatch reports. All three were listed in “stable” condition.\nTwo men, ages 20 and 21, were in “stable” condition after one was taken by ambulance and another driven to Holy Cross Hospital, police said.\nTwo other men, ages 26 and 36, were also in “stable” condition after being driven to Little Company of Mary Hospital and Health Care Center, Alfaro said.\nBut police on the scene said the exact number of injured was hard to determine because a handful of the wounded were driven to hospitals by people they knew.\nIn a statement issued later Thursday morning, the club’s owner, Gene Linton, said that for 23 years he has “earned the reputation as one of the most respected businessmen in Cook County. Never has any incident of this magnitude occurred at the establishment.”\nLinton’s statement said the “senseless” incident “initiated on the exterior of our building after hours” and he is conducting a review of all security measures at the nightclub in conjunction with the police investigation.\nAdditionally, Linton said, “We ask that the general public join us in praying for the victims of this cowardly act. We also have pledged our full and complete cooperation with the Chicago Police Department in its investigation…”\nNo one was in custody Thursday morning as Area South detectives investigate.\nSun-Times Media Wire © Chicago Sun-Times 2013. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed."}