{"uri": "http://fox59.com/2016/07/25/impd-officer-shot-another-injured-during-pursuit-on-northwest-side/", "title": "IMPD officer released from hospital after chase leads to shooting; suspect dead", "dct": "Mon, 25 Jul 2016 19:06:00 GMT", "id": "c7cb5293df4091312461514bef03f160", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nINDIANAPOLIS, Ind. – An officer with the Indianapolis Metropolitan Police Department who was shot during a pursuit that started on the city's northwest side Monday has been released from the hospital.\nAround 6:37 p.m. Monday, the one-year veteran officer reportedly stopped the suspect’s vehicle at the Marathon Gas Station at 7100 Georgetown because he had recognized it from criminal activity from earlier in the week.\nThe officer requested backup and approached the vehicle. Police say that’s when the driver, Jeff Tyson, became “belligerent,” would not identify himself and began rolling up his window, ignoring the officers’ commands.\nOfficers broke the window and fired pepper ball rounds into the vehicle in an effort to gain compliance. The passenger in the vehicle then got out of the vehicle and Tyson sped off and the chase began.\nThe female passenger is either the girlfriend or wife of the suspect, police said. She was taken into custody to be questioned. Police have not said if she's been arrested or charged.\nAfter a short distance on Georgetown Road, police say Tyson made a U-turn and began firing at the officers. That’s when the officer who initiated the stop was hit in his lower right ankle and also suffered a graze wound to the back of his head. The officer riding with him was also struck and injured by debris, but did not require any medical attention.\nThe pursuit eventually ended on the city’s east side near Rural Street and Newton Street, where police say Tyson continued to shoot. Police returned fire, killing the suspect.\nThe officer shot in the ankle was taken to IU Methodist Hospital in stable condition. His injuries are said to be non-life threatening. Police said he was released overnight but will need surgery in the coming days.\nThe shooting is being investigated by IMPD’s Critical Incident Response Team. A separate and independent internal investigation will be conducted, as is standard procedure in an officer involved shooting. At this point in the investigation, detectives were able to confirm that the suspect was armed and that a firearm was recovered from the scene.\nAll involved officers will be placed on administrative duty, pending the conclusion of the investigation."}