{"uri": "http://www.desmoinesregister.com/story/news/crime-and-courts/2014/05/22/father-arrested-accidental-shooting-death/9462041/", "title": "Father arrested in connection with 4-year-old daughter's shooting death", "dct": "Thu, 22 May 2014 00:00:00 GMT", "id": "417162d72833b4c446855701c3162488", "content": "The father of a 4-year-old who accidentally shot herself in April was arrested this afternoon on four felony and misdemeanor charges.\nAdam Mead, 24, turned himself in to Des Moines police. He was charged with involuntary manslaughter, neglect of a dependent person and two counts of making firearms available to minors.\nBond was set at $17,500. Mead was released from the Polk County Jail at 6:30 p.m., a little over an hour after he was booked. Nobody answered a reporter's knocks on the door at his apartment Thursday night.\nCharging Mead in connection with his daughter's death is a rare move, one legal expert said.\nMead's daughter, Lillium, 4, died of a single gunshot wound to her chest on April 21.\nMead told police his daughter wandered into a bedroom in which he was moving things around. He set a loaded .45 caliber handgun onto a dresser and turned his back for a moment, authorities said.\nSeconds later, he heard a single shot behind him. He turned to see a look of shock on his daughter's face and red spreading across her shirt, officials said.\nThe girl was pronounced dead at a local hospital.\nInvestigators said they believed Mead's version of events.\n\"Evidence supports his statements, the autopsy supports his statements,\" Des Moines Police Sgt. Jason Halifax said. \"There was nothing to suggest otherwise.\"\nIf Mead is convicted of all the charges, he faces a maximum 17 years in prison.\nThe neglect charge, a Class C felony is the most serious and alleges Mead knowingly or recklessly exposed his daughter to a danger against which she couldn't be expected to protect herself.\nThe manslaughter charge accuses Mead of causing Lillium's death by the commission of another, non-felonious crime.\nOfficials also found a second, unlocked gun in an area where they thought Lillium could access it, Halifax said.\nPolice took seven weapons from Mead's apartment, including a rifle, three handguns and three pellet guns, Halifax said.\nProsecutors had several charging options, including child endangerment causing death, a Class B felony punishable by up to 50 years in prison, Drake University law professor Bob Rigg said.\nThe county attorney could also have chosen not to prosecute, he said.\n\"There's a reason we give prosecutors a great deal of discretion, so they don't file criminal charges when something is entirely accidental,\" he said.\nIn 2010, the last year for which numbers from the Centers for Disease Control and Prevention were available, 369 children ages 14 and under died in the U.S. from gunshot wounds. Of those, 62 were unintentional.\nStill what happened to Lillium remains relatively rare, officials said. And seeing prosecutions in such cases is even more unusual, Rigg said.\n\"You don't see many cases like this with prosecutions,\" he said.\n\"When you have situation like that occur, you have to ask yourself, as a prosecutor, is this something we want to pursue on criminal basis? That's a case by case evaluation,\" he said. \"There's no hard and fast rule and a lot will depend on what the investigation revealed. A lot goes into charging decisions besides violation.\""}