{"uri": "http://www.firstcoastnews.com/news/crime/person-shot-in-downtown-jacksonville-near-art-walk-police/382259785", "title": "Surveillance video shows chaos moments after Art Walk shooting", "dct": "Thu, 05 Jan 2017 00:00:00 GMT", "id": "3d0a592aa7b5f4acfe23961f2e100c16", "content": "JACKSONVILLE, Fla. -- The Jacksonville Sheriff's Office says two teens were shot during Art Walk at Bay and Laura Streets Wednesday night and were transported to UF Health.\nAccording to the police report, the two victims were 16 and 17 years old. Police say as they were helping one of the victims, but one had firearm holster attached to his waist.\nOff-duty officers responded to a report of shots fired a block north of the Landing where police say hundreds of people were around 9:30 p.m.\nOne victim ran to a restaurant at the Jacksonville Landing and was taken to UF Health along with the other victim. Police say both were shot in the legs and are in the hospital with injuries that weren't life-threatening.\nPolice believe the suspect in question is a male with long dreads wearing all black clothing.\n\"It could have been much, much worse,\" says Sgt. Jones with the sheriff's office.\nAt a Thursday news conference, Sheriff Mike Williams announced that they don't believe the shooting was a random act.\n\"Something brought them together, some criminal act,\" Williams said.\nWilliams also encouraged the public to help promote the public's safety: \"If you see something, say something,\" Williams said.\nJacob Gordon, the CEO of Downtown Vision Inc. also told the public that the shooting \"was very unusual\" in the more than 150 Art Walks hosted downtown. \"Don't let it spoil you. Downtown is very safe,\" Gordon said.\nDetectives are investigating the shooting and reviewing surveillance video that captured the moments after the shots were fired.\nIf you know anything about this shooting, contact the sheriff's office at 904-630-0500. Or, to remain anonymous and receive a possible cash reward, call Crime Stoppers at 1-866-845-TIPS.\nView the police briefing below:"}