{"uri": "http://www.magnoliareporter.com/news_and_business/local_news/article_03f97af4-985c-11e3-8071-001a4bcf887a.html", "title": "Magnolia youth, Hank Bollen, dies in Union County hunting accident", "dct": "Mon, 17 Feb 2014 00:00:00 GMT", "id": "010b2344c1375db555cf7204693548cd", "content": "The body of Hank Bradley Bollen, age 9, of Magnolia, was sent to the Arkansas Crime Lab in Little Rock for an autopsy after the young hunter was found dead about 8 a.m. Tuesday near Shuler Road in Union County.\nThe child, who was the son of Kelli Clark Bollen and Brad Bollen of Magnolia, was reported missing late Monday afternoon after he went squirrel hunting about 11 a.m. The Central Elementary fourth-grader was enjoying hunting during a school holiday for George Washington’s Birthday.\nChief Deputy Bill Hickman of the Union County Sheriff’s Office said that the apparent cause of death was a hunting accident. No further specifics were released.\nArkansas State Police Criminal Investigation Division officers examined the scene where the body was found. Evidence they collected is expected to assist the crime lab with determining a cause of death. No foul play is suspected.\nSearchers were called about 6 p.m. Monday and looked through the area south of Shuler Road off Braswell Corner Road. Braswell Corner Road is familiar to Columbia Countians as the Union County road that eastbound U.S. 82 drivers pass before they reach Marysville United Methodist Church.\nEarly Tuesday morning, an Arkansas State Police helicopter overflew the area, hoping to pick up a heat signature as the nighttime temperatures dipped into the lower 40s. Meanwhile, searchers parked their vehicles along roads in the area to keep watch overnight.\nThe Union and Columbia County sheriff’s offices, Arkansas National Guard, 13th Judicial District Drug Task Force, Arkansas Game & Fish Commission personnel, Magnolia Police Department, volunteer firefighters, family members and others took part in the search.\nThe search was concentrated around a hunting camp on Shuler Road, located right on the line of the two counties. After daybreak, the camp was filled with dozens of private and official vehicles, all-terrain vehicles and many family members, law enforcement personnel and private citizens."}