{"uri": "http://www.americanpress.com/Baton-Rouge-updates", "title": "TIMELINE: Baton Rouge gunman 'did not play by the rules'", "dct": "Mon, 18 Jul 2016 16:04:00 GMT", "id": "3daab31fe0c2f360ec209095da43af72", "content": "BATON ROUGE — The Latest on the fatal shooting of three law enforcement officers in Baton Rouge, Louisiana.\n3:25 p.m.\nEast Baton Rouge Parish Sheriff Sid J. Gautreaux says his deputy Nicholas Tullier is in \"very, very critical condition.\"\nThe sheriff says \"It's in God's hands. We'll just have to see what happens but he's not in good shape at all.\"\nHe says deputy Bruce Simmons meanwhile just got a titanium rod to replace an arm bone shattered by the gunman's bullet.\nThe sheriff also said his slain deputy Brad Garafola \"went down fighting\" and \"returned fire to the very end\" as he tried to protect a wounded police officer.\nHe says surveillance video showed Garafola returning fire from a prone position as bullets hit the concrete around him. Only after the deputy died did the shooter return to the wounded officer and kill him with two more bullets, at close range.\n3:10 p.m.\nBaton Rouge Police Chief Carl Dabadie says \"that shot that our SWAT team made was a helluva shot but it had to be made.\"\nThe chief was describing the long-distance shot that killed the gunman. He said he's got no doubt that the gunman would have gone next to police headquarters to take more lives.\nDabadie says police have been questioned about militarized tactics, but says these killings show that \"we are up against a force that is not playing by the rules.\"\nHe says \"they did not play by the rules in Dallas and they did not play by the rules here.\"\n2:45 p.m.\nFBI Agent Jeff Sallet says federal investigators are actively trying to figure out if gunman Gavin Long had any associates or support for his plan to come to Baton Rouge and kill police.\nSallet says the agency is committing all resources necessary to identifying any co-conspirators or facilitators and bring them to justice.\"\nHe cited what he called seven key words from the Pledge of Allegiance: \"One Nation, Indivisible, with Liberty and Justice For All.\"\nIndivisible — he said — that means \"Baton Rouge unified, Louisiana unified, America unified. This will only make us stronger; We will work tirelessly to ensure safety in this community and throughout the nation.\"\n2:40 p.m.\nSheriff Sid J. Gautreaux has described how the gunman killed officers at close range and was moving in on two other officers after wounding him when he was finally taken down.\nHe praises the Baton Rouge City SWAT team officer for saving more lives by firing from a long distance, through structures, at the gunman who was closing in for more kills.\nGautreaux says he's convinced that if the officer hadn't killed the gunman at the scene, \"we would have had two other slain deputies and that individual would have had the opportunity to get into his car and go after other targets.\"\n2:30 p.m.\nLouisiana State Police Col. Mike Edmonson says the gunman who shot six police officers in Baton Rouge clearly targeted law enforcement, carrying two riles and a 9 mm handgun in Sunday's ambush.\nEdmonson showed overhead maps of the area to explain how Gavin Long snuck up behind police officers and shot them at close range.\nHe says another deputy had spotted the gunman's car and was about to run his license plate when the gunman shot the deputy — \"that's the one critically injured, fighting for his life right now.\"\nEdmonson says a responding SWAT team officer finally shot the gunman from about 100 yards away.\n2:15 p.m.\nKip Holden is the Mayor-President of East Baton Rouge Parish, where three officers were killed and three others wounded in an ambush by a gunman from Kansas City Sunday morning.\nAt a news conference, he thanked the mayor of Orlando, Florida for reaching out to him in support just weeks after that city's nightclub attack. Holden also cited the biblical figure of Job, who said \"I will rise again.\"\n\"You have slain some law enforcement officials,\" the mayor said, but \"this city, this state and this nation will rise again.\"\n2:10 p.m.\nLouisiana Gov. John Bel Edwards says the shooter who killed three police officers in Baton Rouge \"came in here from somewhere else to do harm to our community.\"\nHe says \"this was \"a diabolical attack on the very fabric of our society. This is not hyperbole. It is not an overstatement. There is nothing more important than law and order.\"\nThe governor says killing police officers \"doesn't accomplish anything, it's not constructive. It's just pure unadulterated evil.\"\n1:45 p.m.\nAll three of the slain Baton Rouge officers lived in Denham Springs, just outside Louisiana's capital.\nAntique store owner Marilyn Wallace says \"everybody knows everybody\" in the small city, so the killings have a huge impact.\"\nDenham Springs is in Livingston Parish, which has a sharp racial divide, but that seems remote now in the racially mixed neighborhood where the Wallace's white son grew up with Montrell Jackson, a slain officer who was black.\n1:25 p.m.\nOne of the three officers wounded in the attack on police in Louisiana's capital has been released from a hospital.\nA statement from Our Lady of the Lake hospital in Baton Rouge says the city police officer who was reported in fair condition has now been released.\nThat leaves two who are still being treated.\nEast Baton Rouge Sheriff's spokeswoman Casey Rayborn Hicks says sheriff's deputy Nicholas Tullier remained in critical condition, at the same hospital.\nDeputy Bruce Simmons is being treated at Baton Rouge General Hospital for wounds to his arm and shoulder that are not expected to be life-threatening.\n1:15 p.m.\nLouisiana authorities say surveillance video of the scene where three officers were killed makes clear that it was an ambush.\nState Police Superintendent Col. Mike Edmonson is telling The Associated Press that video shows specific movements by the shooter that shows he was specifically seeking out law enforcement officers.\nThe shooter was killed and three other officers were wounded in the shootout.\nAuthorities plan to release more information during a news conference at 2 p.m. local time.\n1 p.m.\nAuthorities in Baton Rouge plan to release more information at a news conference at 2 p.m. local time about the shooting of police officers by a Kansas City man.\nKip Holden is the Mayor-President of East Baton Rouge Parish, and he visited today with officers at police their headquarters. He says all are grieving the loss of their co-workers, but they are well aware of the dangers in their jobs.\nHe says the city's mission now is to make sure the families of the officers who were shot and wounded are taken care of.\n12:45 p.m.\nGov. John Bel Edwards has ordered the U.S. and Louisiana flags to be flown at half-staff over the State Capitol and all public buildings in Louisiana until sunset on Monday to honor the lives of the six law enforcement officers who were shot in Baton Rouge this past Sunday.\nThree of those officers were killed: Baton Rouge Police Officers Matthew Gerald and Montrell Jackson, and East Baton Rouge Sheriff's Deputy Brad Garafola.\nThe governor calls them \"heroes in the truest sense of the word.\"\n\"Rather than running from danger, they ran toward it and three of them paid the ultimate sacrifice,\" the governor says. \"In honor of their lives, let us all remember that what unites us is far greater than what divides us.\"\n12:30 p.m.\nHillary Clinton says the killings of police officers in Dallas and Baton Rouge threatens the nation's ability to make progress with criminal justice reform.\nSpeaking to the NAACP national convention in Cincinnati, the Democratic presidential candidate says much hard work remains to resolve the nation's problems with race and policing.\nClinton's proposals include developing national use-of-force guidelines, investing more in bias training and body cameras and passing laws against racial profiling.\nShe also would cut mandatory minimum sentences for minor offenses and help people find jobs after serving time behind bars.\nShe calls this work difficult and painful but essential for repairing the bonds between police and our communities.\n12:15 p.m.\nKansas City police have arrested a man on a city warrant at the last known address for the man who killed three law enforcement officers in Louisiana.\nA police statement says 39-year-old Kamerran Fryer, of Kansas City, was arrested Sunday night for a seat belt violation and released after promising to appear.\nThe statement said police made the arrest while assisting the FBI, and referred questions to the federal agency.\nFBI spokesman Bridget Patton said agents were in the area assisting with the Baton Rouge shooting investigation, but had no further comment.\nPolice said it wasn't immediately known if Fryer has an attorney. He does not have a listed phone number.\n12:05 a.m.\nFederal agents in Kansas City and Baton Rouge are trying to determine where the gunman got the firearms he used to kill three officers and wound three more in the Louisiana capital.\nRegional spokesman John Ham of the Bureau of Alcohol, Tobacco, Firearms and Explosives says \"all parts of this investigation, at least from the ATF's standpoint, are very fluid.\"\nThe slain officers were responding to a report of a man with an assault rifle and were met with gunfire. For several long minutes, it wasn't clear where the shooting was coming from.\n11:40 a.m.\nBusinesses around a shooting that killed three law enforcement officers in Baton Rouge, Louisiana, are reopening as police continue investigating the crime scene.\nCustomers were buying coffee and breakfast sandwiches Monday at a B-Quik convenience store near where officers first engaged the gunman less than 24 hours earlier.\nNext door, workers were getting ready for the day at a car wash where the gunman was cornered.\nNeighboring businesses were riddled with at least eight apparent gunshots. Investigators examined a hole in a window at a fitness supply business, and wood already covered another window that was shot out.\nAuthorities say two city police and a sheriff's deputy died in the shooting Sunday morning, and the gunman was killed by law enforcement.\n11:35 a.m.\nFrank Cooper works at a garage right next to the spot where the gunman killed three law enforcement officers and wounded three more before authorities killed him.\nCooper says the convenience store was an ideal target for someone wanting to catch police off-guard. It's less than a mile from police headquarters, and uniformed officers often stop there for coffee before their shifts.\nThe gunman was identified as Gavin Long from Kansas City. Cooper is guessing that it's unlikely someone from out of town would known about the spot.\n11:20 a.m.\nThe neighbor of one of the slain officers in Baton Rouge says that if 41-year-old Matthew Gerald had been hardened by his years in the military, you couldn't tell it when he became an officer and got his squad car.\nAshley Poe says Gerald seemed so tickled when he got his take-home car that he scrubbed it down and was playing with the lights, turning them on and off, just like a kid -- \"living out the dream.\"\nPoe said her 14-year-old son was interested in military service, and Gerald was always ready to answer his questions, telling him \"how he was proud to protect his country.\"\nPoe also says that Gerald was devoted to his wife and daughters.\n10:50 a.m.\nThe man who killed three law enforcement officers in Baton Rouge declared last year that he was changing his name from Gavin Eugene Long to Cosmo Setepenra.\nLong described his new name in a document he filed in May 2015 with the Recorder of Deeds Office in Jackson County, Missouri. The filing also declared membership in a black separatist group that considers itself beyond the reach of state and federal laws.\nCounty spokesoman Brenda Hill says he never followed through in court to make the name change official.\nLong cited common law, saying that \"an emancipated person has the right to change his or her name without legal formality.\"\nHe said he was a member of the Washitaw Nation. The Southern Poverty Law Center says this group uses pseudo-legal language and ideologies similar to that of hard-line American white supremacists.\n8:45 a.m.\nIn online posts, a man using an alias of the Baton Rouge shooter said protests alone don't work, and people must fight back after the deaths of black men at the hands of police.\nDocuments show that gunman Gavin Eugene Long sought to change his name last year to Cosmo Setepenra. A website using that name links to self-published online books on nutrition, self-awareness and empowerment. The man describes himself as a \"Freedom Strategist, Mental Game Coach, Nutritionist, Author and Spiritual Advisor.\"\nIn a video posted July 10, the man says he's speaking from Dallas after the fatal attack on police officers there during a march over the deaths of black men at the hands of law enforcement. The man also discusses the protests in Baton Rouge and what he perceived as oppression.\nHe says: \"You've got to fight back. That's the only way a bully knows to quit.\" In an earlier video, the man says that if anything ever happens to him, he doesn't want to be linked to any groups, and mentioned once belonging to Nation of Islam.\n8:45 a.m.\nClark Atlanta University officials say Baton Rouge gunman Gavin Eugene Long was briefly enrolled at the Atlanta university during the 2012-13 academic year.\nClark Atlanta said in a statement Monday morning that the university \"categorically denounces this heinous act.\"\nLong, a former Marine from Kansas City, Missouri, turned 29 on Sunday, the same day he opened fire, killing three law enforcement officers and wounding three others. Long was killed at the scene.\nThe shooting added to the tensions across the country between the black community and police.\nUniversity of Alabama spokesman Chris Bryant said Long also attended the University of Alabama for one semester, in the spring of 2012.\n8:35 a.m.\nThe man who killed three law enforcement officers in Baton Rouge sought to change his name last year and said he was part of a largely black group that claims to separate from state and federal governments.\nGavin Eugene Long, a black man whose last known address was in Kansas City, Missouri, carried out the attack Sunday on his 29th birthday. Police say he also wounded three officers before he was killed.\nHe sought to change his name to Cosmo Setepenra in a document filed in May 2015 with the Jackson County Recorder of Deeds. He also refers to himself as a member of the Washitaw de Dugdahmoundyah, also known as the Washitaw Nation.\nThe groups says it's a sovereign Native American nation within the boundaries of the U.S.\nThe name-change document ends: \"Standing firm on the Ancient Principles of, LOVE, TRUTH, PEACE, FREEDOM AND JUSTICE.\"\n7:25 a.m.\nThe coroner for Baton Rouge says his office will perform autopsies Monday on the three officers slain in an attack this weekend.\nEast Baton Rouge Parish Coroner Beau Clark says they autopsies will begin around 8 a.m., and he expects to release his preliminary findings, including the cause of their deaths, sometime this afternoon. Clark says an autopsy on the deceased suspect is planned for Tuesday.\nIn the Sunday attack, a former Marine dressed in black and carrying extra ammunition shot and killed three Baton Rouge law enforcement officers, less than two weeks after a black man was fatally shot by police there in a confrontation that sparked nightly protests that reverberated nationwide.\n7:20 a.m.\nBusinesses around a shooting that killed three law enforcement officers in Baton Rouge, Louisiana, are reopening as police continue investigating the scene.\nCustomers were buying coffee and breakfast sandwiches Monday at a B-Quik convenience store near where officers first engaged the gunman less than 24 hours earlier. Next door, workers prepared for the day at a car wash where the gunman was cornered.\nBusinesses on two sides of the scene of a gunbattle were riddled with at least eight apparent gunshots. Investigators examined a hole in a window at a fitness supply business as news crews worked nearby, and wood covered another window that was shot out.\nAuthorities say two city police officers and a sheriff's deputy died in the shooting Sunday morning, and the gunman was killed by law enforcement. Three other officers were wounded. The identities of the slain officers and two of those wounded are known. But the name of the third wounded officer hasn't been released. Baton Rouge police Sgt. Don Coppola said in a text message Monday that officials plan to release that name, \"just not sure exactly when.\"\n7 a.m.\nU.S. Attorney General Loretta Lynch says she condemns the attack in Baton Rouge \"in the strongest terms possible\" and says federal law enforcement agencies are helping on the ground.\nLynch said Monday in Washington that \"families are again mourning loved ones robbed from them by senseless violence. ... And all of us are again heartbroken at the news of yet another tragedy.\"\nShe invoked a Facebook post by slain officer Montrell Jackson. Days ago, he wrote that he received \"nasty, hateful looks\" while in uniform but also said, \"Please don't let hate infect your heart.\"\nIn the Sunday attack, a former Marine dressed in black and carrying extra ammunition shot and killed three Baton Rouge law enforcement officers, less than two weeks after a black man was fatally shot by police there in a confrontation that sparked nightly protests that reverberated nationwide.\n6:30 a.m.\nState police say the gunman in the Baton Rouge shooting ambushed the six law enforcement officers and \"certainly was seeking out police.\"\nCol. Mike Edmonson made the comments Monday morning. The shooting on Sunday killed three officers and left three others wounded, one critically. Police say the gunman was a former Marine who was killed at the scene.\nEdmonson says: \"His movements, his direction, his attention was on police officers.\"\nEdmonson also says investigators have interviewed people who had contact with the gunman in Baton Rouge, but he wouldn't say how many or give other details. He stressed that officials are still asking any others who might have had contact with shooter Gavin Long to come forward.\nThe shooting less than a mile from police headquarters added to the tensions across the country between the black community and police.\n6:05 a.m.\nLouisiana State Police have positively identified the shooter who killed three law enforcement officers in Baton Rouge as Gavin Long.\nIn a Monday morning Facebook post, Louisiana State Police said they needed to withhold official confirmation of his name until they had positively ID'ed him through fingerprints.\nLong, who's from Kansas City, Missouri, turned 29 on Sunday, the same day he opened fire, killing three and wounding three other officers. Police said Long was killed at the scene.\nThe shooting less than a mile from police headquarters added to the tensions across the country between the black community and police.\n2:10 a.m.\nA former Marine dressed in black and carrying extra ammunition shot and killed three Baton Rouge law enforcement officers, less than two weeks after a black man was fatally shot by police there in a confrontation that sparked nightly protests that reverberated nationwide.\nThree other officers were wounded Sunday, one critically. Police said the gunman was killed at the scene.\nThe shooting less than a mile from police headquarters added to the tensions across the country between the black community and police. Just days earlier, one of the slain officers had posted an emotional Facebook message about the challenges of police work in the current environment.\nPresident Barack Obama urged Americans to tamp down inflammatory words and actions.\nThe gunman was identified as Gavin Long of Kansas City, who turned 29 on Sunday."}