{"uri": "http://heavy.com/news/2016/07/officer-killed-in-baton-rouge-suspect-louisiana-photos-alton-sterling-black-lives-matter-police-shooting-ambush-montrell-jackson/", "title": "Montrell Jackson, Officer Killed in Baton Rouge: 5 Fast Facts You Need to Know", "dct": "Sun, 17 Jul 2016 21:02:00 GMT", "id": "769f30c56906c20cc28b4f15004d2a11", "content": "Three police officers, including Montrell Jackson, 32, were shot and killed in Baton Rouge, Louisiana, where it has been tense with police since the death of Alton Sterling on July 5. Police say that one suspect, identified as Gavin Long, was killed. Police did question two men, who were later released, The Advertiser reports.\nThe other Baton Rouge Police Department officer killed was 41 years old and was later identified as Matthew Gerald. The East Baton Rouge Parish Sheriff’s deputy was 41, reports The Advocate.\nThree officers were wounded in the shooting, including one who is fighting for his life.\nAlthough police did not reveal the names of the victims in a 3 p.m. press conference, Jackson’s cousin, Josh, confirmed his identity on Twitter:\nHere’s what we know so far about Montrell Jackson and the shooting. This is a breaking story and will be updated as we learn more.\n1. Jackson’s Son Mason Was Born in March\nDude just had a baby a couple months ago!! Y'all took him from a family that needed him!\n— 正義 D. Bankz (@RealDruBankz) July 17, 2016\nOne of Jackson’s cousins, who identifies himself as @RealDruBankz on Twitter, wrote that he welcomed his son just a few months ago. “Dude just had a baby a couple months ago!! Y’all took him from a family that needed him,” he wrote.\nThe Advocate reports that Jackson was a 10-year veteran of the Baton Rouge Police Department.\nWriter Britni Danielle wrote that Jackson’s baby was born in March. On his Facebook page, Jackson wrote of his son, “I wouldn’t trade him for the world though.”\n2. Jackson Wrote on Facebook That ‘I Wonder if his City Loves Me’ After Dallas Shooting\nJackson posted the above message on his Facebook page on July 8, the day after five police officers were killed in Dallas. It also came after the death of Alton Sterling, whose death in Baton Rouge was captured on video and sparked protests.\n“I’m tired physically and emotionally,” Jackson wrote. “Disappointed in some family, friends, and officers for some reckless comments but hey what’s in your heart is in your heart. I still love you all because hate takes too much energy but I definitely won’t be looking at you the same. Thank you to everyone that has reached out to me or my wife it was needed and much appreciated. I swear to God I love this city but I wonder if this city loves me.”\nKedrick Pitts, Jackson’s brother, told NPR that Jackson “loved his job, he worked his job seven days a week.” He also said that other members of their family are officers and sheriffs.\n3. The Victims Were Two Baton Rouge Police Officers & One East Baton Rouge Parish Sheriff’s Deputy\nBaton Rougue Police Spokesman L’Jean McKneely said in the above press conference that it was not clear how the shooting started on Sunday morning. The shooting took place near a B-Quick Convenience Store on Airline Highway, near Old Hammond Highway. Long was found dead near the store, reports The Advocate. Police used a robot to find out if there was an explosive device inside the store.\nCNN reports, citing a source close to the investigation, that police were called to the area when there was a report of a “suspicious person” walking down Airline Highway. The shooting started when police arrived. Shooting was first reported around 8:40 a.m.\nBaton Rouge Chief Administrative Officer William Daniel told The Advocate that two of the deceased officers were Baton Rouge police officers and the third is an East Baton Rouge Parish sheriff’s deputy.\nThe above audio is the first 45 minutes after the call was made. It was posted to SoundCloud by Alertpage.\nOne witness told WBRZ that Long was wearing a black mask as he was seen shooting “indiscriminately” as he walked between the convenient store and the shopping center across the street.\nBaton Rouge Police Department Sgt. Don Coppola also told CNN that Long wore a mask and all black clothing. He didn’t say what the mask looked like, but confirmed that it covered his face to his identity.\nIn his press conference, McKneely told citizens to report anything suspicious, especially if they see someone wearing all black or all camouflage. However, officials said at the 3 p.m. press conference that there is “no active shooter” in Baton Rouge.\n4. Governor Edwards Called Incident an Attack on ‘All of Us’\nLouisiana Governor John Bel Edwards quickly issued a statement after the news broke. He called the shooting an “unspeakable and unjustified attack on all of us at a time when we need unity and healing.” He added that all of the state’s resources are being used to find the suspects and “swiftly bring them to justice.”\n“I want to reassure everyone around the state we are doing everything humanly possible to make sure everyone is protected,” Edwards said during the afternoon press conference.\n5. The Shooting Comes Just Days After Police Made Arrests to Stop a ‘Credible Threat’ to Officers & The Deaths of Five Officers in Dallas\nOn July 12, Baton Rouge Police Chief Carl Dabadie said that police stopped a “credible threat” to officers after arresting a man for burglarizing a pawn shop, The Advocate reports.\nAntonio Thomas, 17, was arrested after a robbery of a pawn shop at 2 a.m. McKneely said Thomas told officers, “We’re going to look for bullets to kill police officers,” the Advocate reports.\nThe other suspects arrested were Malik Bridgewater, 20, and Trashone Coats, 23. A 13-year-old boy was also arrested, but his name was not released due to his age. The Advocate reports that they allegedly took eight handguns and a BB gun, although only six of the handguns were recovered by the time of the press conference on Tuesday.\nThis is the second mass shooting of police officers in two weeks. On July 7, five police officers were killed in Dallas, near the end of a Black Lives Matter protest of police brutality, by a sniper identified as Micah Johnson.\n“For the second time in two weeks, police officers who put their lives on the line for ours every day were doing their job when they were killed in a cowardly and reprehensible assault,” President Barack Obama said in a statement after the Baton Rouge shootings. “These are attacks on public servants, on the rule of law, and on civilized society, and they have to stop.”"}