{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-prosecutors-teen-girl-shot-ex-boyfriend-after-he-refused-her-calls-20161117-story.html", "title": "Prosecutors: Teen girl shot ex-boyfriend after he refused her calls", "dct": "Fri, 18 Nov 2016 06:00:00 GMT", "id": "14dca2f8c3a5f89c7df028702d3a8dd1", "content": "A Proviso West student was ordered held on $600,000 bail Thursday after Cook County prosecutors said she shot her ex-boyfriend after he refused her calls.\nKatrina Harris, 16, was charged as an adult with attempted first-degree murder, aggravated battery with a firearm and aggravated domestic battery, officials said.\nProsecutors said the victim and Harris had dated since junior high school, but in the weeks before Nov. 9, the relationship had turned sour.\nDuring that time, Harris would call and text the victim repeatedly, and he wouldn't respond. But Nov. 8, another person answered after Harris kept calling and told her to stop, prosecutors said.\nHarris then told the person who answered to tell the victim she was going to shoot him, prosecutors said.\nOn his way to school the following day, the victim, 17, was walking to a bus stop when Harris approached him and asked him to come talk to her, but he refused and got on the bus, prosecutors said.\nWhile he was at school, multiple people saw Harris pacing around in front of the victim's home on Chicago's West Side and asking for him. She also continued to leave messages with threats to kill him, prosecutors said.\nHarris was waiting for the victim about 3:30 p.m. when he returned from school. She approached him in the 300 block of South Karlov Avenue, pulled a gun from her purse and shot him in the abdomen, prosecutors said.\nCourt documents said Harris said, \"I'll kill you (expletive),\" before shooting him.\nThe victim ran home, and a witness drove him to Mount Sinai Hospital, where he was treated for a single gunshot wound.\nHarris' Michael Kors purse, with her JC Penney work ID, was found at the scene. A .40-caliber shell casing also was recovered from the scene, prosecutors said.\nHarris appeared Thursday afternoon in front of Judge Maria Kuriakos Ciesel at the bond hearing.\n\"Obviously it's love gone bad,\" Kuriakos Ciesel said. \"But you were stalking his home when he was at school. It's by the grace of God that he's still alive, and that's why you're facing these charges.\""}