{"uri": "http://www.wsbtv.com/news/local/clayton-county/police-teens-found-dead-inside-clayton-county-home/453265998", "title": "Murder-suicide suspected in death of Clayton Co. teens", "dct": "Tue, 04 Oct 2016 23:27:00 GMT", "id": "aac18e6406349307938bd258f64b530b", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCLAYTON COUNTY, Ga. - Police are investigating what led to a suspected murder-suicide involving two Clayton County teenagers.\nRelatives told Channel 2’s Liz Artz they had an on-again, off-again relationship. Police think the 15-year-old boy shot the 16-year-old girl and then himself.\n\"I'm still trying to figure it all out and want answers,\" said Jermaine Carrol, whose daughter Samyah Copeland, was killed in the incident.\nFamily describe the Riverdale High School freshman as kindhearted, loving to friends and family and always smiling.\nTRENDING STORIES:\n\"I still don't believe it. I want to see my daughter. Point blank,\" Carrol said.\nCarroll spoke exclusively with Channel 2 Action News shortly after he received the unthinkable news about his child.\nMonday night, Clayton County police responded to a home on Montego Circle in Riverdale.\nAround 8:30 p.m., police entered the house and found 15-year-old Christopher Andrews and Copeland, dead.\n\"There were multiple shots,\" said Capt. Tina Daniel, with the Clayton County Police Department. \"The motive for the incident is still undetermined at this time, and it's still pending investigation.\"\nInvestigators said it appears Andrews shot Copeland before killing himself.\nNow, the heartbroken father who calls his daughter \"the star of the family\" is trying to understand this horror.\n\"My God, please tell my daughter I love her, I miss her, I'm sorry for what happened to her,\" Carrol said.\nFriends and family held and emotional candlelight Tuesday evening.\nSamyah Copeland’s mother, Tuwanna Copeland, said she wishes the suspect’s family would have noticed warning signs.\nShe also described her daughter as the child any parent would want.\n“Everybody that came in contact with her fell in love with her. Everybody. She always had a smile,” Tuwanna Copeland said.\nTuwanna Copeland said her daughter dated Andrews for a short time.\n“That was her best friend. He couldn’t live without her. And still he didn’t want nobody else to live with her, if he couldn’t have her to myself,” Tuwanna Copeland said.\nTuwanna Copeland said the two broke up and he couldn’t handle it.\nPolice are still trying to figure out what led to the violence.\nCopeland's family is planning her funeral for next week.\n© 2017 Cox Media Group."}