{"uri": "http://www.osidenews.com/2016/03/25/oceanside-man-arrested-triple-homicide-santa-barbara/", "title": "Oceanside Man Arrested for Santa Barbara Triple Homicide", "dct": "Fri, 25 Mar 2016 00:00:00 GMT", "id": "48e368b4ec341c81fc3526ed5d0dc8a3", "content": "Victims are Dr. Weidong Henry Han, his 29-year-old wife Huijie (Whae-Jee) Yu, also known as “Jennie” and their 5-year-old daughter Emily\nOceanside CA— On Wednesday evening, March 23, 2016, at approximately 5:30 p.m. Sheriff’s dispatch received a call to check on the welfare of Dr. Henry Han at 4640 Greenhill Way in the unincorporated Goleta area. The call came from a colleague of Dr. Han’s who said that he had not shown up for a business meeting in Los Angeles that morning, which was highly uncharacteristic of him, and that no one had heard from him or been able to contact him since that time. Two of his business associates went to his home to check on him. When they arrived they saw the front door ajar, and could see both of the vehicles that belonged to Dr. Han and his wife were parked in the garage.\nSheriff’s deputies arrived at 5:32 p.m. to check on Dr. Han’s welfare. When they entered and searched through the residence, they discovered the bodies of three deceased persons. These remains were subsequently identified as being those of 57-year-old Dr. Weidong Henry Han, his 29-year-old wife Huijie (Whae-Jee) Yu, also known as “Jennie” and their 5-year-old daughter Emily. Although autopsies have yet to be conducted, preliminary indications are that all of the victims suffered gunshot wounds. (The Sheriff also added during a question and answer period that the victims were all wrapped in plastic, duct-taped and found in the garage.)\nThe Sheriff’s Office Criminal Investigations Division was immediately mobilized and launched an intensive and comprehensive investigation. An extensive processing of the crime scene was conducted by Sheriff’s Forensics investigators and criminalists from the state’s Department of Justice Crime Lab. Numerous interviews of people connected with Dr. Han and his family was conducted. A time-line was established that indicated Mrs. Han and her daughter Emily had last been seen alive at approximately 7 p.m. on Tuesday, March 22. Dr. Han had last been seen alive at approximately 10:00 p.m. that same evening.\nDuring the course of the investigation, detectives developed information that pointed to a business acquaintance of Dr. Han’s as a possible suspect. That person was identified as 27-year-old Pierre Haobsh (Hau-Psh) a U.S. Citizen living in Oceanside, California. Preliminary indications are that he was recently involved in a business transaction with Dr. Han.\nOn March 24th, 2016 at approximately 4:00 pm the Santa Barbara County Sheriff’s Office contacted the Oceanside Police Department and requested assistance in locating a suspect who was wanted in connection with the triple homicide in their jurisdiction.\nAt the time of this request, the Santa Barbara County Sheriff’s Office believed the suspect may have been somewhere in the City of Oceanside. The Oceanside Police Department responded to this request for assistance. The suspect was later taken into custody by both agencies at 12:25 am on March 25th at a gas station near the intersection of SR-76 and Olive Hill Rd. in Bonsall.\nDetectives recovered a loaded 9mm handgun and property believed to belong to one of the victim’s in the suspect’s vehicle, a 2013 red Lexus four-door sedan. The suspect was subsequently transported to Santa Barbara County Sheriff’s headquarters. He became ill, was transported to the hospital for examination and was medically cleared. He will be booked at the Santa Barbara County Jail on three counts of murder.\nIn a statement released this afternoon, Santa Barbara County Sheriff Bill Brown said “This investigation is far from over. It is complex and on-going. We anticipate that we will release more information early next week. We are still investigating the motive for this crime but preliminary indications are that it was for financial gain.\nI want to take a moment to express my admiration for our Criminal Investigations Division investigators, whose tenacity and investigative skill led to an arrest being made within 32 hours of our agency’s involvement with this case. I also want to recognize, thank and acknowledge the extraordinary assistance we have received from the Santa Barbara County District Attorney’s Office, the California Department of Justice Crime Lab, the Federal Bureau of Investigation and the Oceanside Police Department. I was in Sacramento yesterday attending a mental health commission meeting and I want to thank Undersheriff Barney Melekian for his leadership in directing the investigation during that time.\nThis tragic case is a terrible blow to the Santa Barbara area and to the medical community at large. Dr. Han had an impressive background in both Chinese herbal medicine and Western medicine. He co-authored several books on the integration of the two medical techniques and he owned and ran the Santa Barbara Herb Clinic since 1991. Dr. Han had an extensive patient network in the Santa Barbara area and beyond. His wife Jennie worked alongside him at the clinic and by all accounts they were loving parents to their daughter Emily. The murder of young Emily, who would have turned six tomorrow, is especially difficult for the Foothill School community. This is the second tragedy in the last two years that has involved the murder of three of their current or former students.\nThis was a diabolical, pre-mediated crime, one of the most odious that I have ever been involved with or that this agency has ever investigated. We will continue to thoroughly investigate its circumstances and bring evidence to the District Attorney’s Office so that justice can be served.”\nDue to the on-going investigation, the Santa Barbara County Sheriff’s Department does not anticipate releasing any additional information until early next week."}