{"uri": "http://chicago.cbslocal.com/2016/07/06/four-year-old-boy-shot-in-englewood/", "title": "Four-Year-Old Boy Shot In Englewood", "dct": "Wed, 06 Jul 2016 19:01:00 GMT", "id": "03d24bc1eaa9270582f73b467b258589", "content": "CHICAGO (CBS) — A four-year-old boy playing outside his home in Englewood was shot and seriously wounded on Wednesday evening.\nLate Wednesday, Chicago Police said they were questioning a person of interest in the case.\nThe boy was shot in the back while playing outside in the 5700 block of South Morgan around 5:30 p.m., when a vehicle drove by and someone inside opened fire.\n“I heard 4 shots then I came out the house, and I saw people putting a little kid in the car,” said Englewood resident Alexis Burns.\nSources tell CBS 2’s Audrina Bigos that the home has been a target for gun violence in the past. Bullet holes were visible on the exterior of the residence.\nFamily members took the boy to Saint Bernard Hospital, which immediately transferred him to Comer Children’s Hospital. He was listed in serious condition.\nSome witnesses said the boy was playing on the sidewalk when he was shot; others said he was on the family’s porch.\nRegardless, Englewood Political Task Force President Darryl Smith said it’s intolerable.\nSmith said something must change, but not necessarily gun laws.\n“You can take all the guns away you want. You can take this gun, I’m going to go find another one. You can take this gun, I’m going to go find another one. It’s the person, it’s not the gun. It’s the person that has the gun, that pulls the trigger, that sees a child on the porch, and shoots up there anyway; that’s the problem,” Smith said.\nHe said police must sit with the shooters.\n“When they come in these rooms, they don’t go get Joe Schmoe, they don’t go get Ms. Johnson, Ms. Smith, Ms. Jones. They go get who they want to go get, and bring them in the room, and they just talk about the same thing they’ve been talking about for the last 20 years, and nothing’s been resolved. Go to the grassroots, and get the people who know … what’s going on in the streets,” he said.\nThe boy shot in Englewood is at least the fourth child under the age of 8 to be shot on the South Side in the last eight days.\nOn Monday, two cousins, ages 5 and 8, were also shot in Englewood.\nOn June 28, 4-year-old Kevan Collins was shot in the face while walking with his family and a friend, after leaving a nearby park so his mother could change his baby brother’s diaper. A bullet grazed Kevan’s face. He was taken to Comer Children’s Hospital, where he was listed in serious but stable condition the day after the shooting."}