{"uri": "http://www.cbs5az.com/story/22228993/trial-set-for-az-man-in-motorcycle-gang-shootout", "title": "Trial set for AZ man in motorcycle gang shootout", "dct": "Wed, 25 Sep 2013 00:19:00 GMT", "id": "403a64849f2b3f335c7a7b8d3395ef7d", "content": "FLORENCE, AZ (CBS5) -\nA Casa Grande man has been indicted on charges in a fight that escalated into a shootout between two motorcycle gangs at a Pinal County clubhouse.\nThe Pinal County Attorney's Office said Tuesday that Kenneth Barnett, 47, is being held without bond on seven charges in two incidents.\nFour people were wounded, one critically, in the incident that began at 1:30 a.m. May 12, at the Loose Cannons Motorcycle Club clubhouse in the 3600 block of East Apache Trail.\nPCSO 911 dispatchers got a call from a person inside the clubhouse stating several shots had been fired. When deputies arrived, they said they saw spent casings littering the ground.\nDeputies said the Loose Cannons Motorcycle Club were partying when members of a rival gang, Devils Disciples Motorcycle Club, arrived at the clubhouse. A fight ensued and authorities believe Barnett fired multiple shots. About 75 people were inside the clubhouse at the time of the shooting.\nA woman received a superficial gunshot wound to the back. She was treated and released. A man who was shot in the head is in stable condition, and a second man shot in the shoulder and stomach is in critical condition. All three victims were transported to Phoenix area hospitals.\nHours later, deputies located another man with a gunshot wound. He was treated at the scene for his injuries by medical personnel.\nThe Pinal County Attorney's Office said Barnett was indicted on June 24 and arrested for aggravated assault with a deadly weapon.\nBarnett also faces felony misconduct involving weapons, disorderly conduct and discharging a firearm within limits of a municipality in a separate incident.\nHis trial dates are scheduled for Dec. 9 and Dec. 17.\nStay with cbs5az.com for updates on this developing story.\nCopyright 2013 CBS 5 (KPHO Broadcasting Corporation). All rights reserved."}