{"uri": "http://krqe.com/2015/02/12/rio-rancho-police-investigate-suspicious-deaths/", "title": "7-year-old girl, man found dead in Rio Rancho home", "dct": "Thu, 12 Feb 2015 06:25:00 GMT", "id": "d22063866554ef8701442a1ac704c4c6", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nRIO RANCHO, N.M. (KRQE) – Police say it was a murder-suicide. Officers found the 7-year-old girl and her father, 56, dead inside their Rio Rancho home Wednesday after being called to the home by the girl’s mother.\nPolice say it appears the father shot his daughter then turned the gun on himself.\n“However we are waiting evidence back from the office of the medical investigator as far as the characteristics of the wounds how they occurred to verify our suspicions,” said Rio Rancho Police Lieutenant Paul Rogers.\nIt all happened just before 5:30 Wednesday evening. Rio Rancho police say they were called to the house near Southern and Country Club for a child custody issue. They say the mom of the 7-year-old was trying to contact her daughter and ex-husband but couldn’t get in touch with them.\nWhen officers got to the home, they say the dad’s adult son who also lived there, answered the door. He told police his dad and step-sister were sleeping.\nInvestigators told him to wake the two up, they say he returned a short time later saying they both were dead.\n“Pretty soon 13 cops were here and then we just looked out and saw a lady screaming like she’s all scared,” said neighbor Ben Castillo.\nNeighbors say the son worked nights at Home Depot and would sleep most of the day. They say the father lost his job last week and was doing his best to make ends meet.\n“I can’t believe it because he is a very soft-spoken, mild person, never raised his voice. He was just trying to raise his kids, that’s all,” one neighbor, Danny Nevarez said.\n“I just can’t imagine what happened,” said Janet Shelton, another neighbor. “I couldn’t sleep last night. I was so upset.”\nNeighbors say the last time they saw the girl was this weekend when she celebrated her birthday. There are deflated-pink balloons still hanging on street sign.\n“Pretty little girl. She was nice, friendly, you could tell she wasn’t afraid to talk. She was nice, ” said Nevarez.\nPolice say the son was questioned late Wednesday night, but they aren’t saying if he was inside the home when the shooting happened. No charges are expected to be filed. The victims’ names have not been released.\nPolice say the young girl attended a private school in Rio Rancho.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}