{"uri": "http://www.roanoke.com/news/local/christiansburg/victim-of-accidental-shooting-in-montgomery-county-dies/article_d27ce5e2-b68f-5244-b6b9-968718c86bd0.html#.WDnUYPfVS-w.twitter", "title": "Victim of accidental shooting in Montgomery County dies", "dct": "Fri, 25 Nov 2016 15:45:00 GMT", "id": "59a3b453306953aa138d4f796d4ee21b", "content": "Neafor Randozzo was shot while visiting her adult nephew, her brother John Randozzo said Friday.\nThe Montgomery County Sheriff’s Office said earlier in the week that the shooter was a juvenile.\nThe sheriff’s office also said that the incident occurred inside a home in the 700 block of Dabney Road and that the weapon was a long gun rather than a pistol.\nThe sheriff’s office has yet to officially confirm the victim’s identity. The unidentified victim was said to have been in critical condition at a local hospital Wednesday.\nBecause of the Thanksgiving holiday, no updates on the incident or a subsequent investigation will be available until next week, said Deputy Mark Hollandsworth, a sheriff’s office spokesman.\nJohn Randozzo, who lives in Goshen, said his sister was a religious woman and described her as the “next thing to a preacher.”\n“She was a kind person. She tried to help everybody and she was into the Lord severe,” he said.\n“She would preach to everybody and she didn’t like nobody to do wrong.\n“She would give you the shirt off her back. It’s just a difficult time right now.”\nAbout a dozen status updates about Neafor Randozzo had been posted to Facebook by Friday .\nLetisha Wright Peters wrote Wednesday night: “Here it is almost 12 a.m. and I get on here and see that you are gone. I love and miss you already. I just talked to you the other day. This just doesn’t seem real right now, but I know you wouldn’t want us to be crying and upset because you have made it home with the Lord and you are smiling down on us all. Rest easy friend.”\nJoe Munsey wrote Thursday: “Rest in peace to my beautiful aunt Neafor Randozzo. You will be greatly missed! I cannot even express how much pain I am [in] right now … Love you auntie. May the angels guide you home. RIP. I will always be your little Rock Johnson.”"}