{"uri": "http://www.cbs8.com/story/21637042/2-teens-killed-2-injured-in-barrage-of-bullets-at-oceanside-park", "title": "2 teens killed, 2 injured in Oceanside park shooting", "dct": "Thu, 14 Mar 2013 06:13:00 GMT", "id": "1f7d7935951634ffbaf91e177568fe5e", "content": "OCEANSIDE (CBS 8) – Two teenagers are dead and two more were rushed to the hospital after being hit by a barrage of bullets, when gunman opened fire on an Oceanside park.\nThe bullets started to fly around 8:50 p.m. Wednesday night in Libby Lake Park.\nPolice say two victims were killed, and two more were hit with multiple bullets and rushed to Palomar Medical Center. All the victims are reportedly under the age of 18, and police suspect gang retaliation was a possible motive for the shootings.\nOceanside Police Lt. Leonard Cosby has worked in the area of Libby Lake Park for three decades, and told News 8 that the violence in the park \"startles him to death.\"\nWednesday night, police say they were searching for four or five shooting suspects. Witnesses described seeing two males wearing dark clothing leaving the area in a gray or silver 2005 or 2006 Toyota Tacoma or Toyota Tundra extended cab-style pickup.\nThe bodies of the two dead teenagers were discovered lying near a memorial for two other teenagers, who were also slain by gang gunfire in that same park back in May 2011.\nSandra Salgado, 14, and Felix Solano, 16, were shot to death in Libby Lake Park on May 3, 2011. The teenagers were not involved in gang activity, but police believed they were caught in the crossfire of a gang retaliation shooting.\nThis is a story update. The previous story is below.\nOCEANSIDE (CNS) - A search was under way Thursday for the assailants who opened fire on four teenagers, killing two of them and leaving the others wounded, at a North County park with a history of deadly gang violence.\nPatrol officers responding to reports of gunfire at Libby Lake Park in northern Oceanside found the underage victims - three boys and a girl - shortly before 9 p.m. Wednesday, according to police.\nMedics pronounced two of them dead at the scene and took the others to hospitals for treatment of serious wounds, Lt. Aaron Doyle said. The names of the slain youths were withheld pending family notification.\nFollowing the gunshots, witnesses described seeing several men or teenage boys in dark clothing fleeing in a gray or silver 2005 or 2006 Toyota Tacoma or Toyota Tundra extended-cab pickup truck, according to Doyle.\nThe motive for the attack was under investigation, the lieutenant said.\nThe shooting occurred near a memorial for two youths gunned down in a gang assault nearly two years ago. Late on the night of May 3, 2011, Sandra Salgado, 14, and her boyfriend, 16-year-old Fernando Solano, were slain on a hillside at the park.\nThree documented gang members await trial on double-murder charges for the slayings. The 20-year-old alleged gunman faces a possible death sentence if convicted, and the others are in line for potential terms of life in prison.\nA fourth defendant pleaded guilty late last year to being an accessory after the fact in the case.\nThe accused shooter's girlfriend testified that the killings were an act of revenge for an attack on one of his gang cohorts days earlier."}