{"uri": "http://kstp.com/news/suspect-arrested-levonte-king-jason-jones-shooting-death-penn-avenue-north-lowry-avenue-north/4206763/", "title": "Man Arrested in Shooting Death of 2-Year-Old", "dct": "Wed, 20 Jul 2016 20:02:00 GMT", "id": "26c284cda93c65053f2878d61828112b", "content": "Photo: Photo: KSTP/Thomas Palanuk\nThe Minneapolis Police Department arrested in connection with the death of a 2-year-old who was shot and killed earlier this month.\nInvestigators have identified the man as 31-year-old Chris Maurice Welch.\nTwo-year-old Le’vonte King Jason Jones died following a shooting at the intersection of Penn Avenue North and Lowry Avenue North July 8.\nJones' 15-month-old baby sister suffered non-life threatening injuries.\nInvestigators say the children were struck by bullets when the family's minivan was fired upon.\nMeanwhile, Jones' father, Melvonte Lee Peterson, has been charged with firing back at the driver who killed his son and wounded his daughter.\nAccording to the criminal complaint, video shows a minivan pulling up next to a black Chevrolet Impala that was stopped at the intersection. At that time, Minneapolis Police Shot Spotter equipment detected two gunshots, a pause, and then nine more gunshots.\nAfter the two shots were fired, video shows the minivan speeding away from the scene and turning onto Penn Avenue North as the other nine shots were fired. The Impala then drove away on Lowry Avenue North, police say.\nPolice say they believe the driver of the Impala is believed to have fired the first two shots, which hit two children inside the minivan being driven by Peterson.\nPolice say four bullets also hit North End Hardware, which was open for business at the time of the shooting. Police say the bullets that hit the store appeared to have been targeted at the Impala. They also say they found casings from a handgun along the path taken by Peterson’s minivan as well as a discharged cartridge casing from a handgun inside the van on the driver’s side floor.\nAfter the shooting, Peterson drove to North Memorial Medical Center, where the Jones died.\nPeterson is prohibited from possessing firearms.\nPeterson has been charged with illegal possession of a firearm and drive-by shooting. If convicted, he faces up to 15 years in prison and up to $30,000 in fines on the firearm charge and up to 10 years in prison and $20,000 in fines on the drive-by shooting charge."}