{"uri": "http://gazette.com/bullet-holes-apparent-blood-stains-where-neighbors-say-police-shot-juvenile/article/1593810", "title": "16-year-old suspect shot as he descended stairwell at east Colorado Springs apartments, residents say", "dct": "Fri, 06 Jan 2017 00:00:00 GMT", "id": "8bad928148acdcab0afb642312b28595", "content": "Police SWAT officers shot and wounded a 16-year-old male suspected in multiple violent crimes as he descended a stairwell Thursday afternoon at an east Colorado Springs apartment complex, residents said Friday.\nThe teenager was wanted on suspicion of second-degree assault with a deadly weapon, felony menacing, second-degree burglary and multiple counts of felony theft, according to the El Paso County Sheriff's Office, which is investigating the shooting.\nThe Sheriff's Office has said the teen was armed when officers encountered him around 3 p.m. at the Pine Creek Village Apartments, but have not said if he fired at officers, if he was shot, or what his injuries are. The teen, whose name has not been released, remained hospitalized Friday with what investigators have described as serious injuries.\nApartment residents were reluctant to talk about the shooting, but pointed to a stairwell near a laundry room door. Four bullet holes were spread across the middle of the door and discarded packages for bandages and clotting agents littered the floor.\nRed smears that appeared to be blood remained midway up the wall.\nInside the laundry room, a small rectangle of wall had been cut out, possibly to remove a bullet. A bullet also appeared to have gone through a window overlooking the parking lot.\nOne resident said she watched through her peephole as officers in front of her door fired up the stairwell.\nNo officers were injured in the shooting, the Sheriff's Office reported.\nThe office did not confirm if a CSPD officer is on paid administrative leave, as is customary following a shooting, other than saying, \"The status of the Colorado Springs police personnel who actively participated in the application of deadly force is in accordance with the current policies and procedures of the Colorado Springs Police Department.\"\nThe Sheriff's Office's Deadly Force Incident Team is handling the shooting investigation per state law, which mandates an outside party investigate when deadly force is used.\n-\nContact Kaitlin Durbin: 636-0362\nTwitter: @njKaitlinDurbin\nFacebook: Kaitlin Durbin"}