{"uri": "http://www.khou.com/story/news/local/2015/04/21/girl-survives-stray-bullet-to-the-head/26158673/", "title": "Girl survives stray bullet to the head", "dct": "Tue, 21 Apr 2015 00:00:00 GMT", "id": "768ad0c978c48311aa1484b60422de56", "content": "HOUSTON - For Kim Karns, a junior at Cinco Ranch, her cell phone is her lifeline.\n\"I was on Twitter or texting someone,\" said Karns.\nShe was sitting by the pool with her family on Sunday. Her head was down, fingers typing away on a text that likely saved her life.\n\"I looked down at the right time,\" said Karns.\nThat's when she felt it.\n\"I felt something hit me in the back of the head, thought it was a baseball or something,\" said Karns. \"It stung.\"\nNo one knew what it was or where it came from. But Karns was hurt.\n\"When I pulled my hand back, it was covered in blood,\" said Karns.\n\"We were immediately jumping up, going okay let's get to the emergency room,\" said Yvette Karns, Kim's mother.\nHer parents drove her to Memorial Hermann hospital in Katy where a CAT scan surprised even doctors.\n\"It was like all the life in me just drained,\" said Kim's mother.\nA bullet was lodged inside Kim's head.\n\"I should be dead,\" said Karns.\nAn ambulance rushed her to the Medical Center where doctors removed the bullet stuck between her scalp and skull.\n\"I was pretty much like bring it on, get it out of me,\" said Karns. \"I was ready to go home. I told them I got school tomorrow and a volleyball tournament this weekend.\"\nInvestigators with the Fort Bend County Sheriff's Office say this was a stray bullet. Someone nearby fired it up into the air and that is a crime.\n\"It's going to come down somewhere,\" said Karns. \"There's going to be a consequence for that.\nIt's a crime that Kim's mother says could have cost her daughter her life.\n\"Am I upset? Yes,\" she said. \"Would I like to wring their neck and say what were you thinking? Yes.\"\nMost people can't say they survived a bullet to the head.\n\"She had an angel on her shoulder that day,\" said Kim's mother.\nBut now Kim has the stitches to prove it.\n\"If I would have been one inch in any other direction, it could have gone differently,\" said Kim. \"I'm just really grateful to be alive.\"\nAccording to investigators, the caliber of the bullet has yet to be determined. Detectives believe the bullet was shot from south of the victim's home from a distance of up to a mile. If you have any information about this incident, call the Fort Bend County Sheriff's Office at 281-341-4665."}