{"uri": "http://www.kansascity.com/news/local/crime/article3400274.html", "title": "‘She did not deserve this,’ mourners say of 10-year-old killed in KCK drive-by shooting", "dct": "Mon, 27 Oct 2014 08:43:00 GMT", "id": "1b1b1db2d007d33e113081e914d617c5", "content": "For the second time in less than a fortnight, the Kansas City area is grieving the loss of a child to an act of senseless violence.\nMachole J. Stewart, a Kansas City, Kan., fifth-grader, was killed Sunday night when someone in a passing vehicle fired multiple shots into her family’s home at 15th Street and New Jersey Avenue.\nA relative said that Machole, who was always full of life and considered a natural comedian, was sitting on a couch when a hail of bullets was heard outside. Apparently thinking it was fireworks, Machole jumped off the ouch and was struck once in the right side of the head by a bullet that came into the house.\nMartika Stewart, Machole’s aunt, said the family was trying to make sense of the whole thing.\n“She’s 10 years old,” Sewart said. “What can she possibly do to someone?”\nThe girl’s slaying came nine days after a drive-by shooting outside a south Kansas City convenience store killed 6-year-old Angel Hooper.\nMachole and other members of her family were inside the house when someone fired the bullets just after 7 p.m. She died at the scene.\nNo one else in the home was hit, but bullets damaged cars along a crime scene that stretched for two blocks, police said.\n“I know the Kansas City, Kansas, Police Department is utilizing all resources to bring those responsible to justice,” said Mark Holland, the mayor and CEO of the Unified Government of Wyandotte County and Kansas City, Kan. “Our thoughts and prayers are with the family of Machole Stewart during this tragedy. This is a great loss for our schools and city.”\nPastor Desmond Lamb of Forest Grove Baptist Church described Machole and her family as active and cherished members of the congregation.\n“This definitely has struck us all,” Lamb said. “She did not deserve this.”\nMachole was a praise dancer who brought energy and joy to the church’s youth department, Lamb said.\n“She was quite a joy to have around,” he said. “She was very loving and very kind.”\nMachole also was a member of the Gateway Highsteppers drill team, and she loved to go roller-skating with her friends on weekends.\nShe loved helping to take care of her 10-month-old sister, with whom she lived along with her mother, said Martika Stewart. Machole also loved spending time with her grandmother.\n“She was a fashion queen,” Stewart added with a smile. “She had to make sure everything matched.”\nMachole was also good at making up songs and jokes.\n“When she was around, you knew you were going to get a laugh,” Stewart said.\nRadio station KPRS, in conjunction with the Ad Hoc Group Against Crime, broadcast live from the church Monday, seeking tips in Machole’s killing. Friends and fellow church members took comfort at the church Monday night.\nA similar effort by KPRS last week generated promising tips in Angel Hooper’s death, said Alvin Brooks, the president and CEO of the group.\nAfter meeting with Machole’s family Monday, Brooks said it was crazy to have two families experience the same painful loss in such a short period of time.\n“The cowards responsible for the senseless killing of these children need to be brought to justice,” he said. “The communities of Kansas City and Kansas City, Kan., are not gong to allow the killing of these babies to go unsolved.”\nAs horrible as Sunday’s incident was, some people who live in the area said it could have been much worse.\nOn Monday morning, neighbors said they heard numerous gunshots ring out Sunday just minutes after children had been playing and riding bikes on the street.\nMost of the children had just been called inside because it was a school night, said Monique Jefferson, who described Machole as a “very good kid.”\n“She was smart and funny,” Jefferson said of Machole, a student at T.A. Edison Elementary School.\nAnother neighbor, who asked that her name not be used because the shooter was at large, said she heard about 15 shots.\nThe woman ran upstairs, where her mother was caring for a baby, and yelled for her mother to get down. Within seconds of the shots being fired, police sirens could be heard, she said.\nThe woman said she heard “screaming and crying” coming from inside the home where Machole lived, and she saw a woman arrive who screamed “they killed my baby.”\nWyandotte County Commissioner Tarence Maddox, who said he knew the family, came to the scene Monday morning. He counted nine or 10 bullet holes dotting the front of the small wood-frame home.\n“The killing of Machole is a nightmare for the family and the city of Kansas City, Kansas,” Maddox said. “It’s a real tough situation.”\nDavid Smith, a spokesman for the Kansas City, Kan., School District, said the district’s crisis team was at Machole’s school first thing Monday morning to support staff and students.\n“They’ll be there as long as they are needed,” Smith said.\nPolice ask anyone with information to call the TIPS Hotline at 816-474-TIPS (816-474-8477).\nTo reach Tony Rizzo, call 816-234-4435 or send email to trizzo@kcstar.com.To reach Matt Campbell call 816-234-4902 or send email to mcampbell@kcstar.com."}