{"uri": "http://www.courant.com/breaking-news/hc-new-haven-party-shooting-0601-20150531-story.html", "title": "Five Shot In New Haven Early Sunday", "dct": "Sun, 31 May 2015 17:55:00 GMT", "id": "c54e2c14addad03ff3178049734f75ae", "content": "NEW HAVEN — A man who was among five people shot at a party Sunday is in critical condition.\nPolice responded about 2 a.m. Sunday to a reported shooting on the second floor of 849 Chapel St., between Church and Orange streets, where they found a large number of people in the street, according to a press release.\nThree people who had been shot were taken by ambulance to Yale-New Haven Hospital and two people who had been shot went by private car to the hospital.\nPolice released the names of the following people who were shot:\nYou’ve Been Lied To. Thread Count is a Lie. Learn Why Bamboo Sheets are Hands Down the Best Choice for Bedding in 2017.\nSee More\n•Jaime Rodriguez, 21, shot in the lower back, knee, groin and thigh, in critical condition.\n•Joshua Agosto, 25, shot in the chest and buttocks.\n•Gerald Pugh, 28, shot in his right buttocks, twice in the leg and once in the thigh.\n•Jovanni Leon Vargas, 23, shot twice in one arm, once in the other and a graze wound to his abdomen.\n•Hector Martinez, 30, graze wound in the upper back.\nPolice have interviewed dozens of people who attended the private event, with more interviews expected.\nAccording to police, two groups of people were arguing as the party began. Private security guards separated the groups and the party continued.\nThe two groups began arguing again just before 2 a.m. as the party was winding down. Security guards separated them and ushered partygoers outside. One group was kept inside so the dispute wouldn't spill into the street.\nMoments later, witnesses reported that a man re-entered the building, pulled out a semi-automatic handgun and opened fire, emptying the gun of bullets and injured the five people, police said.\nPolice report that the entire confrontation occurred on the second floor of the building.\nPolice believe the shooter attended the party and knew people there, but it was not clear whether people were targeted.\nThe party was a \"White Party,\" at which guests wear all or mainly white clothing. Witnesses described the shooter as a Hispanic man of average build, dark hair, clean-shaven and possibly clad in a white V-neck T-shirt.\nThe man may have fled in a silver Infiniti SUV. The car was last seen headed eastbound on Chapel Street.\nPolice have not identified a suspect and say the silver Infiniti is only a vehicle of interest; its involvement isn't certain.\nAnyone who saw the shootings or who may have information is asked to call detectives at 203-946-6304. Calls may be made anonymously."}