{"uri": "http://www.baltimoresun.com/news/maryland/crime/blog/bs-md-ci-homicide-rapper-20150522-story.html", "title": "Police ID man who died in Wednesday quintuple shooting", "dct": "Fri, 22 May 2015 20:53:00 GMT", "id": "d305110329968372efe90a475c66bf21", "content": "City police identified a man who was killed in a Wednesday shooting that injured four other people, and said one of the surviving victims and a man who were seen running from the scene have been charged.\nThe fatal victim was identified as Darell Alston Jr., 26, who was also identified on social media as a local rapper known as \"Nazty.\"\nPolice said Andrew Parmele and Shilo Thomas have been charged after being spotted running from the scene of a vehicle accident in the area of the shooting. Parmele suffered a gunshot wound to his arm. They are charged with handgun violations after guns were found in the vehicle they were running from, police said.\nThomas is also a rapper, known as \"Shymoney.\" Both Alston and Thomas had gained attention in recent months for producing \"diss tracks\" attacking other rappers, who filmed response videos. Nazty's video had more than 90,000 views on YouTube, while one posted by Shymoney has more than 430,000 views.\nPolice have declined to discuss the case or identify other potential suspects.\nThe shooting broke out around 3:30 p.m. Wednesday in East Baltimore. The crime scene stretched nearly a half-mile, shutting down traffic along East Monument Street. That day, a police commander said officers had been in the area and heard shots, and pursued a group of men.\nOne man was arrested there, and another was chased through an alley and apprehended. Police had SWAT units respond to a home on North Linwood Avenue, where another man - with a bullet wound to his shoulder - was eventually removed and taken away on a stretcher.\nPolice on Friday identified victims of several other homicides -- all fatal shootings -- this week. Charles Adams, 57, died after a Thursday shooting on the 1800 block of Ramblewood Road in Loch Raven. Michael Smith, 42, died after a Wednesday shooting on the 500 block of N. Pulaski Street in Midtown-Edmondson. Jarmar James, 32, was identified as the victim of a fatal shooting in the block of 800 W. Saratoga Street in Poppleton on Wednesday.\nIn addition, police said that just after 4 p.m. Friday, a 21-year-old man was shot in the shoulder in the 2300 block of E. Preston Street . He was expected to survive.\nBaltimore Sun reporter Alison Knezevich contributed to this article."}