{"uri": "http://www.news4jax.com/news/4yearold-shot-in-st-augustine/33072576", "title": "4-year-old shot in St. Augustine", "dct": "Sun, 17 May 2015 23:46:00 GMT", "id": "237abc9b3d398c2d92489b866356263b", "content": "ST.AUGUSTINE, Fla - A 4-year-old St. Johns County boy is in Jacksonville recovering after being shot in the stomach Sunday afternoon.\nDeputies said the boy's parents called 911, but they don't know yet if the boy was holding the gun or if it was someone else.\nNeighbors said at one point they counted as many as 20 police cars.\n\"We didn't recognize it as a gun shot, but just a cap, like a cap gun or something,\" one neighbor said.\nIt's a sound neighbor Sean Sammon said he isn't used to hearing in the St. Augustine neighborhood. Within minutes of the shooting, the area was packed with law enforcement. Sammon said what he saw next shocked him.\n\"There were a couple police officers, we saw them running through the yard with like AR guns out, and we heard more ambulances start to come,\" Sammon said.\nWhat Sammon heard was 4-year-old Bentley Lenhart being shot in the stomach.\nThe boy was airlifted to the hospital and is in stable condition. Details are still scarce. Authorities are trying to deterine who fired the weapon.\n\"We are trying to piece it together,\" said Kevin Kelshaw, with the St. Johns County Sheriff's Office. \"Right now it appears this was some type of accidental shooting. The circumstances will let the evidence determine that.\"\nKelshaw said the boy's parents are cooperating and are now with their son. The father has been identified as Shawn Lenhart.\nIn the meantime, neighbors said they are hoping to find out what happened. They said their thoughts are with the boy and his family.\n\"Anytime a child is hurt the whole family suffers,\" Sammon said. \"We wish them the best, and they're in our prayers for sure.\"\nThe Department of Children and Families has been notified, which is protocol, but it's unclear if they are investigating the incident.\nCopyright 2015 by News4Jax.com. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}