{"uri": "http://www.nbcbayarea.com/news/local/One-Dead-Seven-Injured-in-Drive-By-Shooting-in-Vallejo-229459261.html", "title": "One Dead, Seven Injured in Drive-By Shooting in Vallejo", "dct": "Sun, 27 Oct 2013 19:04:00 GMT", "id": "a80b75789daea7c6502bae1a89588059", "content": "One person was killed and as many as seven others injured in a mass shooting in Vallejo late Saturday night, police said today.\nAccording to a preliminary investigation, a group of young adults from South San Francisco were in four cars heading to Vallejo for a party, Vallejo police said.\nAt about 11 p.m., one of the vehicles hit a curb and got a flat tire near the 200 block of Princeton Avenue, police said.\nAs all four cars pulled over and several individuals were changing the tire, a white SUV with tinted windows drove by and opened fire on the group, police said.\nThere appeared to be one gunman inside the vehicle.\nPolice and paramedics responded to reports of a shooting and found five people suffering gunshot wounds.\nThree other victims from the same incident arrived at area hospitals on their own, police said.\nOne of the neighbors in the area, who was a registered nurse, said she tried to help those injured.\n\"When we came outside, we saw these victims outside,\" she said. \"One gentleman was hurt in the heart, and the other gentleman, he could move his legs and his body, so we went to the victim that was unconscious and tried to revive him.\"\nA 19-year-old man was pronounced dead at the scene, police said. His name has not been released.\nVallejo Police Lt. Herman Robinson said he had never seen an incident like this.\n\"I've been working here at the police department for 40 years, and I've never experienced a single incident where there have been eight people shot.,\" Robinson said.\nNo motive for the shooting had been determined as of Sunday night.\nAnyone with information about the crime is asked to contact Vallejo police at (800) 488-9383.\nAnonymous callers can call Solano Crime Stoppers tip line at (707) 644-1867."}