{"uri": "http://www.wdrb.com/story/34001942/man-shot-during-juice-bowl-a-random-guy-just-walked-up-and-started-shooting", "title": "Man shot during Juice Bowl: 'A random guy just walked up and started shooting'", "dct": "Thu, 08 Dec 2016 02:07:00 GMT", "id": "84716e95829c9e2e89f6f9c1baa4e360", "content": "LOUISVILLE, Ky. (WDRB) -- Visiting Louisville from Lebanon on Thanksgiving Day, Faquawn Calhoun was at Shawnee Park to watch the Juice Bowl.\n“I’m thinking we’re going to a football game to have a good time, leave, eat a good meal,” Calhoun said.\nWhile Calhoun was waiting for the game to start, he says he watched motorcycle races in another part of the park.\nThat’s when the 26-year-old says 20 to 30 gunshots were fired.\n“A random guy just walked up and started shooting at the crowd,” Calhoun said. “The first shot, he shot someone standing right to the right of me. And the second shot, I tried to run, but he shot me in the back of the leg.”\nCalhoun says the man beside him died after being shot in the head.\n“I tried to run, but I couldn’t run, so I kind of crawled behind a car,” Calhoun said. “I got up to ask for help and like six people actually told me no.”\nIt was a stranger who drove Calhoun to University Hospital.\nAn arena football player, Calhoun was in the process of training. Still on crutches, his career is now on hold.\nBut Calhoun says he feels lucky to be alive.\n“It was just like a blessed feeling, because I could’ve been one of the guys who didn’t make it,” Calhoun said. “I got to make it back home to see my family. Other people are burying their family members, so I’m blessed, really.”\nLMPD says two of the seven people shot were killed. The shootings were not reportedly connected to the Juice Bowl but happened following some type of dispute.\nThough Calhoun only saw one gunman, investigators have not said how many are believed to be involved.\nNo arrests have been made.\nAnyone with information on the shootings is urged to call the LMPD tip line at 574-LMPD.\nRelated Stories:\nCopyright 2016 by WDRB Media. All rights reserved"}