{"uri": "http://nbc4i.com/2015/12/03/child-shot-on-east-side-of-columbus/", "title": "Mother charged after three-year-old shoots himself", "dct": "Thu, 03 Dec 2015 14:58:00 GMT", "id": "c664409a5175bb4721e063b831be5292", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCOLUMBUS, Ohio (WCMH)–A three-year-old little boy is out of surgery after shooting himself in the abdomen on the east side of Columbus.\nIt happened around 3 p.m. Thursday afternoon inside a home on Kelton Ave near Kent Street. Now, Columbus Police are again stressing the importance of gun safety.\nWhen medics arrived, the little boy was inside a silver sedan out front. A neighbor was about to drive him to the hospital.\nA family member told us the little boy was having surgery at Children’s Hospital. Police were going to take his mom to headquarters to figure out exactly what happened.\nThey say mother and child were home alone at the time of the shooting and the gun was found in a room upstairs. Police did not disclose how many bullets were fired, but medics say the child was shot in the abdomen.\n“If you do have a firearm inside of a house and you have small children they are curious and you’ve gotta make sure that you put it in a very secure area away from them because if its down low they can find it,” said Columbus Police Sgt. Rich Weiner. “If it’s not locked up they can find it.”\nColumbus police have not identified the child or the mother. A family member says the mother’s boyfriend has been raising the little boy as his own and also lives in the home. That same family member says the little boy’s mother is now expecting a second child.\nAccording to a release, the mother, Damira M. Crowder, was charged with Endangering Children (F3) Thursday night.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}