{"uri": "http://www.enewscourier.com/news/local_news/update-athens-man-charged-in-accidental-shooting-at-new-year/article_86ab1bce-d044-11e6-94e0-0ff7b59f194c.html", "title": "UPDATE: Athens man charged in accidental shooting at New Year's Eve party", "dct": "Sun, 01 Jan 2017 00:00:00 GMT", "id": "bccd03bed4cae61ab13690fe256ba82e", "content": "The community is in shock after a New Year’s Eve party turned deadly for a small child in Limestone County.\nA five-year-old girl was fatally shot Sunday morning at a party on Buckskin Drive in Athens.\nFidel Rodriguez Canchola, 34, of Buckskin Drive in Athens was arrested in connection to the shooting, which the Limestone County Sheriff’s Office said was accidental.\nCanchola, known as Rodriguez, was booked into the Limestone County Jail on a charge of criminally negligent homicide, a class A misdemeanor. He is being held on a $5,000 bond.\nDeputy Stephen Young, public information officer for LSCO, said Sheriff Mike Blakely and Investigator Lance Royals located Rodriguez at his home at 7:20 a.m. Sunday.\n“At 12:06 this morning, deputies responded to a residence on Buckskin Drive, where the victim had been shot once in the chest,” Young said. “She was pronounced dead at Athens-Limestone Hospital.”\nYoung said about 30 people were at the residence for a New Year’s Eve party. Initially nobody in the group said they had seen or heard anything except gunshots coming from down the street, Young said.\nInvestigators recovered several .22 caliber shell casings at the scene.\nAfter interviewing those on the scene, investigators were able to determine that Rodriguez had allegedly fired several rounds in the yard toward the ground when the girl walked out into the line of fire, Young said. Rodriguez had left the scene, apparently on foot, before deputies arrived, according to Young.\n“When he realized what happened, he got scared and ran,” Young said.\nThe .22 caliber revolver was recovered on the other side of a fence at the location.\nRodriguez was arrested at his home Sunday morning without incident.\n“While every accidental death is tragic,” Sheriff Blakely said. “It’s especially difficult when you lose a young child. The sad thing is that incidents like this are 100 percent preventable with a little common sense.”\nThe LCSO is reminding the community that while we all like to celebrate during the holidays, common sense should prevail. “Firearms are not fireworks. They should never be used when alcohol is consumed and all proper safety precautions must be taken.”"}