{"uri": "http://www.dailypress.com/news/newport-news/dp-nws-nn-girl-shot-in-house-20160830-story.html", "title": "2nd shooting of 10-year-old this month has Southeast parents on edge", "dct": "Tue, 30 Aug 2016 17:50:00 GMT", "id": "0ad43d29a2a294e84af6db556a406b4f", "content": "Monday night's drive-by shooting of a 10-year-old girl in her Southeast Community home – the second time a child that age was shot in the Southeast this month – has parents wondering how to keep their kids safe when keeping them indoors isn't enough.\nThe incident marked the 19th time a minor under age 18 was shot in Newport News so far this year — one fatally, said Jamie Bastas, a police spokeswoman. Eleven of those – 58 percent – occurred south of Mercury Boulevard.\n\"Past a certain time, we keep our kids inside, but it's scary because it could go through the window,\" said Dazha Watkins, who lives across the street from where the 10-year-old was shot Monday night. She sat on her front porch Tuesday afternoon while her children played inside.\nWatkins had just moved her family, including her children, ages 2, 6 and 7, from the Ridley Place public housing complex to the Williams Street home about a week ago, hoping there would be less violence.\n\"We thought it would be safer here,\" said Cameron Brayboy, who was once shot in the leg while caught in the crossfire of a gun battle in Ridley Place.\nAfter this incident, the pair are already thinking of moving the family again.\nPolice do not believe the 10-year-old girl, who was released from the hospital Tuesday, was the intended target of the gunfire Monday, said Harold Eley, a police spokesman.\nOn Aug. 9, a 10-year-old girl and two teenage boys, ages 14 and 16, were injured by gunfire outdoors in broad daylight at the Marshall Courts public housing complex, about a mile west. Police did not believe the minors were the intended targets in that incident, either.\nJust before 11:30 p.m. Monday, dispatch received a call for a shooting on Williams Street, near the corner of 30th Street – not far from Greenlawn Cemetery and the Hampton city line. When police arrived to the two-story multi-family home, they found the girl with a gunshot wound to her lower leg, and she was taken to the hospital.\nPeople told police they saw shots fired from a red vehicle as it drove away from the area. At least one shot traveled through the wall and struck the child in the leg, police said.\nBullets also struck another house, nearly hitting a woman lying in bed, she told the Daily Press. She slumped down in bed to lay flat, frozen as bullets struck her mattress and headboard, she said.\n\"My kids would be burying me today if I hadn't laid down,\" said the woman, who asked not to be identified – a common concern among many residents who are reluctant to speak publicly about such incidents. \"There were so many shots I couldn't even tell you how many.\"\nAt least three bullet holes mark the front of her home, near the front window.\nHer two grandchildren who live with her, ages 1 and 2, were not home at the time, she said. She has lived there a year without issues, but is now planning to move, for the childrens' safety.\n\"We're not safe in our own home,\" she said.\nPolice have no suspect information, but are working leads as the investigation into the incident continues, said Eley.\nPolice ask anyone with information on the shooting to call 1-888-LOCK-U-UP.\nMinors shot in Newport News so far this year:\n10-year-olds: 2\n14-year-olds: 2\n15-year-olds: 3\n16-year-olds: 1\n17-year-olds: 11 (one fatal)"}