{"uri": "http://www.kptv.com/story/33409748/police-liquor-store-robber-shot-himself-during-swat-situation-in-albany", "title": "Police: Liquor store robber shot himself during hostage situation in Albany", "dct": "Tue, 18 Oct 2016 00:03:00 GMT", "id": "b654e782aa70cdc2ecac15087e26b9bb", "content": "ALBANY, OR (KPTV) -\nA man robbing an Albany liquor store and holding two people hostage shot himself after law enforcement arrived at the scene, according to police.\nPolice were called out to the liquor store on Pacific Boulevard at 11:25 a.m. Monday.\nSWAT was activated to respond to the scene when it was learned the gunman had hostages inside the store.\nPolice evacuated several blocks around the liquor store.\nAs the situation was unfolding, police said two shots were heard several minutes apart from inside the store.\nTwo people then walked out of the store and told officers the robbery suspect was injured inside from shooting himself.\nOfficers went inside and discovered the suspect on the ground. It was determined he had sustained a self-inflicted gunshot wound.\nThe suspect, identified as 62-year-old Gerald Armand Thompson of Eugene, was taken to the hospital, but his condition was not immediately known.\nThere were no other injuries.\nThe incident remains under investigation. Anyone with information about this case is asked to contact Detective Dan Jones at 541-917-7686.\nCopyright 2016 KPTV-KPDX Broadcasting Corporation. All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}