{"uri": "http://www.baltimoresun.com/news/maryland/crime/blog/bs-md-ci-reisterstown-road-shooting-20151002-story.html", "title": "71-year-old man killed in Friday's shooting at Reisterstown Road shopping center", "dct": "Sat, 03 Oct 2015 11:40:00 GMT", "id": "6a0b8b8640154615e73b9227e4b4c37e", "content": "Baltimore Police are investigating the shooting of five adults at a shopping center on Reisterstown Road around 3:00 pm. If you have any information, you're asked to call (410) 396-2100. (Kevin Richardson/Baltimore Sun video)\nA 71-year-old man was killed in Friday afternoon's shooting at a Reisterstown Road shopping center, city police said Saturday.\nPolice identified the victim as James Gaylord of the 400 block of Winston Avenue. They also released partial identities of four others who were wounded in a burst of gunfire at the busy shopping center: a 54 year-old male, a 41-year-old female, 33-year-old male, and a 26-year-old male.\nNo arrests have been made, and police said they didn't know of any suspects or motive.\nA patrol officer was alerted to a wounded person on the ground at the Hilltop Shopping Center in the 5400 block of Reisterstown Road about 3 p.m. Friday and found several others wounded as well, a police spokesman said.\n\"This was an officer who called in and said, 'I have a shooting right where I am, right now,'\" said city police spokesman T.J. Smith.\nA woman at a nearby barbershop said she heard what sounded like three or four guns firing in a \"shootout.\" She and others in the shop ran into a back room until they heard sirens outside, she said.\nThe woman did not want to give her name because \"people are cruel,\" she said, and whoever opened fire in the crowded shopping center \"doesn't have any compassion for others' lives.\"\nOfficers shut down the block and flooded the area, dropping at least a dozen orange evidence markers on the sidewalk outside a 7-Eleven at the corner of Reisterstown Road and West Rogers Avenue. Crime tape surrounded the shopping center south to Lewiston Avenue.\n\"This was a brazen act at 3 p.m. in the afternoon,\" Smith said. \"It's a crowded shopping center.\"\nSmith said one male who appeared to be an adult was killed and that three men and one woman were injured. He said the surviving victims had injuries ranging from \"graze wounds\" to \"through and through\" bullet wounds.\nSmith said he did not know whether there was one shooter or more, or if there was a person targeted in the shooting.\nHe said no one pulls out a gun in such a manner \"for any other reason than to shoot at people,\" but that \"in all likelihood, some of them were innocent victims that were in the shopping center.\"\nHe urged community members with information to come forward.\n\"We're fortunate that we're not talking about any children that were injured out here,\" he said. \"At 3 o'clock in the afternoon, it shows you how careless and reckless these bad guys are.\n\"We want the community to understand that one of your children could have been out here, so if you know who this person is, call us.\"\nRobin Mouzone said she was trying to go to the Motor Vehicle Administration office in the shopping center when she saw police tape going up.\nShe said she frequents the area and that her daughter works at a nearby restaurant.\n\"It's just close to home,\" she said. \"It's just scary. You can't go somewhere and shop and not think about getting hurt.\"\nShe said she is tired of the violence in the city, and scared to think how many \"killers are out here for real.\"\nErik Thompson, whose father has owned the nearby Hilltop Hardware store for more than four decades, said the area has gone downhill since police officers whom neighborhood residents knew by name stopped patrolling regularly on foot.\n\"The last 25 years, the Baltimore City Police Department has gotten away from something that was very effective when I was a kid: good old flat-footed cops,\" he said. \"They need to get back to grass-roots policing.\""}