{"uri": "http://www.statesman.com/news/news/crime-law/ems-one-dead-in-active-shooter-situation-downtown/nr7fW/", "title": "Murder warrant issued for suspect in fatal downtown Austin shooting", "dct": "Mon, 01 Aug 2016 00:00:00 GMT", "id": "c1c3aa8811797e5886ed0258a9438e4e", "content": "10:00 p.m. update: Austin police on Sunday night issued a murder warrant for Endicott McCray, the man who was identified hours earlier as a person of interest in the overnight shooting on Sixth Street that left one woman dead and four others injured.\nMcCray has still not been taken into custody. His bail is set at $2 million, police said.\nAnyone with information on the suspect’s whereabouts is asked to call the homicide tipline at 512-477-3588.\nMcCray is described as a 5-foot-9-inch tall black man who weighs approximately 130 pounds pounds. He has a goatee wears his hair in dreadlocks.\nMcCray is a resident of San Marcos and has been multiple burglary convictions, according to Hays County court records. Austin police say he may be armed.\n5:00 p.m. update: Relatives have identified the woman who was fatally shot early Sunday on Sixth Street as 30-year-old Teqnika Moultrie.\nAustin police have not confirmed her identity or of the four other women who were injured after a man opened fire at a crowd on Sixth and Brazos streets just after 2 a.m. The shooter is still at large.\nRicky Moultrie of Las Vegas, Teqnika Moultrie’s brother, told the American-Statesman her sister lived in the Bay Area and had traveled to Austin to visit her fiancée’s family. According to the siblings’ grandparents, Teqnika Moultrie had spent Saturday rafting and went out that night to see the city. She was with her fiancée downtown when she was shot, Ricky Moultrie said.\nTeqnika Moultrie was a tomboy growing up and an avid athlete, according to her brother. She worked as a school bus driver and loved kids.\n“She loved life, period,” Ricky Moultrie said. “After our mother passed away, she filled those footsteps. She was the glue to our family.”\nRicky Moultrie said he did not know anything about Endicott McCray, the person of interest police are searching for in connection to the shooting.\n“They just wouldn’t be around that type of crowd, people that would commit a murder,” Ricky Moultrie said.\nMcCray is a resident of San Marcos, according to Hays County court records. He is a five-foot-nine black male, approximately 130 pounds, who has a goatee and wears his hair in dreadlocks.\nMcCray, who records show has several felony burglary convictions, is scheduled to appear in Hays County court in September for a possession of marijuana charge. His attorney in the case said he hasn’t had any contact with him Sunday and that the last time he saw him was more than a week ago.\nMcCray is considered to be armed, according to police. Anyone with information is asked to call the homicide tipline at 512-477-3588.\n2:00 p.m. update: Police are searching for 24-year-old Endicott McCray in connection to the fatal shooting that left one dead and four injured early Sunday on Sixth Street.\nPolice identified McCray as a “person of interest” and warned he may be armed. He is a black male approximately five-foot-nine tall and weighs about 130 pounds, police said. McCray has a goatee and wears his hair in dreadlocks. Police could not release a definitive description of what he was wearing.\nAccording to public records, McCray has multiple burglary convictions and served time in jail. He was recently arrested for unlawful possession of a firearm by a felon in June and released on $6,000 bail, according to Hays County court records.\nAnyone with information is asked to call the homicide tipline at 512-477-3588.\nIdentities of the victims are not being released at this time, police said.\n9:00 a.m. update: Austin Police Chief Art Acevedo offered condolences Sunday morning to the families and friends of the woman killed and four others injured in an overnight shooting on Sixth Street.\n“On behalf of the Austin Police Department, we wish to extend our deepest condolences to the family and friends of the young woman who lost her life to this senseless act of violence and wishes for a speedy recovery to the individuals wounded,” Acevedo said in a statement.\nPolice are still searching for the shooter, who opened fire into a crowd on Sixth and Brazos streets just after 2 a.m. Sunday.\n“The men and women of the Austin Police Department will work (tirelessly) to identify and apprehend the person responsible,” Acevedo said.\nPolice could not say Sunday morning if the shooter and victims knew one another. The investigation is ongoing.\nEarly Sunday, the area around Sixth and Brazos streets was still shut down as police processed the scene.\nJust blocks away and moments after the first shooting incident, police responded to an aggravated assault with shots fired at a parking garage on Trinity Street. One person was injured and detained.\nThe back-to-back incidents led police to issue an “active shooter” warning early Sunday morning. They later clarified that the two incidents were unrelated.\nIn his statement, Acevedo called Austin one of the “safest cities” in the nation.\n“The community we serve partners with APD to stand up for our neighbors and friends and to bring those that would do us harm to justice,” he said.\nAnyone with information about the Sixth Street shooting is asked to call the homicide tipline at 512-477-3588. Those with video of the incident or its aftermath can email police3@austintexas.gov.\nVideo below courtesy of Steven Salinas\n5:45 a.m. update: Austin police are looking for the person who opened fire on a crowd on Sixth Street in a shooting that killed one woman and injured four other people early Sunday.\n“It was a very chaotic scene,” Austin police Chief of Staff Brian Manley said at a news conference shortly before 5 a.m. “A lot of people running in different directions with all the gunshots coming out.”\nThe shooting was reported at 2:17 a.m. in the 200 block of East Sixth Street — two blocks east of Congress Avenue in the heart of the entertainment district just as patrons were leaving bars at closing time.\nManley said that a woman in her 30s was killed and that the incident involved a person shooting into a crowd.\nThe four others injured, all women, are expected to survive, according to Austin-Travis County EMS. Three were taken to University Medical Center Brackenridge. The fourth refused treatment, EMS Cmdr. Mike Benavides said.ond incident was reported as an assault in the 800 block of Trinity, Manley said.The deadly incident on Sixth Street in which a woman in her 30s was killed involved a person shooting into a crowd, Manley said. One woman died, three women were taken to University Medical Center Brackenridge with injuries describe as not life-threatening. A fifth victim refused treatment, EMS Cmdr. Mike Benavides said.\nShortly after the shooting, a second incident involving a gun was reported in the 800 block of Trinity Street, about three blocks away, Manley said.\nNo injuries were reported in that incident, which happened at 2:24 a.m. in a parking garage on Trinity Street. After a reported assault in which gunshots were fired, Manley said, bystanders helped detain a person.\n“Given that we just had just had multiple shots fired on Sixth Street and then we have another incident blocks away with shots fired in that incident,” Manley said, “the initial concern was that we have an individual engaged in active shooter tactics in an entertainment district, but, again, that is not what our assessment is at this point. We have two separate incidents.”\n4:20 a.m. update: Sam Vedamanikam, 26, and several friends were headed back to their car when they heard four or five gunshots that sent them and hundreds others diving to the ground.\nIt happened in the Sixth Street entertainment district, east of Congress Avenue, where one woman in her 30s died after being shot, Austin-Travis County EMS said. Emergency workers initially called the incident an “active shooter” situation. Police now say it was two separate shootings in the same area.\nThere have been no further shootings reported in the area. However, police were urging people to continue to avoid downtown Austin.\nVedamanikam was leaving the dance club Barbarella and headed west on Sixth Street when one of the shootings occurred. He was near Sixth Street and San Jacinto when he heard gunshots.\n“There were just tons of people on Sixth Street and I see all of them jump toward the ground,” he said. “A lot of people were screaming.”\n4 a.m. update: Authorities say there were five victims in the shooting: a woman who died at the scene, two women and a man who were taken to the hospital for treatment of gunshot wounds, and a man who refused treatment. A witness said the shootings happened along Sixth Street, east of Brazos Street.\n3:25 a.m. update: Austin police says the “active shooter” incident that left one woman dead in downtown Austin was two separate incidents.\nBoth scenes are secure, police said at 3:18 a.m.\nEarlier: Austin-Travis County EMS has confirmed that one woman in her 30s is dead in an incident they described as an “active shooter” situation on Sixth Street in downtown Austin.\nMultiple people have been injured in the shooting, according to EMS. Three people were taken to University Medical Center Brackenridge, authorities said.\nThe Austin Police Department confirmed the active shooter situation and is warning people to avoid the area. Officials report multiple victims. Additional details to come.\nUPDATE: This story has been corrected to report that Endicott McCray was released from jail on $6,000 bail after being arrested in June on a weapons charge. A previous version of this story erroneously said he was released without paying bail."}