{"uri": "http://www.trentonian.com/general-news/20170117/shooting-assaults-and-drug-busts-january-17-2017-trentonian-police-blotter", "title": "Shooting, assaults and drug busts: January 17, 2017 Trentonian Police Blotter", "dct": "Tue, 17 Jan 2017 17:37:00 GMT", "id": "9054814168a373532e10df08e0962ee3", "content": "The information below was provided by police unless otherwise noted.\nTrenton\nShooting: A 17-year-old male was shot in the shoulder Monday night. The teen told police he was a passenger in a vehicle in the 400 block of Stuyvesant Avenue when a bullet entered the car and struck him. The driver took him to the hospital. Police are still investigating whether the teen or the driver were the targets of the shooting. No suspect description was provided.\nCaught with Ecstasy: Eric Ingram, 33, was arrested after police saw him drinking alcohol in public and then allegedly found him in possession of 96 ecstasy pills and $119, which was seized.\nDomestic Assault: Damon Downs, 44, was arrested over the weekend after he allegedly strangled his wife. Police were sent to his Asbury Place home around 1:30 a.m. Saturday after his residential panic alarm was activated. When police arrived at the home, they spoke with Downs’ 31-year-old wife who told them she activated the silent alarm after Downs strangled her making it difficult for her to breathe.\nAdvertisement\nBurglary: Nyasiga Parker, 25, was arrested Sunday after she allegedly kicked open another woman’s home and damaged several items inside the property. When police arrived at the Monmouth Street home, they found the front door open and heard commotion inside the residence. They then encountered Parker as she walked downstairs from the second floor. Further investigation revealed that Parker traveled to the home specifically to fight a woman who lives there.\nCrack and Heroin: Desmond Gilchrist, 33, and Justine Atkinson, 27, were arrested Saturday after police allegedly found them in possession of drugs and paraphernalia. Officials say the pair was sitting on the steps of an abandoned property near the intersection of Tyler Street and South Clinton Avenue when police drove through the area. When Gilchrist saw cops, officials say, he jumped off of the porch, dropped heroin onto the ground and ran. After a foot chase and a brief struggle, Gilchrist was arrested and police allegedly found crack cocaine, a razor blade, two crack pipes and imitation cocaine in his pockets. Police then returned to where Gilchrist dropped the heroin, but they couldn’t find it. So, they detained Atkinson believing she had concealed or destroyed the drugs, and they found her in possession of four bundles of heroin and three hypodermic needles.\nCrack and Pot: Shawn Pressley, 38, and Deandre Murphy, 37, were arrested over the weekend after police allegedly found them in possession of one gram of crack cocaine and one gram of marijuana during a traffic stop in the city. Police also seized $2,350 in cash from the pair as suspected proceeds from drug sales.\nCoke Bust: Nathaniel Davies, 34, was arrested after police interrupted an alleged drug deal and found him in possession of 30 grams of cocaine and a digital scale.\nPill Bust: James Collins, 29, was arrested last week after police allegedly found him in possession of four Percocet pills.\nBristol, Pa.\nAssault: Laura Miladin, 48, was arrested after an alleged assault that happened in the 7200 block of Norman Avenue. Bail was set at $50,000 and she was ordered not to have contact with the victim."}