{"uri": "http://www.nola.com/crime/index.ssf/2015/05/mccullum_murder_suicide_family.html", "title": "Family comforts father who lost wife and children to murder-suicide", "dct": "Fri, 15 May 2015 18:46:00 GMT", "id": "39cb6e89bcc87a923f26f91ceac300ef", "content": "As questions linger over what drove a New Orleans mother to fatally shoot her two young children before taking her own life, family members are rallying together to bolster a father suddenly faced with the loss of his wife and kids.\n\"It hurts me to see him going through this,\" an emotional Gary McCullum said Friday (May 15) of his younger brother, Gavin McCullum. \"I'm just glad that all of us can come together as a family and do the best that we can for Gavin. That's what's more important -- not being judgmental.\"\nNew Orleans police say Michelle McCullum, 25, and her two children -- 3-year-old Cylie Nicole McCullum and 5-year-old Caden Nicholas McCullum -- were last seen alive around 10 p.m. Wednesday (May 13) in the 1200 block of Treme Street.\nTen hours later -- and despite a frenzied search by neighbors and law enforcement -- a waste disposal worker made the gruesome discovery when he spotted Michelle McCullum's Nissan SUV on a remote stretch of Old Gentilly Road in eastern New Orleans. Preliminary autopsy results show Michelle McCullum sustained a single gunshot wound to the head, said Orleans Parish Coroner, Dr. Jeffrey Rouse. Cylie and Caden each suffered a single gunshot wound to the torso. A corner's office spokesman declined to provide a time of death for the mother and her children.\nGary McCullum, 32, said his brother and Michelle were high-school sweethearts who married around eight years ago. The two brothers each lived with their respective mothers and spent little time together as they journeyed into adulthood, due in part to the elder McCullum's frequent travels in his job as a DJ. They last saw each other about three years ago, at Gavin and Michelle's eastern New Orleans home. Caden was 2 at the time. The brothers talked for hours, Gary McCullum remembered, with topics ranging from a shared love of cars to their experiences as young fathers.\n\"I was actually proud of him, the fact that he actually stepped up and became a good father (and) a good husband,\" Gary McCullum said.\nThursday morning, an uncle phoned Gary McCullum to deliver the devastating news.\n\"I just broke down in tears,\" he said. \"I was just so heartbroken by the whole situation. I couldn't figure out why this was going on, because I didn't see that in any of them. As far as I could see, she was a good mother, and he was a good father -- and they were great together. They loved each other.\"\nAuthorities on Thursday said they were trying to piece together the final hours in the lives of Michelle, Caden and Cylie McCullum. NOPD Superintendent Michael Harrison said a McCullum family member called police around 12:30 a.m. to say that an armed Michelle McCullum had possible intentions of harming herself and her children. The weapon, a .40-caliber firearm belonging to Michelle McCullum, was recovered from the scene. Harrison said the gun had been in the possession of a family member, but Michelle McCullum asked for it back at some point.\nWhen the weapon was returned, and why a family member was holding it in the first place, remained a mystery to investigators. So too, was the reason why Michelle McCullum chose the intersection of Grant Street and Old Gentilly Road to end her life. The location is only 2 miles from Gavin McCullum's work place, at the NASA Michoud Assembly Facility where a neighbor said Michelle McCullum once worked.\nFamily members have drawn strength from the outpouring of community support, Gary McCullum said. But among the well-wishers are those who seek to malign Michelle McCullum, he said.\n\"I know people are saying all bad things about what she did, (but) I'm not going be a judgmental person because in my heart I knew that she was a good person,\" Gary McCullum said. \"There's multiple things that could have drove her to that point, but I'm still not going to judge her on that because she was a good mother and she was a good wife.\"\nA fund has been established to assist with funeral expenses. Those wishing to make a donation can go to any Capital One bank location and ask to donate to the McCullum special account."}