{"uri": "http://www.wsoctv.com/news/news/local/sources-police-investigating-death-anson-co-sherif/nkhf2/", "title": "Man accused in death of Anson sheriff's granddaughter appears in court", "dct": "Mon, 30 Mar 2015 04:19:00 GMT", "id": "08b9b7c9006dd24274804a02ddac7edd", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nANSON COUNTY, N.C. - An Anson County man accused in the shooting death of the sheriff's granddaughter appeared in court Tuesday morning.\nRoger Lee Rorie was assigned a court-appointed attorney.\nHis bond is set and $350,000. Rorie's next court date is April 14.\nA search warrant released Tuesday showed the call came in at 3:21 a.m. Sunday, saying a young woman was shot.\nInvestigators found Smith laying on the floor of the bathroom unresponsive with what appeared to be a gunshot wound to the head. Emergency officials took Smith to Peachland School, where she was taken by helicopter to Carolinas Medical Center.\nItems seized from the home include:\n-22 caliber-long\n-Black archangel gun\n-Clear plastic bag containing suspected marijuana\n-Water bottle with hole on side and foil on top\n-Black and white framed rose-colored glasses with suspected blood on lens\n-Two .22 caliber bullets\n-Multicolored marijuana pipe with bubble wrap\n-Another bullet\n-Two gunshot residue collection kits\nAn Anson County man has been charged in the shooting death of the sheriff's granddaughter.\nShaundasia Smith, 16, was killed Sunday morning when a rifle that discharged inside a home on Jim Hanna Lane just outside Wadesboro.\nInvestigators said Smith was at a friend’s house where a man who was also visiting somehow fired a rifle he was holding.\nThe bullet struck Smith in the head.\n\"They always slept over. It was just a God awful accident,\" said Angela McGowan, who lives in the home.\nBecause of the connection to Anson County Sheriff Landric Reid SBI investigators were called in.\nAgent Tony Underwood said there was no indication that the shooting was intentional.\n\"There's no evidence that shows there was any intent to harm the victim, but at this point the main question is how did the weapon fire,\" Underwood said.\nDetectives are still trying to answer that question, but still charged Roger Lee Rorie with involuntary manslaughter.\nRorie is also charged with obstructing the investigation by allegedly trying to hide the rifle.\nSmith was raised by Reid, who was elected sheriff for the first time in the fall of 2014.\nReid is the first African American to be elected sheriff in the county's history.\nWhen he spoke to Channel 9 in January he said he’s proud of his historic standing, but he wants to be known as the best sheriff.\nRead more trending stories on wsoctv.com:"}