{"uri": "http://www.wsaz.com/content/news/Troopers-7-year-old-accidentally-shot-and-killed-by-brother-while-playing-with-loaded-gun-385698701.html", "title": "Ky. Troopers: 7-year-old accidentally shot and killed by brother while playing with loaded gun", "dct": "Wed, 06 Jul 2016 20:29:00 GMT", "id": "d6c41ed70a1fee5f5017766ad022d091", "content": "LAWRENCE COUNTY, Ky. (WSAZ) -- A 7-year-old boy was shot and killed Sunday, July 3 while he and his brother were playing with a loaded gun.\nIt happened at a home on July Drive in Lowmansville, Ky. on the Lawrence/Johnson County line.\nAccording to Kentucky State Police, the two brothers, 7 and 8, were playing and picked up a loaded gun.\nTroopers tell WSAZ the two boys didn't know it was loaded and the 8 year-old accidentally shot 7-year-old Blake Andrew Case.\nHe was taken to the hospital where he later died from his injuries.\n\"Blake was probably the happiest little boy I've ever met,\" said Benjamin Dillon, a friend of the family. \"He always had a smile on his face. Just not seeing his little face every day is going to be, it's going to be tough.\"\nDillon tells WSAZ he would see the kids practically every day.\n\"I would probably describe them as best of friends,\" Dillon said. \"He [Blake] loved his brother so much. Wherever you seen one, you saw the other. So they were very very close.\"\nHe says Blake had an older sister, as well. Dillon says the death of the family's youngest child was a shock to the community.\n\"It just broke my heart,\" said Dillon. \"I couldn't believe it. I met the parents later on that day. They were coming up toward the house and I met 'em and told them if they needed anything, just call me.\"\nAccording to troopers, there was an adult around at the time of the shooting, however, they say no criminal charges are expected to be filed.\nTroopers say the shooting appears to have just been a \"tragic accident.\"\nDillon, a retired Marine, says he hopes sharing this story will prevent another accident.\n\"Firearm safety is really, really key, especially around kids,\" Dillon said. \"If we could keep the firearms away from where they can reach them, especially separate the firearms from the ammunition.\"\nRight now, he says the Case family is just trying to move forward. He says he wants to remind people to think about how Blake lived his life, not just the way he died. He also hopes faith will get the family through the grieving process.\n\"I'm a Christian,\" Dillon said. \"I go to church -- have all my life. I just told them that Blake was too precious to be here on this earth, that God needed him for something else, and that's how I'm trying to let the family know that his time was numbered and no matter what it was going to be, he was going to be gone. God needed him more than we did.\"\nVisitation for Blake will be from 6 p.m. until 9 p.m. Wednesday at Jones Preston Funeral Home in Paintsville. Visitation will also be held from 9 a.m. until 2 p.m. Thursday, at which time the funeral service will be held. Blake will be buried at Same Sites Cemetery in Boonscamp, Kentucky.\nBlake went to W. R. Castle Memorial Elementary School in Johnson County.\nThere is a GoFundMe account set up by the school's PTO group to help pay for funeral expenses: https://www.gofundme.com/blakecase\nKeep checking WSAZ Mobile and WSAZ.com for the latest on this story."}