{"uri": "http://www.ocregister.com/articles/smith-727993-santa-police.html", "title": "21-year-old man sought in shooting death of 16-year-old Santa Ana boy", "dct": "Tue, 06 Sep 2016 19:44:00 GMT", "id": "a3ec22d9ee15e4bf97fce9876bd34550", "content": "View slideshow\nSANTA ANA – Police are looking for a 21-year-old suspected gunman in connection with the fatal shooting of a 16-year-old boy in Santa Ana late Sunday, police said Monday.\nThe victim, whom police identified as Alex Ramirez, was at a home in the 3600 block of West Hazard Avenue at about 11:45 p.m., when he was shot once in the upper body, said Santa Ana police Cmdr. Jeffrey Smith.\nRamirez was rushed to a hospital, where he died shortly after midnight, Smith said.\nDuring the investigation, police were told it was a drive-by shooting, said Santa Ana police Cpl. Anthony Bertagna.\n“But the story we were given did not match the evidence,” he said.\nOfficers obtained a search warrant, went into the home and were able to determine that Ramirez was shot in one of the bedrooms, Bertagna said. Police believe the man they suspect of shooting Ramirez, 21-year-old Matthew Granados, was driven by his mother to another home in Santa Ana after the shooting.\n“We also located the weapon at the house,” Bertagna said. “But, we believe (Granados) has access to other weapons. So, the public should consider him armed and dangerous.”\nGranados is described as 6-foot-2 with long, black hair and brown eyes.\nPolice brought Granados’ parents and brother to the station for questioning, after which they arrested his father, 41-year-old Alexander Christopher Granados, on suspicion of being an accessory after the fact.\n“We don’t know if this incident was an accident and they were just trying to cover it up or if it was an intentional act,” Bertagna said. “At this point, they are not cooperating. We want to talk to (Granados) and find out exactly what happened.”\nHe described Granados’ home as a place where young people congregated. Ramirez knew Granados and was visiting the home when the incident occurred, Bertagna said.\nResidents who gathered near the crime scene on Monday morning said the neighborhood has had problems with gang violence. A friend of Ramirez, 17-year-old Juan Morales, said he sometimes hears gunshots in the area.\nAnyone with information about Matthew Granados’ whereabouts is urged to call the Santa Ana Police Department Homicide Unit at 714-245-8390 or Crime Stoppers at 1-855-TIP-OCCS."}