{"uri": "http://wjbf.com/2015/08/25/w-s-hornsby-elementary-k-8-school-on-lock-down-after-incident/", "title": "Parents, Family Members React To W.S. Hornsby K-8 School Student Shooting", "dct": "Tue, 25 Aug 2015 11:33:00 GMT", "id": "227fb913ce0da9f2be965b6a4841fddf", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\n***UPDATED at 5:12 P.M. on Tuesday, August 25th***\nAugusta, GA – Tuesday has been an emotional day for parents and loved ones of kids at W.S. Hornsby K-8 School.\nParents rushed to the school just a around lunch time only knowing that there was a gun at school.\nOne big sister can breathe a sigh of relief after an unexpected day for Maequoia. “Well, you need to go pick her up because they had a shooting. That’s the only way I found out,” Martika Jackson told WJBF News Channel 6.\nHer second grade sister told us she heard crying and saw people running out of classrooms. “We were taking a test. I was about to get up, but she said, ‘stay down and put your head down’, so I put my head down,” Maequoia Reeves said.\nWe found out from the Richmond County School System’s Communications director that a boy brought a gun to class against state and school policies. “A student was playing with a weapon inside his desk. The weapon discharged and grazed a student in her side,” Kaden Jacobs said.\nTasha Williams picked her child up from the middle school side of the building. “I had to rush up here to get my son out of school. When I got here, the lady told me, ‘you know it was at the elementary school?’ I said, ‘well ma’am, I’d rather be safe than sorry,” Williams said.\nWhile some parents took precautions, others remained emotional until a Richmond County Board of Education Police Department ID check guaranteed them access to their kids.\n“It’s not a comfortable feeling. It’s something we see on the news and we don’t expect it to happen so close and then, when it is close, you don’t know what to really think,” Joe’Micah Thurmond told us before he picked up his little brother. “A lot of stuff goes on around here, but one bad apple makes the whole bunch look bad. So, it’s not most of the kids. Every now and again, you get one that gets out of line and gets a little crazy. Whose ever weapon was found should have done better as to having it put up. Child should not have had access to it,” he added.\nBut inside, kids were prepared. Cheyenne Ellison was one of them. “I would have got in the cabinet and acted like I was a cleaning substance,” she told us.\nIndia Ferrell was another one of them. “It was right around the corner from my classroom” she said. “How did you feel inside?” we asked India. “I was scared. Yeah, I was scared,” Ferrell replied.\nThat fear has parents planning what should be next…\nShon Green said parents have a job to do. “Check the book bags and make sure your children aren’t taking things to school,” Green said.\n“Maybe we can get metal detectors, or something like that. That would work,” said Sonya Logan.\nThe 3rd grade girl who was grazed by the bullet is “resting comfortably at home”, according to Richmond County Schools’ superintendent, Dr. Angela Pringle. The 3rd grade boy who brought the gun to school was taken into police custody.\nAll of the other students are safe. Many went home with their parents shortly after the incident.\n***UPDATED at 12:23 P.M. on Tuesday, August 25th***\nAugusta, GA – Richmond County Board of Education Spokesperson Israel Butler has released more information concerning a Tuesday morning incident at W.S. Hornsby K-8 School that resulted in a female student being accidentally shot.\nButler tells us, officials discovered that a student brought a gun to school “against state law and district policy”, around 10:45 a.m.\nHe also said that, “while playing with the gun inside a desk, a student accidentally discharged the weapon and another student was struck”.\nParents have been notified about the incident and the student who was found to have brought the gun to school is currently in police custody.\nThe injured student was transported to a local hospital and all other students and staff are safe and secure in the building.\n***POSTED at 11:33 A.M. on Tuesday, August 25th***\nAugusta, GA – WJBF News Channel 6 is covering breaking news out of Augusta.\nWe have confirmed that W.S. K-8 School, which is located on Kentucky Avenue off of Sand Bar Ferry Road, is on lock down after a student was accidentally injured by a gun.\nA call came around 11:10 a.m. Tuesday morning from the Augusta Fire Department to the Richmond County Sheriff’s Office about an incident at the school and the Richmond County Board of Education Police Department needed assistance.\nOfficials tell us a male student had a gun in his desk and was reportedly playing with the gun when it went off and struck a female student in the side.\nThe student who brought the weapon is currently in custody. The condition of the student who was shot is not known, at this time. That student was taken to a local hospital.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nWe have learned that parents who wish to pick up their child from the school, can do so ONLY on the middle school side of the school building.\nView the Richmond County Board of Education Police Departments Gun Safety and Rules Document\nWe will continue to follow this developing story and our Renetta DuBose will have more information during WJBF News Channel 6 at Noon on Tuesday.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}