{"uri": "http://triblive.com/news/adminpage/9615056-74/borough-oliver-shot?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29#axzz3u7dTzFwM", "title": "Four shot, including 11-year-old boy, in Mt. Oliver Borough", "dct": "Fri, 11 Dec 2015 07:59:00 GMT", "id": "57e7713295a02783e32cad8d8a27cebe", "content": "Four people, including an 11-year-old boy, were shot Friday night in Mt. Oliver Borough in the area of Brownsville Road and Amanda Street.\nAllegheny County spokeswoman Amie Downs said, according to 911 dispatchers, two of the victims were in critical condition and two suffered minor injuries. The shootings occurred about 7 p.m. in a commercial area of the borough.\nPolice on the scene identified the victims as black males. Another victim was 16. Another, Denzel Harris, 31, of Knoxville, told the Trib a bullet grazed him. He was treated at the scene.\nNo arrests had been made. County homicide detectives were investigating.\nKurt Miller was working at his family's hardware store when he heard the shots nearby. They locked the doors, then saw police car lights shine through the windows.\n“It's tragic. It's sad,” he said. “But it happens everywhere.”\nThe door to the Rite Aid drugstore at the intersection of Brownsville and Amanda showed a spiderweb crack from where a bullet struck it. People milled about to watch police set up crime tape and interview witnesses.\nCindy Adams Turzak of Mt. Oliver was down the street with her husband at a beer distributorship when she heard the shots.\n“It's terrifying,” she said.\nThe amount of gunfire she hears has caused her to fear for her tiny community, where about 3,400 people live.\n“I don't feel safe,” she said.\nOn Nov. 1, an 11-year-old boy, David McIntyre, was fatally shot when a gunman walked into his home in the borough. His brother, CJ Conrad, was shot six times but survived.\nMelissa Daniels is a staff writer for Trib Total Media. She can be reached at 412-380-8511 or mdaniels@tribweb.com."}