{"uri": "http://www.wpxi.com/news/news/local/sources-4-people-including-11-year-old-shot-mount-/nphfj/", "title": "11-year-old, 2 teens among 4 shot in Mount Oliver", "dct": "Fri, 11 Dec 2015 19:53:00 GMT", "id": "81b2e46363a90804daae77aabc954e13", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nMOUNT OLIVER, Pa. - Police in western Pennsylvania say four people, including an 11-year-old boy and a 13-year-old boy, were wounded in a shooting Friday night in Mount Oliver.\nOfficials said the gunfire on Brownsville Road was reported at about 7 p.m. Friday and is believed to have been a drive-by shooting.\nThe 11-year-old boy was taken to Children's Hospital of Pittsburgh, where he was reported in critical condition. The 13-year-old was taken to UPMC Mercy in critical condition.\nA 16-year-old also taken to UPMC Mercy and a man treated at the scene were reported with minor injuries.\nPolice said the three teenagers were shot on steps near a convenience store and the adult was hit on the opposite side of the street.\nA stray bullet from the shooting also shattered the front door of a Rite Aid, where a woman was almost hit when she stepped outside the store.\nhttps://twitter.com/PamelaOsborne/status/675481076182220800\nThe woman said she was lucky she was only hit by debris from the gunshot and saw a car speeding away from the scene.\nNo arrests were immediately reported.\nThe scene of Friday’s shooting was close to Hays Avenue, where 11-year-old David McIntyre and his 16-year-old brother were shot last month.\nThe brothers were playing video games when they heard the first shots fired. David was killed.\nThe Allegheny County police said Monday that an additional $1,000 is being offered for information that leads to an arrest in the case, bringing the reward total to $2,000.\n\"This is not normal our kids being shot and killed,” the Rev. Maurice Trent of Light House Church in Mount Oliver.\nTrent has organized a town hall meeting for this Friday to discuss the uptick in violence in Mount Washington.\nTrent organized a town hall meeting for this Friday to discuss the uptick in violence in Mt. Oliver. David's family will be there as well the families of the three children who were shot Friday.\n\"We're bringing them together to form a coalition so they have a voice not only for justice for their children, but for other people's children,” he said.\nThe Associated Press contributed to this report."}