{"uri": "http://www.post-gazette.com/local/city/2015/12/11/3-shot-in-Mt-Oliver/stories/201512110325", "title": "Victims improving in Mount Oliver shootings", "dct": "Sat, 12 Dec 2015 10:48:00 GMT", "id": "bc98f2b12cbe73badcb829506b332796", "content": "Mount Oliver police say two critically injured juveniles who were among four people shot in Mount Oliver Friday evening are suspected to survive.\nA 13-year-old boy wounded when two people driving on Amanda Street near Brownsville Road opened fire improved after surgery at UPMC Mercy, Chief Matt Juzwick said this morning. An 11-year-old boy taken to Children Hospital of Pittsburgh of UPMC also improved, the chief said.\nA 16-year-old boy also is being treated at Mercy for nonlife-threatening injuries and an adult was treated at the scene. Police aren’t releasing their identities.\nChief Jozwick said police still don’t have a motive for the shootings, which occurred about 7 p.m. near a Rite Aid pharmacy.\nThe three boys were shot on a set of steps near the store, and the adult was shot on the opposite side of the street. Police found multiple shell casings at the scene.\nThe adult victim told police that the driver and front-seat passenger of a dark-colored car were shooting out of both sides of the vehicle as they headed north on Amanda.\nA woman who would identify herself only as Lauren L. said she had stepped out of the Rite Aid, where she works, to smoke a cigarette when she heard about seven gunshots. A bullet whizzed by her head and struck one of the drugstore’s glass doors, shattering part of it, and she dropped to the ground.\n“It wasn't until I watched the tape that I realized how serious it really was,” she said, referring to the store’s video surveillance system.\nKurt Miller, 25, whose family owns a hardware store near the scene, said he heard “quite a few” gunshots and locked himself inside the store.\n“Before you even realized it started, it was over,” he said. “It’s a tragedy.”\nHalley White, 19, who recently moved to the area and was walking near the crime scene, said the gunfire was “scary.”\n“This makes me want to go home and not walk around anymore,” she said. “We shouldn’t have to be scared to leave our homes and walk down a main street.”\nAllegheny County police also were investigating.\nMadasyn Czebiniak: mczebiniak@post-gazette.com or 412-263-1269."}