{"uri": "http://www.live5news.com/story/32724413/cpd-11-year-old-girl-wounded-after-shots-fired-into-crowd", "title": "Girl, 11, boy, 13, wounded in separate shootings at same complex", "dct": "Wed, 10 Aug 2016 03:51:00 GMT", "id": "d5c696e17f7d446f3ce81ba964bfcf6e", "content": "COLUMBIA, SC (WIS) -\nColumbia Police officers are investigating after an 11-year-old girl and a 13-year-old boy were struck by bullets at the same apartment complex three days apart.\nThe 11-year-old girl was hit by one bullet when somebody inside or near a vehicle fired randomly into a crowd of people on Falling Springs Road around 11 p.m. Tuesday.\nShe was taken to a local hospital to receive medical treatment. She is listed in stable condition.\n\"This is a child,\" said resident Ebonie Brazzle. \"She was just outside playing and just got hit like that.\"\nOfficers are gathering more information about the incident. Authorities blocked the road as they investigated the scene.\nColumbia Police Chief Skip Holbrook said on Wednesday a 13-year-old boy was also wounded by gunfire on Sunday night.\n\"In the same apartment complex on Falling Springs Road a few units down, we had another shooting with the same M.O.,\" Holbrook said.\nHe was struck in the neck while inside an apartment when somebody either fired from a vehicle or just outside of a vehicle. He is also in stable condition.\n\"We feel like that gunfire was random just to make a point,\" Holbrook said.\nHolbrook said they've had very little tips or assistance from the community. \"That's troubling,\" he said.\n\"We understand that reluctance or fear,\" Holbrook said. \"We're very sensitive to that. Confidentiality is very important to us. We appeal to people's hearts to do what's right for this community.\"\nBrazzle wants the shootings to stop.\n\"It's just sad,\" Brazzle said. \"You put everyone in danger that stays out here because we live so close to each other. It can go through one wall and just keep on going.\"\nBrazzle hopes people with information will come forward.\n\"They won't tell because they think they're being a snitch, but they're actually helping,\" she said. \"The more you tell, the safer you are.\"\nIf you have any information about these shootings, you are urged to contact Crimestoppers in any of the following ways: Call 1-888-CRIME SC (888-274-6372), Text TIPSC plus your tip info to CRIMES (274637), visit www.midlandscrimestoppers.com and email a tip. Your identity will be kept anonymous, and if your tip leads to an arrest, you could be eligible for a cash reward of up to $1,000.\nCopyright 2016 WIS. All rights reserved."}