{"uri": "http://triblive.com/news/allegheny/9670344-74/dead-shot-bloomfield#axzz3v4Pj1MRi", "title": "3 found shot dead after home invasion in Bloomfield apartment building", "dct": "Mon, 21 Dec 2015 07:00:00 GMT", "id": "47b89d7ae77172aa74150e1a1517c8f6", "content": "A Bloomfield home invasion turned into the deadliest shooting in Pittsburgh this year after one of the attacker's victims returned fire.\nThree people died, including a teenager and the gunman suspected of breaking in, making it the fourth multiple-victim homicide in the city in 2015 and the deadliest since at least 2014.\nAkielah Solomon, 20, and Jaimill Kenney, 16, were shot Monday when Kadeem Williams, 25, broke into the Mathilda Street apartment through a back bathroom window about midnight, police said. Williams then exchanged gunfire with a fourth, unidentified person inside the apartment.\nPolice arrived to discover Williams' body outside the apartment building and Solomon and Kenney inside the first-floor unit. Paramedics pronounced all three dead at the scene, investigators said.\nPolice did not release the identity of the other shooter, saying only that the person was unharmed.\n“At this time, we don't know anything,” said Kieshah Cain Saunders, Solomon's aunt. “We don't know the details.”\nSolomon, who went by “Keke,” lived in the apartment with her boyfriend, her aunt said. Kenney was the boyfriend's younger brother, but Saunders did not know either of them.\nSaunders, who lives in Carnegie, said Solomon's mother called her at about 1 a.m. and they rushed to the apartment. Police would not let them inside, she said.\nThe family was waiting for information beyond that it was a home invasion.\n“They haven't told us anything other than that,” Saunders said.\nSolomon was bubbly and outgoing, she recalled. She loved to sing, and after she tried out for “American Idol” years ago, she got a call-back.\n“She was full of life,” her aunt said. “She was a beautiful girl.”\nCourt records paint a picture of Williams' violent past.\nHe pleaded guilty to a gun charge in 2012. Common Pleas Judge Kevin Sasinoski sentenced him to 11½ to 23 months in prison followed by a year of probation.\nWilliams had satisfied that sentence but was charged in 2014 with simple assault and harassment. He pleaded guilty to the assault charge before Sasinoski in June in exchange for another year of probation, a no-contact order and a court-ordered batterer's intervention program.\nHis ex-girlfriend, Debra-Lyn Unthank of Penn Hills, said she had not spoken to him in at least a year. They have a 4-year-old daughter.\nThey met as students at Penn Hills High School, she said. Williams was always funny, but she knew he had gotten into trouble.\n“Things were a little tense, so we stayed away from each other,” Unthank said.\nPublic Safety spokeswoman Sonya Toler said investigators don't know Williams' motive for breaking into the apartment.\nLaura Krizner, 27, moved into the adjoining apartment building on Sunday. A few hours later, her roommate awakened her and told her about gunshots and the bodies.\nThe reality of what happened had not sunk in, and Krizner didn't know whether to worry about her safety.\n“It's just not real right now,” she said.\nElizabeth Behrman is a Trib Total Media staff writer. Reach her at lbehrman@tribweb.com or 412-320-7886. Staff writer Matthew Santoni contributed to this report."}