{"uri": "http://www.wtae.com/news/three-people-slain-at-a-bloomfield-neighborhood-apartment-building/37063914", "title": "Cops: Man killed home intruder but also brother, housemate", "dct": "Thu, 24 Dec 2015 05:38:00 GMT", "id": "9b0df0b5f4e517060915721a0e49e84c", "content": "PITTSBURGH —\nA former juvenile delinquent fatally shot an armed robber who broke into his apartment through a bathroom window and accidentally shot and killed his visiting teenage brother and his housemate while exchanging shots with the intruder, a district attorney said Wednesday.\nZappala says Meiko Devaughn Jr. was inside the apartment with his 16-year-old brother Jaimill Kenney and his girlfriend Akeilah Solomon, when Kadeem Williams broke in. Zappala said it appears that Devaughn and Williams began firing their weapons.\n\"Each person who died was hit one time. Preliminarily from the medical examiner, the slugs go back to a 40 caliber weapon,\" said Zappala.\nZappala said the 40 caliber was Devaughn's weapon.\nThe body of 25-year-old Kadeem Williams, of Homestead, was found shot behind the apartment building. Police said Williams crawled in to the apartments bathroom window, before being involved in a shootout with Devaughn Jr, then fleeing in to the backyard.\n\"The person who was found in the alley was dressed consistently with if you were going to rob or burglarize a house,\" said Zappala. \"No weapon was found on that person. There is a possibility that he was joined by another person.\"\nMeiko Devaughn has been charged with illegally possessing a firearm, drug possession and receiving stolen property.\nIt's not clear whether Devaughn will face charges for the shootings, Zappala said, because the investigation is continuing.\n\"We never had anything like this happen in our family,\" Solomon's aunt, Kieshah Cain Saunders said. \"We've seen it on TV or on the news or something, but this is very heartbreaking to us and we loved Akielah so much.\"\nThe county medical examiner determined Solomon was shot once in the head, while Kenney and Williams were shot once each in the chest. Kenney was visiting his brother.\nA Pittsburgh Action News 4 source said that police believe Williams may have been after lottery winnings, but now they believe that may have been an excuse for why more than $14,000 was found inside the home. Zappala said a small amount of marijuana was found inside as well.\n\"I just know that we have to come together and we have to pray and keep one another and pray that everything will be better in the world with these children,\" Saunders said. \"These were children.\"\nDevaughn was adjudicated delinquent, the juvenile court equivalent of a conviction, in 2009 on charges including robbery and aggravated assault. That's why it was illegal for Devaughn to possess the .40-caliber Glock pistol he used, according to a criminal complaint. The gun had been stolen from neighboring Butler County.\nZappala said investigators believe at least one other intruder may have been involved. They didn't find a gun near Williams' body outside the apartment complex but did find shells from a different caliber weapon at the scene, he said.\n\"I just don't understand what's going on or how this happened,\" Saunders said."}