{"uri": "http://pittsburgh.cbslocal.com/2015/12/21/woman-2-men-shot-and-killed-in-bloomfield-apartment/", "title": "Suspect & 2 Victims Shot, Killed In Bloomfield Home Invasion", "dct": "Mon, 21 Dec 2015 04:23:00 GMT", "id": "ae75b66fcd005e3fa6e58df81e557ae0", "content": "BLOOMFIELD (KDKA/AP)- Police say a 16-year-old male and 20-year-old woman were slain by a home invader, who was fatally shot by another person in a Bloomfield apartment.\nAround midnight, officers were called to an apartment building in the 200-block of Mathilda Street.\nWhen officers arrived, they found a man and a woman inside a first floor apartment. They were both pronounced dead at the scene from gunshot wounds.\n“Upon further investigation, officers found a third victim who was in the backyard of the house here,” said Pittsburgh Police spokeswoman Sonya Toler.\nThe Allegheny County medical examiner says the victims inside the apartment are Jaimill Kenney, a teen visitor from Pittsburgh who attends Pittsburgh Milliones School, and the woman, 20-year-old Akeilah Solomon, who lived in the apartment.\nThe body of 25-year-old Kadeem Williams, of Homestead, was found shot behind the apartment building.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nPittsburgh police believe Williams entered the apartment through a bathroom window and exchanged gunfire with an uninjured victim inside the apartment. Police haven’t released that person’s name or said whether they will be charged.\n“At this stage of the investigation, we believe the uninjured victim is one of the people who were shooting inside the residence,” said Toler.\n“We heard that it was a home invasion. Other than that, we haven’t got any information. We’re just waiting for the police to do their investigation,” Kieshah Cain Saunders, Solomon’s cousin, said.\nNeighbors reported smelling drugs and seeing lots of people in and out of the apartment in recent weeks.\n(TM and © Copyright 2015 CBS Radio Inc. and its relevant subsidiaries. CBS RADIO and EYE Logo TM and Copyright 2015 CBS Broadcasting Inc. Used under license. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report.)"}