{"uri": "http://www.tulsaworld.com/news/crimewatch/charges-filed-in-double-shooting-that-left-one-tulsa-teen/article_dd364f4d-331e-5975-9b0a-622e6e23fe74.html", "title": "Charges filed in double shooting that left one Tulsa teen dead, another critically injured", "dct": "Fri, 29 Jul 2016 00:00:00 GMT", "id": "c9c1b967be582c249ba984c87cf87c53", "content": "Related story: Police identify 17-year-old killed in double shooting; girl, 16, remains in critical condition\nA parolee with an extensive criminal history has been charged in a double shooting that killed a teenager and wounded another in north Tulsa last month.\nMarcus DeWayne Boyd, 27, was charged Wednesday in Tulsa County District Court with first-degree murder, two counts of shooting with intent to kill and possession of a firearm after a felony conviction. A warrant also was issued for his arrest.\nInvestigators believe Boyd opened fire on an SUV with five occupants at Virgin Street and Madison Avenue about 10 p.m. June 28. Daniel Carter, a 17-year-old who was in the passenger’s seat of the vehicle, died from a gunshot wound to the chest.\nA 16-year-old girl in the back seat was shot multiple times and fled to a nearby house. A person drove her to the hospital, where she was admitted in critical condition but has since recovered.\nThe SUV’s 21-year-old driver accelerated when the shots were fired and crashed into a no-parking sign. He was not injured. Neither were two other people in the back seat.\nPolice initially said the shooting may have been the result of road rage. The driver of the SUV honked at a vehicle that had been stopped at the intersection. Two men exited that vehicle, and at least one opened fire.\nHowever, homicide Sgt. Dave Walker has ruled out road rage as a factor, saying Thursday that the motive stemmed from a connection between Boyd and the victims.\n“I think that Boyd saw who was getting in that car, had a problem with some of those people in that car and waited for them to show up at that intersection,” Walker said. “That’s speculation, unless Mr. Boyd wants to come down and talk about it.”\nWalker said there were several witnesses to the shooting, but detectives at first struggled with getting anyone to come forward with information. Some eventually identified Boyd as the shooter.\nPolice have multiple leads on the identity of the second suspect, and Walker said he is confident he will be charged soon.\nState records show Boyd is on probation for unlawful possession of a controlled drug and possession of a firearm after a felony conviction. He was released from prison in early 2015.\nThe gun conviction is related to Tulsa’s first homicide of 2013, in which 31-year-old Ronnie Stanley was shot and killed over an apparent money dispute. Later that day, police pulled over a stolen minivan used in the slaying and took its seven occupants into custody. Boyd was never accused in the slaying, but he was charged with possessing a firearm when officers found a gun by his feet during the traffic stop.\nAnyone with information about Boyd’s whereabouts may contact Crime Stoppers by phone at 918-596-COPS (2677), online at p3tips.com/918 or through the Tulsa Tips app, which can be downloaded from the Google Play or iTunes stores."}