{"uri": "http://www.orlandosentinel.com/news/breaking-news/os-gun-deaths-orange-county-pulse-list-20160627-story.html#nt=oft03a-1gp3", "title": "64 homicide victims in Orange County", "dct": "Mon, 27 Jun 2016 21:02:00 GMT", "id": "27735200cdcf4e0842764e51fa347cd9", "content": "Yonel Meus, 36; shot Jan. 1 by a stranger \"looking for someone to fight,\" according to police.\nNorris Daquan Adams, 17; shot Jan. 3 during a fight in Ocoee.\nDarrin Verrett, 31; shot Jan. 7 in Pine Hills.\nEssex Taylor III, 43; found dead Jan. 13 behind an Orlando nightclub.\nMichael Joshua Degracia, 24; alleged burglary suspect is stabbed Jan. 15.\nCorneilus Anderson, 29; shot Jan. 19 in a home in southwest Orange County.\nMarvin Lee Windom, 34; shot multiple times Jan. 23 in front of his Winter Garden home.\nGabriel Junior Garcia Nazario, 28; a motorcycle club member shot on Semoran Boulevard Jan. 23.\nKadian Hall, 29; shot by boyfriend in murder-suicide Jan. 30.\nJacob Almond, 19; shot in the chest Feb. 2.\nAndrew Garland, 20, and Samuel Destin, 19; both shot by an alleged marijuana buyer outside Florida Mall Feb. 5.\nJoseph Lugo Villalobos, 22, and Jonathan Avila Rojas, 33; shot at Glitz nightclub Feb. 7.\nChristian Jones,16, and Anotnio Jones, 34; brothers killed on their way to a Super Bowl party Feb. 7.\nLavardo Fisher, 13; accidentally shot by a cousin riding a hoverboard Feb. 8.\nJulian Gresham, 81; stabbed by his daughter's boyfriend in Taft Feb. 13.\nMaria Sanchez, 36, and Destiny Banuelos, 16; mother and daughter were found dead in their home Feb. 15.\nFrank Freeman, 46, and Jordan Ingram, 24; shot during what police called a domestic dispute Feb. 17.\nCarlton Wilson, 22; shot in an apartment complex near Lake Orlando March 3.\nDaniel Lozada Medina, 44; found dead in a home on Winding Trail March 4.\nDelvon Harris, 40; shot in a Parramore community center parking lot March 7.\nSean Ware, 34; shot by his girlfriend in south Apopka March 11.\nLatony Jones, 33; shot in the Silver Hills community March 12.\nAntwan Davis, 15; shot in the head near Ocoee March 12.\nJesse Williams, 26; shot by neighbor in the Chowder Bay apartment complex March 16.\nJoshua Bell, 31; shot in the Palm Grove Garden Apartments March 19.\nDestiny Bargman, 15; shot by a boyfriend who was \"messing around with\" a gun March 19.\nCarlos Enrique Cruz, 35; motorcycle club prospect shot trying to break up a fight March 20.\nContondre Bryant, 18; shot on Old Apopka Road March 21.\nJean Loiseau, 50; shot after an altercation near Americana Plaza March 25.\nJasmine McAfee, 24; shot by a suspect in solicitation of prostitution case March 26.\nGladys Rosario, 39; shot in a possible murder-suicide March 27.\nMoses Baptiste, 34; shot during an argument on Orange Blossom Trail March 28.\nMonty Clark, 50; stabbed at the Stone Mill Run Apartments April 4.\nEthel Shannon McCarson, 42; found dead and dismembered in the woods near Old Winter Garden Road April 6.\nJohn Henry Stubbs, 69; killed by an ax-wielding acquaintance after an argument over money April 8.\nPedro Alexander Idelfonso, 25; shot near the pool in Silver Pines Apartments April 10.\nAlex Donte Barclay, 20; shot near a Lee Avenue home April 11.\nDevin Moore, 19; died after a fight April 15.\nGino Nicolas, 24, and Tanya Monique Skeen, 46; non-profit worker and her mother shot in a drive-by April 16.\nEdgar Grant, 24; shot in a convenience store parking lot April 17.\nBrian Mortensen, 32; construction worker putting up fence was hit by a stray bullet, died April 19.\nDelvin Jamar Broner, 36; shot at a gas station on John Young Parkway April 25.\nTrevius Roberts, 23; shot in front of a Winter Park apartment April 25.\nMary Anne Zosel, 63; found dead in an Ocoee home following a burglary April 30.\nJoe Haywood, 33; stabbed during a fight on South Street May 9.\nPatricia Spencer, 37; beaten with a stick on Parramore Avenue, died May 13.\nBill Boney Jr., 28; shot in a subdivision near West Colonial Drive and Apopka-Vineland Road May 14.\nMary Barreda, 45; shot in a driveway May 27.\nHenry Donaldson, 31; shot in a parking lot on Barwood Drive May 29.\nLinda L. Jones, 67; stabbed in her home during a burglary May 30.\nKristian McCauley, 19; shot in Lockhart May 30.\nKatie Reid, 62; shot June 6 by her husband, who was cleaning his gun.\nChristina Grimmie, 22; singer and former \"The Voice\" contestant shot by a fan after a concert at The Plaza Live June 10.\nTeryus Garmon, 16, and Lee Nelson, 18; shot in a driveway on Fontainebleau Drive June 16.\nWilfredo Maldonado-Roman, 24; shot outside Tu Casa Boriqua Sports Bar on Lake Underhill Drive June 18.\nDonta Thomas, 21; found dead in a Radleigh Place home June 19.\nKim Kethat Brown, 52; died June 19 after being shot at a West Colonial Drive hotel.\nSource: Sentinel research.\nNote: Through June 26. Does not include 49 victims of Pulse nightclub shootings"}