{"uri": "http://www.nola.com/crime/index.ssf/2016/11/man_opened_fire_on_car_carryin.html#incart_river_index", "title": "Man opens fire on car carrying his newborn, wounds 17-year-old: NOPD", "dct": "Thu, 17 Nov 2016 16:20:16 GMT", "id": "ada6ce71c6a2692b3715e799b38a4bf3", "content": "(Orleans Parish Sheriff's Office)\nA 30-year-old man was arrested Wednesday (Nov. 16) after New Orleans police said he opened fire on a car carrying his 2-month-old child, the child's mother and two other people - including a teenage girl who was wounded in the stomach.\nJames Tate and the mother of his child were arguing shortly before 3 p.m. Wednesday in the 5600 block of Pauline Street, police said in a preliminary report. The mother got in a car with the child, the 17-year-old girl and another person: a female of unknown age.\nTate tried to pull the newborn's mother out of the car, police said. When she attempted to drive away, he fired into the car, striking the 17-year-old. The car's driver sped off to University Medical Center, where the teen was treated for a gunshot wound to the stomach and a graze wound, police said.\nResponding officers spoke to a witness, who reported hearing an argument and a gunshot in the block, court records show. An officer spotted Tate standing in a carport doorway in the block. As the officer approached, records state, he heard an object drop to the ground.\nTate \"appeared nervous and erratic and was not making any sense,\" the arresting officer wrote in a police report. The officer saw blood on Tate's left pant leg, which Tate said was the result of a stab wound he suffered during a fight. The officer took Tate into custody. In the carport doorway, the report states, the officer found a bag containing two handguns: a .40-caliber Glock with one spent casing in the chamber and a .45-caliber Colt with one live round in the chamber and six rounds in the magazine.\nPolice drove to University Medical Center, but were unable to speak with the victim, who was heavily sedated at the time of their arrival. Detectives spoke with the car's driver, according to the arrest report. She told police her friend called her and asked for a ride from her boyfriend's house because they were arguing and she didn't feel safe.\nThe driver said she and the teenager pulled into the driveway of Tate's home and started loading Tate's girlfriend's belongings, and their baby, into the car, the arrest report states. Tate came out of the house and \"began screaming and yelling at them,\" the report states. He then tried to grab his girlfriend and pull her out the car's front passenger-side window. The driver told detectives she heard a gunshot during the struggle, the report states and realized the teenager, who had been sitting in the back passenger-side seat, had been shot.\nTate was booked early Thursday morning with aggravated battery, domestic abuse aggravated assault, possession of a firearm by a felon, and two counts of aggravated assault with a firearm, court records show. Bond information was not immediately available.\nOrleans Parish court records show Tate was sentenced to 15 years in prison in 2006 following a guilty plea on charges of manslaughter and conspiracy to commit second-degree murder. He was one of nine people charged in connection with a 2003 fatal shooting of a 15-year-old boy inside John McDonogh Senior High School gym.\nThis story has been updated with additional court information.\nStaff writer Emily Lane contributed.\nInitial reports show the woman suffered a gunshot wound to the stomach and was taken to the hospital by private vehicle, the NOPD said."}