{"uri": "http://abc11.com/news/correctional-officers-daughter-accidentally-shoots-kills-son/1701111/", "title": "1-year-old son of correctional officer killed after sister accidentally shoots him with handgun", "dct": "Fri, 13 Jan 2017 00:00:00 GMT", "id": "91df5043f696e6b57fe26a8da2632ddb", "content": "CHOWCHILLA, Calif. --\nHeartbreak quickly spread through the small town of Chowchilla, California, as parents learned about a deadly shooting involving two siblings on opposite sides of the gun.\n\"I feel really bad for the family, for their loss, and for the child, not understanding, not knowing,\" said Kathy Scott, neighbor.\nThe call for help came in around 5:00 p.m. Wednesday. Inside the bedroom, officers found a 1-year-old boy with a bullet wound to his head. His sister had accidentally shot him with a parent's gun.\nOfficers said the mother, Erica Bautisa, was home at the time. She is a 16-year veteran of the California Department of Corrections and Rehabilitation.\nParamedics transported the toddler to Valley's Children's Hospital but he didn't make it there alive.\n\"Well anytime a child gets a hold of firearm, and there's some sort of a negligent discharge, it's a criminal matter,\" said Lt. Jeff Palmer, Chowchilla Police Department\nDetectives said the handgun was registered to her and was not a duty weapon, and they suspect it was stored improperly.\n\"Firearms are not something to be taken for granted, don't leave them loaded, and absolutely don't leave them in an area a child can get its hands on it,\" said Palmer.\nScott lives around the corner and while she said her heart breaks for the family the question still remains about why the gun was loaded and in reach.\n\"Keep it locked up, like the way they tell you when you buy it.\"\nWhile this loss has parents holding onto their children tight into the evening, officers said it is more important to keep an even tighter eye on your guns.\nOfficers also met with the District Attorney's Office earlier on Thursday. It will be up to the DA to file any possible charges.\nThe police department said they do provide free gun locks."}