{"uri": "http://wdtn.com/2016/12/22/alleged-shooter-and-his-neighbor-face-more-charges-in-shooting-of-11-year-old/", "title": "Alleged shooter, and his neighbor, face more charges in shooting of 11-year-old", "dct": "Thu, 22 Dec 2016 16:04:00 GMT", "id": "df9142da154992e947c85f641ff96664", "content": "PIQUA, Ohio (WDTN) – The man accused of shooting an 11-year-old boy in the head last week now faces more charges.\nTwenty-one-year-old Levi Harrison, of Piqua, was previously charged with second-degree felonious assault and is now facing an additional three counts of third-degree felony theft and one count of third-degree felony tampering with evidence this week.\nInvestigators tell our partners at the Piqua Daily Call that Harrison allegedly stole three guns, one of which was used to the shoot the boy.\n“The morning after the shooting, a subject from Sherman Street here in town reported three firearms stolen from his house,” Police Chief Bruce Jamison of the Piqua Police Department said to the Piqua Daily Call. We have also charged the neighbor across the street, where we found a couple of the guns the night of the shooting,” Jamison said.\n“We have also charged the neighbor across the street, where we found a couple of the guns the night of the shooting,” Jamison said.\nChad D. Miller II, 23, of Piqua, has been charged with third-degree felony tampering with evidence and fifth-degree felony receiving stolen property. Miller reportedly hid the weapons after the shooting took place, according to the Piqua Daily Call. Miller is currently being held at the Miami County Jail on $5,000 bond.\n“We just recovered the final gun yesterday,” Jamison said.\nPolice recovered a black Raven .25 handgun and an EAA Windicator .357 revolver the night of the shooting. The missing weapon was a chrome Raven MP .25 pistol, which was recovered in Sidney. Harrison reportedly sold the stolen weapon to an unknowing buyer, according to the Piqua Daily Call.\n“The person who had purchased that, without knowledge that it had been stolen, had since gone away to the military, so we got some assistance from NCIS and were eventually able to locate that weapon up in Sidney,” Jamison said.\nPolice believe that the victim was shot with the stolen revolver. The shooting victim originally attempted to claim his injuries were from a bicycle accident, according to Jamison. At Dayton’s Children Hospital, it was determined that the injury was not consistent with a bicycle accident and that the victim had been shot in the head.\nDuring the Piqua Police Department’s investigation, they found that the victim had been shot at a residence around 4:30 p.m. on Dec. 15 in the 500 block of Gordon Street. The victim was able to pedal his bike home after the incident.\nHarrison is currently being held at the Miami County Jail on a $30,000 bond.\nPolice believe there was no malicious intent in the shooting, as the shooting was the result of reckless handling of the stolen firearm, according to the Piqua Daily Call.\nThe victim, who was listed in fair condition at Dayton Children’s Hospital last week, has since been released.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}