{"uri": "http://wsbt.com/news/local/elkhart-police-teen-was-trying-to-protect-home-accidentally-shot-himself-and-sister", "title": "Elkhart police: Teen was trying to protect home, accidentally shot himself and sister", "dct": "NODATE", "id": "7f913394fff3248af835c49cfb71c100", "content": "ELKHART —\nElkhart police said it appears a 14-year-old boy accidentally shot himself and his 6-year-old sister after getting spooked by loud banging and yelling at the front door.\nThis happened at a home in the 300 block of East Carlton Avenue around 7:45 p.m. Monday. The boy and his sister were taken to Elkhart General Hospital with injuries that do not appear to be life threatening. The boyfriend of the children's mother told WSBT that the girl was taken to a Fort Wayne hospital to make sure there was no damage to her artery.\nAfter an investigation, police said it looks like the boy was holding the gun when his sister grabbed him around the waist and startled him, making him pull the trigger. He was grazed in the leg and his sister was also hit in her leg.\nPolice said the kids ran to a neighbor's house for help. Others in the area said that neighbor was a retired military veteran who was able to apply pressure to the wounds until more help arrived.\nSgt. Chris Snyder with the Elkhart Police Department said even though the children did the right thing in an emergency, the whole situation could have been avoided with proper gun storage.\n\"It's certainly important when you have kids in your house, make sure they're locked up, they're put up out of reach. There's a lot of different gun locks out there, there's a lot of different gun lockers out there. Just make sure that you're using one of them so that we don't have a tragedy like this happen again,\" said Snyder.\nThe gun belonged to the kids' mother, said police. Snyder said the police department hasn't decided whether to file charges.\n\"There could be neglect, recklessness, different things like that. But... it's way to early to speculate if any type of charges would be filed on anybody. It's something that they're going to have to talk with the children that were there, talk with the parents. Obviously we want to work with them to make sure that something like this doesn't happen again,\" Snyder said.\nThe following release was issued Monday night by the Elkhart Police Department:\nAt this point in the investigation it appears three children a fourteen (14) year old male, a nine (9) year old male and six (6) year old female were at home when there was loud banging and somebody yelling at the front door. This frightened the kids and the 14 year old male got a handgun from inside the residence to protect his brother, sister and himself. The 14 year old male was handling the handgun when his 6 year old sister grabbed him around the waist which startled him. When he was startled he accidently fired the handgun. When the handgun went off the bullet grazed the 14 year old male in the leg and struck his 6 year old sister in the upper leg. The juveniles ran to a neighbor’s house to call for help.\nThe 14 year old male and the 6 year old female were both transported by ambulance to Elkhart General Hospital for treatment. At this time neither gunshot injury appear to be life threatening.\nThe handgun, which belonged to the children’s mother, was recovered at the scene.\nThe case remains under investigation."}