{"uri": "http://www.orlandosentinel.com/news/breaking-news/os-luis-cruz-nazario-emanuel-castro-vazquez-dead-20160901-story.html", "title": "Man killed in Belle Isle was a suspect in fatal club shooting", "dct": "Thu, 01 Sep 2016 13:33:00 GMT", "id": "7d596ac10aa10f0b5ddcd280dea6e2cb", "content": "One of the two men shot and killed in Belle Isle Wednesday morning was a suspect in a fatal Orlando club shooting in February.\nLuis Cruz-Nazario, who would have turned 22 on Thursday, faced a second-degree murder charge in the deaths of two men at the Glitz Ultra Lounge Feb. 7. Emanuel Castro-Vazquez, 24, was not charged in the club shooting.\nA Belle Isle police officer found the two men dead in a parked car off Hansel Avenue just before 5 a.m. Wednesday.\nBoth were shot multiple times, police said. Investigators believe they were shot in the street near Oak Ridge Road, got in a car and tried to drive to get help.\nThey were found in a parking lot near Cornerstone Charter Academy, just north of Fairlane Avenue.\nDeputy Rose Silva of the Orange County Sheriff's Office, which is investigating Wednesday's homicide with Belle Isle police, could not confirm whether the Belle Isle shooting had anything to do with the Glitz killings. Detectives are still investigating, she said.\nJoseph Villalobos, 22, and Jonathan Avila Rojas, 33, were killed in February at the Universal Boulevard club. Ten others were injured.\nCruz-Nazario was arrested in February on a host of charges, including attempted murder and illegally carrying a concealed weapon.\nProsecutors decided not to pursue to charges on June 10, according to court records. On June 11, Orlando police found probable cause to arrest Cruz-Nazario and three others on two counts of second-degree murder. Cruz-Nazario was still in jail at the time.\nIn August, Cruz-Nazario's attorney filed a motion to release him on his own recognizance. Kendell Ali argued that there was no reason for the February and June arrests to be treated as separate cases requiring separate arrest warrants, since both stemmed from the same incident.\nA judge agreed to release Cruz-Nazario. He left the jail Aug. 16.\nTwo of the four people arrested on murder charges in the Glitz shooting remain in custody: Christian Castro-Cotto, 26, and Carlos Perez De Armas, 21. Jose Angel Hernandez, 31, was released on bond Aug. 22.\nAnyone with more information about the case can call Crimeline at 1-800-423-8477.\nglotan@orlandosentinel.com or 407-420-5774"}