{"uri": "http://www.nbcwashington.com/news/local/Four-Reportedly-Shot-in-Northeast-DC-230848981.html", "title": "Arrest Made in Northeast D.C. Quadruple Shooting", "dct": "NODATE", "id": "cea6c424943caf06926eaf30e0de06c4", "content": "An argument preceded a shooting that injured four Wednesday afternoon in northeast D.C., according to court documents.\nA man shot in the finger and a woman shot in the leg told police they saw the shooter, another victim and another man in an argument about 15 minutes before the shooting. The man shot in the finger said he heard the other victim threaten the shooter, saying he would \"make sure you'll never walk again.\" The shooter left the scene but returned with a gun and opened fire, the victim said.\nInvestigators say 51-year-old Victor Leon Coley returned to the apartment building at 3536 Clay Place NE after the shooting. He has been charged with four counts of assault with intent to kill and is being held without bond until his next hearing Nov. 15.\nThe shooting was reported just after 1 p.m. in the 3900 block of Minnesota Avenue NE. Police say a crowd of people was standing near a bus stop in the area when the gunfire began.\n\"I heard about four to six gunshots,\" a woman who was in the area at the time told News4. \"That corner is always busy, so when you see people moving, you know something's happening. I'm disgusted and tired of it.\"\nThe man who was shot in the finger spoke with News4's Shomari Stone after he was released from the hospital.\n\"I was getting ready to go to Safeway to get some groceries,\" the man said. \"After I [saw] one gentleman get shot two times, another one got shot. I feel scared. That's the neighborhood I was raised in.\"\nA woman in her 60s was shot in the leg while on her way to McDonald's. She spoke with Stone from her hospital bed Wednesday.\n\"There was a lot of people that got shot,\" she said. \"I was like shaking all the time.\"\nThe woman said one of her friends, who was involved in the argument with the shooter, was shot a couple times in the back. He and another victim, who was shot in the back of the head and the chest and could not be interviewed by police, are hospitalized in serious but stable condition.\nOfficials say Coley was taken in for questioning, and officers found weapons at the apartment, which is located right behind Payless ShoeSource.\nD.C. Police Chief Cathy Lanier said it's unusual for a shooting to occur in daylight on Minnesota Avenue.\n\"That doesn't happen here anymore. It's been years since we've had situations like this in broad daylight with all the people out here,\" Lanier said.\nThe nature of the argument remains unknown.\nStay with NBCWashington.com and News4 for more."}