{"uri": "http://www.dnj.com/story/news/2016/05/02/shooting-victims-identified/83822272/", "title": "3 of 5 victims in party shooting are MTSU students", "dct": "Mon, 02 May 2016 00:00:00 GMT", "id": "4c31b7edbd81d6204cebd2c031cf2255", "content": "HELEN COMER/DNJ\nMURFREESBORO — One of the victims in Sunday's shooting at Aspen Heights Apartments was hit when he heard the commotion and stepped outside his apartment\nSaqer Saeed Alzahrani, 26, heard the fight break out at the nearby party at about 1 a.m. and went to see what was going on, according to police reports provided to The Daily News Journal. Alzahrani was one of five people injured after a fight broke out at the party and people began shooting.\n“He had been shot in the lower left arm and left side,” reported Murfreesboro Officer Jessica Hawkins, who was dispatched to the scene at 12:52 a.m.\nHawkins applied pressure to the victim’s wounds until Murfreesboro Fire and Rescue took over emergency care.\n“He was transported to St. Thomas Rutherford, where he was stabilized and then taken to Vanderbilt,\" Hawkins said.\nAnother victim was identified by police as Antavius Burns, 24.\nA third victim may have left in a white Dodge Charger, according to Officer Randall Gaines.\nGaines made contact with that vehicle and the victim, identified as Dynasty Freeman, 20, on East Main Street near Ragland Drive.\n“Ms. Freeman was transported to the ER,” Gaines said.\nAll three of those injured are Middle Tennessee State University students, according to MTSU spokesman Jimmy Hart.\nA fourth victim was Tedarrian Deshawn Tipton, according to Murfreesboro police spokesman Sgt. Kyle Evans, and the fifth victim was Arthur Bess II.\nOther than Alzahrani, all of the victims were treated at Saint Thomas Rutherford and have since been released, according to Nick Paranjape, manager of Media Relations & Brand Journalism for Saint Thomas Health Nashville.\nOn Sunday morning, Trina Taylor, a neighbor on Old Castle Drive in Aspen Heights, said the house with the party had been crowded, and many of the people she saw running from it seemed to be college students.\n“It’s the end of the semester, a lot of them were through with finals,” she said.\nNo arrests have been made and Murfreesboro police are continuing to investigate the shootings. Anyone with information should call Crime Stoppers at 615-893-STOP (7867)."}