{"uri": "http://fox6now.com/2014/06/27/teen-altercation-leads-to-shoot-out-three-of-five-people-injured-released-from-hospital/", "title": "Teen altercation leads to shoot out, three of five people injured released from hospital", "dct": "Fri, 27 Jun 2014 15:51:00 GMT", "id": "df23cf105c0793357171870aeaeba527", "content": "MILWAUKEE (WITI) -- Three of the five people shot on Milwaukee's northside are out of the hospital. A feud between two families ended in a spray of bullets.\nThe mother of those teens tells FOX6 they were attacked not only with fists, but later everyone with weapons as well. After the fight she says adult men got involved in the situation and shot up her home. Family members were struck and hospitalized.\nNancy Mays is frightened for her family to say in their home near 24th and Locust.\n\"I`m scared I don`t even want go to the store I`m just scared they are going to shoot me,\" said Mays. \"I heard the bullets ricocheting, came out of nowhere and just got to shooting.\"\nAs shots echoed throughout the neighborhood, Mays' home was riddled with bullets.\n\"They came in front of my house out here and I got plenty bullet holes in my house, all in my kitchen,\" said Mays.\nShe claims gunfire rang out after a dispute that should have been left among teens.\n\"My daughters ain`t nothing but 13 and 16 years old some grown girls jumped my daughter,\" said Mays.\nShe says after the altercation, a few men joined the fray and the argument escalated.\n\"So my cousin and my brother got to beating the dudes up and the dudes came from nowhere and got to shooting,\" said Mays.\n\"Someone from one of the houses approached residents of the other house armed with firearms and commenced firing,\" said Milwaukee Police Chief Ed Flynn.\nWhen the gunfire stopped, police counted almost three dozen shell casings. Five people were struck.\n\"Shot my cousin, shot my brother 5 times, shot my cousin 4 times and my other cousin got shot it he leg. The police saved her life I`m glad,\" said Mays.\nSince the violent incident Thursday afternoon, June 26th, folks nearby are understandably on edge and thankful to see extra police patrolling Friday, June 27th.\nAuthorities continue to watch a block torn apart by senseless actions, while neighbors feel it all could have been prevented.\nThree of the five people shot have been released from the hospital. Two victims, one male and the other female, remain in the hospital. As of now, no arrests have been made."}