{"uri": "http://www.theleafchronicle.com/story/news/crime/2015/10/06/police-still-searching-shooting-suspect/73439442/?from=global&sessionKey=&autologin=", "title": "Victims ID'd in Clarksville toddler shooting, suspect sought", "dct": "Tue, 06 Oct 2015 00:00:00 GMT", "id": "b5a05983e78ae38725e4eecb1d97797c", "content": "This story was updated at 11:45 a.m.\nCLARKSVILLE, Tenn. — Police are still searching for a suspect in a shooting that left a 2-year-old dead and put one adult male in the hospital Sunday.\nClarksville Police had no update on the progress of the search Tuesday, according to CPD spokeswoman Officer Natalie Hall.\nOfficers responded to a report of shots fired at 935 Princeton Dr. at 11:10 p.m. Sunday. After arriving at the scene, police used a K-9 unit to track the suspect, but were unable to locate the man, Hall confirmed Tuesday.\nLate Tuesday morning, CPD released the names of the two victims as 2-year-old Joseph Bankston and Brandon Jimenez, 22, both of Clarksville. The release from CPD said Jimenez is in critical but stable condition at Vanderbilt Medical Center.\nThe suspect was described as a black man who wore a long black coat with a hood and a gray checkered shirt. He was last seen driving a maroon or red Chevrolet Impala LS. According to a news release, witnesses said the car might have a \"loud engine\" and tinted windows.\nA motive for the shooting has not been released. There were others in the home at the time, according to Hall, but police have not said who they were or how many.\nAnyone with information about the case or the whereabouts of the suspect is asked to call Det. Tim Anderson at 931-648-0656, ext. 5132, or the CrimeStoppers TIPS Hotline at 931-645-TIPS (8477).\nAn account has been set up online to assist the family of Joseph Bankston with expenses.The page can also be found at gofundme.com/2c55nvy8.\nThis is a developing story and will be updated when more information is available.\nReach Ray Howze at 931-245-0750 or on Twitter @rayhowze_leaf."}