{"uri": "http://www.post-gazette.com/local/east/2016/03/18/Allegheny-County-District-Attorney-Stephen-A-Zappala-Jr-confident-that-Wilkinsburg-shooters-have-been-identified/stories/201603180231", "title": "Spokesman for DA confident that Wilkinsburg shooters have been identified", "dct": "Fri, 18 Mar 2016 18:50:00 GMT", "id": "41cb5b6dc230dee95413ee3e410a07d3", "content": "A spokesman for Allegheny County's top law enforcement official is confident that investigators have identified the suspects who opened fire on a backyard cookout in Wilkinsburg last week, killing six people, including an unborn child.\n\"The task force is making good progress, and we are cautiously optimistic that we have identified people believed to be suspects,\" said Mike Manko, spokesman for District Attorney Stephen A. Zappala Jr. \"However, there is more work to be done, and we do not expect any arrests to be imminent.\"\nKilled in the shootings were siblings Jerry Michael Shelton, 35, Brittany Powell, 27, and Chanetta Powell, 25, and their cousins Tina Shelton, 37, and Shada Mahone, 26. Chanetta Powell was eight months pregnant.\nInvestigators said that on the night of March 9, just before 11 p.m., two shooters staked out the backyard at 1304 Franklin Ave. - one armed with a .40-caliber handgun and the other with an assault-style rifle - and gunned down the victims from different angles.\nIn addition to the six killed, three others were injured in the shootings. Two remain hospitalized in critical condition.\nOn Thursday, Allegheny County police issued a press release that said the investigation is ongoing, and that \"the homicide unit is working with city, state, and federal agencies in those efforts.\"\nThe Bureau of Alcohol, Tobacco, Firearms and Explosives, which is assisting in the investigation, is offering a $20,000 reward for information leading to the arrest and conviction of those involved. Anyone with information is encouraged to call 1-800-283-4867.\nTina Shelton's funeral will be Saturday at 11 a.m. at the Mulberry Community Church in Wilkinsburg, and a joint service for Jerry Michael Shelton, Brittany Powell, and Chanetta Powell will be at 11 a.m. Tuesday at the Lighthouse Cathedral in St. Clair. A funeral for Shada Mahone was held Monday at Unity Baptist Church in Braddock."}