{"uri": "http://triblive.com/news/adminpage/10662266-74/shelton-case-wilkinsburg", "title": "Potential release delayed for 2 men called suspects in Wilkinsburg massacre", "dct": "Mon, 20 Jun 2016 01:36:00 GMT", "id": "769d544dbbc170c4b14bdc910b77c3b2", "content": "Allegheny County Common Pleas President Judge Jeffrey Manning postponed the potential release of the two suspects in the Wilkinsburg massacre until next week, saying a trial court should determine whether police made any effort to investigate an unrelated 2013 drug case that has kept them in jail.\nThough they have never been charged with the murders of five adults and an unborn child at a March 9 backyard barbecue, Cheron Lamont “C-Wiz” Shelton, 29, and Robert James “Milhouse” Thomas, 27, have been held without bail in solitary confinement at the Allegheny County Jail for the past two months for the drug case.\nIn the wake of the Wilkinsburg killings, Allegheny County Police charged Shelton's sister, Ashley Michelle Smith, 29, and 28-year-old Justin Lamar Gomez — their cousin — for their purported roles in a conspiracy to distribute heroin laced with muscle relaxant out of a Wilkinsburg apartment. The operation was protected from rival dope peddlers with an arsenal of stolen firearms.\nCasey P. Mullen, who represents Gomez, and Casey White, Shelton's lawyer, had asked Manning to rule now on whether the 2013 case should be dismissed. They contend that the stale 2013 drug dealing and stolen weapons charges are designed merely to keep Shelton and Thomas in jail and pressure them into admitting responsibility for the killings of five people and an unborn child in the Wilkinsburg massacre.\nThe Pennsylvania Supreme Court has ruled that police and prosecutors must show “due diligence” in investigating and bringing a case to trial within a year.\nAssistant District Attorney Kevin Chernosky said determining whether investigators were diligent enough in bringing the 2013 charges should be decided by a trial judge. Manning agreed.\nHe ordered the defense motions to be heard by whichever trial judge gets assigned the case at their June 27 morning arraignment.\n“It's frustrating because my client remains in the hole of the Allegheny County Jail for another week,” said White, who had served as an assistant district attorney for six years before becoming a defense lawyer. “This is unique. I've never seen anything like this.\n“The police did nothing on this case for three-plus years, and my client went on with his life. Then he's dragged back into court.”\nMullen told the Tribune-Review that he understands why Manning punted on the decision, but he hopes that the case could be resumed soon.\nJudge Manning also gave attorney Randall H. McKinney a week to decide whether he will continue to defend Shelton or represent the suspect's girlfriend and her father — Channel and Adrien Falls — whom authorities recently charged with hindering prosecution by allegedly hiding Shelton from authorities in the aftermath of the Wilkinsburg slayings.\nPolice also have charged Shelton in a domestic assault on Channel Falls.\n“It's unfair to call Cheron Shelton a ‘suspect' in one of the worst mass shootings in Pennsylvania history when no one has offered any evidence to support that contention,” McKinney said. “Cheron has been locked away in isolation for two, three months, and I continue to believe that he has had no involvement whatsoever in the Wilkinsburg shooting.”\nKilled in the ambush of a March 9 barbecue in a Wilkinsburg backyard were siblings Brittany Powell, 27, Tina Shelton, 37, and Jerry Shelton, 35; their cousin, Chanetta Powell, 25, and her unborn child; and family friend Shada Mahone, 26.\nAssociate Dean Wesley M. Oliver, director of Duquesne University's Criminal Justice Program and a professor law, said this is a quirky case, but one that has been addressed by the U.S. Supreme Court.\nIn Baker v. Wingo, the justices in 1972 upheld the conviction of a Kentucky defendant who waited five years between his initial arrest and trial, with only seven months of the wait deemed justifiable because a key witness was ill. Despite the extraordinarily long delay, the court ruled the defendant wasn't prejudiced by it because he still received a fair hearing and the statute of limitations had not tolled.\nSince that ruling, courts nationwide have come to start the clock for a speedy trial at indictment; one of the defendants in the 2013 Wilkinsburg case will not be arraigned until next week.\nWhile that ruling hurts the defense in the Wilkinsburg case, Oliver said Doggett v. United States should give the prosecution reason to worry, too.\nIn 1992, the justices in Doggett ruled that an 8½-year delay between his arrest and indictment violated the Sixth Amendment's right to a speedy trial because authorities were negligent in pursuing him.\nThe defendant in Doggett never tried to hide from authorities and had not committed any crimes in the long delay after his arrest on drug charges.\nThe justices ruled that the lack of a speedy trial was attributed only to the bungling of law enforcement officials and that subjected him to “oppressive pretrial incarceration,” “anxiety and concern” over his future and threatened to impair his defense at trial.\n“If, in fact, the trial judge believes that the clock started ticking in 2013,” Oliver said, “then the state can't simply be negligent in finding the defendants and building evidence for the case.”\nCarl Prine is a Tribune-Review investigative reporter. Reach him at cprine@tribweb.com or 412-320-7826."}