{"uri": "http://triblive.com/news/allegheny/10122712-74/shelton-family-powell?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29", "title": "Close-knit family struggles for answers in wake of shooting", "dct": "Thu, 10 Mar 2016 11:00:00 GMT", "id": "a84be5366f5556e522cc8da027129b7d", "content": "In a few chaotic minutes, Jessica Shelton lost three of her grown children — and an unborn grandson — in an unthinkable shooting spree.\nYet another son clung to life at a Pittsburgh hospital with bullets lodged in his body.\n“It just breaks my heart,” Shelton said through tears Thursday during a news conference at Lighthouse Church in Mt. Oliver.\nBarely hours after the massacre, the grieving mother described how her close-knit family frequently got together for cookouts when the weather was nice. Wednesday was unseasonably warm and sunny, so Jessica Shelton said her children, nieces and nephews called each other and made plans for an evening barbecue.\nThey gathered at her daughter Brittany Powell's house in Wilkinsburg. Her son, LaMont Powell, manned the grill.\nThe family spent the evening playing cards and dominoes, swapping stories and telling jokes, while some of their young children played in the yard.\n“Yesterday started out to be a beautiful day for us,” Shelton said. “Everything was just perfect.”\nBut shortly after Jessica Shelton left the gathering about 9 p.m., the happy get-together suddenly turned into a nightmare that left the close-knit family reeling.\nTwo men opened fire on the group in the backyard, purposely trapping them on the back porch as they fled the first round of bullets, police said.\nThree of Shelton's children, Jerry Shelton, 35, Brittany Powell, 27, and Chanetta Powell, 25, were killed, along with her niece, Tina Shelton, 37, and a close family friend, Shada Mahone, 26.\nLaMont Powell, 24, remains in UPMC Mercy, Uptown, in critical condition with gunshot wounds to the neck, back, chest and hand. He'll undergo surgery again Friday to remove more bullet fragments, Shelton said.\nAnother man remained in Mercy in critical condition and a woman was treated and released Thursday morning, authorities said. Their names were not released. Shelton said she does not know them.\nHer son Jerry was a devoted father of two who worked hard to provide for his family, Shelton said. Brittany celebrated her young daughter's birthday two days ago. Chanetta was pregnant with her third child, a boy. She was due in late May, and they had been talking about baby names the past few weeks.\nTina had five children and worked so hard that she rarely had the time to sit and enjoy her family like she was trying to do Wednesday night. Shada was like a niece to Jessica Shelton, she said. She had a daughter and “could light up a room with her smile,” Shelton said.\n“They were fun-loving kids,” Shelton said about her lost loved ones. “They loved to laugh and joke.”\nShelton said she didn't know what motivated the shooters to “massacre” her family and leave 11 children without a parent. None of the victims had significant criminal records, court records show.\nSome neighbors and friends were also invited to the barbecue, but the event wasn't advertised or talked about on social media, Shelton said.\n“It doesn't make sense to take people's lives like that,” Shelton said.\nThe Rev. Maurice Trent, pastor of Lighthouse Church, said he has known the family for years. They call him “Uncle Cliff,” he said. He led the service when Brittany's baby daughter died a few years ago.\nSomebody knows who is responsible for the tragedy, he said.\n“The family appeals to you to pick up the phone and say something,” Trent said.\nHe also urged people to donate to the Shelton-Powell memorial fund through Citizens Bank.\n“They are facing a huge financial burden having to bury so many at one time,” he said.\nShelton said she is trying to hold everything together for her five grandchildren.\n“Right now, I have no choice but to be strong because I have grandkids that lost their parents that I have to be strong for and live for,” she said.\nHer oldest daughter, Mellyora Walker, 32, said she is doing her best to be strong for her mother while also grieving the loss of her older brother and two younger sisters.\n“They were her babies,” Walker said. “So I got to hold her up.”\nElizabeth Behrman is a staff writer for the Tribune-Review. She can be reached at 412-320-7886 or lbehrman@tribweb.com."}