{"uri": "http://triblive.com/news/adminpage/10269922-74/shelton-police-thomas?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29", "title": "Suspect identified in Wilkinsburg shootings", "dct": "Thu, 07 Apr 2016 11:54:00 GMT", "id": "e6b18e08d4b992dfc9ace17a1acb699f", "content": "Four weeks after a backyard massacre in Wilkinsburg in which six people were killed, police have a suspect: a Pittsburgh man arrested on unrelated drug and weapons charges.\nAt a bail review hearing before Common Pleas Judge David Cashman, prosecutors and Allegheny County homicide detectives said police consider Robert Thomas, 27, of Pittsburgh a suspect in the March 9 shooting on Franklin Avenue. They asked that he be held without bail.\n“Following our argument that we consider Thomas a flight risk and a danger to the community based on his previous record, and the drug and weapons charges that he currently faces, Judge Cashman agreed with our assessment and denied bond,” said District Attorney's Office spokesman Mike Manko.\nDefense attorney Casey White said he was disappointed by the accusations against Thomas and that his client, whom he has known for a number of years, maintains his innocence.\nAllegheny County police arrested Thomas on Tuesday with Justin Gomez, 27, of Rankin, Ashley Smith, 30, of Pittsburgh and Cheron Shelton, 29, of Homewood.All were questioned about the Wilkinsburg shooting.\nThe four were arrested on charges stemming from a 2013 search of Smith's apartment on Hill Avenue in Wilkinsburg, where police said they found guns that had been reported stolen, drugs and ammunition.\nWilkinsburg police filed charges for drugs and receiving stolen property shortly after the search, but prosecutors were not ready to present the case after a delay, and Magisterial District Judge Kim Hoots dismissed the charges. The same charges were refiled in April 2013, but the prosecution again could not proceed and the case was dropped that July.\nGomez and Thomas were charged the first time; police added Shelton the second time. Smith was not charged until this week.\nShelton, whom police questioned March 25 when he was arrested for violating his probation, was questioned at least a second time Wednesday in Allegheny County Police headquarters.\nPolice said they found his fingerprint on a gun like one used in the Wilkinsburg killings.\nThey have not named Gomez, Smith or Shelton as suspects.\nGomez was released Thursday after posting $100,000 bail. Smith was released Wednesday on $40,000 bail.\nA preliminary hearing for all four is scheduled for April 14 before Hoots.\nThose killed at the backyard barbecue were siblings Jerry Shelton, 35, Brittany Powell, 27, and Chanetta Powell, 25; their cousin, Tina Shelton, 37; and a family friend, Shada Mahone, 26. Chanetta Powell's unborn child, Demetrius, also died. Two people were critically wounded, including LaMont Powell.\nLaMont Powell's attorney, Frank Walker, said his client had no reaction to the naming of a suspect in his family's killing.\n“He's taking care of his health. He has tubes coming out of him, he still has bullets lodged in him — he's still in shock,” he said.\nWalker said neither Cheron Shelton nor Thomas were familiar to Powell.\nAuthorities said Cheron Shelton is not related to the victims, who were ambushed during a cookout at Brittany Powell's home.\nWalker and his client were in Pittsburgh Municipal Court on Thursday for a preliminary hearing on charges that Powell assaulted his sister Chanetta's boyfriend in December. That hearing was postponed until May because a prosecution witness was unavailable.\nThree days after the shootings, police searched a home on Nolan Court in Homewood and discovered a firearm and a cache of ammunition, as well as identification belonging to Shelton. Lab tests turned up a fingerprint belonging to Shelton on a semi-automatic rifle, which was reported stolen last year in Uniontown.\nMegan Guza contributed. Matthew Santoni is a Tribune-Review staff writer. Reach him at msantoni@tribweb.com."}