{"uri": "http://triblive.com/news/allegheny/10535250-74/charges-shooting-2013?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29", "title": "Man tries to break ties to Wilkinsburg cookout shooting suspects", "dct": "Fri, 27 May 2016 12:18:00 GMT", "id": "f8956ad5135f7068da228205a24ad182", "content": "The attorney for a man connected to two suspects in a March mass shooting in Wilkinsburg has filed a motion to dismiss all charges against his client, saying the court is holding him hostage in an attempt to harass and annoy the suspects.\nThe pre-trial motion, signed by attorney Casey P. Mullen, says charges against Justin Gomez, 27, of Rankin were previously dismissed and were held for court only after the shooting March 9 in Wilkinsburg.\n“It is obvious that the government lacks evidence to charge those suspected of involvement in the 2016 Wilkinsburg shooting,” the motion dated Monday states, “so the government is willing to use a 2013 criminal matter that was previously dismissed twice as a vehicle to hold those suspected to have involvement in the 2016 Wilkinsburg shooting in jail.”\nAllegheny County District Attorney Stephen A. Zappala Jr. could not be reached for comment. His spokesman, Mike Manko, said Zappala's office plans to file a response Tuesday.\nThree siblings, Jerry Shelton, 35, Brittany Powell, 27, and Chanetta Powell, 25; their cousin, Tina Shelton, 37; and friend Shada Mahone, 26, died in the shooting, which happened at a family cookout. Chanetta Powell's unborn child also died.\nTwo people were critically wounded.\nPolice have named Robert Thomas, 27, of Pittsburgh and Cheron Shelton, 29, of Homewood as suspects in the shooting, but they have not been charged.\nGomez had been charged with receiving stolen property and drug violations in connection with a Feb. 21, 2013, incident in which authorities say he was caught attempting to flee an apartment when police arrived looking for Shelton and another man.\nDetectives reported finding stolen guns and a box of suspected narcotics inside.\nMullen's motion says those charges against Gomez were dropped twice by Magisterial District Judge Kim Hoots in Wilkinsburg.\nProsecutors requested a continuance for a preliminary hearing scheduled for Feb. 28, 2013, which was granted, but a second request for a continuance March 28, 2013, was denied, and the case was dismissed.\nThe same charges were filed again April 25, 2013, but the prosecution was unable to proceed with a hearing scheduled for July 18, 2013, and the case again was dismissed.\nCharges were refiled a third time April 5 with a preliminary hearing scheduled before Hoots, but that hearing was rescheduled for May 6 and held before Judge Derwin Rushing in East Allegheny at the request of the prosecution. During that hearing, all charges were held for court.\nAt the May 6 hearing, the motion states, the government did nothing other than prove that Gomez was a guest in an apartment that contained contraband in rooms and cabinets, and that any new evidence is a result of investigations that occurred three years after the original filing.\nMadasyn Czebiniak is a Tribune-Review staff writer. Reach her at 412-320-7822 or mczebiniak@tribweb.com."}