{"uri": "http://www.nola.com/crime/index.ssf/2016/10/2_killed_baby_wounded_1_stabbe.html#incart_river_index", "title": "2 killed, baby shot, 1 stabbed in 20 violent hours in N.O.", "dct": "Fri, 21 Oct 2016 21:28:27 GMT", "id": "68a34b8ace39d631ec53390b79266728", "content": "A 28-year-old woman was stabbed and sprayed with Mace when another woman broke a window in the victim's home late Thursday, police said. The attacker, identified by police as Heather Lindsey, broke a window at the home in the 2000 block of North Villere St. in the 7th Ward and a fight ensued, police said. Lindsey cut the victim several times with a knife and sprayed mace on her, police said.\nTwo men were killed in separate shootings in New Orleans that also left a 5-month-old baby and another man injured Thursday (Oct. 20), during a 20-hour violent period that also included the stabbing of a woman and other crimes.\nA 20-year-old man was struck in the head with a crate during an armed robbery attempt early Thursday (Oct. 20) in the French Quarter, NOPD said. The 20-year-old man was in the 100 block of Chartres Street when three men approached him, police said. One of the three men ordered the victim to hand over his watch. When he refused, a second man picked up a crate and struck the victim in the head. The three men left the area, police said.\nIn what investigators believe began as an abduction, a man in his early 20s was fatally shot and dumped from a moving car onto a Lower 9th Ward street Thursday morning. Police found him lying on Florida Avenue, between Lamanche and Charbonnet streets. Based on information from the victim's family, police suspected the man was abducted from an area near where his body was found.\nA GNC store in the 400 block of North Carrollton Avenue in Mid-City was robbed by a man armed with a razor, NOPD said. The man approached a 19-year-old employee from behind and put the razor to the victim's abdomen, demanding money. The employee opened the register, and the robber took cash and fled, police said.\nA man was killed and a 5-month-old boy and another man were wounded Thursday night in an Algiers shooting, NOPD said. The fatally wounded man, 26, died at the scene, police said. The infant, hit at least once, was listed in stable condition Friday, police said. The wounded man, also 26, was in stable condition early Friday. \"Our prayers are with the infant,\" said NOPD Superintendent Michael Harrison.\nCorrection: NOPD had indicated the baby is 6 months old. His family said he's 5 months old."}