{"uri": "http://www.nola.com/crime/index.ssf/2016/10/algiers_shooting_2.html#incart_river_index", "title": "1 killed, 2 wounded in Algiers shooting; injured includes infant", "dct": "Fri, 21 Oct 2016 13:31:56 GMT", "id": "a6a6ac23026028489936ac9e3acc92ed", "content": "A 5-month-old boy and a man were wounded, and another man was killed Thursday night (Oct. 20) in an Algiers shooting, according to New Orleans police.\nThe fatally wounded man, 26, died at the scene, police said.\nThe infant, hit at least once, was in surgery late Thursday and was later listed in serious condition, police said. The wounded man, also 26, was in stable condition early Friday.\n\"Our prayers are with the infant,\" said NOPD Superintendent Michael Harrison.\nThe shooting occurred at about 9 p.m. at the entrance gates of the Cypress Run apartments in the 6100 block of Tullis Drive, not far from a bridge crossing the Gulf Intracoastal Waterway.\nInvestigators believe the two men were inside a white car in the driveway to the apartment complex when one or more people approached and opened fire, Harrison said. The baby appeared to be in the car with the men \"when the assailants appeared on the side of the car and fired into the car at them,\" he said.\n\"What we really want to emphasize is this is very unnecessary, it's tragic,\" Harrison said. \"The child was in it and was hurt and is now in surgery fighting, fighting for their life.\"\nHarrison said police are still trying to determine the relationships among the three victims.\nHarrison, along with Commander Paul Noel and other NOPD leaders, were at the scene late Thursday, often congregating in the small driveway where the crime took place. A white car, its doors open, sat nearby in the driveway. Later that night, evidence cones sprinkled the pavement near the car.\nOn one side of the cordoned-off crime scene, nearer the Intracoastal Waterway bridge, family members of the deceased victim stood by as investigators continued inspecting the scene.\nBrandy Moses, who identified herself as a cousin of the fatally shot man, said she had just gotten off from work when she received a call from her mother about the shooting.\n\"He was a good guy, he was a family person,\" Moses said.\nOn the other side of the scene, a crowd of about a dozen people, including residents of the complex, also watched from outside the crime tape.\nOne neighbor said he was sitting on his back patio, several buildings away from the scene, when he heard gunshots break out. \"I couldn't tell you how many. It happened so fast,\" he said, declining to give his name. \"They were loud.\"\n\"I came over here to check if the baby was all right,\" he said. \"I heard a baby got shot.\"\nStanding before the scene late Thursday, Harrison pleaded for anyone with information to call the NOPD or submit an anonymous tip via Crimestoppers.\nWhen asked if he thought, since the shooting happened in a large apartment complex, that witnesses would share information, Harrison said, \"We're always hopeful.\"\nTraditionally, New Orleans residents have been especially cooperative in crimes involving babies and children, he said.\nHarrison described how he feels when he hears that someone has been injured, especially a child.\n\"It's heartbreaking,\" Harrison said. \"It rips communities apart, it rips families apart. Some people really kind of never recover from that.\"\nAnyone with information on the shooting is asked to call Homicide Detective Debra Norman at 504.658.5300 or Crimestoppers at 504.822.1111 or toll-free at 1.877.903.STOP.\nThe baby's age has been corrected after speaking with family."}