{"uri": "http://www.wkbw.com/news/7-shot-2-dead-at-rochester-boys-and-girls-club", "title": "7 shot, 3 dead outside of Rochester Boys & Girls Club", "dct": "Thu, 20 Aug 2015 00:09:00 GMT", "id": "40baaeea36646b87b390e2553ba6bf39", "content": "Autoplay:X7 shot, 3 dead at Rochester Boys and Girls Club\nROCHESTER, N.Y. (WKBW) - Three people are dead and four more are injured following a drive-by shooting near the parking lot of a Boys & Girls Club in Rochester.\nThe incident happened around 11:20 p.m. Wednesday on Genesee Street. A basketball game at the club was letting out when a drive-by shooter opened fire on the group of people.\nAn eyewitness at the scene told the 7 Eyewitness News crew that the game was a \"Stop the Violence\" event.\nTwo people died at the scene. The victims were 17-year-old Jonah Barley and 19-year-old Raekwon Manigault, according to family members.\nThe family of Jonah Barley told 7 Eyewitness News that the young man was just an innocent bystander who had recently survived a car accident that had left him in a coma.\n\"Jonah was loved,\" said his aunt, Jamila Hanna. \"He's loved now, he was loved then and he'll continue to be loved.\"\n\"He was just at my house,\" added another aunt of Barley's, Melody Scott. \"I said it's late, I need you to get home, I need you to get there safe. Then I got the phone call.\"\nRural Metro Medical Services took three people to Strong Memorial Hospital. Another two people were brought to the hospital by a private car. A third, unidentified victim died at the hospital.\nAccording to Rochester Police, the four injured in the shooting are all males, between the ages of 20-29. The identity of the other victims are being withheld, until family can be notified.\nEyewitness Cherokee Lovett told 7 Eyewitness News that he was standing right next to one of the victims when the gunfire broke out.\n\"I can't even think,\" Lovett said, \"You see this stuff on TV, but you never think it'll happen so close to home.\"\nFriends and family of the victims formed a prayer circle just outside of the crime scene Thursday morning to reflect and pray. Many were from Pathways to Peace, a city-run initiative that connects at-risk youth to community resources to try to prevent youth violence. One of the victims, Raekwon Manigault volunteered regularly with the group. In fact, his father said that was why he was at the basketball game Thursday evening.\n\"He was always volunteering with Pathways to Peace,\" said his father, Rodney Manigault. \"He just wanted to play sports.\"\nPolice used a high school across the street as a command post before returning to headquarters to continue the investigation.\nRochester Police Chief Chief Michael Ciminelli called the incident \"outrageous\" and said the police force will work tirelessly until they find the gunman.\nCommunity members say this latest shooting is just one sign of the gun violence that plagues Rochester.\n\"When you have people who don't value life, they don't care if you have more police,\" said Councilman Adam McFadden, who says he overcame the odds and grew up in a gang in that neighborhood. \"Let's be honest about what you're dealing with,\" McFadden stated, adding that people have the choice to change.\nLeaders with the Pathway to Peace organization and local clergy formed a prayer circle at the scene, asking the community to turn in anyone with information and calling for peace over violence.\n\"We wanted to let the cowards that did this know that Rochester is a community of one,\" said Bishop William Davis. \"Whatever you do, we'll rise up.\"\nBishop Davis adds at a time when the community needs comfort, he is planning another prayer vigil.\n.@RochesterNYPD officers examine evidence feet away from one of the deceased victims of the Boys and Girls shooting. pic.twitter.com/6p4l4ohrMK\n— Jim Herr (@breaknewsman) August 20, 2015\nStay in Touch Anywhere, Anytime with News, Weather and Video -- Download the WKBW app:\nOr Sign up for our Daily Newsletter -- Delivered to Your E-mail:"}