{"uri": "http://www.whec.com/news/boys-and-girls-club-shooting-verdict-jalen-everett/4310663/?cat=565", "title": "Second suspect found guilty in Boys and Girls Club shooting", "dct": "Fri, 04 Nov 2016 23:15:00 GMT", "id": "bd829365b6c71b55206ae0ea06f27a86", "content": "Another suspect has been found guilty of murder in the deadly shooting outside the Boys and Girls Club.\nJalen Everett was convicted on Friday in the case. Everett was found guilty of three counts of second-degree murder, but not guilty on first-degree murder charges. He was also found guilty of three counts of assault.\nAnother man, Johnny Blackshell Jr., was convicted earlier this year. A third suspect, Michael Mathis, is scheduled to face trial early next year.\nProsecutors say the three men pulled up in a vehicle on Genesee Street last August and opened fire into a crowd leaving a basketball game at the club.\nThree people were killed: 19-year-old Raekwon Manigault, 17-year-old Jonah Barley and 25-year-old Johnny Johnson.\nRachel Spotts: \"Are you satisfied with the outcome?\"\nAnita Barley, Jonah's morther: \"Most definitely. I have kids. I have a 22-year-old and I've always raised them to do the right thing.\"\n\"I don't think I'll ever find closure,\" said Tammy Burnett, Raekwon's mother. \"If I do, I'll have to find it within. But this is a little relief, just to know that he'll never be on the streets to hurt anyone else.\"\n\"I sat through this trial,\" says Barley. \"I sat through the other trial. Everything is about, 'you're from another side of town.' Are you serious? You should be able to go anywhere you want to. We're in the land of the free.\"\nSpotts: \"Justice was served today?\"\nPerry Duckles, Assistant District Attorney: \"I believe so, yes. I think this was a long uphill battle. The evidence was there but it took a very strong and tenacious jury to sift through everything.\"\nSentencing for Jalen Everett is scheduled for January 6. He faces a maximum sentence of 25 years to life behind bars."}