{"uri": "http://www.dailymail.co.uk/news/article-3204444/Three-people-dead-drive-shooting-upstate-New-York-gunman-opened-fire-crowd-following-basketball-game.html", "title": "‘I watched parents scramble through the crowd looking for their babies': Three dead in drive-by shooting in New York after gunman opened fire into crowd following a basketball game", "dct": "Thu, 20 Aug 2015 08:53:00 GMT", "id": "d6b21f39fdaaa1120caf854bc819a03c", "content": "Two victims killed in a drive-by shooting in New York have been identified, as families flock to the scene of the attack to hear news of their loved ones.\nJonah Barley, 17, and Raekwon Manigault, 19, are both reported to be among the three killed, after a gunman open fire into a crowd of people leaving a basketball game in Rochester.\nPolice have not yet confirmed the identities, which were revealed by the alleged victims’ families.\nScroll down for video\nThe horrific attack took place just meters from a high school and the headquarters of a children’s club late last night.\nHuge crowds of people gathered at the scene of the shooting, in western Rochester, as desperate relatives tried to find out if their loved ones were among the victims.\nPolice reported that it was a drive-by shooting, near Wilson Magnet High School and the headquarters of the Boys and Girls Club in Rochester.\nNamed: Families have identified two of the three people who died in the attack as 17-year-old Jonah Barley (left) and 19-year-old Raekwon Manigault (right). Police have not yet confirmed the identities, but tributes have been pouring in on social media from heartbroken family and friends\nTributes to the two named victims, who are reported to have been friends, have been flooding in from friends and family on social media.\nOne friend of Jonah Barley, Latanya Banks, who said he called her 'Grandma Tanya', posted photographs of Jonah and posted heartfelt tributes.\n'Jonah was like my grandson,' Ms Banks told MailOnline.\n'He was a bright kid and he was loved by so, so many.\n‘Jonah was a fun-loving kid and his spirit shined.\n‘He ran away when he heard the shots but he was killed. My heart is hurt today, he was like one of my own.\n‘The parents of Rochester need to stand up and claim our city back. Protect our children.’\nShe added on Facebook: ‘He was just over visiting, getting on my nerves last week. I know he is at peace. Now you can rest Jonah.’\nMs Banks described the situation at the Genesee Street site of the shooting as ‘pure chaos’.\nMs Banks, who knows Raekwon's father, said: 'It killed me to watch him comfort his daughter while waiting for the fate of his son.'\nShe added: ‘I watched parents scramble through the crowd looking for their babies… The scene was out of a movie. Family after family coming, hundreds of people, it was crazy.\n‘Tomorrow there will be vigils, but what about today… I don’t understand and I’m upset about it.’\nShe added: ‘Our kids should be going to college, not the funeral home.’\nKnown as Ray-Ray, Raekwon was identified by a man at the scene claiming to be his father.\nDescribed as a 'great kid', Raekwon was a volunteer with a local peace program.\n‘We are bringing every resource that we have at our disposal to bear on this and we will run this down and find out who did this.\n‘This was an outrageous act.’\nThe names of the victims have not yet been released according to CBS Rochester affiliate WROC.\nFriends and family of those killed consoled each other at the scene of the attack.\nIn initial reports, police announced that two people had been killed and five wounded, but two more people have since died from their wounds.\nThe condition of the other victims has not been announced.\nThe investigation is being treated as a priority by the Rochester police force, with Police Chief Michael Ciminelli urging anyone with information to come forward.\nPhotographer Lauren Petracca tweeted: ‘Wishing I could unhear and unsee all the screaming and crying here tonight. We should all be mourning for these families.’\nRochester news anchor Jennifer Mobilia added: ‘There are literally hundreds of people in the street right now, looking at what’s going on.’"}