{"uri": "http://www.wwltv.com/news/local/high-school-senior-shot-run-over-trying-to-save-homicide-victim/358047865", "title": "High school senior shot, run over trying to save homicide victim", "dct": "Tue, 29 Nov 2016 00:00:00 GMT", "id": "641d2053101dfec3aa4c9b41ab76a252", "content": "BATON ROUGE, La. -- A 17-year-old Central High senior is in the hospital with a list of painful injuries — a pair of bullet wounds, a broken arm and a broken leg — after being shot and run over twice Sunday evening while trying to save a woman fatally shot on Essen Lane.\nAccording to our partners at The Advocate, Daniel Wesley, a trained emergency medical responder who's currently studying for his EMT certification, spotted 30-year-old April Peck lying in the roadway while driving home from a shopping trip at the Mall of Louisiana.\nThe son of a retired East Baton Rouge EMT, Wesley pulled to the side of the road, grabbed his father's medic bag and rushed to the woman, who'd been shot and tossed from her car minutes earlier by her 48-year-old boyfriend, Terrell Walker.\nDaniel Wesley pulled on a pair of gloves and was preparing to put pressure on the woman's bullet wound when Walker came speeding back, aiming his car for Wesley and a group of other passers-by — including a physician and the crew of an EMS ambulance — who'd also stopped to help.\nThe impact threw Wesley against the ambulance, his mother said, shattering his arm. Then Walker stepped out of Peck's Chevy Malibu and shot Wesley.\n\"If you help her, I'm going to kill you,\" Kathy Wesley said Walker told her son as he turned to chase after the others trying to save Peck's life.\nWesley managed to crawl away toward the Essen Lane median, his mother said, but when Walker returned he shot him again, then climbed in his car and ran over Wesley a second time as he attempted to escape.\nOfficer Buys Socks For Homeless Man Rummaging Through Trash\nLamp post saves woman from being hit by car\nAdorable week-old polar bear unveiled in new video\nFatal Essen Shooting\nDonald Trump calls Madonna 'disgusting' in Fox interview\nAustralian Open final: Serena v Venus head to head\nWidower Reunites With Missing Dog After Wife Dies In Car Crash\nDouble decker train smashes through FedEx truck\nSee How the Internet Reacted to Kellyanne Conway's Inauguration Outfit\nEXCLUSIVE: Lily Collins Recalls the 'Emotional Experience' of Filming 'To the Bone'\nPhotographers Take T-Rex Themed Engagement Photos To Prove Love Isn't Extinct\nBorder Control Sieze 3,000 Pounds of Pot Disguised As Watermelons\nWatch Boy's Dramatic Rescue After He Was Buried In Hotel After Avalanche\nThief Who Allegedly Took $1.6 Million 'Pot Of Gold' Arrested in Ecuador: NYPD\nTrump pledges to put \"America first\" on trade and security\nThe moment Donald Trump is sworn in as President of the U.S\nWorld's bravest duck takes on a Sumatran tiger\nPolice Rescue Deer After Its Hind Legs Get Stuck In Fence\nPuppy recovers after swallowing 8in knife\nAdorable polar cub revealed as a boy after two month wait\nMoment competitors flee in terror as sports arena roof collapses\nItaly waterfall begins to freeze\nGolden Globes: Meryl Streep condemns Donald Trump's behaviour\nElaborate Billiard Trick Shot Going Viral\nCute red panda cubs play in the snow\nGolden Globes: Watch Emma Stone's awkward 'miss-kiss' with Damien Chazelle\n105-year-old Frenchman sets cycling world record\nTaylor Swift surprises US war veteran with private performance\nLast Minute Gift Guide\nHugging Gingerbread Men\nTrump slams media coverage during speech\n'Rush hour crush': Man proposes on train to Waterloo\nElderly Dog Rescued By Firefighters After Falling Through Ice On Frozen Pond\nMan attempts to steal from till, but leaves with peanuts\nBallet dancing dog stars in Christmas show The Muttcracker\nMoose rescued from frozen lake in Canada\nIncredible moment the rubik's cube world record is broken\nFirefighter saves baby from burning building\nDereck Chisora throws table at Dillian Whyte\nMan Creates Epic Christmas Light Display On Home Set To Prince's 'Purple Rain'\nOfficer Buys Socks For Homeless Man Rummaging Through Trash\nLamp post saves woman from being hit by car\nAdorable week-old polar bear unveiled in new video\nFatal Essen Shooting\nDonald Trump calls Madonna 'disgusting' in Fox interview\nAustralian Open final: Serena v Venus head to head\nTo view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nFatal Essen Shooting\nLaw enforcement officers investigate the scene of a fatal shooting on United Plaza Blvd Sunday night. Shooting spilled out onto Essen Lane also.\nThe Advocate\nhttp://launch.newsinc.com/share.html?trackingGroup=69016&siteSection=advocate&videoId=31677692\nBACK\nEmbed <iframe width=\"590\" height=\"332\" src=\"http://launch.newsinc.com/?type=VideoPlayer/Single&widgetId=1&trackingGroup=69016&playlistId=19132&siteSection=advocate&videoId=31677692\" frameborder=\"no\" scrolling=\"no\" noresize marginwidth=\"0\" marginheight=\"0\" allowfullscreen webkitallowfullscreen mozallowfullscreen></iframe>\nPrivacy Policy | Terms of Use\n(© 2017 WWL)"}