{"uri": "http://www.tampabay.com/news/publicsafety/crime/plant-city-man-arrested-after-shooting-teenage-boy-in-abdomen-police-say/2307563", "title": "Teen coming to the aid of his mother is shot, police say", "dct": "Tue, 27 Dec 2016 11:43:00 GMT", "id": "a51392f13b1c1ac648dd9258c47f978f", "content": "PLANT CITY — His mother and her boyfriend were fighting in another room of their small home when the 15-year-old boy heard a gun go off late Monday night.\nHe rushed in to see if his mother was okay, police said, and ended up confronting the armed 250-pound man threatening her. Ricardo Gonzales, 42, responded by striking the boy in the head with the gun, according to Plant City police, then stuck it in his abdomen and fired one round into the teenager, critically wounding him.\nThe boy, who was not identified by police, was rushed to a hospital in Lakeland for emergency treatment. Plant City officers arrested Gonzales about 1:40 a.m. Tuesday.\n\"My son is stable and is hanging in there,\" said his mother, April Masias, 32, when reached by phone Tuesday evening.\nPolice arrived at the aging wood-frame home at 1705 Charles Ave. at 11:42 p.m. Monday after receiving a call about the shooting. Gonzales had threatened the mother and put a gun to her head, according to police, before firing one round into the floor.\nAfter the shooting, he stayed at the home and cooperated with police when arrested, said Plant City police Sgt. Alfred Van Duyne. Gonzales and Masias have a different child in common, Van Duyne said.\nGonzales was arrested on charges of aggravated assault with a deadly weapon, aggravated battery with a deadly weapon and aggravated child abuse. He was being held without bail Tuesday in the Hillsborough County jail.\nRecords show Gonzales has been arrested more than a dozen times in Florida and has prior convictions for obstructing an officer without violence, disorderly intoxication, driving under the influence, driving without a valid license and petty theft. He was most recently arrested last month on a charge of driving without a valid license, records show.\nNeighbors told the Tampa Bay Times that the injured teen's name is Joe and described him as friendly, courteous and protective of family and friends.\nGonzales and Masias moved into the home around last Christmas with five young children — three girls and two boys, according to neighbors.\nCharlotte Shelton, 69, who lives down the street, couldn't hear the gunshots over the sound of the local news shows her husband watched on TV. When she saw emergency lights flashing outside their window Monday night, at first she thought it was lightning. Then she realized they were red and blue. The couple watched through their glass front door as the boy was taken out of the home on a stretcher and loaded into an ambulance.\n\"He waved at me,\" said her husband, Skeet Shelton, 76.\nSkeet's daughter-in-law and neighbor, Theresa Shelton, said she heard what she thought might have been neighborhood kids setting off fireworks. When she later learned that Joe had been shot trying to defend his mother, she choked back tears.\n\"That sounds like Joe,\" she said. \"Joe's a tough kid.\"\nBut Theresa Shelton also called him a \"sweet boy\" whom she once saw bring in her trash can for her as he walked to his school bus stop.\n\"He always told me, 'If you need anything, let me know,' \" she said.\nTheresa Shelton said the family is friendly and once brought her a plate while they were barbecuing. Gonzales is often gone during the week, and sometimes takes the teen with him to help work part time, she said. On the weekends, though, they've seen him mowing the lawn and eating with the family at the picnic table in their front yard.\nThe family took a walk together Monday evening after spending the day hanging out in the yard, washing the car and playing, Shelton said. One of Masias' younger sons had gotten a new Fisher-Price Power Wheels Dune Racer and the kids spent the morning taking turns riding it up and down the rural country street. The box was still sitting by the curb Tuesday afternoon.\nShelton didn't know Gonzales well and had few interactions with him. But she said she was shocked to hear police say he shot the boy. Police had been to the home before — twice for minor disturbances, according to Van Duyne. Shelton had seen the police cars, but said she never asked why they were there.\n\"They seemed to be happy,\" she said, \"but you don't know what goes on behind closed doors.\"\nTimes senior news researcher John Martin contributed to this report. Contact Tony Marrero at tmarrero@tampabay.com or (813) 226-3374. Follow @tmarrerotimes. Contact Anastasia Dawson at adawson@tampabay.com or (813) 226-3377. Follow @adawsonwrites."}