{"uri": "http://www.star-telegram.com/news/local/community/fort-worth/article31668092.html", "title": "Benbrook police report 2 self-inflicted deaths of teenage boys early Thursday", "dct": "Thu, 20 Aug 2015 17:31:00 GMT", "id": "4c9405147f10c568b6cfcce80b537a5b", "content": "Two teenagers died early Thursday morning in separate incidents in Benbrook.\nWinston Brown, 16, suffered an accidental gunshot wound to the face and later died at Texas Health Harris Methodist Hospital Fort Worth, Benbrook police said.\nBrown, who discharged the .22 caliber rifle himself, was spending the night at a friend’s apartment in the 5600 block of Shallow Run when the two boys began “carelessly” playing with the gun, Benbrook police Commander David Babcock said.\nThe boys had handled the same weapon two weeks ago, but since it didn’t fire, they didn’t think it worked, Babcock said.\n“From that point on, they didn’t think it would go off,” Babcock said. “It was just juveniles being juveniles. The guys were best friends. There were no hostile intentions.”\nOfficers were dispatched to the apartment around 1:36 a.m. They found two rounds of ammunition in the gun’s chamber, Babcock said. The mother of Brown’s friend told police she didn’t know there was a gun in the apartment and that she didn’t own one.\nA few hours later, officers were dispatched to a Benbrook water tower in the 3900 block of Sagebrush Road.\nJacob Spradlin, 17, had called 911 around 5:27 a.m., telling Benbrook police that he was suicidal and that he had climbed to the top of the tower. Spradlin had a brief conversation with police before jumping.\n“He basically just let us know where he would be,” Babcock said.\nOfficers found Spradlin dead beneath the tower. Babcock said Spradlin had to climb a barbed-wire fence at the base of the tower before climbing to the top.\nFamily members of Brown and Spradlin could not be reached. Spradlin lived in Benbrook, according to the Tarrant County medical examiner’s website. A home address for Brown wasn’t listed.\nFort Worth school district spokesman Clint Bond confirmed that both boys were students in the district but wouldn’t disclose which school either attended.\n“I can tell you that counselors have already been arranged for those campuses that are involved,” Bond said.\nRyan Osborne, 817-390-7760\nTwitter: @RyanOsborneFWST"}