{"uri": "http://www.nbcmiami.com/news/local/Child-Shot-in-Miami-Police-297468241.html", "title": "Youths,16 and 10, Killed in Separate Shootings in Miami, Third Youth Survives: Police", "dct": "Wed, 25 Mar 2015 01:32:00 GMT", "id": "b1d09e4848d302da283e55f1af8b4dbc", "content": "A Miami teen is recovering from his injuries Wednesday after he was shot in an apparent drive by shooting late Tuesday night.\nAnthony Nixon, 16, was walking in his Allapattah neighborhood to grab dinner when he says someone drove up and started shooting at him.\n\"When I heard the shots, my reaction was so slow,\" Nixon told NBC 6. \"I couldn't even, like, run.\"\nThe teen says he thought he saw two shooters. The bullet went through his right thigh. Nixon was taken to Jackson Memorial Hospital and was released today on crutches with bandages on his leg.\nNixon is shocked by what happened.\n\"I walk around here like I'm safe every day. Every day, all day. So I ain't even expect for them to come shoot at me. It's just crazy.\" Nixon says.\nSadly, two other youths were killed that same night, including another 16-year-old right in Nixon's neighborhood.\nAnother child, 10-year-old Marlon Eason, was also shot and killed in another drive by shooting that same night in the 1900 block of Northwest Fourth Court in Overtown, police say.\n\"We are absolutely devastated,\" his uncle, Richard Ruffin, said. \"Marlon was the center of our lives.\"\nNeighbor Varnall Tate heard the gunshots.\n\"I was here when they brought him out,\" Tate said of the little boy. \"They had him face down on his stomach and I said, that looks like a kid.\"\nTate says she was also there when officials brought the little boy's body out.\n\"I just shivered,\" she says. \"I mean, who shoots a kills a ten-year-old kid?\"\n\"This was an innocent child on his porch bouncing his basketball, and you had no right to target him,\" Ruffin said.\nThe 16-year-old, Richard Hallman, was shot and killed in the 2000 block of Northwest 18th Terrace, police said. Hallman was a football player at Booker T. Washington.\nMiami Police say they are investigating whether the shootings are related, and said that the incidents are particularly disturbing because the victims are all children.\n\"This is very disturbing for us here in the City of Miami,\" said Sgt. Freddie Cruz of the City of Miami Police Department. \"This is something that's very uncommon for us.\"\nAnyone with information is asked to call Miami-Dade Crimestoppers at 305-471- TIPS. Rewards of up to $3,000 are being offered in each case for information leading to an arrest."}