{"uri": "http://www.fox32chicago.com/news/crime/219609687-story", "title": "68 shot, 8 fatally, in Thanksgiving weekend violence", "dct": "Thu, 24 Nov 2016 14:39:00 GMT", "id": "79451683f275620c4e81b6c66c286ba5", "content": "SUN-TIMES MEDIA WIRE - At least 68 people were shot, 8 fatally, in attacks across the city over Thanksgiving weekend.\nLast year, 8 people were killed and 20 were wounded in shootings during the same four-day holiday weekend, beginning at 7 p.m. the day before Thanksgiving.\nThe weekend’s latest homicide happened at 2:03 p.m. Sunday in the Gresham neighborhood on the South Side. Delvon Weston, 18, was sitting in a parked vehicle in the 8800 block of South Marshfield Avenue when someone fired shots from a dark SUV, according to police and the Cook County medical examiner’s office. The SUV was driven away after the shooting and headed north on Marshfield. Weston, who lived in the first block of East 101st Place, was shot several times in the chest and took himself to Christ Medical Center in Oak Lawn, where he was pronounced dead at 2:22 p.m.\nAbout 10 minutes earlier, a 37-year-old man was shot dead in the East Garfield Park neighborhood on the West Side. Rickey J. King was with a group at 1:52 p.m. in the 3800 block of West Adams Street when someone across the street opened fire; the assailant then ran south on foot. King was shot in the head and pronounced dead at the scene at 2:01 p.m., according to police and the medical examiner’s office. He lived in the 8800 block of South Burley Avenue.\nAt 2:38 a.m. Sunday in the Homan Square neighborhood on the West Side, two men were seated in a parked vehicle in the 3400 block of West Harrison Street when a silver car stopped in front of them and two males wearing hooded sweatshirts exited the car and opened fire, police said. Erik Peoples, 30, of the 5900 block of North Sheridan Road, suffered gunshot wounds to the head and body and was pronounced dead at the scene at 2:53 p.m., authorities said. The other man, 31, was shot in the right arm and taken to Mount Sinai Hospital, where his condition was stabilized.\nA 56-year-old man was gunned down at 3:38 p.m. Saturday in the South Side Woodlawn neighborhood. Witnesses told police they saw two men get into a fight and heard a gunshot in the 6600 block of South Kenwood. Gregory Thomas-Bell was shot in the head and pronounced dead at the scene at 3:47 p.m., according to police and the medical examiner’s office. He lived in the 4300 block of South Greenwood.\nAbout 2:15 a.m. Saturday, two gunmen opened fire outside a house party in the South Chicago neighborhood’s 8800 block of South Exchange Avenue, authorities said. Dequan M. Barnett, 18, of the 4500 block of South Lake Park Avenue was shot in the chest and pronounced dead at the scene, according to the medical examiner’s office. A 20-year-old man shot in the groin was taken in critical condition to Northwestern Memorial Hospital, along with a 21-year-old man wounded in the arm, police said. A 25-year-old woman was taken to Stroger Hospital with a graze wound to the head, a 22-year-old man shot in the hand went to Trinity Hospital and a 23-year-old man shot in the arm went to the University of Chicago Medical Center. Their conditions were stabilized, police said.\nFriday evening, a 16-year-old boy was slain in the Back of the Yards neighborhood on the South Side. Diego Alvarado heard gunfire and realized he’d been shot in the back, groin and arm about 6:40 p.m. near his home in the 4800 block of South Throop Street, authorities said. Alvarado died at Stroger at 7:32 p.m.\nFive hours earlier, two people robbed 24-year-old Thomas Smith and then shot him in the abdomen shortly before 2 p.m. in the 7300 block of South Lowe Avenue in the South Side Englewood neighborhood, authorities said. Smith, of the 9600 block of South Dobson, died at Stroger at 4:30 p.m.\nThe holiday weekend also saw three police-involved shootings. In two of those incidents, the gunmen killed by police allegedly also killed or wounded other people.\nAbout 11:30 p.m. Sunday, Chicago Police officers fatally shot a man suspected of shooting a 24-year-old pregnant woman in the abdomen during a domestic incident in the 4600 block of West Adams in the West Garfield Park neighborhood, police said. She was taken to Stroger in serious condition. The suspect ran from the scene, but later fired shots at officers on two separate occasions and was eventually gunned down when officers returned fire in the 4500 block of West Washington, authorities said. Richard Grimes, 33, was taken to Stroger Hospital, where he was pronounced dead at 12:20 a.m. Monday, according to the medical examiner’s office. He lived in the 4600 block of West Adams, the same block where officers initially responded.\nShortly before 12:30 a.m. Friday, officers on patrol near West Harrison Street and South Central Park Avenue in Homan Square heard gunfire and saw 37-year-old Cleotha Mitchell fatally shoot 35-year-old Jeffery Banks, authorities said. The officers “engaged the offender” and shot him, according to police, who said Mitchell had also shot a second person in the arm. That person’s condition was stabilized at a hospital, while Mitchell and Banks were pronounced dead at the scene at 12:44 a.m.\nThe Independent Police Review Authority is investigating the officers’ use of force in both the West Garfield Park and Homan Square shootings, as well as that of a CPD sergeant who fatally shot 19-year-old Kajuan Raye in the back shortly after 11 p.m. Wednesday in the West Englewood neighborhood. The sergeant said he saw Raye point a gun at him twice during a foot chase, authorities said. Investigators have not found the weapon the sergeant claimed he saw and Chicago Police Supt. Eddie Johnson on Saturday said he’s relieving the sergeant of his police powers.\nThe weekend’s latest nonfatal shooting happened at 3:10 a.m. Monday in the South Side Park Manor neighborhood. A 24-year-old man was walking on the sidewalk in the 7200 block of South King Drive when he was approached by two females and two males, one of whom pulled out a gun and announced a robbery, according to police. He surrendered his personal belongings to the suspect, who subsequently shot him in the left leg. The suspects then ran away. The man was taken to Stroger Hospital, where his condition was stabilized.\nAt least 51 more people were wounded in other attacks between 7 p.m. Wednesday and 1 a.m. Monday."}