{"uri": "http://www.democratandchronicle.com/story/news/2016/02/07/eight-people-shot-one-dead-mexican-village-night-club/79963268/", "title": "No arrests after 1 man dead, 7 hurt at State St. club", "dct": "Sun, 07 Feb 2016 00:00:00 GMT", "id": "322271d0170094bcb241d4ee2cdc35ae", "content": "More than three dozen people were to be interviewed after a fight spilled outside a Rochester nightclub early Sunday, leaving one man dead and injuring seven other people, including one woman.\nRochester police officers who were in the area around 2 a.m. heard gunshots and responded to the Mexican Village club at 547 State St., Police Chief Michael Ciminelli said at a news conference less than 12 hours later.\nCiminelli declined to identify any of the victims, including a 29-year-old city man who was pronounced dead at the scene.\nPolice initially reported that a 16-year-old male was injured, but Ciminelli said all the victims were between the ages of 21 and 30.\nSix other victims were found at various locations around the area and all were transported to Strong Memorial Hospital by Rural/Metro Medical Services. Ciminelli said a 26-year-old man was in guarded condition at Strong. He said the other people sustained injuries that were not life-threatening.\nPolice said an additional victim was not located at the scene, but was taken by private vehicle to Rochester General Hospital. A spokeswoman said that person, whom she would not identify by age or gender, was treated and released.\nCiting an ongoing investigation, Ciminelli declined to expand on a statement he read at the news conference. He said families still were being notified, and no names would be released.\nCiminelli said there were about 40 people in or near Mexican Village just after 2 a.m., when officers arrived, and they had to be interviewed. \"That's a large number of people, you can imagine,\" he said.\nThe chief declined to speculate on any physical evidence, including whether those who were shot were the only ones involved in the dispute, the number of people shooting, the number of shots fired or whether there was crossfire. He did say that preliminary indications were that shots were fired outside.\nOn State Street between Jay and Smith streets, approximately 70 evidence markers were visible on the east and west sidewalks, as well as in both lanes of the road. Ciminelli would not say whether any guns had been recovered.\nThat stretch of State Street was reopened early Sunday evening.\nCiminelli said he was not aware of any officers responding to the bar on Saturday night or Sunday morning, but the chief said there had been previous calls for service and that the bar has been assessed nuisance points a few months ago.\nHe declined to draw comparisons to a shooting in April 2015 at the Gates Pub that left one person dead and six others wounded.\nIn his statement, Ciminelli said there was no reason to believe the general public is in any danger relating to the Mexican Village incident.\n\"This was not a general act,\" he said in response to a question about public safety. \"It stemmed from a dispute between parties in a single location.\"\nAs for law-abiding people who get caught up in violence when it happens in public, Ciminelli said, \"I think we all have to be alert to the situation around us, and be cognizant of our safety and prudent.\"\nThe Mexican Village shooting occurred less than a month after a quadruple homicide in a home on Leighton Avenue; police offered no new information on that case. In 2015, the number of shooting victims in the city was up 20 percent over 2014. There were 35 homicides last year, compared to 32 in 2014.\nAsked whether Rochester has a problem with mass violence, Ciminelli said, \"Any violence, whether mass or in singular units, is too much. Right now, every resident in the city of Rochester should not accept this. It's intolerable to all of us. We need to work together to make it stop.\"\nCity Councilman Adam McFadden, who represents the South District and is chairman of the Public Safety, Youth & Recreation Committee, was at the scene at midmorning.\n\"This is becoming like watching a bad rerun movie where you know the outcome,\" McFadden said. \"This is not a police problem but it's a problem with our citizens, at least some of the folks in our community who think they can solve problems with violence and gunplay. … You're talking about cowards who think this is the only way they can solve problems. We have a problem not just in our community but all over the country with people having guns who shouldn't have them.\"\nMcFadden said the problem was beyond the scope of anything City Council could legislate. In his impromptu news conference outside the crime-scene tape that blocked off State Street, he talked about the impact that people who don't value life have on the rest of the community.\nHe said the homicides in the city \"paint a really bad narrative about who we are and the fact that we have individuals in our community who think (violence) is OK, and it's not.\"\nIn a written statement handed out at Ciminelli's news conference, Mayor Lovely Warren had one question.\n\"Yet again, someone in Rochester reached for a gun to resolve a conflict,\" she wrote. \"And yet again, another life is lost, innocent people are injured, families are devastated and our entire city is suffering. Yet again, one senseless act makes us ask: Why?\n\"Why is it that some people can only use violence to cope with a situation? Why is a gun the tool of choice to settle a dispute that certainly cannot be worth the cost of so much suffering?\"\nIncludes reporting by staff photographer Max Schulte."}