{"uri": "http://triblive.com/news/armstrong/8878750-74/police-wednesday-kitchen?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29#axzz3iCKdRyk7", "title": "Police: Wounded Ford City boy's father left handguns on kitchen counter", "dct": "Fri, 07 Aug 2015 01:18:00 GMT", "id": "6fb2645de3da913827e5199480f0017e", "content": "The father of a 6-year-old boy critically shot Wednesday morning in Ford City left two handguns on the kitchen counter Tuesday night and was upstairs sleeping when the accident occurred, state police said.\nPolice said that Isaac Deemer was accidentally shot by his brother.\nIn search-warrant paperwork, Trooper Terry Geibel said Christopher McNeely, the homeowner and boy's father, told police that he had left two handguns lying out on the kitchen counter.\n“The father stated that he normally leaves the weapons loaded but does not keep (a bullet) in the chamber,” Geibel wrote.\nGeibel said Issac's stepmother, Krista McNeely, knew guns were in the kitchen when she left Wednesday morning for work.\nPolice did not say whether charges will be filed.\nNo updated information on Issac was available Friday afternoon, police said. On Thursday, he was in critical but stable condition at Children's Hospital of Pittsburgh.\nThe incident occurred around 11:30 a.m. Wednesday at their father's home at 1123 Fourth Ave.\nAccording to police, Issac was shot with a 9-mm handgun near the left collarbone by his 9-year-old brother.\nPolice say the shooting was an accident.\nThe search warrant states that, Wednesday afternoon, investigators took guns and ammunition from the house, including:\n• Two pistols: A Ruger .380-caliber semi-automatic and a Ruger 9 mm.\n• Three rifles: A Stevens .22-caliber rimfire, a Remington .308-caliber and a Smith and Wesson .223.\n• Two shotguns: Both .410s.\n• More than 600 rounds of ammunition in all for most of the guns.\nPolice said a bullet is believed to have lodged in the kitchen wall, and another 9-mm bullet was found on the kitchen floor. From the kitchen, investigators recovered a 9-mm shell casing, lead shavings from a chair and a .380 semi-automatic pistol.\nNeither state police nor the Armstrong County District Attorney could be reached for comment.\nJulie E. Martin is a staff writer for Trib Total Media. She can be reached at 724-543-1303, ext. 1315 or jmartin@tribweb.com."}