{"uri": "http://www.wpxi.com/news/news/local/father-charged-sons-accidental-shooting-ford-city-/nnb8g/", "title": "Father, stepmother charged in son's accidental shooting at Ford City home", "dct": "Thu, 10 Sep 2015 11:07:00 GMT", "id": "95b7ed8ca88baabbaae2fa2d7f40b694", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nFORD CITY, Pa. - The father and stepmother of a 6-year-old boy who was accidentally shot by his brother at a home in Ford City in August have been charged, Channel 11’s Amy Marcinkiewicz has learned.\nAppearing with his attorney, Christopher McNeely turned himself into police Thursday morning. He was arraigned on charges of possession of a firearm by a minor, endangering the welfare of a child and reckless endangerment.\nHe was jailed on $20,000 bail.\nStories of the day...\nCrista McNeely, Christopher McNeely’s wife and stepmother of the boy, was also charged with endangering the welfare of a child, Channel 11 News has learned.\nhttps://twitter.com/WPXIAmy/status/642010338901291008Isaac\nDeemer was accidentally shot in the neck and shoulder area on Aug. 5 by his 9-year-old brother, police said.\nAccording to an affidavit of probable cause, Christopher McNeely and a third boy were sleeping in an upstairs bedroom of the home at the time of the shooting. Deemer and his 9-year-old brother were in the kitchen.\nThe 9-year-old told police that he removed a gun from its holster and was using the laser sight to play with the dog in the kitchen when his hand hit the trigger and the gun went off, according to the criminal complaint.\nSearch warrants were conducted at the home, and it was determined that two loaded guns were knowingly left out on a kitchen counter. The affidavit listed the guns as a Ruger .380 pistol with a laser sight and a Ruger 9 mm pistol.\nAccording to the criminal complaint, troopers also found five unsecured, unloaded long guns along with more than 8,600 rounds of ammunition in the 9-year-old’s bedroom. Additionally, troopers removed a shotgun with scope, a Smith and Wesson M&p 15, a Remington with scope and a second Ruger 9 mm handgun from the home as evidence during their investigation.\nMarcinkiewicz reported that Deemer is out of the hospital. Marcinkiewicz also learned that he has lost the use of one of his arms as a result of the shooting and will go to outpatient therapy.\nRELATED CONTENT:"}