{"uri": "http://www.pressdemocrat.com/news/6384843-181/lake-county-shooting-attack-takes?artslide=0", "title": "Lake County shooting attack takes fatal toll on family", "dct": "Fri, 02 Dec 2016 00:00:00 GMT", "id": "b779f0a640eab3d14719e5f5f981acb7", "content": "A 24-year-old man is to appear in court Monday to face murder and other criminal charges in connection with a ruthless attack on a Lake County family who reportedly stood in the way of his effort to terrorize the estranged mother of his children.\nFriends, family and authorities say Ezekial “Junior” Bravo was armed with a shotgun when he forced his way into the family’s home at the tiny Elem Indian Colony near Clearlake Oaks and began shooting early Thursday morning, killing 46-year-old Theresa Brown and injuring three other family members, including Brown’s 6-year-old daughter.\nA family friend has started a fundraising campaign to help defray medical and other costs related to the loss of Brown, a vibrant, well-loved mother of five children, ages 6 to 27.\nDeya Ammar, the close friend, said the family was grieving the death of Brown’s mother right before Thanksgiving. The bloodshed Thursday has added to their pain. Lake County sheriff’s Lt. Corey Paulich said Bravo refused to give authorities a statement in the wake of the incident.\nBut it appears Bravo was looking for a woman described as his wife — it wasn’t clear Friday if they were legally married — when he arrived at her mother’s home around 2:16 a.m. Thursday, angered by the younger woman’s recent decision to end their three-year relationship and seek full custody of two young children, neither of whom was present when the shooting occurred, family members and friends said.\nThe woman often sought refuge at her mother’s house during what family members said was an abusive relationship, so Bravo had reason to think she would be there.\nBut Brown, her aunt, and the young woman’s mother, Stephanie Brown, had her hide under a bed and stay there after Bravo burst in. She escaped the shooting unharmed. Authorities did not provide the woman’s name.\nBravo shot Theresa Brown in the face, spraying buckshot that struck her 6-year-old daughter, who reportedly used her slain mom’s cellphone to call her older brother for help, Ammar said.\nStephanie Brown and her husband, Robert Brown, also suffered gunshot wounds. Robert Brown lost a large chunk of his forearm, and his wife was hurt in the shoulder, then forced outside and into Bravo’s van, though she drove away and escaped when he went back inside.\nWhen Bravo returned, he left the area in one of the victim’s cars, though he soon abandoned it outside the rancheria.\nHe eluded authorities in the initial hours after the gunfire, during a search that included help from the Sonoma County sheriff’s helicopter crew. Someone at a local elementary school saw a public alert that included Bravo’s photo and told authorities that he was on the campus later Thursday morning.\nPaulich said it was possible he was trying to visit a family member who attends Pomo Elementary School, though it was not clear.\nBravo was arrested without incident and was being held on $1 million bail.\nChief Deputy District Attorney Richard Hinchcliff said Bravo would be arraigned at 3 p.m. Monday in the county courthouse at Lakeport.\nThe youngest victim suffered a broken arm and had pellets throughout her arm. She had surgery on Thursday and was being released from the hospital on Friday, Ammar said. Both of the injured adults also were reportedly in stable condition."}