{"uri": "http://wbbjtv.com/2016/12/26/deputies-investigate-fatal-christmas-day-shooting/", "title": "Deputies investigate fatal Christmas Day shooting; family demands answers", "dct": "Mon, 26 Dec 2016 00:00:00 GMT", "id": "6637695ed0d56b6b0b4a5465acfddbb8", "content": "HENDERSON COUNTY, Tenn. — Deputies say a man was killed in a Christmas Day shooting and a 15-year-old is a person of interest in the homicide investigation.\n“I’m doing a lot of praying right now,” Marilyn Cannon said. Family members describe this as a Christmas tragedy.\nThe Henderson County Sheriff’s Department says 23-year-old Julius Gray died after he was shot Sunday morning in a mobile home on Middleburg Road.\n“You kind of hope it’s not him because you didn’t see him, but you know it’s him,” Gray’s sister, Mary Smith Elrod, said.\nDeputies say the person of interest is a 15-year-old juvenile and that the incident happened while both of them were sitting on a couch.\nShe shared how investigators describe her brother’s death.\n“He was standing there pointing a gun at my brother, and he said ‘are you scared now,’ and my brother said ‘no, I’m not. I’m not afraid to die,’ and then he pulled the trigger,” Elrod said.\nThe family says Gray was staying at the mobile home and that his daughter is now without a father.\n“Her name is Abrianna, and that was his world,” his aunt Marilyn Cannon said.\nHis sister says she just saw her brother and the 15-year-old together before the holiday.\n“This boy ate Christmas dinner with my family Friday night,” Elrod said, referring to the teenager.\nNeighbors who didn’t want to go on camera said they believe the shooting was accidental.\nThe family disagrees. “I don’t call pointing a gun in someone’s face and pulling the trigger — I don’t call that an accident,” Elrod said.\n“Who lets a 15-year-old child have a gun?” Cannon said.\nDeputies say one shot was fired. They have not released a cause due to the open investigation.\n“We do want justice, but right now we would be appreciative to have some information,” Elrod said.\nThe District Attorney’s Office is reviewing the case. Deputies say charges could come later."}