{"uri": "http://www.statesville.com/news/deputies-iredell-teen-killed-in-accidental-shooting/article_d32ecb9a-a6cc-11e6-ae9c-0bd700b45675.html", "title": "Deputies: Iredell teen killed in accidental shooting", "dct": "Wed, 09 Nov 2016 00:00:00 GMT", "id": "76f7b1f29a276df03b255529bfe2d78f", "content": "An 18-year-old West Iredell High graduate was shot and killed by her boyfriend Monday with a gun he didn’t think was loaded, officials said.\nCortney Smith, 18, was pronounced dead at the scene after medical personnel were unable to revive her, according to Iredell County Sheriff’s Maj. Andy Poteat.\nPoteat said Smith’s boyfriend, Jason Rashon Tenor, 21, was handling a handgun left by a friend at a home in the 100 block of Tree Line Drive. The magazine was taken out of the gun, Poteat said, but the firearm was still loaded.\nPoteat said Tenor pulled the trigger intentionally, not thinking the gun would fire, and a bullet struck Smith.\nTenor, of Wedgewood Road, Statesville, has been charged with felony involuntary manslaughter.\n“There’s no indication that he intended to kill anyone or intended to hurt anyone,” Poteat said, adding that witnesses reported hearing the couple laughing together before the shot was fired.\nTenor called 911 after the shooting and was cooperative with law enforcement, Poteat said. Forensic analysis on the path of the bullet and how it was fired agreed with Tenor’s story, he added.\nDuring investigation, deputies discovered marijuana and drug paraphernalia on Tenor’s possession, Poteat said. Tenor was charged with possession of both, but Poteat said marijuana consumption is not believed to be a factor in Smith’s death.\n‘SHE HAD A GOOD HEART’\n“She was so down to earth,” said one of Smith’s friends, Dominique Painter. “You could call her, she would be there for you. She had a good heart.”\n“At first I was in shock. I felt numb.” Painter said. “I felt like I lost a part of me. ... I’ll miss almost everything. I’ll just miss being able to pick up the phone and call her.”\nAnother friend, Katie Underwood, said she grew close to Smith after she tried out for the cheerleading team her freshman year. Underwood was already a cheerleader.\n“I was speechless,” Underwood said about reading on Facebook that Smith had died. “I was kind of hoping it was just a dream.”\n“You know, whatever, people are just messing around. Cortney can’t be gone,” Beth Underwood said of her initial thoughts upon hearing the news.\n“We (had) just seen her about a month ago out at West Middle School and she came running up to me and gave me a hug,” Beth Underwood said. “I mean, I can just still see her smile while running across the parking lot to give me a hug.”\nBeth Underwood said their families were close, and that Smith often called her “mom.”\nThe Underwoods had difficulty keeping back tears while talking about the loss.\nDEPUTY STRESSES GUN SAFETY"}