{"uri": "http://www.news-journalonline.com/news/20161013/listen-to-call-deltona-man-rolls-over-on-gun-on-couch-friend-shot", "title": "LISTEN TO CALL: Deltona man rolls over on gun on couch, friend shot", "dct": "NODATE", "id": "135081a7894cf7c309aad1a3e1675c60", "content": "\"You could be dead right now, man! I'm so sorry.\"\nA man on a couch watching TV in Deltona was accidentally shot when a friend rolled over a pistol they had on the couch, deputies said.\nKenneth Schmidt, 26, took a .22LR hollow point bullet to his left bicep shortly after midnight Wednesday at the home he shares with Steven McCloud on Buccaneer Avenue, according to a Volusia County sheriff's report.\nMcCloud, 29, told a 9-1-1 dispatcher that he sleeps on the couch with the gun that accidentally discharged and struck his friend.\n\"We both heard this noise and neither of us knew what happened until we noticed the blood everywhere, and I was like \"Oh my God!\" McCloud told the dispatcher.\nIn between explaining what happened in the nearly 10-minute call with the dispatcher, McCloud can be heard apologizing to Schmidt.\n\"You could be dead right now, man! I'm so sorry,\" McCloud said, adding that he should've had the gun put away.\n\"Oh, goodness. This is not good,\" McCloud said during the call. \"I'm sorry about your pants. You got blood on your pants.\"\nMcCloud then asked Schmidt if the bullet was still in his arm.\n\"It's still in your arm, oh my goodness,\" McCloud said.\nThe dispatcher told McCloud that Schmidt would have to walk outside, which McCloud relayed to his injured friend.\n\"Unfortunately you have to get up and walk outside,\" McCloud told Schmidt.\nThe dispatcher told McCloud that Schmidt should only get up if he's able.\n\"He's able to,\" McCloud told the dispatcher, \"he just probably wants to smoke a cigarette or something before they take him.\"\nSchmidt was taken to Central Florida Regional Hospital in Sanford for treatment of the non life-threatening injury, deputies said.\nThe pistol discharged and the bullet struck Schmidt in the left bicep. The injury was non-life threatening and Schmidt was taken to Central Florida Regional Hospital in Sanford for treatment, investigators said.\nDeputies determined that the shooting was accidental, reports show."}