{"uri": "http://www.ksla.com/story/32590934/police-investigating-fatal-shooting-in-caddo-heights", "title": "Teen shot to death in Caddo Heights, reward offered for information", "dct": "Mon, 01 Aug 2016 19:37:00 GMT", "id": "817299e741b621d65e6397311d364b0c", "content": "SHREVEPORT, LA (KSLA) -\nA Crime Stoppers reward of $1,000 is being offered for information leading to an arrest in the fatal shooting of a teen in Shreveport's Caddo Heights neighborhood early Monday afternoon.\nOfficers were called to the 1400 block of Alma St just before 1:30 p.m., where the body of 15-year-old Desmon Bell was found inside a home.\nPolice say it appears the teen had suffered a single gunshot wound to the head. He was pronounced dead at the scene.\nInvestigators are working to determine what led up to the shooting and identify the gunman, who is believed to have fled the scene. The home has been searched, but authorities say they have not been able to confirm whether the shooting took place inside the home or elsewhere.\nFamily members of the victim tell KSLA it was an argument that led to the shooting that took the life of their loved one. Now, they said they want answers in this case.\n\"I think there should be justice for this,\" said the victim's cousin, Tearrica Moore. \"If a guy's sitting right in your house and he kills you in front of my little cousin, there should be justice.\"\n\"We want the killing to stop. All Lives Matter and it's fun and dandy when people are out there saying 'Stop the Killing' but when it happens to your family, then you're going to see how it feels because this is not a good feeling right now,\" she continued.\nLa'Troya Bellamy came home to bad news. \"I never expected to come to work and see this,\" she said. Bellamy knows Bell and remembers when he would come around her house and talk to them on the front porch a few years ago.\n\"This is just sad, I send my prayers and condolences to his family,\" Bellamy said.\nBellamy says she is tired of the violence in their community, \"I just hate to see teenage kids on the news losing their life to guns period.\"\nUnfortunately, Bellamy knows all too well what its like to lose a loved one to violence. \"I know the pain I know the hurt,\" she said, explaining that her step-brother and Kinyda Broadway's son Keandre, or better known as \"Keevis\" was killed in the same neighborhood at a nearby park last year.\n\"Everytime something happens in this neighborhood it brings back memory from my son,\" said Broadway.\nBroadway knew Bell and her heart breaks for his mother. \"I can pretty much feel her pain and what she is going through and having to bury her child.\"\nBellamy believes some teens need to learn a new way to solve their issues. \"From the pain of seeing my stepmother go through losing a child, I don't want to see a mother go through the pain of losing a child,\" she said.\nPolice are urging anyone with any information, regardless of how slight, to contact Crime Stoppers at (318) 673-7373 or visit them on their website at www.lockemup.org.\nThis is 27th homicide of the year in the city.\nCopyright 2016 KSLA. All rights reserved."}