{"uri": "http://ksnt.com/2015/04/02/tulsa-police-say-man-killed-his-wife-2-sons-then-himself/", "title": "Tulsa police say man killed his wife, 2 sons, then himself", "dct": "Thu, 02 Apr 2015 10:46:00 GMT", "id": "ffc000511d1dc8f0b1c180a12d1dc812", "content": "TULSA, Okla. (AP) — Police say a man apparently fatally shot his wife and two young sons before killing himself at their family home in Tulsa.\nSgt. Dave Walker said in a news release that a 42-year-old man, his 38-year-old wife and their 6- and 10-year-old sons were found shot to death Wednesday. Their names have not yet been released.\n“The evidence indicates that the father shot and killed the children and the wife before turning the gun on himself,” Walker said. “There is evidence of multiple gunshots throughout the house. All the bodies were found in different rooms throughout the house.”\nThere was no indication of forced entry and no suspects are being sought, Walker said.\nPolice Capt. Matt McCord said officers found a handgun near the man’s body. The woman’s employer requested a welfare check after she failed to show up for work or call in sick for two days.\nNeighbors said they were shocked by the events and called the area safe.\nMost every property in the neighborhood has a large fence, so children can play or swim in privacy, though some play hoops in the driveway or at a cul-de-sac.\n“I love this neighborhood. It’s very quiet here,” Mercedes Perez told The Associated Press.\nCopyright 2015 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}