{"uri": "http://newyork.cbslocal.com/2014/10/12/10k-reward-offered-in-stray-bullet-killing-of-irvington-nj-toddler/", "title": "Authorities Looking For 3 Men In Stray-Bullet Killing Of NJ Toddler", "dct": "Sun, 12 Oct 2014 18:45:00 GMT", "id": "4d490d4a3935541947fcc6256f692521", "content": "IRVINGTON, N.J. (CBSNewYork/AP) — The family of a 15-month-old girl who was killed by a stray bullet inside her home Saturday had just moved into the Irvington apartment two days before, authorities said.\nEssex County Acting Prosecutor Carolyn Murray told reporters Sunday outside the home at 84 Ellis Ave. that police are looking for three men who were wearing black hooded sweatshirts and fired their handguns multiple times, striking two homes and a vehicle.\nOne of the bullets penetrated a wall of the family’s second-floor apartment and struck Sania Cunningham while she was bouncing on a bed with her parents nearby, WCBS 880’s Monica Miller reported.\nSania was shot in the torso just after 4:30 p.m. Saturday and then taken to Newark Beth Israel Medical Centerl, where she was pronounced dead about a half-hour later.\nAuthorities said they do not believe the Cunninghams were the intended target. Police and prosecutors are offering a $10,000 reward for information leading to an arrest and conviction.\nAccording to witnesses, the shooters fired a hail of bullets, CBS 2’s Janelle Burrell reported.\nOne bullet hit Barbara Motley’s SUV.\n“I had not too long ago got out of the car,” she said.\nTwo others struck a window and an air conditioner in Issam Houston’s home, inches from where his mother sleeps.\n“It went right to the left side of her headboard right behind her dresser,” he said.\nEarlier Sunday, Anthony Ambrose with the Essex County Prosecutor’s Office told Miller investigators were talking to witnesses and looking through surveillance video in their search for the shooter.\n“There were several shots that were fired on the block,” Ambrose told Miller. “There were several ballistic evidence that were recovered. One bullet did pierce the house that pierced the baby.”\nNeighbor Darryl Bailey, who had to be escorted to his home because of the investigation, said drug violence is a big problem on Ellis Avenue.\n“This is sickening,” he said. “If you can’t actually be safe in your home, where you can actually be safe at?”\nNeighbors said it’s especially disturbing that the shooting happened during daylight hours.\n“Once you found out, it was like, ‘Wow, that’s real sad,'” said Chris Johnson. “And this was in daytime — broad daylight this happened.”\n“It’s a shame, man,” Dwayne Harrison said. “You can’t do anything. You’re in your apartment. You’re behind your walls. You’re trying to protect your family.\n“It’s a shame that, one, for gunshots to keep happening,” Harrison added. “Nobody really wants to do anything about where the guns are coming from.”\nMinister Thomas Ellis, of Newark, doesn’t know the family, but he stopped by Sunday to put an orange sign outside the home that reads “Enough is Enough!”\n“Whoever done this here, please turn yourself in,” he said.\nInvestigators said it will take the public’s help to solve the case, and are urging anyone with information to come forward.\nYou May Also Be Interested In These Stories"}