{"uri": "http://pix11.com/2014/10/11/15-month-old-girl-shot-to-death-in-new-jersey-apartment/", "title": "15-month-old girl killed by stray bullet in New Jersey", "dct": "Sat, 11 Oct 2014 19:24:00 GMT", "id": "8ae1494c7904d97126b5157618d3db5c", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nIRVINGTON, N.J. (PIX11) -- A 15-month-old girl was shot and killed in New Jersey Saturday, authorities said.\nIt happened about 4:30 p.m. while the toddler was with her parents in their apartment on Ellis Avenue in Irvington, about 12 miles west of Newark, according to the Essex County Prosecutor’s Office.\nInvestigators said it appears that a bullet pierced the side of the family's second-floor apartment and struck the child. Her parents rushed her to the hospital where she soon was pronounced dead.\nResidents were devastated but not surprised by the shooting.\n“Bullets don’t have a name and these people don’t care. They just -- it’s a wild life out here. It’s just sad,” neighbor Maria Lopez said.\nEarl Carter called the neighborhood “drug-infested” and said rival groups have been fighting over territory for years. He said the gun violence nearly took his own life recently. He stepped out of his car one night to see bullets fly his head.\n“I could feel the vibrations, the bullets were that close,” Carter recalled. “What do you do? You don’t know whether to get up, get down. It’s sad.”\nAs news of the shooting spread, members of a Newark community organization arrived on the block to demand change.\n\"When you hear a 15-month-old child whose life has been cut short because of senseless violence, it is time for a national call,\" said Donna Jackson, spokeswoman for NJ Monitor said.\nNo arrests have been made and a motive has not been established in the shooting.\nA $10,000 reward has been posted for information leading to the arrest and conviction of those responsible for this tragedy.\nAnyone with information is urged to call the Essex County Sheriff's Crime Stoppers at 973-877-TIPS."}