{"uri": "http://6abc.com/news/dad-of-toddler-who-shot-self-warned-about-guns-records-show/1530187/", "title": "Dad of toddler who shot self warned about guns in the open, records show", "dct": "Wed, 28 Sep 2016 00:00:00 GMT", "id": "1504994388e7e4a68e16a33eb83b6b38", "content": "MILFORD TWP., Pa. (WPVI) --\nThe father of a two-year-old who was shot and killed at a home in Bucks County is being charged in the child's death.\nNicholas Wyllie, 26, was arraigned on Wednesday afternoon on charges of Involuntary Manslaughter, Endangering the Welfare of a Child and Recklessly Endangering Another Person.\nWyllie had no comment as he arrived for an arraignment in the death of 2-year-old Benjamin Austin Smith.\nPolice say September 12th, the toddler was home alone with his dad, found a loaded gun and accidentally shot himself.\n\"This is a terribly tragic death and the worst part about it is that it was 100 percent avoidable,\" said Bucks County DA Matt Weintraub.\nAccording to court documents, Wyllie and Benjamin were watching TV in the living room, when the 2-year-old told him he was going to watch a cartoon in his own room.\nMoments later the dad says he heard a bang. The toddler never made it to his bedroom but instead stopped in his dad's room where he found a loaded .45 caliber handgun and pulled the trigger.\nWyllie found his son face up, bleeding on the floor. He was pronounced dead at the hospital.\n\"The defendant is going to be serving a life sentence regardless of what happens to him criminally, and that is the terrible tragedy here,\" said Weintraub.\nCourt records show that family members warned Wyllie not to leave guns out in the open.\nIt was also revealed that two year old Benjamin loved toy guns. His family says he had plenty, and many of them looked real. They also admit they taught him how to properly hold a pistol.\nSeptember 12th, young Benjamin found that gun that his father kept in his nightstand but this time it was no toy. The toddler was produced dead at the hospital.\n\"This is no accident, this was an unintentional death certainly, but if you are going to leave a loaded gun out there for your little 2-year-old son to grab and this is the result, this is not accident,\" said Weintraub.\nWyllie was released on his own recognizance."}