{"uri": "http://www.swnews4u.com/section/170/article/25248/", "title": "Youth dead after shooting incident", "dct": "Fri, 02 Jan 2015 15:59:00 GMT", "id": "0d29238151da811830934ac7f9e9962e", "content": "1 of 1 View Larger\ngoogletag.cmd.push(function() { var slot1 = googletag.defineSlot('/48917004/Article_Page_300x100_Top', [300, 100], 'widgetid_5672-doubleclick').addService(googletag.pubads()); // loop to generate key-value pairs for targeting googletag.pubads().setTargeting('website', 'news'); googletag.pubads().setTargeting('article', '20906'); googletag.pubads().setTargeting('section', '170'); googletag.pubads().setTargeting('uri', '/archives/25248/'); googletag.enableServices(); }); googletag.cmd.push(function() { googletag.display('widgetid_5672-doubleclick'); });\nUPDATE 8:30 PM, JAN. 3 - Grant County Sheriff Nate Dreckman identified the three victims of yesterday afternoon's shooting in Montfort during a press conference held in the Grant County Jail's training room earlier this evening.\nThe deceased has been identified as Jaxon Slaight, 6. His mother, 27-year-old Morgan Slaight, and his brother, 8-year-old Joseph Slaight, also suffered gunshot wounds. Morgan and Joseph are in critical but stable condition at UW-Madison Hospital this evening.\n\"At this time this matter continues to be handled as a homicide investigation,\" Dreckman said. \"There are several pieces of crucial evidence that will be processed at the Wisconsin Crime Laboratory that will assist in determining exactly what occured yesterday afternoon.\n\"This process may take several weeks to complete.\"\nAlthough no suspect was named, Dreckman reiterated there is no threat to the public at this time.\nThe Slaights have been living in Montfort a short time, Dreckman said. He believes the family lived in Edmund prior to moving to Montfort.\nDreckman was asked if murder-suicide was a possible motive for the crime.\n\"As with any investigation, all possibilities are considered,\" Dreckman said. \"Until we make that final determination, we are open to all considerations, absolutely.\"\nJaxon and Joseph's father is not a person of interest in the case, Dreckman said, nor is another couple living in the Montfort home.\nUPDATE 6:17 PM - Grant County Sheriff Nate Dreckman has released the following information about the fatal shooting that took place in Montfort earlier Friday.\n\"On January 2, 2015 at approximately 3:21pm, the Grant County Sheriff’s Office was notified of possible gunshot victims inside a residence in the Village of Montfort. Deputies responded to the scene and found 3 victims with gunshot wounds. One 6 year old victim was deceased at the scene. An 8 year old and an adult female victim were Medflighted to Madison. At this time there is no information indicating a threat to the community.\"\n\"This case is currently being investigated and additional information and names will be released at a later time.\"\nBecause of the ongoing investigation, no more information will be released at this time.\nORIGINAL POST 3:59 p.m. - Authorities are on the scene of a reported multiple shooting in Montfort.\nFennimore, Highland and Montfort EMS were dispatched to the scene, as well as Montfort firefighters for traffic control around what was described on police radio as the \"crime scene.\"\nThe call was reported around 3:20 p.m.\nRead Southwest Wisconsin Newspapers and www.swnews4u.com for more on this story."}