{"uri": "http://sanfrancisco.cbslocal.com/2016/03/12/oakland-drive-by-shooting-party-bus-near-bay-bridge/", "title": "4 Wounded In Oakland Drive-By Shooting Of Party Bus Near Bay Bridge", "dct": "Sat, 12 Mar 2016 11:02:00 GMT", "id": "c0fc6e079a8ae63f380915a559a6e76a", "content": "OAKLAND (CBS/AP) — Gunmen fired shots into a moving party bus in West Oakland early Saturday, wounding four and leaving authorities stumped because passengers refused to cooperate with the investigation.\nThe chartered executive limo bus was leaving San Francisco and had exited the Bay Bridge around 2:25 a.m. and was on the eastbound Interstate Highway 80 transition to southbound Interstate 880 when two gunmen in a red SUV drove alongside and opened fire, said California Highway Patrol Officer Daniel Hill.\nA fourth passenger sustained was hurt critically but was stable and is expected to survive. Three others had minor injuries.\nInterstate 880 was closed for roughly five hours as officers investigated.\nPassengers adamantly refused to give witness statements or provide descriptions of the shooters, authorities said.\n“In fact, they didn’t cooperate so much that one of our officers got assaulted and kicked by one of the victims,” Hill said.\nA female victim hit by a ricochet also got into an altercation with emergency medical personnel and forced her way out of an ambulance. She fled and her whereabouts are unknown.\nInvestigators say the bus was occupied by couples but Hill could not provide an estimate of how many people were on the bus. He declined to release names and ages of the wounded.\n“I will say we don’t believe this is a random incident,” he said.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nThe incident is the eighth freeway shooting in the East Bay since November. Officers have blamed the shootings on an escalating gang war in the Richmond area where six of the shootings have taken place.\nFreeways are appealing because there are fewer surveillance cameras and easy getaways.\nHill said the CHP does not believe Saturday’s shootout is specifically related to the other freeway shootings.\n© Copyright 2016 The Associated Press. All Rights Reserved. This material may not be published, broadcast, rewritten or redistributed"}