{"uri": "http://www.houmatoday.com/article/20160122/articles/160129898?p=1&tc=pg", "title": "Indictments issued in quadruple shooting, drug conspiracy", "dct": "NODATE", "id": "95a2d20d57769f7819c5b6e29d45ed4a", "content": "A grand jury has indicted two Houma men accused of killing an 18-year-old in a drug-related quadruple shooting and an area family accused of peddling heroin over the last four months.\nA grand jury has indicted two Houma men accused of killing an 18-year-old in a drug-related quadruple shooting and an area family accused of peddling heroin over the last four months.\nProsecutors found enough evidence Thursday to charge Square Wolfe Lane residents 22-year-old Elward Williams and 25-year-old Anthony Sylvester with the second-degree murder of Prince Collins Street resident Corey Butler.\nWilliams, who has a criminal record, was also charged with illegal carrying of a weapon, records show.\nButler was shot dead after a fight broke out between him and four other men on Morgan Street the evening of Oct. 28. Police said it may have been a fight over drug territory.\nThe shooting, which started out with several of the men drawing guns at each other, also left Sylvester injured in various parts of his body, a 25-year-old man shot in the face and a 19-year-old man shot in the shoulder. Police arrested Sylvester upon his release from a local hospital.\nWilliams managed to run away without any injuries, but police later caught up with him in Baton Rouge where he was arrested Oct. 30.\nWilliams is set to enter his plea Jan. 27 and Sylvester is expected to follow two days later, court records show.\nThroughout the first week of January, police also served arrest warrants on 32-year-old Lafayette Street resident Ryan Austin, his twin sister Ryaneshia Austin and four of their cousins, alleging their involvement in a parish-wide drug racketeering conspiracy. Three men unrelated to the Austins were also arrested as part of the scheme.\nProsecutors indicted Ryan Austin, Ryaneshia Austin, Zena Austin, Guillian Austin, Que Austin, Shaun Austin, Elvin Mills, Chance Franklin and Damari Franklin on racketeering charges Thursday.\nRyan Austin was indicted on a nine charges: two counts of racketeering, three counts of heroin distribution in three separate incidents, money laundering, possession of controlled dangerous substances while in possession of a weapon, possession of firearm as a convicted felon and possession of a stolen firearm.\nDeputies said that Ryan Austin threw a loaded semi-automatic pistol out the back window of his home and tried to throw out a travel bag that contained heroin, methamphetamine, cocaine, liquid codeine and prescription pills, before he was arrested.\nMills, Ryaneshia Austin, Zena Austin, Guillian Austin, Que Austin and Chance Franklin were indicted on heroin distribution charges. Mills, Que Austin, Zena Austin, Chance Franklin, Damari Franklin received additional racketeering charges.\nIn addition, Mills was charged with money laundering, possession of controlled dangerous substances while in possession of a weapon and possession of a stolen firearm, prosecutors said.\nArraignment dates vary for the defendants in the drug racketeering case and will be set in the next few weeks.\nStaff Writer Maki Somosot can be reached at 857-2208 or maki.somosot@houmatoday.com. Follow Maki on Twitter at @mdlbsomosot."}