{"uri": "http://pilotonline.com/news/local/crime/chesapeake-cop-shot-killed-by-son-in-double-homicide-sunday/article_418c069e-8f6c-5a02-b649-43a4ef9d58f1.html", "title": "Son charged in double homicide of Chesapeake cop, brother; mother released from hospital", "dct": "Mon, 08 Aug 2016 00:00:00 GMT", "id": "e9fb14b58ee896a19f97b401337f36ed", "content": "The Toothman family’s impact on their community was like that of a pebble thrown in the water, one neighbor said. All the good they did had a ripple effect on those around them.\n“All of us in the neighborhood loved everyone in the Toothman family,” said Marianne Murphy, who lives across the street from them in eastern Great Bridge. “They were so loved, so respected. If you wanted the ideal family, that was them.”\nThat’s why news that 20-year-old Zachary Toothman has been charged with fatally shooting his father, longtime Chesapeake police Detective Michael Toothman; killing his 17-year-old brother, Matthew; and wounding his mother, Susie, was particularly difficult for them to comprehend.\nToday is a very sad day for the Chesapeake community, with a heavy heart I send prayers to the toothman family, and friends❤️😞\n— Brooke Gerlach (@brookegerlachh) August 7, 2016\n“It’s just unthinkable,” said neighbor Lesley Summers, who has known the Toothmans for about eight years and lives a couple of doors down. “They were very sweet, very community-oriented, great neighbors.”\nThe story sounded eerily familiar in Chesapeake, which reeled in January from a similar-sounding case. Cameron Dooley, 26, shot and killed five family members including his father, retired Chesapeake policeman Steven Todd Dooley, in their home in Deep Creek. Cameron Dooley then killed himself.\nTodd Dooley, 50, had retired in November after a 25-year career.\nEarly Monday morning, Zachary Toothman was arraigned in Chesapeake Juvenile and Domestic Relations Court on two counts of first-degree murder, one count of attempted murder and three counts of using a firearm in the commission of a felony. He had recently completed his sophomore year at Virginia Tech.\nHe appeared calm as he entered the courtroom wearing an orange Chesapeake City Jail jumpsuit, with his feet and hands shackled. Speaking clearly, he asked the court for an attorney.\n“I don’t know how much I have to hire a lawyer, but I would like one,” he said.\nToothman told Judge Eileen Olds that he was not working. The judge assigned Assistant Public Defender Terence P. Martin to handle the case. A preliminary hearing is set for Dec. 6. No bond was issued.\nMy heart is so broken right now. Please please keep the Toothman family & the Hickory High community in your prayers.\n— Andolyn Medina (@andolynmedina) August 8, 2016\nPolice were called to the Toothmans’ home in the 600 block of Helen Ave. shortly after noon on Sunday and found two people dead from gunshot wounds and another injured. Court documents identified the dead as Michael Toothman and Matthew Toothman, and the wounded person as Susan Toothman.\nSusan “Susie” Toothman was taken to Sentara Norfolk General Hospital and released several hours later, at about 11 p.m. Sunday, said Kelsea Smith, a communications adviser for Sentara.\nTwo neighbors said they became aware of the situation when they saw police running down the street with guns drawn. Afterward, they saw Susie Toothman lying in the front yard being treated by a couple of neighbors at first, and then by emergency responders.\nThey also saw Zachary Toothman standing outside the house before he was taken away by police.\nHearts heavy for hickory and the rest of the Hampton roads family. Rest in peace Matt and Micheal Toothman\n— Isaac Feld (@isaac_feld) August 8, 2016\nIn the spring, Zachary completed his second year at Virginia Tech, where he was majoring in computational modeling and data analytics, spokesman Mark Owczarski said in an email.\nHe was a member of the Naval ROTC program but was placed on academic probation and later on an academic leave of absence after failing to meet the program’s minimum 2.5 GPA, said Lt. Sean Brophy with Naval Service Training Command. Toothman was waiting to be processed out of NROTC and was no longer receiving the program’s scholarship or training, Brophy said.\nHe is no longer enrolled at Virginia Tech, Owczarski said.\nMichael Toothman was a well-liked and highly respected member of the Chesapeake Police Department for 30 years, said Ravi Sheth, an assistant public information officer for the department. He had worked in most every part of the detective bureau, Sheth said.\nHe also served as a member of the SWAT team and honor guard, and was a firearms and CPR instructor, youth service officer and master police officer, Sheth said.\nIn 2014, Chesapeake Mayor Alan Krasnoff praised Toothman and a Chesapeake police sergeant for helping save the life of a man in Maryland. Toothman and the other officer were chaperoning a Hickory High School band trip when they saw a man collapse and performed CPR until an emergency crew arrived.\nFor the past eight years, Toothman taught criminal justice at ECPI University in Newport News and Virginia Beach, said David Brandt, director of communications for the school.\n“He brought the classroom to life in his Criminal Justice classes with his real world experience in law enforcement,” Brandt said in a statement.\nNeighbors described the Toothmans as a tight-knit, loving and very social family who were liked by everyone in the neighborhood. Both boys were involved in band at Hickory High School, and their mother has been an active member of the PTA and served as president of the organization.\nMichael Toothman was planning to retire from the Police Department soon, they said.\n“They lived for each other,” said Greg Branigan, who lives next door. “Whenever you saw one, typically you saw all four of them. Mike and Susie’s world revolved around those two boys.”\nThe sons were polite and respectful, neighbors said. Susie Toothman recently posted online a senior class photo of Matthew, who was scheduled to start his senior year at Hickory High School in the fall, said June Carillon, who runs a hair-cutting business out of her home nearby and has given haircuts to all the Toothmans.\n“Her boys were everything to her,” said neighbor Teresa Foreman. “She was super proud of them.”"}