{"uri": "http://cnycentral.com/news/local/chief-fowler-to-give-update-on-double-homicide-that-claimed-lives-of-two-brothers", "title": "SPD Chief: Brothers killed were lured to Grant Ave, shot during robbery; 3 arrested", "dct": "Thu, 12 Jan 2017 00:00:00 GMT", "id": "47e2f0a4344b109b1263270cc4582ed5", "content": "SYRACUSE, N.Y. — Syracuse Police Chief Frank Fowler says the two brothers who were fatally shot on Grant Avenue on Tuesday had been lured down there to be robbed.\nDuring a news conference Thursday morning Chief Fowler announced the arrests of three suspects, all of whom are facing murder and attempted robbery charges.\nThe suspects have been named as 17-year-old Sheahonnie Davis, 19-year-old Toriano Newson and 23-year-old Curtis Paige III.\nNewson is accused of firing the shots that killed 17-year-old Daniel Diaz-Marrero and 19-year-old Ismael Diaz-Marrero, and has been charged with two counts of first-degree murder and first-degree attempted robbery. Davis and Paige have been charged with two counts of second-degree murder and first-degree attempted robbery. All three suspects are being held at the Onondaga County Justice Center.\nCourt documents indicate the victims were lured to Grant Avenue to meet with Davis through text and Facebook messages. When they arrived the two other suspects, Newson and Paige, approached them attempted to rob them. During the attempted robbery, Newson shot both Daniel and Ismael, according to Chief Fowler. Court documents say several shots struck Daniel Diaz-Marrero in the chest \"at close range\" and a single shot struck his brother Ismael in the chest.\nThe felony complaints filed against Newson and Paige charge that the trio had lured the victims to Grant Avenue with the intent to forcibly steal marijuana from them.\nThe incident was no accident, according to Chief Fowler. He says all three suspects knew each other - Davis and Newson had a previous relationship and both were acquainted with Paige - and had plotted to commit the robbery ahead of time. Chief Fowler added that there doesn't appear to be any particular reason why they targeted the Diaz-Marrero brothers.\nChief Fowler says the weapon used has not been recovered as of yet, but emphasized that the investigation is still ongoing. He also made a plea to any witnesses who may have witnessed the crime to contact police at 315-442-5222.\nSyracuse Police were called to the 300 block of Grant Avenue to reports of a shooting at about 5:04 p.m. Tuesday. When they arrived, Officers found two adult males suffering from gunshot wounds.\nOne victim was pronounced dead at the scene, the other was taken to Upstate University Hospital in critical condition where he succumbed to his injuries.\nIn a post on Facebook, Le Moyne President Linda M. LeMura, Ph.D., said Ismael was a sophomore business student a Le Moyne. A remembrance was held Wednesday afternoon in the Grewen Auditorium.\nSyracuse City Schools Spokesperson Michael Henesey says Daniel was a senior at Fowler High School. The district's crisis response team will be at the school to help grieving students and staff. His older brother Ismael graduated from Henninger High School in 2015."}