{"uri": "http://www.timesfreepress.com/news/local/story/2013/jul/15/regulate-event-halls-say-critics/113281/", "title": "Regulate event halls, some critics in Chattanooga say", "dct": "Mon, 15 Jul 2013 00:00:00 GMT", "id": "6f23f502d1048361b0b527020fcb2667", "content": "Photo by Tim Barber /Times Free Press.\nTwo Eastside event halls known for fights, shootouts and killings might pose fewer problems if they were under city regulations, some local leaders say.\nEmotion Event Hall on Dodds Avenue and an unnamed building at 2510 E. Main St. aren't required under present law to get a beer permit for functions they host, said Chattanooga Police Chief Bobby Dodd.\nTraditionally, the board provides a check on businesses that serve alcohol, revoking licenses when there is trouble and often putting the offender out of business.\nHowever, after several shootings left three dead and many injured outside the halls, officials are exploring whether local codes should be changed.\n\"We realize this is an issue and we are currently looking into what options are available to us,\" said Lacie Stone, Chattanooga Mayor Andy Berke's spokeswoman.\nGary Ball, former president of the Ridgedale Community Association, said neighbors have been vocal about the need for more regulations on the venues.\n\"I think we go back to the alcohol code and try to bring it up to 2013. There has to be some kind of responsibility on people who want to run these event halls,\" Ball said. \"It's just like having a saloon in Dodge City in 1872. It's an archaic law the police acknowledge they can't operate under.\"\n•••\nDisorders involving weapons, shootings and loud music are among the types of complaints that send Chattanooga police officers to the venues that are just blocks apart.\nEmotion Event Hall at 1622 Dodds Ave., also called Da Building, is near a day care center and a church.\nRecords show 63 police responses since 2010, including 10 for fights or disorders, four for shots fired, 15 for a burglary alarm and 13 for loud music.\nOn July 5, a shooting left 21-year-old Ladarius Daniel dead and another man wounded. A juvenile was shot and killed several years ago.\nThe East Main Street venue has been known as The Wet Bar, The G Spot and Boo Coe's Sports Bar and Grill, county records show. Police have been called there 43 times since 2010, including eight times for disorders or fights and once for a 2010 shooting in which at least four people were wounded.\nOn June 23, 19-year-old Demetrius Davis was killed and three men -- including two 126 Athens Park Blood gang members -- were wounded near the hall.\nOn June 11, a 31-year-old man was shot and wounded.\nOn April 2, 28-year-old Desmond McClure was killed in a shooting outside the hall.\nEven with the recent events, Dodd said it takes a pattern of calls and an investigation to prove that a business is a nuisance and should be shuttered.\n\"It's still not enough to get it shut down,\" he said.\nIn the vast majority of cases, officers rush to answer calls for fights or shots fired but arrive to find no one there, he said. The calls get relabeled as miscellaneous. They don't hold up in court.\n\"There's not a whole lot the officer can do if they can't prove there was an assault,\" Dodd said.\nThe fire marshal and code enforcement inspectors also examine bars looking for violations.\nA city email stated there was no reason to close down the venue at 2510 E. Main St.\n\"There were no major violations found from our codes enforcement side. It does appear that minor issues are being corrected. ... Their findings along with the Fire Marshal found no justification for an E-Team inspection of the facility at this time,\" the email from the Department of Neighborhood Services and Community Development stated.\n•••\nThe city's alcohol laws were adopted in the late 1970s and early 1980s.\nOne provision states that anyone who purchases a case of beer -- 24 beers -- from a retailer for a venue must submit his name and address to the police chief by noon the following business day. Anyone who buys more than three cases of beer must get a permit from the chief.\n\"I've never had anyone send me one of these,\" Dodd said.\nDexter Staples, who owns Da Building, said in a previous interview that no more than three cases are allowed at his business. He said there was security and the venue was closed when the latest shooting happened.\nBall is skeptical about the amount of beer in the event halls.\n\"Nobody counts how many beer cans are there at 2 a.m.\" he said.\nDodd believes problems arise because the venues sometimes are used as after-hours clubs.\n\"The problems start usually when people leave other locations at 3 a.m. They have already been drinking or using drugs. They all go to a central location that's open till five or six o'clock in the morning. And you've got people from different parts of town, people from different gang associations,\" Dodd said.\n\"My suggestion is going to be anybody who is in the entertainment business, whether it's an event hall, a music hall, a club, bar or whatever, they close down at 3 o'clock.\"\nKen Crisp, who owns Lindsay Street Hall just off of M.L. King Boulevard, said he has no problem with a 3 a.m. closing.\nCrisp, who has a beer permit for his business but does not sell beer, said guests bring their own alcohol for his staff to serve.\n\"We typically have a high-end client who spends $15,000 to $75,000 for a wedding. ... For the most part, our typical party ends around 11 p.m. or 11:30 p.m. at the latest. We are lucky in that regard,\" he said.\nIn the meantime, Ball hopes local laws can be restructured so event halls have to have permits.\n\"It's time for everybody who has a vested interest in this to sit down,\" Ball said. \"We're just talking about something that has checks and balances.\"\nContact staff writer Beth Burger at bburger@timesfreepress.com or 423-757-6406. Follow her on Twitter at twitter.com/abburger."}