{"uri": "http://www.timesfreepress.com/news/local/story/2013/jun/25/625-b1-gang-members-among-victims-of-shooting/111638/", "title": "Gang members among victims of Chattanooga shooting", "dct": "Tue, 25 Jun 2013 00:00:00 GMT", "id": "e8ad1f1fdac3ad4ba45b74b787e9b03b", "content": "A 19-year-old man is dead and three other men were wounded -- including gang members -- after a shooting Sunday.\n\"We were just standing out there talking. Just chilling a little bit,\" said Jimmy McCane, 30, who authorities say is in the 126 Athens Park Blood gang. \"I heard gunshots. I got grazed a little bit, and I just laid down.\"\nMcCane was grazed on his torso. Ladarrel Bradley, who is also a documented member of the same gang, was with McCane near the corner of Dodds Avenue and Main Street when the shooting took place at 3:40 a.m. Sunday.\nDemetrius \"Meechy\" Davis, 19, died from his wounds. Dominique \"Dee\" King, 21, was shot in the leg. Police took King into custody for violating his probation.\nWhen McCane was asked if he thought his gang membership had something to do with the shooting, he said, \"I doubt it. 'Cause I ain't be having no problems with nobody. I really couldn't say if that was the reason.\"\nHe said the gun sounded like a semiautomatic and he doesn't know who the shooter was or the motive.\n\"The shots were coming back to back,\" he said. \"It just happened so fast. He shot a lot of times though.\"\nMcCane said he was on the way to a nearby club when the shooting happened. The four were shot near a laundromat at 1501 Dodds Ave.\nDavis posted on his Facebook page that he recently was hired for a job.\n\"[T]hem long nights an my granny prayers paid off, time to leave ... da streets. #blessed,\" he posted.\nDavis had 2,380 friends.\nFriends and family members continued to post messages mourning his loss.\n\"I lost my son last night, my heart is so heavy right now!! Tears can't stop rolling down my face!!\" said Mona Davis, Davis' mother, who lives in Atlanta.\nAs of Monday afternoon, no arrest had been made in the shooting.\nThis year, the city has had 65 shooting incidents that resulted in death or injury with 75 victims, according to data collected by the Chattanooga Times Free Press.\nThere have been 14 homicides. Of those, nine were the result of gun violence.\nAnyone with information about the latest shooting is asked to call Chattanooga police at 423-698-2525.\nContact staff writer Beth Burger at 423-757-6406 or bburger@timesfreepress.com. Follow her on Twitter at twitter.com/abburger."}