{"uri": "http://www.ksla.com/story/33019039/father-of-man-accused-of-fridays-deadly-shooting-speaks-out", "title": "Father of man accused of Friday's deadly shooting speaks out", "dct": "Tue, 06 Sep 2016 03:52:00 GMT", "id": "5e46a7ce6b78c776d2054150bff81937", "content": "WICHITA FALLS, TX (KAUZ) -\nWICHITA FALLS, TX (KAUZ) -\nJust one day after the man accused of killing a 13-year-old girl and wounding another was arrested, his father is speaking out.\nAs Kody Lott’s dad attempted to hold back tears, he said this is a nightmare for everybody, adding he was shocked when he found out it was his son who confessed to committing Friday's deadly shooting.\nMr. Lott said he saw the whole thing on television and remembers thinking to himself, how can this happen in Wichita Falls? How can two little girls be walking home and something like that happen?\nOn Sunday, he said he got a phone call he never thought he would receive.\nIt was his brother on the other line explaining his son was the one who pulled the trigger that took the life of Lauren Landavoza and injuring Makayla Smith.\nHe said although Kody had mental health issues, he never would have thought Kody could take someone's life.\n“I knew he had mental problems, but I was in the process of trying to get it resolved. He was on medication,” said Mr. Lott.\nHe reassures he is not making excuses for him, and said Kody’s family tried to get him help.\nMr. Lott said Kody was in a mental hospital in Houston for about a month.\nThere, he was diagnosed with paranoid schizophrenia and bipolar disorder.\nHe recalled his son as a child and tried to piece together where things went wrong.\n“Kody was a straight-A student up until he was about 10 years old. The divorce, I don't know if that's what affected him, but something changed,” said Mr. Lott.\nHe said there is one thing that he cannot change: the fact that 13-year-old Lauren Landavazo is no longer with us.\n\"I feel the pain that family feels. I don’t have the words to tell you how sorry I am,” said Mr. Lott.\nHe said he continues to pray for the family of those who were impacted by this tragic shooting.\n“I'm not asking them to forgive him. I know people hate him, and I don’t blame them. I hate what he did, too. Nobody is more disappointed in him than I am,” said Lott.\nKody’s father said he has not talked to his son in two weeks,and even if he did tonight, he would not know where to start.\n“I don't know what to say to him. I can't tell him how disappointed I am. I can't believe he did it. I wouldn’t know what to say if I saw him. I guess I'll never see him again. I don't know,” said Mr. Lott.\nKody's father said he does not feel sorry for his son and is not making any excuses for him.\nHe said he is just heartbroken and in disbelief that his child chose to throw his life away like this.\nHe adds he will never understand why Kody made the choices he did, forever changing the lives of so many in this community.\nCopyright 2016 KAUZ All Rights Reserved"}