{"uri": "http://www.ksla.com/story/33735044/newschannel-6-exclusive-victims-families-react-to-lott-indictment", "title": "Newschannel 6 Exclusive: Victims families react to Lott indictment", "dct": "Fri, 18 Nov 2016 14:06:00 GMT", "id": "f73b6fa0bb422905152d754055f064f6", "content": "WICHITA FALLS, TX (KAUZ) -\nKody Lott has been indicted in relation to the shooting of two McNiel Junior High students.\nA Wichita Falls Grand Jury handed down the indictment on Wednesday. Lott was formerly charged with the murder of Lauren Landavazo and also faces one charge of aggravated assault with a deadly weapon in connection to the shooting of Makayla Smith.\nIn an exclusive statement the mother of Lauren Landavazo, Bianka Landavazo told Newschannel 6:\n“Vern and I are thankful he has been indicted, it is the first step to getting deserved justice for our beautiful daughter Lauren Landavazo who was so tragically taken away from us by this monster. He will pay for his crimes and we will be there every step of the way!! We plan on fighting to change the Capital murder law that doesn't allow for the death penalty in this case! We want to thank everyone for their support as we struggle to cope daily with the senseless loss of our daughter Lauren. We know we don't walk alone and have an army behind us.”\nMeanwhile, the family of Makayla Smith also release a statement to NewsChannel 6 saying:\n\"Words cannot express the pain that this young man has caused between both of the families.\" \"Since September 2nd, our family has prayed that justice be served...it won't take away what we went through on that day or the hurt we will have to live with for the rest of our lives, but to know he will serve out the crime he has committed brings a little peace\"\nLott,the lone suspect in the shooting of the two teenage girls, told police during an interview that his actions were not “senseless,” as he planned it out and spoke to the devil about what he was going to do.\nAccording to Kody Lott’s arrest affidavit, Lott confessed to police that he shot Lauren Landavazo and Makayla Smith. He said the fact that one of them was in a relationship made him angry.\nLott went on to recount the events of that day, telling police that he was upset that he did not have a girlfriend. Lott said he went to his parent’s residence at the Fountain Gate Apartment complex and took his step-father’s .22 caliber rifle, waited at a window for the girl to pass by; then drove his pickup truck up to the girls and opened fire.\nLott told police he shot Lauren first and then shot Makayla “a couple of times,” then he made his way back to Lauren before leaving the area and attempting to dispose of the rifle on a rural road. He then said he returned to the field to collect the weapon and return it to his parent’s apartment.\nLott was arrested on Sunday, September 2nd, after a call to police said he fit the description of the suspect in media reports. Officers found spent .22 caliber shell casings in his car, the affidavit states.\nLott is being held on more than $4 million in bonds and is charged with murder and aggravated assault.\nCopyright 2016 KAUZ All rights reserved"}