{"uri": "http://thetandd.com/news/manager-says-club-will-fight-lawsuit-by-shooting-victim/article_fe16e27f-5a5d-53ca-9e32-c171d19ade3f.html", "title": "Manager says club will fight lawsuit by shooting victim", "dct": "Sun, 06 Sep 2015 00:00:00 GMT", "id": "03800232a62f230b9e42da328f1a23a2", "content": "A man injured in an August incident at an Orangeburg nightclub in which one person was killed is suing the club's owners for negligence in allowing a \"culture of lawlessness\" to prevail at the business.\nMaurice Jones, who was one of three people injured by gunshots during the early morning Aug. 15 incident, filed the lawsuit Aug. 26 against John W. Carter, Walter A. Pruitt and the Pit Stop Pub.\nThe lawsuit claims the defendants \"allowed a general condition of lawlessness to exist on the premises, thereby putting patrons at risk of serious bodily injury, and that the risk was both known ... and reasonably foreseeable to them, based on the long history of violent crimes committed on the premises.\"\n\"If the alcohol licensing board can't close it, it is going to be individuals filing lawsuits and forcing them to change their ways,\" Jones' attorney Janek Kazmierski said.\n\"We will fight it,\" Pit Stop Pub Manager Bobby Barfield said, describing the lawsuit as \"frivolous.\"\nThe lawsuit comes on the heels of a fatal shooting Aug. 15 at the Pit Stop Pub, located about two miles south of Orangeburg. Nazdric Gates, 30, of Mt. Airy, North Carolina, was charged with killing 22-year-old Christavius De'Shean Darby of Orangeburg.\nGates was taken into custody Aug. 26 by a joint task force made up of the U.S. Marshals Service and the Colorado Fugitive Task Force. He was found in Colorado Springs, Colorado.\nGates faces a murder charge and three attempted murder charges as well as a weapons charge. He has yet to appear in court in Orangeburg County.\nThe eight-page lawsuit contends the defendants \"took no actions to make improvements to the premises to make them reasonable safe for ... invitees.\"\nThe lawsuit goes on to say the defendants were \"willful, wanton, reckless, grossly negligent and negligent\" in failing to take the necessary precautions such as increasing security at the club and properly training employees to respond to criminal activity.\nKazmierski said his client was shot through the left knee and was grazed on the right knee.\n\"He is slowly recovering,\" the attorney said. \"His left leg is propped up ... and there is lack of sensation in the left leg below the knee. It is a significant injury. Whether he walks normally again is a question only time will tell.\"\nHe said Jones also suffered a flesh wound to his right upper hip and left shoulder.\nJones was at the pub with a relative and was shot as he was getting ready to leave the premises, Kazmierski said.\n\"He was not involved in any of the altercations and neither was the family member. He was truly an innocent bystander,\" the attorney said.\nIncidents occur because of \"a few bad apples,\" Barfield said, adding that 98 percent of the club's clients \"are good people.\""}