{"uri": "http://denver.cbslocal.com/2016/10/13/resident-involved-in-fatal-shooting-wont-face-charges/", "title": "Resident Involved In Fatal Shooting Won’t Face Charges", "dct": "Thu, 13 Oct 2016 20:49:00 GMT", "id": "d94de0c9e6b6f27df0b0e367dd5a59e2", "content": "ADAMS COUNTY, Colo. (CBS4) – No homicide charges will be filed against a man who shot a teenager to death who was believed to be in a group attempting to steal marijuana plants.\nSeventeen-year-old Alfred “Fredo” Chavez of Denver was killed Sept. 1 at the home at 76th Avenue and Raritan Street in Adams County.\nLaw enforcement authorities believe Chavez and several other teens got into the backyard of the home. The resident heard a noise in his garage. He came out with a gun, went around a corner where he said he confronted four people.\nThe resident, Levi Isidro Sisneros, told investigators that one of them threw something at him. He said he then fired a “warning shot.” That single shot struck Chavez in the back, killing him.\nSisneros was initially arrested by the Adams County Sheriff’s Department on first degree murder charges. District Attorney Dave Young told CBS4’s Rick Sallinger he did not feel the charges could result in a conviction in court.\n“We not only have to prove that a crime occurred, but we have to disprove that it was self defense,” he said. Sisneros was released. He is a registered marijuana “caregiver.”\n“He said he was scared for his life, but he shot my son in his back, how is that justified?” said Chavez’s mother Priscilla Hernandez.\nShe and other family members carried signs calling for justice for Chavez on Thursday.\nThey questioned why a man is being charged with homicide in a similar shooting that occurred in Denver over the weekend.\nIn that case, a 15-year-old was killed and a 14-year-old injured in an apparent theft of marijuana from an illegal backyard grow. The resident is believed to have fired from a second floor window.\nYoung noted the facts were different in the Adams County case.\nCBS4’s Rick Sallinger is a Peabody award winning reporter who has been with the station more than two decades doing hard news and investigative reporting. Follow him on Twitter @ricksallinger."}