{"uri": "http://www.khou.com/news/local/man-who-provided-gun-that-killed-5-year-old-sentenced-11-months-in-jail/238407467", "title": "Man who provided gun that killed 5-year-old sentenced 11 months in jail", "dct": "Thu, 09 Jun 2016 00:00:00 GMT", "id": "f5bc85187b072a35907bc7207b4a39e7", "content": "The man who provided a gun to the teenager who accidentally shot and killed a 5-year-old was sentenced Thursday to 11 months in the Harris County Jail.\nNima Nazerian, 18, pleaded guilty to one count of making a firearm accessible to a child in a Harris County courtroom Thursday morning. Prosecutors say in March 2015, Nazerian bought a gun for his teenage friend, a juvenile, who accidentally shot that gun inside his Alief apartment, sending a bullet into the apartment unit next door. That bullet killed Jairo Victoriano, whose emotional parents addressed Nazerian in court on Thursday.\n“His parents both shared that they weren’t bitter toward the defendant, they were just really looking for some justice,” said Ashley Guice, Harris County assistant district attorney. “They wanted to hear something, anything from the defendant here, at least that he was sorry.”\nWhen asked what Nazerian said to them, Guice replied, “That he was extremely sorry, that he didn’t mean for this to happen and he sends his condolences to the family.”\n(Photo: Family photo)\nFamilies from both parties embraced each other as they left the courtroom. They did not wish to comment to media.\nProsecutors say this sentence is unusual because those facing this particular charge are usually family members, who often don’t see jail time.\n“We charge them, but when it goes down to be indicted, the grand jury usually takes out of consideration that they’ve already lost a loved one in the case,” said Jeff McShan of the Harris County District Attorney’s Office. “So rarely is it charged.”\nProsecutors say they don’t know why the juvenile wanted the gun and that they can’t discuss charges or details of his case because he’s a juvenile.\nNazerian’s charge, a Class A misdemeanor, carried a maximum of 12 months in jail."}