{"uri": "http://www.crimestopmem.org/open_invest_new.html", "title": "HOMICIDE", "dct": "Fri, 20 Jan 2017 00:00:00 GMT", "id": "dd3cb49bc97ff0916f428f5790064362", "content": "CRIMESTOPPERS - CRIME OF THE WEEK\nThe Memphis Police Department took a call of a shooting at the Creative Cuts and Design Barber Shop at 2721 Frayser Blvd. on Tuesday, January 10, 2017 and officers responded at 8:07 p.m. Two male victims were located on the shop's floor with apparent gunshot wounds.\nDevario Burks, 25, was pronounced dead at the scene. A second man was transported to Regional One in non-critical condition. The preliminary investigation revealed that the two victims and other subjects were inside the barber shop when two black males fired shots into the business.\nPolice need help solving this crime. Anyone with information should call 528-CASH (2274) and provide information anonymously to CrimeStoppers.\nJanuary 13, 2017\nHOMICIDE\nOn Sunday, January 08, 2017, at 5:51 p.m., Memphis Police responded to a robbery at 2172 Forest Hill Court, Sycamore Lake Apartments, north of Raleigh LaGrange Road. Officers located an elderly female victim lying in the parking lot and suffering from multiple lacerations and abrasions.\nCatherine Wicker, age 81, was transported to Regional One where she died shortly after arrival. The preliminary investigation determined that a male black suspect occupying a Chevrolet Malibu pulled behind the victim's vehicle, exited his vehicle and attempted to grab the victim's purse. A struggle ensued and a witness intervened, gaining control of the victim's purse. The suspect got back in his vehicle and backed up, ramming the victim's vehicle and then ran over her with his vehicle.\nA vehicle matching the suspect's car was later found burned in Bartlett.\nA police artist created a sketch of the suspect (below). Anyone with information about this homicide case is asked to call CrimeStoppers at 528-CASH (2274) to help investigators.\nJanuary 5, 2017\nHOMICIDE\nOn Monday, October 10, 2016, at approximately 11:10 PM, Memphis Police received a call of a shooting at room 231 of the Memphis Inn Motel, 4879 American Way, at 11:10 p.m. Monday, October 10, 2016. At the scene, officers found a male victim who was suffering from gunshot wounds. Esteban Aleman, 36, was transported to Regional One in critical condition.\nOn Saturday, December 10, 2016, the victim died from the injuries. The investigation revealed that the victim and a female had checked into the room. While inside two armed males entered and robbed and shot. Aleman. The two men and the woman then left in the victim’s vehicle, which was later recovered.\nAnyone with information on this crime is asked to come forward by calling the CrimeStoppers tip line, (901) 528-CASH (2274).\nDecember 30, 2016\nHOMICIDE\nOn Tuesday, December 13, 2016, at approximately 9:10 PM, Memphis Police officers responded to a shooting at 9:10 p.m. Tuesday, December 13, 2016 at Saxon and Lenow Place in South Memphis. A male victim suffering form multiple gunshot wounds was located. Donovon Mills, 22, was transported to Regional One where he later died.\nAnyone with information on this homicide case is asked to call CrimeStoppers, 5289-CASH (2274).\nDecember 23, 2016\nHOMICIDE\nInvestigators with the Missing Persons Unit of the Memphis Police Department located a body inside a vacant apartment at 3833 Jackson — The Villages Apartments — at 11:33 a.m. Friday, December 2, 2016. The male victim has been identified as Timothy Simpson, 35. He had been reported missing on November 29, 2016. The victim's vehicle was found inside the apartment complex the same day.\nIt was determined that Simpson had sustained multiple gunshot wounds. The case has been turned over to Homicide detectives. Anyone with information on this murder is asked to call CrimeStoppers at 528-CASH (2274).\nDecember 16, 2016\nHOMICIDE\nA “shooting” call came into the Memphis Police Department's Appling Farms Precinct at 11:33 p.m. on Saturday, December 10, 2016. The caller said the incident occurred at 235 Glen Park, Apartment Number 8, which is between Walnut Grove and Raleigh Lagrange Roads in Cordova. Officers arrived and located an unresponsive male with a gunshot wound. William McDonald was pronounced dead at the scene.\nAn initial investigation revealed that during a party inside the second-floor apartment two males and a female came to the front door and attempted to enter. The subjects were denied entry and a argument ensued. The suspects then went downstairs and began shooting at the partygoers who were on the balcony. The suspects fled the scene in a white vehicle.\nMore information could help police solve this crime. Please call CrimeStoppers at 528-CASH (2274) if you have any information about this crime.\nDecember 9, 2016\nHOMICIDE\nMemphis Police received a report about a crashed vehicle at 6:05 p.m. Sunday, December 4, 2016. Officers arrived at 3208 South Edgeware, just south of Winchester Road where they found an unresponsive male victim sitting in the driver's seat of a 2009 Cadillac CTS. Derrick Marrow Jr had sustained a gunshot wound and was pronounced dead on the scene.\nOfficers determined that the Marrow was shot and then lost control of car. No other details are known. Investigators have asked that any citizen who saw or heard something to call CrimeStoppers at 528-CASH (2274) to help solve this crime.\nDecember 2, 2016\nHOMICIDE\nMemphis Police officers responded to a “man down” call on Tuesday, November 22, 2016, at 6:43 a.m. at 1052 Rosewood, off Mississippi Blvd. and near I-240. Officers soon located an unresponsive male victim sitting inside a 2002 Nissan Altima and suffering from a gunshot wound.\nMarcel Tate was pronounced dead at the scene. Officers determined that a gunshot had been heard in the area by residents between 10:00 p.m. and midnight on November 21, 2016. Investigators need help solving this crime. Anyone with information is asked to call CrimeStoppers, 528-CASH (2274).\nNovember 25, 2016\nHOMICIDE\nOn Monday, November 21, 2016, at approximately 12:16 AM, Memphis Police officers responded to a shooting at 3172 Summer Ave. Officers arrived and found a male victim in front of 654 Hillcrest with an apparent gunshot wound.\nDeangelo Gray was transported to the hospital where he later died. Officers determined that a fight had occurred outside of James Lounge, at the Summer address. Afterward, as patrons and security personnel returned to the lounge gunfire was heard and the victim was found suffering from gunshot wounds nearby on Hillcrest. The investigation also revealed that an altercation had taken place on Hillcrest just before the shooting.\nInvestigators need help solving this crime. Anyone with information is asked to call CrimeStoppers, 528-CASH (2274).\nNovember 18, 2016\nHOMICIDE\nMemphis Police officers responded to the report of a shooting at 3377 Woodhollow Road, just east of South Goodlett St. about 1:15 a.m. on Saturday, October 29, 2016. Upon arrival officers located a male victim with an apparent gunshot wound.\nChristian Rodriguez was pronounced deceased on the scene. An investigation determined that the victim was with two other males when two black males approached, one of whom was armed with a handgun, and robbed the victims. During the robbery, gunshots were fired and Rodriguez was struck. The suspects fled on foot and possibly got into a vehicle last seen going eastbound on Chuck Ave.\nAnyone with information about this crime is asked to call CrimeStoppers at 528-CASH (2274).\nNovember 9, 2016\nHOMICIDE\nMemphis Police Officers responded to a shooting at the corner of Douglass Avenue and Haynes Street in the Orange Mound area on Tuesday, October 11, 2016, at 11:35 p.m. Officers arrived and located a female victim with an apparent gunshot wound. Tilessa Cain was transported to Regional One Health where she died an hour later.\nThe investigation reveals that the victim was driving on Douglass near Haynes with a passenger when a vehicle pulled alongside and the occupants fired gunshots at a man standing on the curb. Tilessa Cain was in the line of fire and was struck by bullets.\nAnyone with information on this crime is asked to come forward and to call CrimeStoppers at 528-CASH (2274).\nOctober 28, 2016\nHOMICIDE\nAt 2 a.m. August 6, 2016 Donald Wilson of 4084 Forest View Drive, near Getwell Road, saw two males removing a lawnmower from the back of his truck. As he exited his home he was shot by the suspects, who ran back to their truck and fled the scene. Police arrived and found Wilson with a gunshot wound. Wilson was taken to the hospital. On Monday, October 17, 2016, Wilson died.\nSecurity photos are available from the scene of this crime. Anyone with information that can help police in this investigation is asked to call CrimeStoppers at 528-CASH (2274).\nOctober 13, 2016\nHOMICIDE\nMemphis Police responded to a “man down” call at 1283 E. Raines Road, just east of Elvis Presley Boulevard, about 10:30 p.m. Sunday, August 31, 2014. When officers arrived they found a female victim with severe head trauma. Tamiko Montgomery was transported to Regional One in extremely critical condition.\nAn unknown male had been seen standing over the her before running away toward the east. Montgomery died July 30, 2016 from the injuries she sustained. The death was ruled a homicide.\nAnyone with information that can help solve this case is asked to call CrimeStoppers at 528-CASH (2274).\nOctober 6, 2016\nHOMICIDE\nOn Tuesday, September 20, 2016, at approximately 5:30 p.m., Memphis Police responded to a shooting inside the Eden Pointe Apartments at 3254 W. Danville Circle near Sheffield High School in the southeast part of the city. When they arrived officers located an unresponsive male victim with an apparent gunshot wound. Dejan Rakic was pronounced dead at the scene.\nThe preliminary investigation revealed that the victim came outside after a male knocked on the door. Then gunshots were heard by neighbors. Anyone who has information that can help solve this ongoing homicide investigation is asked to call CrimeStoppers, 528-CASH (2274).\nSeptember 28, 2016\nHOMICIDE\nOfficers responded to reports of a shooting about 4:30 p.m. on Saturday, September 24, 2016 at 2600 Smith Ridge near Range Line Road. Officers arrived and found an unresponsive male victim with an apparent gunshot wound and lying on the sidewalk.\nTallarico Jones was pronounced dead on the scene. The preliminary investigation revealed that the victim and a witness approached a group of males. As the victim talked to the men, one of them began firing gunshots.\nThis is an ongoing Homicide investigation. Anyone with information on this crime is asked to call CrimeStoppers at 528-CASH (2274).\nSeptember 22, 2016\nHOMICIDE\nMemphis Police officers responded to a “man down” call at 10 a.m. on Monday, September 12, 2016 at 842 N. Montgomery, between Jackson and Vollintine streets. Officers arrived to find a male victim suffering from multiple stab wounds. Damion Thomas was transported to Regional One where he later died of his wounds.\nThis is an ongoing Homicide investigation. Anyone with information is asked to call CrimeStoppers, 528-CASH (2274).\nSeptember 14, 2016\nHOMICIDE\nOn Monday, September 12, 2016, at 2:01a.m., Memphis Police responded to a shooting call at 998 S. Wellington in the LeMoyne-Owen College area. Officers arrived and located a male victim with apparent gunshot wounds. The man, Kenneth Griffin, was pronounced dead on the scene.\nThe initial investigation reveals that the shooting may have occurred in the rear of 1024 S. Wellington and the victim fled until falling nearby.\nAnyone with information on this crime is asked to help investigators by calling 528-CASH (2274). Every call to CrimeStoppers is anonymous.\nSeptember 10, 2016\nHOMICIDE\nMemphis Police responded to a “man down” report at 11:57 p.m. on Saturday, September 3, 2016. Officers arrived at 1629 South Lauderdale St., near South Parkways East, and located a male victim with gunshot wounds lying on the sidewalk. Anthony Beason was pronounced dead on the scene.\nPolice need help in this ongoing homicide investigation. Call 528-CASH (2274) with any information.\nSeptember 1, 2016\nHOMICIDE\nMemphis Police responded to a “man down” call in an apartment complex at 1283 East Raines Road in South Memphis at 10:30 p.m. Sunday, August 31, 2014 – two years ago. Officers arrived and located a female victim with severe head trauma. Tamiko Montgomery was transported to Regional One Hospital in extremely critical condition. An unknown male was seen standing over the woman before running east from the location.\nOn July 30, 2016 Ms. Montgomery died of the injuries she sustained. Her death has been ruled a homicide.\nThe investigation continues. Anyone with information is asked to call the CrimeStoppers tips line, 528-CASH (2274).\nAugust 25, 2016\nHOMICIDE\nMemphis Police received a report of a shooting at the nightclub Kitten's Kabaret, 2882 Lamb Place, in the Airport area on Saturday, August 20, 2016 at 3:15 a.m. Officers arrived to find a male victim with multiple gunshot wounds. Jeromee White was pronounced dead at the scene.\nThe preliminary investigation determinate that the victim had been approached by unknown suspects in an SUV. One of the passengers fired gunshots which struck the victim.\nInvestigators need help in this case. Anyone with information is asked to call CrimeStoppers at 528-CASH (2274). All calls are anonymous.\nAugust 22, 2016\nHOMICIDE\nOn Monday, August 15, 2016, at approximately 8:48 a.m., Memphis Police officers were dispatched to 1596 Victor, south of South Parkway East Blvd. after information was received that a body may have been buried in the back yard of that location. Officers arrived and located the body of a female buried in a shallow grave. The victim was identified as Samantha Cox.\nThis is an ongoing Homicide investigation. Anyone with information about this case is asked to call CrimeStoppers at 528-CASH (2274).\nAugust 11, 2016\nHOMICIDE\nMemphis Police responded to a Home Invasion about 11 p.m. on July 12, 2016 at 4162 Old Bailey Court, where Brandon Byers had confronted three males who had forced their way into his residence. One or more of the three men shot Byers multiple times and then fled the scene in a white four-door Toyota Corolla driven by a female.\nBrandon Byers was transported to Regional One Hospital where he later died. Investigators are asking for help to solve this crime. Tips may be called to CrimeStoppers at 528-CASH (2274) or by text or secure email.\nAugust 4, 2016\nHOMICIDE\nMemphis Police officers responded to a shooting at 3497 Graceland Drive at Winchester Road, near I-55 on Saturday, July 30, 2016, at 9:30 p.m. Upon arrival they located an unresponsive male with an apparent gunshot wound.\nVictim Terralonce Stanford was pronounced dead at the scene. A preliminary investigation revealed that the victim was at the location after finding his vehicle, which had been stolen two weeks before. Two male suspects came out of an apartment and after a confrontation, Stanford was shot. The suspects then left in the victim’s stolen vehicle.\nThis is an ongoing investigation. Anyone with information that can help solve this crime is asked to call CrimeStoppers, 528-CASH (2274).\nJuly 28, 2016\nHOMICIDE\nMemphis officers responded to a robbery report at 4022 Dunn St. near Getwell on Friday, July 15, 2016, at approximately 7:10 p.m. Upon arrival, the police officers learned that two Hispanic males had been robbed by two black males.\nDuring the robbery Benjamin Lopez-Sales tried to run away. As he fled, one of the suspects fired a gun, striking Lopez-Sales. He was transported to Regional One Hospital where he later died. Video surveillance cameras captured an image of one of the suspects who remains unidentified.\nInvestigators need the public help in finding these criminals. Please call CrimeStoppers with any information at 528-CASH (2274).\nHOMICIDE\nOn July 7, 2016 at approximately 1:05 a.m., Memphis Police responded to a single vehicle crash at Walker and Lenow streets near Lemoyne-Owen College. The vehicle, which had struck a light pole, was occupied by a male who was transported to Regional One in critical condition. Justin Langston was pronounced dead shortly upon arriving at the hospital, where it was discovered that he had been the victim of a gunshot wound before striking the pole.\nAnyone with information on this crime is asked to help investigators by calling 528-CASH (2274), the anonymous CrimeStoppers tips line.\nJuly 13, 2016\nHOMICIDE\nOn July 8, 2016, at 4:19 p.m., Memphis Police received a report of a shooting at 1856 S. Perkins Road, near Overton High School. Responding officers located Denarious Martin, who was lying on the floor of the residence and bleeding from multiple gunshot wounds. Martin was pronounced dead at the scene.\nThe investigation remains ongoing and investigators need help solving this crime. Anyone with information is asked to call CrimeStoppers at 528-2274 (CASH).\nJuly 6, 2016\nHOMICIDE\nA call reporting a shooting brought Memphis Police officers to the Save-A-Stop 2 at 2757 Kimball Avenue, just west of Lamar Avenue and Pendleton Street, at 3:40 a.m. on July 1, 2016. Upon arrival, the officers located an unresponsive male with an apparent gunshot wound. Roan Gardner Jr., was pronounced dead at the scene.\nWitnesses told officers the victim was arguing with a black male who was inside a small four-door vehicle in the store parking lot. The unidentified man fired a gun at the victim and then fled in the vehicle, which was occupied by another black male and driven by a black female driver.\nThis is an ongoing investigation. Anyone with information about this crime is asked to call CrimeStoppers at 528-CASH (2274).\nJune 29, 2016\nHOMICIDE\nOn June 26, 2016, about 1 a.m., the Memphis Police Department responded to a shooting at 723 Leath Street, near Manassas, in North Memphis. Officers arrived to find an unresponsive male with gunshot wounds. Larry Watkins was pronounced dead on the scene.\nA witness advised that the victim was arguing with an unknown man inside the house when multiple gunshots sounded. The unidentified black male ran from the residence. Later, during a candlelight vigil quickly organized in front of the same address, a Memphis Police officer observed flames at the rear of the residence. The fire was ruled an arson.\nAnyone with information on this murder and arson is asked to call CrimeStoppers at 528-CASH (2274).\nJune 23, 2016\nHOMICIDE\nMemphis Police officers responded to a call about gunshots fired on June 17, 2016 at 571 Boston near Southern Avenue. Officers found an unresponsive male in the passenger seat of a silver vehicle which had been traveling on Boston. The male victim, Marvelous Johnson, had been shot and was transported to Regional One where he died. A second male victim, who was playing basketball nearby, also was shot and was transported to the hospital in non-critical condition.\nDetectives need more information in order to solve this ongoing case. Anyone who witnessed the shootings or who knows something about this crime is asked to call CrimeStoppers at 528-CASH (2274).\nJune 16, 2016\nHOMICIDE\nOn June 10, 2016, the Memphis Police responded to a shooting at 4315 Crescent Park Drive, just south of Raines Road. Officers arrived to find an unresponsive male gunshot victim. Juan Valladares was pronounced dead on the scene.\nA black male suspect armed with a handgun was seen approaching the victim. The suspect fire the gun and then fled the scene on foot. There may have been two other males with him.\nThis is an ongoing investigation. Help is needed. Anyone with information on this crime is asked to call CrimeStoppers at 528-CASH (2274).\nJune 9, 2016\nHOMICIDE\nOn May 30, 2016, Memphis Police responded to a shooting call at 3755 Maple Leaf Cove. Officers arrived to find an unconscious male lying on the floor. He apparently had been shot. Paramedics were called. When they arrived they pronounced the victim dead on the scene.\nThree males were seen leaving the residence in a black Chevrolet Tahoe with dark-tinted windows. The victim was identified later as David Riley.\nThe investigation remains ongoing.Anyone with information about this crime is asked to call CrimeStoppers at 901-528-CASH (2274).\nJune 2, 2016\nHOMICIDE\nMemphis Police responded to a shooting at 3155 Hickory Hill on May 21, 2016. Upon arrival, officers observed a male lying in the street next to a black 2016 Dodge Challenger. The man, identified as Rico Fason, had been shot and was transported by a Memphis Fire Department ambulance to Regional One, where he later died.\nThree males occupying another black vehicle (possibly an Infiniti or Nissan Maxima) are believed to be responsible for this crime. Anyone with information that can help solve this ongoing investigation is asked to call CrimeStoppers at 528-CASH (2274). Every call is anonymous.\nMay 25, 2016\nHOMICIDE\nMemphis Police officers responded to a shooting at 3452 Luzon Drive, north of Wooddale Avenue in southeast Memphis at approximately 10:40 p.m. on Saturday, May 21, 2016. Upon arrival, officers located an unresponsive male gunshot victim. Margarito Salas was transported to Regional One Medical Center where he soon died of his wound.\nAccording to initial reports, the victim had just returned home when an armed man approached, demanding money. The robber fired the gun and fled in a dark vehicle.\nPolice need help solving this crime. Anyone with information should call 528-CASH (2274).\nMay 18, 2016\nHOMICIDE\nMemphis Police officers responded to a call about a pedestrian struck by a vehicle at 3001 Kimball Avenue near Cherokee Park at 11:28 p.m. on Friday, May 13, 2016. When they arrived officers located a male victim lying in the roadway.\nThe man, named Lieutenant Malone, was transported to Regional One Medical Center. An unoccupied silver Mazda also was found in the street. Malone was pronounced dead at Regional One. Medical personnel discovered that the victim had sustained a gunshot wound.\nInvestigators need help in this open case. Anyone with information is asked to call CrimeStoppes at 528-CASH (2274).\nMay 12, 2016\nHOMICIDE\nOn Saturday, March 12, 2016, at approximately 2:20 a.m., Memphis Police officers responded to a shooting at 731 Semmes near Spottswood Avenue. Upon arrival officers located an unresponsive, male gunshot victim who was transported to Regional One.\nThe juvenile victim, D'Anthony Obee, died from his injuries two hours later.\nA witness who was walking home with the victim said they were approached by two unknown males who demanded they identify themselves. The victim and witness ran. They were chased and Obee was subsequently shot.\nInvestigators need help in identifying the assailants. Anyone with information should call 528-CASH (2274) for a possible award.\nMay 5, 2016\nHOMICIDE\nMemphis Police responded to a man down on East Levi Road, just east of Neely Road in South Memphis on Wednesday, April 27, 201 at approximately 8:35 a.m. Officers arrived to find a male gunshot victim, who had been encountered by a pedestrian passerby. Ontario Manning was pronounced dead on the scene.\nPolice need help in finding out who killed Manning. Witnesses or others with information are asked to call CrimeStoppers at 528-CASH (2274).\nApril 28, 2016\nHOMICIDE\nMemphis Police officers responded to a shooting at 1602 Dellwood, near Frayser Elementary School, at 7:12 p.m. Friday, April 22, 2016. At the scene officers found a male juvenile gunshot victim. Kerr-Dulea Neil was lying on the school's outdoor basketball court. He was transported to Regional One where he later died. Witnesses told officers they observed a black male suspect approach the basketball court and fire multiple shots. Anyone with information that can help police in this ongoing investigation is asked to call CrimeStoppers at 528-CASH (2274).\nApril 21, 2016\nHOMICIDE\nAt 12:09 a.m. on Monday, April 18, 2016 the Memphis Police Department responded to a shooting at 1428 Woodward near Jesse Turner City Park. Responding officers located a male gunshot victim on the sidewalk in front of the house. Willie Pressley was pronounced dead on the scene. Officers learned that multiple gunshots had been heard by nearby residents around midnight.\nThis is an ongoing investigation. Anyone with information about this shooting should please call 528-CASH (2274). All calls to CrimeStoppers are anonymous.\nApril 13, 2016\nHOMICIDE\nMemphis Police Department officers responded to a shooting at a house at 6601 Mallard Nest Cove at 11:37 p.m. Sunday, April 10, 2016. Officers located two female gunshot victims inside the residence.\nOne woman was transported to Regional One in critical condition and the other victim, Tierney Reid, was pronounced dead on the scene. The women had just arrived home and were attempting to enter the residence when the suspect fired multiple gunshots.\nThe investigation is ongoing. The CrimeStoppers anonymous tipline 528-CASH (2274) is available 24/7. Please call if you have any information that can help solve this crime.\nApril 7, 2016\nHOMICIDE\nAround 7:55 p.m. on Saturday, March 19, 2016, Memphis Police officers responded to a call about gunshots fired at 2527 Elms Court #2 in the Avery Park Apts. Responding officers located a male gunshot victim inside the apartment. Cornelius Montgomery was pronounced dead on the scene.\nAccording to a witness, a black male knocked on the apartment door and was let inside. The male brandished a firearm and told the victim to get on the floor. A struggle ensued between the witness and intruder. Shots were fired, striking the victim.\nThis is an ongoing investigation and police need help identifying the shooter. Call CrimeStoppers at 528-CASH (2274) anytime if you have any information about this crime.\nMarch 31, 2016\nHOMICIDE\nOn Monday, March 14, 2016, at approximately 11:50 PM, Memphis Police responded to a report of a shooting at 3456 Henry in the Tillman Station precinct. Officers soon located a male gunshot victim who said he was sitting in his vehicle when a male occupying a black SUV with black rims shot him. Larry Harris was transported to Regional One where he died from his wounds.\nThe investigation is ongoing. Anyone with information is asked to call 528-CASH (2274).\nMarch 24, 2016\nHIT AND RUN FATALITY\nAt 10 p.m. on Friday, February 12, 2016 a hit-and-run accident involving a fatality occurred on Front Street at Poplar Avenue on the west side of the Cannon Performing Arts Center. The victim — later identified as John McCommon — was walking across Front Street, from the Cannon Center to the parking lot on the west side of Front, when he was struck and killed by an oncoming vehicle. The driver of the vehicle left the scene without rendering aid to the victim. McCommon was transported to Regional One Hospital where he was later pronounced dead.\nWitnesses on the scene described the vehicle as a white, four-door Nissan Altima, model years 2000 to 2004, bearing a Tennessee license tag. The driver of the vehicle was described as a slender black male between 20 and 25 years of age. The vehicle was last seen turning west onto Adams from Front Street.\nPolice need help identifying the suspect in this ongoing investigation. If you have any information, please call the CrimeStoppers anonymous tipline at 528-CASH (2274).\nMarch 18, 2016\nHOMICIDE\nOn Saturday, March 12, 2016, at approximately 2:20 a.m. Memphis Police officers responded to a shooting at 731 Semmes. Upon arrival officers located an unresponsive gunshot victim who was transported to Regional One.\nD'Anthony Obee, a juvenile, died of his injuries two hours later. A witness who was walking home with the victim said they were approached by two unknown males asking who they were. The victim and witness ran. The attackers chased Obee, who was subsequently shot.\nThis is an ongoing investigation. Anyone with information is asked to call CrimeStoppers at 528-CASH (2274).\nMarch 11, 2016\nHOMICIDE — CASE SOLVED\nMemphis Police responded to a “suspicious activity” call at 838 West Holmes Road in south Memphis on Wednesday, March 2, 2016, at 1:35 p.m. Officers arrived and located an unresponsive male victim inside the residence who had sustained apparent gunshot wounds. Albert Farmer, Jr. was pronounced dead on the scene.\nFamily members reported they had not spoken with the victim since February 25, 2016. A relative went to the residence and observed an open window with an air conditioner unit pushed inside. The investigation revealed that a struggle may have taken place inside the residence.\nThis case has been solved.\nMarch 2, 2016\nHOMICIDE — CASE SOLVED\nMemphis Police officers responded to a shooting call at 6 a.m. Friday, February 26, 2016 at 4183 Eastwind # 5, in the Hillcrest Apartments complex near Hillcrest High School. Upon arrival officers located a male victim inside the residence who had sustained gunshot wounds. Kedrick Danner was pronounced dead at the scene.\nA witness told officers there was a knock at the door and an armed black male suspect wearing a FedEx jacket entered, demanding money. The suspect shot the victim as the robbery began, and again as he was leaving.\nThis case has been solved.\nFebruary 24, 2016\nHOMICIDE\nMemphis Police Officers responded to shots fired at 3612 Townes St., near Chelsea, about 1:10 p.m. on Thursday, February 11, 2016. Upon arrival, officers located a male victim lying in the driveway. The man, identified as Ricky Moore, had sustained an apparent gunshot wound. He was transported to Regional One where he died from his wounds. The victim was able to tell witnesses that he had been in a vehicle with two subjects when he was robbed and shot.\nAnyone with information that can lead to solving this ongoing investigation is asked to call 528-CASH (2274).\nFebruary 18, 2016\nHIT-AND-RUN FATALITY\nA man was struck by a car as he left the Cannon Performing Arts Center at approximately 10 p.m. Friday, February 12. The victim, John McCommon, was walking across Front Street at Poplar Avenue to the parking lot on the west side of Front when he was struck by a vehicle described by witnesses as a white four-door Nissan Altima, model years 2000 to 2004. The driver immediately left the scene without rendering aid to the victim.\nMcCommon was transported to Regional One Hospital where he was later pronounced dead. The witnesses said the car bore a Tennessee license plate and described the driver as a slender black male, between the ages of 20 and 25. The car was last seen turning west onto Adams Street from Front.\nThe investigation is ongoing. Anyone with information on this hit-and-run crime is asked to call CrimeStoppers at 528-CASH (2274).\nFebruary 10, 2016\nHOMICIDE\nOn February 7, 2016, at 7:53 p.m., Memphis Police were dispatched to a shooting call at 5653 Encino Cove. Upon arrival officers observed two males seated in a vehicle in front of that address. Both men were unresponsive and appeared to have suffered multiple gunshot wounds.\nThe victims, later identified as Muhummed L'Amin and Cameron Stokes, were pronounced dead at the scene. Two unknown males were observed walking away from the scene earlier.\nThis investigation remains open. Anyone with information is asked to call CrimeStoppers at (901) 528-CASH (2274). The call, as always, is completely anonymous.\nFebruary 5, 2016\nHOMICIDE\nMemphis Police officers responded to a robbery on Friday, January 8, 2016, at approximately 10:50 p.m. at 2365 Staten in the 38108 zip code. Upon arrival officers found an unresponsive male victim who had sustained an apparent gunshot wound.\nThe man, Gerald Holloway, was pronounced dead on the scene. Holloway and two other males were approached by four armed and masked men and were robbed. Holloway was shot when he attempted to flee.\nThis is an ongoing investigation. Please call (901) 528-CASH if you have any information that can help solve this crime. This anonymous tipline is available 24/7.\nJanuary 28, 2016\nHOMICIDE\nOn Sunday, January 24, 2016, at approximately 11:35 PM, Memphis Police officers responded to shots fired in the area of Summer Avenue and Hudson, near Tillman Street. Upon arrival officers heard more gunfire and soon located a male victim who had sustained multiple gunshot wounds. Montrell Crutcher was transported to Regional One where he died of his wounds.\nThis is an ongoing investigation. Anyone with information regarding this crime is asked to call CrimeStoppers at 901-528-CASH (2274).\nJanuary 18, 2016\nHOMICIDE\nOn Saturday, January 9, 2016, at approximately 3:40 PM, Memphis Police officers responded to a shooting at 787 S. Prescott St. Upon arrival officers located an unresponsive male victim who had sustained an apparent gunshot wound. Lonnie Ludvigson was pronounced dead at the scene.\nAccording to a witness, four masked males occupying a blue vehicle approached the victim who was in his vehicle. One of the men, armed with a handgun got out of the blue vehicle, pulled the victim from his car, walked the victim towards the blue vehicle and demanded money. Ludvigson fled. The robber fired gunshots. When a witness shouted at the shooter, the man then shot at the witness. The witness returned gunfire and may have struck the man as he fled in the blue vehicle with the other three males.\nThe investigation is ongoing. Anyone with information on this crime should call 528-CASH (2274).\nJanuary 8, 2016\nHOMICIDE — Case solved\nOn Wednesday, December 23, 2015, at 7:19 p.m., Memphis Police officers responded to a shooting at 1586 McMillan. Officers arrived at the scene and located a male victim who had sustained an apparent gunshot wound. The victim, John Jones, aka \"Fish,\" was pronounced dead on the scene. This incident has been ruled a homicide and an investigation is ongoing.\nThis case has been solved.\nJanuary 4, 2016\nHOMICIDE\nOn Friday, December 25, 2015, at approximately 10:36 p.m., Memphis Police officers responded to a shooting at 4525 Double Tree in South Memphis. Upon arrival officers located an unresponsive male victim, Cameron Harris, lying on the grass in front of Double Tree Elementary School. The victim sustained a gunshot wound and was pronounced dead at the scene.\nCrimeStoppers seeks information to help police investigators in this ongoing case. If you have any information about this incident, please call the CrimeStoppers anonymous tipline at 528-CASH (2274).\nDecember 28, 2015\nHOMICIDE –– Case solved; death ruled a justified homicide\nOn December 8, 2015, Memphis Police responded to a shooting call at 3701 Timberline. Upon arrival, officers found a man with a gunshot wound. The victim, who later was identified as Xavier Perry, was transported to Regional One where he later died.\nWitnesses reported seeing a silver or gray Honda Accord leaving the scene immediately after Perry was shot.\nThis case has been solved.\nDecember 10, 2015\nHOMICIDE\nMemphis Police officers responded at 12:15 p.m. on Wednesday, October 14, 2015 to 1803 Tahiti Lane in the Mt. Moriah area. Upon arrival, officers located a gunshot victim, Ronnie Little, who was lying on the front porch. Officers also located a second victim, Larry Little, on the floor inside the residence. Both men had suffered apparent gunshot wounds and were pronounced dead at the scene. Witnesses heard several shots fired around 10:00 p.m. the previous evening.\nThis investigation is ongoing. Anyone with information should call 528-CASH.\nDecember 3, 2015\nHOMICIDE\nMemphis Police Department officers responded to a shooting at 5959 Winchester, the site of Deuces Bar and Lounge, on Sunday, November 29, 2015 at approximately 1:10 a.m. Officers located a victim identified subsequently as James Rooks lying on the parking lot. He had sustained an apparent gunshot wound and was pronounced dead on the scene.\nThe victim had been inside the bar with several subjects who got into an altercation with another group. All individuals were removed from the business by security personnel who intervened in the fight. The second group of people left in a vehicle, but returned and fired gunshots. Several bullets struck the victim.\nThis is an ongoing investigation. Anyone with information pertaining to this crime should call 528-CASH (2274).\nNovember 30, 2015\nHOMICIDE\nOn Wednesday, August 5, 2015, at approximately 12:47 PM, a Memphis Police officer was flagged down at 3555 Kallaher, Highland Park, by City of Memphis Park Employees regarding a “man down” in Highland Park. Officers discovered an unresponsive Hispanic male in the park who appeared to have sustained multiple stab wounds. The man, whose identity still is unknown, was pronounced dead on the scene. His death has been ruled a homicide. The investigation is ongoing and police could use help in solving the case. If you have any information that could help solve this crime, call CrimeStoppers at 528-CASH (2274).\nNovember 19, 2015\nHOMICIDE\nOn Wednesday, November 11, 2015, at approximately 6:20 p.m., Memphis Police responded to a shooting at 1002 Randle Street. Officers located a male victim who had sustained a gunshot wound. He was transported to Regional One in non-critical condition.\nOfficers also located an unresponsive male victim on the sidewalk at 992 Randle. The second victim, identified as Keith Jones, was pronounced dead on the scene from gunshot wounds.\nThe first man told officers he observed an unknown vehicle driving northbound on Randle from Vollintine Ave. and gunshots were fired from the passenger side of the vehicle. Officers need information to help solve this case. Please call CrimeStoppers at 528-CASH (2274) with any information you may have.\nNovember 12, 2015\nHOMICIDE\nOn Monday, September 14, 2015 at 11:45 a.m. Memphis Police received a complaint of a female lying in the roadway at 2012 Hernando (entrance to Hollywood Cemetery). Officers arrived and located the woman, later identified as Juanita Gilmore. Gilmore had apparent knife wounds to her body and was pronounced dead on the scene.\nThis is an ongoing investigation. If you have any information please call the anonymous tip line, 528-CASH (2274).\nNovember 5, 2015\nHOMICIDE\nOn Sunday, October 4, 2015, at approximately 7:30 p.m., Memphis Police Department officers responded to a shooting at Hillview Apartments, 2505 East Hillview. Officers located a male victim with apparent gunshot wounds.\nThe victim, Henry Holloway, succumbed to his wounds and was pronounced dead on the scene. The victim may have left a party in the apartment complex and while walking was approached and shot.\nThis is an ongoing investigation. Call CrimeStoppers at 528-CASH (2274) with any information you may have.\nOctober 29, 2015\nHOMICIDE\nOn Saturday, September 26, 2015, at approximately 1:30 a.m., Memphis Police Department officers responded to 1503 Lake Grove near Chelsea regarding a shooting at the location. Officers located three victims inside the residence who were pronounced dead at the scene.\nThe three victims — Anthony Isom, Chasity Springfield and Michael Glover — sustained gunshot wounds. A witness heard gunshots and observed two males run from the location and into a burgundy-colored vehicle parked across the street.\nThis is an ongoing investigation. Anyone with information pertaining to this crime should call 528-CASH (2274).\nOctober 22, 2015\nHOMICIDE\nOn Wednesday, October 14, 2015 at approximately 12:15 p.m., Memphis Police responded to a shooting call in the 1800 block of Tahiti Lane. Upon arrival officers located Ronnie Little lying on the porch and unresponsive. Officers also located a second victim, Larry Little, lying in a back bedroom of the house. He too was unresponsive.\nBoth men had suffered gunshot wounds and were pronounced dead on the scene. Witnesses told officers they heard several shots fired around 10:00 p.m. the previous evening.\nPolice need help solving this ongoing investigation. If you have any information that can help police, please call 528-CASH (2274).\nOctober 15, 2015\nHOMICIDE\nMemphis Police responded to a shooting in the 4200 block of Eastwind Drive Sunday, October 11, 2015, at approximately 6:15 p.m. Upon arrival officers found Akeem Wilkins lying in the parking lot and suffering from multiple gunshot wounds. The victim was transported to Regional One where he was pronounced dead.\nWitnesses heard several shots fired and saw two hooded males flee from the scene on foot.\nThis is an ongoing investigation. Call 528-CASH (2274) if you have information that can help solve this case.\nOctober 8, 2015\nHOMICIDE\nOn Wednesday, September 3, 2015 at approximately 1:30 a.m. Memphis Police responded to a shooting at 3700 Mountain Terrace. Upon arrival officers located Malroy Bradley who was suffering from a single gunshot wound. The victim was transported to Regional One in critical condition; he later died.\nWitnesses told officers that Bradley was approached by an armed male who demanded money. The male fired several shots at Bradley, striking him once. The suspect then took an object from from Bradley`s vehicle, which was parked on the scene, and fled on foot in an unknown direction.\nThis is an ongoing investigation. If you have any information that can help police, please call 528-CASH (2274).\nSeptember 16, 2015\nHOMICIDE\nOn Friday, September 11, 2015, at approximately 12:45 AM, Memphis Police Department officers responded to a shooting call at 4345 Mallory in Mt. Moriah Station. Officers arrived and located a male who had sustained multiple gunshot wounds.\nRobert Irby stated he had just arrived home when an unknown armed male wearing black clothing approached and demanded money. The robber shot Irby and fled on foot. Irby was transported to Regional One.\nIrby died from his injuries on September 14. The investigation is ongoing and citizen help is needed.\nSeptember 2, 2015\nHOMICIDE\nOn Monday, August 17, 2015 at 10:52am Memphis Police responded to a “shooting call” in the 2500 block of Tutwiler. Upon arrival, officers found a gunfire victim, later identified as Aaron Crutcher, lying in the street and unresponsive. Crutcher had suffered multiple apparent gunshot wounds and was pronounced dead on the scene.\nWitnessed stated the Crutcher was approached by two males who demanded that he lie on the ground. Crutcher attempted to flee, but was struck by bullets as he turned to run away. The two males then fled the scene in what was described as a black Chevrolet Impala.\nThis is an ongoing investigation.\nAugust 28, 2015\nHOMICIDE/ROBBERY SOLVED - Citizen's tip led to an arrest; paid to tipster: $1000\nOn Friday, August 18, 2015, at 5:41 PM, Memphis Police officers responded to a shooting call in the 900 block of Oakview. Upon arrival, officers located the victim — later identified as Dyrell Sims — lying unresponsive in a yard. He had suffered multiple gunshot wounds.\nSims was transported to Regional One Hospital where he later died. A second victim, who was also shot but later recovered, advised officers that the attack was a robbery in which two male suspects armed with guns took money from both victims before shooting them and fleeing on foot.\nDetectives have closed this investigation with the assistance of a citizen's anonymous tip.\nAugust 12, 2015\nHOMICIDE SOLVED - Citizen with tip is paid $1,000 plus $25,000 in an extra award\nOn Saturday, August 1, 2015, at 6:17 A.M., Memphis Police Department officers responded to a shooting call at 8417 Bazemore in the Walnut Grove Lake Subdivision.\nOfficers arrived and located an unresponsive female, later identified as Susan McDonald, on the driveway next to her vehicle with an apparent gunshot wound. The victim was pronounced dead on the scene. She had just pulled into the driveway when she was approached by an unknown suspect(s) and shot.\nThis investigation has been closed with the aid of an anonymous tip.\nJuly 3, 2015\nHOMICIDE\nOn Sunday, June 28, 2015, at 3:32 a.m., Memphis Police responded to shots fired in the area of Castle Heights and Winter Park. Upon arrival, officers observed a victim lying in the street, unresponsive and with multiple gunshot wounds.\nThe victim, later identified as Melvin Foster, was pronounced dead on the scene.This case is an ongoing Homicide Bureau investigation.\nJune 26, 2015\nAGGRAVATED ASSAULT\nOn Tuesday, June 23, 2015, at 12:21 a.m., Memphis Police responded to a complaint of shots fired in the 4200 block of Graceland, in the Pepper Tree Apartments.\nAs officers checked the area, an unknown suspect fired shots at the police, striking an officer's patrol vehicle with a single round. The officer occupying the vehicle at the time of the assault was not injured and the suspect fled from the scene.\nThis is an ongoing investigation. Police welcome any tips.\nJune 21, 2015\nHOMICIDE\nOn Friday, June 12, 2015, at 2:02 a.m., Memphis Police responded to shots fired in the 3300 block of Coleman. Upon arrival, officers found Courtney Fields lying unresponsive in the street with an apparent gunshot wound.\nFields was pronounced dead on the scene by Memphis Fire Department personnel.\nThis is an ongoing investigation.\nMay 22, 2015\nHOMICIDE\nOn Sunday, May 10, 2015, at 12:02 a.m., Memphis Police responded to a complaint of a man down in the 4000 block of Navaho. Officers arrived on the scene and found the victim, Darrell Watson, lying on a porch. He was unresponsive and bleeding from an apparent gunshot wound.\nWatson was pronounced dead on the scene by Memphis Fire Department emergency personnel. Gunshots were reportedly heard in the area approximately an hour before police were called to the scene.\nThis is an ongoing investigation and homicide investigators need help solving this crime.\nMay 13, 2015\nHOMICIDE\nOn Thursday, April 30, 2015, at approximately 4:50 p.m., Memphis Police responded to a complaint of a man down at 3363 Barbwood.\nUpon arrival, officers located the victim, 43-year-old Harold Kimbrough, lying unresponsive in the backyard of the vacant house. Kimbrough suffered from an apparent gunshot wound and was pronounced deceased on the scene. No arrest has been made at this point. This is an ongoing investigation.\nApril 24, 2015\nHOMICIDE\nOn Friday, March 20, 2015, at 1:37 a.m., Memphis Police responded to a call at Methodist South Hospital regarding a man who had been shot.\nThe victim, Jaleel Wallace, suffered a single gunshot wound in the apartments in the 4100 block of Brady Drive. Wallace was airlifted to Regional One Hospital where he later died. An investigation is ongoing and information is needed to help solve this crime.\nApril 2, 2015\nHOMICIDE\nOn Tuesday, March 3, 2015, at 3:15 PM, Memphis Police responded to a shooting call at 789 Atlantic. Upon arrival, officers found victim Jerome Williams lying unresponsive on the floor of a vacant house at that address and bleeding from an apparent gunshot wound.\nWilliams was pronounced dead at the scene. The investigation remains ongoing at this time.\nMarch 18, 2015\nHOMICIDE\nOn Wednesday, March 18, 2015, at 4:08 AM, Memphis Police responded to a shooting call in the 700 block of Wilson Street. Upon arrival, officers observed victim Edward Kimmons on the ground and unresponsive.\nKimmons had suffered multiple gunshot wounds and was pronounced dead on the scene. A white SUV was seen leaving the area immediately after the incident occurred. The investigation remains ongoing. Homicide investigators seek any information that might help solve this murder.\nMarch 18, 2015\nHOMICIDE\nOn Thursday, March 12, 2015, at approximately 6:40 a.m. Memphis Police Department officers responded to a shooting in the 1500 block of Northside Drive at the Todd Creek Apartments. Sherrod Smith, a 32-years old male, was found deadfrom gunshot wounds. Family members and friends had discovered Smith inside his apartment after he failed to respond to their messages and inquiries.\nThe motive behind the murder is unclear and no arrests have been made. A white sedan with a sunroof was captured by surveillance cameras entering and exiting the apartment complex before Sherrod Smith’s body was discovered. Investigators at Memphis Police Department’s Homicide Bureau would like to know who occupied this vehicle. Citizens with information about this murder, or who may know who’s responsible, are asked to call CrimeStoppers or the Homicide Bureau at 901-636-3300. Information leading to felony charging in this murder could result in a $1,000 award.\nMarch 1, 2015\nROBBERY\nOn Tuesday, February 24, 2015, at approximately 1p.m., First South Financial Credit Union Bank located at 7166 Winchester was robbed by a lone gunman. The gunman approached a teller, produced a gray or silver revolver, and told a customer, who was at the counter, to get on the floor. The customer complied. The suspect demanded and took currency. The suspect then ordered everyone in the business to get on the floor as he made his escape.\nAn undetermined amount of currency was taken from the credit union. The suspect was last seen walking back eastbound from the credit union.\nNo one was injured during this robbery. The suspect is described as a black male, approximately 6’1”, 210 pounds, medium complexion, stubble hair on his face, medium length hair, wearing a red devil mask, black hooded coat, blue jeans, black and gray gloves, and black and gray shoes.\nInvestigators need help in solving this case.\nFebruary 20, 2015\nHOMICIDE\nOn Tuesday, October 7, 2014 Memphis Police Department officers assigned to East Raines Station responded to the 200 block of Sullivan. A decomposed body was discovered inside a vacant home that was being prepared for sale.\nThe victim was later identified as Nina Cook, 28 years old. Ms. Cook was reported missing by family members on September 25, 2014. She had actually gone missing weeks earlier. Evidence recovered at the scene led investigators to believe Nina Cook was brutally murdered. On February 9, 2015, Shelby County Medical Examiners ruled Nina Cook’s death a homicide following extensive forensic testing of evidence recovered at the scene.\nThis murder is being investigated by Memphis Police Department’s Homicide Bureau. To date, no arrests have been made. Investigators continue to piece together a timeline between Ms. Cook’s last conversations with friends or family and the day she was reported missing. Investigators need help solving this crime.\nFebruary 6, 2015\nBANK ROBBERY\nFort Sills National Bank\n3950 Austin Peay\n(Report#1501010279ME)\nOn January 21, 2015, at approximately 6:10 p.m., two suspects robbed the Fort Sill National Bank at 3950 Austin Peay. The first suspect entered the bank posing as a customer. He approached the counter, began wielding a handgun and demanded currency. The suspect forced an employee to open a safe. He fled the scene on foot. The second suspect stood outside the door and acted as a lookout.\nThe first suspect (the gunman) is described as a black male, approximately 5’10, 160 pounds, 35 - 40 years of age, dark-skin complexion with facial hair and a tattoo or scar on his left cheek. He was wearing a red Cleveland Indians baseball cap, blue jeans and a white and red jacket. The second suspect is described as a black female, approximately 5’6, 135 pounds, 30-35 years of age, light-skin complexion, wearing a gray hooded jacket with her face partially covered.\nNo arrests have been made and the investigation is ongoing by the Safe Streets Task Force comprised of members of the Memphis Police Department, the Germantown Police Department, the Bartlett Police Department, the Shelby County Sheriff's Office and the FBI. Authorities need helping solving this crime.\nJanuary 30, 2015\nHOMICIDE\nOn Tuesday, January 13, 2015 at approximately 9:50 p.m., officers responded to a shooting at 1732 Morlye Place. Upon arrival, officers located 42-year-old Ventura Tura lying in an outside stairwell with a gunshot wound. The victim was transported in critical condition to Regional One where he was later pronounced dead.\nNo suspects have been developed or charged. Investigators need help to solve this crime.\nJanuary 26, 2015\nRobbery of Business\nOn December 24, 2014, at approximately 4:30 p.m., the Econo Lodge, located at 22 North Third was robbed by an armed male. The investigation revealed the male entered the business and demanded money while holding the front desk clerk at gunpoint. The clerk complied and the suspect took an undetermined amount of cash before fleeing south on Third Street. A passerby saw the robber get into a small dark-colored vehicle described as possibly a Pontiac G6.\nThe suspect was described as a male black, 25-30 years old, 5’11”-6’0 tall, medium build, wearing a reflective type vest, dark pants and a gray hooded sweatshirt. As the robber approached the business, he pulled a black and white mask over his face. He is believed to be responsible for several area hotel robberies. Video of the incident was captured on the store’s security system.\nJanuary 16, 2015\nHOMICIDE\nOn Sunday, December 28, 2014, at 11:23 p.m. officers responded to a shooting at Corning and Kensett. Officers arrived on the scene and located the victim lying on the sidewalk in front of 1861 Corning with a gunshot wound. The victim was pronounced dead at the scene.\nOfficers learned that the victim was involved in a verbal altercation with a subject occupying a Gold colored Cadillac. The investigation is ongoing and information is needed from citizens to help solve this case.\nDecember 26, 2014\nHOMICIDE\nOn Monday, December 22, 2014, at approximately 6:15 p.m., officers responded to a business robbery call at Amigo’s Store, 4200 Wales. Officers arrived on the scene and found 44-year-old Mamadou Ngom inside the business and suffering from multiple gunshot wounds. Ngom was transported by ambulance to Regional One where he was pronounced dead a short time later.\nMamadou Ngom apparently was killed during a robbery. Homicide investigators need someone to come forward with information concerning this homicide.\nDecember 19, 2014\nHOMICIDE\nOn Saturday, December 6, 2014, at 7:34 p.m. officers responded to a shooting call at 4496 Wooddale. Officers arrived on the scene and found 31-year-old Juan Ramirez lying in the street next to his truck, unresponsive . Paramedics made the scene and transported Ramirez to Regional One in critical condition. Ramirez was later pronounced dead.\nOfficers learned that Ramirez was in a vehicle when suspects approached him. One suspect opened the driver’s door and pointed a gun at Ramirez. Ramirez put the vehicle in reverse to get away from the suspects, when one of them shot Ramirez. Investigators need someone to come forward with information concerning this homicide.\nDecember 15, 2014\nHOMICIDE\nOn Friday, November 28, 2014, at 12:10 p.m. officers responded to a \"man down\" call at 3264 Powell St. Officers arrived on the scene and found 36-year-old Rumaldo Antuñez in the front yard of the residence, suffering from a gunshot wound and unresponsive. Paramedics pronounced Antuñez dead at the scene.\nInvestigators need someone to come forward with information concerning this homicide.\nDecember 5, 2014\nHOMICIDE\nOn Sunday, November 30, 2014, at approximately 2:45 a.m. officers responded to an Aggravated Assault at I-40 and Dunlap. Officers arrived on the scene and found the a male suffering from gunshot wounds to the arm and back. The victim, Bernard Jackson, 28, was transported to Regional One in critical condition where he later died.\nA 26 year-old male reported he was driving his vehicle on I-240 near Airways when he heard several shots fired. The man realized that his vehicle had been hit by bullets, along with Jackson, a passenger who was sleeping in the vehicle.\nInvestigators need someone to step forward with information to help solve this crime.\nDecember 1, 2014\nHOMICIDE\nOn Thursday, November 13, 2014, at 12:03 a.m. officers responded to the scene of a fire, being fought by Memphis firefighters at a business located at 1551 Neatherwood.\nAfter Memphis Fire Department personnel extinguished the fire, they found the body of 34-year-old Kibrom Lebsekal near the entrance of the business. Kibrom Lebsekal was unresponsive and severely burned and died soon after. Lebsekal’s death was ruled a Homicide. Investigators need someone to come forward with information concerning this homicide.\nNovember 21, 2014\nHOMICIDE\nOn Friday, October 31, 2014 at approximately 5:50 p.m., officers responded to Wellons and Glenalp, to assist with crowd control, at the request of Memphis Fire Dept. paramedics. Officers arrived on the scene and found paramedics treating 21-year-old Samuel Johnson. Johnson was transported to Methodist North, where he was pronounced dead..\nThe following day, the Shelby County Medical Examiner’s office ruled Johnson's death a homicide resulting from a gunshot wound. Investigators need someone to come forward with information concerning this homicide.\nNovember 14, 2014\nHOMICIDE\nOn October 29, 2014 at approximately 9:08 a.m., officers responded to a complaint call at 3466 Kirby Avenue, where concerned citizens could not get a response from the resident. After arriving on the scene, officers found 60-year-old Robert Lee Williams lying on the floor and unresponsive. Paramedics made the scene and pronounced Williams dead. The Medical Examiner ruled Williams’ death a homicide as a result of gunshot wounds.\nInvestigators need someone to come forward with information concerning this homicide.\nNovember 7, 2014\nHOMICIDE\nOn Saturday, November 1, 2014 at 11:04 a.m. officers were flagged down and directed to the area of a pond south of 3483 Lichterman Road, where an unresponsive body had been found. Officers arrived and found the body of 57-year-old Don Smith. The Medical Examiner ruled Smith’s death a homicide as a result of a gunshot wound.\nInvestigators need someone to come forward with information concerning this homicide.\nOctober 30, 2014\nHOMICIDE\nOn Monday, September 8, 2014 at approximately 1 a.m., officers responded to a shooting call at 6043 Quince. Upon arrival, officers located 14-year-old Desmond Bowen, who was sufferings from an apparent gunshot wound.\nOfficers learned that the teenager was lying in bed when gunshots were fired into the residence and struck him. Bowen was transported to St. Francis Hospital where he was later pronounced dead. Homicide investigators need someone to come forward with information to help solve this crime.\nOctober 17, 2014\nHOMICIDES/AGGRAVATED ASSAULTS\nOn Saturday, October 4, 2014, at 10:17 p.m., officers responded to a shooting call at 1419 Gherald.\nOfficers arrived to find four Hispanic males suffering from gunshot wounds. One victim — 23-year-old Alvaro Casillas — was pronounced dead at the scene. A second man, 25-year-old Juan Garcia, was transported to Regional One where he was then pronounced dead. The other two victims — Juan Gaitan, 27 and Jose Rodriguez, 29 — were transported to Regional One in critical condition. All of the victims had been shot.\nIt is believed that two armed males approached the victims, demanded money, and then began shooting. Homicide investigators need someone to come forward with information on this multiple shooting.\nSeptember 26, 2014\nAGGRAVATED ASSAULT\nOn Sunday, August 31, 2014 at 10:40 p.m., officers responded to a shooting call at Raines and Pace. Upon arrival officers foun, 34-year-old Tamiko Montgomery, suffering from severe head trauma.\nThe investigation showed that a black male was seen sitting on top of Montgomery, beating her. The suspect ran when he realized that he had been seen. Montgomery received massive head trauma during the beating. She was transported to Regional One where she was listed in critical condition. Montgomery now remains at Regional One on life support. This case is being transferred to the Homicide Bureau for investigation.\nInvestigators believe someone has knowledge of this murder. We need that person to come forward and help investigators solve this senseless crime.\nSeptember 19, 2014\nHOMICIDE\nOn Tuesday, August 19, 2014 at 12:55 a.m. officers responded to an aggravated assault call at 5174 Millbranch. Upon arrival, officers found the 51-year-old Mark Dean lying on the ground and suffering from multiple gunshot wounds. Dean was transported to Regional One in critical condition. On Tuesday, September 9, 2014, Dean died at the hospital from his injuries.\nInvestigators believe someone has knowledge of this murder. We need that person to come forward and help investigators solve this senseless crime.\nSeptember 12, 2014\nHOMICIDE\nOn Sunday, August 31, 2014 at 12:47 p.m., officers responded to a shooting call at a business at 3088 Lamar, the Lamar Express Laundromat. Officers arrived and found 32-year-old Wesley Gordon lying on the ground next to his green Mercury Marquis. Gordon was suffering from gunshot wounds and was unresponsive. Gordon was pronounced DOA on the scene by paramedics.\nInvestigators believe someone has knowledge of this murder. We need that person to come forward and help investigators solve this senseless crime.\nAugust 29, 2014\nHOMICIDE\nOn Sunday, August 17, 2014 at 1:27 a.m. officers responded to a disturbance call at Long Meadow & Gailwood. Upon arriving at the scene officers were advised by a witness that several individuals were standing around a vehicle when another vehicle pulled up and the occupants began shooting. Victim Clarence Calhoun, III, 20, fell to the ground. Calhoun was transported to the hospital in critical condition from a gunshot wound. The next day, Calhoun was pronounced dead.\nHomicide investigators need someone to come forward with information to help solve this homicide.\nAugust 15, 2014\nHOMICIDE\nOn Friday, August 1, 2014 at 12:45 p.m. officers responded to a complaint of a \"lifeless body\" found in the drainage ditch next to 472 Whiteville. Officers inspected the drainage ditch that runs in between 472 and 480 Whiteville where the body of the victim, Cekia Anderson, age 39, was found in the early stages of decomposition.\nHomicide investigators need someone to come forward with information to help solve this homicide.\nJuly 16, 2014\nHOMICIDE\nOn Monday, July 7, 2014 at 5:32 a.m., officers responded to a \"suspicious activity\" call at 1859 Gooch. On the scene, a complainant told officers that while he was cutting grass at a vacant lot, he smelled a foul odor. He looked around and found what appeared to be a severely burned human body. The burned, decomposed body has been identified as 29-year-old Darryl Bailey. Bailey’s death was ruled a criminal homicide.\nInvestigators believe someone has knowledge of this murder. We need that person to step forward and help investigators solve this crime\nJuly 14, 2014\nHOMICIDE\nOn Saturday, June 21, 2014 at 10:58 a.m., officers responded to a shooting call at 5987 Summer Sun Square #1, the Emerald Square Apartments. Officers arrived on the scene and found 3- year-old Terrence Burress on the living room floor of the apartment, unresponsive and bleeding. Memphis Fire Department paramedics made the scene and pronounced Burress deceased.\nInvestigators believe at least one witness has knowledge of this murder. We need that person to step forward and help investigators solve this senseless crime.\nJuly 3, 2014\nCRIMINAL ASSAULT\nOn June 21, 2014, at approximately 10:20 PM, officers responded to an assault call at the Bugetel Inn, 6068 Macon Cove. Upon arrival, officers located a 19-year-old female who reported that two males lured her into one of the motel rooms where they both sexually assaulted her. The female is mentally challenged.\nSuspect #1 is described as a male black, 21 to 23 years old, 5’7” to 5’8”, 110 to 120 pounds, wearing long blue-jean shorts and a white T-shirt. Suspect #2 is described as a male black, 21 to 23 years old, 5’7” to 5’8”, 110 to 130 pounds, wearing long plaid shorts. Both suspects were seen hanging around the pool area of the motel for several hours. (See Photo of Suspect #1.)\nSuspect #1 was seen driving a vehicle described as a hunter green, 4/door 1998 Oldsmobile or Chevrolet; very clean in appearance with no window tint. One suspect’s first name may be Javion. Investigators need someone to come forward with information to help solve this crime.\nJune 27, 2014\nHOMICIDE\nOn Monday, June 16, 2014 at 12:50 a.m. Memphis Police officers responded to a shooting call at 1632 Patterson. On arrival the officers found a black Nissan Sentra stopped in the middle of the street with shattered windows. Victim Kenneth Matthews, 50 years old, was seated in the driver’s seat with a bleeding gunshot wound. Matthews was able to tell officers that he was near 3497 Sharpe, McLemore Market, when several unknown African-American males tried to rob him. Matthews was transported to the Regional One where he died.\nInvestigators are convinced someone has knowledge of this murder. We need that person to step forward and help investigators solve this senseless crime.\nJune 18, 2014\nHOMICIDE\nOn June 7, 2014, at approximately 2:40 a.m. officers responded to a \"suspicious vehicle\" call in the area of Aldridge and Stoneham streets. While checking the area, officers saw a gray Acura, with bullet holes in it, parked on the curb in front of 4550 Aldridge. Inside the car officers found an unresponsive male slumped over in the driver’s seat, suffering from a gunshot wound.\nAn ambulance made the scene and pronounced the victim, 23-year-old Jeremy Watkins, deceased. Investigators need someone to come forward with information on this homicide.\nJune 6, 2014\nHOMICIDE\nOn Friday, May 25, 2014, at approximately 12:36 p.m., officers responded to an aggravated assault call at 2314 Marble. Upon arrival, officers found 66-year-old Charles Jordan suffering from an apparent stab wound. The victim was transported in critical condition to Regional One Health. Jordan later died from his injuries at the hospital.\nHomicide investigators need someone to come forward with information concerning this murder.\nMay 30, 2014\nHOMICIDE\nOn Tuesday, April 29, 2014, at 7:40 a.m. officers responded to a\" man down\" call in a vacant lot at 4875 America Way. Upon arrival 23-year-old Cortavious Harris was found with an apparent gunshot wound. Harris was pronounced dead at the scene.\nHomicide investigators need someone to come forward with information concerning this murder.\nMay 23, 2014\nBUSINESS ROBBERIES: COMFORT SUITES\nOn May 13, 2014 at approximately 4:30 a.m., the Comfort Suites located at 2527 Thousand Oaks Cove, was robbed by an armed male. The suspect entered the business and held the clerk at gunpoint while demanding money. The clerk complied, and the suspect fled the business with an undetermined amount of money. The suspect was described as a black male, 25-35 years old, approximately five feet eight inches and 250 pounds, wearing a white t-shirt, dark pants and a shirt tied around his head. The suspect was armed with a silver semi-automatic handgun.\nOn May 18, 2014 at approximately 5:30 a.m., the same Comfort Suites, located at 2527 Thousand Oaks Cove, was robbed again, by someone who appeared to be the same armed suspect. The armed suspect entered the hotel, bypassing several guests of the business, and held the clerk at gunpoint. The suspect demanded money, and the clerk did not comply with his demands. The suspect struck the clerk in the head with the handgun. The suspect then took the money from two cash drawers and fled the scene. Again, the suspect was described as a black male, 25-35 years old, 5 feet 10 inches, 300 pounds, white t-shirt, dark pants, with a shirt tied around his head. The suspect was armed with a silver semi-automatic pistol.\nA dark colored vehicle, possibly a 2004-2007 Nissan Maxima or Altima, was seen in the area just prior to both robberies and may be connected. The Safe Streets Task Force needs someone to come forward with information on these robberies.\nMay 15, 2014\nHOMICIDE\nOn Thursday, May 8, 2014 at 3:32 p.m. officers responded to a shooting at 3755 Station Way. Officers arrived on the scene and were met by a complainant, who advised that he left home at 9:30 a.m., and when he returned he found the door to the residence open. He reported that he went inside and found the victim, Henry Hammond, 65, bleeding and unresponsive. Officers entered the residence and found that Hammond had been shot. Memphis Fire Department paramedics arrived and pronounced Hammond dead at the scene.\nHomicide investigators need someone to come forward with information about this murder.\nMay 8, 2014\nDOUBLE FATALITY HIT & RUN\nOn Sunday, August 18, 2013, at approximately 2:56 a.m., officers made the scene of a reported crash where two pedestrians — 34-year-old Jessika Cavazos and 37-year-old Derrick Cross — had been struck by a vehicle on I-40 near Warford. Both victims were pronounced deceased by paramedics on the scene. The responsible vehicle had left the scene.\nThe investigation revealed that the victims were standing outside of their disabled vehicle, which was parked on eastbound I-40 in the north median lane, when they were struck by a vehicle. The responsible vehicle is described as possibly a white four-door Toyota pickup truck with black or gray around the lower sides and rear. The vehicle was last seen in the area of I-40 and Covington Pike. The suspected driver of the vehicle is described as either a white or Hispanic male. Investigators are asking anyone with information regarding this crash to call Crime Stoppers at 528-CASH.\nApril 4, 2014\nHOMICIDE\nOn Monday, March 17, 2014, at approximately 8 a.m., officers responded to a \"man down\" call at 9023 Fulton Lane. Upon arrival officers located the victim, Percy Ward, Jr., age 31, who had been shot. Ward was pronounced dead on the scene. Homicide investigators need someone to come forward with information about this murder.\nMarch 28, 2014\nHOMICIDE\nOn Sunday, October 27, 2013, at 9:20 a.m., officers responded to an \"injured pa\" call at 1141 South Barksdale in Glenview Park. Officers arrived on the scene and found the victim, 78-year-old Johnny Hurley, who had been beaten. Hurley was lying on the ground bleeding severely from the head and face. Hurley was transported to the Regional One Hospital in critical condition.\nOn March 21, 2014, at 5:10 p.m., Hurley died as a result of the injuries he received from the incident, according to the medical examiner. Hurley’s death has been ruled a homicide. The Homicide Bureau needs someone to come forward with information to help solve this homicide.\nMarch 6, 2014\nHOMICIDE\nOn Monday, February 10, 2014 at 3:10 a.m., officers responded to a shooting at Pope and Tutwiler. Officers arrived on the scene and saw a black vehicle stopped on the side of the street with several bullet holes in it. Officers then found the driver-victim, Deshawn Rogers, seated in the vehicle and suffering from multiple gunshot wounds. A Memphis Fire Department Ambulance made the scene and transported Rogers to the Med in critical condition. At 3:50 a.m., Rogers was pronounced dead.\nThe Homicide Bureau needs someone to come forward with information to help solve this homicide.\nFebruary 21, 2014\nBusiness Robberies\nOne suspect is believed responsible for two robberies. The suspect is described as a male, white, 25 to 35 years old, approximately six fee two inches tall, weighing about 200 pounds, of medium build, unshaven, and wearing a gray skull cap, heavy black jacket with a white stripe down both sleeves, black shirt, gray gloves, black pants, and black shoes. He implied he was armed with a weapon.\nOn Saturday, February 15, 2014, at approximately 1:38 a.m. officers responded to a call to the Circle K, located at 1685 Union. When Memphis Police officers made the scene the victim reported he was working as a cashier when a man entered the business and forced him to open the registers. The suspect took an undetermined amount of money from the registers and fled the scene in a dark blue four door vehicle with tinted windows, possibly a Ford Taurus.\nOn Sunday, February 16, 2014, at approximately 10:15 p.m. officers responded to a call to the YoLo, located at 6 South Cooper. At the scene a victim reported to officers that he was working as a cashier when a man entered the business and forced him to the floor. The suspect took an undetermined amount of money from the registers and fled the scene in a dark blue four-door vehicle with tinted windows, possibly a Ford Taurus.\nFebruary 13, 2013\nCRIME OF THE WEEK SEXUAL ASSAULT, KIDNAPPING\nAbout 12:30 a.m. on Thursday, January 16, officers responded to a sexual assault call at St. Francis Hospital. Officers met a 28-year-old female who reported that she was walking on Brown Bark near Winchester Pointe when an unknown white male drove up to her and asked her if she wanted a ride. When she declined the ride, the man struck her in the head and face and then forced her into his vehicle. He drove her to the 6700 block of Winchester where he sexually assaulted her.\nThe suspect is described as a white male, approximately 30 years old, five feet 10 inches, heavy set, with short light brown hair. He was driving a small 4-door, dark colored vehicle with cardboard covering the rear passenger window and a license plate containing the letters “PFJ.\" Following the assault the man fled with the vehicle in an unknown direction on Winchester. The female summoned help from a passing citizen.\nInvestigators need someone to come forward with information concerning this case.\nJanuary 31, 2014\nHOMICIDE\nOn January 6, 2014, at 10:30 p.m., officers responded to a \"Man Down\" call at 5233 Flowering Peach. Upon arrival officers located a male lying on the ground. The victim, Tejuan Sartin, 22, had been shot. Paramedics pronounced him dead.\nThere is no suspect information available; Homicide investigators are asking anyone with information to call CrimeStoppers at 528-CASH or the Homicide Bureau at 636-3300. The identity of the tipsters will remain anonymous.\nJanuary 24, 2014\nAGGRAVATED RAPE, AGGRAVATED ROBBERY, AND AGGRAVATED ASSAULT\nOn Tuesday, January 14, 2014 at approximately 1:45 am, officers were flagged down by two females, ages 19 and 20. The women were at a gas station in the 2700 block of Getwell when they were approached by three or more black males; one they recognized and know by the name of “Little C.” One of the unknown black males was armed with a handgun and stole money from one of the women, then fled on foot. He was described as about 20 years of age, 6 feet tall, slim build and with dark complexion, wearing a black jacket with red trim and a backwards cap.\nThe women entered their vehicle and chased the suspect. Meanwhile, suspect “Little C” drove his vehicle while the other suspects were passengers, following the women. The two women arrived in the rear of the apartments in the 2900 block of Getwell where they were surrounded by “Little C”, the armed suspect they were chasing and two unknown suspects armed with handguns. The suspects pulled the women from their car, forced them onto the ground at gunpoint and sexually assaulted them. One suspect used his handgun to strike one of the victims on the head and shot at her. The suspects took the victims’ bags, cash, and cellular phones. The other suspects were also approximately 20-25 years of age. “Little C” is approximately 5’9”tall, medium complexion, with mustache, gold grill on upper and lower teeth and was wearing black pants and a black jacket. The suspects were in a red Ford Mustang with a brown convertible top without a license plate.\nThe suspects and suspect vehicle were captured on video while at the gas station.\nJanuary 15, 2014\nBusiness Robberies\nOn December 25, 2013 at approximately 10:45 a.m., officers responded to a DOA call at 6090 Belle Grove Cove South. Upon arriving, officers found Javier Alonso deceased inside the home. This case is being handled as a homicide. The Homicide Bureau needs anyone with any information to come forward to help solve this case.\nJanuary 3, 2014\nHOMICIDE\nOn December 25, 2013 at approximately 10:45 a.m., officers responded to a DOA call at 6090 Belle Grove Cove South. Upon arriving, officers found Javier Alonso deceased inside the home. This case is being handled as a homicide. The Homicide Bureau needs anyone with any information to come forward to help solve this case.\nDecember 27, 2013\nRAPE\nOn December 7, 2013 at approximately 4:30 p.m. a 27-year-old female was attacked in her home. The lone suspect confronted the victim outside and then forced his way inside where the victim was assaulted sexually. Statements made by the suspect indicate the victim was specifically targeted.\nThe suspect is described as white male, approximately 30 years old, six feet tall, dark hair, stubble facial hair, wearing a ball cap, dark blue or black, big quilted coat. He was wearing wire rim glasses that look frameless. There was no weapon used and no suspect vehicle was seen.\nThere have been no arrests in this case. Investigators believe citizens in the area may have seen someone acting suspiciously at the time, or may know who is responsible. We need that person to come forward with information to help solve this crime and hold the person that is responsible accountable.\nDecember 16, 2013\nROBBERY-SHOOTING SUSPECT SOUGHT\nOn Sunday, December 1, 2013, at 6 p.m., Crump Station officers responded to a shooting in the 800 block of Garland. A 43-year-old male and a 33-year-old female arrived home and saw two men in their yard. When the male resident confronted the suspects, one responded by pulling a handgun. The suspects demanded money and attempted to force the victims inside the home.\nDuring a struggle, one of the suspects shot the male victim several times. The man was transported to The Med in extremely critical condition. He continues to be hospitalized. Reginald White, 20, has since been developed as one of the suspects. On December 10, 2013, White was arrested and charged with especially aggravated robbery, first degree murder, and possession of a firearm during the commission of a dangerous felony.\nThe second suspect remains unidentified and at large. Investigators still need help to identify this suspect and hold him accountable. He is described as an African-American male, early to mid 20’s, 5’6” to 5’8”, medium complexion, and wore dark clothing at the time of the shooting.\nDecember 9, 2013\nHOMICIDE\nOn Thursday, November 21, 2013 at 5:45 p.m. officers responded to a “shots fired” call at 4509 Charing Cross. Officers arrived on the scene and found a victim suffering from gunshot wounds. The man, later identified as Darrin Walls, was transported to the MED where he was pronounced deceased.\nInvestigators need someone to come forward with information on this homicide.\nNovember 22, 2013\nROBBERY\nOn November 5, 2013, Memphis Police officers responded to an aggravated assault call at 361 Walker. At the scene officers found a male victim suffering from several gunshot wounds on the ground at the rear of the residence. The victim had been involved in a dispute with his mother’s neighbors when an unknown suspect walked up, pulled a black 9mm handgun from his jacket, and shot the victim twice in his buttocks and once in the leg. The shooter fled the scene in a black Pontiac Aztec truck.\nThe suspect is described as a male black, between 5’8” and 5’10”, in his early 20’s, and weighing 200 to 250 pounds. He has a medium to dark complexion, with approximately six gold bottom teeth, a mustache, and wearing a black pullover hoody sweatshirt, white t-shirt underneath, dark-colored jeans, and dark-colored shoes.\nInvestigators need someone to come forward with information to help solve this crime.\nNovember 15, 2013\nHOMICIDE\nOn Thursday, November 7, 2013 at 12:07 a. m. officers responded to an aggravated assault call at 148 W. McKellar. Upon arrival they found an unresponsive male lying on the ground at 142 W. McKellar. Officers determined the man, identified later as Levi Watt, had multiple gunshot wounds to his body. Memphis Fire Department personnel made the scene and Watts was pronounced DOA.\nInvestigators need someone to come forward with information on this homicide.\nNovember 8, 2013\nROBBERY\nOn October 30, 2013, at approximately 7:50 pm, Memphis Police officers responded to a robbery of the Subway at 6415 Summer Avenue. A male black suspect had walked into the business armed with a black handgun. He jumped the counter, pointed the handgun at two employees and demanded money from the cash register. The employees complied and the suspect fled the business.\nThe suspect is described as a male black, between 5’8” and 5’10”, early 20’s, 165-175 lbs, medium complexion, mustache, wearing a black pullover hoodie sweatshirt, white t-shirt underneath, dark-colored jeans, and dark-colored shoes. A security camera caught the accompanying image. Investigators need someone to come forward with information to help solve this crime.\nNov. 1, 2013\nBusiness Robberies\nOn October 14, 2013 at 7:55 pm, an armed male entered T-Mobile, located at 1425 N. Germantown Rd, and robbed the business. The robber forced employees to load up two white garbage bags with approx. 46 smart phones. The male then demanded keys from the employees and took one of the employee’s cars, after loading up the stolen phones.\nOn October 27, 2013, the T-Mobile located at 1498 Union was robbed by an armed male. The male entered the business and demanded employees fill up trash bags with an undetermined amount of smart phones. The robber then attempted to take a vehicle from the employees but was unsuccessful. The robber ran off on foot north from the business.\nIn both robberies, the suspect is described as a black/male, approx. 20 years old, approx. 5’8”, thin build. He was wearing a dark blue hooded sweatshirt (with a white FedEx logo on 10-27), black or blue pants, and black shoes. The suspect was armed with a black semi-automatic handgun in both robberies. During the course of the investigation, it was determined that a similar incident occurred at a T-Mobile in Bartlett on March 13, 2013. All of the incidents are under investigation at this time. Attached are still images from the robberies.\nThese incidents are being investigated by the Safe Streets Task Force. The Safe Streets Task Force is comprised of members of the Memphis Police Department, the Germantown Police Department, the Bartlett Police Department, the Shelby County Sheriff’s Office and the Federal Bureau of Investigation.\nOctober 20, 2012,\nHOMICIDE — Extra award offered\nOn Saturday, October 20, 2012, at approximately 3:35 p.m., officers arrived at the scene of a shooting at 1106 Marlin and found 33-year-old Dennis Miller lying outside with a gunshot wound. Miller was transported by ambulance to the Regional Medical Center where he was pronounced dead.\nInvestigators believe two male suspects armed with handguns forced their way into the residence and shot Miller. The suspects were described as in their 30's, one thin and the second stocky. Homicide investigators have followed several leads but still need someone to come forward with information to help solve this crime and hold the suspects accountable.\nAn extra $2,000 award has been offered to CrimeStoppers for information that leads to the charging of the suspects responsible for his murder. With a $1,000 award normally reserved for solving tips in homicide cases, CrimeStoppers of Memphis and Shelby County confirms a total award amount of $3,000 in this case.\nOctober 18, 2013\nHOMICIDE\nOn Sunday, October 13, 2013, at approximately 8 a.m., officers responded to a DOA report at 1587 Chelsea. Officers arrived on the scene and located 39-year-old Jose Alberto Vilchis Villareal lying on the ground next to his vehicle with multiple lacerations. Paramedics arrived and pronounced the victim deceased. Medical Examiners have ruled the death a homicide.\nThere is no suspect description available and a motive for the murder remains unknown. Homicide investigators are asking anyone with information about this murder to call CrimeStoppers.\nOctober 3, 2013\nHOMICIDE\nOn Tuesday, September 24, 2013, at 3:49 a.m., officers responded to a home invasion at 1015 Palermo. At the scene officers learned that an unknown person or persons came into the home at 1015 Palermo and began shooting. Officers found William Rogers, 41, who was pronounced deceased by Memphis Fire Department personnel. Homicide investigators need someone to come forward with information regarding this incident.\nSeptember 20, 2013\nHOMICIDE\nOn Wednesday, September 18, 2013 at approximately 8:30 p.m., officers responded to a shooting at 1033 Whitaker, Birch Leaf Apartments. Upon arrival officers located several shooting victims. Among them, Deonte Wiggins was lying on the ground in the rear of the complex with an apparent gunshot wound. Wiggins was pronounced dead on the scene.\nThree additional victims with apparent gunshot wounds were transported from the scene to the Regional Medical Center in critical condition. A fifth victim was found and was transported to the MED in non-critical condition. The preliminary investigation revealed that several male blacks armed with weapons shot the victims. The suspects fled the scene, possibly occupying a dark colored SUV. Homicide investigators need someone to come forward with information regarding this incident.\nSeptember 6, 2013\nHIT AND RUN FATALITY\nOn August 25, 2013, at approximately 4:35 a.m., officers responded to a hit and run crash on the parking lot of the King’s Furniture store located at 3080 Lamar. Officers learned that the victim, Mario Inigues, was struck by a 1996 Honda Accord and the responsible driver fled the scene, while leaving the vehicle behind. The suspect was last observed getting into a small gray or gold vehicle that left the scene in an unknown direction.\nMemphis Fire Department made the scene and pronounced the victim deceased. Investigators need someone to come forward with information to help solve this incident.\nAugust 22, 2013\nSHOOTING\nOn July 31, 2013, at approximately 5:30 p.m., officers responded to a shooting at Cash America Pawn, 3447 Millbranch. Officers arrived on the scene and located a male who had been shot multiple times. The victim was transported by ambulance to the Med in critical condition. He has since been released by the hospital.\nThe preliminary investigation revealed a struggle ensued between the victim and two males who were inside the business. One suspect pulled a handgun and fired several shots striking the victim multiple times. Both suspects fled the scene.\nSuspect No. 1 is described as a black male, light complexion, between 18- 25 years of age, medium build, 5’10”- 5’11”, approximately 150 pounds, wearing a white shirt, dark shorts, white tennis shoes, and a white “Gatorade” towel draped over his head. Suspect No. 2 is described as a black male armed with a gun, dark complexion, between 18- 25 years of age, heavy build, 5’6”- 5’8”, approximately 230-270 pounds, low haircut, wearing a blue shirt, dark gray shorts, white tennis shoes, and a black jacket (with gold-colored writing on the back that states, “Day One, One Problem”) draped over his head.\nPlease contact CrimeStoppers if you have any information that can help solve this crime.\nAugust 19, 2013\nHOMICIDE\nOn August 5, 2013, at approximately 7:10 a.m., officers responded to a DOA on the river bank near Harbor/Port. Officers were met by a complainant who observed a garbage container floating down the Mississippi River. Officers found the body of 28-year-old Latisha Harris, locked inside the container. Homicide investigators need someone to come forward with information to help solve this murder.\nAugust 9, 2013\nROBBERY\nOn Friday, June 21, 2013, at approximately 6:40 a.m., a 64-year-old female was robbed at gunpoint while standing at the corner of Pueblo and Mark Twain. The victim’s purse containing cash, credit cards and her iPhone was stolen. The suspect was last seen running eastbound on Pueblo.\nThe suspect is described as a black male, 5’8”, 18-22 years of age, medium build, medium complexion, and armed with a black handgun. He was wearing a sleeveless white t-shirt, dark-colored shorts, and possibly was driving an older light-colored Buick with heavy damage on the passenger side door.\nThe suspect, along with a second suspect was seen at the Kroger’s fuel center pump fuel in an older model Buick, light in color. This second suspect was wearing a multi-colored shirt and dark shorts. (See security photos.)\nThe Memphis Police Department is asking for help identifying the suspects seen using the stolen credit cards taken in the robbery.\nAugust 2, 2013\nHOMICIDE\nOn Monday, July 2, 2012 at 2:47 p.m., officers arrived at 4268 Boyce concerning a report of a \"found body.\" Upon arrival, officers found the victim, Shawn Marbury, lying on the living room floor with an apparent gunshot wound. Marbury was pronounced dead on the scene.\nHomicide investigators need someone to come forward with information to help solve this murder.\nJuly 26, 2013\nHOMICIDE INVESTIGATION\nOn Saturday, July 20, 2013 at 2:14 p.m., officers responded to a shooting at 2832 Morning Trace Drive, Stonebridge Crossing Apartments. Upon arrival, officers found the victim, 33-year-old Erano Santos, lying on the ground in front of the address. Santos suffered from an apparent gunshot wound and was pronounced dead on the scene.\nAccording to witnesses, the victim was in the parking lot when he become involved in a physical altercation. During the fight, Santos was shot and his vehicle, a 2013 Honda Civic, was stolen. Homicide investigators need anyone with information about this crime to come forward.\nJuly 18, 2013\nROBBERY/ABDUCTION\nOn Monday, July 8, 2013, at approximately 2:40 p.m., two unidentified people, a woman and a man, abducted a female victim at gunpoint from the Regions Bank located at 3061 Covington Pike.\nOfficers were advised that the victim was approached while in the parking lot of the Regions Bank located on Covington Pike. The victim was forced to drive to another Regions Bank located at 3535 Austin Peay. Upon arrival at the second bank, she was forced to enter the bank and withdraw cash from her account.\nThe suspects' images were captured on surveillance video. Suspect #1 is described as a black female appearing to be in her mid to late 30s. She is seen in the video wearing blue jeans, a white blouse and carrying a black purse. Suspect #2 is described as a black male in his mid 40s, about five feet seven inches tall, thin build, dark complexion, wearing dress clothes, a fedora-style hat and carrying a black briefcase.\nInvestigators need someone to come forward with information to help solve this crime.\nJuly 5, 2013\nROBBERY\nOn June 24, 2013, at approximately 12:55 a.m., officers responded to a Robbery at 2041 Hubert. The victim was returning home when a late model Chevrolet HHR, orange in color, stopped in front of the residence. Two unknown males exited the vehicle and forced the victim into the residence where the victim was pistol whipped and shot at. The suspects took the victim's wallet and cell phone before leaving the scene east on Hubert.\nThe suspects have been described as: (1) Male, Black, 20-24 years of age, 5'10\", 190 pounds, light complexion; (2) Male, Black, 20-24 years of age, 5'10\", 175 pounds, dark complexion.\nThe homeowner's surveillance camera captured a photograph of the suspects, which can be viewed at: http://memphis.crimestoppersweb.com/crimeoftheweek.aspx\nSHOOTING LEAVES ONE DEAD AND ONE CRITICALLY WOUNDED *SOLVED*\nOn June 22, 2013, at approximately 2:34 a.m., officers responded to a shooting at 2341 Silver Cove. Upon arrival, officers located two males with gunshot wounds inside the residence. An ambulance made the scene and 66-year-old Jerry Nelson was pronounced dead on by paramedics.\nThe second victim, 21-year-old Otis McClain, was transported by ambulance to the Regional Medical Center in critical condition. Homicide investigators are asking anyone with information about this shooting to call Crime Stoppers at 528-CASH.\nROBBERY / SHOOTING\nOn Thursday, June 13, 2013 Memphis Police officers received a \"Shooting\" call with one down in the 3100 block of Cypress Lake in the Madison at Cypress Lake Apartment Complex.\nUpon arrival, officers were advised by Corey Levy that he had been robbed and shot. Levy stated he had just completed a pizza delivery at a nearby residence. As he began to leave he was approached by three (3) male blacks. At least one was armed with a gun. Without provocation, one of the robbers shot Levy. The suspects took an unspecified amount of money from Levy and fled the scene.\nLevy was assisted by a resident in the complex. He was transported to the Med in critical condition. The three robbers are described as follows:\nMale, black, wearing a black shirt and black pants\nMale, black, wearing a white shirt and black pants\nDescribed only as a male black\nRidgeway Station GIB investigators need someone to come forward with information to help solve this crime.\nJune 7, 2013\n$10,000 AWARD OFFERED FOR IDENTIFICATION AND CHARGING OF SUSPECT\nOn Friday, August 3, 2012, at approximately 11:40 p.m., officers responded to a shooting at Perkins/ I-240. Jerod Lewis, a 25-year-old male was found inside his gold, 4-door, 1995 Infinity J30 suffering from a gunshot wound. Lewis was transported to the Regional Medical Center in critical condition, but was later pronounced dead at the hospital.\nNo suspects have been charged or held accountable. The family of Jerod Lewis is offering an additional $10,000 award for information leading to the identification and charging of the suspect(s) responsible for this murder. Homicide investigators ask that anyone that was at that location when this shooting occurred, or knows who is responsible for this murder, to call Crime Stoppers at 901-528-CASH.\nMay 31, 2013\nHOME INVASION ROBBERY\nOn Sunday, May 26, 2013, at approximately 3:20 p.m., officers responded to a Robbery of an Individual call at 2150 Vollintine. Upon arrival, officers located a 79-year-old male victim, who advised that a male approached him in his yard, initiating a conversation. During the conversation, the victim turned his back, at which time the man grabbed the victim and stuck an object against his back, implying he had a gun. The suspect then forced the victim into his residence and made him lie face down on the floor. The man bound the victim's hands, then ransacked the residence, taking numerous items before fleeing the scene on foot in an unknown direction.\nThe suspect is described as a male Black, 45 to 50 years of age, approximately five feet eight inches tall, 180 pounds with short dreads above the shoulders, dark complexion, clean shaven and wearing khaki cargo shorts. Crump Station investigators need someone to come forward with information to help solve this crime.\nMay 23, 2013\nHOMICIDE\nOn Sunday, May 12, 2013, at approximately 2:30 a.m., officers responded to a shooting call at 5099 Steuben. Upon arrival, officers located 23-year-old Simi Girley in the driver's seat of a 2005 Chevrolet Monte Carlo. Girley had been shot and was pronounced dead on the scene. Officers were advised that several shots were heard, and a gray vehicle was seen leaving the area shortly after the shooting occurred. Homicide Investigators need someone to come forward and help solve this murder.\nMay 16, 2013\nHOMICIDE\nOn Wednesday, May 8, 2013, at approximately 10:25 p.m., officers received a shooting call to 1645 McLemore. Upon arriving, officers found the victim Marcus Mosby, 23, with an apparent gunshot wound. Mosby was transported to the Regional Medical Center in critical condition but was later pronounced dead at the hospital.\nThe preliminary investigation revealed that Mosby was shot during an attempted robbery. The suspects responsible were possibly occupying a dark colored SUV. Investigators need someone to come forward and help solve this murder.\nMay 10, 2013\nHOMICIDE\nOn Wednesday, May 1, 2013, at approximately 5:25 a.m., officers received a shooting call to 1498 Gausco. Upon arrival, officers found the victim, George Hooks, age 50, lying in the street with a gunshot wound. Hooks was pronounced dead on the scene. Investigators need someone to come forward and help solve this murder.\nMay 2, 2013\nHOMICIDE\nOn Monday, April 22, 2013 at 10:29 a.m. officers responded to a call at 3509 Blackberry Bush #2. When officers arrived on the scene they found the body of Renisha Johnson in her bed. Renisha had been shot and was pronounced dead on the scene. Investigators need someone to come forward and help solve this murder.\nApril 25, 2013\nBusiness Robbery\nOn April 10, 2013, at approximately 7:50 p.m., two armed males entered T-Mobile at 8385 Stage Road and robbed the business. The males held employees at gunpoint, threatened to kill them, and demanded access to a locked case that contained assorted smart phones. The males took approximately 40 phones and fled from the business.\nThe suspects are described as follows: No. 1, African-American, male, 20-30 years old, approximately 5'10\", 180 pounds, black hoodie, blue jeans, black bandana, armed with a black semi-automatic handgun; No. 2, African-American, male, 20-30 years old, approximately 5'10\", 180 pounds, yellow hoodie, blue or black bandana, dark pants (possibly blue jeans).\nThe next day, two males attempted to sell a large quantity of new T-Mobile phones at a Memphis area wireless store. The two men were caught on the store's video surveillance. Those phones have since been linked to those stolen in the robbery. The photos appear here.\nInvestigators need help to identify these suspects and hold them accountable. Anyone with information on this business robbery or who can identify the suspects captured by surveillance is encouraged to call Crime Stoppers at 528-CASH or the Safe Streets Task Force at 922-5215.\nApril 19, 2013\nHOMICIDE\nOn Wednesday, April 3, 2013 at 7:24 p.m., officers responded to a shooting call at 5918 Hazards Cove, The Crossings of Fox Meadows Apartments. Officers arrived on the scene and found the victim, Tony James, lying on the floor in the hallway of the apartment suffering from what appeared to be a gunshot wound. Memphis Fire Department Ambulance Unit #14 transported James to the hospital in critical condition. At 8:13 p.m. James was pronounced DOA at The Med.\nInvestigators need someone to come forward and help solve this murder.\nApril 12, 2013\nFATAL HIT AND RUN\nOn Thursday, March 28, 2013, at 10:01 PM, Malcolm Wright was struck by a hit and run driver operating a small, dark-colored pickup truck on Elvis Presley, south of Winchester. The pickup truck was heading southbound on Elvis Presley in the left lane when it struck Wright, a pedestrian. The front of the pickup should have damage consistent with striking a person. The pickup truck's left mirror also was broken off.\nA witness described the vehicle as being a small, dark compact truck. It was last seen continuing southbound on Elvis Presley. Investigators need someone with information on the driver and / or the pickup truck to come forward to help solve this vehicular homicide.\nApril 4, 2013\nHOMICIDE\nOn Monday, March 11, 2013 at 6:43pm officers made the scene of a shooting at 3239 Forest Glen. Upon arriving they discovered that the victim, Constantin McNutt, had been shot. He was transported to the MED where he was pronounced dead.\nWitnesses advised that the victim was checking on rental property when two male blacks approached him armed with handguns and shot him. The investigation is ongoing.\nROBBERY\nOn Wednesday, March 3, 2013, at approximately 6:18PM, a victim was robbed by an armed suspect on the parking lot at 2626 North Watkins. After the robbery, the suspect got into a blue-colored, four-door Dodge pickup, which was driven by a second suspect. The crime was captured on surveillance video, with a photo taken from the video. The video can be viewed by following this link: http://memphis.crimestoppersweb.com/crimeoftheweek.aspx\nThe suspect is described as a Black male with a scar on his face, wearing a dark colored striped hoodie and dark colored pants. The Memphis Police Department needs someone to come forward with information to help solve this crime.\nMarch 15, 2013\nHOMICIDE\nOn Saturday, January 12, 2013, officers responded to a shooting call at 6020 Squire Court in the Bella Vista Apartments and found two males with gunshot wounds. Both victims were transported to Regional Medical Center in critical condition.\nOne 20-year-old male has since been released from hospitalization and continues to recover from his injuries. A second 20-year-old male, Albert Spencer, Jr., died four days later from wounds received in the shooting.\nInvestigators learned an argument developed outside immediately before the shooting. Albert Spencer is believed to have been an unintended target. Although several persons were in the vicinity, a clear description on the suspects has not been developed. Investigators need someone to come forward and help solve this senseless murder. No arrests have been made.\nMarch 8, 2013\nSHOOTING\nOn Tuesday, March 5, 2013, at approximately 1:46 a.m., officers responded to a shooting at Manassas and Mosby. Upon arrival, officers found a 39-year-old male victim with an apparent gunshot wound. The victim was transported to the Regional Medical Center in critical condition. There are no witnesses to the shooting and the investigators need someone to come forward with information to help solve this shooting.\nMarch 1, 2013\nHOMICIDE\nOn Friday, February 1, 2013, at 2:19 p.m., officers responded to a shooting at 101 West Mallory. Upon arriva, officers found 28-year-old Walter Marlow with an apparent gunshot wound. Marlow was transported to the Regional Medical Center where he was later pronounced dead. The preliminary investigation revealed that Marlow was shot during a robbery. Homicide investigators need someone to come forward with information to help solve this murder.\nFebruary 22, 2013\nHOMICIDE\nOn Wednesday, August 01, 2012 at 3:05pm officers made the scene of a shooting at 1058 Bradley. Upon arriving they found the victim, Billy Webb, who had been shot during a robbery attempt. Webb's girlfriend advised that an unidentified male black got into the back seat of Webb's car, pulled a gun and demanded money from the victim. The girlfriend jumped out of the car, fled, and then heard a gunshot. Webb was transported to the MED where he was pronounced dead. Homicide investigators need someone to come forward with information to help solve this murder.\nFebruary 15, 2013\nHOMICIDE\nOn Tuesday, February 6, 2013, at approximately 9:40 p.m., officers responded to a \"Man Down\" call at 402 Hodges. Upon arrival, officers located the complainant who advised that she had not heard from the victim in several days. The complainant further said that she had knocked on the door of the residence but no one answered. The Memphis Fire Department was contacted and forced entry was made.\nThe victim was located pronounced dead on the scene. The preliminary investigation revealed that the victim suffered from an apparent gunshot wound and appeared to have been deceased several days. Homicide investigators need someone to come forward with information to help solve this murder.\nFebruary 1, 2013\nHOMICIDE\nOn Friday, February 1, 2013, at 2:19 p.m., officers responded to a shooting at 101 West Mallory. Upon arrival, officers found 28-year-old Walter Marlow suffering from an apparent gunshot wound. Marlow was transported to the Regional Medical Center where he was later pronounced dead.\nThe preliminary investigation revealed that Marlow was shot during a robbery. Homicide investigators need someone to come forward with information to help solve this murder.\nFebruary 1, 2013\nHOMICIDE & AGGRAVATED ASSAULT\nOn Tuesday, January 22, 2013 at 12:10 a.m., officers responded to a shooting call at 830 Crockett Place where they found two victims, 28-year-old Marion Holmes, and 27-year-old Patrick McGee suffering from gunshot wounds. Holmes was transported to the MED, where he was pronounced dead. McGee was transported to the MED in non-critical condition.\nThe preliminary investigation revealed that three male blacks came inside 830 Crockett Place with handguns drawn and ordered the victims to the floor The victims attempted to run out the back door when the suspects started shooting, striking Holmes and McGee. No arrests have been made at this point. Homicide investigators need someone to come forward with information to help solve this murder.\nJanuary 25, 2013\nHOMICIDE\nOn Saturday, January 19, 2013, at 10:06 p.m., officers responded to a shooting at the Z-Market, 2903 South Perkins. Upon arrivial, officers located the victim, 28-year-old Rene Trejo, with an apparent gunshot wound. Trejo was transported to the Regional Medical Center where he was later pronounced dead.\nThe preliminary investigation revealed that the victim and two other males were sitting inside the victim's vehicle when three male Blacks approached them demanding money. One of the suspects fired a shot striking the victim. No arrests have been made at this point. Homicide investigators need someone to come forward with information to help solve this murder.\nJanuary 12, 2013\nSEX CRIME\nAfter 8:30 p.m. on Monday December 31, 2012 — New Year's Eve — a 15-year-old female returning home from a business at Latham and Walker was approached by two unknown suspects who reportedly kidnapped her. The suspects allegedly took the victim to an abandoned house in the area of Latham and South Parkway where she was rendered unconscious, kept overnight, and was possibly sexually assaulted. She awoke and left the house around 11 a.m. New Year's Day.\nInvestigators are looking for two suspects:\nSuspect #1 is described as a male Black with a light complexion and a large scar on the right side of his face. The scar extends from above his right eye down to the middle of his right cheek. He was wearing a gray hoodie, dark pants and white shoes. He is in his early to mid-twenties with a low haircut and no facial hair.\nSuspect #2 is described as a male Black with a dark complexion in his early twenties. He was wearing a black jacket. Investigators need someone to come forward with information to help solve this crime.\nJanuary 4, 2013\nHOMICIDE/ASSAULTS\nOn Monday, December 24, 2012 — Christmas Eve — at 3:10 a.m., officers responded to an Aggravated Assault call at Fourth and Peabody Place. The officers arrived on the scene and found 24-year-old Randy Williams lying on the sidewalk, suffering from an apparent gunshot wound. Williams was transported to the Regional Medical Center where he was later pronounced dead.\nA second victim, a 22-year-old male, was located at the corner of Beale and Fourth with an apparent gunshot wound. This victim was transported to the Regional Medical Center in critical condition.\nA third victim, an 18-year-old male, was taken from the scene to the Regional Medical Center by a private vehicle where he is currently listed in non-critical condition.\nHomicide investigators need someone to come forward with information to help solve this case of murder and aggravated assaults.\nDecember 28, 2012\nHOMICIDE\nOn Sunday, December 16, 2012, at approximately 10:32 p.m., officers responded to a shooting at 743 S. Parkway, Parkway Grocery. Upon arrival, officers located Demario Wilson lying in front of the business with an apparent gunshot wound. The victim was transported to the MED in critical condition where he was later pronounced deceased.\nHomicide investigators need someone to come forward with information to help solve this crime.\nDecember 21, 2012\nHOMICIDE\nOn Friday, December 14, 2012, at 2:34 p.m., officers responded to a 911 call to 2592 Don Krag Drive West. Upon arrival, officers located 68-year-old Donald Rutley, with multiple stab wounds. He was pronounced deceased on the scene.\nHomicide investigators need someone to come forward with information to help solve this crime.\nDecember 7, 2012\nHOMICIDE\nOn Sunday, December 2, 2012, at approximately 12:05 a.m., officers responded to a Shooting call at 2827 Glasgow Street. Upon arriving on the scene, officers located the victim, 26-year-old Sammy Tidwell, sitting inside a 2008 BMW 650 with an apparent gunshot wound. The victim was pronounced dead on the scene.\nHomicide investigators need someone to come forward with information to help solve this crime.\nHOMICIDE\nOn Friday, November 2, 2012 at 8:00 p.m. officersresponded to a shooting call at the corner of Eldridge and Belvedere where they found Denterio Hudson lying in the middle of the street bleeding from the head and unresponsive. An ambulance made the scene and paramedics pronounced Hudson dead.\nHomicide investigators need someone to come forward with information to help solve this crime.\nNovember 16, 2012\nHOMICIDE\nOn Saturday, November 3, 2012, at 1:51 p.m., officers were on routine patrol in the area of Grove and Neptune when they observed a 2011 Hyundai Sonata parked in the alley. Upon approaching the vehicle, officers observed 44-year-old Lonnie Franklin lying on the ground next to the vehicle. The victim suffered from an apparent gunshot wound and was pronounced dead on the scene.\nInvestigators need someone to come forward with information to help solve this crime.\nNovember 9, 2012\nHOMICIDE\nOn Tuesday, November 6, 2012, at approximately 2:55 p.m., officers responded to a \"man down\" call at 4487 Leatherwood. Upon arrival, officers found the body of the victim lying in the yard. The victim had been shot and was pronounced deceased on the scene.\nThere are no known witnesses at this time. Homicide investigators need someone to come forward with information to help solve this crime.\nHOMICIDE\nOn Friday, October 26, 2012, at approximately 11:15 p.m., officers responded a shooting call at Lamar and Clearpool. Upon arrival, officers found the victim, 22-year-old Mary Hall, who had been shot. The victim was transported in critical condition to the Regional Medical Center. She was later pronounced dead at the hospital.\nHomicide investigators need someone to come forward with information to help solve this crime.\nOctober 27, 2012\nHOMICIDE SOLVED!\nOn Monday, October 22, 2012, at approximately 3 a.m., officers responded to a shooting at the Level II Club, 5020 American Way. Upon arriving on the scene officers were advised that several victims were attempting to leave the Level II Club in a 2002 Chevrolet Malibu when an unknown suspect drove by and shot several times into the victim's vehicle.\nThe driver, Derrick Lane, and two passengers, Cameron Merritt and an unidentified male, were shot. A fourth unidentified male victim, who was not injured, removed Lane from the driver's seat and moved him to a rear passenger seat. Victim #4 then drove all of the victims onto the Ballinger's BP Station parking lot at 4971 Park Avenue where police were called for assistance.\nDerrick Lane was pronounced dead on the scene. Cameron Merritt, was transported to the Regional Medical Center, where he was later pronounced deceased. Unidentified victim #3 was transported to the Regional Medical Center in critical condition. Victim #4 was not injured. Homicide officers need help solving this crime.\nOctober 20, 2012\nHOMICIDE\nOn October 6, 2012, at 9:30 a.m., officers responded to a \"Man Down\" call at 3596 Cook Road. Upon arrival on the scene, officers located 50-year-old George Cole with facial trauma. An ambulance was called to the scene, and paramedics pronounced the victim deceased.\nThere is no suspect information available. Homicide investigators need someone to come forward with information to help solve this crime.\nOctober 12, 2012\nHOMICIDE\nOn October 9, 2012, at approximately 7:20 p.m., officers responded to a shooting at 3068 South Perkins. Upon arrival officers saw a vehicle on South Perkins near Aloha which had struck a utility pole. Officers found Runeccia Luster inside the crashed vehicle.\nThe on-scene investigation revealed that Luster had just left the Orion Federal Credit Union's ATM located at 3120 South Perkins. While at the ATM, two male black suspects had attempted to rob her. The suspects shot Luster. She then drove off and crashed into the utility pole. An ambulance was called to the scene at South Perkins and Aloha and transported Luster to the Regional Medical Center, where she was pronounced deceased.\nThe same suspects then attempted to carjack Charles Ratliff at 3084 South Perkins. Ratliff was shot twice by the suspects as he drove away. The suspects did not get Ratliff's vehicle. Charles Ratliff was transported by ambulance to the Regional Medical Center in critical condition.\nThe suspects fled the scene on foot and have not been apprehended. Both are described as male blacks. One was wearing a white \"hoodie.\" The Homicide Bureau is currently in charge of this investigation. Investigators need someone to come forward with information to help solve this case. CrimeStoppers appreciate the additional $10,000 award offered in this case by Orion Federal Credit Union.\nOctober 6, 2012\nHOMICIDE\nOn September 15, 2012, at approximately 8:23 p.m., officers responded to a shooting at 2405 Lindbergh. Upon arrival officers located the victim, 34-year-old Eric Campbell lying on the ground and suffering from an apparent gunshot wound.\nAn ambulance transported Campbell to the Regional Medical Center where he was pronounced deceased. It appears that Campbell was shot during an attempted robbery. Homicide investigators need someone with information about this crime to come forward.\nOctober 1, 2012\nHOMICIDE\nOn Wednesday, September 19, 2012, at approximately 3:50 p.m., officers responded to a shooting call at 810 Western Park. Upon arrival, officers located 18-year-old Devail Lewis lying on the ground in the park behind the community center with multiple gunshot wounds. An ambulance was called to the scene where the victim was pronounced deceased by paramedics.\nThere is no suspect information available at this time and the investigation is ongoing. Homicide investigators need someone to come forward with information to help solve this crime.\nSeptember 21, 2012\nROBBERY\nOn Friday, August 14, 2012 at 9:15 p.m. officers responded to a Robbery of Individual at 180 Market Place. Upon arrival officers located a female victim who reported that she had just gotten off a MATA bus at Third and Market when two males stole her purse and physically assaulted her.\nSuspect #1 is described as a male Black, 17-20 years of age, 6'0, 165lbs, short haircut, wearing a peach or pink shirt and khaki pants. Suspect #2 is described as a male Black, 17-20 years of age, 5'6, 145, short hair, wearing a white T-shirt and black shorts. Still shots and video of the suspects are available by following this link: http://memphis.crimestoppersweb.com/crimeoftheweek.aspx.\nNo arrests have been made at this point.The investigation is ongoing.\nSeptember 14, 2012\nHOMICIDE INVESTIGATION\nOn Tuesday, September 4, 2012 at 7:26 p.m., officers made the scene at 337 South Fourth concerning an injured person. Upon arrival, officers found victim William Campbell,lying on the floor and bleeding. Campbell was transported to the MED in critical condition. At 10:46 p.m., he was pronounced deceased.\nHomicide investigators need someone to come forward with information to help solve this murder.\nSeptember 12, 2012\nHOMICIDE INVESTIGATION\nOn Monday July 2, 2012 at 2:47 p.m., officers made the scene at 4268 Boyce concerning a found body. Upon arrivial, officers found Shawn Marbury lying on the living room floor with an apparent gunshot wound. Shawn Marbury was pronounced deceased.\nHomicide investigators need someone to come forward with information to help solve this murder.\nSeptember 02, 2012\nROBBERY\nOn August 24, 2012, at approximately 1:35 a.m., officers responded to a Robbery call at 2686 Select. Upon arrival, officers located a 32-year old male, Eric Fitzpatrick, suffering from multiple gunshot wounds.\nThe preliminary investigation revealed that the victim, and a 30-year old female and their children (ages 8 and 9) had just arrived home when they were approached by two armed males. The victims were forced inside the house. After demanding money from Eric Fitzpatrick, shots were fired, striking him. Fitzpatrick was transported to the Regional Medical Center in extremely critical condition. There were no other reported injuries on the scene.\nSuspect #1 is described as a male Black, 5'4\", 115 pounds in his early 20's, with a dark complexion. Suspect #2 is described as a male Black, 5'11\", in his early 20's, with a dark complexion. Robbery investigators are currently in charge of this investigation and need someone to come forward with information to help solve this crime.\nAugust 24, 2012\nJEWELRY STORE ROBBERY\nOn August 15, 2012, at approximately 8:26 pm, officers responded to a Business Robbery at Zales Jewelry, located at 4465 Poplar Avenue inside the Oak Court Mall. Two male black suspects, posing as customers got the clerk to unlock a jewelry case to show them some rings. The suspects then reached into the case and stole jewelry. They fled the business in a Chevrolet Impala with no tags.\nSuspect #1 is described as a male Black, 6'1\", 220 lbs, with a bald head, wearing a white shirt and blue shorts. Suspect #2 is described as a male Black, 6'3\", 240 lbs, wearing a white shirt, tan shorts, and a dark-colored baseball cap. Robbery investigators need someone to come forward with information to help solve this crime.\nAugust 19, 2012\nHomicide\nOn Wednesday, August 1, 2012, at approximately 5:40 p.m., officers received a shooting call to 2354 Douglass. Upon arrival, officers located the victim, 62-year-old Winford Williams, lying on the ground with an apparent gunshot wound. He was pronounced deceased on the scene. Homicide investigators need someone to come forward with information to help solve this crime.\nAugust 10, 2012\nHomicide\nOn Friday, August 3, 2012, at approximately 11:40 p.m., officers responded to a DOA call at Perkins and I-240. Upon arrival, officers located 25-year old Jerod Lewis inside a vehicle with an apparent gunshot wound. The victim was transported to the Regional Medical Center in critical condition. He was later pronounced dead at the hospital. There is no suspect information available. Homicide investigators need someone to come forward with information to help solve this crime. liminary investigation revealed an unknown male broke into the residence and fired multiple shots fatally wounding both victims.There is no suspect description at this time. The Homicide Bureau is in charge of this investigation and the Investigators need someone to come forward and help solve this case.\nHomicide\nOn July 26, 2012, at approximately 12:08 a.m., officers made the scene of a home invasion at 65 East Yates. Upon arrival officers discovered two deceased males with multiple gunshot wounds inside the home. The victims have since been positively identified as 26-year old Anthony Conte, and 30-year old Robert Schmidt. The preliminary investigation revealed an unknown male broke into the residence and fired multiple shots fatally wounding both victims.There is no suspect description at this time. The Homicide Bureau is in charge of this investigation and the Investigators need someone to come forward and help solve this case.\nJuly 21, 2012\nHOMICIDE INVESTIGATION\nOn Thursday, July 5, 2012, at 8:29 p.m., officers responded to an aggravated assault at 838 Walker. Upon arrival officers located 29-year-old Fredrick Poplar with an apparent gunshot wound. The victim was transported to the Regional Medical Center in extremely critical condition but was later pronounced deceased at the hospital. The preliminary investigation revealed that a white SUV approached the victim and someone from inside fired a shot and struck him. No arrest has been made at this point and Homicide investigators need someone to come forward with information to help solve this murder. A video of the incident from surveillance can be found by following this link: http://memphis.crimestoppersweb.com/crimeoftheweek.aspx\nJuly 14, 2012\nHOMICIDE INVESTIGATION\nOn Monday, July 2, 2012 at 2:47 p.m., officers arrived at 4268 Boyce concerning a found body. Upon arrival officers saw the victim, a 46-year-old male, lying on the living room floor with an apparent gunshot wound. The victim was pronounced deceased on the scene. He was later identified as Shawn Marbury. Homicide investigators need someone to come forward with information to help solve this murder.\nSUSPECTS SOUGHT IN DRUGSTORE ROBBERIES\nOn Thursday, June 21, 2012, at approximately 1:10 a.m., the Walgreens Pharmacy located at 3515 Park Avenue was robbed by an unknown male suspect. The suspect posed as a customer and when the pharmacy technician turned her back, the suspect jumped over the counter and took several bottles of prescription medications. No weapon was seen, but one was indicated. The suspect fled the scene in a white four-door vehicle, possibly a sedan.\nOn Monday, June 25, 2012, at approximately 3:02 a.m. the Walgreens Pharmacy located at 6310 Poplar Avenue was robbed. Two unknown male suspects entered the store posing as customers. One of the suspects jumped over the counter and took several bottles of prescription medications. Officers were advised that both suspects fled the scene in a white vehicle.\nOn Thursday, June 28, 2012, at approximately 3:28 p.m., the Fred's Pharmacy located at 5106 Summer Avenue was robbed by an unknown male suspect. The suspect reportedly entered the store and jumped over the counter while armed with a handgun. The suspect took several bottles of prescription medications. The suspect then fled to the parking lot where he jumped into a white vehicle that was driven by an unknown suspect. Both suspects fled the scene in an unknown direction.\nOn Monday, July 02, 2012, at approximately 5:37 a.m., the CVS Pharmacy located at 6620 Winchester Road was robbed by unknown male suspects. The suspects reportedly entered the store posing as customers before robbing the pharmacy. One of the suspect implied a weapon then took several bottles of prescription medications. The suspects then went to the parking lot and left the scene in an unknown direction.\nNo injuries were reported from any of the robberies. It is believed they are connected. The two suspects have been described as male blacks, between 25 and 40 years old, 5\" 9\" to 6' 2\", 180 to 245 pounds, with medium to dark complexions.\nNo arrests have been made at this point and this is an ongoing investigation. A photograph and video from surveillance can be found by following this link: http://memphis.crimestoppersweb.com/crimeoftheweek.aspx\nAggravated Assault\nOn Saturday, June 16, 2012, approximately 5:30 a.m., a 31-year-old male was shot several times and transported to Regional Medical Center in critical condition. The victim remains hospitalized in critical condition and faces a lengthy recovery period. At the time of the shooting, the victim was leaving Mariscos El Gallo Giro Club at 3096 Lamar Avenue when he was confronted without warning by a Latino male armed with a handgun. The victim fell near a Laundromat at 3088 Lamar. The suspect is described as approximately 30-years-old, 5' 5\", 170 pounds, wearing a white t-shirt. He fled in a brown Sedan, similar to a Ford Taurus. Memphis Police Department's Felony Assault Unit is in charge of this investigation. Investigators need someone to come forward and help solve this crime.\nHomicide -SUSPECT ARRESTED\nOn Wednesday, June 6, 2012, at 6:16 a.m., officers received a call to 155 Market Street, outside St. Mary's Catholic Church. Upon arrival officers located a female victim lying on the ground and bleeding from her head. The victim was pronounced dead on the scene. There were no witnesses located and no suspect information. Homicide investigators need someone to come forward with information to help solve this murder.\nHomicide\nOn May 29, 2012, at approximately 8:10 p.m., officers responded to a wounding call at Scott and Johnson. Upon arrival the officers discovered the victim sitting on the curb with a puncture wound to the chest. The victim was transported to the MED where he died several hours later. There were no witnesses located and no suspect information given. Homicide investigators need someone to come forward with information to help solve this murder.\nRobbery\nrevealed a male entered the business posing as a customer; the male jumped the counter, pushed the store employee, took cash from the cash register and fled the scene on foot. The suspect is described as a male black, 20-25 years old, about five foot seven inches tall, 175 lbs, who possibly goes by the name \"Marcus\". This robbery was captured on store surveillance. A video and picture of the suspect can be viewed by following this link: http://memphis.crimestoppersweb.com/crimeoftheweek.aspx Robbery investigators need someone to come forward with information to help solve this crime.\nHOMICIDE\nOn Saturday, April 21, 2012, at 10:08 p.m., officers responded to a shooting at 1018 Eldridge. Upon arrival on the scene, officers located a 33-year-old male suffering from multiple gunshot wounds. An ambulance was called to the scene and transported the victim, later identified as Marco Gilmore, to the Regional Medical Center in critical condition. A short time later, the victim died from his injuries. The preliminary investigation revealed that Marco Gilmore was shot several times when he answered the door for an unknown male. Homicide investigators need someone to come forward with information to help solve this crime.\nMidtown Roberries\nOn Tuesday, April 3, 2012, at approximately 11:25 a.m., officers responded to a robbery call at Vinton and Vinton Square. Upon arrival, officers located the 23-year old victim who advised he had been robbed. The preliminary investigation revealed the victim was walking home from work when he was approached by a late model, 4-door, dark gray Toyota Camry occupied by three males. Two of the males got out of the vehicle with silver handguns and demanded the victim's wallet, keys, and cell phone. The suspects, all described as male blacks in their early to mid 20's, fled the scene in the listed vehicle. One of the suspects was wearing a light-colored shirt and white baseball cap with a purple bill. Later that afternoon, at approximately 2:40 p.m., officers responded to Rozelle and Peabody regarding another robbery. Officers arrived on the scene and located the 17-year old victim who advised she had been robbed. The investigation revealed the victim was walking home when a late model, 4-door, dark gray, Toyota Camry pulled in front of her blocking her way. The male passenger pointed a silver handgun at the victim and demanded her purse and cell phone. After the victim gave the male her property, the suspects fled the scene in the Toyota. The suspects were described as two male blacks, possibly in their mid 20's. The suspect with the handgun is described as having short, curly hair, and wearing a black shirt with white writing on the front, and blue jeans. It is believed that the same suspects committed both robberies.\nHomicide\nOn Saturday, April 21, 2012, at approximately 10:08 p.m., officers responded to a shooting at 1018 Eldridge. Upon arrival, officers located a 33-year-old male suffering from multiple gunshot wounds. An ambulance was called to the scene and transported the victim, later identified as Marco Gilmore, to the Regional Medical Center in critical condition. A short time later, the he died from his injuries. The preliminary investigation revealed the victim was shot several times when he answered the door for an unknown male. Homicide investigators need someone to come forward with information to help solve this crime.\nPlatinum Jewelers Robbery\nOn Thursday, March 29, 2012 at approximately 5:40 pm. officers received a business robbery call at Platinum Jewelers located at 2200 N. Germantown Parkway. Upon arrival – Officers received information from employees of the business that three male blacks robbed them at gunpoint. Two of the males entered the business posing as customers then attacked the employee that was assisting them. The males then assaulted another employee and let the third suspect in through the rear door. They began taking jewelry from the display cases then left the business through the rear door. They were last seen leaving the business in a 2011 - 2012 \"Lime Squeeze\" metallic Ford Escape with a gash on the passenger side door(s). One of the suspects, Christopher L. Armstrong, has been identified and arrested in connection with this robbery, however; two of the remaining suspects are unknown and remain at large. The investigators need someone to come forward with information to identify the remaining suspects. A Photograph from surveillance video at Platinum Jewelers are attached along with the booking picture of Christopher L. Armstrong and a photo of a \"Lime Squeeze\" metallic Ford Escape.\nHOMICIDE\nOn Sunday, April 8, 2012, at approximately 6:35 p.m., officers responded to a shooting call at Kathy/ Merle streets. Officers arrived on the scene and observed a man lying in the street and unresponsive with multiple gunshot wounds. An ambulance was called to the location and paramedics pronounced the victim, Samuel Wilkes, deceased. There is no suspect information available at this time. Homicide investigators need someone to come forward with information to help solve this crime.\nHOMICIDE\nOn Friday, March 30, 2012, at approximately 9:30 pm, officers responded to a shooting at 710 Hazelwood. Officers arrived on the scene and observed a white vehicle in the backyard of 715 Hazelwood. Officers approached the vehicle and observed the victim, Calvin Jefferson, inside the vehicle and unresponsive. An ambulance was called to the scene and the victim was pronounced dead by paramedics. Witnesses reported seeing two male blacks approach the vehicle and then fire shots into the vehicle. No further suspect description could be given. Homicide investigators need someone to come forward with information to help solve this crime.\nHelp needed to ID robbery suspects\nOn Saturday, March 24, 2012, at 11:57 a.m., a woman was at the bus stop on Patterson just south of Mynders on the University of Memphis Campus when two men in a white or silver late 90's model Ford Crown Victoria pulled up and asked to use her cell phone.\nAt that time, the passenger of the car grabbed the victim's arm and took the phone from her. The victim was dragged alongside the car for a short distance and suffered minor injuries.\nA photo of the suspects' vehicle can be viewed by following this link:\nhttp://memphis.crimestoppersweb.com/crimeoftheweek.aspx\nThe suspects are described as two male Blacks, in their early 20's, wearing dark shirts. One suspect had braces or gold teeth. Robbery investigators need someone to come forward with information to help solve this crime.\nHOMICIDE\nOn Friday, March 16, 2012, at 3:50 a.m. officers responded to a \"man down\" call at 853 Faxon. Upon arrival on the scene, the victim, Louis Ray, 76 years old, told officers that several male blacks pulled up in a van and demanded a TV that he was pushing in a shopping cart. Ray advised that when he refused one of the men shot him. Ray later died from injuries he sustained. There was no further description given on the suspects. The Homicide Bureau is currently in charge of this investigation, and the investigators need someone to come forward with information to help solve this crime.\nHOMICIDE\nOn Wednesday, February 29, 2012, at 4:44 a.m., officers responded to a \"shots \" call at 3558 Devon, Verano Park Apartments.\nUpon arrival, the officers located the victim, Eric Cole, lying on the sidewalk in front of 3558 Devon, unresponsive and suffering from an apparent gunshot wound. An ambulance was called to the scene and Eric Cole was pronounced deceased.\nThere is no suspect information available.\nThe Homicide Bureau is currently in charge of this investigation, and the investigators need someone to come forward with information to help solve this crime.\nHOMICIDE\nOn Tuesday, January 17, 2012, at approximately 3 p.m., officers responded to a robbery call at 583 S. Parkway.\nUpon arrival, the officers were advised by the victim, Darryl Suggs, that he was robbed by two male blacks armed with handguns. Suggs told the officers that he complied and gave the suspects his money, and one of the suspects hit him on the head with a handgun. Darryl Suggs was transported to the hospital for his injuries, which he never recovered from. He died on February 6, 2012.\nNo further description was given on the suspects. The Homicide Bureau is currently in charge of this investigation, and the investigators need someone to come forward with information to help solve this crime.\nFATAL HIT & RUN\nOn Thursday, August 11, 2011, at 11 p.m., officers responded to a fatal hit and run accident at Summit and Vinton. Upon arrival on the scene, it was discovered that the victim, Christopher Davidson, had ridden a bicycle to a friend’s home in the 500 block of Summit after leaving the Hi-Tone Café, at 1913 Poplar.\nWhen he arrived, Davidson had abrasions to his forehead and told his friend a vehicle struck him as he rode. Davidson became ill, but did not seek immediate medical attention. Davidson’s condition worsened, and he eventually lost consciousness. He was transported to the Med and died two hours later from internal injuries. The Medical Examiners have ruled Davidson’s death as accidental caused by blunt force trauma. The vehicle which hit him left the scene.\nThe Memphis Police Department’s Traffic Office is currently in charge of this investigation. No suspects have been developed in this case and the investigators need someone to come forward with information on the suspect and suspect vehicle to help solve this crime.\nHOMICIDE\nOn Sunday, December 11, 2011, at approximately 2:14 a.m., Monroe Pierce, 86, was awakened in his home at 3014 Benjestown by an intruder. The intruder struck Mr. Pierce in the head with an unknown object and fled the scene after taking several items. Mr. Pierce was transported to the hospital in critical condition.\nOn Tuesday, January 31, 2012, Mr. Pierce succumbed to his injuries and died. The Homicide Bureau is currently in charge of this investigation, and the investigators need someone to come forward with information to help solve this crime.\nHOMICIDE\nOn Friday, February 3, 2012, at approximately 10:30 a.m., officers received a call to 593 East Crump concerning a possible found body.\nUpon arriving on the scene, officers located the body of 56-year-old Deborah Cleveland. Cleveland’s decomposed body was inside a trash can, which was located in the rear of Tal’s House of Spirits. Cleveland’s death has been ruled a Homicide.\nCleveland was previously reported missing by her brother on November 18, 2011. The Homicide Bureau is currently in charge of this investigation, and the investigators need someone to come forward with information to help solve this crime\nHOMICIDE\nOn Tuesday, January 17, 2012, at approximately 3:00 p.m., officers responded to robbery call at 583 S. Parkway. Upon arrival, the victim, Darryl Suggs, advised the officers that he was robbed by two male blacks armed with handguns. Darryl Suggs told the officers that he complied and gave the suspects his money and one of the suspects hit him on the head with a handgun. Darryl Suggs was transported to the hospital for his injuries, which he never recovered from and died on February 6, 2012. No further description was given on the suspects. The Homicide Bureau is currently in charge of this investigation, and the investigators need someone to come forward with information to help solve this crime.\nHOMICIDE\nOn Friday, January 20, 2012, at approximately 4 a.m., officers responded to a Shooting call at 754 N. Montgomery.\nUpon arrival, officers discovered a male victim in the front yard of 754 N. Montgomery who had been shot and was unresponsive. Witnesses reported seeing the victim running and asking for help. They then observed a silver or gray Dodge Ram truck pull up. A passenger in the vehicle got out and shot the victim. No additional suspect information could be given. The victim died and was later identified as Leonard Davidson.\nThe Homicide Bureau is currently in charge of this investigation, and the investigators need someone to come forward with information to help solve this crime.\nTWO FOUND DEAD\nOn Thursday, December 8, 2011, at approximately 2:50 p.m., officers responded to a shooting call at 830 Claybrook.\nUpon arrival, officers were advised that a male and female were inside the location and unresponsive. Officers entered the residence and found victims James Rucker and Melody Weddle with gunshot wounds. An ambulance was called to the scene and paramedics pronounced both Rucker and Weddle deceased.\nThe Homicide Bureau is currently in charge of this investigation, and the investigators need someone to come forward with information to help solve this crime.\nHomicide\nOn Saturday, December 24, 2011 at 8:24 p.m., officers responded to a \"wounding\" call at 8158 Forrest Park North. Officers arrived on the scene and located an unresponsive male black victim lying face up on the sidewalk. An ambulance was called to the scene, and the victim, later identified as Gus Crittle, was pronounced dead.\nThe Homicide Bureau is currently in charge of this investigation, and the investigators need someone to come forward with information to help solve this crime.\nHit and Run Fatality\nOn Friday, December 23, 2011 at approximately 6:20 p.m., officers were dispatched to Germantown Parkway and Walnut Grove where a pedestrian had been struck by a vehicle and the responsible party had left the scene.\nMemphis Fire Department paramedics made the scene and pronounced the victim dead. The preliminary investigation indicates that the victim was walking across Germantown Parkway when struck. A witness reported seeing a black vehicle with heavy front-end damage leaving the scene, headed southbound on Germantown Parkway.\nThis case is currently being investigated by the Memphis Police Department's Traffic Office.\nHOMICIDE\nOn Monday, October 17, 2011 at 1 a.m. officers made the scene of a shooting at 2871 Clearbrook. Upon arriving they discovered the victim, Anthony Rogers, lying on the front porch. Rogers had been shot and was pronounced dead on the scene.\nWitnesses advised seeing two men on the porch with Rogers and then hearing shots. One of the suspects left in a yellow 1986 Cadillac Fleetwood, bearing Tennessee tag 8WW-761, which had been used by the victim.\nThis case is currently being investigated by the Memphis Police Department's Homicide Bureau.\nDecember 15 2011\nTWO FOUND DEAD INSIDE HOME\nOn Thursday, December 8, 2011, at approximately 2:50 p.m., officers responded to a shooting call at 830 Claybrook. Upon arrival on the scene, officers were advised that a male and female were inside the location unresponsive.\nOfficers entered the residence and found two victims with gunshot wounds. An ambulance was called to the scene and paramedics pronounced both deceased. The victims have been identified as Melody Weddle and James Rucker.\nThere is no suspect information available and the investigators need someone to come forward with information to help solve this Homicide.\nDecember 02 2011\nHOMICIDE\nOn Wednesday, November 23, 2011 at approximately 2:35 a.m. officers responded to a \"shots fired\" call at 1112 Coppock. Upon arrival officers observed the rear door of the residence partially open. Officers entered the residence and located a female and a male with apparent gunshot wounds lying on the floor of a bedroom. An ambulance made the scene, and both victims were pronounced dead by paramedics.\nThe victims have since been identified as Nina Powell, female, 43 and Charlie Perry, male, 65. Homicide investigators need someone to come forward with information to help solve this crime.\nHOMICIDE\nOn November 21, 2011, at approximately 7 a.m., officers responded to a \"Man Down\" call in the area of 2768 Burns. Upon arrival, officers located a male with gunshot wounds lying on the ground at the rear of the residence. An ambulance was called to the scene, and the victim, Nicholas Taylor, was pronounced deceased.\nThe preliminary investigation revealed that the victim was walking from a store when he was approached by three subjects in a vehicle firing shots.\nThe Homicide Bureau is currently in charge of this investigation, and the investigators need someone to come forward with information to help solve this crime.\nHOMICIDE\nOn Thursday, September 15th, 2011, at approximately 8:48 a.m., Ridgeway Station officers responded to a complaint of a possible death at 6082 Knights Bridge. Upon arrival the officers were directed to 6056 Knights Bridge where they located the victim, Christopher Young, lying face down on the grass and unresponsive. The Memphis Fire Department arrived on the scene and the victim was pronounced dead.\nThere is no suspect information.\nThe Homicide Bureau is currently in charge of this investigation, and the investigators need someone to come forward with information to help solve this crime.\nHOMICIDE\nOn Sunday, October 23rd, 2011, at approximately 2:36 a.m., The Memphis Fire Department made the scene of a house fire at 161 Norwood. After extinguishing the fire they discovered the victim, Charles Perkins, lying on the floor. The Medical Examiner's investigator discovered a wound on the victim's chest.\nPolice have no suspect at this time.\nThe Homicide Bureau is currently in charge of this investigation, and the investigators need someone to come forward with information to help solve this crime.\nOctober 21, 2011"}