{"uri": "http://www.turnto23.com/news/local-news/pregnant-woman-shot-unborn-baby-killed-111915", "title": "Family members speak out after pregnant woman shot, unborn baby killed", "dct": "Thu, 19 Nov 2015 02:22:00 GMT", "id": "a1db8b07dc56f1ad512378082169bbe5", "content": "Autoplay:\nBAKERSFIELD, Calif. - Family members are speaking out after a pregnant woman was shot last night around 8:15 PM. The unborn child was killed as a result of the shooting.\nHer uncle, Tyrone Franklin, says the woman is Ruthie Jean Franklin.\nFranklin's sister, Shakayla Franklin, said Ruthie Jean Franklin is 20 years old.\nShakayla Franklin said Ruthie Jean Franklin and her boyfriend were sitting outside of their apartment when a man walked up, asked for a cigarette, and then two other men came up and started shooting.\nPolice couldn't confirm how many times Ruthie Jean Franklin was shot, but said at least one shot hit her in the stomach, killing her baby.\nFamily members said they don't know why her sister was shot.\n\"It was just unexpected, the whole thing was unexpected,\" said Eleece Wilbon, the victim's sister.\n\"I just don't understand why somebody would want to shoot her,\" said Tyrone Willis, the victim's uncle.\nPolice said they are investigating and did not know if it was gang related or connected to a string of recent shootings.\nSergeant Gary Carruesco of the Bakersfield Police Department said all deaths are unfortunate, but this one was especially difficult.\n\"The fact that this was an unborn baby it just tears at everybody's heart strings and we want to solve this case as quickly as we can,\" said Sgt. Carruesco.\nBPD said in a press release they know more people witnessed the shooting and are asking anyone with information to contact Detective James Moore at (661) 326-3540 or BPD at (661)327-7111.\nInformation can be provided through the secret witness hotline at (661) 322-4040 or you can send an anonymous text message to 274637, just include BPDCRIMES along with your message."}