{"uri": "http://wdtn.com/2014/12/23/child-killed-in-preble-county-shooting/", "title": "Accused shooter of 10-year-old had violent history", "dct": "Tue, 23 Dec 2014 02:10:00 GMT", "id": "ddb68a12835dbda3d45b11174fb3da75", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nNEW PARIS, Ohio (WDTN) – A ten-year-old girl was shot and killed during an apparent domestic dispute late Monday night.\nPreble County Sheriff Michael Simpson tells 2 NEWS deputies were called to a home in the 7800 block of New Paris Gettysburg Road in New Paris just before midnight.\nThe sheriff says it appears Brian Harleman, 43, shot the child and a 45-year-old woman as they were running out the back door, then fatally shot himself. Deputies found all three in the driveway.\nThe woman, who is the girl’s mother, was taken to Reid Hospital in Richmond, Indiana. She was later transferred to a hospital in Indianapolis due to the severity of her injuries.\nThe sheriff says Harleman used to live with the woman and her daughter. He also says there is a history of domestic violence between Harleman and the woman.\nAccording to a news release from the Preble County Sheriff’s Office, Harleman was arrested on December 17, 2014 and charged with domestic violence.\nA protection order was issued by Preble County Common Pleas Court against Harleman. His bond was posted on December 18 and he was released from jail.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}