{"uri": "http://www.nbcconnecticut.com/news/local/Man-Charged-in-New-Haven-Party-Shooting-307023031.html", "title": "Man Accused of Shooting 5 at New Haven Party Arrested", "dct": "Sun, 31 May 2015 00:00:00 GMT", "id": "fbe5a0ae940a5326c00bbbefb87b0462", "content": "NBCConnecticut.com\nNew Haven police have arrested a suspected of shooting five people at a private party in May.\nFayzon “Suki” Reboyras, 22, of New Haven, was taken into custody on Wednesday night after detectives saw him getting into a car, police said.\nHe has been charged with five counts of assault in the first degree, reckless endangerment in the first degree, carrying a pistol without a permit and unlawful discharge of a firearm.\nThe shooting was reported just before 2 a.m. on May 31, sending police to a private space on the second floor over Evolution Tattoo Parlor, at 849 Chapel Street.\nThree of the victims at the scene were transported by ambulance to Yale-New Haven Hospital and two others were taken to the hospital in a private car.\nJamie Rodriguez, 21, was the most badly injured. He was shot in the lower back, knee, groin and thigh and was listed in critical condition. Police said he was released from the hospital on Wednesday, weeks earlier than expected.\nJoshua Agosto, 25, was shot in the chest and buttocks, Gerald Pugh, 28, was shot twice in his leg and also in his right buttocks and thigh and Jovanni Leon Vargas, 23, was shot twice in one arm, once in the other and a bullet grazed his abdomen.\nA gunshot grazed 30-year-old Hector Martinez's upper back. All have been released from the hospital, police said.\nThe event the shooting happened at was a themed \"white party,\" where the guests wore white clothes.\nTwo groups were seen arguing earlier in the party and again toward the end, but private security guards separated them twice before the shooting, the initial reports indicate, according to police. Security brought the smaller group outside and kept the larger one inside so the dispute wouldn't \"spill out into the street,\" police said.\nMoments later, witnesses told police, a man re-entered the second floor space and opened fire with a semi-automatic handgun, emptying the weapon of all its bullets."}