{"uri": "http://www.abc-7.com/story/32519263/2-dead-several-injured-after-mass-shooting-at-fort-myers-club", "title": "2 dead, 18 injured after mass shooting at Fort Myers club", "dct": "Mon, 25 Jul 2016 08:38:00 GMT", "id": "0af80842b18df70aba9d12b11140c4be", "content": "FORT MYERS -\nTwo teens are dead and 18 people are injured after gunfire broke out in the parking lot of a Fort Myers club early Monday.\nPolice responded to Club Blu Bar and Grill, on Evans Avenue, around 12:30 a.m. and found several victims suffering from gunshot wounds.\n\"I got a call from a friend saying my brother was shot,\" said Dsean Archilles, who spent the night searching for his brother, Sean.\nThe club was hosting a Swimsuit Glow Party Sunday night for teens where no ID was required, according to a flyer promoting the event.\n\"Who has a club for kids? It doesn't make sense to me, honestly,\" said Lissa Laurent.\nNo alcohol was served during the party Sunday night because the club's liquor license was revoked on June 7th.\n\"We rushed over here and they said we couldn't go over here. They told us to go to Lee Memorial. We never found my little brother, we don't know where he went.\"\nMoments later, he learned his brother was one of the two people killed.\nDeceased victims identified\nThe victims who died have been identified as 18-year-old Stef'an Strawder and 14-year-old Sean Archilles.\nStrawder would have been a senior at Lehigh Senior High School. He played basketball for the school.\nFamily members said Strawder was shot in the abdomen and had to undergo emergency surgery. His family said Strawder's younger sister was shot in the leg.\nArchilles would have been an eighth-grader at Royal Palm Exceptional Center, according to the school district.\nUpdate on injured victims\nOfficials at Lee Memorial Health System held a briefing at 10:30 a.m. where they revealed there was a total of 20 victims.\nOne person died at the scene, and 19 were transported to Lee Memorial Hospital at the health system's sister hospitals. One of those patients later died.\nLee Memorial Health officials said victims started arriving around 1:30 a.m. via ambulance and some in personal vehicles. The ages of the patients range from 12-27.\nSixteen people were treated at Lee Memorial Hospital, many of which have been released.\nThree victims remained at the hospital Monday night. Two are in critical condition, and one is in fair condition.\nPolice said some victims were released from the hospital before providing statements to detectives. Those people are being asked to contact authorities.\nFacebook activated its Safety Check feature that allows users to notify friends and family that they are safe.\nActive investigation\nPolice said they have detained three persons of interest in connection with the shooting, including one person who was shot at by a Lee County deputy during a traffic stop along Ortiz Avenue, according to a source.\nAt a 2 p.m. news briefing, Fort Myers Interim Police Chief Dennis Eads said more suspects are being sought. He also made clear the incident was not an act of terror.\n\"We are currently working closely with the Florida Department of law-enforcement the Lee County sheriffs office the Federal Bureau of Investigation and the Alcohol Tobacco and Firearm agencies,\" he said. \"Everyone has put in a different role. There's a lot of investigative hours going into this. But I remain very resolved that justice will be served.\"\nThe parking lot of the club was roped off with a few hundred feet of crime scene tape as detectives scoured the scene.\nAt least 100 evidence markers were placed on the ground. It is unclear if all of those were guarding shell casings. We are told some of those casings are as long as a finger.\nThere were vehicles with bullet holes and shattered windows seen in the parking lot.\nA scene witnesses won't soon forget\nIt was a scene that'll be forever ingrained in the mind of witnesses.\n\"It was just everywhere. I didn't see anyone coming out. People were running in 'cause they knew it was from outside,\" said Lizy Figueroa. \"Right when I opened the door, I saw them drive off.\"\nTwo vehicles, she says, opened fire outside the club.\n\"It was like 15 gunshots, 20 gunshots back to back like an automatic weapon,\" said Juan Carlos Santbanez, as he recalled the sound of gunshots and the scene in which he saw some of the victims at the club.\n\"I'm sad. I'm heartbroken. I'm just sad to see this type of violence in our community. This was supposed to be a fun event for teens and this is how it turned out,\" said retired social worker Lori Lindquist, who's worked with teens in the county for years.\nWhen he heard about it via Facebook, Anthony Thomas, Jr. rushed over to the area to help in any way he could.\nHe learned that there was an altercation between an artist performing and some young men in the crowd. He said it boiled over into the parking lot, and after the show, the group opened fire on the artist and their entourage.\nThomas said the shooters had little regard for the lives of others, and that led to innocent bystanders being killed.\nAfter the chaos, he noticed that only a few people agreed to speak with the officers that were conducting interviews.\n\"The people that I talked to said they didn't want to talk to the police, and that was so disheartening considering we've just had a major attack here in our city. That they would not want to work with the police,\" Thomas said. \"I told them to talk to police or at the very least talk to members of the media who had begun to show up.\"\nHe said that in the four hours he spent with the eyewitnesses, few, if any, officers interviewed them about the shootings. He said many people were asked to leave the scene without their information being taken, which could have proven valuable to the case.\n\"I came down to leave my offering of love and I wanted the parents of the children that were killed and of those that were injured to know the community is behind them,\" Lindquist said.\nWitness goes live on social media moments after\nOne man was in the club parking lot right before the shooting.\nHe ran inside for cover, and when the shooting stopped, he came out and recorded the heartbreaking and chaotic scene.\n\"I just ducked and a lot of shots going off like 50, 60 gun shots went off, and I ran inside the building and security got shot and other kids running in there screaming, and it was just crazy,\" said Alex Alcime.\n\"It sounded like a pop gun, like a 22. Pow, pow! I'm like, oh my God!\"\nHe ran inside as others were struck by bullets.\n\"When I did go outside, I see a dead body of a young kid.\nMedics and officers soon arrived. That's when he decided to take to his social media.\n\"They taped everything off, and they was just telling me to get behind the tape, so I got behind the tape and said let me go live,\" Alcime said.\n\"I know a lot of people have seen my live video, and I would like to apologize for the profanity but I was really .. I was pissed off.\"\nAlcime said it was in the heat of the moment he wanted to feel like he could do something.\n\"Talk to the community, reach out to people, let them know, 'Look what's going on in the neighborhood.'\"\nAlcime said he hopes this tragedy will make our community stronger.\n\"Man, we need to stick together. We need to solve all this killing and all these problems.\"\nTwo other scenes\nPolice responded to two separate shootings in connection with the shooting. One at 2550 Parkway Street where the home and vehicles were shot at. There was one minor injury.\nThe other scene was on Ortiz Avenue between Luckett Road and Ballard Road where police said a person of interest was detained.\nBlood donations needed\nHealth officials said they are accepting blood donations as they are always in short supply, and it takes a tremendous amount of blood to save lives. Click here for donation locations.\n\"Blood is a resource in chronic short supply, not only in Fort Myers but throughout Florida and the country,\" said Dr. Mikulaschek. \"If anyone does feel the need to donate or wish to donate, we would gladly accept that.\"\nReaction from local, state leaders\nFlorida Governor Rick Scott arrived in Fort Myers Monday morning to meet with law enforcement officials regarding the mass shooting.\nHe spoke at a 2 p.m. news conference, alongside Florida Attorney General Pam Bondi, Mayor Randy Henderson and Interim Police Chief Dennis Eads.\nGov. Scott expressed his sorrow for the families of the deceased and injured and said the state would provide whatever resources it can.\nBondi said her office would also provide services to the families of the deceased and injured, including lost wages, counseling and medical expenses. She said local, state and federal leaders have been working hand-in-hand.\nMayor Henderson said the city has partnered with the Southwest Florida Community Foundation and the United Way to open the TOGETHER Fort Myers fund to assist the victims, families and those affected by the shooting.\nSeveral local leaders have also responded to the news of the mass shooting.\nTerolyn Watson, of Ward 3, said her daughter woke her up and told her the news. She said her daughter knew some of the victims.\nMichael Flanders, of Ward 4, spoke about curfew and questioned the rules.\nForest Banks, of Ward 5, said he believes it had to do with economic status and said there needs to be a dialogue.\n\"We've got to get serious about all of this,\" he said.\nGaile Anthony, of Ward 6, thanked police officers and stressed the importance of working to help the children of Fort Myers.\n\"We have to continue to do everything we can to keep this from happening,\" she said."}