{"uri": "http://www.fox4now.com/news/major-police-presence-at-two-locations-in-fort-myers", "title": "2 dead, 20 wounded at Fort Myers club shooting", "dct": "Mon, 25 Jul 2016 03:11:00 GMT", "id": "60bfa0854347d3931cc875afa8e5686b", "content": "Autoplay:Club Blu ShootingCONNECTING...XFort Myers Club Blu shootings - 8:54am Update\nFORT MYERS, Fla. -- - At least seventeen people were shot and two people were killed after gunfire erupted outside a Fort Myers nightclub on teen night late Sunday night and continued in other locations. Three people have been detained.\nA promising high school basketball player, 18-year-old Stef'an Strawder from Lehigh Senior High School, has been confirmed as a fatal shooting victim, along with 14-year-old Sean Archilles, who would have been an 8th grader at Royal Palm Exceptional Center.\nPolice confirm that the shootings were NOT an act of terror.\nThe call came in just before 1 a.m. The first scene is near the Club Blu Bar and Grill near the intersection of Evans Ave. and Carrell Rd.\nPolice in Fort Myers say they responded to the Club Blu at 3580 Evans Ave. and discovered several gunshot victims. Injuries ranged from minor to life threatening. All victims were transported from the scene by local hospitals.\nA Fox 4 crew on the scene at the Club Blu Evans Ave. location has confirmed there are at least two dozen evidence markers indicating shell casings on the ground outside of the Club Blu Bar and Grill. A witness, Syreeta Gary, told our reporter on the scene that it was a teen night event and her daughter had to run from a gunman as he fired shots at her and her friend. While Gary's daughter was not shot, she says her friend was shot in the leg as she ran for cover. Gary says the girl was taken to the hospital, but is expected to be OK.\nAnother witness told us a man outside of the club started yelling then opened fire, hitting multiple vehicles. It was not clear who he was targeting or why he started shooting. Police have not released any details on a possible motive for the attack.\nFort Myers police say two other scenes are connected with this incident. One is 2550 Parkway Street where a gunman shot at homes and vehicles. One person suffered minor injuries at that location. A witness told our crew that someone in a black Honda SUV was shooting randomly from the vehicle at the homes along the road. Our crew observed at least thirty shell casings in that area as several law enforcement officers investigated that incident.\nThe other location is on Ortiz Avenue between Luckett Road and Ballard Road, where three persons of interest have been detained in connection with the incident.\nThe Lee County Sheriff's Office says Ortiz Avenue was closed between Luckett and Ballard roads, but the area has deemed safe and secure and the road are now open..\nAccording to Lee Memorial Hospital, shooting victims overnight ranged in age from 12 to 27. Sixteen people were treated in the trauma center and emergency department.\nOne victim died at the hospital. Two patients are still in the Intensive Care Unit, and another was admitted to the hospital in fair condition. All others were treated and released.\nThe mother of a girl who was at the club when the shootings took place tells Fox 4's Malcolm Johnson the \"she was running from bullets.\"\nShe says her daughter was okay but her friend was hit by gunfire. \"Dodging bullets and dropping between cars. It's ridiculous that these kids have to go through this. They can't enjoy themselves because of other people that have criminalistic minds.\"\nThis morning, Club Blu released this statement on Facebook:\n\"We are deeply sorry for all involved. We tried to give the teens WHAT WE THOUGHT WAS A SAFE PLACE TO HAVE A GOOD TIME. Ages 12-17. There was armed security as well as full security,inside and out. As the club was closing and parents were picking their children up.....that's when all this took place. There was nothing more we could of done az you see it was not kids at the party that did this despicable act.\"\nFlorida Gov. Rick Scott says he's cancelling his scheduled events for the day to meet with officials in Fort Myers, where a nightclub shooting killed two and wounded 17.\nIn a statement, Scott says he's spoken with Fort Myers Mayor Randy Henderson, Lee County Sheriff Mike Scott and Ft. Myers Interim Police Chief Dennis Eads to offer any assistance from the state.\n“Following the horrific news of a shooting at a nightclub in Ft. Myers, I spoke with Ft. Myers Mayor Randy Henderson, Lee County Sheriff Mike Scott and Ft. Myers Interim Police Chief Dennis Eads to offer any assistance from the state. I have cancelled my scheduled events today to meet with law enforcement and local officials in Ft. Myers. While we are still learning the details about what happened this morning, we know that some of the victims of this terrible incident were children. We will continue to pray for the victims and their families.”\nIn another release by the city of Fort Myers, Mayor Randall Henderson provided the following statement:\nWe are deeply saddened by the shootings that took place in the City of Fort Myers early this morning. At this time we are still working with law enforcement to gather information on these events. Investigators are working very hard to determine a motive and find answers to questions.\nOur thoughts are foremost with the victims - Sean Archilles age 14 and Stef’an Strawder age 18 - and their families.\nFort Myers is not immune to crime and unfortunately not spared acts of violence and shootings as other cities across the country have experienced. We have watched events like this unfold too many times, but when it occurs in our city, it hits directly to our hearts.\nThe Fort Myers Police Department confirms that this incident is not an act of terror or terrorism.\nI want to thank our local law enforcement – the Fort Myers Police Department and the Lee County Sheriff’s Office - who responded immediately and were able to apprehend three suspects. It is because of the joint task force between these agencies that was set up last September that they were able to come together so quickly and the suspects are now in custody. This is an example of how this task force has been able to successfully prioritize the health and well-being of our citizens.\nI also want to commend our local medical personnel at Lee Memorial Health System, specifically Lee Memorial Hospital and Cape Coral Hospital for their role in administering to the victims.\nIf anyone has any information regarding this case they are requested to contact the Fort Myers Police Department at 321-7700. Callers may also call Crime Stoppers at 1-800-780-TIPS or text message C-R-I-M-E-S (274637) Keyword FMPD. Tipsters can remain anonymous.\nCopyright 2015 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}