{"uri": "http://www.wsoctv.com/news/local/1-killed-in-southwest-charlotte-shooting-officials-say/459234218", "title": "Teen killed day before birthday in Steele Creek shooting, police say", "dct": "Sat, 22 Oct 2016 22:51:00 GMT", "id": "a41188996f85a0d24d9d3f56068c8681", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCHARLOTTE, N.C. - CMPD has charged Terrance Gilbert with the murder of a teen shot just one day before his birthday.\nJahee Hoke, 17, was shot and killed on Armour Ridge Drive in Steele Creek Thursday night during a disturbance that neighbors said looked like a riot.\nIMAGES: Teen killed in Steele Creek\n“To me it was traumatic because I heard the shots and could've sworn that one of them came through the woods,” resident Diana Brown said.\nDozens of people, many of them teenagers, gathered in the neighborhood Thursday at 6 p.m. after neighbors said a fight between two girls at Olympic High School happened earlier in the day.\nHoke was among those who showed up on Armour Ridge Drive but neighbors said he was not the intended target and was actually trying to calm others down before the shooting started.\nCMPD working a fatal shooting in Steele Creek off Armour Ridge drive. @wsoctv pic.twitter.com/Gps46xUeo3\n— Lauren Ratcliffe (@LRatcliffeNews) October 21, 2016\n“It started with two or three gunshots and then it was probably 8 or 9 or possibly 10 more, and then it was like, this is for real,” said a neighbor who did not want to be identified.\nBy Friday morning the quiet had returned to Armour Ridge Drive, but neighbors said echoes of Thursday night’s violence will ring for some time.\n\"I tried to come in, there were so many cops you couldn’t get through anywhere,” neighbor Zak Venturato said. “I had no clue what was going on. As soon as I got in they told me everything. It's crazy.\"\n“Yeah, what is going on? Why is this happening? Why is there so much anger and sadness? It just breaks my heart,” Brown said.\nCheck back with wsoctv.com for updates on this story.\nRead more top trending stories on wsoctv.com:\n© 2017 Cox Media Group."}