{"uri": "http://www.wvalways.com/story/31406612/juvenile-dies-after-morgantown-man-allegedly-mishandles-handgun", "title": "Juvenile Dies After Morgantown Man Allegedly Mishandles Handgun", "dct": "Mon, 07 Mar 2016 20:09:00 GMT", "id": "e2fc7a2c77945b0e80ac109c6e96fa6c", "content": "MORGANTOWN -\nUPDATE (3/10 at 12:45 p.m.):\nAccording to the Mononogalia County Sheriff's Department, Damon Sochko, 16, of Morgantown, died Wednesday after being shot in the head Monday.\nChief Deputy Perry Palmer said the Monongalia County Prosecuting Attorney's Office will decide whether to amend the wanton endangerment charge against 21-year-old Christopher Smith.\nThe Monongalia County Sheriff's Office will continue the investigation. Anyone with information is asked to call the Detective Unit at 304-291-7218.\nSmith Funeral & Cremation Care will handle the arrangements for Sochko and issued a press release with a statement from the family Thursday.\n\"The outpouring of love and support received over the last several days has been greatly appreciated,\" Sochko's family said. \"The community has came together to show their support in ways we could have never imagined. For that, we are very thankful. However, as we begin to make arrangements to lay Damon to rest, we ask that our privacy please be respected at this very difficult time. Funeral arrangements are being made through Smith Funeral & Cremation Care of Morgantown. We invite everyone to join us at the public viewing and funeral service, once those arrangements have been finalized.\"\nORIGINAL:\nA Morgantown man was arrested Monday after deputies say he shot a juvenile in the head.\nChristopher Smith, 21, is charged with wanton endangerment, according to the Monongalia County Sheriff's Department. Deputies said Smith was \"recklessly manipulating a loaded handgun when it was fired, striking the victim.\"\nThe incident happened on Church Hill Drive, off Van Voorhis Road in Monongalia County.\nThe juvenile male was transported to Ruby Memorial Hospital. The extent of his injuries are unknown at this time.\nSmith was arraigned in Monongalia County Magistrate Court, where bond was set at $250,000. He is currently in the North Central Regional Jail.\nAnyone with information regarding the incident is asked to call the Monongalia County Sheriff's Department's Detective Division at 304-291-7218."}