{"uri": "http://www.newschannel5.com/news/local-news/shooting-reported-on-piccadilly-row", "title": "2 Teens Killed, 2 Arrested In Antioch Shooting", "dct": "Sat, 14 Jan 2017 17:47:00 GMT", "id": "7a98aa00a2269b2d81bf87c2dcee6de5", "content": "Autoplay:2 Teens Dead In Shooting On Piccadilly RowCONNECTING...XDetails Released In Antioch Double Homicide\nANTIOCH, Tenn. - Two teenagers were killed in a shooting in Antioch, and two 16-year-old's were arrested.\nAuthorities said the incident happened before 4:30 p.m. Saturday in the 700 block of Piccadilly Row.\nWhen officials got to the scene, they said they found two people dead. The victims were identified as 16-year-old Eduardo Trejo and 15-year-old Jonathan Martinez.\nTwo teens, 16-year-old Anthony D. Sinor, Jr. and 16-year-old Mitchell Mann, were detained for questioning Saturday night.\nOfficials confirmed on Sunday the two had been arrested and charged with two counts each of criminal homicide.\nAnthony Sinor & Mitchell Mann, both 16, charged with 2 cts each of criminal homicide for Sat. double murder @ Sinor's Piccadilly Row home. pic.twitter.com/EBBPhbQ2S4\n— Metro Nashville PD (@MNPDNashville) January 15, 2017\nAuthorities confirmed the shooting happened on the back deck of Sinor's home.\nAccording to a preliminary investigation, Sinor reportedly believed Trejo had recently burglarized his home. Police said Sinor allegedly conspired with Mann to lure Trejo to the home.\nTrejo went to the home with Martinez, and both were fatally wounded.\nSinor called 911, and when officers responded, he said the shooting happened during an attempted burglary.\nWhen Sinor was detained, police also took possession of the alleged murder weapon, a semi-automatic pistol.\nLater, authorities said Sinor admitted there was no attempted burglary on Saturday afternoon. Mann had fled from the scene prior to officers arriving. He later met with detectives on Saturday night.\nBoth were being held in juvenile detention. The investigation remained ongoing."}