{"uri": "http://www.wtae.com/news/sources-multiple-people-shot-in-wilkinsburg/38434402", "title": "4 women, man, unborn child slain in Wilkinsburg backyard party ambush", "dct": "Sat, 19 Mar 2016 02:30:00 GMT", "id": "eae4df9f66fa5440083a082ab09697c3", "content": "WILKINSBURG, Pa. —\nTwo gunmen teamed up for a deadly late-night ambush at a backyard cookout, with one firing first and steering the victims toward his partner who used a high-velocity rifle to shoot them in the head, killing four women and a man and injuring three others, the district attorney's said.\n\"The murders were planned. They were calculated,\" District Attorney Stephen Zappala said as he visited the crime scene on Franklin Avenue in Wilkinsburg.\nThe district attorney's office said Friday the task force is making good progress.\n\"We are cautiously optimistic that we have identified people believed to be suspects,\" a statement read. \"However, there is a more work to be done and we do not expect any arrests to be imminent.\"\n\"They knew what they were doing. That's what it appears to us,\" Allegheny County Police Superintendent Charles Moffatt said, adding that nearly 50 shell casings were found.\nVideo: Watch the police news conference\nThe women who died in Wednesday's ambush were identified as Brittany Powell, 27; her sister, Chanetta Powell, 25; Tina Shelton, 37; and Shada Mahone, 26. Also slain was the Powells' brother, Jerry Shelton, 35.\n\"I lost three children and two nieces,\" said a tearful Jessica Shelton -- the mother of Jerry Shelton, both Powell sisters and a fourth victim, Lamont Powell, who remained in critical condition; and the aunt of Tina Shelton and Shada Mahone.\nShe said the family had gathered for a cookout \"because we like to embrace each other, enjoy the sunny day.\" Wednesday was unseasonably warm for Pittsburgh in March, with temperatures well into the 70s.\n\"For these shooters out here taking innocent lives, you didn't just take innocent lives. You made children lose their parents,\" Jessica Shelton said.\n\"I have no choice but to be strong, because I have grandchildren who lost their parents who I have to be strong for and live for,\" Shelton said. \"I'm just heartbroken today.\"\nAnother shooting victim remains in critical condition, and a woman was treated and released from a Monroeville hospital. Police said children inside the house were not harmed by the gunfire.\nMoffatt said investigators are looking at some people as possible suspects. He declined to identify them for fear of jeopardizing the investigation, and said police do not yet have enough evidence to make an arrest or bring anyone in for questioning.\nA $20,000 reward is being offered for information leading to the arrest of the gunmen. Tipsters can remain anonymous by calling 800-ATF-GUNS. Donations to the Shelton-Powell Fund can be made at any Citizens Bank branch to help the victims' families with funeral expenses.\nStay with WTAE.com as we continue to update this story. Download the WTAE app for your phone or tablet to keep updated throughout the day. (Free in your app store.)\nZappala said it appears that one or two of the victims were targeted by the unknown attackers in the yard behind 1304 Franklin Ave. He said Allegheny County homicide detectives were still investigating but hadn't ruled out drugs as a motive.\n\"Detectives have number of theories they are working with, one of which involves Lamont Powell being the target of the gunmen,\" Mike Manko, spokesman for the district attorney's office. \"However, such a theory would do little to explain the indiscriminate shooting and killing of the other victims.\"\nThe victims rushed toward the back porch and an alleyway to seek cover as one of the shooters fired a .40-caliber pistol at as many as 15 adults who were playing cards and having a late-night cookout.\nThe first shooter's actions pushed the victims toward the rear porch and door of the house, where his accomplice had a 7.62 mm rifle similar to an AK-47 and shot them from behind a chain-link fence less than 10 feet from the porch, Zappala said.\n\"It looks like, right now, they were all fleeing toward the back door of the residence when the second gunman fired from the side of the yard,\" county police Lt. Andrew Schurman said. \"They all seemed to get caught on the back porch.\"\nNo one at the party apparently fired weapons, police said. Detectives surrounded the house and used flashlights and police dogs to search the area, but the shooters were not found.\nSurveillance video obtained exclusively by Pittsburgh's Action News 4, shows three men walking away from home moments after the shootings. We turned the video over to police, who are looking into it.\nIn the video, two men walk down the street near the house at 10:55 p.m., one minute after the shooting. Two minutes later, another man walks by.\nHazel Way, an alley behind the house, had at least 40 yellow evidence markers indicating shots fired. Bullet holes were visible around the porch. A grill and tables and chairs, some tipped over, remained in the yard as investigators toured the scene Thursday.\nA witness said she was walking home when she heard 20 shots, and then six more shots. She said she couldn’t get home because police blocked the street.\nAlthough Wilkinsburg has a reputation for violence, neighbor Mike Jones said it has been rare in this particular area, which is located just about a block off Ardmore Boulevard, close to the WTAE studios and an on-ramp to the Parkway East.\n\"This is unheard of,\" the 57-year-old Jones said. \"It doesn't happen around here.\"\n\"IT STARTED OUT TO BE A BEAUTIFUL DAY\"\nJessica Shelton helped organize a barbecue at her daughter Brittany's house on Wednesday afternoon. She didn't think twice about anything happening. She didn't think she had to.\n\"My family, often, on nice, sunny days, have cookouts because we like to embrace each other, enjoy the sunny day,\" Shelton said. \"Yesterday started out to be a beautiful day for us.\"\nShelton said around a dozen adults and three of her grandchildren, 8-month-old Chloe, 7-year-old Tay and 6-year-old Jaron, were in attendance. She left around 9 p.m. so the younger adults could socialize. Nearly two hours after she left, unspeakable horror struck in the backyard.\n\"I lost three children last night and two nieces,\" Shelton said on Thursday afternoon.\nInvestigators said gunmen used a pistol and an assault rifle to spray bullets in the backyard and alley entrance of the home.\n\"Somebody knows who did this. There's no way in the world that people just drive up and massacre six lives and nobody knows what's going on,\" said Pastor Maurice Trent, of The Lighthouse church, where a news conference was held with Jessica Shelton.\nJerry Shelton had two children of his own. Jessica Shelton described him as quiet-mannered and hard-working. Jessica Shelton said Brittany Powell suffered the loss of a daughter in 2013 and just celebrated her other daughter's birthday on Tuesday. Jessica Shelton said Chanetta Powell had an 8-month-old daughter and a 6-year-old son, both of whom were inside the home when the gunfire began.\n\"(My grandson) said, 'Nana. There was fireworks outside. Then I saw mommy and them lying on the ground. I didn't want the bad men to get me, so I ran upstairs,'\" Jessica Shelton said.\nShelton said her nieces, 26-year-old Shada Mahone and 37-year-old Tina Shelton were also killed.\n\"She was a hard-working woman. All she knew was work. One day she decided to enjoy her family because she never got to enjoy it, she lost her life,\" Jessica Shelton said of Tina Shelton.\n\"(Shada) could light up a room with her smile. If you entered a room, you knew she was there. All of them would light up a room,\" Jessica Shelton said.\nShelton's other son, Lamont Powell, remains in an induced coma at UPMC Mercy with four bullet wounds to his neck, back, chest and hand. She said he is expected to undergo another surgery Friday. She's praying she doesn't lose him too, which would raise her immediate family's death total to four children and one unborn grandson.\n\"It's just not right for me to lose four. And to lose two beautiful nieces. It just breaks my heart,\" Shelton said.\nA man named John Ellis was also wounded in the shooting, as was a third, unnamed victim.\n\"For these shooters out here taking innocent lives, you didn't just take innocent lives. You made children lose their parents,\" Shelton said, adding that 11 children are now without a parent following the killings of the five adults. \"Right now, I have no choice but to be strong because I have grandchildren who lost their parents who I have to be strong for and live for.\""}