{"uri": "http://www.philly.com/philly/news/20160816_Police_ID_5_slain_in_Philly_over_weekend.html", "title": "Police ID 5 slain in Philly over weekend", "dct": "Tue, 16 Aug 2016 00:00:00 GMT", "id": "abdf0064494c12a9eb12cbd8496f4e84", "content": "Authorities have identified four men and a boy killed in separate incidents in Philadelphia over a 48-hour period.\nThe deadly shootings happened between Friday and Sunday afternoon, and the victims ranged in age from 16 to 52. Investigators were continuing to search for suspects in all five homicides.\nThe most recent of the fatal shootings happened about 2 p.m. Sunday, when the youngest victim, 16-year-old Rodney Anderson, was found shot in a car on the 2000 block of East Orleans Street in Kensington, a few blocks from his home.\nHe was pronounced dead at Temple University Hospital at 2:24 p.m. No information about a suspect or motive was known.\nTwo of the other slayings happened within a few minutes of each other Friday night.\nAbout 10:30 p.m., officers responding to a report of a shooting on the 200 block of East Collom Street in the Wister section of East Germantown found Markeish Johnson, 18, who lived in the area, unresponsive on the street.\nHe was pronounced dead at Einstein Medical Center at 10:40 p.m. Police were looking for three unknown men in connection with the shooting.\nAbout the same time, three men were shot, one fatally, at a basketball court on the 1700 block of Meadow Street in Frankford. A robbery was believed to have sparked the shooting that left 24-year-old Kyheem Pittman of Tacony dead, police said Monday. He was pronounced dead at Temple at 10:53 p.m.\nAlso wounded were a 27-year-old man, who was listed in critical condition from shots to his back and stomach at Temple, and a 21-year-old man, who was treated for a gunshot wound to a thigh after showing up at Cooper University Hospital in Camden.\nEarlier Friday evening, 20-year-old Kristoff Campbell was shot to death on the street where he lived, the 5600 block of Osage Avenue in West Philadelphia, about 5:25 p.m. He was pronounced dead at Penn Presbyterian Medical Center at 6 p.m.\nThe motive remained unknown Monday, and no suspect information was available.\nThat shooting followed the death of 52-year-old Ruben Arroyo of Fairhill's Hartranft section, who was shot while walking to his vehicle on the 2300 block of North Second Street just after 2 p.m. He was taken to Temple, where he died at 2:36 p.m.\nPolice listed an argument as the motive for the killing but did not provide further details. A man was seen running from the scene on foot, placing a handgun in a purse, then jumping into a black Nissan Maxima that was heading east on Cumberland Street, police said. Officials described the suspect as a black man who was wearing a long black and burgundy wig, capri tights, a black shirt, and sunglasses.\n215-854-2153 @emilybabay"}