{"uri": "http://www.winknews.com/2015/10/18/1-killed-4-injured-at-zombicon-in-downtown-fort-myers-after-shooting/", "title": "1 killed, 5 injured after shots fired during Zombicon", "dct": "Sun, 18 Oct 2015 20:45:00 GMT", "id": "002881abca098014d1ed1c848d95d37f", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nFORT MYERS, Fla.- A 20-year-old Okeechobee man was killed and five others were injured Saturday night after shots were fired during the annual Zombicon event in downtown Fort Myers.\nThe shootings happened at about 11:45 p.m. in front of Los Cabos Cantina, 2224 First St. Authorities identified the victim as Expavious Tyrell Taylor, a former Clewiston High School football player who was an offensive linebacker for ASA College in North Miami Beach. He was pronounced dead at the scene.\nTaylor was killed about two weeks after his birthday.\n“Classes done for the day thank goodness now to go home and relax for the day/weekend,” he wrote on his Facebook page on Thursday.\nFort Myers police have not released the names and conditions of the other victims. Four were treated and released from Lee Memorial Hospital with non-life threatening injuries and a fifth refused medical treatment.\nNo suspect information was immediately available.\nFrom festive to chaos\nAbout 20,000 people were estimated at Saturday’s event, which was so packed that attendees stood shoulder to shoulder.\nAnd then shots rang out.\n“I just heard about 5, 6 shots,” said Jose Mendez, who was walking near Taylor when the shots were fired. “When I looked, I saw the guy fall down. I stayed right there and then his brother started jumping on top of him crying and crying and screaming and stuff like that.”\nOne cell phone video captured four gunshots. Another recorded attendees running through downtown after the shots were fired.\n“There’s blood everywhere,” one person said in a third video.\nThat video also captured a man grieving over a body lying on the sidewalk. After being pulled away from the body, the man was then consoled by an unidentified woman.\nThe Halloween-like atmosphere, with patrons wearing costumes with fake bloody injuries and carrying fake weapons, made it difficult for law enforcement to tell the injured from the non-injured, said James Didio, who was handing out bottles of water at the event when he heard four shots.\n“A male walked over to me…and he asked me if he was shot,” he said. “I looked down and his legs had multiple wounds at which point I asked him to have a seat, let’s get medics to come over.”\nDon Small, who works at Capone’s Coal Fired Pizza, said the event quickly went from festive to chaotic.\n“It was like total mayhem then,” he said. “Little kids almost getting trampled. You know, people coming around trying to jump over a very hot grill…stove. We’re pushing people inside the restaurant and you know, take cover, because we didn’t know which way the person was running. If he was running back around, if they had snatched him.”\nInvestigators have not said what led to the shootings.\nBringing happiness to others\nDespite losing both parents, his grandmother and an unborn child within the last two years, Taylor was able to draw smiles out of others.\n“He always had that mentality to make everybody laugh,” said his uncle, Efram Washington. “It’s a hard pill to swallow. You never want to bury a child. You never want to bury a sibling at all, period. Especially when they try to do everything that’s right. You don’t understand why somebody would do something like this.”\nTaylor turned to football, where he caught the eye of coaches at ASA College. Out of 175 players that attended an open tryout, Taylor was one of six who made the cut, head coach Ernest Jones said.\n“What I most remember about him is that he had a lot of energy,” he said. “He never got tired. He said ‘I can run 16 more, I’ll do whatever you want me to do. I want to be part of this team.’ So as coaches we’re like ‘Who’s this kid? Where did he come from?'”\nTaylor was planning to visit family after stopping in Fort Myers. Now relatives, who were returning from burying a loved one, are planning his funeral.\n“I’m still hurting for him cause of what he went through, and he still managed to make the best out of life,” Washington said. “‘Cause he put the right people in his life. And he tried to do what’s right, he did what’s right. But you know, you can do everything right, and at the spare of a moment…”\nOrganizers, leaders react\nEvent organizers posted a statement on Zombicon’s Facebook page, saying they were “deeply saddened” by the shootings.\n“We take the safety of our patrons very seriously and take precautions in hiring security and police officers for our annual event,” they said. “Our prayers go out to the family members and individuals involved in the incident.”\nShootings at large outdoor events with public access are hard to prevent, Lee County Sheriff Mike Scott said.\n“Any loss of life is tragic and yet we see it all over the country from churches to schools to movie theaters and most anywhere people gather,” he said in a statement. “Last night’s incident with 20,000 plus people is near impossible to predict or prevent.”\nAuthorities hope video and pictures from attendees will help lead to an arrest.\n“These random acts of violence will be deterred and ultimately eradicated through the deployment of cameras, arrest, and successful prosecution of the perpetrators,” Fort Myers Mayor Randall Henderson said in a statement. “I want to thank all citizens who have shown bravery and resolve in assisting law enforcement through their capturing of these heinous acts with personal cameras and testimony. With everyone pulling in the same direction we will solve this problem.”\nSmall, the pizza shop employee, believes Saturday’s shooting will negatively impact future Zombicon events.\n“I think this person has no idea what he did for this event and how it may have hurt upcoming events in the future,” he said.\nAnyone with information about the shootings, including photos or cell phone video taken around the time of the shooting, is asked to contact Fort Myers police at (239) 321-7700 or Crime Stoppers at 1-800-780-TIPS."}