{"uri": "http://thepolicenews.net/default.aspx?act=Newsletter.aspx&category=News+1-2&newsletterid=64734&menugroup=Home", "title": "Suspect Arrested, Charged in Aggravated Robbery at 10235 Almeda Genoa", "dct": "Wed, 30 Nov 2016 17:19:28 GMT", "id": "36f47296d9dd9486864e9c75ea8a72da", "content": "FOR IMMEDIATE RELEASE\nSuspect Arrested, Charged in AGGRAVATED ROBBERY at 10235 Almeda Genoa\nCharges have been filed against a suspect arrested in an incident that occurred at 10235 Almeda Genoa at about 8:30 p.m. on Monday (November 28).\nThe suspect, Brandon Ortez (b/m, 22), is charged with aggravated robbery with a deadly weapon in the 228th State District Court.\nHPD Homicide Division Sergeant T. Ruland and Officers R. Ridel and K. Ferguson reported:\nHPD patrol officers responded to a suspicious person with a weapon call at the Wendy's restaurant at the above address. As officers attempted to question the suspect (Ortez), he suddenly pulled out a gun and put it to his own neck. Officers immediately took cover and gave the suspect verbal commands to drop the weapon, which he ignored. Officers then exited the restaurant along with employees, sought cover and requested additional officer to respond to the location.\nMoments later, at least one gunshot was heard from inside the restaurant. At that time Ortez is believed to have robbed one of the cash registers. He then exited the restaurant with the gun and ran to an abandoned building next door. At least two more shots were heard near the abandoned building as Ortez shot out a window in an attempt to enter the building. Additional officers and an HPD K-9 arrived, immediately sought cover and set up a perimeter.\nAt some point, as officers were taking position for tactical purposes, two officers bumped into each other and one officer's weapon was accidentally dropped and discharged. An officer was struck by shrapnel resulting from the accidental discharge and bitten by the K-9, who was startled by the gunfire. The second officer also sustained a bite wound from the K-9. Both officers were transported to Memorial Hermann Southeast Hospital with non-life-threatening injuries. Ortez was eventually taken into custody and treated at the scene for injuries from sustained from contact with the K-9. Officers recovered Ortez's pistol and cash in his possession.\nAs is customary in incidents in which an HPD officer discharges his weapon causing injury, this case is being investigated by the HPD Homicide and Internal Affairs Divisions, as well as the Harris County District Attorney's Office.\nVHS/JKS 11-30-16\nInc. #151462916\nPost a comment\nName/Nickname:\n(required)\nEmail Address: (must be a valid address)\n(will not be published or shared)\nComments: (plain text only)"}