{"uri": "http://wkrn.com/2016/07/01/child-injured-in-accidental-shooting-in-clarksville/", "title": "3-year-old dies after accidentally shooting himself in the face", "dct": "Fri, 01 Jul 2016 18:56:00 GMT", "id": "59a55abf0d9d1eeb32389dfa281c3f83", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nCLARKSVILLE, Tenn. (WKRN) – A 3-year-old has died after he accidentally shot himself in the face.\nIt happened shortly before 5:30 p.m. Friday in the 800 block of Samantha Lane in Clarksville.\nThe toddler was vising from Fort Riley, Kansas, with his family. He shot himself with a .40-caliber handgun that belonged to the homeowner.\nHe was taken to Tennova Healthcare-Clarksville in critical condition but passed away a short time later.\nClarksville officials told News 2 this appears to be an accidental shooting.\nThe Safe Tennessee Project released a statement on the shooting, which is the 13th incident in 2016 of a child-involved shooting.\n“These horrific tragedies are 100 percent preventable. They are not accidents,” said Beth Joslin Roth, policy director for The Safe Tennessee Project.\n“They are the direct result of a decision by an irresponsible gun owner to not take the most basic safety precautions and store their gun properly when children are present.”\nNo criminal charges have been filed at this time, and the investigation is ongoing.\nThousands of abortion opponents are gathering in the…\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}