{"uri": "http://www.nbcchicago.com/news/local/6-Arrested-After-Home-Invasion-Leaves-14-Year-Old-Boy-Dead-336277941.html", "title": "6 Arrested After Home Invasion Leaves 14-Year-Old Peoria Boy Dead", "dct": "Fri, 23 Oct 2015 16:52:00 GMT", "id": "6ea0fee64fa0c657d902a421c39bc98c", "content": "File Photo\nOn Oct. 10, Tommie T. Forest III and three of his friends were having a sleepover when he was shot to death by intruders. The three other teens survived but were also hit and injured by gunfire.\nAssistant State’s Attorney Dave Kenny said six men arrived at the home on 2405 N. Flora Ave. in two cars that night, before one of the men went up to the home, knocked on the door and asked for someone by nickname.\nWhen the man was told no one by that name lived there, he left, Kenny said, and returned with at least five more men shortly after, which is when \"all hell broke loose,\" according to the Peoria Journal Star.\nKenny said there were so many bullets fired that investigators \"lost track of the number of shell casings,\" the newspaper reported. Authorities believe the killing was due to a botched robbery attempt. After the killing the men ran off, according to police.\nKiangelo G. Marshall, 18, and a 17-year-old, whose identity was not released because of his age, were arrested Thursday in Fulton County by the United States Marshals Fugitive Task Force. Both were charged with murder and home invasion - the same charge facing four other suspects who had previously been arrested. They were the last of the six suspects police believe were connected to the boy's death.\nThe other suspects - Dontarius N. Berdin, 20; Kainen I. Lacy, 21; Alex F. Collins, 21; and Samuel T. Clay Jr., 20 - were sought and arrested earlier and have appeared in court. Their bonds are each set at $2 million.\nInvestigators say it does not appear that the group chose the location at random, according to the Peoria Journal, but at this point as to why they chose the home has not been released.\nForest was in his freshman year at Peoria High School. He was found in the back yard of home with a single gunshot wound to the head."}