{"uri": "http://www.columbiatribune.com/news/crime/court-documents--year-old-fired-weapon-that-killed-man/article_1f09a09f-564e-594b-aa6f-695a9696b753.html", "title": "Court documents: 16-year-old fired weapon that killed man on Claudell Lane", "dct": "Wed, 28 Dec 2016 00:00:00 GMT", "id": "fe1020023fe046c1b3815e298d52458f", "content": "A 16-year-old arrested last week along with two other teens in connection with a deadly shooting fired the fatal round after a drug deal went awry, according to court documents.\nThe minor, whose name has not been released, was arrested Thursday with Brian H. Smith and Dariel M. Reid, both 18-year-old Columbia residents, after the shooting that killed 33-year-old Keith E. Chambers earlier that afternoon in the 1000 block of Claudell Lane. Smith has been charged with second-degree murder and first-degree robbery and Reid faces charges of second-degree murder and distribution of a controlled substance.\nIt is unclear what charges the 16-year-old faces or if he will be tried as an adult, but police last week said he was arrested on suspicion of second-degree murder, armed criminal action, unlawful use of a weapon and distribution of a controlled substance.\nA message left at the Boone County Juvenile Office was not immediately returned. Boone County Prosecuting Attorney Dan Knight also did not immediately respond to a message seeking comment.\nSmith and Reid are being held at the Boone County Jail on $1 million and $500,000 cash-only bonds, respectively. Neither had an attorney listed in online court records. They were both arraigned Tuesday in front of Boone County Associate Circuit Judge Michael Bradley and have court dates scheduled for mid-January.\nChambers, Smith and three other people went to Reid’s home on Claudell Lane to buy marijuana, Columbia police Detective Steve Wilmoth wrote in a probable cause statement. Reid and the minor met the group in a nearby parking lot, where Chambers and Smith disputed the weight of the purchase, so Reid offered to let them in his home to check the amount.\nAs Reid was weighing the pot, Reid told Wilmoth, Chambers pulled a gun and Smith grabbed the marijuana. Chambers shot Reid in the arm and the 16-year-old shot Chambers in the chest. Both were taken to a hospital, where Chambers was pronounced dead.\nChambers is the sixth homicide victim in the city in 2016 and the first since Kevin R. Hollins, 45, was shot and killed Nov. 20 in the 1600 block of Kathy Drive.\nThree days before Hollins’ death, Gregory J. Moore, 54, was found fatally shot in a central Columbia motel room. Arrests have been made and charges filed in both of their deaths."}