{"uri": "http://www.palmbeachpost.com/news/news/crime-law/4-year-old-girl-shot-killed-in-riviera-beach/nsZ82/", "title": "Uncle held on $150k bond on charges linked to 4-year-old niece’s death", "dct": "Mon, 19 Sep 2016 00:00:00 GMT", "id": "c43abedd22f0fcd696b73b6f5ab33ef5", "content": "10:15 a.m. update: Nathaniel Lowe is being held on a $150,000 bond in the Palm Beach County Jail on charges linked to his 4-year-old niece’s death.\nHis niece, Amirra Jacques, grabbed a gun off a bed Sunday night. A public defender said in court Monday he does not live in the Riviera Beach home where she found the gun, but he was in the house when it discharged.\nThe girl died from the gunshot wound, Riviera Beach police said.\nPolice charged Lowe with culpable negligence, possession of a firearm as a convicted felon, grand theft of a firearm and tampering with evidence.\nHe is to have no contact with any minors, including his 16-year-old co-defendant, or Amirra’s family, a judge ordered Monday morning.\n8:45 a.m. update: A 4-year-old girl grabbed a gun off a bed in her Riviera Beach home Sunday night, police said.\nIt discharged, sending a single bullet into her body.\nThat girl, Amirra Jacques, died at a hospital later that night.\nAmirra was in the home with her mother, uncle and a 16-year-old boy when the gun went off, according to police.\nHer uncle called rescue crews saying there’d been a home invasion at the house on 32nd Street, west of President Barack Obama Highway. The teen hid the gun two streets away, he later told police. Several people fled the home, police said, though it’s unclear who left.\nHours later, the two males were arrested on charges of culpable negligence, tampering with evidence and grand theft of a firearm, police said Monday morning.\nAmirra’s 25-year-old uncle Nathaniel Lowe also is charged with possession of a firearm as a convicted felon. Court records show Lowe is on probation after being convicted of attempted burglary in February. He’s previously been convicted of drug possession, vehicle theft, battery and carrying a concealed weapon, according to court records.\nThe teen, who police are not naming because he is a minor, also is charged with perjury.\nLowe and the teen had been staying in the bedroom where Amirra found the gun, police said.\nAmirra is the second child to be killed by a gun in the last few weeks in Riviera. Three-year-old Martavious Carn was fatally shot on Aug. 14 outside Mystic Woods apartments. His mother’s boyfriend, who police said was the intended target of the gunfire, also was killed.\nAnyone with information is asked to call Riviera Beach police at 561-845-4123 or Crime Stoppers of Palm Beach County at 800-458-TIPS (8477).\nOriginal story: Just weeks after a 3-year-old was shot in the city, a 4-year-old Riviera Beach girl has been killed by gunfire, police confirmed late Sunday.\nThe child was struck by a single shot inside a home around 8:30 p.m. in the 1200 block of West 32nd Street, spokeswoman Rose Anne Brown said late Sunday. She said several people were in the home, including the child’s mother, and police are trying to determine who fired the shot. They also are conducting an active search of the neighborhood.\nFollowing a 911 call from the home, the child was taken by ambulance by Riviera Fire Rescue to a hospital, where she died.\n“A little girl is dead. So whether it was deliberate or accidental, she’s no less dead,” Brown said at the scene. “We need to know who’s responsible.”\nShe said police questioned some of the people who were in the home, but several left immediately after the shooting.\n“We’re asking members of the public that may know who was there (to come forward),” Brown said.\nBrown would not immediately identify the child or the mother, and would not say whether police know what kind of gun was used.\nContact police at 561-845-4123 or Crime Stoppers of Palm Beach County at 800-458-TIPS (8477).\nA neighbor who did not want to give his name said he saw the little girl just Sunday afternoon playing in her yard.\n“They good people,” the man said. ” I said hi to her mama. That’s it.”\nHe looked down the darkened street. “I don’t know. It’s crazy.”\nIn the previous incident, Martavious Carn, 3, and Amir Stepherson, 24, were found dead just before 10 p.m. Aug. 14 in the parking lot at Mystic Woods, an apartment complex in the northwest corner of the city, police said. They had been running errands with Martavious’ mom, Brown said at the time.\nShe said Sunday night police “are making progress,” but no arrests have been made in that case."}