{"uri": "http://www.wfxg.com/story/29803458/five-people-shot-at-bennettsville-club-early-sunday-morning-officials-state", "title": "UPDATE: Man arrested following Bennettsville club shooting where 5 people were shot", "dct": "Mon, 17 Aug 2015 15:53:00 GMT", "id": "3a34457ea701ea04c3c8fbd576bf0158", "content": "BENNETTSVILLE, SC (WMBF) – Marlboro County Sheriff's deputies responded to a club shooting early Sunday morning August 16, involving five people who were shot, and several cut from broken glass.\nThe shooting took place at the State Line Club on Hwy 38N in Bennettsville. Marlboro County Sheriff’s Office deputies and investigators responded to the scene early Sunday and found that most people had left the club prior to arrival, according to MCSO.\nThe investigation revealed that five people were shot, taken to the hospital, and released a few hours later. Others were cut from broken glass on the floor when fleeting the area; those victims were also treated and released from the hospital.\nSome people who live in the area said crime is not something they see often.\n\"We don't have a whole lot of crime going on in here,” said Pete Quick, who lives in the area.\nInvestigators interviewed several witnesses at the scene, hospitals and other locations in North Carolina. Most witnesses were uncooperative with investigators and upon arriving at the club, investigators found water and bleach in the club as workers were cleaning before law enforcement arrived.\nInvestigators developed a person of interest in the case and will continue to attempt to interview witnesses and gain cooperation from the club operator and patrons this week.\nThose living nearby said having a club in the area solicits some crime, but nothing has ever cause great concern among residents.\n“You can't really dictate whether or not crime is going to be there. That's just one of those things that can and can't happen,\" Pete Clark, who lives in the area said.\nInvestigators will then meet with the Solicitor about the direction of the case and possible charges for numerous offenses including the assaults.\nThe investigation also revealed several possible violations concerning ABC laws and illegal activity that may occur routinely inside the club, MCSO officials stated. The State Law Enforcement Division will be assisting with those concerns.\nInformation about this case was not made available to WMBF News by the Marlboro County Sheriff's Office until Monday morning at 11:32 a.m., over 24 hours after the incident occurred.\nSheriff Knight with the Marlboro County Sheriff's Office says, 19-year old Traquan D. Wall of Rockingham NC, was arrested for the shooting and taken into custody by the Rockingham Police Dept. Wall is awaiting extradition back to SC and is in the NC Detention center facing his current charges in NC.\nWall is charged with 5 counts of Assault and Battery of a high and aggravated Nature and Possession of a firearm during the commission of a violent crime. He was also charged with Marijuana possession with the intent to distribute, according to the MCSO.\nMCSO says the case is still under Investigation. The MCSO and SLED are working with NC Law enforcement to see if anyone else may be involved.\nCopyright 2015 WMBF News. All rights reserved."}