{"uri": "http://www.times-standard.com/general-news/20151225/3-found-dead-in-murder-suicide-in-new-jersey", "title": "Parents, child found dead in murder-suicide in luxury home", "dct": "Sat, 26 Dec 2015 05:36:00 GMT", "id": "a3f99026edbd5c39242a7c4b7c4cbec3", "content": "EDGEWATER, N.J. (AP) — A man shot and killed his wife and 8-year-old daughter before turning the gun on himself at a luxury high-rise apartment building, authorities said.\nThe bodies of Michael Stasko, Melissa Stasko and 8-year-old Mellie Stasko were found Friday night at the Windsor at Mariners Tower, an apartment building on the bank of the Hudson River in Edgewater, Bergen County prosecutor John Molinelli said.\nCounselors, psychologists and social workers plan to help Edgewater students cope with the murder-suicide when they return to school Jan. 4, school district officials said. District officials will be available this week to help parents as needed.\nAuthorities said a .45-caliber handgun with hollow-point bullets was found where 53-year-old watch salesman Michael Stasko shot and killed his 49-year-old wife and their daughter before killing himself.\nAdvertisement\nMichael Stasko had a gunshot wound under his chin. His wife and daughter had been shot in the backs of their heads. The shootings could have happened as long ago as Tuesday or Wednesday, and a possible motive was under investigation, authorities said.\n\"We don't know whether it was financial. We don't know whether it was familial. We don't know really perhaps what was going through Mr. Stasko's mind for him to do this,\" Molinelli said.\nPolice officers found the Staskos' bodies after receiving a call from Melissa Stasko's worried brother in Missouri, who told them that the family was expected to arrive there Friday afternoon to celebrate Christmas.\nMolinelli said Michael Stasko operated his watch business out of his home. He described the family's apartment as \"lovely\" and \"well kept,\" with neatly wrapped presents underneath a Christmas tree.\n\"You see some cards and holiday cards,\" Molinelli said. \"It would appear from the 8-year-old's standpoint she very much loved her father.\"\nMolinelli called the case \"troubling.\"\n\"I'm doing this 14 years, and whenever you see an 8-year-old lying in a bed and she's dead, we try to find answers right away, and we will try to find answers on this one,\" he said.\n___\nThis story has been corrected to show the girl's name is Mellie, not Nellie."}