{"uri": "http://www.eastbaytimes.com/breaking-news/ci_30216886/hayward-teen-shot-death-citys-third-homicide-48", "title": "Hayward: Teen shot in city’s third killing in two days", "dct": "Sun, 07 Aug 2016 09:02:00 GMT", "id": "2f292d2706214da1186a9c6c60fc7491", "content": "HAYWARD — The third homicide in less than 48 hours in this city claimed the life of a teenager Saturday night and left police scrambling to curb the violence and find out why it’s happening.\n“I’ve been doing this 20 years, and I’ve never seen anything like this,” Hayward police spokesman Sgt. Ryan Cantrell said Sunday, less than 24 hours after a 17-year-old boy died and two others were injured when gunfire broke out in the 2500 block of Muir Road. “I’m going to chalk it up as an anomaly. … Things sometimes happen in waves.”\nThe wave of violence here has been particularly noticeable since August began; four people have been killed in shootings since Aug. 2, three of them since Friday.\n“We haven’t figured it all out yet,” Cantrell said. “Are one or two of these related? That’s just one of the questions we’re trying to get answered. All possibilities are on the table.”\nOfficers found the teen on the sidewalk when they arrived at the Muir Road residence after being called there at 7:34 p.m. Saturday, Cantrell said. He’d been shot more than once and was pronounced dead at the scene. Authorities have not identified him.\nAn 18-year-old man and another 17-year-old boy went to a hospital after the shooting. An ambulance took the 18-year-old, and the 17-year-old drove himself, Cantrell said. Each was shot once, but neither of their injuries was life-threatening, he said.\n“It happened in front of a house party that was going on inside the house,” Cantrell said. “We’re still talking to witnesses and getting an idea what happened.”\nDetectives also continued to investigate the circumstances surrounding two fatal shootings Friday. Police found 18-year-old Rogelio Torres II, of Hayward, dead inside a car in the 26000 block of Gading Road shortly before 11 p.m. Officers attempted CPR on Torres, but he was pronounced dead at the scene. About 11 hours earlier, at 12:05 p.m., officers found 63-year-old Neal Frybarger dead from a gunshot wound in the garage of a home in the 28000 block of Thorup Lane.\nAfter a standoff and negotiations, police arrested a woman in her 60s on suspicion of killing Frybarger, but they have not identified her yet, citing that investigation and the others. They have not made any arrests in the other killings, nor have they identified any suspects.\n“Are we dealing with domestic violence or robberies or gang stuff?” Cantrell said. “That’s why we’ve been working so hard. Our detectives have been here since Tuesday,” when a family disturbance ended with 59-year-old Albert Williams shot to death in the 27000 block of Eucalyptus Court.\nCantrell said five of the department’s 14 detectives were working the homicides Sunday. The homicide Saturday brought to seven the number of homicides in Hayward this year. Police continue to interview witnesses and develop information on the shootings, Cantrell said, and they need the public’s help. Anyone with information is asked to contact Hayward police at 510-293-7072."}