{"uri": "http://wane.com/2017/01/03/gun-goes-off-during-party-man-seriously-hurt/", "title": "Gun goes off at party, man seriously hurt", "dct": "Tue, 03 Jan 2017 01:09:00 GMT", "id": "bdba4c992649b733d8fded3546b2a5ea", "content": "FORT WAYNE, Ind. (WANE) A man was seriously hurt in an overnight shooting at a Fort Wayne motel.\nThe incident happened around 11:30 p.m. Monday at Regency Inn in the 1000 block of W. Coliseum Blvd.\nPolice at the scene told NewsChannel 15 someone apparently accidentally pulled the trigger of a gun as it was being passed around a party at the motel. A man in the room was shot in the head, but the injury was not life-threatening.\nAccording to a Fort Wayne Police report, an officer nearby heard the shot ring out and saw people scatter into the motel’s parking lot. A woman then came to the officer’s squad car and told him someone had been shot, the report said.\nAs the officer approached the motel, he saw a man holding a black “Ak-47 style rifle” and walking northbound near two rooms with open doors, the report said. The officer ordered the man to drop the gun, and he did, the report said. The man – identified as Christian D. Myers – was placed into custody.\nInside Room 123, officers found a man identified as Tyler Eddington laying near a bed bleeding from his head, the report said.\nPolice found another gun inside the room, along with apparent marijuana, the report said. Officers also found a bullet hole in the west wall of the room and holes on the outside of the wall and the inside and outside of the stairway wall, according to the report.\nInvestigators identified at least two witnesses, and one woman went with detectives to police headquarters to make an official statement, the report said.\nCourt records show Myers was charged Tuesday with criminal recklessness.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}