{"uri": "http://www.walb.com/story/27475277/police-man-kills-girlfriends-2-year-old-daughter-shoots-himself", "title": "Police: Man kills girlfriend's 2-year-old daughter, shoots himself", "dct": "Thu, 25 Dec 2014 10:36:00 GMT", "id": "6497c34a236695504a18c76435800a04", "content": "ANSON COUNTY, NC (WBTV) -\nA man killed his girlfriend's 2-year-old daughter before shooting himself at an Anson County home on Monday, according to officials.\nPolice said they received a call around 5:15 p.m. to a home on Horne Store Road, off of Upper White Store Road. In a small building behind the home, police found 33-year-old George Rufus Harris III dead with a gunshot wound.\nTwo-year-old Kenya Evans, who police say was the daughter of Harris' girlfriend, was found deceased inside the home. Police have not said how the child died, but did say there were \"no obvious signs of physical injuries.\"\nPolice say Harris left a note that indicated both deaths were the a result of a murder-suicide.\nHarris was an absconder and a wanted sex offender from Kentucky. Anson County Sheriff Tommy Allen said, “The last time Kentucky had any contact with Harris was about a year ago. We believe he had been living here a few months. Although we've had some calls to this residence over the past year we have not had any contact with him.\"\nAllen said six or seven adults and at least four other small children lived inside the home. DSS was contacted after Allen said the living conditions inside the home were \"horrid\" and the worst he has seen in more than 30 years in law enforcement.\n“I've talked with the DSS Director this morning. They are going to do an inspection of the house and determine the living conditions for the other children. But I can tell you it's not suitable for anyone, adults or children.” Allen said.\nNo motive as to why Harris shot Kenya or himself has been released. Kenya would be turning three in January.\nThe home is located about five miles south of Peachland, in the southwestern part of Anson County.\nCopyright 2014 WBTV. All rights reserved."}