{"uri": "http://www.nola.com/crime/index.ssf/2015/09/harvey_hustlers_members_plead.html", "title": "Harvey Hustlers members plead guilty to murder, drug distribution", "dct": "Wed, 23 Sep 2015 14:38:00 GMT", "id": "92309eb876a56d474578bfe79f458f02", "content": "Two members of the West Bank gang known as the Harvey Hustlers pleaded guilty to murder and drug distribution, raising to eight the number of members of the violent gang who have admitted guilt, U.S. Attorney Kenneth Polite announced Tuesday (Sept. 22). At least four other accused gang members are scheduled for trial in coming months.\nRay Woodruff, 21, and Frankie Hookfin, 24, pleaded guilty to their role in one murder and admitted to participating in a second. They also pleaded guilty conspiring to distribute more than a kilogram of heroin and 280 grams of crack cocaine.\nThe pair admitted to the Feb. 11, 2013, murder of Emeal Washington, who was killed when gunmen fired more than 81 bullets at him.\nWoodruff, Hookfin, Terrence Kelley and Isaac Smith went looking that night to murder a rival gang member known as \"Buddy Boy,\" according to court documents signed by Woodruff and Hookfin. When they found his house, they sprayed it with gunfire, causing everyone standing in front of the house to run inside. Washington ran away from the house and was shot multiple times, later dying from his wounds. The entire incident was captured on video.\nThey also pleaded guilty to participating in the murder of Doreatha Richardson.\nOn Feb. 15, 2013, Woodruff and Hookfin, along with Smith and Harry Smoot, drove to a house in the 300 block of Fifth Street in Bridge City, according to court documents. Woodruff, Hookfin and Smith kicked open the door and opened fire after seeing rival gang member Bryan \"Fuzzy\" Pittman through a window. Richardson, who was Pittman's grandmother, was shot multiple times and later died from her injuries.\n\"Violent offenders have no place on our streets,\" Polite said in a statement. \"If you terrorize our communities through drug trafficking and gun violence, just as these defendants did, then you risk being in jail for the rest of your life.\"\nProsecutors say the Harvey Hustlers street gang operated out of West Jefferson neighborhoods, trafficking cocaine and heroin from Texas and selling the drugs throughout the New Orleans area. They were notoriously violent and included a faction of enforcers known as the Murder Squad, according to court records.\nIn March a state grand jury handed up a 30-count indictment that charged 21 members of the gang in a racketeering scheme.\nSmoot, Smith, Richard Thomas, Terrell Wade, Lance Singleton and Christopher Brown previously pled guilty to various crimes and are awaiting sentencing. Kelley and Clifford Sonnier are scheduled for trial Sept. 28 and Joequell Lewis and Andre Addison are scheduled for trial Oct. 26. The four men awaiting trial have pleaded not guilty.\nThe investigation into the Harvey Hustlers is part of a coordinated multi-agency effort that includes the U.S. Attorney's Office, the Federal Bureau of Investigation, the Jefferson Parish District Attorney's Office, and the Jefferson Parish Sheriff's Office."}