{"uri": "http://www.nola.com/crime/index.ssf/2013/05/jefferson_parish_detectives_co.html", "title": "Harvey quintuple shooting defendant said he was asleep; 'a lie,' detective testifies", "dct": "Fri, 31 May 2013 17:44:00 GMT", "id": "f4f1a12d9a70a2ec2de1612a23a985f8", "content": "A suspect in the quintuple shooting that left three toddlers and two adults wounded in Harvey told detectives he slept through the crime, according to court testimony Friday. Charlie Gumms said in his first statement that he was jolted from sleep later, in the back seat of his friend's car during a police chase. In his second statement, he said he woke to the sounds of gunfire, also \"a lie,\" Detective Travis Eserman testified.\nBut on one thing Gumms was clear: He denied the accusations from another suspect that he wielded a gun. Gumms, an 18-year-old Terrytown resident who has two eyes tattooed on the back of his neck, has been booked with being a principal to attempted second-degree murder in the April 22 attack, when two men armed with an assault rifle and a pistol stood outside an apartment door in the 2300 block of Lapalco Boulevard and fired indiscriminately on the people inside.\nA 1-year-old girl was paralyzed in the shooting, which also wounded a 2-year-old boy and a 3-year-old girl. Two women, ages 63 and 67, suffered bullet wounds to their legs.\nThe Jefferson Parish Sheriff's Office continues sorting out the four suspects, as one of them has refused to say anything to detectives, another started to talk but fell silent after asking for an attorney, and the last two, including Gumms, denied direct involvement but blamed others for the shooting.\n\"They changed their stories and pointed their fingers at each other,\" Eserman testified Friday during a preliminary hearing in 24th Judicial District Court in Gretna.\nGumms remains jailed in Gretna with suspects Frankie Hoofkin, 21, of Waggaman, Lashawn Davis, 20, of the Gretna area and Davante Robertson, 19, of Terrytown.\nThe public defenders representing them argued Friday that the evidence was insufficient to continue holding them in jail. But after hearing Eserman's testimony, Magistrate Commissioner Patricia Joyce found that the Sheriff's Office has sufficient evidence, or probable cause, to keep the four men in custody. The investigation is not over, and it remains to be seen when, or if, prosecutors file charges.\nHoofkin was booked with five counts of attempted second-degree murder and aggravated flight from an officer, for being the driver who led deputies and state Department of Public Safety bridge police on a chase from the shooting scene across the Crescent City Connection into downtown New Orleans. He crashed the car at the Earhart Boulevard exit, where he was injured after falling or jumping off the exit ramp to the ground below. He appeared in court Friday in a wheelchair, his left arm in a cast.\nGumm, Davis and Robertson are being held on five counts each of being a principal to attempted second-degree murder. Eserman's testimony suggested that the identity of the second gunman has not been determined.\nDavis also was injured at the crash scene, where a \"police dog chewed on him,\" public defender Paul Fleming Jr. said. Gumms and Robertson were found hiding nearby in bushes, Eserman testified.\nHoofkin's three friends identified him as the owner of the assault rifle and one of the shooters. Depending on which suspect was talking, the second gunman was Robertson or Gumms, Eserman said.\n\"We have everybody saying somebody got out of the car with Hookfin,\" Assistant District Attorney Vince Paciera said, arguing that all four suspects were arrested together.\nAuthorities say the ground outside the apartment was littered with 7.62mm bullet casings, commonly used in assault rifles, and two .40-caliber bullet casings. That suggests two gunmen.\nEserman said Sheriff's Office ballistics experts have linked the assault rifle, found in Hookfin's car, to the 7.62mm casings at the apartment. The .40-caliber pistol has not been found, Eserman said, but deputies recovered a 9mm pistol from a roadway after one of the suspects threw it from the car.\nFingerprint tests are pending, he said. He conceded under questioning from defense attorneys that gunshot residue tests were not done on the suspects.\nAt the time of the shooting, sheriff's deputies and an FBI agent were at the neighboring Helen Cox High School campus, waiting for a suspect in a different crime to show up. They heard the gunfire and saw two men running from the apartments to a car, whose driver then sped off, Eserman testified.\nA Sheriff's Office spokesman has said previously that authorities think the shooting came in retaliation for an incident at a New Orleans bar. Eserman provided no testimony Friday on what detectives think was the motive\nPaciera said Davis has \"a bad juvenile history\" that includes convictions of simple battery and simple burglary and an arrest in 2011 on a charge of second-degree murder. He pleaded guilty as a juvenile in 2009 to attempted second-degree murder and also is being held for a parole violation.\nRobertson pleaded guilty in 2007 to attempted armed robbery and has an arrest for disturbing the peace for causing \"a major fight\" at his school, as well as an arrest for possession of marijuana in 2011, Paciera said."}