{"uri": "http://www.kcbd.com/story/34175264/2-suspects-released-after-drive-by-shooting-in-lamesa", "title": "2 suspects released after drive-by shooting in Lamesa", "dct": "Tue, 03 Jan 2017 22:04:00 GMT", "id": "91b89a294c5f522b4460489ca2735b29", "content": "LAMESA, TX (KCBD) -\nAccording to Lamesa Police Chief Dale Alwan, the two suspected gunmen who were taken into custody on Monday have been released pending investigation into the drive-by shooting in Lamesa that left a house riddled with bullet holes.\nLamesa Police Chief Dale Alwan says two suspects are now in custody in connection with a drive-by shooting that happened in Lamesa on Monday.\nThere are 17 bullet holes on the outside of the house in the 1600 block of North 8th Street. Police say the drive-by shooting happened around 7 p.m. Monday.\nFortunately, no one was injured in the shooting, but neighbors in the area say they are left feeling uneasy.\n“It’s pretty quiet. Nothing really happens, except now this,\" neighbor Sonia Gurrola said.\nPolice tape marks the area around the 1600 block of North 8th Street in Lamesa.\nA concerning sight for neighbors.\nBut even more concerning, is what neighbors like Gurrola heard last night.\n“Out of nowhere we heard the gunshots, so we got down and went to my room cause it’s in the back,\" Gurrola said.\nOne witness says more than a dozen rounds were fired last night during a drive-by shooting.\nSonia says she was inside her house watching a movie when she was shocked by the gunshots.\n“So we got down on the floor, cause we didn’t know. We, it sounded like a lot. We were scared,\" Gurrola said.\nWhile police continue to investigate, Sonia says she feels like a stranger in her own neighborhood, where she’s lived for several years.\n“It don’t feel the same no more. I don’t feel safe...I feel like I can’t come outside no more, because maybe something will happen again. So I’d rather just probably stay inside,\" Gurrola said.\nShe says she hopes some peace and reassurance will come soon.\n“Just that, you know it gets back to the way it was. Like quiet, and nothing happens again like this,\" Gurrola said.\nCopyright 2017 KCBD. All rights reserved."}