{"uri": "http://www.pe.com/articles/sept-812716-fernando-seven.html", "title": "Fugitive arrested in Perris restaurant shooting that killed 1, injured 4 (UPDATE)", "dct": "Fri, 09 Sep 2016 18:13:00 GMT", "id": "569062ca713bed807cf87d0a502e1051", "content": "Updates with not-guilty plea\nA fugitive murder suspect accused of opening fire at a Perris restaurant in January was arrested last weekend as he tried to re-enter the United States, authorities said.\nHector Fernando Carvajal, 48, of Riverside, pleaded not guilty Thursday, Sept. 8, to one charge of murder and four of attempted murder for the Jan. 25 shooting at Nayarit Mexican restaurant in downtown Perris. He also faces five enhancements, which could lengthen his prison sentence if he’s convicted, that he used a firearm to cause great bodily injury.\nCourt documents identify the dead man as Pedro Murillo-Martinez and the other victims as Juan Becerra, 25, who was shot once in the abdomen; Jose Contreras, 35, shot twice in the abdomen; Ramon Duran, 58, shot once in the face; and Fabian Flores, 18, shot once in his right foot.\nCarvajal was arrested Saturday by the U.S. Customs and Border Protection agency at an undisclosed location and transferred to Riverside County, where he was booked into jail Monday, Sept. 5. He remains at the Southwest Detention Center, with bail set at $5 million.\nHis arraignment was originally scheduled for Wednesday, but it was delayed because he wasn’t medically cleared to appear in court. The nature of his medical issue was not available.\nSheriff's deputies were called to the Nayarit restaurant at 140 S. D St. about 1 a.m. Jan. 25 and found five males who had been shot.\nDays later, investigators released a screen grab of a man they described as a person of interest.\nWhat they didn't say, but is disclosed in court records, is that the homicide was caught on the restaurant’s surveillance cameras. The restaurant’s owner recognized the shooter as someone he knew only as “Fernando,” as did witnesses to the shooting.\nThe shooter frequented the restaurant multiple times a week, according to an arrest warrant issued Feb. 8 and also not previously disclosed by authorities.\nThe witnesses did not hear any argument before the shooting, and did not recognize the victims as regular customers.\nInvestigators located a family member, who said she had not seen Carvajal since a few days after the shooting, and denied knowing about the incident, according to court records.\nThey also tracked down a friend of Carvajal and seized a jacket that belonged to him and was identical to one worn by the shooter in the restaurant video.\nIf investigators have determined what Carvajal's motive may have been, they didn't say in court documents.\nThe Sheriff’s Department did not release details about the shooting until almost 36 hours after it happened; a spokesman said detectives were concerned about jeopardizing the investigation if information were released.\nThe victims’ names were not publicly disclosed until the arrest warrant was issued Feb. 8.\nPREVIOUS COVERAGE:"}