{"uri": "http://www.wisn.com/article/pair-charged-in-teens-shooting-death/8522144", "title": "Pair charged in teen's shooting death", "dct": "Wed, 21 Dec 2016 23:52:00 GMT", "id": "8cfc028f591f7c8e0b56daeebbf011e6", "content": "MILWAUKEE —\nTwo men were charged on Tuesday in connection with last week's shooting death of a 15-year-old girl.\nAlex Dixon, 18, and Martaouse Holloway, 19, shot into Melanie Johnson's home, near North 35th Street and West Silver Spring Drive, on Dec. 13 because Dixon was angry at Johnson's brother, the criminal complaint alleges.\nAccording to investigators, Johnson's brother had recently started a relationship with the mother of Dixon's child.\n\"To lose my niece. I don't even have words over how someone could do that over a foolish grudge,\" said Johnson's aunt, Sheila Kitchens.\nHer cousin, Dawnesha Robinson is also hurting.\n\"It just makes me feel really disgusted you know,\" Robinson said. \"It was over some foolishness, and you could have just walked away with your life and another person's life.\"\nDixon told police they wanted to \"air out the house,\" the complaint said.\nMilwaukee Police Chief Ed Flynn said it's time to change the culture.\n\"This is crazy, and it's endemic. Time and time and time again, for some people. This is damn near a cultural response. 'I'm insulted. Where's my gun? I'm going to shoot you.' We've got to reel that in,\" Flynn said.\nJohnson, who police said was not the intended target, was shot twice and died at the scene.\nJohnson's family said she died while saving her nephew and shielding him from the gunfire. They also added that she was pregnant, and was going to become a mother.\nDixon is in custody. A warrant has been issued for Holloway's arrest. Both face a charge of first degree reckless homicide. Holloway also faces a charge of possession of a firearm by a felon.\nHe was convicted earlier this year of second-degree reckless endangerment, court records show. That conviction was for a December incident in which police said he accidentally shot his brother in the chest. He was sentenced in March to two years probation.\nHolloway violated that probation a month later. A warrant was issued for his arrest, but he's been on the lam ever since, police said.\nMartaouse Holloway\nIf anyone has any information on Holloway, they are asked to call Milwaukee police."}