{"uri": "http://www.detroitnews.com/story/news/local/wayne-county/2015/12/04/taylor-shooting/76782820/", "title": "Chief: Shooting victim, 7, ‘just wanted to play soccer’", "dct": "Fri, 04 Dec 2015 00:00:00 GMT", "id": "94cac849de314be93f3cc3fdcd3c9e0b", "content": "Taylor — Seven-year-old Emma Watson Nowling, who died Friday after she and her mother were shot outside the Taylor Sportsplex, was the victim of a man with a gun and an apparent mental instability, police said.\n“Unfortunately, it appears as a result of his instability, we now have a little girl who just wanted to play soccer yesterday and never went home,” Taylor Police Chief Mary Sclabassi said.\nInvestigators believe the male suspect — Timothy Nelson Obeshaw, 57 — shot Sharon Elizabeth Watson, 37, and Emma, and then fatally turned his gun on himself at about 7:50 p.m. Thursday outside the sports complex in the 13300 block of Telegraph.\nSharon Watson is in stable condition at a local hospital, Sclabassi said during a news conference Friday at the Taylor Police Department.\n“We still don’t have a motive for the shootings,” the chief said. “However, talking to family members and witnesses revealed Obeshaw had been experiencing some mental instability in the past year or so.”\nShe added investigators found evidence he believed “someone was trying to control him through mind control” and made statements “that someone was out to get him.”\nPolice have not received any record that Obeshaw was diagnosed or receiving treatment for any mental disorder, Sclabassi said. He had no criminal record, she added.\nObeshaw recently moved to Taylor, police said. Family members told investigators he was a family friend who previously lived with the victims in Belleville, Sclabassi said. There was no evidence of a romantic tie between Obeshaw and Watson.\n“Last night, witnesses told us Sharon and Emma were at the Sportsplex for regular soccer practice,” the chief said. “Obeshaw had been seen at the beginning of practice, embracing the young girl. She embraced him back as if there were no problem.”\nSclabassi said Obeshaw had been at Emma’s soccer practices in the past.\nAfter soccer practice, investigators believe Obeshaw walked up to Watson and her daughter after they got into their vehicle and were preparing to leave. He fired a 9mm handgun multiple times, first hitting Watson and then Emma, Sclabassi said.\nSclabassi said the weapon was found near Obeshaw’s body. Obeshaw legally obtained his handgun in September, the police chief said. Detectives don’t know if he had the weapon with him when he was inside the facility, she added.\nBrian Jones, who was at the Taylor Sportsplex Friday, called the shooting “a tragedy.” Jones said he brings his children to play youth hockey from Nashville at least six times a year. He said he heard about the shooting last night while at his hotel.\n“It’s really terrible,” he said. “I guess it’s a sign of the times.”\nEmma and Watson are related to Bill Nowling, the former spokesman for Detroit Emergency Manager Kevin Orr. On Friday, Nowling posted a message on Facebook: “If you are a praying person, the Nowling and Watson families could use some today.”\nSclabassi said the Taylor Sportsplex historically is a safe place.\n“We have no reason to believe this individual necessarily targeted the Sportsplex,” she said. “It’s just unfortunate that s where Miss Watson and her daughter happened to be when this occurred.”\nWatson is being treated at Beaumont Hospital in Dearborn, Sclabassi said. She also said Watson has some procedures to undergo, but will hopefully recover.\nSclabassi said Watson was informed Friday morning about her daughter’s death. “As to what she’s able to comprehend, I do not know,” the chief said.\nA gofundme campaign has been established to help cover funeral costs for Emma Watson Nowling and medical expenses for her mother.\nAuthorities continue to investigate and anyone with information about the incident should call Taylor Police at (734) 287-6611.\ncramirez@detroitnews.com\n(313) 222-2058"}