{"uri": "http://raycomgroup.worldnow.com/story/24385909/2nd-lawsuit-filed-in-deadly-centennial-hill-bar-grill-shooting", "title": "2nd lawsuit filed in deadly Centennial Hill Bar & Grill shooting", "dct": "Tue, 07 Jan 2014 18:27:53 GMT", "id": "7bc6d813417dc398ab5ba5407d87c2d2", "content": "MONTGOMERY, AL (WSFA) -\nA Montgomery law firm is filing its second lawsuit in connection to a shooting that left 3 people dead and 5 others injured at the Centennial Hill Bar & Grill, formerly known as Rose Supper Club, on December 28, 2013.\nMichael Strickland of Strickland & Kendall and Dwayne Brown of the Law office of Dwayne L. Brown, P.C. filed an initial suit on January 6th on behalf of Keldric Landon, shot 3 times while a patron at the club.\nOn January 9th, the firm filed a second suit on behalf of two more victims, Clarence Young, Jr. and Ferro Bennett, both 20-years-old. Attorneys say Young was shot once and Bennett was shot 3 times.\nThe law firms are also representing the estate of Glenn Thomas, an up-and-coming rapper who went by the name Doe B.\nThomas, 22, as well as Troy University student Kimberle Johnson, 21, died on the scene. A third person, Tim Hamilton, 20, died at a Montgomery hospital on January 3, 2014.\nThe first lawsuit names only Landon as the plaintiff.\n[DOCUMENT: Lawsuit #1 against Centennial Hill Bar & Grill (.pdf)]\nThe second lawsuit names Young and Bennet as plaintiffs.\n[DOCUMENT: Lawsuit #2 against Centennial Hill Bar & Grill (.pdf)]\nNamed as defendants in both suits are The Flight, LLC d/b/a Centennial Hill Bar & Grill, owner and manager Nicole Bankhead, the club's security company and other unnamed individuals who may be identified in the future.\nBankhead's business license has been revoked and she is no longer allowed to own operate a business in the city of Montgomery.\nThe lawsuits accuse the defendants of \"negligent and reckless disregard for life\" and seeks a jury trial and an unspecified amount of money in damages.\nTwo suspects, Jason McWilliams and Darius Thomas, both 25, are in custody and charged with several counts of capital murder in connection to the shootings.\nCopyright 2014 WSFA 12 News. All rights reserved."}