{"uri": "http://www.kmov.com/story/30939963/boy-11-shot-and-killed-in-alton", "title": "Man charged in drive-by shooting that killed boy - KMOV.com", "dct": "NODATE", "id": "4d833e8447786235517e727634680e82", "content": "Print\nTa'mon Ford is charged with two counts of first degree murder. He allegedly killed Romell Jones in an apparent drive-by shooting in front of the Alton Acres Housing Complex’s recreational center\nALTON, Ill. (KMOV.com) -\nAn 18-year-old was arrested and charged Thursday in connection with the fatal shooting of an 11-year-old boy in Alton.\nTa'mon Ford is charged with two counts of first degree murder. He allegedly killed Romell Jones in an apparent drive-by shooting in front of the Alton Acres Housing Complex’s recreational center around 5 p.m. Monday night, according to officials. Earlier on Thursday, authorities located a red car believed to be connected to the shooting.\n“There ain’t nothing I wouldn’t do to bring him back,” said Sonya Dixon, Jones' mother.\nAuthorities believe Ford was having a dispute on social media with several people, including two of whom that were at the scene of the shooting. Ford allegedly drove to the Alton Acres Housing Complex to confront those involved with the dispute.\nWitnesses said someone fired several shots from the inside of a red car, striking Jones, before the vehicle drove off on Paul Avenue.\nFollowing the shooting, a teenager cradled Jones and took him into the center. A witness told News 4 that Jones was shot in the chest.\nHe was taken to a hospital, where he was pronounced dead.\nKelly Allen, Jones’ aunt said, “He was just, I would say, in the wrong place at the wrong time, just being a kid wanting to go play basketball. It’s senseless, just senseless.”\nWednesday night, family and friends remembered the child's short life. The gathering was for loved ones to come together, light candles, and remember Jones.\nCopyright 2016 KMOV (Meredith Corporation). All rights reserved."}