{"uri": "http://thetelegraph.com/news/76379/alton-boy-shot-in-drive-by-condition-unknown", "title": "Alton boy dies after ‘drive by’ shooting, APD seek information", "dct": "Mon, 11 Jan 2016 00:00:00 GMT", "id": "f4cd99eb3b1662a6742d438c25b5cab2", "content": "ALTON — An 11-year-old boy died Monday evening after someone drove by the community center at Alton Acres public housing complex and fired several shots at a group of youths playing basketball.\nThe boy died at a local hospital emergency room. The Madison County Coroner’s Office plans to release his identity on Tuesday following an autopsy, said Maj. Jeff Connor, deputy commander of the Major Case Squad of St. Louis in Illinois.\nThe boy was a resident of Alton Acres.\n“It was just kids standing outside, waiting to go to basketball practice,” said Greg Denton, executive director of the Alton Housing Authority shortly after the shooting.\n“It’s really sad. They were just standing outside. I’m praying he will be alright,” Denton said shortly after the 5:16 p.m. shooting, prior to the boy being pronounced dead. Denton also is a minister.\nAlton Police Chief Jason “Jake” Simmons referred reporters’ questions to Connor.\nDuring a briefing with the media at 9:40 p.m., Connor said the investigation still was early and urged anyone with information on the killing to call Alton police at (618) 463-3505. At that point, Connor said investigators only know the shooter was inside a red car, of unknown make or style. He could not confirm the boy was shot in the arm, as reported on police radio, until after the autopsy.\n“These kids were not causing any trouble at all,” Connor said of the group at which the gunman fired. He said it is difficult to understand why someone would shoot an 11 year old. “It shows the disregard for human life. Multiple people could have been hit.”\nConnor said 20 detectives, who had assembled in the Investigations Bureau at the upper level of the Donald E. Sandidge Alton Law Enforcement Center, were ready to go out and interview anyone with information.\n“We are trying to locate as many witnesses as we can,” he said.\nSeveral people called 911 at 5:16 p.m. to report shots fired from a car near the community center, on the corner of Acorn Street and the 3100 block of Paul Street. Scanner traffic reported an “8-year-old” gunshot wound victim, with numerous people fleeing the area. Police radio said the boy was conscious and breathing, then it said he reportedly lost consciousness and police were performing cardio-pulmonary resuscitation. Authorities later revised the victim’s age to 11 years old.\nElijah Harris, 17, of Godfrey, said he was playing basketball on the outdoor court when he heard about three shots fired but did not see where they came from. The youths playing basketball ran off, except for the young victim, who had fallen. Harris said he saw a chest wound, picked up the fatally wounded child and carried him inside the community center.\nParamedics from the Alton Fire Department were nearby on standby until police verified the scene was secure. The paramedics then came to the center and treated the child until an ambulance arrived at 5:30 p.m., taking him to a local hospital emergency room.\nAuthorities called APD detectives and two deputies from the Madison County Sheriff’s Department to assist in interviewing numerous witnesses at the scene before the Major Case Squad was activated.\nAlton police have a live feed from security cameras posted at Alton Acres and Oakwood Estates complexes, both operated and maintained by the Alton Housing Authority, which Connor said investigators are examining.\nAfter detectives interviewed Harris, his mother Tara Wheeler said she is tired of violence and wants the killer to turn himself into police.\n“All of these killings, it’s terrible,” she said, acknowledging her son could have been the shooting victim. “The killings need to stop. Alton needs to get together and get something for these kids to do, there’s nothing to do.”\nShe said the shooter may think he got away with his crime, but God knows what he did.\n“You should come down here,” she said to the killer from inside the police station lobby.\nWheeler, though, is proud her son who tried to help save the wounded child.\n“He helped the baby out of it, he was marvelous. He got the baby back inside, but he (victim) passed. I’m very grateful he didn’t get shot. It could have been him.”\nReach Linda N. Weller at 618-208-6450 or on Twitter @Linda_Weller"}