{"uri": "http://fox4kc.com/2015/09/06/prosecutors-reveal-23-year-old-mother-pulled-guns-trigger-which-killed-her-5-year-old-son/", "title": "Prosecutors charge KC mom, saying she pulled trigger, killing 5-year-old son", "dct": "Sun, 06 Sep 2015 22:12:00 GMT", "id": "34efcfd1d22ec5fc192e175338418c8c", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nKANSAS CITY, Mo. -- A Kansas City mom is charged in the death of her own son. Police say the five-year-old boy was shot in head. Sunday investigators revealed his own mom is who pulled the trigger.\nRosilyn Temple knows the pain of losing a child all too well. She created the group Mothers in Charge to help metro moms when they lose their children to murder, but she was thrown Sunday to hear police say the victim's mother was the one behind the gun.\n“As a mother, I feel for her,” said Temple. “My heart cries out for her and the child.”\nPolice say 23-year-old Lisa Hall was inside her home arguing with her boyfriend. Her five-year-old son, Jesse, was standing next to him. Hall had been drinking and the argument got heated. Police say hall pulled a handgun from her waist and fired at her boyfriend but it was her five-year-old son that fell to the floor.\n“With this one, it started in the home and ended in the home,” Temple said.\nFriends say Hall and her boyfriend had a dysfunctional relationship with many highs and lows. They say the two fought constantly, one friend says she tried to help Hall leave the relationship but the 23-year-old refused.\n“It led up to that. It just didn't happen overnight and this baby was shot. It was leading up to that. As friends and family we see that going on in our community. Speak up about it. Stand out and say no let's get help for this family,” said Temple.\nHall is now charged with child endangerment and unlawful use of a weapon. No matter the charge, Temple says Hall is still a mother and she still plans to offer her help even if it’s through a jail cell.\n“Still wanna reach out. I still wanna reach out. I don't know what the mother's story was. We all have a past,” said Temple.\nProsecutors have requested a bond of $150,000. The case remains under investigation."}