{"uri": "http://www.courant.com/breaking-news/hc-bridgeport-shooting-follow-0823-20160822-story.html", "title": "Bridgeport Police Confident Suspects In Mass Shooting Will Be Caught", "dct": "Mon, 22 Aug 2016 22:46:00 GMT", "id": "5c5edd2b4f6459780d90ccdd75a094a5", "content": "Bridgeport police Chief Armando Perez was confident Monday that detectives would catch the shooters who hid behind bushes outside a house party on Sunday and fired on more than 100 people, wounding 13.\n\"Don't be surprised by the end of the week we have these two guys in custody,\" Perez said. \"We are there.\"\nSince city officers rushed to the chaotic scene early Sunday on Plymouth Street, officials said they have been joined by federal investigators with the FBI and the Bureau of Alcohol, Tobacco, Firearms and Explosives.\nAnd it's federal charges Perez wants the shooters to face. \"Hopefully we will be able to put these people away for a long time,\" Perez said, noting he has the support of the U.S. attorney.\n\"I want to show everyone if you are going to have the guts to do something like this, this is what's going to happen,\" Perez said.\n\"They had no regard for human life. Total disregard. [They] just shot into the crowd,\" Perez said.\nBy Monday, the majority of the shooting victims, many of whom were shot in the legs, ha been released from hospitals. The victims were in their late teens and early 20s.\nThe most seriously injured, a woman shot in the face, remained in critical but stable condition, city officials said.\n\"They're optimistic that she is going to pull through,\" city spokesman Av Harris said Monday.\nAmong the evidence collected were 10 shell casings belonging to .40-caliber and .45-caliber firearms.\n\"It's only for the grace of god no one died,\" Perez said Monday. \"There should've been five or six people dead that day.\"\nThe probe into the case continued at a fevered pace Monday with a captain, a lieutenant and 10 detectives working on it, Perez said, not counting the federal agents.\nGov. Dannel P. Malloy spoke to officials in Bridgeport on Monday and pledged the state's support. Perez plans to contact Commissioner Dora Schriro of the Department of Emergency Services and Public Protection on Tuesday.\nBut support hasn't only come from law enforcement. People in the city have also been helping the investigators tracking down the shooters. Perez said: \"The community is with us.\"\nThe suspects opened fire on people attending a house party Plymouth Street early Sunday.\n\"People initially thought it was fireworks. By some witness accounts, even the DJ said, 'Don't worry about it, it's fireworks,' until people started realizing they were shot,\" Capt. Brian Fitzgerald said at an afternoon news conference.\nPolice have not released the names of the homeowners, who requested a permit to serve alcohol at the event and were denied, officials said.\nCity officials said they had denied the request because police had been called to the home in the past for loud parties and domestic violence.\nPolice believe that homeowners were charging for alcohol and said they could face charges.\nPolice have yet to say what motivated the shooting, but were investigating whether the shooters had attended the party, according to Fitzgerald.\nCity residents often request permits to hold house parties and serve alcohol, but police turn them down, Perez said. He noted these parties are opportunities for violence.\n\"We flatly deny them. If you want to have a party go rent a hall … and hire a police officer,\" Perez said. \"You are not going to have a party in the back of your house.\"\nPerez has assigned a lieutenant who will work with officers to seek out unsanctioned parties.\n\"Any time we encounter these kinds of parties, we are going to shut it down,\" Perez said. \"You just cannot allow these things.\"\nThe Plymouth Street shooting comes just over a year after nine people were shot at the Trumbull Gardens Housing complex. A 37-year-old Shelton man was killed in the gunfire.\nCourant staff writer Christine Dempsey contributed to this story. An Associated Press report is included."}