{"uri": "http://www.detroitnews.com/story/news/local/detroit-city/2016/04/11/men-indicted-shooting-death-detroit-girl/82890466/", "title": "3 men indicted in shooting death of Detroit girl, 3", "dct": "Mon, 11 Apr 2016 00:00:00 GMT", "id": "275393d8171d9821e7a63ca3bfb38187", "content": "Three men have been indicted by a one-man grand jury in the Easter morning shooting death of a 3-year-old Detroit girl, the Wayne County Prosecutor’s Office announced Monday.\nThe indictment of Paul G. Kendall, 24, of Ecorse, Reginald L. Street, 19, of Detroit, and Jonathan L. Burks, 30, of Detroit, was issued April 6 and unsealed Monday by Wayne County Circuit Court Judge Timothy Kenny.\nAccording to the prosecutor’s office, the three men went to a home at 2 a.m. March 27 on the 16800 block of Riverview near West McNichols and Telegraph and shots were fired, striking the girl. She was taken to a local hospital and pronounced dead on arrival.\nThe girl, later identified by the Wayne County Medical Examiner’s Office as A’Naiya Denise Montgomery, died of multiple gunshot wounds.\nThe shooting also injured a 39-year-old man and a 26-year-old man, police said.\nRelatives told The Detroit News that A’Naiya’s mother, Andrea Montgomery, knew the alleged shooter, identified in court as Kendall.\nKendall, Street and Burks are each charged with first-degree murder, felony murder, two counts of assault with intent to murder, first-degree home invasion, discharge of a firearm in or at a building causing death and felony firearm.\nStreet and Burks are also charged with felon in possession of a firearm.\nThey were arraigned by Kenny on Monday.\n“We probably would not have been able to charge this case if not for having the grand jury,” Wayne County Prosecutor Kym Worthy said in a statement. “In this office, we use this process thoughtfully, carefully and discreetly.”\nThe men will have a final conference on June 17 and a trial is scheduled to begin on July 25.\nDetroit Police Sgt. Michael Woody said last month there were others in the home at the time when one of the men kicked in the front door.\n“Once inside, the suspect opened fired and struck the 3-year-old girl,” Woody said.\nA 2014 Detroit News investigation found nearly 500 Detroit children have died in homicides since 2000, an average of nearly three dozen annually."}