{"uri": "http://www.detroitnews.com/story/news/local/detroit-city/2016/04/20/suspect-child-shooting-commits-suicide/83292442/", "title": "Suspect in child’s Easter death commits suicide", "dct": "Wed, 20 Apr 2016 00:00:00 GMT", "id": "986ee33eff17a329c1b5decbe3c33dfa", "content": "One of three suspects being held in the fatal shooting of a 3-year-old Detroit girl on Easter took his own life Wednesday, the Wayne County Sheriff’s Office said.\nPaul Kendall Jr., 24, was found hanging in his cell around noon. The sheriff’s office said EMS performed life-saving procedures, but the efforts of EMS, jail officers and medical personnel were not successful.\nKendall of Ecorse was pronounced dead at the scene.\n“Preliminarily, it appears the death was the result of Kendall taking his own life. Pursuant to our protocols, the Detroit Police Department responded to the scene and will be conducting an investigation to determine if any act of criminality was involved in the death,” the sheriff’s office said in a statement.\nThe agency said its internal affairs section will conduct an administrative investigation to determine if jail policies and procedures were followed.\nKendall’s court-appointed attorney, Michael McCarthy, called the incident “sad” and said Wednesday that Kendall did not appear to be despondent. Kendall was very conversant with him when he last saw him Friday to go over the case, lawyer said.\n“I feel very bad about this,” McCarthy said. “This is an ongoing and continuing tragedy. He had a keen appreciation he was in some serious legal difficulty.”\nMcCarthy said he was appointed by Wayne Circuit Judge Timothy Kenny to represent Kendall. McCarthy said Kendall asked him to get in touch with his mother and let her know where he was, said McCarthy, who explained Kendall did not have telephone privileges because he was in maximum security.\nMcCarthy said he contacted Kendall’s mother who said she planned to visit her son Wednesday, his scheduled visitor day.\nMcCarthy said Kendall was a father of three and was married but separated. Kendall worked as a temporary banquet waiter.\nKendall was jailed April 7 without bond, awaiting a June 17 hearing in connection with the shooting death of A’Naiya Montgomery. He faced a series of charges, including first-degree murder.\nA’Naiya was fatally shot March 27 in a west-side home on Riverview in the Old Redford section of Detroit. Police and witnesses said the girl was in the home with others when a man kicked in the front door around 2:10 a.m. and began shooting. She was hit and died of multiple gunshot wounds.\nBesides Kendall, two other men were arrested and charged in the shooting. Reginald Street, 19, and Jonathan Lamar Burks, 30, both of Detroit, are facing murder and other charges in the shooting."}