{"uri": "http://www.detroitnews.com/story/news/local/detroit-city/2016/03/27/year-old-girl-killed-shooting-detroit-home/82318148/", "title": "Officials ID 3-year-old shot on Easter in Detroit", "dct": "Sun, 27 Mar 2016 00:00:00 GMT", "id": "99a16fb0ace7fd6ecc637821a39a6c3c", "content": "Detroit — The Wayne County Medical Examiner’s Office on Monday identified the 3-year-old girl shot dead in a west side home on Easter morning as Anaiya Denise Montgomery. She died of multiple gunshot wounds. Her death was a homicide.\nAwakened Sunday by frantic banging on his front door on Riverview in the Old Redford area of the city, Craig Gebhardt wondered what had disturbed the quiet of his neighborhood, especially so early, and on Easter.\n“Can you call 911?” he said a distraught young man was begging him, just after 2 a.m.\nThe shooting on the 16800 block of Riverview near West McNichols and Telegraph killed a 3-year-old and injured the young man’s father, a 39-year-old, and another man, 26, police said.\nGebhardt, 63, who has been part of the Old Redford neighborhood for more than 15 years, said he’s had suspicions about the goings-on at the home.\nGebhardt and other neighbors, including a landlord on the street, said they believe it was a targeted, not random, shooting. Police would not address a motive.\n“From 8 or 9 at night to 4 in the morning, you might see 30 cars a night (at the house),” he said. “They pull up, go inside, and come right back out.”\nSome people’s stays are so short they didn’t even turn off their headlights, Gebhardt said.\nDetroit Police Sgt. Michael Woody said there were others in the home at the time when a man kicked in the front door about 2:10 a.m. Sunday.\n“Once inside the suspect opened fired and struck the 3-year-old girl,” Woody said.\nWoody said the 39-year-old man was in critical condition and the 26-year-old was in stable condition.\nA neighbor who would refer to herself only as Miss Jackson also received a request to call 911. Relatively new to the neighborhood, Jackson said she has been concerned with the amount of traffic the home has attracted.\nBut she didn’t move from the home on the block. And she doesn’t plan to now, she said.\n“My faith is in God,” she said, adding that the house where the violence took place is “part of the problem.”\n“They know the person who did that,” Jackson said.\nGebhardt is similarly undeterred.\n“That’s one in a million thing,” he said.\nWoody said the shooter fled the scene by foot and then got into a white or gray Grand Marquis.\nHe is described as 6 feet one inch tall with a medium complexion and slim build. He was wearing gray clothing.\nDennis Bosak, a landlord who said he rents eight homes in Old Redford, said he’d been warning police of suspicious activity at the house since last summer.\nBosak said to be a successful landlord in the neighborhood, “you have to be defensive” about keeping property secure. That means security cameras and motion detectors.\n“I might not be able to stop crime, but I can make someone want to look past my house,” Bosak said.\nHe describes Riverview as “a quiet street, except for one house” — the scene of the shooting.\nPreviously, in emails to Detroit police, Bosak laid out his concerns in detail.\nIn one email, Bosak gave the make, model and license plate number of a car he believed was involved in suspicious activity and describes the activity:\n“Car drives up, beeps the horn, young guy with a cane walks out, something transpires — can’t see what. Car leaves. Young guy goes back in house.”\nDetroit police tell a different story. There was no inaction, says Sgt. Michael Woody — just an inability to prove anything meriting a police response was actually taking place.\nPolice did not respond to a single 911 call in 2015 involving the home, Woody said. In fact, there were none since a 2012 break-in. Efforts to send plainclothes officers to investigate the situation didn’t turn up probable cause. There were no calls placed on the home to (313) 224-DOPE, the city’s hotline to report illegal drug activity, Woody said.\n“We did our due diligence,” Woody said Monday, adding that city hall’s Department of Neighborhoods was even involved. “But having a lot of people visit a house does not necessarily mean anything illegal was happening.”\nBosak said he’s been inside of the site of the shooting and calls it “uninhabitable.” The home, he said, has no kitchen sink, refrigerator, stove or even tables in the downstairs area. No place for a child.\n“I didn’t go upstairs,” he said.\nJackson said she saw the little girl playing in the front yard Saturday. Gebhardt did, too.\n“I saw her, and she waved, and then I waved,” he said. “Ten hours later, she was dead.”\njdickson@detroitnews.com"}