{"uri": "http://fox59.com/2013/06/02/four-wounded-in-birthday-shooting/", "title": "Four wounded in birthday shooting", "dct": "Sun, 02 Jun 2013 20:45:00 GMT", "id": "74e483390dcb59c12f9904165563f075", "content": "After four young people were shot at a birthday party late Saturday night, Metro police will review the operating permits and past code violations of the owner of the social club where the shootings occurred.\nA large bullet hole shattered the plate-glass window and blood still stains the sidewalk outside of 1913 East 46th Street, where IMPD reported up to 100 young people running and brawling in a panic after gunfire erupted outside Sweet 16 birthday party.\nOne youth told Duane White of the Ten Point Coalition that he feared he was about to be attacked by three members of an eastside gang.\n“A group of guys inside got into it and a chair flew across the room and a fight happened and that’s when security pushed the crowd out,” said White.\nOnce the mostly teenage crowd exited the building, a least five shots were fired.\nNone of the wounds were life threatening as one victim told Fox 59 News he was, “in the wrong place at the wrong time,” and that there were at least three fights inside the party before the shooting.\nSaturday night’s shootings mark an escalation in youth violence.\nMore than a dozen reports detail brawls and threats by young people downtown in the weekend before the recent Indianapolis 500 Mile Race.\nIMPD was called to break up a fight at the Marion County Health Department at 4012 North Rural Street Friday night as a graduation party swelled to approximately 400 people.\nMetro Police Chief Rick Hite is expected to unveil plans this week to combat violent crime in Indianapolis this summer.\n“We’re in the right places and we’ve identified the right people and we’re getting some of the right results.”\nPublic Safety Director Troy Riggs has been briefed on Hite’s plans for undercover and targeted patrols over the last two months.\n“I don’t want people to think that we’re waiting on this plan,” said Riggs. “Chief Hite has already instituted changes and you’re already going to see some wins that have already occurred from this plan.”\nDozens of wanted persons and felons and a number of guns have been seized in the crackdown which began in the spring.\n“You’re going to see uniforms and you’re not going to see uniforms,” said Hite, alluding to undercover investigations relying on informants and other evidence. “I think we have a good idea what’s happening in our neighborhoods and in those areas where we know that crime exists. We know we’ll see uniforms…visible uniforms…in those neighborhoods, but in those areas where its covert, you may not necessarily see them, but it’s there.”\nRiggs said a group of potential offenders and victims will get special attention from IMPD.\n“We have five thousand individuals coming back to this community every year from prison,” said Riggs. “Five thousand. 1500 of these five thousand have never lived in this city before.”\nHite said officers are working closer with the Department of Corrections and the Marion County Probation Department to identify those people.\n“We’ve identified targets over the year. Some have come back from prison. Some have been lingering for decades. Some families have been operating in this town for a very long time with impunity. We’re just sending a message in a strong way that’s not going to happen much longer.”\nPolice commanders have also encouraged beat officers to emphasize legitimate traffic stops in the search for potential warrant violators and suspected felons.\nOn the city’s northwest district, of approximately 30,000 traffic stops in the last year, one in 11 contacts led to arrests on traffic or other charges, though officers have the option to issue warnings instead.\nMany of the stops result in arrests for weapons, probation violations or outstanding warrants."}