{"uri": "https://www.baltimorebrew.com/2013/06/26/police-chief-defends-himself-in-wake-of-murder-spike/", "title": "Police chief defends himself in wake of murder spike", "dct": "Wed, 26 Jun 2013 21:52:00 GMT", "id": "e29170cd2f295ba041e3c0909bf9d368", "content": "Anthony Batts, nine months into his job as Baltimore’s police chief, insisted today that he was prepared for the outbreak of violence that left 28 people shot and 10 people killed in the city since Friday.\nIn a joint appearance with Mayor Stephanie Rawlings-Blake, who returned to City Hall this morning after a six-day absence to attend a meeting of mayors in Las Vegas, Batts defended his leadership role.\n“I am connected to this organization. I am driving directions almost every single hour,” he told reporters at his first formal briefing since the crime wave began.\nWhen the shooting spree started on Friday night, he said his chief field commander was giving him constant updates, “and I was giving him directions every single hour this weekend, so I was aware” of the violence.\n“All weekend,” he continued, “we knew what was taking place. We were trying to get in front of it very quickly.”\nWhere he faulted the department – and himself – was on public relations.\n“Our messaging this weekend was terrible. We should have been in front of you, telling exactly what was going on.”\nToday he revealed that he had reassigned the department’s chief spokesman, Anthony Guglielmi, to a community partnership office following Guglielmi comment on Monday that “all in all, we’re pretty satisfied with the way the city is headed, violence-wise.”\nIllegal Guns a Topic in Las Vegas\nMayor Rawlings-Blake seized upon the issue of illegal guns when discussing the crime spree, noting that this matter was vigorously addressed at a U.S. Conference of Mayors meeting she attended over the weekend in Las Vegas.\n“I want to again emphasize the importance of stopping the flow of illegal guns into America’s cities,” she said today in prepared remarks. “We only have one gun store in the city of Baltimore, so it’s clear that not enough is being done to disrupt the pipeline of illegal guns into Baltimore and other cities. In the past few days I met with my fellow mayors from across the county and this issue was front and center to all of us.”\nAddressing the murders that took place during her absence, the mayor said, “I have to share with you really how angry I am and concerned about what happened over the weekend – two dozen shootings, several of them fatal. And I say angry but it’s such a mix of emotions. It’s angry, it’s frustrated, it’s extreme sadness, particularly when we look at the fact that it is not outside invaders killing members of our community, it’s us killing us.”\nShe continued in her prepared remarks, “It was a terrible display of ugly and senseless violence. We know that those who perpetrate those acts [have] power to disgrace our communities and city. We got to do everything to apprehend them and bring them to justice.\n“Reducing violence,” she added, “is the No. 1 priority of my administration. I will not be satisfied until Baltimore becomes one of the safest big cities in the country.”\n“You Don’t Understand My Outrage”\nStepping to the dais after the mayor, Chief Batts said that news reports often refer to the number of murder victims. “These are not numbers. These are human beings.”\nReferring to Donyae Jones, an African-American woman who was killed early Saturday morning on the 700 block of North Kenwood Avenue, Batts said, “I look at this little 18-year-old girl who was lost this weekend on Kenwood. I look as I go out on the streets at the McCulloh Homes yesterday, where some kids were out, but some gang members fired shots out there, putting at risk those young kids. And I talked to mothers who were out there. Outrage? You don’t understand my outrage about those circumstances. I’ve made it very clear to my staff, I made it very clear to our organization, that we will respond, certainly.”\nBatts said the Kenwood Avenue shootings, which left four people shot in addition to Jones, were related to gang rivalries. He said three gangs, the Bloods, Black Guerrilla Family and DJ Boys, “a new crew,” were fighting for territory.\nDeputy Police Commissioner John Skinner said that “a tremendous amount of information” has been coming from the community in the wake of the shootings. A “wave of arrests,” he said, is about to be made of suspects.\n“Yes, We Were Ready”\nAsked if he felt he was prepared for the surge in violence that typically strikes Baltimore in the summer, Batts said:\n“From day one from when I walked in, we were preparing for this summer. And getting ready. Deputy Commissioner Skinner, one of the things I have him doing with his staff is every three months I want a plan on what we’re doing, our attack plan, our methods and our strategy. Not only tactically but strategically at the same time. We were prepared for the summer. We put things in place. We had a strategy that was out there.”\nHe continued, “This was a very dramatic weekend. We were responding behind the scenes. We were ready for it. Yes, we had things in place.”\nBut he cautioned that even the best planning cannot prevent all crime. “The random stuff that takes place because you step on my toes or because you look at me wrong – that was some of the things that were taking place this weekend also.”"}