{"uri": "http://ktla.com/2016/10/07/man-injured-after-deputies-open-fire-in-target-parking-lot-in-norwalk-lasd/", "title": "Man Shoots Himself, Dies After Exchanging Gunfire With Sheriff’s Deputy in Norwalk: LASD", "dct": "Fri, 07 Oct 2016 10:48:00 GMT", "id": "e62caecfb6aaf18e3a65e6d113e143e1", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nA man died after he apparently shot himself following confrontation with deputies in Norwalk Friday morning, authorities said.\nThe incident began around 9 a.m. in the 10000 block of Firestone Boulevard when dispatchers received a report of a man with a gun, according to the Los Angeles County Sheriff's Department.\nThe armed man — who has only been identified as a 24-year-old Hispanic male — was attempting to break into vehicles in a Target parking lot, deputies said.\nLaw enforcement attempted to stop the man as he began to cross Firestone Boulevard, and which point he put the gun to his head, authorities said in a press release.\nOfficials then commanded the man to drop the gun numerous times as he navigated the parking lot with the weapon aimed at his head, they said.\nNear the entrance of Target, the man turned and pointed the gun at law enforcement and deputies fired multiple rounds but missed, according to the statement.\nA short time after the shooting, sheriff's Lt. Eric Smitson told the Los Angeles Times there had been an exchange of gunfire between the man and deputies.\nThe man then ran between two cars and shot himself in the head, authorities said. A semi-automatic pistol was found lying next to his body.\nHe suffered \"significant\" injuries and placed on life support at a nearby hospital, but ultimately succumbed to his injuries, officials said.\nSky5 video over the scene showed a pool of blood directly outside the driver's side of a red truck in the Target parking lot. A section was cordoned off with yellow crime scene tape, and multiple law enforcement vehicles were at the location, according to the aerial footage.\nNo deputies were injured.\nAuthorities said they had not identified a motive for the man's actions. An investigation into the shooting was underway, and no additional information was immediately released.\nThe shooting occurred two days after Lancaster Sheriff's Station Sgt. Steve Owen was fatally shot while responding to a burglary call.\nTrenton Trevon Lovell “immediately” opened fire on Owen, then stood over him and fired four additional rounds as he \"executed\" him, Sheriff Jim McDonald said Thursday.\nLovell, a 27-year-old resident of Lancaster, was arrested Wednesday and booked on suspicion of murder.\nKTLA's Meghan McMonigle contributed to this story."}