{"uri": "http://www.baltimoresun.com/news/maryland/crime/bs-md-ci-homicide-arrests-20160901-story.html", "title": "15-year-old boy charged with killing 17-year-old in Morrell Park", "dct": "Thu, 01 Sep 2016 18:16:00 GMT", "id": "6df9f2c9b3beae67ebaca1527d4c3915", "content": "A 15-year-old boy has been charged with killing a fellow teenager in Morrell Park in late July, according to court records.\nThe arrest is one of two made in homicide cases in the last week that have not been disclosed by police.\nTarik Kelly was arrested Saturday and charged with first-degree murder in the shooting of 17-year-old Blake Hammond in the 2400 block of Washington Boulevard on a warm, rainy night on July 28.\nKelly was charged as an adult with eight counts related to the incident, court records show. He is being held without bail, according to the records.\nNeither he nor his family could be reached for comment.\nPolice first responded to the block, which was lighted by several street lights, about 10:43 p.m. Hammond was found on his stomach with an unknown number of gunshot wounds, and would later be pronounced dead at the Maryland Shock Trauma Center.\nAccording to court records, witnesses described the shooting to police as occurring in the middle of a conversation between the two teens.\n\"After words were exchanged, Kelly suddenly turned around and fired a gun at Hammond,\" the court records say.\nA second, unknown person then started firing a gun as well, the records say, and Hammond and a witness fled before Hammond collapsed. Hammond's family could not be reached for comment.\nCourt records say a witness picked Kelly out of an array of photographs as the shooter. They also say that other witnesses \"will testify to information Tarik Kelly provided them in conversations with him or information overheard during which details about the murder are corroborated and consistent with facts in the case.\"\nPolice are still investigating to try to determine the identity of the second shooter, the records say.\nIn addition to first-degree murder, Kelly is charged with second-degree murder, first-degree and second-degree assault and four gun charges.\nKelly's arrest was not disclosed by police until The Baltimore Sun asked about it — nor was a second homicide arrest made last week.\nRoy Clark, 36, was arrested Aug. 25 in the fatal shooting of 46-year-old Cedric Whitehead in the unit block of South Monastery Street in the Saint Josephs neighborhood of West Baltimore on the night of Aug. 19.\nIn that case, officers responded to the block about 9:37 p.m. and found Whitehead suffering from a gunshot wound to the torso. Whitehead was transported to Shock Trauma, where he was pronounced dead.\nDetectives found a baseball hat covered in blood at the scene, according to court records, and witnesses — who were kept anonymous \"for fear of retaliation\" — identified Clark as the person who shot Whitehead.\nClark, who is being held without bail, could not be reached for comment. He is charged with first-degree murder, first-degree and second-degree assault and three gun charges.\nBaltimore Deputy Public Defender Natalie Finegar, whose office represents both Kelly and Clark, said defense attorneys are in the \"beginning stages\" of investigating the charges.\nT.J. Smith, a police spokesman, confirmed the arrests Thursday. \"Great detective work aided in these cases,\" he said.\nSmith said he did not know why the arrests weren't disclosed.\nThe department has been criticized in the last two years for its low homicide clearance rate. On Thursday, that rate for the year — in which there have been more than 200 homicides — stood at 33 percent, Smith said.\ntwitter.com/rectorsun"}