{"uri": "http://www.stltoday.com/news/local/crime-and-courts/year-old-is-fatally-shot-in-st-louis-gunbattle/article_4c0a7015-e591-5c8b-8ec0-9781e2472c30.html", "title": "Outing at St. Louis park turns to tragedy as bullets fly, killing 6-year-old boy", "dct": "Thu, 12 Mar 2015 00:00:00 GMT", "id": "530b06f28053feb477cc0da0b5f7cf3a", "content": "ST. LOUIS • Marcus Johnson’s family took the 6-year-old to O’Fallon Park Wednesday to enjoy the nice weather as he recovered from heart surgery the week before.\nBut the pleasant evening at the park turned to tragedy, perhaps after a simple traffic dispute in the park. Bullets flew, and Marcus was shot and killed during a rolling gunbattle as the family left the park in a minivan about 7:30 p.m.\nMarcus’ teenage brother and a 69-year-old man in the minivan were injured and were taken to a hospital. Marcus’ parents and three other children weren’t harmed. Police were searching for the other vehicle involved. Authorities did not release a description of the shooter or shooters.\n“My baby already had stress to live in this world, and for somebody to take his life away is wrong,” Marcus’ mother, Quiana Johnson, said Thursday as tears flowed. Her surviving children surrounded her as she spoke in the living room of her home in the 1000 block of McDuff Drive, in the Glasgow Village area of north St. Louis County.\nJohnson, 34, said her son had suffered from heart disease since birth. She said her husband, Marcus Johnson Sr., 33, took the boy to Cardinal Glennon Children’s Medical Center for blood work Wednesday after his heart surgery the week before. Then the family decided to head to O’Fallon Park, just south of Interstate 70 in north St. Louis.\n“It was a nice day,” Quiana Johnson said. She and her husband gathered up Marcus and his siblings, ages 15, 11, 10 and 7, and a 69-year-old friend from Ballwin who had dropped by for a visit. They piled into a 2006 Pontiac Montana minivan the family had recently purchased and headed to the park.\n“We got a chance to get out of the house to do some things as a family,” Johnson said. “I just got a car, and it was a nice day.”\nShe said they had a great time at the park. But at one point, her husband saw someone he knew passing by in a car. The man stopped his vehicle to chat. Another man approached, upset that traffic was stopped.\n“You can’t hold this traffic up,” the man yelled, according to Johnson. “This is my ’hood.”\nThe friend in the car moved on, and the angry man walked off, but his look stuck with Johnson.\n“He had the devil in his eyes,” she said of how he looked at them, as if they had disrespected him. She said her gut told her they should leave.\nThey got in the minivan, but a vehicle followed them, and before they got out of the park, shots were flying. Johnson said bullets were hitting her car and the windows were shattered.\nShe said she had recently bought a gun because of her fear of break-ins in their neighborhood. She grabbed it.\n“I put my clip in my gun and looked back and saw that my son had been shot,” she said. “I gave it to my husband and I told him that if he didn’t shoot back, they will kill us all.”\nHe fired back as they fled northwest on West Florissant Avenue, Quiana Johnson said. The vehicle’s tires were shot out and he drove on the rims.\n“Bullets were flying past my head as I crawled back to my baby,” she said.\nThe others were huddling on the floor.\n“I said, ‘Little Marcus, wake up, don’t go to sleep. Mommy is right here with you. Wake up,’” she said. “He was trying.”\nThey pulled off on nearby Genevieve Avenue and called police, who arrived and rushed Marcus to Barnes-Jewish Hospital. Medical workers tried to save him, but he was pronounced dead at the hospital.\nAnother son who was shot, 15-year-old Sutorus Prince, was treated and released. The 69-year-old was also taken to a hospital. His condition was not available.\nJohnson said Marcus lived with restrictions because of his illness, and she had to watch him closely. He had to be careful not to bruise himself because of the blood-thinning drugs he was taking.\n“He was a happy, happy, loving and caring kid,” she said. “Through his sickness he was happy.”\nMarcus attended kindergarten at Highland Elementary in the Riverview Gardens School District. Melanie Powell-Robinson, a spokeswoman for the district, said counselors were on hand for students and staff in the district, where Marcus’ siblings also attended school.\nFuneral arrangements are pending at Ronald L. Jones Funeral Chapel in St. Louis. Bishop Frank James Otis Sr., of God’s House of Healing and Restoration Church, came to help the Johnson family with the arrangements and offer comfort.\n“People need to stop the violence, because innocent children die in the process of our selfishness,” Otis said.\nEDITOR'S NOTE: An earlier version of this story gave an incorrect first name for a spokeswoman for Riverview Gardens School District. This version has been corrected."}