{"uri": "http://www.nj.com/essex/index.ssf/2017/01/shooting_leaves_4_injured_in_newark.html", "title": "Teen shot to death despite move to 'safer' housing complex, grandfather says", "dct": "Wed, 11 Jan 2017 17:37:00 GMT", "id": "408a115e8f6a35fea5872c8945096a47", "content": "UPDATE: Security cut at housing complex before shooting that killed Newark teen, sources say\nNEWARK -- A 16-year-old boy was killed and three other people were wounded in a shooting at a housing complex in the city's East Ward Wednesday, authorities said.\nOne of the injured victims suffered grave injuries, according to Acting Essex County Prosecutor Carolyn Murray and Newark Public Safety Director Anthony Ambrose. The other two wounded victims were expected to survive.\nShots rang out at the John Hyatt Court public housing complex near Hawkins and Christie streets. Numerous Newark police units converged on the area around 5 p.m.\nHerbert Waldron said his grandson was killed in the shooting. Waldron added his daughter, who is the boy's mother, found her former house shot at over the summer and the Newark Housing Authority moved her to John Hyatt Court for safety reasons.\n\"They said this [housing complex] was safer,\" Waldron said at the crime scene Wednesday night.\n\"I just got a call that my grandson was killed,\" he added.\n\"This just not a community problem. This problem is bigger than that, it's our system,\" Waldron said.\n\"I don't want no more violence. I don't want that. I just want justice for my grandson,\" he told reporters.\nA large crowd gathered at the housing complex as investigators with the city police division and Essex County Prosecutor's Office worked at the scene. Several bystanders, who declined to be named, said they heard multiple gunshots and saw a car fleeing the area.\nNewark police later recovered the wanted vehicle in the city's Central Ward.\nAt least five evidence tags, often used to mark the location of shell casings, were placed near the edge of the complex on Hawkins Street.\nThe shooting was Newark's first homicide of the year.\nAuthorities have not released the identity of the slain teen.\nA prosecutor's office spokeswoman confirmed the agency was investigating a homicide, but did not have more information.\nNoah Cohen may be reached at ncohen@njadvancemedia.com. Follow him on Twitter @noahyc and on Facebook. Find NJ.com on Facebook."}