{"uri": "http://www.post-gazette.com/local/westmoreland/2016/11/07/16-year-old-shot-and-killed-in-Westmoreland-County/stories/201611070176", "title": "Bail denied to friend accused in teen girl's shooting death in Westmoreland County", "dct": "Wed, 09 Nov 2016 08:01:00 GMT", "id": "343f56c11cc416f4ac27a355b322a8e8", "content": "A Westmoreland County teenager who turned 18 today is in jail today, accused of shooting to death his friend while they were visiting at the victim’s boyfriend's home Monday evening in Arnold.\nCashaan Williams of Arnold turned himself in to police Tuesday. He was denied bail and remanded to the Westmoreland County Jail, charged with a single count of criminal homicide. He’s been charged as an adult.\nAkira Waters, 16, of Avonmore, Westmoreland County, was visiting her boyfriend, Brandon Jackson, 19, of 1417 Orchard Avenue in Arnold when she was shot in the chest. The incident happened around 5 p.m.\nAkira, a junior at Kiski Area High School and the Northern Career and Technology Center, died in the operating room of UPMC Presbyterian about 7:30 p.m. Monday.\nDetective Jim Williams with the Westmoreland County District Attorney's office said the investigation, conducted with Arnold police, indicates that Akira, Brandon, and Cashaan were spending time together prior to the shooting.\n\"They were just hanging out and, at some point, they were walking downstairs into the basement when Mr. Williams reached the bottom of the steps and he fired a shot,\" Detective Williams said. (The detective is not related to the defendant.)\nThe detective said he believes the defendant \"was fooling around with the gun.\"\nHe said Akira's best friend is Cashaan's girlfriend.\n\"They're all close friends,\" the detective said.\nAkira's death Monday evening prompted the Kiski Area School District to open the high school Tuesday for grief counseling, though district facilities were scheduled to be closed.\n\"Akira was a special young lady. We're devastated,\" said Chad Roland, principal of Kiski high school.\nHe said Akira was a cosmetology student at the Northern Westmoreland Career and Technology Center, which provides vocational and career training to students in three local school districts, including Kiski Area.\nMr. Roland said district officials are concerned about students' reactions to Akira's death. Officials decided to open the high school for counseling between noon and 2 p.m.\n\"Any loss is devastating but Akira was a very well-liked and popular young girl and we're concerned,'' he said, explaining that classes district-wide were canceled today for teacher in-service professional development sessions. But, the decision was made Monday night to make guidance and grief-counselors available today at facilities district-wide, as well as at the career center.\nAkira’s sibling is in the first grade within the Kiski district.\nMr. Roland said the teen had \"an infectious smile and characteristics that are easy to like. She always said hello in the hallways. She was a personable young lady. Never in trouble.\"\nHe said she \"excelled at everything she did,\" including the rigorous cosmetology program at the district's career center, which she attended for full-days on an every-other-day schedule, alternating with full days at the high school.\nMr. Roland said the district's \"thoughts and prayers are with her family. We'll be here to support them in any way we can. There are no words to react to this.\"\nThe high school has 1,260 students. The last death of a student occurred during an accidental target shooting incident when a boy entering the 10th grade was killed in the summer.\nCashaan is being represented by attorney Duke George of New Kensington."}