{"uri": "http://triblive.com/local/valleynewsdispatch/11437929-74/monday-shooting-police?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29", "title": "Arnold teen charged in shooting death of Avonmore girl", "dct": "Tue, 08 Nov 2016 10:36:00 GMT", "id": "4a0eeef7b6138a94fd6e16d64498078c", "content": "Aaron Waters lost his “everything” Monday night.\nThe 35-year-old Vandergrift man is mourning the death of his daughter, Akira Marie Waters, 16, who died after being shot just before 5 p.m. Monday in a home along Alcoa Drive in Arnold.\nAaron Waters described his daughter as a “beautiful, sweet girl” whose goal was to run her own beauty shop someday.\n“She was in the 11th grade at Kiski (Area High School). She wanted to study cosmetology and run her own salon after she graduated.”\nAkira, who lived with her mother in Avonmore, recently began working at the Dunkin' Donuts store in Murrysville, her father said. She was visiting her 19-year-old boyfriend, identified in court documents as Brandon Jackson, at his home when the shooting occurred.\nAaron Waters said it's his understanding that Akira was accidentally shot by the boyfriend of Akira's best friend.\n“They were waving a gun around, playing at being tough, and my daughter was shot,” Aaron Waters said through tears. “She was my everything.”\nArnold teen charged with homicide\nPolice arrested 17-year-old Cashaan “Dink” Williams of Arnold on Tuesday in connection with the shooting.\nWilliams, who turned himself in to police Tuesday afternoon accompanied by his attorney, Duke George, is charged with criminal homicide. He will be tried as an adult.\nAccording to court documents, Jackson told police the weapon Williams used to shoot Waters was a small black semi-automatic handgun Williams frequently played with. Jackson told police he saw Williams walking down the steps into the home's basement with Waters behind him.\nJackson said he heard a “click then a bang” before realizing Waters had been shot in the chest by Williams, according to the criminal complaint.\nJackson told police Williams threw his cellphone to Jackson after dialing 911 and told Jackson “not to tell anyone that he was there or what happened,” the complaint states.\nAccording to court documents, Jackson told police the cell phone found under Waters belonged to Williams. It was the same phone with which he dialed 911, authorities said.\nWilliams, arraigned Tuesday afternoon before District Judge Frank J. Pallone Jr. under intense security, is being held without bond in Westmoreland County's juvenile detention center.\nWilliams turns 18 today and is expected to be transferred to the Westmoreland County jail, George said.\nJackson, who Arnold Police Chief Eric Doutt said Monday night cooperated with police, is not facing charges.\nA preliminary hearing for Williams is scheduled for Dec. 1 at 2:15 p.m.\nAndrew Erickson is a Tribune-Review staff writer. Reach him at aerickson@tribweb.com or at 724-226-4675. City editor Matt Provenzo contributed to this report."}