{"uri": "http://triblive.com/local/valleynewsdispatch/11436644-74/police-doutt-arnold", "title": "Teenaged girl dead after Arnold shooting", "dct": "Mon, 07 Nov 2016 05:21:00 GMT", "id": "9b52e37c83afb50ec17f2a7c453399a5", "content": "A teenage girl has died after being shot in an Arnold home Monday evening.\nArnold Police Chief Eric Doutt confirmed that Akira Marie Waters, 16, of Avonmore died during surgery at UPMC Presbyterian hospital in Pittsburgh Monday night.\nShe had been flown there after the 5 p.m. shooting in the basement of 1417 Orchard Ave. near the border of Arnold and New Kensington.\nDoutt said Waters was conscious and able to talk when medics were treating her at the scene. Initial reports indicated she had been shot in the chest. Waters was a junior at Kiski Area High School.\nDoutt said Water's boyfriend, believed to be 19, who lives in the house, was present when the shooting occurred but, Doutt said, he was cooperating with police and would be released without charges.\nDoutt said police are unaware of anyone else being in the home at the time, but he noted no gun was recovered from the scene. Still, after learning of Water's death, Doutt said the investigation had become a homicide investigation.\nPolice have not named a suspect nor made any arrests as of Monday night. Police also did not say how they think the shooting took place or what happened to the gun.\nA Westmoreland County detective said more information may be released this morning. County detectives and New Kensington police assisted in the investigation.\nNeighbors said they didn't notice anything amiss until police arrived. Doutt could not recall any recent police calls originating from the house.\nA frantic woman who identified herself as Ebony Jackson, the home's owner, arrived about a half hour after the shooting and asked police what had happened.\n“It's my house. I need to know what's going on!” she said as she climbed onto the porch of her three-story, yellow-sided house. “Who was shot? Is she OK?”\nLiz Hayes is a Tribune-Review staff writer."}