{"uri": "http://bnonews.com/news/index.php/news/id3572", "title": "1 dead, 7 injured in mass shooting at Club Rayne in Tampa, Florida", "dct": "Sat, 06 Feb 2016 08:06:00 GMT", "id": "9bcbbb4a4a84bd6c593c1ae097c1370f", "content": "One person has been killed and at least seven others have been injured after a mass shooting at the Club Rayne strip club in Tampa, Florida, police say. Details about the circumstances were not immediately available. (more)\nThe incident happened at about 2:08 a.m. ET on Saturday when a series of gunshots rang out at Club Rayne on North Nebraska Avenue in north Tampa. When officers arrived at the scene, they located a total of seven gunshot victims, including one person who succumbed to their injuries. An eight victim was taken to hospital before police arrived.\n\"All victims reportedly suffered gunshot wounds, the nature and extent of their injuries including condition reports are not available at this time,\" said Lt. Ruth Cate, a spokesperson for the Tampa Police Department. \"The name of the deceased will not be released until the identity can be confirmed and the next of kin can be notified.\"\nDetails about the circumstances of the shooting were not immediately known, but one guest at the strip club was broadcasting live on social media when the shooting occurred. A recording of the video showed dozens of people inside the club when at least 7 gunshots were fired amidst the screams of guests. The video ended abruptly.\n\"The injured people are at various hospitals and the detectives are working the scene right now,\" a second Tampa police spokesperson said.\nDetails about a possible suspect or motive were not immediately known, and police have urged witnesses with information or cell phone video to contact the Tampa Police Department at (813) 231-6130. \"Homicide Detectives, the Hillsborough County State Attorney's Office and the Hillsborough County Medical Examiner's Office are all on scene,\" Lt. Cate added.\nNebraska Avenue has been closed to all traffic between Bird Street and Sitka Avenue and is expected to remain closed until at least 7:30 a.m. ET, Ubinas said.\nThis is a breaking news alert. Please check back or follow @BNONews on Twitter as details become available. If you want to receive breaking news alerts by email, click here to sign up. You can also like us on Facebook by clicking here.\nPhoto from the scene:\n#Breaking #news: On scene of a #mass #shooting at a strip club in #Tampa. 7 victims per TPD. pic.twitter.com/aiO42woIce\n— TB News Service (@tbnewsservice) February 6, 2016"}