{"uri": "http://www.news-journalonline.com/article/20160625/NEWS/160629648/101040?Title=Culture-of-Silence-In-1-of-4-unsolved-violent-crimes-witnesses-are-too-scared-to-come-forward", "title": "Majority of unsolved crimes in Daytona last year occurred in specific areas", "dct": "NODATE", "id": "0633d2ffa9ae992d2ef1bc1d3028e958", "content": "DAYTONA BEACH - Just after 11 p.m. on Feb. 23, 2015, four young friends talked outside a corner house on Sheridan Road. Suddenly their youthful banter was shattered by gunfire blasting from a slow-rolling car.\nEach one of the friends - including a 14-year-old - was shot.\nBlood dotted the front entrance to the small light blue house. Bullets punctured two cars in the driveway, police said. At least 10 shots were fired. It was the third time in nine months that relatives and friends of people living in the house at the end of this street had been visited by violence.\n\"I was shot five times,\" said 25-year-old Ronald Williams, who stood outside the house, his grandmother's, talking with three teenage female friends who were inside a Chevy.\nWilliams, who police said actually suffered three gunshot wounds, wonders how many more times members of his family will be on the receiving end of a bullet.\nHis 24-year-old cousin Deandre Smith was the first member of this clan to be targeted. He was gunned down May 10, 2015, atop the Oakridge span of the Seabreeze Bridge. Smith, the father of a 4-year-old girl, was killed minutes after a fight with another man a few miles away at a bottle club.\nPolice say some acquaintances of the Smith family know who the shooters are but refuse to cooperate with authorities.\nDaytona Beach Police Chief Mike Chitwood said those who know would rather die trying to avenge or justify Smith's death than be caught talking to a cop.\nInvestigators call it a \"culture of silence,\" an unwritten, but fiercely adhered to code that frowns upon cooperation with law enforcement and snitching under any circumstance.\nSILENCE: A 'SOCIETAL PROBLEM'\nSmith's murder is among dozens of unsolved violent cases in which someone knows who did the crime but won't give police the information they need to make an arrest.\nA Daytona Beach News-Journal analysis of police records shows that out of the 848 violent crimes in Daytona Beach in 2015, 310 remain unsolved. Chitwood said between 25 percent and 28 percent of those incidents are due to the culture of silence.\nThe city's violent crime totals outweigh those of other jurisdictions, such as Port Orange, New Smyrna Beach, Ormond Beach and the Volusia County Sheriff's Office, which is also responsible for DeBary, Deltona and Oak Hill. The Sheriff's jurisdiction encompasses over 226,000 residents, while Daytona Beach's population in 2015 stood at 63,500. Regardless, Daytona Beach saw more murders, robberies and aggravated assaults than the Sheriff's jurisdiction did last year.\n\"Unfortunately, it's a societal problem,\" Chitwood said. \"People just don't cooperate.\"\nNews-Journal interviews of police, legal experts, clergy, sociologists and victims of 2015 violent crimes show a culture of silence hinges on two primary factors: fear and mistrust.\nThe fear includes being labeled a snitch in one's neighborhood and retaliation. The mistrust is of police, and that they will not do enough to protect anyone who cooperates with them. Eight victims of last year's violence in Daytona Beach were reached for this story. Five of them refused to speak to The News-Journal.\nFifty-five people were shot in Daytona Beach last year. That includes three suicides. Some individuals suffered more than one gunshot wound.\n'YOU JUST WANT TO MOVE FORWARD'\nOne of those who suffered multiple wounds was Darian Baker, a 22-year-old psychology major at Bethune-Cookman University. In April 2015, Baker was getting out of his car and about to walk into a house party on Butts Drive when shots rang out.\nThe shooting left four B-CU students injured. Police said former B-CU student Vincent Smith - standing outside - sprayed the house with bullets.\nThe suspect was arrested but was never prosecuted because victims and witnesses \"suddenly forgot\" or refused to testify in court against Vincent Smith, Chitwood said. Since the house party shooting, Smith has been arrested four times, mostly for drug and traffic-related cases. Just 19 days after the house party, he was convicted of driving without a license and possession of paraphernalia, court records show. Investigators have said he is a gang member who hails from Miami.\nBaker just wants to get on with his life rather than dwell on the night he was shot in the right hand and grazed by a bullet in the left knee.\n\"I probably wouldn't tell if I knew who shot me,\" Baker said in a telephone interview. \"If you tell you'd probably be worried about getting hurt.\"\nBaker said it wasn't about being labeled a snitch for him and his friends.\n\"It's about not wanting to get involved with anything like that,\" he said. \"You just want to move forward.\"\nAnother Bethune-Cookman student, Jason Smith, 21, was at the party during the shooting but was not hurt. He is listed as a witness on the police report but there is no account of what he saw.\nHe said he understands the victims' fear of retaliation. But Smith is not worried about labels.\n\"Being labeled a snitch?\" he asked in a recent phone interview. \"Yes, in our society, in our generation, that's an issue. I didn't see anything (that night). If I had seen something I would have said something. I don't care about being labeled a snitch.\"\nBlood stains on the street and sidewalk on Henry Butts Drive and a trail of blood behind the church where one of the injured victims ran from the gunfire weren't enough of a grim reminder for witnesses to cooperate with police.\nNeither were the injuries suffered by the four students who attended the college party.\nB-CU DEAN: 'IT'S HUMAN BEHAVIOR'\nAt least 11 B-CU students were shot in 2015 in three separate incidents, police records show. Two female students were shot to death in an off-campus apartment by a man who killed himself after his arrest. Three more B-CU students were shot, one of them fatally, during an off-campus party, police said. The accused killer was arrested at the scene.\nB-CU has added more security cameras and personnel and held student gatherings. The administration has mostly declined to discuss last year's violence publicly, but recently Randy Nelson, dean of the school's criminal justice department, addressed the issue.\nAcross every community and profession, there's a history of people, white and black, who are reluctant to speak out against wrongdoings, Nelson said, noting that it even happens in law enforcement when a bad cop goes unreported by peers.\n\"I think it's human behavior,\" said Nelson, who has also worked in law enforcement and speaks publicly about such issues. \"When you highlight the black community as not being a snitch and don't highlight all the other places where no snitching occurs, that is wrong.\"\nBut there are factors, he said, that might perpetuate the problem in black communities, like a lack of trust in law enforcement, where there are so few officers who look like them.\n\"The only time black kids see law enforcement is when they are coming in and taking folks out. How can you expect anyone to want to cooperate?\" Nelson said, adding that police agencies can do a better job to improve those relationships. \"A marriage requires work on both sides.\"\nSILENCE WEAVES THROUGH CITY\nThe culture of silence last year spread across racial and economic divides, though there are some commonalities about where many of the violent crimes occurred.\nViolent crimes, including those that remain unsolved, happened in every area of Daytona Beach in 2015. But 161 unsolved crimes - more than half - are in five sections, or zones of the city. Investigators say the common thread in those areas is poverty and high-risk lifestyles.\nThe neighborhoods with unsolved crimes weave through the busiest areas. They include the Derbyshire Road corridor west of Nova Road to Wild Olive Avenue and Seabreeze Boulevard on the beachside. They are also prevalent on Jean Street, Orange Avenue, and Beach and Basin streets in the central part of the city.\nDaytona Beach Detective Nate Williams has been given the cold shoulder in every neighborhood and by all kinds of people. As one of the lead investigators in the police department's Criminal Investigations Division, Williams is present at practically every violent crime scene in the city.\nHe has worked to penetrate the different \"communities\" within the city's neighborhoods where violent crimes have left their mark. In most of these neighborhoods and communities it's dangerous to cooperate with the law, Williams said.\n\"For different reasons people vow to silence when it comes to criminal cases,\" Williams said. \"Whether it's for self gain, protecting themselves, fear of retaliation, it can be different things.\n\"We are currently working some homicides where it's really hard to infiltrate certain sects,\" the detective says. \"They know people will be going away for the rest of their lives, and they don't want to be involved in that. We see it across the board on any type of crime, but especially in our violent crimes.\"\nWilliams said those who harbor information about violent crimes justify their actions.\n\"They say, 'It's not my problem, it's not my business. You don't have to live on the street. You don't know how it is,' \" Williams said. \"We have six pages of open crimes and those are just the violent crimes. That's what we contend with here.\"\n'THEY ALL KNOW THIS FAMILY'\nRonald Williams' family cooperated with police as much as possible when his cousin Deandre Smith was killed on the bridge, Nate Williams said. But the killers remain elusive.\nMembers or friends of Smith's family have been targeted at least three times by the faction that backs Smith's killers, police said.\nIn the February incident involving Ronald Williams and the three teenage girls, Chitwood said his investigators believe that one of the occupants of the car who shot at the group was 27-year-old Rakim Watson, a violent convicted felon who police also say is a person of interest in Deandre Smith's killing.\nWatson was arrested on May 5 in Flagler County on a Volusia County warrant for four counts of aggravated battery with a deadly weapon in connection to the assaults on Ronald Williams and his three friends. He has since been transferred to the Volusia County Branch Jail.\nSome of Smith's relatives, relieved that Watson is once again incarcerated, reached out for this story. But appointments for interviews were never kept.\n\"They all know this family,\" Ronald Williams said regarding the shooters and the factions at play in his cousin's killing. \"I guess they are trying to send a message. I guess they have something against us.\"\nThe Daytona Beach Police Department is offering $20,000 for information leading to Smith's killers. So far, that money has not been enough of an enticement.\n\"I have had family members of a victim know of information and not tell us,\" Detective Nate Williams said.\nTHE RATTING TABOO\nInformation from witnesses and victims is key for police. Statistics show less than 1 percent of all violent crimes are resolved with DNA. Most cases are solved by witnesses coming forward and saying: \"We can't have this happen in our community and we need to do something about it,\" Chitwood said.\nBut the culture of silence becomes part of many peoples' lives early on. It is ingrained from childhood, said University of Virginia education professor Dewey Cornell.\n\"The prohibition against snitching is not new to this generation. It is not just a millennial problem,\" Cornell said in an email. \"There are many different terms used to describe tattling or ratting. It is one of the first social taboos that children learn and carry with them through adulthood.\"\nCornell pointed to interviews with black youth in Philadelphia in May 2011 in the online African-American-focused publication The Root, and the report's take on snitching and cooperating with law enforcement.\n\"Stop snitching\" is a community's submission to the \"reality\" of an entrenched drug economy that is, like it or not, one of the primary employers of its young men,\" the Root reported. \"Young people told us that witnesses are different from snitches: A witness comes forward to help, while a snitch goes to the cops to do the dirty work of hurting somebody else.\"\n'I DO NOT RECALL'\nThere are many \"sects\" in Daytona Beach where cooperating with police could mean grave consequences for the person doing the talking, Nate Williams said.\nThe killing of Faith Jenkins may be one of those examples.\nThe body of Jenkins, a prostitute with substance-abuse problems, was found wedged under debris behind an empty house in the 300 block of Kingston Avenue on April 22, 2015. A billboard with her image looms over U.S. 1 at Kingston with giant letters advertising a $10,000 reward for information about her death. The haunting image faces motorists who travel south on U.S. 1, just south of Mason Avenue.\nWilliams and other detectives have pounded the pavement in this nondescript section of Kingston and its surroundings, where the houses are not as historic as those on the the east side of the street and where there is not as much pride taken in curb appeal.\n\"Getting into that atmosphere (prostitutes) and trying to extract information, it's zero,\" the detective said. \"We know someone in that area knows who the killer is.\"\nThree months ago, Chitwood and members of the Northeast Florida Crime Stoppers held a small press conference under Jenkins' billboard. They pleaded for someone to come forward. It didn't help.\nEven other prostitutes who could face the same danger remain tight lipped, Williams said.\nTampa criminal defense attorney Grady Irvin, born and raised in Daytona Beach, is familiar with the culture of silence in his hometown. Irvin criticized law enforcement for expecting people who live in tough communities to talk about violent crimes.\n\"It's very easy to say that people should come forward,\" Irvin said. \"But what happens when that same person walks the street without any type of protection?\"\nIrvin said the law does not require anyone to tell what they know. He said one can simply say, \"I do not recall.\"\nRetired Daytona Beach police captain Kerry Orpinuk, who worked as both a street cop and a detective, interviewed hundreds of victims and witnesses in her more than two decades with the department. Orpinuk said the fear of being retaliated against and being labeled a snitch is a reality in Daytona Beach and likely in every city in this country.\n\"I'm not so sure that the culture of silence will ever be eradicated,\" Orpinuk said. \"You just try to tell people to do the right thing and hope that they will.\"\nWhile detective Williams agrees that the culture of silence will always be a fixture in society, he does feel there has been some progress toward change.\n\"We've done that by going in (into a neighborhood) over and over and letting the people know that they can trust us,\" Williams said. \"It takes a long time.\"\n- Staff writer Dinah Voyles Pulver analyzed data, and staff writers Dustin Wyatt and Katie Kustura contributed to this report."}