{"uri": "http://www.dailyrepublic.com/news/crimecourts/police-1-dead-after-8-shot-while-changing-flat-tire/", "title": "Police: 1 dead after 8 shot while changing flat tire", "dct": "Mon, 28 Oct 2013 00:00:00 GMT", "id": "37a44b4c6699277561c2aea72196d30f", "content": "FAIRFIELD — Police say someone shot at a group of people who were fixing a flat tire in Vallejo late Saturday night, killing one and injuring seven others.\nThe mass shooting was reported to police at 10:58 p.m. on the 200 block of Princeton Ave. Officers found five people injured at the scene. One was pronounced dead there by emergency medical personnel.\nPolice say three other people went to local hospitals with gunshot wounds from the Princeton Avenue shooting.\nThe man who died was 19 years old. His name was not released pending family notification.\nPolice report that four cars with young adults from what police describe as generally the south San Francisco Bay Area came to Vallejo on Saturday for a party. One of the cars got a flat tire after hitting a curb. The caravan stopped so members of the group could help change the tire.\nAs they were changing the tire, a white SUV with tinted windows drove by and someone inside the vehicle shot at them, police said in a press release Sunday morning. Police said they suspect one gunman opened fire. There was no known motive for the shooting.\nThis is Vallejo’s second homicide in recent days.\nPolice suspect that Kulunda O. Kennard Jr., 17, killed 35-year-old Shauntanae Lashauna Brown midafternoon Wednesday. The Times-Herald in Vallejo reports that Kennard is Brown’s son, citing police Lt. Sid DeJesus.\nOfficers who responded to calls of shots fired on the 200 block of Maine Street took Kennard into custody. He was booked into the county’s juvenile detention facility on suspicion of killing Brown. Police did not announce her cause of death.\nKennard is being tried as an adult. His court arraignment was continued Friday to Nov. 1.\nPolice describe Saturday’s shooting as the city’s 20th homicide of the year. Anyone with information about the mass shooting is asked to call Vallejo police detectives at 800-488-9383. People who wish to remain anonymous may call Solano County Crime Stoppers at 644-STOP.\nReach Glen Faison at 427-6925 or gfaison@dailyrepublic.net. Follow him on Twitter at www.twitter.com/GlenFaison.\nGlen Faison\nGlen Faison joined the Daily Republic as managing editor in September 2009. He previously worked as a reporter and editor for daily and weekly newspapers in the San Joaquin Valley for 20-plus years. His experience includes time as editor of the Golden Eagle, a military paper serving the Lemoore Naval Air Station. He graduated from Fresno State University with a bachelor's degree in journalism and bleeds Bulldogs red. He is an avid fan of the NFL's Washington team, and attended the 1988 NFC Championship Game against the Minnesota Vikings at RFK Stadium. He's a member of the Fairfield-Suisun Twilight Rotary Club and a board member for the Solano County Library Foundation. He married his wife, Jill, in 2005, and has three children: Courtni, Tyler and Hayli."}