{"uri": "http://www.news-journalonline.com/news/20161221/bunnell-man-charged-with-aggravated-assault", "title": "Bunnell man charged with aggravated assault", "dct": "NODATE", "id": "23760279d71159781a33b0cfb5892c30", "content": "Hide caption Thomas Woods\nThe following information was compiled from incident reports filed with Flagler County Sheriff's Office and Flagler Beach and Bunnell police departments. Any suspects named are presumed innocent until proven guilty in court.\nBUNNELL - A Bunnell man remained in the Flagler County Detention Facility on Tuesday after threatening his girlfriend with a knife during a physical confrontation, according to an arrest report from the Flagler County Sheriff's Office.\nThomas Woods, 21, of Pine Street reportedly slammed his girlfriend against a wall and prevented her from leaving the house while threatening her with a knife, the report states. The two were arguing, and the girlfriend told deputies that Woods blamed her father for his father's death. Woods' mother was able to take the knife away from him and help his girlfriend escape.\nWoods was charged with battery domestic violence, false imprisonment and aggravated assault with a deadly weapon. His bail was set at $35,000.\nBUNNELL\nn A domestic disturbance between two Canal Avenue residents on Dec. 18 resulted in the husband being arrested for battery domestic violence and tampering with a witness.\nn On Dec. 13, a Lancewood Street resident reported that loose change was missing from his unlocked vehicle.\nPALM COAST\nn On Dec. 19, a Kingsley Circle resident reported golf clubs stolen from his vehicle.\nn A woman living on Village Lane told deputies on Dec. 19 that items were stolen from her unlocked vehicle overnight.\nn A Kane Place resident on Dec. 19 reported her car broken into overnight but nothing was missing.\nn A man living on Westfield Lane was arrested for battery after reportedly spitting on his landlord during an argument over the rent.\nn A Lysander Lane resident on Dec. 19 told deputies his girlfriend threw a picture at him, but both parties refused to privde written statements.\nn A woman living on Leaver Drive was charged with battery domestic violence on Dec. 19 after biting and scratching her fiancé during an argument.\nn The live-in boyfriend of a Fernwood Lane resident reportedly pushed her down and dragged her by her hair during an argument. He was charged with battery domestic violence and assault/domestic violence.\nn Deputies were unable to determine the aggressor in a Dec. 19 physical disturbance between a mother and a disabled child at a Beech Boulevard home. DCF was notified and the parties were separated for the evening.\nn A 21-year-old man was treated at Florida Hospital Flagler on Dec. 18 for a gunshot wound to his right foot. Deputies determined the wound was accidentally self-inflicted while the man was reloading during target shooting in Flagler Estates.\nn Deputies responded to a call on Dec. 18 that a backpack and a debit card were stolen from a car parked at Cracker Barrel.\nn A Ford Focus reported stolen on Dec. 18 from a Uthorne Place home was recovered the same day in Volusia County.\nn A Brice Lane resident on Dec. 18 reported a flashlight and safety glasses stolen from his car during the night.\nn On Dec. 18, deputies responded to a disturbance at a Lake Forest Place home in which a 16-year-old became upset when asked to do chores, kicked out a window and cut his leg. The teen's mother told deputies she would take him to the hospital.\nn A vehicle parked at a Kankakee Trail home on Dec. 18 was reported burglarized, with a key fob, tools and CDs stolen.\nn A Kankakee Trail resident reported his Ford Fusion stolen on Dec. 18 and it was later found in Bunnell.\nn A semi-automatic handgun was reported missing from a Red Clover Lane home on Dec. 18.\nn A Walmart shopper told deputies on Dec. 18 that after she left the parking lot, she realized she had left her purse in the cart. She returned and the cart was still there but her purse was gone.\nn A representative of a business on Ocean Crest Drive reported on Dec. 17 that a juvenile girl took a set of keys from a valet booth and stole a Mercedes, which was later found at a beach approach, with no damage and with the keys in it.\nn On Dec. 17, a Heron Drive resident reported that his ATM card was missing and was used several times locally for cash withdrawals.\nn A resident of Wellhaven Lane told deputies on Dec. 17 that a vehicle was parked in her driveway with three unconscious men inside. Deputies charged one of the men with possession of stolen property and another with possession of drug paraphernalia.\nn n A resident of Laramie Drive reported on Dec. 16 that a suspicious person was knocking on doors of homes in the neighborhood. Deputies found a man hiding in a swale and he said he was selling items for a company but refused to provide the company name or describe the vehicle that was to pick him up. He was charged with loitering and prowling.\nn A domestic disturbance at a Ferber Lane home on Dec. 16 resulted in a man being arrested for battery domestic violence.\nn A Winterberry Place resident told deputies on Dec. 16 that a laptop and a 12-gauge shotgun were stolen from his unlocked pickup two days earlier.\nn A vacant home on Sea Trail was reportedly burglarized on Dec. 16, and kitchen appliances were stolen.\nn A woman living on Zinc Place reported on Dec. 14 that she returned home to find her rear slider open, but there was no damage and nothing was missing from the home.\nn Deputies were notified on Dec. 14 of a residential alarm at a home on Ranbay Place and discovered a man who tried to enter the house but fled when the alarm sounded. The man was arrested and charged with attempted burglary.\nn A Palm Avenue resident told deputies on Dec. 14 that she had seen someone running from her vehicle.\nn A man living on Raleigh Drive reported on Dec. 13 that two checks totalling $2,700 were fraudulently cashed from his bank account.\nn A resident of Bird of Paradise Drive on Dec. 13 reported two pellet/BB holes in the rear window of his vehicle. Deputies estimated the damage at approximately $500."}