{"uri": "http://www.detroitnews.com/story/news/local/detroit-city/2016/03/11/dead-wounded-drive-detroit/81665078/", "title": "2 dead, 2 wounded in Detroit drive-by shooting", "dct": "Fri, 11 Mar 2016 00:00:00 GMT", "id": "bc61753a064b82fe7315b04223072346", "content": "A drive-by mass shooting Friday that left two men dead and two others wounded on the city’s west side could have been even more tragic, a Detroit police official said.\n“There was a 4-year-old and 10-month-old outside playing right there, and these clowns come by shooting guns,” Assistant Police Chief Steve Dolunt said. “I’m livid.\n“I’m thinking this had to be retribution for something. These are all older guys.”\nThe first victim, identified as in his 60s, died hours before the second, a 43-year-old man, Detroit Police Officer Jennifer Moreno said. The two survivors, whose conditions at local hospitals were unknown, also are in their 40s and 60s, she said.\nTheir relationship wasn’t immediately clear.\nThe shooting happened at about 3:40 p.m. at a home in the 2600 block of Hazelwood near Linwood. The victims were on the porch when three men in a black Dodge Journey SUV opened fire.\n“There were two types of weapons used: A pistol and a long gun,” Dolunt said.\nDolunt said he didn’t believe the first man slain was the intended target.\n“It’s still early, and I could be wrong, but that’s what it looks like,” he said.\nWitnesses did not provide a full description of the shooters, Dolunt said.\nThe shooting unnerved neighbors and others on the street, which is lined with mostly two-story homes.\n“It’s shocking,” said Renee Little, whose family lives nearby. “It’s daylight.”\nKiara Head was down the street with her children and preparing to pick up another when she heard multiple shots.\nShe eventually learned her friendly neighbor had died.\n“He had a heart so big,” she said.\n“He helped me carry groceries, played with my kids, loved them as if they were his own grandkids. He’s going to be missed.”\nAnyone with information is asked to call Crime Stoppers of Michigan at (800) 773-2587.\nghunter@detroitnews.com\n(313) 222-2134"}