{"uri": "http://www.themorningsun.com/general-news/20161204/police-investigate-shooting-in-gratiot-county", "title": "Police investigate shooting in Gratiot County", "dct": "Sun, 04 Dec 2016 19:40:00 GMT", "id": "e2ade9783756fb30eb5d3166a664c2ba", "content": "Police in Gratiot County are investigating a Saturday shooting that sent one man to the hospital but the sheriff says so far, the evidence doesn’t match the victim’s account of the crime.\nStaff at MidMichigan Medical Center - Gratiot called police when a 36-year-old Pine River Township man was taken to the emergency room by his mother with a gunshot wound in his abdomen, said Gratiot County Sheriff Doug Wright.\nThe man —who admitted he had been drinking heavily— told workers at the hospital that he was outside his home when two black men selling vaccum cleaners stopped and he told them to leave, and one shot him.\n“He said he walked away, heard a ‘pop’ and felt a burning sensation and the men drove away,” Wright said.\nAdvertisement\nThe story caused the hospital to go into a lock down situation and call police.\nDeputies were dispatched to both the hospital and to the man’s home and began investigating.\n“The man’s story and the evidence we’ve collected don’t fit,” Wright said. “His story isn’t matching.”\nInvestigators at the man’s home did find blood and bullet evidence, but inside a pole barn, not outside where the man said he was shot.\nFurther, the spent bullet casing discovered was from a 22 gauge gun, a style of weapon the man himself owns and is consistent with his wound, but not consistent with the weapon in his story, Wright said.\nThough the man told police the same story both times he was interviewed, the trajectory of his bullet wound does not match the situation he described, Wright said.\nWhen asked why he called his mother instead of 911 after the attack, the man answered that he felt his mother could get him to the hospital more quickly, Wright said.\n“Based on evidence we collected and interviews, we do not believe there is any public threat,” Wright said.\nThe incident remains under investigation.\nAbout the Author"}