{"uri": "https://www.justice.gov/opa/pr/vice-lords-leader-pleads-guilty-gang-related-shooting-family-four", "title": "Vice Lords Leader Pleads Guilty for Gang-Related Shooting of Family of Four", "dct": "Tue, 25 Oct 2016 00:00:00 GMT", "id": "c33ab8fb328f87d11d235d7983107529", "content": "A leader of the Vice Lords street gang pleaded guilty today for his role in the May 7, 2015, shooting of four members of a family with an AK-47 in Detroit.\nAssistant Attorney General Leslie R. Caldwell of the Justice Department’s Criminal Division, U.S. Attorney Barbara L. McQuade of the Eastern District of Michigan, Special Agent in Charge Robin Shoemaker of the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) Detroit Field Division, Special Agent in Charge David P. Gelios of the FBI’s Detroit Division and Chief James Craig of the Detroit Police Department made the announcement.\nBurney Everett, aka Tank, 28, of Detroit, pleaded guilty before U.S. District Judge David M. Lawson of the Eastern District of Michigan to two counts of assault with a dangerous weapon in aid of racketeering and one count of use and carry of a firearm during and in relation to a crime of violence. Sentencing has been scheduled for Feb. 8, 2017.\nAccording to admissions made in connection with Everett’s plea, the Vice Lords is a national gang engaged in a variety of crimes and the gang’s leaders are located in both Chicago and Detroit. The gang is broken down into various “sets,” “decks,” or “branches,” including the Detroit-based Traveling Vice Lords (TVL). The Vice Lords have often targeted members who sought to leave the gang for physical beatings or murder.\nEverett admitted that in May 2015, he directed other members of the TVL to search for two brothers who had left or attempted to leave the gang in order to harm them. Everett further admitted that on May 7, 2015, at his direction, members of the TVL traveled in multiple cars to the intended victims’ house. After a brief confrontation with the brothers’ family members, Vice Lords member Antonio Clark admitted in connection with his own plea that he fired an AK-47 23 times, hitting the brothers, their mother and a 15-year-old sister. All of the victims survived the shooting.\nEight other members and leaders of the TVL have pleaded guilty to charges related to the shooting, six of whom have been sentenced: Antonio Clark was sentenced to 240 months in prison; Aramis Wilson was sentenced to 150 months in prison; Tyrone Price was sentenced to 140 months in prison; Dion Robinson was sentenced to 120 months in prison; Jonathan Kinchen was sentenced to 120 months in prison; and Kojuan Lee was sentenced to 97 months in prison. On Sept. 27, 2016, Jamerio Clark, a Vice Lords associate and the brother of Antonio Clark, pleaded guilty to witness tampering, admitting that he obtained private health information from a Detroit medical facility’s database, including addresses, birthdates and emergency contact information, of victims of the TVL shooting, and provided this information to his brother.\nThe charges and convictions related to the May 7, 2015, shooting are just one component of the federal government’s prosecution of the Vice Lords street gang, which has led to the arrests and convictions of dozens of Vice Lords leaders and members over the last few years. In two trials during March and May 2015, juries convicted eight leaders and members of the Phantom Outlaw Motorcycle Club, many of whom were also leaders and members of the Vice Lords, for various crimes, including a mass-murder plot against a rival organization and the shooting of a member of another rival organization. Among those convicted was Antonio Johnson, aka MT and Mister Tony, the National President of the Phantoms and the Three-Star General over all of the Vice Lords in Michigan. On Sept. 8, 2015, Johnson was sentenced to 35 years in prison for racketeering conspiracy, murder conspiracy in aid of racketeering, assault with a dangerous weapon in aid of racketeering, aiding and abetting the use and carry of firearms during and in relation to a crime of violence and felon in possession of a firearm.\nThe arrests and convictions in this case are, in part, the result of the Detroit One Initiative, a collaborative effort between law enforcement and the community to reduce homicide and other violent crime in Detroit. Through the lead efforts of the Comprehensive Violence Reduction Partnership Task Force, which consists of representatives of the ATF, Detroit Police Department, Michigan State Police, Michigan Department of Corrections and FBI, law enforcement authorities linked various acts of violence in Detroit to the Vice Lords street gang, and identified the leaders and key members of the gang, who now have been held accountable.\nThe charges and allegations contained in the indictment are merely accusations. The defendants are presumed innocent until and unless proven guilty.\nThe ATF, FBI and Detroit Police Department are investigating the case. Trial Attorney Joseph Wheatley of the Criminal Division’s Organized Crime and Gang Section and Assistant U.S. Attorneys Christopher Graveline and Mark Bilkovic of the Eastern District of Michigan are prosecuting the case.\n16-1248"}