{"uri": "https://www.atf.gov/news/pr/seven-vice-lords-charged-gang-related-shooting", "title": "Seven Vice Lords Charged in Gang-Related Shooting", "dct": "Tue, 04 Aug 2015 00:00:00 GMT", "id": "d5f2b26e8c18c6f9c7d1fed02fb77097", "content": "WASHINGTON – Seven members of the Vice Lords were charged in an indictment unsealed today with various offenses based on their roles in a gang-related shooting. The charges are the result of the collaborative efforts of law enforcement and the community to reduce homicide and other violent crime under the Detroit One program, which has led to the arrests and convictions of Vice Lords leaders during this past year.\nThe announcement was made by Assistant Attorney General Leslie R. Caldwell of the Justice Department’s Criminal Division, U.S. Attorney Barbara L. McQuade of the Eastern District of Michigan, Special Agent in Charge Robin Shoemaker of the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) Detroit Field Division, Special Agent in Charge Paul M. Abbate of the FBI’s Detroit Division and Chief James Craig of the Detroit Police Department.\nThe seven Vice Lord members charged with crimes stemming from this incident are:\nAntonio Clark, aka Cheeto, 25, of Detroit, is charged with attempted murder in aid of racketeering, assault with a dangerous weapon in aid of racketeering, use and carry of firearms during and in relation to a crime of violence and being a felon in possession of firearms;\nAramis Wilson, aka Ace, 24, of Detroit, is charged with attempted murder in aid of racketeering, assault with a dangerous weapon in aid of racketeering, use and carry of firearms during and in relation to a crime of violence and being a felon in possession of firearms;\nTyrone Price, aka Price, 26, of Detroit, is charged with assault with a dangerous weapon in aid of racketeering, and use and carry of firearms during and in relation to a crime of violence;\nJonathan Kinchen, aka Deago, 22, of Detroit, is charged with assault with a dangerous weapon in aid of racketeering, and use and carry of firearms during and in relation to a crime of violence;\nKojuan Lee, aka Juan, 19, of Detroit, is charged with assault with a dangerous weapon in aid of racketeering, and use and carry of firearms during and in relation to a crime of violence;\nKirshean Nelson, 18, of Detroit, is charged with assault with a dangerous weapon in aid of racketeering, and use and carry of firearms during and in relation to a crime of violence; and\nDion Robinson, aka Doggy, 37, of Detroit, is charged with assault with a dangerous weapon in aid of racketeering, and use and carry of firearms during and in relation to a crime of violence.\nRobinson, Clark, Price and Kinchen are in custody; arrest warrants have been issued for the other three defendants.\nAccording to the indictment, the Vice Lords is a national gang engaged in a variety of crimes, including murder, robbery, narcotics trafficking and witness intimidation. The indictment alleges that the Vice Lords’ leaders are located in both Chicago and Detroit, and that the gang is broken down into various “sets,” “decks,” or “branches,” including the Detroit-based Insane Vice Lords, Imperial Insane Vice Lords, Traveling Vice Lords, Conservative Vice Lords, Mafia Insane Vice Lords and Insane Goon Gang. The indictment further alleges that members who seek to leave or withdraw from the gang oftentimes endure a physical beating, known as a “beat out,” by multiple Vice Lord members, or are targeted for killing, known as a “green light.”\nAccording to the indictment, on May 7, 2015, to maintain and improve their positions in the Traveling Vice Lords, the defendants shot four individuals from the same family. The indictment alleges that the shooting was prompted by two of the family members’ attempts to leave the gang.\nThe charges and allegations contained in the indictment are merely accusations. The defendants are presumed innocent until and unless proven guilty.\nThis case is being investigated by the ATF, FBI and the Detroit Police Department. The case is being prosecuted by the Criminal Division’s Organized Crime and Gang Section and the U.S. Attorney’s Office of the Eastern District of Michigan.\n# # #\nField Division: Detroit Field Division"}