{"uri": "http://www.detroitnews.com/story/news/local/detroit-city/2015/08/04/vice-lords/31114357/", "title": "Detroit Vice Lords gang members charged in shooting", "dct": "Tue, 04 Aug 2015 00:00:00 GMT", "id": "da80c376ebbca30b23258a0c4134dd0a", "content": "Seven alleged members of the Vice Lords gang face multiple charges after members of a family were shot in May for attempting to leave the group, officials said.\nAntonio “Cheeto” Clark, 25, and Aramis “Ace” Wilson, 24, were charged with attempted murder in aid of racketeering, assault with a dangerous weapon in aid of racketeering, use and carry of firearms during and in relation to a crime of violence, and being a felon in possession of firearms, according to a Department of Justice press release issued Tuesday.\nTyrone Price, 26, Jonathan “Deago” Kinchen, 22, Kojuan “Juan” Lee, 19, Kirshean Nelson, 18, and Dion “Doggy” Robinson, 37, were charged with assault with a dangerous weapon in aid of racketeering, and use and carry of firearms during and in relation to a crime of violence.\nAll the men are Detroit residents, officials said. Clark, Price, Kinchen, and Robinson are in custody while arrest warrants have been issued for the other three.\nAccording to the indictment unsealed Tuesday, the men on May 7 shot four individuals from one family, in retaliation for two of the victims’ attempts to leave the Vice Lords.\nThe Vice Lords is a national gang engaged in crimes ranging from murder, robbery, and narcotics to trafficking and witness intimidation, officials said. Leaders in Detroit and Chicago allegedly punish members attempting to leave the gang by forcing them to endure “beat outs,” or by targeting them for killing, known as a “green light.”\nThe gang is broken down into several sections called “sets,” “decks,” or “branches,” officials said. The men allegedly belong to a Detroit-based offshoot called the Traveling Vice Lords.\nOther local branches include the Insane Vice Lords, Imperial Insane Vice Lords, Conservative Vice Lords, Mafia Insane Vice Lords, and Insane Goon Gang.\nHFournier@detroitnews.com\n(313) 223-4616\n@HollyPFournier"}