{"uri": "http://www.mlive.com/news/jackson/index.ssf/2016/01/a_difficult_case_prosecutors_r.html#incart_river_home_pop", "title": "A difficult case: Prosecutors reflect on Riley Spitler trial in wake of guilty verdict", "dct": "Fri, 22 Jan 2016 07:00:00 GMT", "id": "c9ae902534613a21e9271d1753e80b13", "content": "JACKSON, MI - For five days, Jackson County Assistant Prosecutors Jennifer Walker and Steven Idema presented an open murder case against Riley Spitler, who at 16-years-old, shot his brother in an upstairs bedroom.\nIt was a difficult case to try and a difficult case to consider, they said.\n\"We're talking about a family,\" said Idema, reflecting in the wake of a long jury deliberation. \"A family lost one son, and the son who killed him is now on trial.\"\n\"It's the human component,\" Walker added. \"Not only are we dealing with brothers, but it's the youngest brother who's (charged).\"\nAfter two days of deliberation, a jury found Spitler, 17, guilty of second-degree murder in connection to his 20-year-old brother Patrick's shooting death on Dec. 6, 2014.\nBlackman-Leoni Township Public Safety Department officers found Patrick Spitler on the floor of his room, suffering from a gunshot wound to his chest.\nAfter attempts to revive him failed, he was pronounced dead at 8:05 p.m.\nFollowing the shooting, Riley Spitler told detectives he'd pointed a loaded .380 at his brother, de-chambered a bullet and said \"let's see if it's your lucky day.\" He said he did not expect the gun to fire.\nDefense attorney Alfred Brandt contended the shooting was accidental while Walker and Idema argued Spitler had purposely shot his brother.\nFor five days, jurors heard testimony from more than 15 witnesses, including two Blackman-Leoni detectives, medical personnel, child protective service workers and several friends of Patrick Spitler.\nIn addition, jurors heard Riley Spitler recount his version of events in a series of taped interviews as well as a 911 call.\nIn the 911 recording, Riley Spitler can be heard screaming to a dispatcher and repeating his address. When asked what happened, Riley Spitler says he had been playing around and accidentally shot his brother.\nRiley Spitler hyperventilated while prosecutors played the 911 recording and frequently sobbed in court.\nIn addition, he turned his head from his brother's photographs, and on one occasion, Circuit Court Judge John McBain excused the jury as Riley Spitler composed himself.\nThe difficult and unusual aspect of the case, Idema said, was the relationship between the suspect and victim and the fact they shared families.\nIn the midst of the trial, Idema cross-examined Riley Spitler's father, Brian Spitler, who testified on behalf of the defense.\n\"I didn't want to come across as beating up a father who just lost his son,\" Idema reflected, adding \"the family is the victim here, and they're here to support Riley, but they're also here to support, Patrick.\"\n\"That's what makes this case more difficult than majority (of trials),\" he reflected.\nIn addition to the case's emotional complexities, Walker said the prosecution had to present the case facts against a current of sympathy and credited Blackman-Leoni Detectives Joseph Merritt and Chris Boulter for investigating the incident, eliciting pertinent information and helping get the case ready for trial.\nIn their interviews, Riley Spitler gave his account of the shooting, explained how he was generally unfamiliar with the .330 handgun, and spoke of his contentious relationship with his brother.\nThe detectives challenged several of Riley Spitler's statements, and when pressed about previous fights, Riley Spitler concedes the shooting \"looks bad\" and said he'd probably end up \"doing time for manslaughter.\"\nThe jury, Idema said, ultimately considered the detectives' interview the most when reaching their verdict -- specifically focused on Riley Spitler's account of what happened the night of the shooting -- and spent hours in deliberation.\n\"The jury put a lot of time and thought into their decision, and really analyzed all the evidence,\" Walker said.\nReflecting on the two-day deliberation, Walker, Idema, as well as Prosecutor Jerry Jarzynka and Assistant Chief Prosecutor Kati Rezmierski all thanked the jury for listening to the evidence and keeping the trial at the forefront of their minds.\nIt was not an easy case from them to consider, Jarzynka said.\n\"Any type of murder case is going to be difficult,\" said Jarzynka. \"But when you add additional factors, such as a young defendant -- and unique facts, such as the brother being the victim -- that makes the case especially difficult.\"\n\"(And) it's extremely difficult to handle that type of evidence,\" the prosecutor added.\nUltimately, Jarzynka said the jurors proved to diligent, conscientious citizens who took their roles seriously.\n\"They were everything we hope for and expect,\" Rezmierski added.\nSearching the Spitler home following the shooting, police found four handguns, including a .38 Cobra, a revolver, a .45 caliber handgun as well as a .380 caliber handgun in Riley Spitler's room.\nPolice also found a duffel bag containing four separate gallon-sized Ziploc bags and a mason jar full of marijuana in his closet.\nIn addition to second-degree murder, Spitler was found guilty of possession of marijuana with intent to deliver as well as two counts of felony firearms.\nBrandt, who Idema said made a solid case for his client, declined comment immediately following the verdict.\nSpiter is scheduled to be sentenced in March before McBain and faces up to life in prison for the charges.\nRyan Shek is a reporter for the Jackson Citizen Patriot and MLive.com. Contact him at rshek@mlive.com."}