{"uri": "http://www.mlive.com/news/jackson/index.ssf/2016/03/its_not_just_the_spitler_famil.html#incart_river_home", "title": "'It's not just the Spitler family who's a victim,' judge sentences teen for shooting brother", "dct": "Thu, 03 Mar 2016 16:40:41 GMT", "id": "dce13b8e13eeb95003a33c165344fd63", "content": "JACKSON, MI - On Wednesday, Brian Spitler stood before a Jackson County judge lamenting the death of his oldest son and contesting a jury verdict that found his youngest guilty of murder.\n\"It is my contention the jury got the verdict wrong,\" Brian Spitler said, standing before Circuit Court Judge John McBain at Riley Spitler's sentencing hearing Wednesday, March 2.\n\"We understand Riley has to be punished, that he acted in a reckless manner,\" he went onto say. \"But I'm also his father and I don't want to lose my second son.\"\nThough he agreed the death of Patrick Spitler was \"a tragedy,\" McBain defended the jury's second-degree murder conviction and ultimately sentenced Riley Spitler to 20 to 40 years in prison for the charge.\nIn addition, McBain handed down a pair of two-year sentences and a two-to-four-year sentence for two counts of felony firearms and one count of possession of marijuana with intent to deliver, respectively.\nResponding to the family's home in Stonegate Farms in December, 2014, Blackman-Leoni Township Public Safety Department officers found Patrick Spitler on the floor of his room suffering from a gunshot wound to his chest.\nAfter attempts to revive him failed, he was pronounced dead.\nLater, Riley Spitler told detectives he'd pointed a loaded .380 at his brother, de-chambered a bullet and said \"let's see if it's your lucky day.\"\nHe said he did not expect the gun to fire, while police found four handguns, including a .38 Cobra, a revolver, a .45 caliber handgun as well as a .380 caliber handgun in Riley Spitler's room.\nIn addition, police found a duffel bag containing four separate gallon-sized Ziploc bags and a mason jar full of marijuana in his closet.\nFollowing five days of testimony and two days of deliberations, a Jackson County jury found Riley Spitler guilty of second-degree murder in January.\nOn Wednesday, Riley Spitler's father, Brian, disputed the jury's verdict and chided Jackson County Assistant Prosecutors Steven Idema and Jennifer Walker, who said his son dealt drugs, illegally held firearms and was \"spiraling out of control\" to the point \"he actually murdered his brother.\"\n\"I am speaking on behalf of Patrick, I'm the only one in this room who represents Patrick,\" Brian Spitler said, adding his son, Riley, was not \"street smart\" did not deal drugs and did not know how to use the .380 handgun, which his mother purchased and ultimately took his brother's life.\nAs Brian Spitler turned to scold Idema, McBain interrupted and corralled his comments.\n\"Let me ask you this then -- (a question) that never got answered,\" McBain said. \"Why did your wife go out and buy a 16-year-old drop out from high school a .380 pistol from Dunham's?\"\n\"I do not know the answer to that,\" Brian Spitler initially answered.\nDefending his family, Brian Spitler later said his wife, who is from Peru and isn't entirely familiar with American culture, bought the weapon after Riley Spitler said his associations with a convicted criminal could bring potential harm to his family.\n\"She did not do it for any other reason than concern,\" Brian Spitler said.\nExpounding on his father's answer, Riley Spitler said he was negatively influenced by a lifetime friend, Kantpreet Singh, who was found guilty of multiple firearms charges in February and threatened three people with a handgun last year.\nRiley Spitler said he and Singh were neighbors who grew up together at Stonegate Farms, while in trial, it was alleged Riley Spitler was holding onto multiple firearms for Singh.\nIn addition, Spitler said he was a \"middle man,\" and on at least one occasion, sold marijuana on Singh's behalf.\nFearing people could potentially want to hurt himself or his family if they targeted Singh, Spitler said he convinced his mother to purchase the .380 firearm.\n\"What, if somebody wants to rip you off for a dime bag, you're going to shoot him?\" McBain scolded.\nAnswering questions pertaining to the night of the shooting, Riley Spitler said he would like to have testified, though was advised not to by his attorney, Alfred Brandt.\nOn Wednesday, he tried to explain the events that preceded his brother's death and said the two had been playing Russian roulette with a revolver, spinning the chamber and pointing the gun at the wall.\nShortly after, the brothers began playing with the .380 handgun, loading and unloading the clip, racking the slide and passing the weapon back and forth, he said.\nRiley Spitler maintained he did not know the gun was loaded when he fired at his brother.\n\"Your honor, I was not knowingly creating a situation where I thought death was a possibility,\" he said.\n\"What did you think would happen when you pointed a .380 at your brother's heart and pulled the trigger?\" McBain said in return.\nUltimately, McBain disputed Spitler's story -- reminded the community of Patrick Spitler's loss -- and defended the jury's verdict.\n\"What happened to your brother was a tragedy,\" McBain said. \"Everything I have heard about your brother was he was a Grade A, great kid.\"\nRelated: 'Every day was a joy when Pat was here,' YMCA CEO says of man killed in shooting\n\"You on the other hand had some issues,\" McBain said, going on to say. \"It's not just the Spitler family who's a victim here ... the whole community is a victim.\"\nBefore delivering his ruling McBain added: \"(And) every kid in this county who hears about this case shouldn't have to read (I sentenced you) to three or four years for what you did. I'm going to sentence you to what the jury convicted you of.\"\nMcBain's sentence was not at the top end of the sentencing guidelines, he said.\nSpitler will be eligible to leave prison at 37 years old.\nRyan Shek is a reporter for the Jackson Citizen Patriot and MLive.com. Contact him at rshek@mlive.com."}