{"uri": "http://www.sacbee.com/news/local/crime/article37270170.html", "title": "16-year-old arrested in connection with family deaths in El Dorado County", "dct": "Thu, 01 Oct 2015 17:05:00 GMT", "id": "880279f85cbd4f6a798d8fbe51c8d754", "content": "A 16-year-old boy was arrested Thursday, accused of fatally shooting three family members whose remains were found Sept. 13 in a burned cabin in Greenwood.\nEl Dorado County Sheriff John D’Agostini said Nolan Buchanan was arrested on suspicion of murder and will be tried as an adult. The deceased were identified as Nolan’s father, Adam Buchanan, 38, his fiancée Molly McAfee, 37, and their 8-year-old son, Gavin. D’Agostini said the three victims had been shot before the fire in the 4600 block of Highway 193. Adam Buchanan is president and chief operating officer of Buchanan Construction in Benicia.\nDeputies responded about 11 a.m. Sept. 13 to assist the Garden Valley Fire Department on a wildland fire. While searching the area, it was determined the residence had burned.\nD’Agostini said arson investigators and sheriff’s detectives joined in the investigation. Three bodies eventually were found.\nThe remains were sent to the Sacramento County Coroner’s Office for examination and identification. Samples later were sent to the California Department of Justice for DNA analysis.\nThe residence belonged to Adam Buchanan.\nD’Agostini said the Benicia Police Department contacted Nolan Buchanan, Adam Buchanan’s son, at Adam Buchanan’s Benicia home. The son told officers that his father, McAfee and his half-brother had driven to the Greenwood cabin, but he had not accompanied them.\nA search warrant was served at the Benicia residence and Adam Buchanan’s construction company. D’Agostini said a white Ford F150 truck that belonged to Adam Buchanan was found at the Benicia home, and evidence found inside the truck was contrary to the statement Nolan Buchanan had made to authorities.\nOn Sept. 19, a purse containing identification for McAfee and a wallet with identification for Adam Buchanan along with a firearm and ammunition were found in a business park near the Buchanan Construction Co. site.\nD’Agostini declined to discuss a motive for the shootings. He said there are no other suspects in the case.\nInvestigators have not determined how the fire started, but they have confirmed that it was arson, D’Agostini said.\nEl Dorado County District Attorney Vern Pierson said Thursday that Nolan Buchanan’s arraignment had not been scheduled but could occur as early as Friday.\nDuring a news conference Thursday afternoon in Placerville, D’Agostini said it was a sensitive investigation in an “absolutely tragic” case.\n“A father, a son and a mother all lost their life,” and that, he said, is devastating to the family and the community.\nCathy Locke: 916-321-5287, @lockecathy"}