{"uri": "http://www.gjsentinel.com/news/articles/man-hospitalized-with-gunshot-wound", "title": "Man hospitalized with gunshot wound", "dct": "Wed, 12 Oct 2016 00:00:00 GMT", "id": "1a91f8b819dab80620d2e797bc3cb035", "content": "A man who was hospitalized after a confrontation with law enforcement Wednesday afternoon might have been shot by a police officer, although the man might have been wounded before police arrived on scene, according to the Grand Junction Police Department.\nThe man, who police spokeswoman Heidi Davidson said was hospitalized with what appeared to be non-life-threatening wounds, was outside his room at Monument Studios, 1600 North Ave., when police arrived in response to a neighbor’s call. The neighbor reported the unidentified man “had accidentally shot himself in the chest,” according to a news release from police.\nThe neighbor reported that the man was carrying a gun and seemed intoxicated.\n“It was unknown if this was possibly a suicide attempt,” the release said.\nWhen police arrived, they saw the man still carrying the gun, the release said.\n“We arrive on scene. He’s not compliant, doesn’t want to engage with us, has a firearm in his hand,” Davidson said.\n“Less lethal” rounds — which Davidson said would have been shot at the subject using a launcher — were used, and “at some point an officer fires at least one round from a firearm,” Davidson said.\nThe man later complied with officers and was taken to the hospital.\nDavidson didn’t know how close the officer who fired was to the man, or how it was that officers weren’t sure whether their bullet hit him.\n“He walked to the ambulance, from what I’m told, so … his injuries did not appear to be life-threatening… ,” Davidson said. “It sounds like when this man was detained, the obvious injury that was able to be seen is to his hand. There were not other injuries to him that were apparent or obvious.”\nNobody else was injured during the incident, the news release said. Several streets were temporarily closed in the area and nearby homes and businesses were advised to shelter in place. Police don’t believe any other suspects were involved.\nThe unidentified police officer who fired the shot, an 11-year veteran of the department, has been placed on administrative leave pending the outcome of an internal affairs review, a standard procedure for officer-involved shootings.\nA multi-jurisdictional “critical incident response team” will conduct a parallel criminal investigation into the events, police said."}