{"uri": "http://www.kjct8.com/content/news/GJPD-Man-found-with-gunshot-wound-396844871.html", "title": "GJPD ID's suspect and officer involved in North Avenue shooting", "dct": "Fri, 14 Oct 2016 10:36:00 GMT", "id": "ead4165a95a9625e26617f2105e079b7", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nGRAND JUNCTION, Colo. (KJCT) -- A man was wounded by a gunshot Wednesday afternoon and authorities are investigating whether the man shot himself or if the wound was from a shot fired by an officer on the scene.\nIt all happened around 1:30 p.m. in the area of 16th Street and North Avenue.\nGrand Junction police said they responded to a report of a man who shot himself in the chest.\nAccording to police, the person reporting the incident said Michael Camacho, 20, was intoxicated and had been playing with a bullet and it “exploded.” Officers were also informed that Camacho had a gun.\nPolice tried to talk to Camacho, but he did not respond.\nAuthorities said that's when an Corporal Cody Kennedy fired at least one round.\nIt's unclear if Kennedy's shot hit Comacho, or if his injuries happened before police arrived.\nPolice said “less lethal rounds were also deployed” during the incident. Heidi Davidson of the Grand Junction Police Department explained that these rounds are made of a sponge material and are deployed from a launcher.\nCamacho was arrested and taken to the hospital with non-life threatening injuries, according to GJPD.\nAfter treatment Camacho was taken to the Mesa County jail and charged with first degree assault on a peace officer and menacing.\nCamacho is being held on a $10,000 bond.\nAuthorities said an independent investigation has been launched into the incident, and the Grand Junction Police Department will also conduct a parallel investigation into the shooting.\nGJPD said Corporal Kennedy is an 11-year veteran and a member of the GJPD SWAT team.\nKennedy is on administrative leave for a review, which is standard protocol.\nNorth Avenue and other streets in the area were closed for a short time, and a shelter-in-place message was sent to homes and businesses in the area."}