{"uri": "http://www.news4jax.com/news/young-mother-still-hospitalized-after-eureka-gardens-mass-shooting", "title": "Young mother still hospitalized weeks after Eureka Gardens shooting", "dct": "Fri, 30 Sep 2016 22:42:00 GMT", "id": "55aa6d0b038ce63a18fb1d16c538e17d", "content": "JACKSONVILLE, Fla. - A mother of two shot several times while standing outside her Eureka Gardens apartment over one month ago continues to recover in a Jacksonville hospital.\nJessica Nelson, 20, was one of seven people injured six weeks ago when, according to the Jacksonville Sheriff’s Office, three people opened fire in the parking lot of the housing development.\nJessica, who was shot in the stomach, has a 2-month-old daughter and an 19-month-old girl.\nAfter everyone else was released from the hospital, Jessica remained in the intensive care unit at UF Health Hospital, fighting for her life.\nHer mother, Brenda Nelson, told News4Jax Friday that her daughter has come a long way. Just a few weeks ago, Brenda said she didn't even know if her daughter would survive.\nNow, Jessica is sitting upright and is able to visit with her fiance and her two young girls.\n\"She's doing real good, better than we expected. They took the trach (tube) out, her liver is doing really good, her kidney not so good. She still has to have dialysis three times a week but at least she's not on it 24 hours a day now. She's sitting up. She's coherent. She holds a whole conversation with you now,\" Brenda said.\nThe family is preparing for what happens when Jessica is released from the hospital, and the reality is daunting.\nThey are still trying to move back into their family home, which suffered fire damage several years ago, but there is a lot of work left to be done. Brenda said she fears that her daughter won't have a safe place to go where she will be able to continue her recovery.\n\"We're having to put up a bathroom, a kitchen, replace some flooring in the living room, replace all the drywall and wiring just to make it where it's livable,\" Brenda said. \"The bedrooms are bigger, so there'll be enough room for equipment if need be, the hospital bed if need to be, what needs to happen.\"\nSo far, Brenda has been able to raise more than $9,000 on a GoFundMe page to help cover medical expenses.\nBut hospital bills, on top of fixing up their home, has caused financial worries for the family. Brenda said she wants to help alleviate that burden of stress on her daughter and her family.\n\"She deserves a place to come home to and she does and those girls. Any help we can get is definitely appreciated,\" Brenda said.\nJessica's daughters have been living with family members, but the family would like to be reunited once Jessica is finally released from her long hospital stay.\nAnyone wishing to help the Nelsons with supplies and hospital expenses can do so by visiting the GoFundMe page.\nCopyright 2016 by WJXT News4Jax - All rights reserved."}