{"uri": "http://www.cbs5az.com/story/32340444/second-teen-arrested-in-shooting-death-of-17-year-old-near-lake-pleasant?autostart=true", "title": "Second teen arrested in shooting death of 17-year-old near Lake Pleasant", "dct": "Thu, 30 Jun 2016 00:09:00 GMT", "id": "a326a3ed3aa3526882f77cc0549170e0", "content": "CAVE CREEK, AZ (3TV/CBS 5) -\nPolice have arrested a second person in connection with the shooting death of a teenage boy near Lake Pleasant less than a week ago.\nOfficers took Wesley Considine, who turned 18 last month, into custody Tuesday afternoon on suspicion of first-degree murder and armed robbery.\nAccording to the Peoria Police Department, Considine and three friends were target shooting with shotguns in the Lake Pleasant area Friday afternoon went things took a violent and deadly turn.\nOne of Considine's friends, a 17-year-old, was arrested hours after the shooting and booked into the Durango Juvenile Detention Center. Considine, however, evaded police for days. Investigators stated in court paperwork that he \"changed his appearance and hid in a desert remote area in Cave Creek.\"\nORIGINAL STORY: Teen boy faces murder charge in Peoria shooting of 2nd teen (June 24)\nRELATED: PD: Help us find second suspect in boy’s death near Lake Pleasant (June 26)\nWith both suspects in custody, police are piecing together what happened Friday afternoon and trying to determine if the shooting was premeditated.\n\"Prior to driving out the desert [the 17-year-old suspect] and Considine planned to confront [the victim] about stealing [the suspect's] property and then making fun of him on social media,\" according to court paperwork.\nThe four young men were taking turns with target shooting with two shotguns.\nInvestigators said the 17-year-old suspect, whom police have not identified because he is a minor, pointed a pump shotgun at the 17-year-old victim, accused him of stealing and demanded he empty his pockets.\nAccording to the narrative from the Peoria Police Department, the victim denied knowing anything about the suspect's stolen property and to him \"to do what he had to do.\"\nPolice said the suspect fired once, hitting the victim in the lower right abdomen, right arm and chest. He later died of his injuries.\nInvestigators said the suspect then turned the shotgun on the fourth member of the group, an 18-year-old male, and demanded his car keys and cell phone.\nConsidine then pointed the second shotgun at the 18-year-old and demanded his wallet, according to court paperwork.\nPolice said the pair left the scene in the 18-year-old's car, leaving both young men in the desert.\nWhen police located the 17-year-old suspect in the stolen vehicle several hours after the incident, they learned that he was staying with Considine in a hotel room that had been booked by Considine's mother days earlier.\nPolice said Considine told them about the other suspect's plan to confront the victim, \"but stated he did not know he was going to shoot [him].\"\nHe also admitted picked up the second shotgun and helping the other suspect rob the 18-year-old, \"but denied ever pointing the shotgun at [him].\"\nAccording to court paperwork, Considine told police his cohort got rid of the shotguns but said he had no idea how or where.\nA judge set Considine's bond at $1 million. Should he post and be released, he will be required to submit to electronic monitoring.\nCopyright 2016 KPHO/KTVK (KPHO Broadcasting Corporation). All rights reserved."}