{"uri": "http://www.miamiherald.com/news/local/crime/article74000507.html", "title": "In 28 seconds, what happened before and during Miami mass shooting", "dct": "Tue, 26 Apr 2016 16:06:00 GMT", "id": "485e19dd591bb39eeb8bfd6bfd5cd154", "content": "The video shows a man standing on a sidewalk wearing shorts and sandals, his hands in the pockets of his hoodie. A woman nearby leans against a pole, then begins to walk toward him.\nHer walk is cut short as a gray Nissan, possibly an Altima, approaches, turning west on Northwest 70th Street. Its rear passenger window is open. The man and the woman on the sidewalk duck and cower as 15 shots are fired from inside the car.\nThen, the driver’s-side door of an SUV with a rack on its roof opens. The vehicle is partially blocking the man and the woman from the street and the approaching Nissan. A man in shorts and white T-shirt steps out of it. The man and woman get up and look around. The Nissan is long gone.\nRead more: Five people shot in Liberty City, police say\nAlthough it lasts only 28 seconds, video from Brewtons Market at 7000 NW 15th Ave. shows an eruption of gunfire at 6:27 p.m. Monday as people scatter. It doesn’t appear to show anyone struck by a bullet.\nFive people, four men and a woman, were hit. None had critical injuries. All were taken to Jackson Memorial Hospital.\nThe mass attack was reminiscent of other unsolved shootings in and around the Liberty Square neighborhood in the past few years, particularly a June 2014 attack only 10 blocks away in which nine people were struck by gunfire and two were killed. The attackers have never been arrested.\nA Miami Herald investigation found that in the first seven months of that year, 43 people were shot within a 13-block radius that included the corner where the five people were gunned down Monday night.\nOn Tuesday, less than a day after the most recent shooting incident, not many witnesses were cooperating with police. The names of the victims haven’t been released. The assailants are still on the loose. Police haven’t offered a motive other than speculation.\n“There’s nothing updated on names or for any victims,” said Miami Police Detective Freddie Burden.\nMiami Herald news partner CBS4 said other video shows that police showed up in less than a minute and that a man was struck by a bullet, taking off his shirt and then collapsing.\nA woman named Belinda, who said she was hit in the back by a bullet, told the station that she thought the gunfire was fireworks at first.\n“Still, I see everyone else running, and I started running,” said the woman, who said she had no idea why shots rang out.\nMiami police Det. Rene Pimentel said a nearby Shotspotter, an electronic audio device that records gunshots, picked up 15 shots. On Monday night, about a dozen yellow markers set down by police identified some of those shell casings.\nA bike lay on the ground in front of Brewtons; a car in front of the bike was pockmarked with bullet holes.\nPolice blocked off the intersection at Northwest 70th Street and 15th Avenue for several hours as they gathered forensic evidence and tried speaking to witnesses. On Tuesday morning, few people were willing to speak about the previous night’s incident.\nPimentel, who couldn’t offer a motive and who didn’t say what caliber weapon was used, only offered this: “It could have been a turf war. We don’t know.”"}