{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-violence-shootings-20160207-story.html", "title": "1 dead, 10 injured in Chicago shootings", "dct": "Mon, 08 Feb 2016 15:26:00 GMT", "id": "5e73c02b0e75999601e4a92f9eb26f62", "content": "(Eric Clark/Chicago Tribune)\nA man was killed and at least 10 others have been wounded in Chicago shootings since Sunday afternoon, police said.\nAt 12:45 p.m., a 21-year-old man was killed and a 20-year-old man was wounded in a shooting in the 3900 block of West Augusta Boulevard, police said. The man was later identified as Dwight Hughes, Jr., of the 3400 block of West Foster Avenue. He was pronounced dead at the scene at 1:06 p.m., according to the Cook County medical examiner's office.\nThey were at that location when three males emerged from an alley and one of them fired a gun, striking the 21-year-old man in the neck, police said. The three fled, and the older man was pronounced dead at the scene, police said.\nThe 20-year-old man took himself to Norwegian American Hospital with gunshot wounds to the head, arm and torso, police said. He was transferred to Stroger Hospital, and his condition was stabilized. He told investigators he was shot in the same incident that killed the 21-year-old man.\nThe most recent shooting was at 4:25 a.m. Monday, when shots were fired into a Princeton Park home and a 26-year-old woman was grazed by a bullet, police said.\nShe was inside when multiple shots were fired into the home and she was wounded in the leg. She refused medical attention at the scene.\nAt about 1 a.m. Monday, a 34-year-old man was shot in the Marquette Park neighborhood, police said.\nHe was leaving Club Sixty Six-O-One, a bar in the 6600 block of South Western Avenue, when someone fired shots that hit him in the stomach. He was taken to Advocate Christ Medical Center in Oak Lawn in serious condition.\nThe bar isn't usually a trouble spot, said one employee who was about to lock up for the night when the shooting happened. He got outside in time to see the man out on a stretcher, cursing loudly. Police found about 10 shell casings on the corner outside the bar.\nThe bar has been on the market for a few months, said the employee, who asked not to be named. But after someone had been shot practically on its doorstep, he said, he wasn't sure anyone would be eager to buy.\nAt 11:40 p.m., a 27-year-old man was shot in Albany Park, said Officer Hector Alfaro, a police spokesman. He was in a parked car in the 3000 block of West Eastwood Avenue when two people got out of a black SUV and fired at him. He was hit in the head and left shoulder and went to Advocate Illinois Masonic Medical Center. His condition was stabilized.\nAt 7:55 p.m., a 23-year-old man accidentally shot himself in the leg in the 6300 block of South Campbell Avenue, police said. He was taken to Holy Cross Hospital, where his condition was stabilized, police said.\nAt about 7:10 p.m., a 29-year-old man was critically injured after being shot in the 900 block of North Fairfield Avenue in Humboldt Park, said Officer Kevin Quaid, a police spokesman. Police initially said the man was 19.\nHe was getting out of his vehicle when someone came up to him and shot him in the face, chest and left hand, Quaid said. He was taken to Stroger Hospital in critical condition.\nAt about 5:50 p.m., four teenagers were shot in Englewood, police said. They were on a porch in the 6500 block of South Green Street when two people approached and began firing.\nInitially, police said one of the people was shot in the head, but he was later found instead to be injured by flying glass, Quaid said.\nA 15-year-old boy was shot in the right side of the chest and in both legs. He was taken to Comer Children's Hospital in critical condition, police said. His condition later was upgraded to serious.\nAnother 15-year-old boy was shot in the left leg and went to St. Bernard Hospital. His condition was stabilized.\nAn 18-year-old man was shot in the right leg, and a 17-year-old girl was shot in the left leg. Both were taken to Stroger Hospital, and their conditions were stabilized."}