{"uri": "http://www.mlive.com/news/detroit/index.ssf/2016/04/father_guilty_of_manslaughter.html#incart_river_home", "title": "Father guilty of manslaughter in case of 3-year-old son shot by brother", "dct": "Thu, 07 Apr 2016 00:27:57 GMT", "id": "5ebc053d06cacc4aad2712d4f6ffe460", "content": "DETROIT, MI -- A Detroit father could spend time in prison after a jury found him responsible in the death of his 3-year-old son, who was killed by an elder brother.\nA jury on Tuesday found 42-year-old Curry D. Bryson guilty of involuntary manslaughter, punishable by up to 15 years in prison; possession of a firearm in the commission of a felony, a mandatory 2-year consecutive sentence; and not guilty on a charge of second-degree child abuse.\nHe'll spend at least 2 years, and as many as 17, in prison. Wayne Circuit Judge Michael J. Callahan sent Curry to jail and set a sentencing hearing for 9 a.m. April 20.\nCurry's then 11-year-old son on Aug. 3, 2015 found a gun inside his father's Detroit home and fatally shot Curry's other son, 3-year-old Elijah Walker, in the face.\nThe elder brother was originally charged in juvenile court with manslaughter and use of a firearm in the commission of a felony. The maximum amount of time a person can be detained in the juvenile system is until they turn 21.\nWayne County Prosecutor Kym Worthy said the shooting was intentional but without malice.\nAccording to prosecutors, the boy was playing at his father's house on the 16000 block of Eastwood Street in Detroit when he found a gun in a bedroom closet. He threw it out the bedroom window into the backyard.\n\"He then retrieved the gun and entered a vehicle parked in the father's backyard,\" Worthy's office said following the incident.\nElijah followed him into the car and \"a short time later was shot once in the face,\" Worthy's office said.\n\"I cannot remember a time where we have charged someone so young with taking a life,\" Worthy saidt. \"Very unfortunately and very tragically, the alleged facts in this case demanded it.\n\"The charged respondent here will remain in the juvenile system, but the case remains under investigation. As a result of that, I will not say more at this time.\""}