{"uri": "http://www.detroitnews.com/story/news/local/detroit-city/2015/08/04/three-year-old-fatally-shot-brother/31068833/", "title": "Boy, 3, who was fatally shot ‘will forever be missed’", "dct": "Mon, 03 Aug 2015 00:00:00 GMT", "id": "9301944eabfc2cb5ea0fd376f84268c9", "content": "Detroit — Two children were playing with a gun in a yard Monday when an 11-year-old apparently fatally shot a 3-year-old, police said.\n“They were playing inside a car in their backyard when the shot was fired,” Detroit police Assistant Chief Steve Dolunt said of the incident, which happened around 1:40 p.m. Monday in the 16000 block of Eastwood.\nRelatives said the 3-year-old, Elijah Walker of Taylor, had been visiting the home with his mother. Police are trying to contact the 3-year-old’s father, Dolunt said. “The 11-year-old’s father was at the house,” he said. “He apparently showed them the gun.”\nInvestigators also want to interview the 11-year-old, Dolunt said. “He’s scared,” he said. “He admitted to being in the car, but we need to talk to him to get more details.”\nBarbara Brianna was landscaping in the yard across the street when she heard what sounded like firecrackers, then screaming. She raced over and learned a child had been shot in the head.\n“The guns, they should have been locked ... up in a safe,” she said. “It shouldn’t have happened like that. How can a child have that much access to some guns?”\nInvestigators remained on the shooting scene for hours. At one point, three vehicles were towed from the brown brick home. A man whom acquaintances identified as the driver of one left in a police car, but an officer told them he was not under arrest.\nA family had lived in the home for several years, and children often play there, said a neighbor. Though he hadn’t heard of problems at the home, the shooting Monday suggested “pure negligence,” he said.\n“It’s stupid. How can you let a kid play with a gun?”\nNow, relatives are seeking donations to cover funeral costs for the child they described as a “sweet baby boy” on a GoFundMe page launched Monday.\n“Elijah was always on the go with his incredible amount of energy and never failed to give anyone his million dollar smile. He loved playing with his two older sisters and cousins,” the page read.\n“His bright smile, contagious laughter, and sweet personality will forever be missed. He was and will always be loved by his entire family and we are extremely devastated by this tragic loss.”"}