{"uri": "http://www.wsbtv.com/news/news/local/police-robber-shoots-self-struggle-homeowner/nh4Ny/", "title": "Man describes protecting his family from armed home invaders", "dct": "Mon, 10 Nov 2014 04:41:00 GMT", "id": "ddf9dfbcf4a66a4f09e4c213889fa9ab", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nATLANTA - A homeowner said a man attempting to rob his home shot himself after kicking in the front door.\nSuze and Jarabi Sadler told Channel 2’s Tyisha Fernandes four masked people broke in through their front door on Celebration Court around 8 p.m. Sunday.\n“He was like, ‘Everybody on the floor.’ So we all sat down, and my husband is like, ‘Just don’t hurt the kids. Just don’t hurt us,” said Suze Sadler.\nThe Sadlers' 1- and 2-year-old children, as well as their grandmother and an adult cousin were also inside the home.\n\"We were caught off guard. We were in the basement and they came in without us knowing,\" Jabari Sadler said. \"You hear stuff like this happening on TV all the time and in movies, but you never actually think it's going to happen to you.\"\nSadler's wife, Suze, said a man with a gun got control of most of the family downstairs, but while three other robbers were upstairs taking TVs and phones, her mother-in-law was on the third floor calling 911 while hiding under a bed with her infant grandson.\nJarabi Sadler said he knew he had to react quickly when the intruders put their hands on his wife.\n“When he started pulling her clothes down, that’s when I lost it, and that’s when I attacked the guy,” said Jarabi Sadler. “Something just takes over you and you just go into survival mode at that point.”\nJarabi Sadler said he was waiting for the right moment to attack the intruders.\n“While they were doing all that shuffling, I realized he wasn’t holding the gun firmly. He wasn’t holding it strong. So I was waiting for a time when I could attack,” Jarabi Sadler said.\nJarabi said the gun went off when he tried to get the gun out of the man’s hand. The bullet went through the man’s leg and left a hole in the bathroom door.\n“I’m holding the gun like this, punching him in the face, kneeing him as much as I could. And he’s like, ‘OK. I’ll go. I’ll go. Just give me my gun.’ And I’m like, ‘No.'\"\nThe alleged gunman ran out through the front door, ending up in a neighbor’s yard asking for help. Police identified the suspect as 18-year-old David Wilson. Now, they're looking for his accomplices. They're described as two men and a woman who drove off in a dark colored Chevy Impala.\nNo one inside the home was hurt."}