{"uri": "http://www.whio.com/news/crime--law/police-boy-pistol-whipped-and-shot-springfield-didn-know-attacker/Nio4y6aEAsp5ZYWlpjUzBM/", "title": "Police: Boy, 14, pistol-whipped and shot in Springfield didn’t know attacker", "dct": "Wed, 11 Jan 2017 00:00:00 GMT", "id": "62a3aa82890722022d76983677b4ab77", "content": "UPDATE @ 5:15 p.m. (Jan. 12)\nA 14-year-old boy was walking down the street Wednesday evening when another teen he didn’t know came up to him and pistol-whipped him and then shot him in his left side, according to a Springfield police report.\nSpringfield Police Chief Steve Moody said he is not releasing any more information about the shooting tonight, but said the teen is in stable condition at Miami Valley Hospital in Dayton.\nThe boy’s grandmother earlier today said “he’s fine” but didn’t want to speak about the incident that happened around 6:10 p.m. in the 500 block of Chestnut Avenue.\nAccording to the police report, the teen said the suspect – described as 18 or 19 wearing a black hooded sweatshirt and black pants – hit him with the butt of a gun and said, “You think I’m playing around?” before shooting him and running off. The teen told police he was struck on the head and heard a bang as his assailant fled. He was hit by the bullet in his left side, rib area, he told police. The boy and two family members who called 911 said he did not know his attacker.\n“You wonder if it’s a mistaken identity?” said Bernard Hairston of Springfield, who said today that he had heard about the latest act of violence in his neighborhood. “And there’s just too much of it going on.”\nAfter he was shot, the teen ran several blocks and then collapsed onto the hood of a car on Elm Street, where a woman was inside trying to warm h er car. She didn’t want to be named, but said the boy asked her for help. She put him in her car, put pressure on the gunshot wound with a towel and took him to his mother’s home on Sherman Avenue, where they called 911. Medics took the teen to Springfield Regional Medical Center, and then he was transferred to Miami Valley Hospital in Dayton.\nHe is expected to recover, and police are still working to identify the shooter.\nPolice were seen looking for evidence in the area of Sherman and Chestnut avenues following a shooting Wednesday evening, Jan. 11, 2017, in Springfield. TODD JACKSON / STAFF\nFIRST REPORT\nA 14-year-old boy was shot in the stomach this evening in Springfield.\nMedics were called shortly before 6:10 p.m. to a home in the 900 block of Sherman Avenue, but the shooting happened in the 500 block of Chestnut Avenue, where at least one shell casing was found, said Lt. Randall Ballentine of the Springfield Police Division.\nThe teen was taken to Sringfield Regional Medical Center, then transferred to Miami Valley Hospital in Dayton. CareFlight initially was requested, but was unable to fly due to weather, police said. The teen’s name and condition were not released.\nPolice did not have any suspect information to release, and the shooting remains under investigation, Ballentine said."}