{"uri": "http://www.wndu.com/content/news/Suburban-Indianapolis-double-murder-suspect-dead-369161531.html", "title": "Wabash College employee sought in slayings found dead at Indiana hotel", "dct": "Wed, 17 Feb 2016 21:14:00 GMT", "id": "66e88752e16e53c4930cc7319c5eb798", "content": "It was a tense day for students and staff of Wabash College.\nThe campus was placed on lockdown for several hours as police searched for a suspect in connection with a double murder in Zionsville.\nThey were looking for 61-year-old Lucius Oliver Hamilton III, an employee of the college. He's the prime suspect in the shooting death of his 31-year-old niece and her 4-year-old son. They were found dead in their home early Wednesday morning.\nAccording to WTHR, Hamilton was found Wednesday afternoon and had barricaded himself into a downtown Indianapolis hotel.\nThe Boone County sheriff revealed late Wednesday afternoon that Hamilton was dead from a self-inflicted gunshot wound.\nWe'll post more information as it becomes available.\nLatest: Man sought in slayings found dead at Indiana hotel\nINDIANAPOLIS (AP) - The Latest on a double killing at a home in upscale suburban Indianapolis neighborhood (all times local):\n6:30 p.m.\nThe president of Wabash College says everyone on the campus is deeply saddened by the shooting deaths of a woman and her young son that police blame on a school employee.\nThe private, all-male liberal arts college in Crawfordsville was put on lockdown and police officers searched its buildings during an hourslong manhunt Wednesday for 61-year-old Lucius Oliver Hamilton III.\nPolice say Hamilton fatally shot himself Wednesday afternoon in a downtown Indianapolis hotel. Hamilton was the college's senior major gifts officer.\nWabash President Gregory Hess said in a statement that the school was cooperating fully with investigators and that counseling services were being provided for students and employees.\n___\n5:25 p.m.\nA sheriff says investigators believe a dispute over money from a family trust led a man to fatally shoot his niece and her young son in their suburban Indianapolis home.\nBoone County Sheriff Mike Nielsen says the trust involved millions of dollars and had been a lingering issue the last few years.\nSixty-one-year-old Lucius Oliver Hamilton III was the subject of a manhunt for several hours before state police say he fatally shot himself Wednesday afternoon inside a downtown Indianapolis hotel room.\nNielsen says 31-year-old Katherine Giehll and her son, 4-year-old Raymond Peter Giehll IV, were found dead Wednesday morning inside their Zionsville home, just northwest of Indianapolis.\n___\n4:50 p.m.\nPolice say officers had just knocked on a downtown Indianapolis hotel room door when a man sought in the fatal shootings of his niece and her young son fired shots that killed himself.\nState police Capt. Dave Bursten says 61-year-old Lucius Oliver Hamilton III acknowledged that officers were outside the fourth-floor room of a Hilton hotel before two shots were fired from inside about 3 p.m. Wednesday. Bursten says Hamilton was found dead from a self-inflicted head wound.\nHamilton had been the subject of a manhunt since shortly after 31-year-old Katherine Giehll and her 4-year-old son, Raymond Peter Giehll IV, were found dead Wednesday morning in their Zionsville home, just northwest of Indianapolis.\nBoone County Sheriff Mike Nielsen says investigators don't yet know a motive for the slayings.\n___\n4:15 p.m.\nPolice say a man wanted in connection with the fatal shootings of his niece and her young son in suburban Indianapolis has killed himself at an Indianapolis hotel.\nIndiana State Police Capt. Dave Bursten says 61-year-old Lucius Oliver Hamilton III was found dead of self-inflicted gunshot wounds at a hotel one block from the Indiana Statehouse on Wednesday afternoon.\nHamilton had been the object of a manhunt since shortly after the bodies of 31-year-old Katherine Giehll and her son, 4-year-old Raymond Peter Giehll IV, were found in their home in Zionsville, just northwest of Indianapolis. Boone County Sheriff Mike Nielsen says the bodies were found Wednesday morning.\nNielsen hasn't revealed a motive for the slayings.\nHamilton was employed at Wabash College in Crawfordsville, which authorities locked down and searched while Hamilton was at large.\n___\n2:45 p.m.\nA sheriff has identified the woman and child found shot to death in their home in an upscale suburban Indianapolis neighborhood.\nBoone County Sheriff Mike Nielsen says 31-year-old Katherine Giehll was found shot to death just inside the home in Zionsville and her son, 4-year-old Raymond Peter Giehll IV, was found in a living room where he had been watching television.\nNielsen says he believes a neighbor found the bodies around 8 a.m. Wednesday.\nHe says authorities are searching for a 61-year-old uncle of the woman who's believed to be armed and dangerous. The man is employed by Wabash College in nearby Crawfordsville. The campus has been placed on lockdown and is being searched. Classes have been canceled there for the rest of the day.\n(Copyright 2016 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.)\n2/17/2016 4:17:03 PM (GMT -5:00)"}