{"uri": "http://www.ledger-enquirer.com/news/local/crime/article113302503.html", "title": "Drive-by shooting in Phenix City puts school on lockdown", "dct": "Tue, 08 Nov 2016 14:32:00 GMT", "id": "d3b9b66b47ab597bd66eadaaa704a275", "content": "Three people were wounded in a drive-by shooting Tuesday afternoon in Phenix City.\nAccording to Phenix City Police Chief Ray Smith, the three were taken to Midtown Medical Center.\nFor safety reasons, Phenix City Intermediate School on Railroad Street was put on lockdown.\nThere were no injuries at the school.\nThe shooting took place at the Amberwood Apartments at 2504 Stadium Drive.\nPolice got the call around 12:55 p.m.\nThe suspect vehicle was described as a blue SUV traveling south on Stadium Drive.\nOfficers are still on the scene conducting an investigation.\nPhenix City Schools superintendent Randy Wilkes said PCIS was put on “hard lockdown” at 1 p.m for 15-20 minutes after a staff member “heard the incident” across the street. Hard lockdown is when no movement is allowed inside the building and classroom doors are locked in addition to all entrances.\nConferring with the police chief throughout the crisis, Wilkes said, PCIS went on “soft lockdown” for another 10 minutes and then the school resumed normal operations. Soft lockdown is when nobody is allowed to enter or exit the building but movement is allowed inside.\nPCIS parents and guardians were notified about the lockdown via an automated phone call, Wilkes said, “and everybody is safe.” As for what the students were told, the superintendent said, “11- and 12-year-olds are going to be inquisitive. ... They were just told there was a problem in the community.”\nNo parents were allowed to check out their children during the lockdown, Wilkes said, but “six or seven” checked out their children after the lockdown was over around 1:30 p.m.\nWilkes praised everyone involved for the way they handled the situation. “I can’t commend the staff, students and parents and law enforcement enough,” he said.\nAnyone with information should call Phenix City police at 334-448-2801.\nStaff writer Mark Rice contributed to this report.\nLarry Gierer: 706-571-8581, @lagierer"}