{"uri": "http://www.abc2news.com/news/crime-checker/baltimore-city-crime/mother-of-murdered-15-yo-speaks-out", "title": "Mother of murdered West Baltimore teen speaks out", "dct": "Mon, 26 Aug 2013 17:25:00 GMT", "id": "2788687f122708e2bd2c817e685ad32a", "content": "Autoplay:XMother of murdered W. Balto. teen speaks\nBALTIMORE - It's a story of three best friends; ambition, making good and getting out.\nDominic the boxer, currently in the New York circuit, Anthony the football player attending a California school on a scholarship....and then little Deshaun Jones, a talented 15 year old aspiring rapper with more than a few videos already professionally produced and on Youtube.\nIt was his turn next with sights set on making it big and getting he and his family out of West Baltimore before his mother got the call that West Baltimore got him.\n\"I was just praying the whole way that I would be able to make it to him but by the time I got to the hospital they just told me they was working on him, and then they told me he was gone,\" said his mother Shanika Harris.\nGone...at 15.\nHarris' boy, loving, loyal and talented...gone.\nWitnesses tell us Jones wasn't shooting dice Saturday night in the 1500 block of West Fayette, simply sitting on a stoop next door on a block where his best friend lived.\nThe bullets flew, seven were hit, Deshaun who was to start school again today lay on the pavement; the only one critically hit.\n\"For somebody to do what they did, even if it was by accident....I can't have him back,\" his mother wept.\nA mother's grief is an emotion unparalleled, but it can be followed closely by pure outrage.\n\"That [expletive] baby's family is grieving, his friends are grieving. People just [expletive] grieving. That child was talented, he was trying to do something with his [expletive] life and all they can say is he was gambling. Shooting dice. They don't even know the [expletive] real story, and it's [expletive] sad,\" said a woman who identified herself as a close family friend and resident of that block.\nThe real story the woman says is Deshaun; a bystander at best to this dice game Baltimore Police speak of.\nBut this is no game and this block isn't playing, instead urging police to catch what they call the cowards that cut down a life; a life that didn't get out of West Baltimore before West Baltimore took that life.\n\"This hurts so bad. It hurts so bad. Words can't even describe how I feel because what mother wants to lose a son?\" Deshaun's mother cried.\nMeanwhile Baltimore Police say they still have no suspects in Saturday night's shooting.\nThere are more than a few cameras in the area though and detectives say they will be looking at that footage.\nCopyright 2013 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}