{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-shooting-violence-20150605-story.html", "title": "3 dead, 12 wounded in city shootings", "dct": "Sat, 06 Jun 2015 11:32:00 GMT", "id": "ec633f6a143fa3aee7a6a8df60ef861a", "content": "Three people, including a teenager, were killed and at least 12 others were wounded in separate shootings since Friday evening across the city, police said.\nThe latest fatal shooting happened about 2:15 a.m. Saturday in the Bridgeport neighborhood on the South Side, police said.\nRichard Edwards, 17, of the 3900 block of South Lake Park Avenue, was fatally shot and an 18-year-old man wounded in the 700 block of West 36th Street, according to the Cook County medical examiner's office and Chicago Police News Affairs Officer Amina Greer, who was citing preliminary information.\nEdwards suffered a fatal wound to his armpit and was declared dead at the scene, according to police and the medical examiner's office. The 18-year-old was shot in the hand and shoulder and was taken to John H. Stroger, Jr. Hospital of Cook County, where his condition stabilized, Greer said.\nAt the crime scene, police officers put handcuffs on a man and appeared to take him into custody. Officers blocked off about half a block of 35th Street east of Halsted Street.\nThe 17-year-old’s body lay under a white sheet on a sidewalk on the south side of 35th.\nHalf a block south, at 35th Place and Halsted, a black revolver lay on the ground, cordoned off by yellow police tape.\nA woman grieved loudly, leaning on a parked car, just south of the crime scene at 35th and Halsted. A man joined her and hugged her, trying to calm her down.\n\"I just need to touch him,\" she cried out repeatedly, referring to the teenager who was lying dead on the sidewalk nearby. \"I just need to see it's my child. Please.\"\nOver the course of the next two to three hours, several other family members and friends joined the woman. As the relatives walked up to her they started sobbing louder and louder.\nThree police officers stood near the group of relatives and friends. One officer rubbed the woman’s shoulder with her hand as she wept.\nA handful of nearby residents, who stumbled upon the crime scene on the way home, watched and listened to the grieving from across the street.\nDaniel Lakemacher, 32, said he was on his bicycle on his way home from work when he saw crime scene tape and the teenager's body, which was still uncovered.\n\"There is literally a dead body lying across a sidewalk I walked hundreds of times,\" Lakemacher said.\nIn another fatal shooting that happened about 9:55 p.m. Friday, a 27-year-old man was fatally shot in the Little Village neighborhood on the West Side, Greer said.\n(John J. Kim, Chicago Tribune)\nOfficers discovered Juan Ugalde lying unresponsive on a sidewalk in the northwest corner of 23rd Place and Washtenaw Avenue with a gunshot wound to the side of his face, according to the medical examiner's office and police.\nUgalde, of the 2800 block of West 21st Street, was dead at the scene, according to the medical examiner's office.\nShortly after 6 p.m., a 34-year-old man died after being shot on the Far South Side in the city's West Pullman neighborhood on the Far South Side, police said.\nLaurance Boyd, of the 12700 block of South May Street in south suburban Calumet Park, was sitting inside a parked vehicle in the 1300 block of West 122nd Street when someone approached and started firing in his direction, according to the medical examiner's office and Officer Bari Lemmon, a spokeswoman for the Chicago Police Department.\nThe gunman fled east from the scene.\nBoyd was shot twice in the back and was taken in critical condition to Advocate Christ Medical Center in Oak Lawn, where he was pronounced dead at 8:24 p.m., according to the medical examiner's office and police.\nIn other shootings:\n• A 21-year-old man was shot in the shoulder at 9:15 a.m. Saturday in the 1800 block of West 71st Street in the city’s West Englewood neighborhood on the South Side, said Officer Janel Sedevic, a spokeswoman for the Chicago Police who was citing \"very preliminary\"’ information.\n• Another shooting took place at 6:45 a.m. Saturday in the 10700 block of South Champlain Avenue in the Roseland neighborhood on the Far South Side, Sedevic said. The victim, a 21-year-old man, was shot in the left forearm while walking. \"An offender with whom he'd had a previous verbal altercation with approached and fired shots,\" Sedevic said. He was in good condition at Roseland Hospital, Sedevic said, and no arrests were made.\n• Three women and two men were wounded about 3 a.m. Saturday while they were outside during a party in the South Austin neighborhood on the West Side, Greer said. All five were standing outside in a courtyard in the first block of North Lorel Avenue when an unknown attacker approached from a nearby gangway and fired several gunshots, Greer said.\nA 33-year-old woman was struck in the neck area and was taken in serious condition to Mount Sinai Hospital, Greer said. A 38-year-old woman was shot in the hand, and a 37-year-old woman was shot in the buttocks. Their conditions stabilized at Mount Sinai, Greer said.\nIn addition, a 26-year-old man and a 23-year-old man were wounded in the leg. Both were taken to Stroger hospital, where they stabilized, Greer said.\nNo one was in custody as a result of the shooting early Saturday.\n• About 2:40 a.m. Saturday, a 39-year-old man was wounded in a shooting in the West Englewood neighborhood, police said. Police officers responded to a call of gunshots being fired in the 6500 block of South Oakley Avenue and found the man, who was struck in the arm and leg, according to police. The man was taken to Advocate Christ Medical Center, where his condition stabilized, police said.\n• About 11:22 p.m. Friday, a 27-year-old man was wounded in a shooting in the Marquette Park neighborhood on the Southwest Side, police said. The man was standing outside in the 7300 block of South Artesian Avenue when someone in a passing dark-colored van fired gunshots, police said. The man wad struck in the leg and was taken to Holy Cross Hospital, where his condition stabilized, police said.\n• About 8:30 p.m. Friday, a 35-year-old man was wounded in a shooting in the 400 block of East 111th Street in the Roseland neighborhood, police said. The man was shot in the lower back and was taken to Advocate Christ, where his condition had stabilized, police said. The man was not being cooperative with police.\n• At 7:45 p.m. Friday, a man was shot in the 1000 block of North Monticello Avenue in the Humboldt Park neighborhood on the West Side, police said. The 25-year-old man was shot in the leg and was taken to Mount Sinai Hospital in good condition. The man, who is a gang member, may have been shot in a drive-by shooting, police said.\nSaturday morning, police were still investigating the shootings."}