{"uri": "http://www.ohio.com/news/local/17-year-old-east-high-senior-shot-killed-in-akron-was-promising-culinary-arts-student-1.739862?localLinksEnabled=false&cache=18961415304345%2525252525252525252525252525252fnews%2525252525252525252525252525252fohio", "title": "17-year-old East high senior shot, killed in Akron was promising culinary arts student", "dct": "Thu, 12 Jan 2017 16:59:00 GMT", "id": "c11871974be8fccdd3baf09c825e6f13", "content": "A teen who was shot to death Wednesday afternoon at West Thornton Street and Laurel Avenue in Akron has been identified as 17-year-old Ernest Anderson Jr. of Schumacher Avenue. Anderson was a senior at East high school.\nThe Summit County Medical Examiner’s Office performed an autopsy Thursday afternoon and ruled his death a homicide. Investigators said he died of gunshot wounds to the head and torso.\nAkron police said a second person was found on a nearby porch with a gunshot wound to his leg. He was taken to Cleveland Clinic Akron General with nonlife-threatening injuries.\nPolice said preliminary reports indicate there was a verbal altercation between three males when shots were fired, but the third person fled before officers arrived. He is described as a black male, 28 to 33 years old, 5-feet-7 to 5-feet-11, weighing 140 to 170 pounds. He was wearing a blue Northface jacket or hooded sweatshirt, and red shoes.\nThe shooting remains under investigation.\n“We are deeply aggrieved by this tragic episode,” said Akron Superintendent David James. “Another student, another life filled with promise has been extinguished by violence. We are thinking of his family and the entire East Community Learning Center community.”\nErnest was enrolled in East high’s two-year hospitality program.\n“He was quiet, but not a problem student, he mostly kept to himself,” said East high Principal Vyrone Finney. “He was probably one of the best students in our culinary arts program.”\nAdrienne Kalaitsides, teacher librarian for East Community Learning Center Middle School, posted a recent video of Ernest in a chef’s jacket at the school’s hospitality dining area on YouTube.\n“On my very first visit to the awesome Dragon’s Den (East hospitality room), I was excited and felt so lucky to have the opportunity to dine. I met a beautiful boy with a smile that truly lit up the room,” said Kalaitsides, who often eats lunch at the high school. “I asked his permission to make a video of him smiling and offering me a slice of homemade peanut butter pie — to capture his shine and to remember the experience.\n“He had a bright light that I believe really shows in this clip.”\nPolice said they are still investigating the shooting, but no suspects are in custody. They are asking anyone with information to contact Akron police at 330-375-2490. Information may also be provided anonymously by calling Summit County Crimestoppers at 330-434-COPS (2677) or texting TIPSCO plus the tip to 274637.\nMarilyn Miller can be reached at 330-996-3098 or mmiller@thebeaconjournal.com or follow her on Twitter @MarilynMillerBJ ."}