{"uri": "http://www.news-leader.com/story/news/local/missouri/2015/02/27/9-shot-dead-at-multiple-crime-scenes-in-rural-missouri/24110945/", "title": "Remaining victims in Tyrone shooting spree identified", "dct": "Fri, 27 Feb 2015 00:00:00 GMT", "id": "ef400abba16932a94ecc51d70cb65064", "content": "Law enforcement officials on Saturday released the names of the three remaining victims in the shooting spree that left eight people dead in Texas County.\nThose victims are Darrell Dean Shriver, age 68; Carey Dean Shriver, age 46, and Valirea Love Shriver, age 44. Carey and Valirea Shriver were husband and wife. Darrell Shriver was the father of Carey Shriver. Their relationship to the suspected gunman, 36-year-old Joseph Jesse Aldridge, of Tyrone, was not released.\nOfficials on Friday could not explain exactly why Joseph Jesse Aldridge, 36, of Tyrone, shot four cousins, three other people and then himself.\nOfficials identified four victims: Garold Dee Aldridge, 52, and his wife Julie Ann Aldridge, 47; Harold Wayne Aldridge, 50, and his wife Janell Arlisa Aldridge, 48.\nTexas County Sheriff Jim Sigman said the names of three additional victims are being withheld pending notification of families.\nSigman also said:\n• None of the homes showed signs of forced entry.\n• The shooter's mother Alice L. Aldridge, 74, was also found dead but believed to have died of natural causes.\n• No motive has been identified.\n• The shooter, Joseph Jesse Aldridge, was found dead in a car in the middle of the highway about 5:30 Friday morning. The car was still running.\n• The three yet-to-be-named victims are not named Aldridge.\n• The shooter did live with mother.\n• A tenth person involved, victim of gunshot wounds, survived and is recovering at a local hospital.\n• The shooter had \"minor\" run-ins with the law prior to this incident.\n• Authorities are not seeking any other suspects and do not believe they will find any other victims.\nSheriff Sigman was asked by a reporter to describe what it was like searching for additional victims over the tense evening and overnight hours.\n\"I hope it ends,\" he said. \"That's what it was like.\"\nSigman said most people in the small town of Tyrone could not recall a single homicide. Friday's mass shooting is believed to be the largest shooting ever in Texas County history.\nHe offered some advice to county residents:\n\"Start locking your doors,\" he said.\n\"The world's changing. You gotta be safe.\"\nEarlier Friday, Texas County Coroner Tom Whittaker told KSDK the 36-year-old suspect from Tyrone found his elderly mother dead on her couch Thursday night. Whittaker says he believes the woman died from natural causes, and he believes her death sparked the shooting spree.\nWhittaker said three couples were found shot dead in three different homes. A son of one couple, who is around 10 years old, was found asleep inside the home. Whittaker said he was not injured and did not hear anything.\nThe suspect was found dead from an apparent self-inflicted gunshot wound inside his pickup truck in adjacent Shannon County. A .45-caliber handgun was used in all of the shootings, including the suspect's suicide, Whittaker said. He is believed to be the owner of the weapon.\nWhittaker told KSDK the suspect had a history of using drugs, but said he didn't know the extent of use. Toxicology results will determine if he was under the influence of drugs at the time of the shootings.\nA Tyrone man told a News-Leader reporter that a barefoot 15-year-old girl knocked on his door last night and, weeping, said her mom and dad had just been shot.\nHe helped her call 911, likely the first call alerting authorities to a horrific mass shooting in this tiny community of 40 people.\n\"She was barefoot, in a nightgown with no sleeves at all and her legs were all scratched up from briars,\" said the man, who declined to give his name.\n\"She said she seen a man in her dad's bedroom, talking to him in a normal voice. Then she said she heard gunshots and screaming.\"\nMissouri State Highway Patrol officials confirm a juvenile female initially called 911 Thursday evening, reporting that she had been in a residence and apparently heard gun shots. She fled to a neighbor's house to notify authorities.\nThe Tyrone man, who said he was that neighbor, told the News-Leader the girl had ran through snow and single-digit temperatures to his house a short distance south from where the shooting took place.\nThe man said he and his wife tended to the girl, worried that her feet might be frostbitten.\n\"The highway patrol investigators were at my house from 10:30 until 3 a.m.\" he said. \"They stayed until the girl's brother from Branson came up and got her.\"\nThe man, armed with a pistol on his belt, talked with reporters along the edge of narrow two-lane Highway H, which links this unincorporated cattle ranching community to Cabool and Houston about 20 minutes away.\nHis home along the highway was approximately 70 yards away from the scene of a second shooting. Yellow police tape was still in place at that residence along the highway Friday morning.\nThere were two other shooting locations farther to the east.\nTyrone resident Jerry Langsdon, who lives diagonally across the street from where the teen sought help, said he also knew the shooter and said nearly everyone in the community was related in some way.\nLangsdon said he was awakened at 10:30 p.m. by someone pounding on his door.\n\"I met the Highway Patrolman at the door with my hand on a weapon,\" he said. \"He asked if I was OK, and I said 'yep'. He told me to sit tight because there were shootings. I thinked they knocked on the door of everybody that lives here.\"\nLate Friday morning, numerous media trucks began converging on Tyrone, with one news helicopter hovering over the hilly, wooded countryside.\nOne local resident opened his door just a crack to tell a reporter he didn't want to talk about what had happened.\nPeople who've never heard of Tyrone before will know it now, he offered.\nThe investigation is continuing by the Texas County Sheriff's Department and the Missouri State Highway Patrol's Division of Drug and Crime Control.\nScott Dill, superintendent of the K-12 Houston School District, which includes Tyrone, said he visited classrooms Friday morning and that many students were stunned.\n\"When I ask if they have any questions there is silence and a lot of tears,\" he said.\nThe district has 1,050 students, Dill said. He does not know if any of the students have a loved one who has been killed.\n\"They are trying to make sense of the information — and there is a lot of speculation,\" he said. \"It's scary for the kids and for everyone involved.\"\nDill said he was first notified by law enforcement of the shooting deaths at about 2:45 a.m. Friday. He said he discussed possible options with police. If police had advised, he said, schools would have been closed. Another possibility was to re-route bus routes away from where the suspected shooter might be.\nDill said police told him at 5 a.m. the suspect had been found. There was no need at that point to close school, Dill said. Counselors were called in to talk to children.\nMedia from across the nation had contacted Dill Friday morning, including CNN, CBS-News and Reuters.\nDill has lived in Texas County eight years and has been superintendent 3 1/2 years.\nHe could not recall a shooting death in Texas County prior to Friday.\n\"Nothing comes to mind — certainly nothing like this,\" he said.\n\"It is a small community and we all know each other,\" he said. \"When one of us is hurting we are all hurting.\"\nAs details continued to come to light Friday morning, Sen. Claire McCaskill released a statement.\n\"The details coming out of Tyrone are deeply sad and shocking, and I'm in grief for the community there. Even as we learn more about what happened, nothing could ever make sense of such a tragedy. I know the people of Texas County — folks like my Dad — to be strong, and kind. I know they'll pull together in the face of these tragic events, and I'll be joining all Missourians in praying for the people of Tyrone tonight.\"\nGov. Jay Nixon told the Associated Press: \"This is a horrific tragedy, and our hearts go out to the victims of these senseless acts and their families,\""}