{"uri": "http://www.local8now.com/content/news/Suspect-in-deadly-Bristol-highway-shooting-indicted-386496771.html", "title": "Suspect in deadly Bristol highway shooting indicted on multiple charges", "dct": "Tue, 12 Jul 2016 12:59:00 GMT", "id": "2b6fbadae1d32daed333104b90245f92", "content": "JOHNSON CITY, Tenn. (WVLT) - The Tennessee Bureau of Investigation says a Sullivan County Grand Jury has returned indictments against the man accused of killing one person and injuring several others while firing shots at several vehicles on Volunteer Parkway in Bristol last week.\nInvestigators found that Lakeem Keon Scott, 37, was armed with at least two weapons, including a semi-automatic-style rifle and a pistol, and a large amount of ammunition when he started firing through the window of the Days Inn on that highway early Thursday morning. One of the shots hit the hotel clerk. Agents say Scott then began firing at several vehicles driving along Volunteer Parkway. When Bristol Police officers arrived on the scene, investigators say he fired at three of them, injuring one. Officers returned fire, striking Scott as well.\nNewspaper carrier Jennifer Rooney, 44, was on her way way to pick up papers for her morning delivery when she was struck by one of the bullets. Rooney died from her injuries.\nTuesday morning, the Sullivan County Grand Jury indicted Scott on one count of first degree murder, seven counts of attempted first degree murder, and seven counts of employing a firearm in the commission of a dangerous felony. When he is released from Bristol Regional Medical Center, Scott will be booked into the Sullivan County Jail on a $500,000 bond.\nThe indictment names several other victims, including: David Whitman Davis, 45; Kathy Fleenor, 66; Harold Fleenor, 73; Deborah Watts, 53; Officer Matthew Cousins, 46; Officer Jonathan Forbes, 28; and Officer Ronald Cowan, 25.\nTBI investigators say Scott cited anger over recent police killings of black men. Scott is black; all of the victims are white.\nThe TBI investigation continues along with support from the FBI; the Bureau of Alcohol, Tobacco, Firearms and Explosives; the Sullivan County Sheriff's Office; Bristol Police Department; and Kingsport Police Department."}