{"uri": "http://wjhl.com/2016/07/08/bristol-motel-owner-recounts-moment-fatal-shooting-spree-began/", "title": "Bristol motel owner recounts moment fatal shooting spree began", "dct": "Fri, 08 Jul 2016 00:15:00 GMT", "id": "7bd8875eb4b307b8036c24b8b00171e4", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nBRISTOL, TN (WJHL)- The Tennessee Bureau Investigation revealed Thursday morning one person was killed and four others were injured, including the gunman, in a random shooting in Bristol, TN.\nThe shooting took place early Thursday around 2 a.m. on Volunteer Parkway in Bristol, Tenn. near the Days Inn and O’Reilly Auto Parts store.\nOne of the people hurt in the shooting was an employee at the Days Inn Motel.\nThursday morning we spoke to Kiran Patel, the owner of the Days Inn on Volunteer Parkway who said it was a scene he could have never imagined.\n“It is really painful for us to know,” Patel said.\nPatel, who lives at the top of the motel, said it all started when he heard what he thought were firecrackers, going off in the middle of the night.\nAfter he heard the noise for a second time, his wife called the front desk.\n“So my wife called Debbie at the front desk that she is okay, or what, and she just told her that she had been shot,” Patel said.\nPatel, referring to his employee who was injured in the shooting as Debbie, told us she has worked at the Days Inn for 16 years, and is someone they consider to be like family.\n“She is a real good Christian lady, a very nice and kind lady, that’s all I can say,” Patel said.\nWe also spoke to Jon Long, an employee at the Days Inn who said he has recently been switching shifts with the employee who was injured in Thursday mornings shooting.\n“I should have been the one there, not her, she should have been at home with her family,” Long said.\nHours after the shooting when we spoke to Long he said he was still in shock over what happened.\n“Nobody should have to suffer like this, whether it be the victims or the families that’s having to go through this mental anguish,” Long said.\nWhen we spoke to Patel Thursday night he said he still had no information on his employee’s condition.\nCopyright 2016 WJHL. All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}