{"uri": "http://wate.com/2016/07/07/1-dead-4-injured-after-man-shoots-at-random-in-bristol/", "title": "1 dead, 4 injured after man shoots at random in Bristol", "dct": "Thu, 07 Jul 2016 11:44:00 GMT", "id": "b47eb42f1d317dee9e0556b4bb81868a", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nBRISTOL, Tenn. (WJHL) – The Tennessee Bureau Investigation revealed in a press conference Thursday morning that one person is dead and four others were injured, including a police officer, in a random shooting in Bristol, Tennessee. The woman who was killed in the random violence, is a local newspaper carrier.\nThe shooting, involving multiple victims, took place early Thursday around 2:00 a.m. on Volunteer Parkway in Bristol, Tennessee, near the Days Inn and O’Reilly Auto Parts store.\nThe TBI revealed the shooter was armed with two guns and was firing shots at the Days Inn and vehicles along Volunteer Parkway. As the officers arrived on the scene, he shot at law enforcement forcing them to return fire.\nThe victims and the suspect were taken to Bristol Regional Medical Center.\n“During that exchange, the subject fired shots at three responding officers, after which the officers returned fire, striking the subject, he was injured and transported to Bristol Regional Medical Center, as were the other individuals injured in connection to this incident,” said TBI spokesman Josh DeVine.\nDeVine said the TBI will not release the name of the suspect or the names of the victims until the investigation is complete.\nThe Bristol Herald Courier said its newspaper carrier, Jennifer Brewer Rooney, 44, was killed in the shooting. Four others were injured including a Bristol police officer. Bristol Police Chief Blain Wade said his officer’s injuries are minor. However, the extent of the injuries of the victims are not known at this time.\n“We are shocked and saddened that this individual lost their life in this senseless act of violence. Jennifer Rooney was a wonderful person. Her family are in our thoughts and prayers,” said Bristol Herald Courier publisher Jim Maxwell.\nInvestigators are trying to determine what provoked the shooter to randomly shoot at motorists along Volunteer Parkway. So far, investigators have no motive.\n“That’s still very much what we’re trying to determine, at this point, very clear would be inappropriate to speak to a possible motive on that front as well suffice it to say that something that we hope to hope to learn through our investigation,” said Josh DeVine.\nMultiple law enforcement agencies are assisting, including the Tennessee Bureau of Investigation. Also, the Sullivan County Sheriff’s Office and the Bristol Virginia Police Department are assisting the Bristol Tennessee Police Department as “multiple crimes scenes are secured”.\nAs it rains, TBI agents are protecting evidence at various crimes scenes with tents. Agents are also using a drone to captured images and video of the crime scenes.\nNews Channel 11 spotted a hole, which appears to be a bullet hole, on the door of a Bristol patrol car. That car and a few others appear to be a part of one of the crime scenes sectioned off by yellow crime tape. State Farm Insurance’s Mike Adams says he found a bullet hole under an air conditioning unit which is located at the vacant end of his building.\nIn the meantime, police have also closed off a section of Volunteer Parkway from Weaver Park to Melrose in Bristol as they work to process the crime scenes.\nThe TBI is working on developing its investigative findings.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}