{"uri": "http://www.local10.com/news/crime/man-arrested-in-fatal-shooting-of-16-year-old-in-miamis-allapattah-neighborhood", "title": "Man arrested in fatal shooting of 16-year-old in Miami's Allapattah neighborhood", "dct": "Wed, 30 Nov 2016 11:35:00 GMT", "id": "be612a23e24cf6eac3d953c63f53b9b6", "content": "MIAMI - A man was arrested Monday in the fatal shooting of a 16-year-old boy in Miami's Allapattah neighborhood.\nRichard Thompson, 21, faces charges of first-degree murder and possession of a weapon while committing an offense.\n16-year-old killed, 1 injured in Miami shooting\nRecords show that at the time of the shooting, Thompson was out of jail on probation for armed robbery and displaying or using a weapon while committing a felony.\nThe shooting was reported about 8:30 p.m. Nov. 22 near Northwest 17th Avenue and Northwest 31st Street.\nAccording to police, two friends were walking in the area when they were confronted by two males.\nPolice said both males, including Thompson, pulled out guns and fired at the victims, striking one of them multiple times. A bystander, who was not related to the victims, was struck once in the arm.\nThe teenager, identified as Damien Ramirez, was taken to Jackson Memorial Hospital in critical condition. He was pronounced dead a short time later.\nThe person who was shot in the arm was also taken to JMH in stable condition.\nAccording to an arrest report, surveillance video proves that Thompson was one of the gunmen. Witnesses also identified Thompson as one of the suspects, police said.\nThompson was arrested at his home, where he was found in his bedroom within arms reach of a shotgun, the report said.\nDetectives said Thompson admitted to being in the area at the time of the shooting, but claimed that he was not one of the gunmen.\nA motive for the shooting is unknown.\nThompson is being held in jail without bond.\nAnyone with information about the second gunman is asked to call Miami-Dade Crime Stoppers at 305-471-TIPS.\nCopyright 2016 by WPLG Local10.com - All rights reserved."}