{"uri": "http://www.ksla.com/story/23146180/attorneys-for-cycle-gear-murder-suspect-request-bond-hearing", "title": "Attorneys for Cycle Gear murder suspect request bond hearing", "dct": "Thu, 15 Aug 2013 15:08:00 GMT", "id": "eddb2c63235754b16c2ae749b3c6eb29", "content": "NORTH CHARLESTON, SC (WCSC) -\nAttorneys representing the sole man charged with murder in a shootout that left three people dead at a North Charleston cycle shop have requested a bond hearing for their client.\nSavage Law Firm filed a motion for bond for 43-year-old Ronald Reid on Wednesday. Reid has remained behind bars at the Charleston County Detention Center for over a month since being charged with first-degree murder for the Jun. 29 shooting at Cycle Gear, located at 4400 Dorchester Road.\nNorth Charleston Police Department investigators say Reid shot and killed 41-year-old Maurice Lamark Horry during a melee outside the shop between two rival motorcycle clubs, the Columbia-based Real Kingz and the Wheels of Soul.\nPolice say Horry was being attacked by a number of men inside the store, so he ran out to his motorcycle in the parking lot and grabbed his gun from under the seat. Police say witnesses told them Horry pointed his gun at a large group of men assembled outside and ordered them to back away.\nInvestigators say Reid then shot Horry, but Reid’s attorneys say that is not the case. According to them, witnesses say Horry shot first, and struck Reid. Attorneys argue that Reid, who has a concealed weapons permit, was acting in self-defense when he returned fire.\nReid’s attorneys also argue he was not part of the initial confrontation inside the store which prompted the fracas, and had only just arrived at the parking lot when Horry began firing shots. Reid’s attorneys say he was attending a fundraising cookout at Norton & Son’s Auto-Detailing Shop across the street just before accompanying his friend, 36-year-old Summerville man Theodore Waymeyers Jr. to go purchase a helmet.\nReid is the only man charged in the triple-shooting, which also left Waymeyers and another man, 39-year-old Carlos Davis, of Columbia, dead.\nReid’s attorneys argue Davis and Waymeyers died from shots fired by Horry.\nTwo other men have been arrested in connection with the incident. Barry Stinson, 32, and Derry Domonic Gadson, 39, were charged with second-degree assault by mob for allegedly starting the disturbance by assaulting Horry and another man inside the shop.\nPolice say their investigation into the incident is ongoing.\nReid’s attorneys describe him as a devoted husband, father and model citizen who has never been charged with a violent crime, with a disorderly conduct charge from 1990 providing the only blemish on his record."}