{"uri": "https://www.ksl.com/?nid=148&sid=24062944", "title": "Victims in Midvale shooting identified", "dct": "Wed, 13 Feb 2013 00:00:00 GMT", "id": "3ec300418fdb9645611bc555c5cd061c", "content": "MIDVALE — The Unified Police Department has identified the three people killed in a shooting at a home in Midvale on Tuesday. This, as the manhunt for two suspects continued.\nOmar P. Jarman, 35; Shontay N. Young, 34; and Danielle B. Lucero, 26, died in the shooting. Police also said Wednesday morning that 10 people were in the house during the shooting — four victims, two suspects, and four witnesses. Of the people who were shot, three died and one — an adult woman — has been upgraded to serious condition.\nOvernight investigators searched for the suspects and processed evidence at the scene of the crime. Lt. Justin Hoyal said police are following up on several tips about suspect David Fresques, 25, but have not located him.\nFresques and a second man are wanted for questioning in connection with the triple homicide, which happened inside what police described as a \"known narcotics house.\" Unified police were called to 8286 Adams St. (450 West) just after 8 a.m. Tuesday. They found three people dead and transported one to the hospital.\nBy Tuesday night, Fresques and the unidentified second man were being called suspects in the triple homicide as a statewide manhunt for the duo continued through the night. Nearly 80 officers from UPD investigated Tuesday's crime.\nThe car Fresques was believed to be driving was found abandoned a couple of hours after the shootings in the parking lot of a nearby Motel 6. Investigators were unsure Wednesday if Fresques walked away at that point or was picked up by someone in another vehicle.\nLt. Hoyal said Fresques was known to be associated with some of the people in the house. A motive for the shooting was still unknown as of Wednesday morning.\nBut Fresques is a documented gang member and the residence is a known narcotics house, according to police. A SWAT team served a drug-related search warrant at the house about a month ago, Hoyal said. Neighbors also reported seeing frequent short term traffic in front of the house at all hours.\nLegal Battle with Landlord\nAccording to Utah state court records, two renters of the house were currently in the process of being evicted. New filings were processed in court just a few days ago.\nJose C. Velazquez, the owner of the property, filed an eviction notice against Jose Fernando Garcia and Esther Arredondo. In his court filings, Velazquez claimed the occupants were behind on rent, had caused significant damage, had added roommates without permission, built two extra rooms in the backyard in addition to \"trashing\" the backyard. He also said the city of Midvale had sent him violation notices about storage in the front yard.\nIn their counterclaim, Garcia and Arredondo said the damage to the property was caused by police \"when they served a search warrant in which Jose is being wrongfully accused of,\" according to court records.\nFresques' history\nFresques was sentenced to one to 15 years at the Utah State Prison in 2007 for robbery and simple assault, according to court records. Most recently, he was charged with disorderly conduct and public intoxication in September. At that time, the court listed his address as a Main Street residence in Midvale, not far from the shooting scene.\nFresques' criminal record also includes convictions for forgery in 2011 in which he was sentenced to one year in jail; forgery and a weapons violation in 2007; criminal trespassing on school property and possession of drug paraphernalia in another 2007 case in which he was sentenced to six months in jail; illegally carrying a concealed weapon in 2006; and disorderly conduct, also in 2006.\nJarman's Criminal History\nCourt records show Jarman has an extensive criminal history dating back nearly 15 years. In 1999, Jarman was convicted on three drug-related felonies in Davis County including drug distribution. He was given a suspended prison term and instead sentenced to a year in jail and ordered to pay restitution to the Davis Metro Narcotics Strike Force.\nHe also was convicted of misdemeanor drug or DUI crimes in 2002, 2004, 2005, 2009 and 2012. In addition, Jarman was convicted of felony drug possession in 2005 and sentenced to 90 days in the Davis County Jail.\nMost recently, Jarman was charged in 3rd District Court in January with felony drug possession after Unified police found a bag of meth in his pocket, according to court documents. A warrant was issued for his arrest on Jan. 28 for failing to appear in court and was still outstanding at the time of his death.\nAnyone with information on the two suspects can call the Unified Police Department at 801-743-7000.\nPhotos"}