{"uri": "http://fox13now.com/2013/02/13/victims-identified-in-midvale-triple-murder/", "title": "Victims identified in Midvale triple murder", "dct": "Wed, 13 Feb 2013 22:02:00 GMT", "id": "4fcf5d612284165f2eafa87752acd4cb", "content": "MIDVALE -- Unified Police identified the victims in a triple homicide here, as the manhunt continued for two men suspected of killing them.\nThe victims were identified Wednesday as Omar Jarman, 35; Shontay Young, 34; and Danielle Lucero, 26. A woman who was shot and wounded remained hospitalized in serious condition, police said.\nThey were among 10 people inside a home near 8200 South and Adams Street on Tuesday morning when the shooting began. Unified Police are looking for 25-year-old David Fresques and another unidentified man, suspected of involvement in the slayings.\nOn Wednesday night, officers were still going through the home and collecting evidence. Detectives were also seek knocking on neighbors' doors, re-interviewing people.\nMeanwhile, the family of one of the victims gathered to grieve.\n\"I always pictured him as a great guy. I try not to think of the bad stuff about him,\" said Quintin Allred, Omar Jarman's 12-year-old son.\nJarman's family spoke to FOX 13 as they tried to fathom the crime that took place. His sister, Cathy Candelaria, said Omar was a loving, caring man.\n\"My brother is a man with a huge heart, with the biggest smile, the greatest bear hugs,\" she told FOX 13. \"Someone who always, when he came here was always so humble and he would always hug you and say, 'I love you.'\"\nCandelaria said she did worry about her brother. She knew he had gotten caught up in drugs and been in trouble with the law. He had also recently lost his job.\n\"I know that he was very frustrated with some difficulties in his life,\" she said. \"But all in all, Omar was -- and is -- a great guy.\"\nQuintin Allred looked at a photograph of his father and choked back tears.\n\"He was just at the wrong place at the wrong time,\" he said.\nOmar Jarman leaves behind seven brothers and sisters and three sons. His parents were serving a religious mission in Fiji and were en route back to Utah. Surrounded by family, Candelaria said that she has turned to her faith to get her through this difficult time. She told FOX 13 she forgives her brother's killer.\n\"Yes, we forgive him,\" she said. \"We want him to recognize the devastation that's been caused. Accept responsibility for that devastation and make it as right as he possibly can in whatever way that might be.\""}