{"uri": "http://www.freep.com/story/news/local/michigan/2016/11/04/hostage-shot-berrien-county-courthouse-shooting/93290342/", "title": "Report: Bailiff accidentally shot hostage at Berrien County courthouse", "dct": "Fri, 04 Nov 2016 00:00:00 GMT", "id": "6ebbf6550289bf908843e9bdb469fcc6", "content": "Newly released report shows escaped prisoner's gun was out of bullets by the time he was killed by officers\nThe female hostage wounded in the deadly shooting inside the Berrien County Courthouse last summer was accidentally shot by a court bailiff as officers opened fire on the escaped prisoner, who had already killed two other bailiffs, according to the official investigation findings released this week.\nThe bailiffs were justified in killing Larry Gordon, 44, and no criminal charges will be filed, according to the findings released Wednesday from Berrien County Prosecutor Michael Sepic. The six-shot .357-magnum revolver Gordon wielded was out of bullets, but they couldn't have known that, according to the findings.\nThe unidentified civilian and Berrien County Sheriff's Deputy James Atterberry — who Gordon shot after stealing his gun — were hospitalized with non-life-threatening injuries. Gordon of Coloma shot and killed bailiff Ronald Kienzle, 63, and Chief of Courthouse Security Joseph Zangaro, 61, authorities said. Both bailiffs were retired police officers.\nThe July 11 shooting stunned the Lake Michigan shoreline community, as a routine afternoon at the courthouse in St. Joseph quickly turned to gunshots and screams of horror. Gordon, an inmate at Berrien County Jail who was facing rape and kidnapping charges, had been brought to court to have a separate, misdemeanor domestic violence charge against him dismissed.\nThe Herald Palladium reported Oct. 30 that, despite a previous statement from the Berrien County sheriff that staff had no reason to believe Gordon would turn violent in court, a photo of a court record sent anonymously to the newspaper appears to show Gordon was labeled a \"security risk\" on a courthouse computer. Gordon faced up to life in prison if convicted on the more-serious charges.\n► Related: Police link man who killed Berrien County bailiffs to 2nd teen sex victim\n► Prosecutor: Berrien court shooter raped, gave meth to captive teen\nJust after Atterberrry escorted Gordon out of the third-floor courtroom, the inmate, whose hands were in handcuffs in front of him, yanked the revolver out of Atterberry's holster. He shot and wounded Atterberry, then shot and killed Kienzle and Zangaro in an area behind the courtroom and fired two shots at a glass window of the nearby civil file room. He then ran down the hall to the public corridor — the area with elevators, benches and public access to courtrooms.\nAt this point, the investigation shows, Gordon had already fired all six bullets from the revolver. On previously-released surveillance video, he can be seen emerging from the hallway. As Sepic's findings describe, Gordon briefly encounters a bailiff, turns and points the revolver at him, then he ran through the corridor before taking eight courthouse visitors and staff hostage. He tried to go through a glass door, but it wouldn't open.\nThree bailiffs approached from different directions, and Gordon ordered a hostage to break the glass door with a metal standing sign. The sign was slammed into the glass several times, and it sounded like gunshots to two of the bailiffs, according to Sepic's findings.\nGordon began traversing the corridor with a hostage held at gunpoint in front of his body, and two hostages fled. Three others followed closely behind Gordon and the hostage at gunpoint. As Gordon moved away from the glass door, a \"Bailiff 2\" came out of it and saw Gordon move the gun \"forward in an upward motion,\" according to the findings.\nThe bailiff fired three times at Gordon, who continued to move as the bailiff fired three more shots. \"Bailiff 3\" fired five to six times as Gordon moved to where he could get a clear shot. Gordon fell, still holding the gun at his upper chest. The hand holding the gun moved, so \"Bailiff 3\" fired one more round, according to Sepic.\n\"Bailiff 2 and Bailiff 3 would not have known how many times Gordon shot Atterberry's six-shot revolver before their entry on the third floor. They actually would not have known how many firearms Gordon may have had either, according to Sepic's findings.\nBefore the shooting, Gordon left a handwritten letter to his ex-wife sealed in an envelope with a fellow inmate. The letter, released by officials, makes clear his intentions: \"I'm not trying to die, and I don't want too (sic), I'm just trying to get free and I'll die trying.\"\nIt includes directions for his daughter to decide whether to have him cremated. It also says that if his escape plan succeeds, he'll be in hiding, and if his ex-wife ever has any problems, she can post it on Facebook and he'll \"take care of it like Superman.\"\nCalls from the Free Press on Friday to Berrien County Sheriff's Office, the Berrien Couny Court Administrator and Sepic weren't immediately returned.\nContact Robert Allen: Twitter @rallenMI or rallen@freepress.com."}