{"uri": "http://www.wbrc.com/story/31954409/police-dad-arrested-in-shooting-that-killed-mom-hurt-4-kids", "title": "Man charged with murder for shooting that killed mother, injured 4 kids", "dct": "Fri, 13 May 2016 00:49:00 GMT", "id": "88e12cc7338d1fd03bc1009ddd05bf61", "content": "BIRMINGHAM, AL (WBRC) -\nA man who identified himself as the father of eight children is facing several charges in connection with a shooting that killed the children's mother and injured four kids.\nSedrick Norris is charged with one count of capital murder and four counts of attempted murder in the shooting which stemmed from a domestic altercation around 10:30 p.m. Wednesday, May 11 in the 1400 block of 21st Street N in the Druid Hills neighborhood.\nRight now: Sedrick Norris being transferred to the county jail on capital murder and attempted murder. pic.twitter.com/9OF9DI5tav\n— Birmingham Police (@BhamPolice) May 13, 2016\nNorris faces the capital murder charge because he had a protection of abuse order filed against him in March.\nOfficers found the mother dead in the living room with a gunshot wound, Birmingham Police Chief A.C. Roper said in a news conference at 7:30 a.m. Thursday, May 12.\nThe Jefferson County Coroner's Office identified the victim as Coral Anita Wilson, 34.\nPolice say the suspect, the children's father, tried to force his way into the home to see his kids, but Wilson would not let him in. He kicked the front glass screen door in and left, Lt. Sean Edwards said.\nTwo hours later, the father came back and started shooting, then fled on foot, police said.\nA witness said she heard several gunshot and stepped outside to see several kids running toward her, Roper said. The injured children were transported to Children's of Alabama Hospital.\nPolice gave an update on the children's conditions around noon:\na 12-year-old girl has the most serious injuries after being shot in the chest. She is in stable condition and it appears she will be OK.\na 5-year-old boy shot in the jaw is in stable condition\nan 8-year-old girl with shrapnel in the leg is in stable condition\nan 11-year-old boy shot in the hand and hip is in stable condition\n\"There are physical injuries but also psychological injuries that they’ll have to deal with for years to come,\" Roper said.\nThe police chief said they are thankful that the four other children were in the home were not hurt. Those children are in the care of family members.\nRoper said they initiated an intensive investigation involving K-9s and special teams so they could quickly get the shooter off the streets.\nWithin six hours of the shooting, police arrested the suspect. They found him around 5:15 a.m. sleeping in the front seat of a vehicle, covered by clothes, near 18th Street North and 17th Court North,\nThe officers who handcuffed the suspect said he was compliant and seemed relieved to be arrested. He is now being interviewed at police headquarters, Roper said.\nChief Roper said there was a history of domestic violence at the home, but he was not sure of the last time police were called there. Police are looking into that history as a part of their investigation.\nCourt documents show that in March 2016, Wilson filed for a protection from abuse order against the suspect for herself and one child. A hearing was held last week and a trial date was set for later this year.\n\"It's very tough because these situations often involve relationships and in this case we have the suspect who is saying all eight kids are his and he was the father of all eight kids, so there's this connection which is extremely difficult to break,\" Roper said.\nThe police chief asked everyone to remember this family and the children who lost their mother, in their prayers.\nHe said domestic violence situations are not something the police department can solve by itself, and asked people to come forward if they believe a friend or family member is a domestic violence victim.\n\"Birmingham is a resilient community and these are the times where we have to come together as one,\" Roper said.\nPolice have not yet released the suspect's name. They are still working to obtain warrants against him.\n“We know exactly who is responsible for this horrific crime. He will be brought to justice,\" Edwards said.\nA prayer vigil for Coral Wilson and her children will be held at the First United Methodist Church at 6 p.m. Thursday. The church is located at 518 19th Street North in Birmingham.\n\"The vigil will be a time for the community to gather and remember Coral Wilson who was murdered in a domestic violence incident Wednesday night, as well as a time to pray for her four children injured at the time of the shooting, and offer support for all eight of her children who have now lost their mother,\" a news release said.\nNorris is being transferred to the Jefferson County Jail. He has no bond.\nCopyright 2016 WBRC. All rights reserved."}