{"uri": "http://fox4kc.com/2016/02/22/bodies-of-four-edgerton-family-members-found-in-yard-appeared-to-be-set-on-fire-sheriff-says/", "title": "Bodies of four Edgerton family members found in yard, appeared to be set on fire, sheriff says", "dct": "Mon, 22 Feb 2016 14:52:00 GMT", "id": "6afa73c0378b6803cc42f518f235a94a", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nRIVERSIDE, Mo. -- A 24-year-old Edgerton man, whose sister, nephew and two other relatives were killed in a weekend fire faces one charge in Platte County for allegedly stealing his grandparents' car.\nGrayden Denham became a 'person of interest' in the homicide investigation of the fatal fire that killed Heather Denham, 32, her three-month-old son Mason, and Russ and Shirley Denham, identified by the family as grandparents.\n\"We are devastated and shocked. This is an extremely tough time for me and my family at the tragic loss of Heather, Mason, Shirley and Russell they were all very dear to me. I would like to start a non-profit for mentally ill and donate it to KU hospital in Heather and Mason's name. They will all be deeply missed,\" said Nick Schiavone, Mason's father, in a statement released Tuesday after the fire.\nIn a news conference Monday afternoon, Platte County Sheriff Mark Owen revealed that their four bodies were found burned in the front yard of the home in Edgerton.\n\"Upon arrival, the deputies observed what appeared to be the burnt bodies of two adults and an infant in the front yard, as well as the dog. A short time later firefighters pointed out an additional body that was to the east side of the residence. All of the bodies were burnt and appeared to be set on fire,\" said Owen.\nSurviving family members had not seen Grayden Denham since the fire late Friday night and could not get in touch with him. Sunday morning he was found wandering naked in Arizona. A few hours later they located Russ and Shirley Denham's brown Nissan parked at a motel parking lot. Clothes were found outside the car, and Denham's wallet was inside the pants.\nAccording to police, Grayden Denham was not allowed to drive his grandparents' Nissan or any of the other vehicles because his driver's license had been suspended due to points violations and child support issues.\n\"We allege the Missouri license plates had been removed and replaced with stolen Oklahoma license plates,\" Platte County Prosecuting Attorney Eric Zahnd said in a news conference Monday afternoon at the Riverside Police Department.\nBond is set at $100,000 for the Class C stealing felony, punishable up to seven years in prison.\nProsecutor Zahnd continued to identify Denham as a 'person of interest' and said he could not provide any other details about allegations against Denham related to the deaths of four members of his family.\n\"This is a parent's worst nightmare. I wouldn't wish this on anybody. My life's been changed forever,\" Shelly Denham, Grayden's mother, told FOX 4.\nAs the investigation is ongoing, authorities are still encouraging anyone with information about this case to call the TIPS hotline at (816) 474-TIPS."}