{"uri": "http://www.kansascity.com/news/local/crime/article61854977.html", "title": "Person of interest in four Platte County killings charged in car theft", "dct": "Mon, 22 Feb 2016 17:55:00 GMT", "id": "a2391c4560bee0dea5589d07f29ca421", "content": "Platte County prosecutors have accused a 24-year-old man of stealing a vehicle from his grandparents, who were killed along with two other family members Friday near Edgerton, Mo.\nNo charges have been filed in the four homicides.\nThe theft suspect, Grayden Lane Denham, is being held in an Arizona jail after he was arrested about 7:30 a.m. Sunday while walking naked in Seligman, Ariz., about 1,200 miles from Edgerton.\nHe allegedly had driven his grandparents’ car to Arizona.\n‘Person of interest’ in four Edgerton, Mo., fire deaths has been found\nAuthorities did not say how the victims died, but all four bodies had been set on fire, Platte County Sheriff Mark Owen said in a news conference Monday afternoon.\nAuthorities have not released the victims’ names but relatives have identified them as Russell and Shirley Denham, their granddaughter, Heather Denham, and her 3-month-old son, Mason Gage Denham.\nGrayden Denham lived with his grandparents. Heather Denham was his sister.\nPlatte County fire that killed three adults and an infant is being investigated as a homicide\nThree bodies, including that of the infant, were found in the front yard of the home in the 4100 block of Buena Vista Road. A man’s body was found on the east side of the residence. He appeared to be laying on his back near the driver’s side of a white Chevy S-10 pickup. A plastic gas container was about 5 feet from the body, according to an incident report released Monday.\nA dog was dead in the yard.\nThe residence was engulfed in flames when sheriff’s deputies arrived.\nfacebook twitter email Share\nGrayden Denham remains person of interest in four deaths\nEric Zahnd, Platte County prosecuting attorney, and Platte County Sheriff Mark Owen discussed the stealing charges against Grayden Denham during a press conference on Monday at the Riverside Police Department. According to officials, Denham remains a person of interest in the deaths of four people who were killed just south of Edgerton, Mo., over the weekend.\nJoe Ledford jledford@kcstar.com\nOwen and Platte County Prosecutor Eric Zahnd released only basic facts about the killing scene Monday and said they will not reveal what evidence has been collected.\nInvestigators noticed a brown 2012 Nissan Versa that belonged to Shirley and Russell Denham, with handicapped license plates, was missing from the scene, according to the court records in support of the stealing charge.\nGrayden Denham, who usually stayed at the home, was not there. A witness told investigators that Denham was not allowed to drive the Nissan or other vehicles on the property because his Missouri driver’s license had been revoked for points violations and child support enforcement, court records stated.\nZahnd said his office would seek to have Denham extradited to face the stealing charge. Bond was set at $100,000 on the felony count.\n“This is a horrendous thing to have happened to any family, to any community, and so our thoughts and prayers are with them to what must be an awful, awful thing,” Zahnd said.\nThe medical examiner has ruled the deaths as homicides.\nTwo Metro Squad detectives have flown to Arizona to investigate. Two other detectives are driving to Arizona to process the stolen vehicle and collect other evidence, Owen said.\nInvestigators have obtained subpoenas to secure dental records for the three adult victims before releasing their names.\nOwen would not say where or how the fire was set.\n“I don’t want to take a chance on a loophole,” he said. “We need to do what is right for the victims and get this done right the first time.”\nWhen Arizona police stopped him while walking naked, Grayden Denham gave a wrong date of birth, according to the sheriff’s office there. Because of concerns about his medical condition, he was taken by ambulance to a hospital.\nA motel manager in Seligman called the sheriff’s office about 10 a.m. Sunday to report a suspicious vehicle. He told deputies that a Nissan sedan had been parked on the motel property for several hours.\nThe car was unlocked with the key in the ignition and clothing on the ground next to it.\nDeputies found a Missouri identification card with the clothing. The card had Denham’s name and real date of birth, the sheriff’s office reported.\nAn Oklahoma license plate on the car had been reported stolen.\nAfter checking the Nissan’s vehicle identification number, deputies determined that the car had been reported stolen in Platte County, Arizona officials said. It was listed as having a “felony vehicle with a stop and hold” order for a Missouri law enforcement agency.\nThe manager of the motel where the car was found told deputies that Denham was not a patron of the motel and did not have permission to be on the property.\nDenham was being held in the Yavapai County Jail.\nfacebook twitter email Share\nPrayer meeting held for four killed in Edgerton, Mo., fire\nThe Rev. Jon Denney, senior pastor of Mount Zion Baptist Church, talks about the community's mood and a prayer meeting held for three adults and an infant killed in a fire.\nRobert A. Cronkleton bcronkleton@kcstar.com\nGlenn E. Rice: 816-234-4341, @gricekcstar\nTony Rizzo: 816-234-4435, @trizzkc"}