{"uri": "http://www.hometownstation.com/santa-clarita-news/public-safety-2/teen-dies-of-self-inflicted-gunshot-wound-in-valencia-181498", "title": "Teen Dies Of Self-Inflicted Gunshot Wound In Valencia", "dct": "Tue, 10 Jan 2017 14:49:00 GMT", "id": "ce1397bd26ae278507a6d07998b775f3", "content": "Mental health officials are working to raise awareness about community resources after a 14-year-old boy was found dead Sunday from a self-inflicted gunshot wound.\nDon’t miss a thing. Get breaking KHTS Santa Clarita News Alerts delivered right to your inbox.\nThe death is the second suspected from such means in 2017.\nThe name of the victim, who was found in a home on the 24000 block of Brighton Drive in Valencia, has not been released pending an autopsy, according to medical examiners.\nThe suicide represents the first in the 16 and under age group in more than a year, as none was reported in that group under the age of 16 in 2016.\nParamedics were dispatched to the home at 4:42 p.m. Sunday regarding a patient with a gunshot wound, according to Los Angeles County Fire Department officials, but the patient had already died.\n2017 seems to be following the troubling pattern of 2016 so far, when the first few months had the suicide rate on track to potentially double.\nThe numbers raised alarms and spurred renewed efforts by Santa Clarita officials, who are working with community partners, such as the Sheriff’s Station and College of the Canyons, with the Blue Ribbon Task Force Subcommittee on Suicide Prevention.\n“We have an advisory committee on suicide prevention, and we have developed a coalition of resources that are available to our community,” said Larry Schallert, assistant director of COC’s Student Health and Wellness Center, “both to prevent suicide and also post-intervention services for family who’ve survived suicide.”\nOfficials at College of the Canyons, which hosts the meetings, in particular, has stepped up outreach efforts, after officials there learned there were three suicides by students who never took advantage of the campus’ counseling resources, according to officials. There were none reported in 2016, but officials have been closely watching the issue and continuing the awareness efforts.\n“We’re doing all we can to prevent these kinds of things, and working with everybody, including the Sheriff’s Department, the colleges our local providers and our local schools,” Schallert said, “to help prevent these kinds of things and to respond to people who are in crisis.”\nThe first suicide of 2017 took place Friday, Jan. 6 at the Oak Tree Gun Club in Newhall. The decedent in that case was identified as Travis Paster, 32, of Lancaster.\nAnyone seeking information about mental health resources available in the Santa Clarita Valley can click here for a list of resources. There are 24-hour phone numbers available. In the event of an emergency, 911 should always be the first call. Those looking to speak with someone can call:\n1-800-273-8255 for the National Suicide Prevention Lifeline\n1-800-854-7771 for the Los Angeles County Department of Mental Health\n1-800-784-2433 for the Treatment Advocacy Center\n661-259-9439 for the SCV Child & Family Center\n661-257-9688 for the Santa Clarita Valley Youth Project\n(661) 263-9371 for Straightening Reins"}