{"uri": "http://www.kare11.com/story/news/crime/2015/09/12/6-people-shot-overnight--downtown-minneapolis/72140598/", "title": "10 shot in 2 separate incidents in Minneapolis", "dct": "Sat, 12 Sep 2015 00:00:00 GMT", "id": "3eebbda7355fc763320b607249f78c30", "content": "MINNEAPOLIS -- Ten people were shot, one fatally, in two separate incidents early Saturday morning, according to authorities.\nPolice say they were called to the area of 1st Avenue and 5th Street in downtown around 2 a.m. where six people were shot following an altercation.\nAccording to Minneapolis Police, all of the injuries are believed to be non-life threatening. Three people have been arrested in connection with the downtown shooting. Two guns were recovered by police from the scene.\nJarrod Picken, 20, says he was one of the innocent bystanders shot in the leg. He was released from the hospital hours after the incident.\n\"I ain't never been shot! I was kind of like in shock,\" he said showing where the bullet entered his body.\nAn 18-year-old who returned to the area Saturday afternoon said he believes his backpack shielded his body from bullets. One bullet hole is visible on the front of his camouflaged backpack. Bullets pierced a hole in the center of coins inside of his backpack.\n\"I am very thankful,\" the teen told KARE 11. \"I was sitting and like my legs were already trying to run and it was like crazy. We were in the wrong place at the wrong but time but somehow we got out.\"\nMinneapolis Police Chief Janee Harteau and Mayor Betsy Hodges issued a statement condemning the shootings and praising the swift police response.\nThree people were injured and one person was killed in a separate shooting in Minneapolis, according to police.\nAuthorities say they responded to a report of a shooting at a home on the 1200 block of 22nd Avenue North around 4:30 a.m.\nPolice say when they arrived, they found four people with gunshot wounds. One person died at the scene and three people were taken to the hospital with non-life threatening injuries.\nOfficials say their preliminary investigation indicates the incident may have been drug-related.\nAnyone with information about the shooting is asked to call CrimeStoppers at 1-800-222-TIPS (8477) or send an anonymous tip to CRIMES (274637) and start the message with: TIP674."}