{"uri": "http://www.muskogeephoenix.com/news/oklahoma_news/four-killed-in-tulsa-shooting/article_f15e0a54-7eaf-5cbe-b86c-33e842849440.html", "title": "Four killed in Tulsa shooting", "dct": "Sun, 24 Nov 2013 00:00:00 GMT", "id": "44bf2406934ee0509272397d8ca45ce0", "content": "TULSA (AP) — Four people were killed and a fifth person was hospitalized after being shot in a Tulsa residence, police said Sunday.\nThe victims were shot by a lone gunman at close range Saturday night, police said. The Tulsa World reported that officers are looking for a suspect.\nPolice said a shooting involving multiple victims was reported to authorities about 7 p.m. Investigators said the home had been the scene of several drug arrests.\nOfficers arrived to find two people dead, a man and a woman both between 30 and 40 years old, responders said. A second woman, who appeared to be in her 50s, was pronounced dead at a hospital, said Kelli Bruer, EMSA spokeswoman.\nSgt. Dave Walker of the Tulsa Police Department told television station KOTV that the fourth victim was a woman in her 50s. Officials said a fifth person was hospitalized in serious condition.\nCapt. Dave Roberts said the investigation had yet to reveal a motive. There is an indication that the suspect might have known the victims.\n“We have someone who said they heard a vehicle leave rapidly after the shooting happened and so we believe he left in a vehicle,” Roberts said.\nOfficers who arrived on the scene found a back door open. The victims did not initially answer police who called to them from the doorway, but the officers soon heard sounds of distress and entered a converted garage area, Roberts said.\nMore people were in another part of the house at the time of the shooting, he said. They remained at the scene and were cooperating with police.\nBruer said medics also evaluated an uninjured child at the home.\nPolice said the home had been the scene of several drug arrests within the last year, including at least five occasions where officers were called to the location.\nRodger Gibson, who has lived in the neighborhood for almost a year, said he has tried to avoid the home because he “could tell it is trouble.”\n“I could not believe it,” Gibson said about the shooting. “I couldn’t believe they shot that many people.”"}