{"uri": "http://www.tulsaworld.com/news/crimewatch/leads-are-few-in-nov-quadruple-homicide-tulsa-police-say/article_2b1f879d-639e-53cd-9b2d-fb2c931bd46e.html", "title": "Leads are few in Nov. 23 quadruple homicide, Tulsa police say", "dct": "Sun, 15 Dec 2013 00:00:00 GMT", "id": "d239380d112ae650909c1101e18ecccf", "content": "As the investigation into a November quadruple homicide grinds into its fourth week, Tulsa police detectives remain stuck with little information coming in on the case.\nAlthough some details mirror those in a January quadruple homicide, detectives say the latest case has its differences.\nFour people were fatally shot in a home on the corner of New Haven Avenue and Newton Street the night of Nov. 23: Charlie Dean Dake Jr., 34; Melissa Lynn Dake, 35; Glenda Ellen Harper, 54; and Tammy Brunson, 46.\nInvestigators speculate that documented methamphetamine use and trafficking at the home was a factor in the shootings but they have yet to uncover any substantial leads or evidence.\n\"We're not getting anything that has any traction,\" said Sgt. Dave Walker of the Tulsa Police Department's homicide unit. \"That's unusual for a methamphetamine-driven case. Usually you can't get people to shut up.\"\nThe shootings were Tulsa's second quadruple homicide this year, following the gunshot deaths of four women at the Fairmont Terrace apartment complex near 61st Street and Peoria Avenue on Jan. 7.\nSimilar to the north Tulsa case, the early weeks of the Fairmont Terrace investigation were slow until the day before a Feb. 6 press conference. At that gathering, 30 days after the killings, police announced the arrests of brothers James and Cedric Poore, one of whom lived in the building where the women were slain.\n\"We were getting so much information and going in so many different directions. And the media really was on that. (Local media) were on it a lot more than you are on this one.\"\nWalker said his team retraced their steps in the Fairmont Terrace case and eventually came up with a break.\n\"It was just a matter of settling down and going back over what we did and what we needed to do, and do over,\" he said.\nThe scenes of both quadruple homicides saw high traffic, but for different reasons.\nAs an apartment complex, Fairmont Terrace had residents with no direct connection to the homicides coming and going around the time of the shootings, which occurred around noon.\nWalker said 20 to 30 people who had frequented the North New Haven residence have been interviewed by detectives.\n\"Trafficking amounts\" of meth were found in the home in January, he said.\nLess than 24 hours after the New Haven homicides, detectives issued a news release that stated, \"The residence has been the scene of several arrests for illegal narcotic dealing in the past year.\" Walker clarified to the Tulsa World the drug being dealt was meth.\nInformation regarding the Fairmont Terrace victims' drug abuse and suspected dealing did not come to light until a Feb. 9 Tulsa World story cited police affidavits and other documents filed with Tulsa County District Court.\nWalker said the amount of drugs involved in the Fairmont Terrace case was small.\nIn the north Tulsa case, at least one of the victims' family members is confident that Ethridge, who goes by Pops and has been described by police as a known drug dealer, knows more than he has told detectives.\nWalker said police immediately focused on Ethridge as a possible cause of the shootings because of his pending methamphetamine charges. Ethridge, Harper, Melissa Dake and Charlie Dake were the home's residents.\nEthridge recently agreed to an interview with the Tulsa World but later canceled.\nWalker said he has spoken with Ethridge multiple times since the shooting. Ethridge has since returned to the residence.\nCourt records show that Ethridge was charged in January with methamphetamine trafficking and in November with unlawful possession of methamphetamine with intent to distribute. Documents filed in those cases refer to the room where the shooting occurred as belonging to Ethridge.\n\"He's the one you automatically focus on, or that we did automatically focus on,\" Walker said. \"(We've asked) who's mad at you and why? How much money do you owe? But, of course, dope dealers don't really create a lot of records.\n\"He said there's nothing that he brings that would cause this type of carnage. So right now we're stuck with that answer.\"\nOn Dec. 4, Ethridge posted a message on his Facebook account to Harper, who's listed as his girlfriend. It reads \"rest in peace pxy ill always miss you!\"\nLinda Harper, Harper's former sister-in-law, said Glenda, who everyone called Pixie, is remembered as a caring woman who was always there for family members in their times of need.\nShe said Glenda provided her family with shelter \"without question\" when they needed it years ago.\n\"I knew her as a law-abiding family-type mother to all,\" Linda said. \"I'm not sure what happened in her life to change the path she was on when we knew her. She was nonjudgmental and forgiving.\"\nThe Dakes were apparently staying with Ethridge and Harper after having been displaced from their home, said Charlie Dake's brother, Matt.\n\"We all love him and miss him,\" Matt Dake said. \"I don't know how someone could do this take four lives just like that.\"\nHe said the last time he talked to Charlie was three or four months ago. He said he and his brother, two of \"at least 14\" kids from a blended family, would often go weeks or even months between conversations.\nHe described his brother as very active and an outdoorsman who loved to hunt, fish and ride dirt bikes.\nCharlie and his wife, who went by Missy, had six children from their previous relationships. The kids have been split up and are staying with various family members in the immediate aftermath of the shootings, Matt Dake said.\nLacie Pineda said she believes her slain mother, Tammy Brunson, was at the residence on North New Haven at the time of the shooting because she routinely checked on some friends there, as well as the children who were living in the residence.\n\"She wanted to do everything for everyone,\" Pineda said. \"That's who she was.\n\"That house, those were friends. She loved them and she'd go there to confide in them or to listen to their problems. I guarantee you she was there for a visit, to check up on them. That was the kind of person she was.\"\nJan. 7: Misty Nunley, 33; Julie Jackson, 55; Rebeika Powell, 23; and Kayetie Powell Melchor, 23, found bound and executed in Powell's apartment.\nJan. 14: Suspect Cedric Dwayne Poore is booked into the Tulsa Jail on a request from the Department of Corrections and for outstanding traffic warrants. He is not be publicly named as a suspect in the killings until Feb. 6.\nFeb. 9: Tulsa World reports court documents indicate Powell and Melchor were dealing marijuana and meth from the apartment they were killed in.\nFeb. 21: James and Cedric Poore charged with four counts of first-degree murder. Each charge carries an alternative of \"felony\" first-degree murder. They're also charged with two counts each of armed robbery.\nSept. 23: Cedric Poore's defense attorneys file a motion for the brothers' trials to be held separately.\nJan. 7: Court will announce its decision as to whether the rule of sequestration was violated by an attorney representing material witnesses in the case.\nJan. 10: Deadline for the district attorney's office to file a response to the Sept. 23 motion."}