{"uri": "http://www.pennlive.com/news/2016/11/lycoming_county_gunowner_gets.html", "title": "Lycoming County gun owner gets jail time in toddler shooting case", "dct": "Mon, 21 Nov 2016 17:35:00 GMT", "id": "6d69087f038ca3d4099f91c7e7d0cba7", "content": "WILLIAMSPORT -- A Lycoming County man whose handgun a toddler used to shoot himself has been sentenced to 9 to 12 months in the county prison followed by three years of probation.\nJudge Richard A. Gray said Monday when he sentenced Cody A. Asher, 22, of the Muncy area, he felt the need to send a message on the accountability of firearms especially in homes with children.\nThe judge commented he believes Asher was \"grossly negligent\" in leaving a gun where Zachery Lee, then 21/2, could shoot himself on March 26, 2015.\nThe boy has made a full recovery after undergoing surgery at Geisinger Medical Center near Danville and rehabilitation at Penn State Hershey Medical Center.\nAsher was found guilty in September of charges of endangering the welfare of a child, recklessly endangering another person and a simple assault count that involves a deadly weapon.\nImplementation of the sentence, which included restitution of $1,647 to the boy's father, also Zachary Lee, was stayed pending an appeal.\nAssistant District Attorney Martin Wade, in arguing for jail time, pointed out the crime would not have occurred without the gun.\nThe fact that Zach had time to find the gun and shoot himself was an aggravating factor, the prosecutor claimed.\nHe called for a sentence that would have a deterrent effect on other gun owners.\nA victim impact statement the boy's father submitted to the court states in part:\n\"Since this happened Zach has/had night terrors. He is now a high risk for hernias, he doesn't like fireworks anymore and he is now cautious about things a child his age should not be concerned with.\n\"He is mentally and scarred from the experience.\" Lee asked Gray to impose a jail sentence.\nDefense attorney Robert Cronin told the judge his client lives every day with the understanding his actions caused the injuries to the toddler.\nThe incident caused him to lose his job, not get a security position and drove a wedge between him and Zach's mother, Amanda Lynn Fry, he said.\nFry in January was accepted into the accelerated rehabilitative disposition program, which if completed successfully, will allow expungement of her record of the same charges as those against Asher.\nZach shot himself with a .45-caliber handgun in a Broad Street house in Montoursville where Asher and Fry were living.\nThe adults were taking a shower when, according to trial testimony, they heard a noise and rushed downstairs where they had left Zach watching television between 5 and 15 minutes earlier.\nFry testified she found her son on a sofa with the gun in his lap. A registered nurse, she said she used a clean diaper to apply pressure until emergency personnel arrived.\nThe bullet through his abdomen and lodged in his back.\nAsher told police the gun, for which he had a concealed carry permit for protection purposes, had been on the floor in an upstairs bedroom."}