{"uri": "http://www.pennlive.com/news/2016/01/mom_of_tot_who_shot_himself_in.html#incart_river_index", "title": "Mom of boy who shot himself in Montoursville accepted into special probation program", "dct": "Sat, 16 Jan 2016 07:31:00 GMT", "id": "e6944b9708a66a46172382551ae79e09", "content": "WILLIAM SPORT -- The mother of a toddler who shot himself in March has been accepted into the program that could lead to her record being expunged.\nAmanda Lynn Fry, 25, of Watsontown, Friday appeared before Lycoming County Judge Nancy L. Butts where she agreed to the terms of the accelerated rehabilitative disposition program.\nCharges of aggravated assault, endangering the welfare of children, recklessly endangering another person and simple assault will be expunged upon successful completion of the program in two years.\nFry's former boyfriend, Cody A. Asher, 21, is awaiting trial on the same charges.\nDistrict Attorney Eric R. Linhardt explained the reason he approved the ARD program for Fry was from the beginning she has been fully cooperative with law enforcement and remains ready to testify against Asher if necessary.\n\"While we believe Fry could have done more, and should have done more to assure the safety of her children,\" he said.\nFurther investigation determined she was less culpable than originally believed and substantially less culpable than Asher, he said.\n\"While we would not normally consider ARD for this type of offense, we believe in Ms. Fry's case, this disposition is both appropriate and just,\" Linhardt said.\nShe has never been in trouble with the law before and he said he fully expects her to successfully complete the two years of supervision.\nFry's then 2-year-old son Zachery Lee, shot himself with a .45-caliber handgun while she and Asher were taking a shower about 3 p.m. on March 26. They had left him in the living room watching cartoons on television.\nAsher estimated the toddler was left alone for about 15 minutes and he admitted leaving the cocked weapon on the bedroom floor but claimed the safety was on, Montoursville Office Bill Hagemeyer testified at the preliminary hearing.\nLee was found on a living room sofa with the gun between his legs, the charges state. Fry, a registered nurse, applied pressure to control the bleeding, police said.\nThe bullet went through Lee's abdomen and lodged in his back. He has made a full recovery after undergoing surgery at Geisinger Medical Center near Danville and rehabilitation at Penn State Hershey Medical Center.\nHagemeyer testified previously when he met Asher at the front door of the Broad Street house, he observed a muzzle-loader on another sofa and gun safe in the living room.\nAsher is not Lee's father but he and Fry have a younger daughter who also was in the house that day."}