{"uri": "http://www.timesunion.com/local/article/Troopers-Unclear-why-Colonie-cop-killed-family-6823480.php", "title": "Troopers: Unclear why Colonie cop killed 2 in family, self", "dct": "Thu, 11 Feb 2016 00:00:00 GMT", "id": "9d117bf9af67a88940c53a4658d2b564", "content": "Colonie\nStunned officials offered no motive or even conjecture, aside from a grim timeline of violence, about why Colonie Police Officer Israel J. Roman shot and killed his wife and 10-year-old son, carried their bodies upstairs to the master bedroom, started a fire at their Schalren Drive home and turned his Smith & Wesson .45-caliber service revolver on himself Tuesday afternoon.\nInvestigators said Roman had not been acting strangely, did not exhibit signs of mental illness and there were no reports of domestic violence between the married couple.\n\"It's a horrific tragedy and we want to know why. We may never know why,\" Colonie Police Chief Jonathan Teale said Thursday at a news conference. \"He was a hard-working officer, low-key and decorated. He was very dependable. This was completely out of character.\"\nAutopsies Wednesday confirmed the murder-suicide after the three bodies — Roman, 44, his wife, Deborah, 44, and son Nathan, 10 — were recovered in the master bedroom, each with a single gunshot wound. They were identified by dental records because they were so badly burned.\nA family dog also died in the fire.\nThe couple's 15-year-old son, Noah, a 10th grader student at Shaker High School, was at a Shaker basketball game at the time of the killings and fire. Investigators picked him up at the game, drove him to police headquarters and told him of the deaths later that night.\n\"We have no motive,\" said State Police Capt. Robert Patnaude of the bureau of criminal investigation, or BCI, a 20-year veteran. His voice choked with emotion and he paused to gather himself twice as he laid out details that shocked neighbors in the sub-division off Forts Ferry Road and stunned co-workers and town officials.\n\"It's very emotional,\" Patnaude said afterward.\nColonie Police turned over the investigation to State Police \"in the interest of transparency\" since a Colonie cop was the shooter, Teale said.\nMore than a dozen members of the department and town officials attended the news conference inside the police headquarters building. Counseling services were made available to first responders and others who requested them.\n\"This is a very shocked and grieving community,\" Town Supervisor Paula Mahan said. \"Our whole community is in mourning over this terrible tragedy.\"\nShe extended prayers, sympathy and assistance to the Roman family. \"We will help them in this time of terrible sadness,\" she said.\nInvestigators are continuing to pursue leads, especially one block of time Tuesday that remains unclear, between 11 a.m. and 12:45 p.m. Tuesday, when the couple went somewhere together and returned to the house. Tuesday was Roman's normal day off and his wife took a day off from her job as an English as a New Language Learners teacher at Bradt Primary School in the Mohonasen school district because of a doctor's appointment.\nPatnaude asked for anyone with information about where the couple went together to contact State Police, because that unaccounted time period may shed light on Roman's possible motive.\nPatnaude said it is also unclear if Roman had financial difficulties or debt problems, which is part of the ongoing investigation.\nIn the crowded hours before his final act, at about 1:30 p.m. Roman, an avid hunter, drove to a Latham gun dealer he had known for years and sold three guns — a Kimber Pro CDP handgun, Glock 9mm handgun and Rock River LAR 15 tactical assault rifle — but left with a fourth gun he brought to sell, a TC Icon .308 hunting rifle, because he considered the dealer's price too low.\nThe gun dealer told investigators Roman said he was selling the guns because he intended only to hunt with a bow and he did not appear despondent and did not act strangely. Also, Roman worked a regular shift Monday and asked his boss if he could have Saturday off to go hunting, Teale said.\nAssisted by footage from a video surveillance camera a neighbor mounted outside his house while away on vacation, as well as interviews, Patnaude offered these details of Roman's movements Tuesday afternoon.\nAfter leaving the gun dealer at about 2 p.m., he drove to Shaker High, gave his son Noah money for dinner with two buddies at Burger King, and had a brief conversation with the teen. He drove home and arrived at Schalren Drive at 3:20 p.m.\n\"Nothing unusual,\" Patnaude said.\nAt 3:30 p.m., Roman's son, Nathan, 10, got off the school bus from Forts Ferry Elementary School, where he was in fifth-grade.\nAt 3:52 p.m., surveillance camera footage showed Roman moved a car from the driveway to the street and loaded his 15-year-old son's clothing and other belongings into the car. Investigators smelled an accelerant, possibly gasoline, inside the vehicle. He called his mother and asked her to pick up her grandson after the basketball game.\nLaw enforcement sources told the Times Union on Wednesday that Roman's mother described for investigators that her son showed signs of despondency when he communicated with her Tuesday.\nInvestigators interviewed neighbors, but nobody heard gunshots or noticed anything unusual at the house, Patnaude said.\nAt 4:07 p.m., video surveillance showed a burst of bright flames and smoke on the first floor, but it dissipated and disappeared from view after several minutes.\nIt was unclear at precisely what time Roman fatally shot his 10-year-old son and wife before he carried their bodies to the upstairs master bedroom and then killed himself, Patnaude said.\nA neighbor who saw the house on fire called 911, firefighters responded at 5:45 p.m. and found the house engulfed in flames. They had to move back when ammunition upstairs exploded for about five minutes during the blaze, Patnaude said. The bodies were later recovered upstairs.\nA specially trained dog worked at the burned house Thursday as part of a fire investigation to determine where and when the fire started and what accelerant was used, said William McGovern, deputy chief state fire investigator.\nRoman, known as \"Izzy,\" grew up in Lansingburgh and worked for the Rensselaer County Sheriff's Department before being hired by Colonie police 12 years ago. He also served in the U.S. Army Reserve from 1991 to 1997. There was no indication he suffered from post-traumatic stress disorder due to his military service, Teale said.\n\"He was a quiet, hard-working family man,\" Teale said. \"This was a tragic, senseless event. We will move forward. We have jobs to do and we will do it. Our hearts and prayers go out to the family.\"\nParents of the school children were notified by a message service and a letter on the school district's website. Grief counselors and psychologists are available at Forts Ferry and Shaker High through Community Hospice, said Joe Corr, North Colonie school district superintendent.\n\"We've lost members of our North Colonie family and it's a feeling of profound sadness and disbelief,\" Corr said. \"This was an unbelievable loss for the Romans.\"\nHe described Nathan Roman as \"a typical 10-year-old boy, with a bright personality, who loved Godzilla.\"\nCorr praised the selflessness of Tim Stowell, who made a Sunday bowling event intended to raise money for cancer research and changed it instead to a fundraiser for Noah Roman. Roman and Stowell's son, Ben, were best friends since kindergarten. Ben Stowell died at age 9 of a rare childhood cancer six years ago and Noah spoke at Ben's funeral.\n\"It's a very generous act on their part,\" Corr said of the Stowell family's initiative. Corr said he expected several Shaker High students who knew Noah Roman would participate in the fundraiser Sunday from 2 to 4:30 p.m. at Spare Time Bowling in Latham.\nNoah Roman is staying with relatives out of the area, authorities said.\npgrondahl@timesunion.com • 518-454-5623 • @PaulGrondahl"}