{"uri": "http://www.fox5vegas.com/story/32341705/3-juveniles-among-5-dead-in-vegas-apparent-murder-suicide", "title": "3 juveniles among 5 dead in Vegas apparent murder-suicide", "dct": "Thu, 30 Jun 2016 04:40:00 GMT", "id": "a984238c0dd7a3109f5868b926770602", "content": "LAS VEGAS (FOX5) -\nFour of the five people who died in an apparent quadruple murder-suicide in the northwest Las Vegas Valley were identified Thursday.\nThe Clark County Coroner's Office identified the four deceased people as Phoukeo Dej-Oudom, 35; Dalavanah Ariel Dej-Oudom, 15; Xonajuk JJ Dej-Oudom; and Anhurak Jason Dej-Oudom, 9. The cause and manner of death for the four remained pending.\nLt. Dan McGrath, of Las Vegas Metro police, said it's believed a man shot a woman Wednesday near a Walgreens store located at Jones and Lake Mead boulevards and that the incident is domestic in nature. Citing witnesses, McGrath said a man in a black car was seen chasing a woman at 7:04 p.m. near Lake Mead Boulevard, and Torrey Pines Drive. A witness picked the woman up in their car, but the man in the Mercedes pulled her out, and flashed a weapon at the driver.\nAt 7:28 p.m., while officers were investigating the first report, more officers were dispatched to the parking lot of a Walgreens in the 6100 block of Lake Mead Boulevard. McGrath said witnesses reported hearing gunshots, and found the woman's body.\nMcGrath said a separate call from a family member of the man indicated he wanted to commit suicide. At 8:01 p.m. officers went to an apartment complex in the 1900 block of Torrey Pines Drive. Officers located the Mercedes matching the description from the incident at Walgreens. Officers attempted to reach the resident of the apartment, but were unsuccessful. Police said they received information that three children were unaccounted for, and treated the scene as a barricade. SWAT forced entry into the apartment. Police found the man, and three children, between the ages of nine and 15-years-old, deceased in a bedroom. It is believed the man is responsible for the deaths in the apartment.\nThe man and woman were husband, and wife, McGrath said. The man is the father of the children.\nThe investigation is ongoing, and police said it was unknown if the children were killed before, or after the woman was killed.\nA domestic disturbance was filed against the man earlier in June, McGrath said. The man had other domestic disturbances filed against him in the past.\nCourt records indicated the wife filed for divorce in May.\nThe coroner's office has yet to identify the fifth deceased person in the related scenes.\nStay with FOX5 for updates.\nCopyright 2016 KVVU (KVVU Broadcasting Corporation). All rights reserved."}