{"uri": "http://www.ktnv.com/news/crime/woman-found-dead-behind-walgreens-in-northwest-las-vegas", "title": "UPDATE: Witnesses talk about incident involving deaths of mom, 3 kids", "dct": "Wed, 29 Jun 2016 20:26:00 GMT", "id": "cfdcd7fff16a3c15219302589c517e59", "content": "Autoplay:Woman found fatally shot behind Walgreens in northwest Las VegasCONNECTING...XFamily of 5 dead in domestic-related incident\nLAS VEGAS (KTNV) - A family of five in northwest Las Vegas is dead this morning.\nPolice say that a man killed his wife and 3 children before turning a gun on himself.\nIt began with the investigation into the shooting of a woman on Wednesday night around 7 p.m.\nPolice say that a woman was running away from her husband in the area of Lake Mead and Jones boulevards when she was picked up by a driver there.\nAccording to police, the man caught up with the woman and that driver, showed he had a gun, and pulled the woman out of the car.\nShe got away again, this time, jumping into a parked car to try to hide.\n13 Action News spoke with the family who was inside that car, at the time the woman jumped inside. They say they had seen the woman running down the street, and pulled over to call police.\n\"I screamed to my husband, 'she's in the car', and he [the victim's husband] had a pistol in his hand, because he was going to get her,\" says the good samaritan, Esmeralda.\nIn the back seat, was her 8 year old son. According to Esmeralda, the victim's husband was circling the car with a gun, yelling at them to let her out of the car.\n\"My husband said let's try to help her, but when we saw he was armed, that was it, my husband said no, it's too dangerous,\" says Esmeralda.\nEsmeralda says they ultimately made a choice between keeping their son safe, or saving the victim. They let the man take the woman away, and called 911.\nShe was able to get away from him again shortly after and was then seen running through a Walgreens parking lot in the 6100 block of West Lake Mead Boulevard. A few seconds later, several gunshots were heard and the woman was dead with a gunshot wound to the head when the police arrived.\nPolice say that they were told that the suspect was an Asian man driving a black Mercedes-Benz with custom rims.\nAround 8 p.m., police received a call from out of state about a man who was possibly suicidal in a nearby apartment in the 1900 block of Torrey Pines Drive.\nUpon arrival, they noticed a car matching the description of the one involved in the woman's death outside of the apartment. After they were unable to make contact with anyone inside the apartment, SWAT was called in to assist.\nA few hours later, police made entry into the apartment and found the man and 3 children deceased. It is not clear if the children or the woman was killed first.\nPolice spent most of the night at the apartment complex on Torrey Pines gathering evidence. Police say that there was a history of domestic violence. A search of Clark County court records revealed that the woman had filed for divorce in May.\nThe Clark County coroner identified the three children and woman early Thursday morning. They are 9-year-old (male) Anhurak Jason Dej-Oudom, 15-year-old (female) Dalavanh Ariel Dej-Oudom, 14-year-old (male) Xonajuk J.J. Dej-Oudom, and 35-year-old (female) Phoukeo Dej-Oudom.\nThe coroner has not identified the man and the cause and manner of death has not been released for the children and woman.\n13 Action News has spoken to several people who witnessed at least part of the incident, including the Good Samaritan.\nThe deaths of the woman and children are the 86th, 87th, 88th and 89th homicides to be investigated by Las Vegas police so far this year.\n.@LVMPD investigating shooting at Lake Mead & Jones. Woman dead behind store. @KTNV pic.twitter.com/34HPBCejjZ\n— Bryan Callahan (@BCallahanKTNV) June 30, 2016\nThis morning police are inside the complex, even hours after the family was killed. @KTNV pic.twitter.com/2XV7WlW1uE\n— Parker Collins (@parkercollinstv) June 30, 2016\nCopyright 2015 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}