{"uri": "http://www.fox5vegas.com/story/30171995/police-man-kills-woman-her-son-himself-in-south-las-vegas", "title": "Police: Man kills woman, her son, himself in south Las Vegas", "dct": "Fri, 02 Oct 2015 15:19:00 GMT", "id": "93dc540fbbe73b83071433f74a9e63d1", "content": "LAS VEGAS (FOX5) -\nPolice said a Las Vegas man killed a neighbor and snatched her young son Friday morning before police arrived at his home and found both the man and the boy dead.\nThe shooting happened about 7 a.m. at a home in the 7200 block of Hardtack Circle, near the intersection of Warm Springs Road and Interstate 215.\nAccording to Las Vegas Metro police, the man went to the 39-year-old woman’s home where he shot and killed her. The man then took the woman’s son and fled to his home two doors away. The woman’s young daughter then ran to a neighbor’s home where they called for help.\nInvestigators said police arrived at the scene and found the woman’s body in a doorway and her youngest son, a 2-year-old, still inside. They took the unharmed boy to safety before they were directed to the man’s house. Once they arrived at the man’s house, officers heard a gunshot.\n\"One of the patrol officers heard a couple gunshots from that residence,\" Lt. Dan McGrath, of Metro, told media on Friday. \"At that point it was treated as a hostage situation.\"\nBelieving the man had a hostage, they backed away and called in crisis negotiators and the SWAT team.\nAbout two hours later, police went into the man’s home, where they found the bodies of both the man and the woman’s son who he had taken, police said.\nInvestigators did not immediately confirm the relationship between the boy and the woman who were killed, but a friend of the female victim confirmed to FOX5 that they were mother and son. A neighbor also said the juvenile victim was 10 years old.\nPolice said they are still trying to determine a motive for the killings. A neighbor, though, believed there may have been trouble between the shooter and the adult victim before.\n\"I've heard there has been some squabbling among the neighbors, because it was just a neighbor and another neighbor,\" said Celinda McDaniels, who lives in the area.\nThe identities of the victims and the man will later be released by the Clark County Coroner’s Office.\nThe relationship between the man and the victims was not immediately released.\nThe deaths of the woman and boy marked the 97th and 98th homicides in Metro's jurisdiction this year.\nPolice were still looking for information in the case. They urged anyone with knowledge to contact Metro's Homicide Section at 702-828-3521 or at homicide@lvmpd.com. Tips can be submitted anonymously at 702-385-5555 or at crimestoppersofnv.com.\nA crowdfund account was setup for the victims' surviving family members. You can view the fund at this link.\nCopyright 2015 KVVU (KVVU Broadcasting Corporation). All rights reserved."}