{"uri": "http://www.wsfa.com/story/29983881/3-charged-in-shooting-death-of-3-year-old-in-greene-co", "title": "3 charged in shooting death of 3-year-old in Greene Co.", "dct": "Tue, 22 Sep 2015 21:40:00 GMT", "id": "0d9062cfc9c7b278ea8fdce195b73f19", "content": "GREENE COUNTY, AL (WBRC) -\nThree people have been charged in connection to a shooting that killed a 3-year-old boy in Greene County last week.\nWitnesses said Layton Cochran was inside a car when a shooting started on Baron Road in the Knoxville community near Eutaw around 3 p.m. Friday, Sept. 4. The toddler was hit by the bullets and killed.\nGreene County District Attorney Greg Griggers says Layton's father, Larry Cochran, Jr. was the intended target. Investigators still do not know why the shooting occurred.\n\"My condolences to the family. I can't imagine how they must be feeling right now,\" Griggers said. \"But I think it, you know, it adds a sense of urgency to what you're doing anytime you're talking about a child victim. And I know it had an impact on the guys who were out there, working all weekend long.\"\nHarper Colvin, 32, of Knoxville has been charged with murder and discharging a gun into an occupied vehicle.\nTwo other suspects, 19-year-old LaBryant Kumane Whitehead, from Tuscaloosa, and 18-year-old Tymon Leotis Davis, of Knoxville, have been charged with first-degree hindering prosecution.\nDavis, Whitehead and Colvin all surrendered around 7 p.m. Friday, the day of the shooting. They were charged on Tuesday and are being held in the Greene County Jail. Their bonds have not yet been set.\nThe victim's cousin, Willie, and his grandfather, Larry Cochran, Sr., said a relative came by Layton's father's home to show or sell him some guns.\nThey said there was a disagreement and he left in a car with others. They returned and at least one of them started shooting towards a house and a car where Layton was sitting.\n\"I said, 'You better get low, 'cause I'm fixing to get low.' And my son said, 'Get my baby, get my baby.' When he reached in the car and got the baby, he was shot in the head,\" Cochran, Sr., said.\n\"He turned around and come out like that. And he just went to shooting. And my cousin said, 'Get my baby, get my baby.' And I jumped up, opened the door, got the baby out of there. When I got the baby, I was handing him to his dad, his granddad. And I looked down at the baby and blood was running down my hand,\" Willie Cochran said.\nSpecial agents with the Alabama Law Enforcement Agency's State Bureau of Investigations and Greene County deputies, along with the District Attorney's office, arrested the three suspects. State troopers with ALEA say the investigation is continuing.\nCopyright 2015 WBRC. All rights reserved."}