{"uri": "http://www.dispatch.com/content/stories/local/2016/11/23/1123-wendys-shooting-folo.html", "title": "Police identify man who died in shooting at Franklinton Wendy's", "dct": "Sat, 28 Jan 2017 20:44:38 GMT", "id": "79f8e235b7043f8b06cbec61eb4c7edd", "content": "A sparse arrangement of carnations and empty liquor bottles sits near where a man was shot and killed outside a Franklinton fast-food restaurant this week. Columbus police on Wednesday identified the man who died as 38-year-old Edwin Guerrero. A second shooting victim, a 17-year-old boy, wasn't identified and was said to be in stable condition.\nA sparse arrangement of carnations and empty liquor bottles sits near where a man was shot and killed outside a Franklinton fast-food restaurant this week.\nColumbus police on Wednesday identified the man who died as 38-year-old Edwin Guerrero. A second shooting victim, a 17-year-old boy, wasn't identified and was said to be in stable condition.\nThe shooting, which took place just after 6:15 p.m. Tuesday, shattered four windows near the drive-thru window on the west side of the Wendy's restaurant in the 1400 block of West Broad Street. The makeshift memorial was placed by someone in the parking lot Wednesday morning.\nDispatchers received numerous 911 calls that Guerrero was lying in the Wendy's parking lot with his life pouring out of him.\n\"He's on the ground bleeding,\" said one caller.\nAnother caller told dispatchers, \"Somebody's out here shooting kids or somebody out here. It's crazy. ... We're inside. The bullets was coming inside, man. Everybody got down and somebody might be dead out here.\"\nA woman could be heard crying in the background on the 911 tape, saying, \"Oh, my God, baby. Baby, oh, please stay.\"\nGuerrero was taken to Mount Carmel West hospital and died about 30 minutes after the shooting.\nPolice didn't identify the 17-year-old who was shot and wounded because they said they are concerned for his safety. They said he was in stable condition at Mount Carmel West.\nIt's unclear what led to the shooting and no arrests have been made. One caller said about 10 shots were heard. Police say the shooting took place after there was a fight between two groups. Investigators were still folllowing up on leads on Wednesday.\nGuerrero's death marks the 87th homicide in Columbus this year."}