{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-chicago-gun-violence-20150804-story.html", "title": "1 dead, 5 wounded in Chicago shootings", "dct": "Wed, 05 Aug 2015 17:05:00 GMT", "id": "81a06e0e4bd529df4bb7890a4cb39cc7", "content": "A police officer examines a shell casing after a shooting in the 4000 block of West 21st Street on Aug. 5, 2015.\n(Megan Crepeau, Chicago Tribune)\nA man has died and at least five people were wounded since Tuesday afternoon in separate shootings citywide, police said.\nThe man killed was identified as Adarius D. Hayes, 21, of the 8100 block of South Damen Avenue, according to the Cook County medical examiner's office.\nHayes was in the 7500 block of South Damen Avenue at about 6 a.m. Wednesday when he was shot in the chest, said Officer Janel Sedevic, a Chicago Police spokeswoman and the medical examiner's office.\nHayes was pronounced dead on the scene in at 6:55 a.m., according to the medical examiner's office.\nA 15-year-old boy was shot in the Lawndale neighborhood at 12:08 a.m. Wednesday.\nHe was in the 4000 block of West 21st Street, around the corner from the Pulaski Pink Line stop on the CTA, when he heard shots and felt pain, according to Officer Ron Gaines, a Chicago Police Department spokesman.\nHe was shot in the foot and taken in good condition to Mount Sinai Hospital.\nJust before midnight, a 62-year-old man was shot during a robbery in the Humboldt Park neighborhood, police said.\nHe was in the 3700 block of West Thomas Street when two males came up to him and announced a robbery, Gaines said. They took his wallet and shot him in the knee.\nThe man was taken to Mount Sinai, where his condition stabilized.\nIn the Belmont-Central neighborhood about 6:20 p.m., an 18-year-old man was riding in a car in the 2200 block of North Austin Avenue when he was shot in the right calf, said Officer Nicole Trainor, a Chicago police spokeswoman.\nThe car was stopped at a stop sign when a group of people arguing on the corner opened fire, hitting the man, Trainor said. The man had the driver of the vehicle take him to Community First Medical Center, where he was treated and released.\nEarlier, on the border of the Park Manor and Chatham neighborhoods, a 27-year-old man walked into Jackson Park Hospital about 4:30 p.m. with a gunshot wound to the right hand, said Trainor.\nThe man told police he had been shot on the 500 block of East 75th Street after initially saying he was shot near 75th and Loomis streets. He was in good condition at the hospital, Trainor said.\nShortly before 4 p.m., a 15-year-old boy shot himself in the leg in the 6700 block of South Western Avenue in the Marquette Park neighborhood.\nThe boy, who has documented gang affiliations, was taken to Advocate Christ Medical Center in Oak Lawn, where his condition was stabilized, Trainor said."}