{"uri": "http://www.miamiherald.com/2014/07/07/4223082/late-night-shooting-near-liberty.html", "title": "Police: Details scarce in late night shooting near Liberty City that left two dead, two injured", "dct": "Mon, 07 Jul 2014 17:18:00 GMT", "id": "1fecb7cb3839af2c77521b20eaa9d74f", "content": "Investigators were met with deafening silence Monday when they canvassed the area outside a Northwest Miami-Dade apartment complex trying to find the persons responsible for a late-night shooting that left two dead and two others injured.\nThe shooting happened around 10 p.m. Sunday night at Northwest 62nd Street and 20th Avenue. When officers arrived at the apartment several people were wounded, but “nobody shared details about what happened,” Miami-Dade police spokesman Det. Alvaro Zabaleta said Monday.\n“This is yet another scene where when investigators tried to get information, they were not getting assistance from the community,” he said. “We need to break the code of silence.”\nInvestigators identified one of the dead as Tyquavious Charles, 21. The name of the other man killed will be released after relatives are notified.\nA man identified as Ricky Hudson, 27, was shot multiple times and was in critical condition at Ryder Trauma Center. A woman, who was not identified, was recovering at Ryder after a bullet grazed her in the head.\nNeighborhood residents milled around Monday, most afraid to speak because of fear of retaliation.\n“I heard four shots and then it sounded like a war,” said one boy.\n“This is a community in crisis,” said Cecilia Gutierrez-Abety, president and chief executive officer of the Miami Children’s Initiative, a nonprofit organization that focuses on children in Liberty City. “And its been this way for a long time. Shooting has a become a part of daily life here.”\nShe was out with a group of volunteers and residents Monday, knocking on doors to calm nerves.\nSunday night’s shooting happened right near the group’s office, Gutierrez-Abety said. The two men lay dead for hours as police investigated.\n“We are really sad,” she said. “There is a total disregard for human life.”\nZabaleta said police are looking to see whether there are any ties to a June 24 shooting outside a Liberty Square housing complex that killed two people and injured seven.\n“At this point in the investigation it is too early to tell,” he said. “However, we are not going to disregard the possibility.”\nAnyone with information is asked to call Miami-Dade CrimeStoppers at 305-471-TIPS."}