{"uri": "http://www.wpxi.com/news/16-year-old-junior-firefighter-dies-of-gunshot-wound-at-fire-station/470832196", "title": "Funeral services slated for 16-year-old junior firefighter fatally shot at fire station", "dct": "Wed, 30 Nov 2016 18:48:00 GMT", "id": "52e4732798a6ca7853656cf4e462d9fe", "content": "REDSTONE TOWNSHIP, Pa. - Funeral services have been scheduled for a 16-year-old junior firefighter who was shot and killed Sunday while inside a fire station.\nParker Hess was a sophomore at Brownsville Area High School. Hess’ family members said it was his dream to become a New York City firefighter. They said he was so proud to finally afford his own official helmet, which cost him nearly $500.\n“He bought his helmet. He saved all his money up to buy his junior helmet,” Umbel said.\nRepublic's small fire department has received a huge outpouring of support from people, companies and other fire departments, who've reached out and offered support and prayers.\nGeorge Matis Jr., 21, of Republic, was charged with criminal homicide and recklessly endangering another person in connection with the shooting in Redstone Township, Fayette County.\nHess and Matis were in an office at the fire station, when Matis removed a 9mm pistol from a holster he was wearing, and it discharged in Hess’ direction, a criminal complaint said. Matis owned the gun legally, according to state police.\nThe Redstone Township Police Department was called to the fire station about 4 p.m., according to a news release from state police in Belle Vernon. When police arrived, they found that Hess had been struck in the face by a bullet. He died at the scene, and a procession escorted Hess’ body from the fire station\nOfficials said there were other people in the firehouse at the time, preparing for the town's Light Up Night, which was ultimately canceled. However, those people did not witness the shooting.\nTroopers said Hess and Matis were pretty good friends. They do not yet know if the shooting was intentional or an accident. Matis has obtained an attorney. Matis was arraigned and taken to the Fayette County Prison, where he is being held without bail. A preliminary hearing is scheduled for Dec. 7.\nWhen residents and the teen's classmates heard about the incident, they rushed to the fire hall to pay their respects and offer support.\n\"You just can't take any day for granted. It could be gone like that, you know?\" said Nellree Burnham, who lives nearby. \"Our thoughts and prayers are certainly with this family.\"\nLaci Savochka, a classmate of the victim, said the community needs to stay strong to get through the tragedy.\nIn a statement, Brownsville School District superintendent Philip Savini said: \"We are saddened to hear of the loss of one of our students. Our sympathies and support go out to the family. The district has scheduled counselors who are prepared to offer support to staff and students when school resumes Tuesday.\"\nJeffrey Umbel, who worked with Hess and Matis at the Republic Volunteer Fire Department, also offered his condolences.\n“(Hess’) mom said he wanted to be a fireman all his life. It's a shame something like this had to happen. Accidents do happen,” he said.\nThe Fire Department posted the following tribute to Hess Monday night on its Facebook page:\n“May God Bless the Hess Family. Truly a great young man taken way to soon. “Parker is a proud brother of a great cause to which he was one of our own. Surely he will be missed. Parker added the youthful touch to an aging department. Eager to learn, without hesitation. So respectful and most warm hearted as you could get. RVFC will without a doupt miss him. He became a member of our family. We can never explain the reasons things happen sometimes. And more importantly this time. Our only hope is that God's plan were more important than ours.\nVisitation and funeral information is as follows:\nFirefighter memorial service\nFuneral procession:\nFriday at 11 a.m. at First Christian Church of New Salem\nDue to limited space and out of respect for the family, the services will be limited to the home fire department and its immediate mutual aid companies. The Republic Volunteer Fire Company asks that any department wishing to pay tribute and honor Parker by accompanying the procession as it makes its way to the cemetery to be at the New Salem VFW Woods, 998 New Salem Road, New Salem, PA 15468, no later than 10:45 a.m. to line up. There will be fire police personnel directing people to the staging area.\nImmediately following the internment services, members of the Republic Volunteer Fire Company invite all attending departments to their social hall at 218 Republic Road, Republic, PA, 15475, for a light lunch and fellowship with other firefighters.\nPeople are asked to RSVP to the Fayette County EMA Office at 724-430-1277 during normal business hours or email jbittner@fcema.org. People can also contact the Fayette County 911 Center after normal business hours at 724-430-9111 with the number of apparatus and personnel attending Friday's services."}