{"uri": "http://www.cleveland.com/metro/index.ssf/2016/07/11-year-old_cleveland_girls_sh.html#incart_river_index", "title": "11-year-old Cleveland girl's shooting might be linked to road-rage incident, police reports say", "dct": "Thu, 28 Jul 2016 13:35:00 GMT", "id": "4e5fbdda6d11a8c9bff246e40b3a188d", "content": "(Adam Ferrise, cleveland.com)\nCLEVELAND, Ohio -- The 11-year-old girl shot in the leg inside her home early Thursday cried on her way to the hospital, not because of the pain but because she was worried about her three younger sisters.\n\"It makes me cry just thinking about it,\" said the girl's great-uncle, who helped get her to nearby MetroHealth Medical Center. The man asked that his name not be used for fear of retaliation.\nCleveland police are also investigating whether the shooting is connected with a road-rage incident that happened Monday involving the girl's stepmother.\nMichael Pratts, the girl's uncle, said that he and a few others were at the girl's home in the 3400 block of Seymour Avenue Wednesday night. Members of his family live in homes scattered throughout the neighborhood.\nHe said everyone left shortly before 1:30 a.m. The 11-year-old girl was watching a movie from a couch in the living room with her stepmom and her 3-year-old sister.\nA group of men in a white Cadillac drove up and down the road several times prior to the shooting, witnesses told police. Someone knocked on the window of one of the family's houses across the street. Shortly after, someone fired at least five gunshots into the home.\nBullets ripped through the front of the house, including a large pane of glass. One of the bullets hit the 11-year-old girl in the leg as she held her 2-year-old sister. Her 5-year-old and 10-month-old sisters were also in the home at the time.\nWesley Pratts, her father, said that he and his brother left to go to the store about five minutes before the shooting.\n\"They knew there were kids in the house,\" he said. \"We have a big window in the front of the house and the blinds were open. There's no way they didn't see them in there.\"\nThe girl's mother told police that she was in the kitchen when the shooting started and soon noticed her daughter on the ground with the wound.\nWitnesses and investigators are not sure whether there was a lone gunman or several people involved in the shooting. Whomever was involved either ran away or left in a car, but neighbors and family members said they never heard a car drive away.\nNeighbors said they heard the girl scream \"mommy.\" The girl's uncle and great-uncle ran to the home. Her great-uncle scooped her up and took her outside.\nA neighbor getting home from work offered her van to the girl's mother. The great-uncle put the girl in the backseat and made the short drive to MetroHealth.\n\"She's scared,\" Wesley Pratts said. \"All she keeps talking about are her sisters though. She wants to make sure they're okay. She's the big sis. They all look up to her. She takes care of her sisters for her daddy. She's a perfect little girl. She doesn't deserve this.\"\nCleveland police have not determined whether the shooting is connected with a road-rage incident that happened Monday involving the victim's stepmother. She was driving along Seymour Avenue with several children in the car when she noticed a man tailgating.\nHe nearly struck her car and she eventually confronted him.\nThe man threatened to shoot up her car, pointed his gun at her, turned it away and fired one shot, Wesley Pratts said. He drove away and police later found a bullet casing in the road. No arrests were made in that case.\nThe family got some positive news Thursday. The girl underwent surgery on her leg and doctors told the family they were able to get blood flowing to the rest of her leg, Wesley Pratts said.\nDoctors told the Pratts that they were worried they might have to amputate her leg because of the extent of her injuries.\n\"She has a huge hole in her leg,\" Wesley Pratts said. \"She's just a little girl too. She's just a baby.\"\nPratts said he's still mourning the loss of his good friend, Jason Miranda, a 21-year-old aspiring rapper who was shot to death Tuesday in front of his 1-year-old son on Kirton Avenue near West 130th Street. Miranda went by the stage name Tito.\n\"He was like a little brother to me,\" Wesley Pratts said. \"This has been the worst week. First my little bro was shot, and now my daughter. It's been terrible.\"\nTo comment on this story, please visit our crime and courts comments section."}