{"uri": "http://www.nola.com/crime/index.ssf/2016/02/suspect_arrested_in_quadruple.html#incart_river_index", "title": "Suspect arrested in quadruple shooting at Marrero birthday party", "dct": "Tue, 01 Mar 2016 01:34:49 GMT", "id": "0a025c6e1ef93e4582f3c97615d35c8a", "content": "(JPSO)\nJefferson Parish Sheriff's Office detectives arrested a man accused of shooting up a Marrero birthday party, injuring four teenagers. Corey Ursin, 19, of 1013 Dimarco Drive, Marrero, was booked with aggravated second-degree battery, according to Col. John Fortunato, spokesman for the department.\nInvestigators are searching for a second, unidentified suspect in the case. No other details were available Monday (Feb. 29) about that suspect.\nThe shooting occurred at Chit Chat Event Hall, 5423 Lapalco Blvd., Marrero, around 11:30 p.m. on Feb. 13. About 25 teenagers were attending a birthday party for a 17-year-old at the second-floor reception facility when gunfire rang out, piercing the walls.\nThe Sheriff's Office Shotspotter system registered 20 to 30 gunshots, a report said.\nA 14-year-old suffered gunshot wounds to the back and neck. A 15-year-old suffered a gunshot wound to the right cheek, and another 15-year-old suffered a gunshot wound to the right knee. Outside, a 16-year-old standing on the balcony was shot in the leg, incident reports said.\nA witness spotted two men shooting at the business from the nearby intersection of Lapalco Boulevard and Manor Heights Drive. The men then drove off in a light-colored four-door sedan, the report said.\nInvestigators recovered 26 shell casings, 14 from a .40-caliber pistol and 12 from a 9mm pistol.\nNo information was available Monday about how detectives identified Ursin as a suspect in the case, but investigators obtained a warrant for his arrest. They took him into custody Friday (Feb. 26) at L.W. Higgins High School, 7201 Lapalco Blvd., Marrero, where he is a student, the report said.\nWhen arrested, investigators found Ursin with 20 bags of marijuana with a total weight of 11 grams, an arrest report said.\nIn addition to the aggravated battery charge, Ursin was booked with violation of drug laws and three outstanding attachments.\nUrsin was being held Monday at the Jefferson Parish Correctional Center in Gretna. Bond on all but one of the attachments was set at $112,000. Ursin was being held without bond on the third attachment.\n. . . . . . . .\nAnyone with information about this case is asked to call the Sheriff's Office investigations bureau at 504.364.5300. The public can also call Crimestoppers at 504.822.1111 or toll-free at 877.903.7867. Tips can be texted to C-R-I-M-E-S (274637); text TELLCS then the crime information. Callers or texters do not have to give their names or testify and can earn a $2,500 reward for information that leads to an indictment."}