{"uri": "http://www.mysanantonio.com/news/local/crime/article/SAPD-Scorned-lover-arrested-for-allegedly-9204087.php", "title": "SAPD: Scorned lover arrested for allegedly shooting at 5 people, including two children, in drive-by", "dct": "Mon, 05 Sep 2016 00:00:00 GMT", "id": "3505a2da907d59ab9b62943a9a1e490c", "content": "SAN ANTONIO — A 17-year-old man was arrested Saturday in connection to a drive-by shooting allegedly stemming from disputes involving a love triangle with one of the shooting victims, according to court documents released Monday.\nMichael Anthony Martin II faces numerous charges, including four second-degree felony counts of aggravated assault with a deadly weapon and a Class A misdemeanor count of unlawful carrying of a weapon. According to online jail records, Martin also faces a second-degree felony charge of burglary of a habitation by force and possession of marijuana, but those charges are not detailed in the court documents.\nRELATED: Two children, 8 and 15, shot while inside home during drive-by on East Side\nHe remains in custody on a $148,000 bond as of Monday afternoon.\nThe shooting occurred sometime before 8:35 p.m. Wednesday in the 2700 block of East Houston Street.\nInitially, the Express-News reported of two shooting victims, ages 8 and 15, who suffered non-life-threatening injuries following the shooting and were hospitalized. A 12-year-old family member was also inside the home, but was not injured, according to a previous report.\nAccording to the court documents obtained by mySA.com, Martin allegedly sat in the passenger seat of a gray Hyundai while holding an assault rifle and opened fire on two houses in the area.\nA fourth male victim, age 16, who was sitting on the porch with his mother at a second house involved in the shooting, told police he recognized the vehicle and the alleged gunman and fired back at the vehicle in self-defense. Nobody from the second house was injured in the shooting, the affidavit said.\nA previous mySA.com report states six shell casings were recovered at the scene and four weapons were found in the second home.\nThe 16-year-old boy told police he broke up with his ex-girlfriend a few months ago and she began dating Martin. When the ex-girlfriend broke up with Martin, she reportedly wanted to date the 16-year-old again, which is reportedly why the shooting occurred, according to the arrest document. The teen said Martin had allegedly shot at him a few weeks ago, but the document does not state if the teen filed a police report in connection to that incident.\nThe affidavit does not state if the person driving the vehicle was arrested or charged in connection to the shooting.\nIf convicted of the second-degree felony charges, Martin could face up to 20 years in prison for each charge. He could face additional prison time for the other felony and Class A misdemeanor charges, according to the Texas Penal Code.\nText \"NEWS\" to 72727 to sign up for breaking news from mySA\ntwhite@mysa.com"}