{"uri": "http://www.arkansasmatters.com/news/local-news/17-year-old-shot-dead-by-police-in-benton", "title": "17 Year Old Shot Dead by Police in Benton", "dct": "Mon, 17 Oct 2016 22:34:00 GMT", "id": "91f2627b8663661db7b7ac9214863d54", "content": "BENTON, Ark. - A 17-year-old boy was shot dead by police Monday morning after reportedly pointing a gun at an officer.\nAround 11:45 a.m. Monday, officers were called to the 1200 block of River Oaks Drive in Benton on a report of a family disturbance with a 17 year old armed with a handgun, according to a press release.\nFamily members and neighbors identified the teenager as Keegan Schweikle, a student at Harmony Grove.\nUpon arrival, officers were told Schweikle ran into a wooded area near the home. Police said multiple officers searched the area, concerned about the welfare of the suspect.\nAfter failing to comply with officer commands to drop the weapon, the press release states Schweikle pointed the handgun at an officer, which resulted in shots being fired by the officer. The suspect was pronounced dead at the scene.\n\"It's something that we hope and pray deep in our heart that never happens,\" said Capt. Kevin Russell at a press conference. \"And unfortunately, these situations do occur like this, grant it, very rarely. It's just one of those bad situations.\"\nA handgun that was in the suspect’s possession during the incident was located at the scene.\nAccording to family members, Schweikle was suicidal and did not want to hurt anyone. One family member called the officer's actions \"too anxious.\"\nCapt. Russell reported it was about 45 minutes from the time officers arrived to when the shots rang out. He confirmed no other weapons were used first to try to subdue Schweikle.\nPolice could not confirm how many times the teen was shot or if he was suicidal.\nPer departmental policy, the officer involved has been placed on administrative leave pending the outcome of the investigation.\nAccording to Capt. Russell, the department's last officer-involved shooting was two and a half weeks ago and resulted in the suspect's death. The one before that was two and a half years ago and did not result in a fatality.\nBenton police's CID will continue its investigation and additional details will be made available as it progresses."}