{"uri": "http://www.westword.com/news/lodo-shootings-outside-club-beta-white-party-4-vics-no-named-suspects-7117643", "title": "LoDo Shootings Outside Club Beta White Party: 4 Vics, No Named Suspects", "dct": "Tue, 08 Sep 2015 05:55:00 GMT", "id": "935520aaaafdf84d947ebf7b4191e5fb", "content": "On Friday, we posted on our Music blog about the 13th annual White Party, a bash sponsored by the venerable 3Deep Productions crew that was set to feature rapper Wale and attendees clad in white — hence the name of the gathering.\nFrom what we hear, the party itself, which got underway at Club Beta, 1909 Blake Street, on Sunday night, September 6, went off without a hitch.\nBut amid let-out during the wee hours of yesterday, September 7, shots rang out and four people were hurt. Their wounds were not life-threatening.\nAt this writing, no arrests have been made in the shootings, and the Denver Police Department hasn't released any information about possible suspects despite the prevalence of surveillance cameras in this very busy section of Lower Downtown.\nHere's an excerpt from our preview post, written by Addison Herron-Wheeler:\nDenver’s infamous White Party, which gets its name from the fashion rule about wearing white after Labor Day, celebrates its 13th anniversary this year with a star-studded line-up.\nThis year’s White Party, sponsored by 3Deep Productions and Ciroc, will take place as usual at Club Beta, on September 6, the night before Labor Day. To gain entry to the event, you must be decked out in your finest white club clothes. This party is a traditional marker of the end of summer, and the last big party of the season for Denver, so it usually generates quite a bit of hype.\nThis year should be no different, as the famed Wale, who rose to success around the turn of the century with his hit “Dig Dug,” will be acting as the party’s host....\n“I love seeing everyone come out to BETA in their all-white, ready to party,” says Francois Baptiste of 3Deep Productions. “We have the best deejays, the number 1 club in the country and an incredible host to push excitement over the top. Each year the party grows bigger and better and that shows that Denver knows how to push the envelope and create one huge night of fun.”\nThe photo shared by 3Deep that's on view atop this post shows attendees enjoying the sort of entertainment Baptiste promised.\nBut around 2:30 a.m., shots rang out and four people — three women and one man — were hit.\nCell-phone video shot by people in the vicinity captured images like this one....\n...as well as this striking, overhead view of the police response shot by Brian McCulley and aired by 7News.\nMcCulley told the station that law enforcers appeared to be looking into another shooting in the 18th and Arapahoe area and were surrounding a white SUV when the shots from near Club Beta rang out.\nThe initial Denver Police Department tweet about the shooting was issued at 2:51 a.m. on the 7th; it spoke about just two victims.\nLater in the day, however, the DPD put out this followup about the people shot.\nA number of vehicles were hit by gunfire during the incident.\nSo, too, was the window of The Wine Cellar LoDo:\nBut while the damage is clear, who inflicted it is not.\nIndeed, investigators have floated the possibility that multiple shooters may have been involved. Thus far, however, the cops have not issued any reports about a person or persons taken into custody.\nWhatever the case, the violence is the latest to raise concerns about safety in LoDo, particular during the let-out period.\nBelow, see reports about the shooting from Fox31, CBS4 and 7News."}