{"uri": "http://www.wbrc.com/story/32586914/coroner-ids-10-year-old-boy-shot-to-death-at-homewood-apartments", "title": "Homewood PD arrest, charge teen in 10-year-old boy's shooting death", "dct": "Mon, 01 Aug 2016 22:51:00 GMT", "id": "bb039c993834857cbabd951f8a1acf78", "content": "HOMEWOOD, AL (WBRC) -\nHomewood Police say they have arrested and charged a 16-year-old boy with reckless manslaughter in the shooting death of a 10-year-old.\nCenius Williams III will be tried as an adult, according to police. He is currently being transported to the Jefferson County Jail and will be booked on a $15,000 bond.\nAuthorities have also identified the 10-year-old boy who was shot and killed at an apartment complex.\nThe Jefferson County Coroner's Office confirmed that the boy's name is Jordan Gray.\nResponding officers found Gray suffering from a gunshot wound at Elevation Apartments (formerly known as Lakeshore Landing Apartments) around 11 p.m. on Sunday night, according to a news release from the Homewood Police Department.\nHe was transported to Children's of Alabama Hospital where he later died.\nRelated: Attorney: Teen suspect's family says shooting was 'terrible accident'\nJordan had been staying with his father for the summer at Elevation.\n\"Jordan was a kind little boy. He liked video games. He was just a sweet person. He wouldn't hurt anybody. He was a good child. He has a little brother that he watched out for. He was just a little boy, a good kid. We're going to miss him. He likes to play basketball. He likes to imitate Michael Jordan. He gave us no problems, really. He was just a sweet kind gentle soul,\" said Faith Jordan, Gray's grandmother.\nFaith Jordan says she has been told a teenage relative was playing with what he thought was an unloaded gun when Jordan walked in and was shot in the head.\nInvestigators are interviewing witnesses in the incident.\nAccording to court documents, Williams was arrested and charged June 28 with two counts of robbery first degree. Police say he robbed a woman at knife point on June 18. His bond in that case has been revoked due to these new charges. A preliminary hearing has been scheduled for September 14 in the armed robbery case.\nCopyright 2016 WBRC. All rights reserved."}