{"uri": "http://www.wsmv.com/story/33445827/sources-elementary-school-student-killed-in-hardeman-co", "title": "SOURCES: 2 detained in connection with murder of 13-year-old and father", "dct": "Fri, 21 Oct 2016 15:29:00 GMT", "id": "66141e522cc768e6ea076c77d0e19d07", "content": "Toone, TN (WMC) -\nA 13-year-old boy and his father were shot early Friday morning at a mobile home in Toone, Tennessee, which is in Hardeman County. Sources told WMC Action News 5 that two people have been detained in connection with this crime. The two were found Friday night at the Walmart in Bolivar.\nThe Tennessee Bureau of Investigation said no one has been charged with the crime at this time.\nTBI confirms Javarrie \"JoJo\" Robertson, a 13-year-old student of Toone Elementary School, and his father, Joe Dandrea \"Duke\" Robertson, 37, were found dead around 7:30 a.m. Two other children, a 5-year-old girl and a newborn, were also inside the home at the time of the shooting. Those two children were not injured.\nThe 13-year-old's life was taken just a few miles from the school he attended.\n\"There are individuals out there who took the lives of two individuals, including an innocent child. I think that certainly should be troubling for a community,\" TBI spokesman Josh Devine said. \"We want people to be on the lookout, if something doesn't seem right, if there is a problem, if something hits you in the pit of your stomach and you think it seems suspicious, call 1-800-TBI-FIND.\"\nJoe Duke's girlfriend lives in the home with them, but she was not home at the time of the murders.\nInvestigators said they are not speculating at this time about what the motive for the killings could be.\n\"It's far too early to speculate,\" Devine said. \"We certainly want to be very careful out of respect for family not to speculate about a possible motive.\"\nThe murder has shaken the close knit community.\nFamily members said Javarrie was a great student and overall good child.\n\"Smart. Honor roll student,\" Adrienne Jones, the victim's aunt, said. \"Very smart.\"\nAccording to Javarrie's teacher, Andreia Doyle, the child was recently named \"Best Dressed\" by his eighth grade class.\nFamily said Javarrie excelled in the sciences and loved playing sports and singing in his church choir.\n\"He was a lively spirit, he was bold, he was a lover of God and a lover of people, very respectful, smart,\" Jones said.\nIt's hard for Jones to fight past the anger of losing her great nephew.\n\"God allows things for reasons,\" Jones said. \"But, the flesh part of me says that he had so much more to give us and share with the world and that was just snatched away.\"\nShe said the boy's father, Joe, was well liked and a family centered individual.\n\"He was joyful. He was nice and kind and he was a family person,\" Jones said. \"I just don't understand what could have happened that this had to take place.\"\nJones said both victims had a lot left to give to the world, but the family will find a way to move forward with love.\n\"They both had so much to give,\" Jones said. \"We move on through the grace of God and through the strength of family and love for one another.\"\nSheena Robertson, a cousin to the family, said the child and his father did not deserve what happened to them.\n\"They were wonderful people like I said,\" Robertson said. \"They didn't deserve it. Wonderful people. We're not going to be able to sleep tonight worrying about it.\"\nFormer Mayor Willie Spencer attends church with the victims' family. He said Javarrie was a very bright student who got involved with a lot of activities at church, as well as being very active at school.\n\"He was a young man that was dropped off at his father's home, he lived with his mom,\" he said. \"She got word later that a shooting had taken place at the father's home and that [Javarrie] had been shot as well as the father...He had a real promising future and it's unfortunate that a senseless crime like this has taken place in our community.\"\nSpencer said even at such a young age, Javarrie was dedicated to his faith.\n\"He was just one of those children who was involved in everything going on in the church: children's ministry, he was involved,\" Spencer said. \"Saying speeches, singing, doing all sorts of things. So, he was just an ideal young man growing up in society.\"\nAccording to Spencer, the child was loved by everyone who knew him and was involved in sports.\n\"He was a great kid. Great kid. His mom raised him well,\" Spencer said. \"He was always outgoing, involved in sports at his school. He was loved by everyone.\"\nA large team of local and state investigators, including a violent crimes response team and forensic scientists, are at the mobile home where the crime happened on Naylor Road.\nDozens of people are at the crime scene, hugging one another.\n\"A lot of family members are here, they can be seen standing around right now, they know the family quite well. We're just here to be supportive,\" Spencer added.\n\"We don't have anyone in custody. We have not firmed up any sort of suspect description and that is why we urge anyone in the public with specific information that might help, even if it seems insignificant in your mind, it might be significant to us,\" Devine said.\n\"But to take the life of a young person is so senseless and uncalled for,\" Spencer said.\nStudents at Toone Elementary School were sad and left in shock at the news their classmate was murdered. Each student was given a note talking about the death of Javarrie and the tragedy left parents wondering what to tell their children.\n\"It's hard to explain at this age the finality of death and at this age you shouldn't have to,\" parent Cory Vann said.\nJavarrie was a member of the school's basketball team and had been at the school to play a basketball game Thursday night. But, the game never happened because the team they were playing didn't show up.\n\"We all rode together to the game,\" Kylan Beard, JoJo's friend, said. \"He was a good friend. He was there for me when I needed help. He, like, gives me a lot of good advice.\"\nBeard said the news devastated Javarrie's classmates and those at school.\n\"Everybody just started crying,\" Beard said.\nThe school is also providing grief counselors for the students.\nAlthough no information about possible suspects has been given by law enforcement, relatives said they believe whoever committed the crime knew the family.\nCopyright 2016 WMC Action News 5. All rights reserved."}