{"uri": "http://www.dailymail.co.uk/news/article-3250365/Elementary-school-funeral-remembers-four-children-killed-murder-suicide-South-Dakota-father-burnt-home-focus-state-audit.html", "title": "Classmates of four children whose father shot them dead and then set home on fire in murder-suicide say a tearful goodbye as they carry their coffins in funeral service", "dct": "Sat, 26 Sep 2015 22:04:00 GMT", "id": "5ee59392d3ed765d1231ee4f589ad8d1", "content": "Four children killed by their father in a murder-suicide where the family house was set on fire were remembered in funeral services on Saturday.\nMichael, Connor, Jaeci and Kailey Westerhuis were shot dead along with their mother Nicole, 41, before flames engulfed the home they shared near Platte, South Dakota, on September 17.\nHusband and father Scott Westerhuis, 41, who was also buried on Saturday, is believed to have killed his children and wife with a shotgun before he is thought to have turned the gun on himself.\nScroll down for video\nThe funeral ceremony for the children, who were 16, 14, 9 and 10, was held at the Platte-Geddes Elementary School gymnasium, according to the Argus Leader.\nClassmates carried the coffins of the youngsters in the service. Private services for Nicole Westerhuis will be held later.\nThe community of Platte, a town of 1,200 about 110 miles south of Sioux Falls, has been shaken by the act of violence.\nPlatte-Geddes School District released a statement saying it was 'deeply saddened' by the crime, and added that the Westerhuises were a 'big part' of life at the school.\nClasses at school were dismissed the day of the fire after news spread.\nThe two boys played football at Platte-Geddes High School, according to Keloland.com.\nBefore Friday's homecoming game a moment of silence was held before the game and balloons were released into the air on a celebratory day tinged with sadness.\nBeyond athletics, Michael was remembered for playing the trumpet and Connor was remembered for his prankster sense of humor.\nJaeci, who participated in sports and cheer, was remembered for her laugh and Kailey was remembered for giving the principal a hug every day.\nNeighbor Marcus King said that the Westerhuises were a 'nice family' and told KDLT 'it’s devastating. When you lose the whole family, all six of them. you can’t put your mind around it'.\nThe Charles Mix County Sheriff's Office and state investigators are looking into the exact circumstances of what happened at the house the morning of the fire and possible motives.\nBoth Scott and Nicole Westerhuis worked at an educational cooperative where the GEAR UP program to help Native Americans attend college was being audited by the state Department of Education.\nScott Westerhuis had reportedly been the focus of the audit, according to KOTATV, and he had recently been stripped of a $4.3million contract.\nDocuments show that Scott was listed as CFO and Nicole was listed as business manager of two organizations that GEAR UP gave $2million to, according to the Associated Press.\nInvestigators are looking through the company and business manager's financial records, as well as what is left in the family home.\nThe National Suicide Prevention Lifeline is 1 (800) 273-8255"}