{"uri": "http://savannahnow.com/news/2014-12-04/police-teen-shot-savannah-thursday-night", "title": "UPDATE: Savannah teen dies after being shot Thursday night", "dct": "Thu, 04 Dec 2014 23:33:00 GMT", "id": "5263613f71f493d7a1664b84bf7acc40", "content": "Today, Violent Crimes detectives of Savannah-Chatham police department are investigating a Thursday night shooting that claimed the life of a Savannah teenager.\nAbout 10:32 p.m., metro responded to a shooting on the 600 block West 54th Street, said Eunicia Baker, police spokeswoman. Responding officers discovered that 15-year-old Jamari Batts, of Madison Apartments, had been shot.\nIn critical condition, Jamari was transported by ambulance to Memorial University Medical Center, where he died today.\nThis investigation continues. Anyone with information on the case is asked to call Crimestoppers at 912-234-2020 or text CRIMES (274637) using the keyword CSTOP2020. Tipsters remain anonymous and may qualify for a cash reward.\nA confidential tip line also is open directly to investigators at 912-525-3124.\nFrom Thursday evening:\nPolice say a teenager was hospitalized after being shot Thursday night in Savannah.\nOfficers were called to Madison Apartments on West 54th Street just after 10:30 p.m., where they found a male in his mid-teens suffering from a gunshot wound, said Julian Miller, Savannah-Chatham police spokesman.\nThe shooting victim, who lives at the complex, was taken to Memorial University Medical Center with injuries police believed to be potentially serious.\nThe shooting occurred outside an apartment, Miller said, and police are asking witnesses to come forward. A large crowd was in the area immediately following the shooting, Miller said.\nA heavy police presence was at the complex, including members of a task force and state troopers assisting metro officers.\nDetectives were on scene late Thursday as the investigation was getting underway.\nNo further information was immediately available.\nEarlier Thursday, about 6:45 p.m., police said three people were shot on Savannah's eastside.\nOfficers were called to East Bolton Street near Ash Street, where they found two males suffering from gunshot wounds, Miller said.\nAbout the same time, a woman suffering from gunshot wounds arrived at Memorial via private vehicle, Miller said. The extent of the shooting victims’ injuries was not immediately known.\nMiller said many people were in the area when shots were fired, and police are asking people to come forward with information.\nAnyone with information that can help police is asked to call CrimeStoppers at 912-234-2020 or text CRIMES (274637) using the keyword CSTOP2020. Tipsters remain anonymous and may qualify for a cash reward.\nA confidential tip line also is open directly to investigators at 912-525-3124."}