{"uri": "http://www.silive.com/northshore/index.ssf/2015/07/second_teen_charged_with_attem.html#incart_river", "title": "2nd teen accused of attempted murder in a.m. shooting", "dct": "Sat, 11 Jul 2015 14:06:00 GMT", "id": "67a7ad8494a801734ad3d80710ed4d6f", "content": "STATEN ISLAND, N.Y. -- A second Stapleton teenager has been charged with attempted murder and other crimes arising from the shooting and wounding of a man during an alleged robbery last month in his community.\nShane DeGroat, 18, was linked to the violent June 17 incident after cops busted him Wednesday for an alleged mugging that morning in Tompkinsville.\nIn the earlier episode, DeGroat and Destin Burks, 17, also of Stapleton, approached the victim and another man as they sat on a stoop on Sands Street at about 5:10 a.m., according to authorities.\nBurks pointed a gun at the two men and demanded, \"Give me everything you got,\" according to a criminal complaint.\nDeGroat then punched one man in the face, and that's' when the other victim, a 29-year-old man, made a grab for the gun, police said. A police source familiar with the case said the victim didn't believe the weapon was real.\nBurks and the man struggled, and the gun went off, grazing the top of the victim's head, police allege. As Burks fled, he opened fire, hitting the 29-year-old in the right hip and left inner thigh, police said.\nThe defendants snatched a cell phone and cash from both victims, said the complaint.\nAuthorities said the victim survived.\nBurks was arrested two days after the incident and charged with attempted second-degree murder, multiple counts of robbery and assault and other crimes, according to information from Acting District Attorney Daniel Master's office.\nHis case is pending in Stapleton Criminal Court.\nDeGroat was also charged with attempted murder, robbery, assault and criminal weapon possession.\nWith regard to Wednesday's episode, DeGroat approached a woman at 10:15 a.m. outside 54 Victory Blvd, Tompkinsville, said a criminal complaint.\nHe pushed the victim against a wall, punched her in the chest and snatched a gold chain from her neck, the complaint said.\nThe defendant was arrested about 15 minutes later at a nearby location after two men grabbed him and held him, said police.\nDeGroat was charged with felony counts of robbery and grand larceny, said prosecutors. He's also accused of misdemeanor counts of assault, stolen-property possession and petit larceny."}