{"uri": "http://heavy.com/news/2016/09/arcan-cetin-cascade-mall-burlington-washington-shooting-suspect-shooter-name/", "title": "Arcan Cetin: 5 Fast Facts You Need to Know", "dct": "Mon, 26 Sep 2016 17:46:00 GMT", "id": "07ad07c7f207a7c60eb8711c5ec23c1e", "content": "The man accused of killing five people inside a Washington state shopping mall has been named as Arcan Cetin. A gunman opened fire inside about 7 p.m. September 23 at a Macy’s store at the Cascade Mall in Burlington, Washington, police say.\nCetin, 20, is a native of Turkey but is now a legal resident of the United States.\nThe gunman fled the scene before police arrived and remained at large for 24 hours after the shooting.\nThe fatal victims have been described as four females — ranking in ages from 16 to 95 — and one male.\nCetin was arrested without incident nearly 24 hours after the shooting in Oak Harbor, Washington, about 30 miles from Burlington.\nHere’s what we know so far:\n1. Cetin Was ‘Zombie Like’ When He Was Arrested\nLt. Chris Cammock of the Oak Harbor Police Department said at a press conference announcing Cetin’s arrest that the suspect was “kind of zombie-like” when he was taken into custody. He didn’t attempt to run from arresting officers. Officials had received numerous tips about the suspect. Lt. Michael Hawley of the Island County Sheriff’s Office added that shortly after he received a report that Cetin was close, Hawley found the suspect walking on the street.\nKIRO’s Gary Horcher reported during the search that someone identifying himself as the shooter has contacted police. The shooting began just after 7 p.m. inside one of the Macy’s stores in the mall, reports KOMO. A witness to the attack, Tari Caswell, told the Skagit Valley Herald about her experience during the incident saying, “I just stayed quiet in the dressing room because it just didn’t feel right. And it got very quiet. And then I heard a lady yelling for help, and a man came and got me and another lady, and we ran out of the store.”\nThe female victims were shot dead at Macy’s make-up desk. Authorities say that the suspect checked out the area before going back out to get a gun. KING 5’s Chris Ingalls reports that the weapon is thought to have been a .22 caliber hunting rifle. KING 5 reports that cops believe Cetin stole the guns he used from his father. That gun was recovered at the scene. Due to a prior arrest, Cetin had been prohibited from owning guns.\n2. The Gunman Allegedly Called Out a Woman’s Name Before Opening Fire\nWashington State Patrol Sgt. Mark Francis told the media that he couldn’t comment on reports that the gunman had called out a woman’s name before opening fire, according to Q13 Fox. The gunman was armed with what appeared to be a hunting rifle. KING 5 reports that Cetin’s ex-girlfriend previously worked at the mall.\nAt a press conference, Mount Vernon police Lt. Chris Cammock said, “I don’t know what his motivations were. I don’t know what his motivations were to do this. I don’t know what his motivations were to continue. I don’t know what his motivations were to stop.”\nOfficials declined to release a motive for the attack. Cammock added, “I’m not going to rule out anything at this point.” There is no apparent connection between Cetin and the victims of the shooting. Cetin appeared in court on September 26 and was charged with five counts of murder in the first degree. Bail was requested at $2 million.\n3. He Was Arrested on an Assault Charge in July 2015\nOnline records show that Cetin was arrested in July 2015 on charges of assault in the fourth degree. KIRO reports that as a result of the charges, Cetin was ordered to undergo mental health counselling that he completed in March 2016. During which time, he was ordered not to take drugs or drink alcohol. As of August 25, 2016, Cetin was found in compliance with the court order.\nThe New York Daily News reports that the victim in the assault was Cetin’s stepfather. That man said at the time that the suspect was “going through a hard time.” The newspaper adds that Cetin also had an arrest for drunk driving.\nInitial descriptions had described Cetin as being Hispanic. According to his Facebook page, Cetin is a native of Adana in Turkey. He’s a graduate of Oak Harbor High School, class of 2015. Cetin describes his nickname as “The Turk.” As of 2014, he was in a relationship. While in high school, Cetin was in ROTC.\nA classmate of Cetin’s from Oak Harbor High School, Uhlaine Finnigan, told the New York Times that the suspect was “suspect.” She added that he would “touch girls on their buttocks” by “either slapping or grabbing them.” Finnigan also said that:\nHe did that to girls of all grades at the high school including my best friend and I, regardless of the blatant disgust from the girls and being told to stop.\nA 2011 posting on his Facebook page from a friend referred to the suspect as “really annoying” and “sometimes really nasty,” though the friend also called Cetin as “funny.”\nWhile in 2012, another friend wrote, “Truth is: You are a very odd character. You were always going on about being Russian and stuff like that, but under that you really supported America (or so it seemed to me) and I always thought that was really cool.”\nCetin is an active Call of Duty player, even posting videos of himself playing the game to his YouTube channel.\n4. He Thinks That Governor Jay Inslee & President Obama’s Liberalism ‘Sounds Like Communism’\nIn response to a letter in the Whidbey News-Times in May 2013 praising President Obama and Washington Governor Jay Inslee, Cetin commented that the pair’s liberalism “sounds like Communism.” On his Twitter page, which hasn’t been updated since the summer of 2015, Cetin recommended Hillary Clinton and “Hitler’s wife” to be the new face of the ten dollar bill.\nA tweet of Cetin’s from January 2015 led some on social media to believe he was a supporter of Hillary Clinton’s. The message read, “We win I vote for Hillary Clinton.” Online records show no party affiliation in his voting history.\n5. One of the Victims Has Been Named as a 16-Year-Old Cancer Survivor; Another, a 95-Year-Old Woman\nThe Seattle Times reports that one of the victims has been named as 16-year-old cancer survivor Sarai Lara. She was a student at Mount Vernon High School. KIRO reports that she was with her father at the mall. He was outside smoking when the gunfire erupted, according to the station. Her classmates have hatched a plan to wear purple and pink in her honor on Monday, September 26. While Lara’s mother, told the Seattle Times, “It’s not fair what happened to her.”\nAnother of the victims has preliminarily been named as 52-year-old Shayla Martin who worked at the makeup desk in the Macy’s store. Her sister, Karen Van Horn, told the Seattle Times, “We’re having a really hard time.” Van Horn is an employee of The Herald newspaper in Everett, Washington. Van Horn told that newspaper that a witness had confirmed to the family that Martin had been killed. Van Horn said, “She was so sweet. She was just very independent. She wanted to make her own way. She didn’t want to rely on anyone else.”\nKIRO reports that two of the other victims are Belinda Glade, a probation officer, and her 95-year-old mother Beatrice Dotson. The Mayor of Burlington, Steve Sexton, referred to those lost as “treasured members” of the community.\nAccording to the Gun Violence Archive, this is the sixth mass shooting — meaning an incident with at least four victims — in 2016 in Washington. The last was in July 2016 when Allen Ivanov was accused of shooting three people dead at a college party in the town of Mukilteo."}