{"uri": "http://www.paysonroundup.com/news/2014/may/27/child-shot-dead-payson-apartment/", "title": "Report: Tragic Shooting Leaves Toddler Dead", "dct": "Wed, 28 May 2014 00:00:00 GMT", "id": "efdcf29a530c06577fe1819f5db32dfc", "content": "Police volunteers watch over a Pinecrest Apartment Tuesday afternoon after a 1.5-year-old child was shot.\nUpdate at 7 p.m.: Police confirmed tonight at a press conference that a 3-year-old boy shot his 18-month-old brother with a semi-automatic handgun he found in a 78-year-old family friend's apartment this afternoon. The children had been at the home for 10 to 15 minutes when they \"slipped into another room unobserved by the mother,\" said Police Chief Don Engler. As the mother entered the room, the gun reportedly went off. Police are still investigating and plan to search the apartment. The gun was not locked up at the time. No one has been charged.\nPolice are investigating a shooting at a Payson apartment Tuesday afternoon that left an 18-month-old dead.\nThe toddler was reportedly playing with a sibling around noon when they found a gun in a Pinecrest apartment, at 303 S. Ash Street.\nIt is unclear who pulled the trigger, but the toddler was shot in the head.\nPolice Chief Don Engler said it is too soon to say who shot the child or whom the gun belonged to and they were still interviewing the children’s mother and neighbors.\nThe toddler was taken to Payson Regional Medical Center and later pronounced dead.\nEngler said the gun was not from the children’s home, but a nearby apartment.\nSeveral adults were supervising the children at the time, but it is unclear where they where at the time the shooting took place, he said.\nA Payson Roundup newspaper deliverer had just pulled up to drop off the day’s paper when she heard cries coming from a lower level apartment.\nWhen paramedics arrived, she saw a hysterical woman carry a child wrapped in blankets out to them and sit down. A witness heard the paramedic driver tell the woman, “ma’am let me have him.”\nThe child looked like a “ragdoll,” the witness said.\nThe woman handed the child over and crews took it to the hospital. Battalion Chief Jim Rasmussen said when they initially arrived, the toddler had a pulse. On the way to the hospital, the child's heart stopped and paramedics started CPR.\nRead more in Friday's Roundup."}