{"uri": "http://abc7news.com/news/oakland-shooting-leaves-7-victims-wounded/1569019/", "title": "Oakland police search for suspects accused of shooting, injuring seven people", "dct": "Sun, 23 Oct 2016 00:00:00 GMT", "id": "ebfb2c17e728518b07aeec5b9959196b", "content": "EAST OAKLAND, Calif. (KGO) --\nOakland police officers responded to reports of a shooting that left seven people injured in East Oakland Saturday night.\nAround 11:45 p.m., officers responded to a report of a shooting in the 7700 block of Bancroft Avenue, a police dispatcher said.\nIt was a chaotic scene as police officers took cover behind squad cars after they said someone fired shots at them. \"It was crazy, I heard 15 to 20 shots,\" neighbor Kevin Lynn said.\nOPD officers take cover after shots fired at them in East Oakland overnight. Story 6p abc7news. pic.twitter.com/J3IYT1FGE6\n— Cbarnard (@CornellBarnard) October 24, 2016\nOfficers found victims, all between the ages of 27 and 45, suffering from gunshot wounds when they arrived at the scene.\nOfficials said all seven were taken to a nearby hospital.\nLynn said the original gunfire was coming from a house party off 78th Avenue. \"I think the violence needs to stop,\" Lynn said.\nSWAT team units moved slowly from door to door in search of the suspects accused of wounding citizens and firing gunshots at police.\n\"That's really sad, it's actually crazy,\" neighbor Elizabeth Yanez said.\nIt's the second time this year, Oakland police said they have been fired on.\nOn July 23, Oakland Police Department Sgt. Nadia Clark was injured from broken glass when someone fired a gunshot into her patrol car and missed. An arrest was made in the case.\nNeighbors said their safety is a constant worry 24 hours a day, seven days a week. \"There's too much violence around here, happening every single day,\" Yanez said.\nAll seven shooting victims are expected to survive. One of the victims is reportedly in critical condition and another has since been treated and released, according to a dispatcher.\nNo officers were injured in the shooting.\nPolice are investigating and are still searching for the shooting suspects.\nBay City News contributed to this story."}