{"uri": "http://www.sfgate.com/crime/article/Police-22-month-girl-shot-in-East-Oakland-10838293.php", "title": "Police: 22-month-old girl shot in East Oakland", "dct": "Thu, 05 Jan 2017 00:00:00 GMT", "id": "efa388b59b95db705c9dd33efc0b504c", "content": "Dawn, who declined to give her last name, said ‘everybody’s getting caught up in the crossfire’ following the shooting of a 22-month-old girl in East Oakland Thursday.\nA 22-month-old girl was wounded in a drive-by shooting in East Oakland on Thursday while riding in a car with her mother, police said.\nThe shooting happened around noon near the intersection of 66th and Outlook avenues in a quiet residential neighborhood in the hills overlooking the city, according to the Oakland Police Department. The mother was not injured in the shooting, police said.\nThe toddler was rushed to a hospital and was listed in stable condition, said Officer Johnna Watson, a spokeswoman for the Oakland Police Department. No arrests were reported following the shooting, and a motive remained under investigation, she said.\nOutside UCSF Benioff Children’s Hospital Oakland, where the girl was taken, Daryle Allums, a representative of Adamika Village, an Oakland antiviolence group, said he was acting as a spokesman for the family after speaking to her mother and praying for the “pretty little princess.”\nThe occupants of two other cars exchanged gunfire, and the girl and her mother’s car got caught up in the crossfire, Allums said. Outside the hospital, Watson said police are investigating that possibility.\nWatson said investigators are probing whether the shooting is “possible retaliation” to the slaying of a man Wednesday on Myrtle Street near 16th Street, the first homicide of the year in Oakland.\n“We are looking to see who the target was,” Watson said, adding that Oakland’s incoming police chief, Anne Kirkpatrick, has been briefed on the shooting. “It was a stray bullet that hit the little girl.”\nThe child was in the backseat of the vehicle in a car seat when the shots rang out, Allums said, at least one bullet piercing the car and hitting her. The girl’s “whole family,” grandmother included, was waiting at the hospital for news of her condition, he said.\nWatson said members of the Police Department visited the girl’s mother at the hospital to assure her they’d provide every possible resource, emphasizing they were investigating “aggressively.”\n“She’s fighting for her life right now,” Allums said of the girl.\nAn elderly woman who lives in the East Oakland neighborhood and declined to give her name said she heard four distinct rounds of gunfire just before noon, followed by a pause, then another four gunshots.\nStanding with her 3-year-old son, Tao, not far from the blocked-off crime scene, Clare Stanley, who also lives nearby, described the shooting of the child as “the most kind of awful you can imagine.”\nStanley said she also heard “four or five” gunshots, and then a brief pause, followed by another four or so shots in quick succession. She was inside her home when the shots rang out, she said, and heard a car peeling away right after.\nBurbank Preschool is just one block away on 65th and Outlook avenues, Stanley noted, making the danger gun violence poses to children in the neighborhood all the more real. A representative for the preschool said the school briefly locked down after the shooting, but soon reopened.\n“It’s a huge problem,” Stanley said. “It’s such a problem that it’s hard to know what the answer is because so many people own guns around here.”\nAnother man who lives nearby, David Dill, said he arrived home after the shooting to find a heavy police presence swirling around his typically “quiet neighborhood.”\nHe described the gun violence that all too often envelops parts of Oakland — including the 85 homicides recorded throughout the city in 2016 — as “disheartening” and “crazy.”\nAlready in 2017, Dill said, the shootings were hitting too close to his doorstep, “in my neighborhood.”\n“My heart goes out to her, you know,” Dill said of the wounded child. “It’s terrible. It makes no sense. There’s no reason for it.”\nKimberly Veklerov, Sarah Ravani and Michael Bodley are San Francisco Chronicle staff writers. Email: kveklerov@sfchronicle.com, sravani@sfchronicle.com, mbodley@sfchronicle.com Twitter: @kveklerov, @sarravani, @michael_bodley"}