{"uri": "http://www.thedailybeast.com/cheats/2017/01/06/sen-bill-nelson-identifies-fort-lauderdale-airport-shooter-esteban-santiago.html?via=desktop&source=copyurl", "title": "Ft. Lauderdale Gunman Esteban Santiago Was Being Prosecuted for Strangling His Girlfriend", "dct": "Sat, 07 Jan 2017 05:50:00 GMT", "id": "5846a8072b73c8f48283c02710c83e1e", "content": "Esteban Santiago was already facing charges for domestic violence when he allegedly opened fire Friday, killing five people and injuring more.\nEditor's Note: This story has been updated throughout.\nThe gunman who attacked Fort Lauderdale-Hollywood International Airport on Friday was being prosecuted on charges of domestic violence, The Daily Beast has learned.\nEsteban Santiago, 26, of Anchorage, Alaska, allegedly opened fire with a handgun at a baggage claim at the airport, killing five people and wounding eight others. After he ran out of bullets, witnesses reportedly said Santiago threw his gun to the ground and laid face down while he waited for officers. Santiago was taken into custody without incident.\nAccording to charging documents provided by the Anchorage prosecutor’s office to The Daily Beast, on January 10, 2016, Santiago verbally assaulted his then girlfriend, a 40-year old mother of one child from a previous marriage whom The Daily Beast is not naming, through a locked bathroom door, telling her to “Get the fuck out, bitch.” After he forced his way in by breaking down the door, he smacked her in the head and strangled her. By the time police arrived, Santiago had fled the scene.\nSantiago was arrested days later and released on the condition that he have no contact with the victim, but in February, Anchorage police found him at his girlfriend’s residence and he was charged for violating the conditions of his release. That case is still pending.\nAlaska court records show a criminal record under Santiago’s name for minor traffic infractions including operating a vehicle without insurance and a broken taillight. Records also show his landlord evicted him for non-payment of rent in February 2015.\nThe assault case was resolved in March when Santiago entered into a deferred prosecution agreement, an alternative to adjudication where prosecutors agreed to dismiss the charges in exchange for Esteban’s completion of requirements, the details of which are unknown. Anchorage municipal prosecutor Seneca Theno told The Daily Beast that the charges are unlikely to be dropped now, considering Santiago’s alleged attack in Florida.\nThe attack began after Santiago arrived at the airport on a flight that originated in Alaska. Broward County Commissioner Chip LaMarca wrote on Facebook that Santiago had checked a handgun in his luggage and retrieved it at the baggage claim. LaMarca added that Santiago loaded the gun in a bathroom then came out and opened fire. NBC News, citing law enforcement officials, confirmed LaMarca’s story.\nSantiago served in the U.S. military, first in the Puerto Rico Army National Guard in 2007, according to the Department of Defense. He was deployed to Iraq in April 2010 as a combat engineer and returned to the U.S. in early 2011. In November 2014, after moving to Alaska, he joined the Alaska National Guard.\nSantiago was given a general discharge from the military in August for “unsatisfactory performance,” a spokesperson for the Alaska National Guard told the Associated Press. Santiago went AWOL several times before he was kicked out.\nSantiago visited an FBI office in Anchorage in 2016, claiming voices were telling him to fight for ISIS, according to CBS News. Santiago also reportedly believed he was being controlled by the CIA to watch ISIS videos. Santiago’s brother said he had since been receiving psychological counseling.\nAccording to his aunt, Santiago became a father in September. More recently, he was hospitalized for two weeks.\n“Like a month ago, it was like he lost his mind,” Maria Luisa Ruiz of New Jersey told the Bergen Record newspaper. “He said he saw things.”\n—Additional reporting by Olivia Messer and Kimberly Dozier"}