{"uri": "http://miami.cbslocal.com/2017/01/07/victims-killed-in-airport-shooting-were-on-vacation/", "title": "Victims Killed In Airport Shooting Were On Vacation", "dct": "Sat, 07 Jan 2017 15:16:00 GMT", "id": "ebd38f314166889a00e51c0d25804a2b", "content": "FORT LAUDERDALE (CBSMiami) — As several survivors fight for their life, the identities of three victims killed by a gunman who opened fire on travelers at Ft. Lauderdale-Hollywood International Airport on Friday have been revealed.\nOlga Woltering, 84, a great grandmother, flew to South Florida with her husband, Ralph, to sail on a cruise, a CBS affiliate in Atlanta reported.\nRalph escaped unharmed as the shooting began at the Terminal 2 baggage claim. Olga was shot and killed.\nEsteban Santiago, 26, allegedly loaded his gun inside an airport bathroom and returned to baggage opening fire. Eleven people were struck and the shooting only stopped when the gunman ran out of bullets, police said.\nTerry Andres, 62, from Virginia Beach, was on vacation with his wife, reported The Miami Herald. He died inside the terminal.\nMichael Oehme, 57, and his wife Kari flew in from Omaha, Nebraska, for a cruise. He was killed and his wife was injured, according to Omaha TV station WOWT.\nSteve Frappier, 37, told The Miami Herald the laptop stuffed in his backpack stopped a bullet from hitting him in the back.\nThe aftermath revealed a grisly scene as disoriented passengers tried to digest what had just happened.\n“The casings were flying all around us,” said a woman in shock, as one traveler walked among the carnage taking video with a cellphone.\nBehind her, victims lay in pools of their own blood. Many appeared to have been hit in the head. Their loved ones huddled over them, helpless.\nStill, others stood around the baggage claim conveyor belt, as if seeing something familiar, like their luggage, could somehow normalize the situation.\nNormalcy was something Santiago seemed to be struggling to find, himself.\nThe FBI said he was evaluated for mental health issues in November 2016, talking about things like mind control and the government forcing him to watch ISIS videos.\nHis family revealed that a tour in Iraq tremendously affected him upon returning to the U.S., specifically an incident involving a bomb exploding around two friends.\n“Like a month ago, it was like he lost his mind,” his aunt, Maria Luisa Ruiz, told NorthJersey.com. “He said he saw things.”\nWitnesses described the shooter’s demeanor as calm as he paced up and down the baggage claim aisles without saying a word, firing a 9mm semi-automatic handgun.\nMoments later, when his two magazines were empty, he threw down his gun, surrendered peacefully and was taken into custody without police having to discharge their own weapons.\nStill in the hospital are three victims in critical condition. Three others were in good condition.\nJames joined the CBS4 News team in September 2015 as a Web Producer. He began his career with CBS Interactive in Ft. Lauderdale, helping to make CBSSports.com a leader in live scoring and news information. Through sports media, he found a roster...\nMore from James Amalino"}