{"uri": "http://www.postandcourier.com/article/20151222/PC16/151229852/suspect-charged-with-murder-after-park-circle-car-chase", "title": "Suspect charged with murder after Park Circle car chase", "dct": "Mon, 21 Dec 2015 00:00:00 GMT", "id": "53da6f96b8f18bb45e26f903850fd110", "content": "A suspect has been charged with murder after last month’s car chase that ended on Park Circle with a man dead and three others wounded.\nDaqjan Gilliard, 20, of St. Philip Street, was arrested Monday night and charged with murder and three counts of attempted murder, according to North Charleston police. Gilliard appeared in bond court Tuesday and was denied bail.\nAround 2:20 a.m. Nov. 22, residents reported seeing two vehicles speeding through neighborhoods near Park Circle with the occupants shooting at each other. They both crashed near the community center, the heart and social center of old North Charleston.\nOfficers found a red Dodge Charger riddled with bullet holes across from East Montague. Franklin Othell Williams Jr., 28, of Grove Street in Charleston, was dead in the front passenger seat. Another occupant was lying in the road with a leg wound.\nA Ford Edge was crashed near the ball field, with the doors open and spent shell casings inside. Officers said they found a rifle and a pistol the occupants dropped as they fled.\nInvestigators say it started when Gilliard and three other men in the Ford spotted the Charger at the Cheapway gas station on Dorchester Road and decided to exact retaliation on one of the occupants. They followed the Charger and opened fire with a rifle as it approached Park Circle, according to the arrest affidavit. Further details about the alleged motive have not been publicly released.\nGilliard is accused of fatally shooting Franklin Williams and wounding Adrian Williams, 25, of North Charleston; Quran Allen, 24, of Harleyville; and Montez Capers, age and address not given.\nGilliard was arrested without incident about 7:40 p.m. Monday at his apartment on St. Philip Street, according to the incident report. Officers confiscated two cellphones in his possession, according to the report. He is being held in the Charleston County jail.\nIn June 2014, Gilliard pleaded guilty to distribution of cocaine base and was given a year’s probation, according to Charleston County court records.\nHe’s also suspected of carrying a weapon on school property and possessing drugs with the intent to distribute in connection with an October arrest by S.C. State University police, State Law Enforcement Division records show.\nThis is the second arrest in connection with the shootings. Allen was charged with obstruction of justice after investigators said he gave them several false and misleading statements about the events and his whereabouts. He was released from jail on $30,000 bail.\nChristina Elmore contributed to this report. Reach Dave Munday at 843-937-5553."}