{"uri": "http://www.postandcourier.com/article/20151124/PC16/151129652/deadly-north-charleston-shootout-was-act-of-x2018-retaliation-x2019-documents-say", "title": "Deadly North Charleston shootout was act of ‘retaliation,’ documents say", "dct": "Mon, 23 Nov 2015 00:00:00 GMT", "id": "547cbc739004dcaa063dd4f5ec6df0d0", "content": "A shootout Sunday that ended in North Charleston’s Park Circle with a man dead and three others wounded was an act of ‘retaliation,’ according to court papers filed Tuesday.\nThe motive was stated in arrest affidavits for Keith Lamont Evans, 21, of Mepkin Road in West Ashley. Evans appeared Tuesday for a bond hearing on a murder charge and three counts of attempted murder, but the presiding magistrate could not set bail by law.\nThe incident report released Monday by the North Charleston Police Department said that one person was killed and two others wounded in the shootout. The affidavits revealed that a third person also was wounded.\nAfter his arrest Monday night, Evans waived his right to remain silent and gave his version of what happened, the affidavits stated. It went like this:\nHe and two other men, who were not named in the paperwork but were called co-defendants, were riding in a Ford Edge after 2 a.m. Sunday when they noticed a red Dodge Charger outside the Cheapway gas station at 3615 Dorchester Road. They parked across the street at the Charleston Grand Hotel and waited for the Dodge to leave the gas station so they could exact “retaliation” on one of the occupants. The affidavits provided no further explanation of the motive.\nThe men followed the Dodge onto westbound Interstate 26 and then Montague Avenue. An off-duty police officer said he heard the occupants shooting at each other as they went by him at the Waffle House near the interstate. Several residents also said they heard gunshots as the cars went past.\nAs the cars neared Park Circle, the men in the Ford opened fire with a rifle. Both cars crashed and the men in the Ford took off running.\nPolice found Franklin Othell Williams Jr., 28, of Grove Street in Charleston dead inside the Charger, the passenger’s side riddled with bullet holes.\nAdrian Isaac Williams, 25, of Delta Street in North Charleston was lying in the street with a serious leg wound.\nQuran Kahlif Allen, 24, of Pat Street in Harleyville turned up later with an arm wound. He was charged with obstruction of justice after detectives said he gave false information and was released from jail on $30,000 bail.\nMontez Capers, whose age and address were not immediately available, was shot in the left arm, according to the affidavits.\nOfficers said they found three cellphones inside the wrecked Ford, and one of them belonged to Evans. Police said they also recovered a rifle and two stolen pistols that were dropped as the men ran from the scene.\nReach Dave Munday at 843-937-5553."}