{"uri": "http://www.mlive.com/news/detroit/index.ssf/2015/01/dad_who_left_teens_alone_to_ge.html", "title": "Dad who left teens alone to get pizza arraigned after 13-year-old killed in accidental shooting", "dct": "Fri, 30 Jan 2015 12:21:00 GMT", "id": "f53e9e0a369f649d3326165f025e4a81", "content": "(DPD)\nDETROIT, MI -- A father was arraigned Thursday on several charges including involuntary manslaughter after he left a group of teenagers and small children at home without an adult Tuesday, returning to find his son's 13-year-old friend shot to death.\nWayne County Prosecutor Kym Worthy on Friday said Ivan Berrien, 45, was arraigned before a 36th District Judge who set a $275,000 bond and ordered the Detroit man not to purchase or possess a gun.\nBerrien was also charged with second-degree child abuse, felony in possession of a firearm and felony firearm, according to the prosecutor's office.\nThe man left his 14-year-old son, a 13-year-old girl and three other children between 5 and 7 years old without adult supervision at his east-side home on Lappin Street around 4:40 p.m. Tuesday, according to Worthy's office.\n\"It is alleged that when Berrien left to pick up a pizza, the 14-year-old son got his father's rifle from the bedroom,\" the prosecutor's office announced. \"While the son and the girl were playing it when discharged fatally striking her in the head. The police were called and a medic pronounced the girl dead at the scene.\"\nThe father is due back in court Feb. 5 for a probable cause hearing and Feb. 11 for a preliminary examination.\nSeveral other Detroit children have been killed in accidental shootings over the last few months.\nA 10-year-old boy died Dec. 29 after being shot in the face while playing with cousins unsupervised in the basement of a home on Roxbury Street near Britain Avenue.\nLess than a week prior, 16-year-old Bernard Walker died of a gunshot to the head while his friend, 19-year-old Dwayne Sharper Jr., was handling a stolen gun inside a Virginia Park Street home on Christmas Day.\nAnd a 9-year-old boy, while playing with two other children, 13 and 10, died of an accidental gunshot wound when he found an unsecured gun in November.\n\"The message simply is not getting through that children can't be in a (home) with an unsecured gun,\" said Worthy in a statement."}