{"uri": "http://www.semissourian.com/story/2368547.html", "title": "Funeral held for teen killed in possible accidental shooting", "dct": "Wed, 14 Dec 2016 00:00:00 GMT", "id": "1b85057652bed57beb9c3ade2e61f00b", "content": "About 100 people attended Cole Kirkpatrick's funeral Tuesday afternoon at Scott County Central High School, and most of them hugged Kirkpatrick's parents before leaving the service.\nKirkpatrick, 19, of Vanduser, Missouri, was killed Thursday by a gunshot wound to the head inflicted by a friend from Sikeston, Missouri. Police say the gunshot might have been accidental.\nKevin Coffee, associate pastor of Lynwood Baptist in Cape Girardeau, spoke to begin the service.\nHe said Kirkpatrick had dedicated himself to religion in the past few years.\n\"[You grieve] over the loss of someone who was loved and who was cherished. Over the loss of someone who had a direction, a pathway in their life that was good and honorable, there's a void there among his friends, teachers and his family,\" Coffee said.\n\"So really what we're left with is this question: Why? Why did this happen to such a young man who was full of life and full of love and full of the future? ... When we realize that we're not going to understand the why, when there's not a satisfactory answer to why this 19-year-old life was cut so short and so tragically and so suddenly, without the opportunity to say goodbye, without the opportunity to say for a moment, 'I love you; you're important to me,' the other question is: Can God be trusted? If this pain is so real in my life, if this act is ... so unexplainable, how can we trust God?\n\"To that question I do have an answer. ... First of all, it was God who first gave us the blessing that was Cole Kirkpatrick. ... The fact that we're here today mourning the loss of Cole shows that he had a special place in our heart that was filled by Cole. The fact that he was in our life was a gift of God's grace. ... If we go back to the fact that Cole was a gift to us, we can see there a hint to the goodness of God.\"\nSean L. Thomas, 18, of Sikeston called police dispatchers Thursday night, saying he had shot his friend accidentally, according to a probable-cause statement filed in the case.\nThe Scott County Prosecuting Attorney's Office charged Thomas with involuntary manslaughter and armed criminal action.\nThomas had graduated from Scott County Central High School last year, and Kirkpatrick was set to graduate at the end of the 2016-2017 school year, principal John-Mark Jones said.\nOn top of Kirkpatrick's casket were several sets of clothes, including a graduation cap and gown he would have worn.\nScott County Central did not have school Tuesday because of Kirkpatrick's funeral, Jones said.\nIn front of the casket were several pictures of Kirkpatrick, one of which was him playing electric guitar, with his hair flying in front of him.\nTwo electric guitar players provided music for the service: a version of \"Somewhere Over the Rainbow\" and a long, somber version of Pink Floyd's \"Time\" that played while his parents, Matt and Kim Kirkpatrick, hugged many of his classmates.\nIn a last-minute change, Kirkpatrick's aunt read a poem, \"You Are My I Love You,\" by Maryann Cusimano.\n\"I am your parent, you are my child,\" she read. \"I am your night time, you are my sunshine. I am your lullaby, you are my peek-a-boo. I am your kiss goodnight, you are my I love you.\"\nPertinent address: 20794 US Highway 61, Sikeston, MO"}