{"uri": "http://www.walb.com/story/26749612/police-identify-victims-in-roanoke-street-quadruple-shooting", "title": "Police identify victims in Roanoke Street quadruple shooting", "dct": "Thu, 09 Oct 2014 22:21:00 GMT", "id": "874cbf76e85bb4e7d8939cb653af057f", "content": "RICHMOND, VA (WWBT) - Richmond Police detectives have identified the four individuals found shot to death in a domestic-related incident Wednesday night in south Richmond.\nWhen they arrived at the scene around 8:20 p.m. Wednesday, officers found Adreena D. Gary, 19, of the 4000 block of Midlothian Turnpike, shot outside the front door of the residence at 100 E. Roanoke St. Police said she died at the scene.\nInside the home, officers found Michelle S. Kelly, 22, and Keytrell Kelly, 2, both of the 1800 block of Southlawn Avenue; and Traymont B. Burton, 21, who lived at the residence where the shooting occurred. All three suffered gunshot wounds and died at the scene, police said.\nAccording to police, Burton and Michelle Kelly were ex-romantic partners and parents of Keytrell. Gray was a friend of Michelle Kelly.\nBased on detectives' investigation, they have determined that Burton shot all three individuals before turning the gun on himself.\n\"Everyone who knows 'Dreeny' knows how great she is. She's a helpful person, and apparently that's what she was doing tonight is trying to help a friend,\" Adreena Gary's sister Claryce Gary said Wednesday night. \"I know there will be no justice. There can't be, and that's what makes it so hard.\"\nIn the light of day, neighbors are still trying to figure how something like this could happen.\n\"It's just devastating, I mean every family has issues but you just don't know to what extent it goes,\" neighbor Chantell Woolridge said.\nWoolridge says she can't help but play \"what if\" in her head.\n\"It's just shocking, and the lady used to keep my kids. And the thought in my mind is, what if my kids were there?\"\nCopyright 2014 WWBT NBC12. All rights reserved."}