{"uri": "http://www.nbclosangeles.com/news/local/Man-Charged-With-Murder-in-Series-of-Shootings-272790231.html", "title": "San Fernando Valley \"Serial Killer\" Charged With Murder in Series of Random Shootings", "dct": "NODATE", "id": "1173d73b88323768c95870de4466e172", "content": "A suspected \"serial killer\" from the San Fernando Valley was charged with murder and attempted murder Tuesday after randomly gunning down four people and wounding three others over five days, authorities said.\nAlexander Hernandez, 34, was charged in the fatal shooting of a man in Pacoima on Thursday and the shooting of a couple in West Hollywood on Friday, the Los Angeles County District Attorney's Office said.\nHernandez is not charged in the other attacks. Investigators said they were building a case to bring more charges against Hernandez.\n\"This man was and is a serial killer,\" said Los Angeles County Sheriff's Chief of Detectives Bill McSweeney.\nInvestigators said Hernandez was the sole suspect in a string of shootings that started Wednesday morning when a 42-year-old employee of the city of Glendale was struck by gunfire as she was getting off the 5 Freeway in Atwater Village. She suffered life-threatening injuries, police said.\nThe next morning, Hernandez allegedly shot and killed Gildardo Morales, 48, as the victim was driving his pickup truck to work in Pacoima.\nOn Friday night, Hernandez opened fire on a husband and wife who were in their pickup truck in West Hollywood, prosecutors said. The couple was able to flee uninjured.\nThe following day, Hernandez allegedly shot three dogs in Pacoima, killing two and injuring one.\nOn Sunday, three people, including two women waiting to go to church, were killed and several others were wounded in separate shootings that happened in a span of 55 minutes and within a 5-mile radius in the San Fernando Valley. The victims included a family of five who were all struck by gunfire as they drove to morning mass.\nHernandez was taken into custody later that night on an animal cruelty charge after an hours-long standoff with SWAT. Police said he was in possession of a pistol-grip shotgun that they believe was used in the attacks.\nThe gunman's tan or gold SUV was tied to the shootings, investigators said.\n\"This is an individual that was out randomly shooting people,\" said Deputy Chief Kirk Albanese of the Los Angeles Police Department. \"As crazy as that sounds, that's what happened. I don’t know what his motive may have been.\"\nProsecutors said Hernandez, a documented gang member from Sylmar, is charged with one count of murder with the special circumstance of shooting at an occupied vehicle, two counts of attempted murder, one count of shooting at an occupied vehicle and three counts of animal cruelty.\nHe also is charged with two counts of discharge of a firearm with gross negligence, one count of possession of a firearm by a felon and possession of ammunition.\nThe special circumstance of a drive-by shooting could make Hernandez eligible for the death penalty, prosecutors said.\nHernandez is scheduled to be arraigned Wednesday. He was jailed on a no-bail hold.\nAlbanese said more charges were expected against Hernandez as soon as the next several days.\nIt was not immediately clear if Hernandez had a lawyer."}