{"uri": "http://www.indystar.com/story/news/crime/2015/11/17/three-charged-after-dice-game-turns-deadly/75929968/", "title": "Three charged after dice game turns deadly", "dct": "Tue, 17 Nov 2015 00:00:00 GMT", "id": "25346776aacff1313c2f9400919c2c81", "content": "A 19-year-old man had just won $800 in a dice game with some friends and acquaintances, when one man hit him in the head, and began shooting, a probable cause affidavit says.\nThe teenager crawled to a couch, found a cell phone and called 911. He survived.\nAnother 24-year-old man was spared because he hid in a bathtub. Both suffered multiple, nonfatal gunshot wounds.\nTwo of their friends were killed though in yet another incident of gun violence, keeping this year on pace to surpass the criminal homicide rate of 2014, the deadliest year in nearly a decade.\nSo far this year, the city has racked up 131 criminal homicides, four less than the 135 killings tallied last year.\nMarion County prosecutors on Friday charged three men with multiple felonies in connection with the shooting that killed two men — 22-year-old Thomas Stewart and 24-year-old Jonte Johnson — and injured two others.\nDontae Shields, 26, Clarence Sanders, 52, and David Sanders, 26, are facing a slew of felonies, including two counts of murder, robbery, attempted robbery and unlawful possession of a firearm by a felon.\nThe men who survived the shootings told police they, along with Stewart and Johnson, were shooting dice at a residence in the 400 block of North Beville Avenue, when Shields and the two Sanders arrived and asked to join the game, court documents said.\nAfter one of the men began raking in cash, though, one of the shooters struck him and fired shots at the group, the probable cause affidavit alleges.\nThe three alleged shooters took cash and gym shoes from the men, the affidavit says.\nShields is held in the Marion County Jail on suspicion of murder. Police have secured arrest warrants for David Sanders and Clarence Sanders.\nCall Star reporter Madeline Buckley at (317) 444-6083. Follow her on Twitter: @Mabuckley88."}