{"uri": "http://wishtv.com/2015/11/09/4-people-shot-in-indy-police-search-for-shooter/", "title": "IMPD: 4 shot in apparent dice game gone bad", "dct": "Mon, 09 Nov 2015 03:22:00 GMT", "id": "56772d7d07f364504370d725695636be", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nINDIANAPOLIS (WISH) — Two people died and two people were critically injured in a shooting early Monday morning in Indianapolis, officials with IMPD confirmed.\nThe shooting happened in the 400 block of North Beville Avenue, which is on the city’s east side. The call came in just before 3 a.m.\nAccording to IMPD, the victims of the shooting are adult males and were the only ones at the home at the time of the shooting.\nThe deceased victims have been identified as 22-year-old Thomas Stewart and 24-year-old Jonte Johnson.\nDetectives found dice and money scattered throughout the house. They said it appears people were gambling in the home when shots were fired by the suspect or suspects. Officials added robbery appears to be the motive.\nOfficers called it a very “cluttered” scene and said they don’t believe the shooting was a random act. No suspect description was immediately released.\nThe two men transported to Sidney & Lois Eskenazi Hospital after the shooting were said to be in very critical condition.\n24 Hour News 8 reached out to IMPD and learned there were no previous reported run-ins at the house.\n“It’s sad to see, two people who had to lose their lives,” said resident Mark Croston.\nAccording to neighbors, a young family stayed in the home on the 400 block of North Beville. During that time there were no issues according to residents. Recently the family went on a trip out of town, and used someone to house sit at the house. It’s unclear if the victims were house sitting.\nPolice have not released any details about a possible suspect.\nCrime Stoppers is taking tips at 31-7262-TIPS (8477).\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}