{"uri": "http://www.heraldnet.com/news/everett-man-tells-police-he-accidentally-shot-killed-woman/", "title": "Everett man says he killed girlfriend while playing with gun", "dct": "Sat, 17 Dec 2016 08:09:00 GMT", "id": "5ed346b0fe82647d493ed816df671059", "content": "EVERETT — An Everett man told police he accidentally shot and killed his girlfriend Thursday night while playing with a gun he had found.\nThe 22-year-old was booked into the Snohomish County Jail for investigation of second-degree domestic-violence manslaughter. Police allege that he caused the death due to criminal negligence. It will be up to prosecutors to decide whether to file charges.\n“This investigation still is in its preliminary stages,” deputy prosecutor Nathan Sugg said in court Friday.\nA judge set bail at $100,000, citing the nature of the death and concerns about the man’s mental health.\nPublic defender Jennifer Bartlett requested a lower bail.\nThere was no intent to harm anyone, she said.\nThe identity of the victim, 19, was not made public Friday.\nThe shooting was reported to 911 about 10:30 p.m. Thursday. It happened at the couple’s apartment along Cleveland Avenue. The dispatcher overheard a man in the background saying he had dropped a gun and shot someone, and then the line disconnected. One of the roommates at the apartment called back moments later.\nThe roommates alleged that the man told them to get rid of the gun after the shooting and they refused.\nThe suspect told investigators he had found the .45 caliber semiautomatic pistol the day before on the ground along Rucker Avenue. He said he had been lying in bed that night and playing with the gun. He said he didn’t know that pressing the trigger and releasing the slide would cause it to fire.\nThe man is “completely unfamiliar with firearms,” officers wrote in the arrest report.\nHis girlfriend was shot once in the chest as she sat on the bed smoking a cigarette, he said.\nShe was taken to Providence Regional Medical Center Everett, where she succumbed to her injuries. The nature of her wound was consistent with what the man said happened, the report says.\nThe man has been in jail before.\nHe was charged in King County in 2013 with possessing a stolen car and attempting to elude police. He was accused in that case of driving off as a sheriff’s deputy tried to pull him over.\nHe told the deputy he was homeless and took the car from the Lynnwood park-and-ride.\nHe later pleaded guilty to car prowling and reckless driving. A jail sentence was suspended with credit for time served.\nHe also was ordered to work 240 hours of community service. He was back in court in May 2015 for not completing the community service. He told the judge he was planning to enter treatment.\nHis public defender on Friday noted that he has no felony convictions or history of violent crime. She invoked his right not to be questioned further by detectives.\nRikki King: 425-339-3449; rking@heraldnet.com. Twitter: @rikkiking."}