{"uri": "http://www.wsaw.com/content/news/Antigo-boy-4-in-ICU-after-accidental-shooting-401287045.html", "title": "Family of 4-year-old asks for prayers after shooting", "dct": "Tue, 15 Nov 2016 16:54:00 GMT", "id": "bb6eba8b2ee8f2aec08b7fdfb17659f1", "content": "ANTIGO, Wis. (WSAW) - A 4-year-old boy remains in intensive care after an accidental shooting at his home Nov. 10 in Antigo.\nMicah Zahringer is in stable condition Tuesday morning, according to a family member who said the boy is recovering from his injuries and surgery at a Marshfield hospital.\nIn a statement released to NewsChannel 7, the family also shared that Zahringer suffered major head trauma and has been “sedated to keep him from moving, so as not to further his injuries. Micah's vitals have been recently steady, which is really good news.”\nAntigo police said the shooting happened at approximately 6:20 p.m. Thursday and officers responded after getting a 911 call. The Langlade County Sheriff’s Department and EMS also responded to the home. The boy was taken by ambulance to Aspirus Langlade Hospital, then flown by medical helicopter to Marshfield.\nThe family said the 4-year-old found the firearm, presumed to be unloaded, “despite his parents’ best intentions.” Antigo police have not commented on the details preceding the shooting.\nZahringer’s family said two funds have been set up to help cover medical expenses and other costs, including transportation. Micah’s three, older siblings are staying with family.\n“We are also asking for people to be praying during this difficult time. Pray for healing for Micah, pray for comfort for [his family] and pray for wisdom for the doctors to make the best medical decisions that will help Micah heal. We also want to thank everyone who has already offered their assistance and has donated their time, money and meals.”\nThose wishing to donate can visit Go Fund Me or send donations directly to any Covantage Credit Union by directing them to “The Zahringer Family” benefit account."}