{"uri": "http://wric.com/2016/10/17/parents-organize-march-to-end-violence-after-2-children-shot-in-mosby-court/", "title": "11-year-old recounts being struck by random gunfire in weekend shooting", "dct": "Mon, 17 Oct 2016 17:27:00 GMT", "id": "59e556702bcaccab86c69849a822c900", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nRICHMOND, Va. (WRIC) — A local mother is calling for an end to the violence after two children were shot while on their way to the store in Richmond over the weekend.\nThe shooting occurred Saturday night in Mosby Court. We’re told 11-year-old Jalil Austin was visiting his grandmother to celebrate his performance in a football game earlier that day where he won MVP, was named Homecoming King and Offensive Player of the Year for his middle school team. Around 8 p.m., he was walking to the store with his 13-year-old uncle when shots rang out.\n“We were walking and a car pulled up made a U-turn and started shooting at us,” Austin told 8News, just hours after being released from the hospital Monday. “The bullets were going really fast. They were shooting everywhere and I just got hit.”\n“We were walking and a car pulled up made a U-turn and started shooting at us. The bullets were going really fast. They were shooting everywhere.”\nA bullet struck him in the leg.\n“I kept running,” Austin said. “I didn’t want to get shot again. I was running fast. I turned the corner and fell to the ground, then my uncle picked me up and carried me up the hill.”\nOne bullet also struck a 14-year-old girl in the back.\n“When we were in the hospital, we kept checking on each other,” Austin said. Surrounded by family and close friends on the sidelines at middle school football practice, Austin said he was shaken up by the random gunfire, but is not looking back.\n“I’m just going to keep practicing, working on my leg and get better for next year.”\n“I feel like no 11-year-old should experience getting shot,” Austin’s mother, Shavonne Brown, told 8News earlier on Monday. “No 13-year-old should have to experience saving his nephew’s life. My brother saved my baby. My brother picked my baby up and carried him to safety.”\n“Whoever did this to my baby doesn’t know how it feels. You don’t know my baby wakes up hollering for my brother to run faster.”\nWe’re told the 14-year-old girl was treated and released. Doctors released Austin on Monday, but his mother says her son is struggling to sleep through the nightmares.\n“Whoever did this to my baby doesn’t know how it feels,” Brown said. “You don’t know my baby wakes up hollering for my brother to run faster.”\nAustin’s stepfather, Justin Henao, said he had to break the news to his stepson that he can no longer do something he loves to do — play football — at least for the rest of the season.\n“Through the grace of God he’ll be able to walk again,” Henao said. “You got to prepare him mentally for this, you know? He’s a kid, he wants to do what all other kids are doing.”\nIn response to the shooting, people gathered Monday to march through Mosby Court calling for the community to put the guns down.\nTo help support Austin’s family as he recovers, click here.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nThis is a developing story. Stay with 8News online and on air for the latest updates.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}