{"uri": "http://www.cbs46.com/story/28178587/third-victim-in-habersham-county-shootings-identified?autostart=true", "title": "Third victim in Habersham County shootings identified", "dct": "Mon, 23 Feb 2015 19:48:00 GMT", "id": "5faf4da8f1ce071bb9cb14ce8230991d", "content": "HABERSHAM COUNTY, GA (CBS46) -\nA man shot and killed Sunday night in Habersham County has been identified.\nThe Georgia Bureau of Investigation identified him as Steve Singleton, 45.\nWhen deputies arrived at the home on Lower Pond Court, deputies saw a speeding car coming toward them.\nThe man, identified as Anthony Giaquinta, got out of the vehicle and ran into a wooded area. After a brief search, deputies continued to the house where the 911 call originated from.\nWhen Habersham County Sheriff Joey Terrell and Deputy Bill Zigan entered the garage, they found Kathy Giaquinta Smith dead.\nShortly thereafter, Anthony Giaquinta shot Terrell and Zigan. Terrell was shot once in the arm and Zigan was hit multiple times.\nTerrell and Zigan were able to return fire, ultimately leading to Anthony Giaquinta's death. The GBI said there was no evidence of a self-inflicted gunshot wound.\nPolice said the suspect was later found dead behind his home. During a search of the property, Singleton's body was found.\nSingleton and Kathy Giaquinta Smith were friends.\nAnthony and Kathy Giaquinta's 16-year-old daughter and her boyfriend were at home at the time and made the 911 call after seeing her father with a gun and hearing gunshots. Neither were injured.\nThe Giaquintas also have an 18-year-old daughter who is away at college.\nCBS46.com will have more information as it becomes available.\nCopyright 2015 WGCL-TV (Meredith Corporation). All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}