{"uri": "http://abc3340.com/news/local/illegal-deer-hunt-leads-to-accidental-shooting-death-of-south-alabama-woman", "title": "Illegal deer hunt leads to accidental shooting death of South Alabama woman", "dct": "NODATE", "id": "639b28e23d67ff160180199635381b5d", "content": "ESCAMBIA COUNTY, Ala. —\nA Flomaton woman died last week after being accidentally shot while hunting from a pickup truck in Escambia County, the Alabama Division of Wildlife and Freshwater Fisheries said Tuesday.\nWildlife law enforcement officials say 35-year-old Donna Loraine Martin suffered a fatal gunshot wound on Dec. 2 while on an illegal deer hunt with a Flomaton man, 31-year-old Shannon Heath Bell.\n\"According to a preliminary hunting accident report, Bell was pulling a rifle out of the vehicle, stock first, when it discharged, hitting Martin in the stomach,\" officials said in a release. \"She was taken to Brewton Hospital where she later died in surgery.\"\nBell has since been charged with hunting from a public road, hunting at night, hunting from motor vehicle and hunting without a permit.\nConservation Enforcement Officer David Smith said all of the charges against Bell pose \"serious threats to public safety.\"\n“This accident could have been prevented,” said Smith. \"Hunting is one of the safest outdoor activities you can participate in—if it’s done in compliance with the law and following all safety rules.”\nThe Escambia County Sheriff's Office the Division of Wildlife and Freshwater Fisheries are still investigating.\nHunting and fishing violations can be reported by calling 1-800-272-4263 (GAME).\nBasic hunter safety rules via www.outdooralabama.com:\nKeep the muzzle pointed in a safe direction at all times.\nTreat every firearm with the respect due a loaded gun.\nBe sure of your target and what is in front of it and beyond it.\nKeep your finger outside the trigger guard until ready to shoot.\nWear a blaze orange cap or vest\nUse a small flashlight during dimlight conditions to identify yourself as a human being"}