{"uri": "http://www.firstcoastnews.com/news/crime/police-two-gang-members-arrested-in-toddlers-slaying/76295917", "title": "Police: Two gang members arrested in toddler's slaying", "dct": "Fri, 11 Mar 2016 00:00:00 GMT", "id": "41abdbad1e99fe0511bb59a51366b1d6", "content": "JACKSONVILLE, Fla. -- Two people, including a teenager, have been arrested and charged in connection to the shooting death of a 22-month-old who authorities say was caught in the middle of gang-related gunfire, Jacksonville Sheriff Mike Williams announced Thursday.\nHenry Lee Hayes, 16, is charged as an adult with second-degree murder, two counts of first-degree attempted murder, discharging a firearm in public, possession of a firearm by a delinquent and shooting deadly missiles into a vehicle, according to his arrest report.\nD'Angelo Antwain Wilson, 23, is charged with possession of a firearm by a convicted felon and accessory after the fact to a capital felony in connection to the toddler's death, Williams told reporters at a news conference.\n“I won’t speak about things tactfully, but since the night of this shooting, there has been a lot of activity, not only focused on these gangs, but on different areas of town where gang activity is higher and more intense than other parts of the city,” said Williams. “With our partnership with the Mayor’s Office, to leverage those overtime hours, that has a direct impact in those neighborhoods.”\nThe 22-month-old child, Aiden McClendon, was shot and killed as he, his mother and grandmother sat in a car parked outside a Spearing Street residence near the Jacksonville Sports Complex on the evening of Jan. 29 when a white Toyota Corolla carrying three people pulled up and two people inside opened fire, according to JSO.\nSeveral rounds went into the car, but the toddler was the only one hit. He was rushed into surgery at UF Health Jacksonville where he was pronounced dead the next day.\nThe vehicle and gun used in the toddler's slaying have been recovered, according to the Sheriff's Office. At least one shooter remains at large, said Williams, who expects to make additional arrests in the near future.\nSheriff Williams said Thursday McClendon was not the intended target of the shooting, which was the product of an ongoing gang feud stemming from online rap videos.\nInstead, the sheriff said, the shooters were targeting the toddler's cousin, 19-year-old Reginald Williams, who's affiliated with one gang, which has an estimated 65 members, many of which are incarcerated. Authorities say the shooters are affiliated with a second street gang roughly 16 members strong.\nAt a news conference Thursday evening, McClendon's grandmother, Rhonda McDowell, said her family will stand by whatever punishment's meted out by the criminal justice system.\n\"I feel they took Aiden away from us, so whatever their punishment is, whatever the prosecutors decided... we're going to be fine with it,\" McDowell said.\nGarrett Pelican contributed to this report.\nAiden's grandmother: prayed for an arrest to be made @FCN2go pic.twitter.com/NmZjB6jR3e\n— Janny Rodriguez (@JRodriguezFCN) March 10, 2016\n(© 2017 WTLV)"}