{"uri": "http://www.news4jax.com/news/crime/jso-responds-to-an-undetermined-death-on-eastside", "title": "22-month-old shot on Eastside dies", "dct": "Fri, 29 Jan 2016 19:13:00 GMT", "id": "83b78fcf8571432b5ee8d1f75449a659", "content": "JACKSONVILLE, Fla. - A 22-month-old baby boy has died after being critically injured in a shooting on the Eastside, Friday night, according to the Jacksonville Sheriff's Office.\nAccording to the Jacksonville Sheriff's Office, a grandmother, mother and the baby boy were parked in front of a house on Spearing Street when an unidentified vehicle came by spraying bullets, leaving the baby critically injured.\nJSO Chief of Investigations Tom Hackney said the only person injured in the incident was the toddler, Aiden Michael McClendon.\n“The people responsible for this need to be off our streets,” Hackney said. “They don’t deserve to walk the same streets as you and I.”\nThe baby was taken to UF Health with life-threatening injuries and died Saturday morning.\nPolice said a white vehicle fled westbound on Albert Street with the suspects. JSO has not confirmed exactly how many suspects may be involved as it is still very early in the investigation.\nHackney indicated the shooting is gang-related and emphasized this type of behavior will not be tolerated.\nAuthorities do not believe the individuals in the car were the targets, but more so the people in the house. However, Hackney said it is still too early to confirm.\n“It’s no shock that gang and violence go together,” Hackney said. “The senseless nature of these killings continues to draw the attention of the public.”\nThe police chief said they still had a lot of evidence to process and witnesses to interview.\n“It can’t be done alone, we can’t do it by ourselves,” Hackney said. “When these things happen, people call, we’re counting on that. Evidence leads a lot of ways, but somebody picking up the phone always helps.”\nHackney appealed to the public to pick up the phone and call authorities if they had any information that could lead to a suspect.\nThe phone number to call for Crime Stoppers is 1-866-845-TIPS.\nCopyright 2016 by WJXT News4Jax - All rights reserved."}