{"uri": "http://jacksonville.com/news/crime/2016-01-29/story/1-life-threatening-condition-after-shooting-jacksonvilles-eastside?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+JacksonvillecomNews+%28Jacksonville+Local+News+%E2%80%93+Jacksonville.com+and", "title": "As violent 2016 continues, toddler's death unites Jacksonville police, faith leaders", "dct": "Fri, 29 Jan 2016 20:10:00 GMT", "id": "bebf5bb1d2d502641176d89d3741d6e5", "content": "A 22-month-old boy is dead after being shot multiple times while sitting inside a vehicle on Jacksonville’s Eastside Friday evening, according to the Jacksonville Sheriff’s Office.\nAiden Michael McClendon was shot once in the shoulder and multiple times in the abdomen just after 6 p.m. in a drive-by shooting in the 700 block of Spearing Street that left the car he was in and a nearby house sprayed with bullets, Chief Tom Hackney said.\nThe boy was admitted to a hospital in critical condition after the shooting and later died.\nInside the parked vehicle was the boy, his mother and his grandmother. However, Hackney said it appears the intended target was inside the house.\n“The senseless nature of this continues to draw attention,” Hackney said.\nThe toddler's killing has prompted city and faith leaders to gather Saturday in a joint news conference to address the ongoing violence plaguing Jacksonville. Mayor Lenny Curry and Sheriff Mike Williams will be joined by Bishop John Guns of St. Paul Missionary Baptist Church and Operation Save our Sons and Wyllie Hodges, the executive director of First Coast Crime Stoppers.\nThe news conference is scheduled for 4 p.m. at A. Phillip Randolph Park.\nFriday was another violent night in Jacksonville that saw five others shot and wounded.\nA shooting in the 1400 block of Mount Herman Street left a 60-year-old man and 17-year-old boy wounded at about 10 p.m. Police say one victim was inside a house and the other outside but investigators did not know the motive for the shooting.\nPolice said they were looking for two males in an older light-blue Honda Accord.\nTwo women were shot and wounded while inside a house in the 1100 block of Bunker Hill Boulevard at about 11:30. The Sheriff's Office said it did not know what motivated the shooting or have any information on possible suspects.\nPolice say a man is expected to survive after he was shot in the face during an armed robbery in the 200 block of Shortreed Street. The Sheriff's Office said the man was walking home at about 1:50 a.m. when two men approached in a dark car. The men exited the car and attempted to rob the victim, prompting a struggle that resulted in the victim being shot, according to police.\nAnyone with additional information regarding the incidents is asked to call the Sheriff’s Office at (904) 630-0500 or Crime Stoppers at (866) 845-TIPS."}