{"uri": "http://www.firstcoastnews.com/news/local/data/crime/no-charges-for-man-thought-to-be-connected-to-aiden-murder/285488453", "title": "Charge dropped for man thought to be connected to Aiden murder", "dct": "Mon, 01 Aug 2016 00:00:00 GMT", "id": "c14bbd1782dd97244a1a620310aa7b1b", "content": "JACKSONVILLE, Fla. -- The State's Attorney Office says a formal charge against D'angelo Wilson, in the case against a 22-month-old's murder, has been dropped.\nThe Attorney's Office told First Coast News after reviewing the evidence and the law, the State determined Wilson’s actions did not rise to the level of a prosecutorial offense.\nPolice said Aiden McClendon, was shot and killed as he, his mother and grandmother sat in a car parked outside a Spearing Street residence near the Jacksonville Sports Complex back on Jan. 29, 2016 when a white Toyota Corolla carrying three people pulled up and two people inside opened fire, according to JSO.\nHenry Lee Hayes, 16, was charged as an adult with second-degree murder, two counts of first-degree attempted murder, discharging a firearm in public, possession of a firearm by a delinquent and shooting deadly missiles into a vehicle, according to his arrest report.\nD'Angelo Antwain Wilson, 23, was charged with possession of a firearm by a convicted felon and accessory after the fact to a capital felony in connection to the toddler's death, but the second charge has since been dropped.\nSeveral rounds went into the car, but the toddler was the only one hit. He was rushed into surgery at UF Health Jacksonville where he was pronounced dead the next day.\nSheriff Williams said Thursday McClendon was not the intended target of the shooting, which was the product of an ongoing gang feud stemming from online rap videos.\nInstead, the sheriff said, the shooters were targeting the toddler's cousin, 19-year-old Reginald Williams, who's affiliated with one gang, which has an estimated 65 members, many of which are incarcerated. Authorities say the shooters are affiliated with a second street gang roughly 16 members strong.\nWilson was sentenced to 144 days in jail for a possession of a firearm by a convicted felon charge.\nThe State's Attorney Office says this is still an active investigation."}