{"uri": "http://www.nbcphiladelphia.com/news/local/Boy-Mother-Deadly-Burlington-County-Shooting-Tabernacle-283486611.html", "title": "Burlington County Mother Shot 3 Kids, Killing 2, Before Turning Gun on Herself: Police", "dct": "Sat, 22 Nov 2014 04:35:00 GMT", "id": "797ce897ee9e32fc2408c3aa97af8109", "content": "A Burlington County mother shot her three kids in her bedroom before shooting herself, New Jersey State Police revealed Friday afternoon.\n\"We believe with fair confidence that we know who committed the shootings,\" Capt. Stephen Jones.\n\"The victims were the children of the mother that was shot,\" said Capt. Geoff Noble.\nNoble characterized Jeaninne LePage as a suspect in the double homicide, attempted suicide inside a home on Holly Park Drive in Tabernacle, New Jersey Thursday morning.\n\"Jeaninne LePage is believed to have shot her three children then turned the gun on herself,\" said Noble.\nLePage and her children were all found in her bed around 9:15 a.m. Thursday. Police found the weapon — which has been in the family for a long time — close to LePage.\nEight-year-old Nadia Harriman and her 14-year-old brother, Nicholas Harriman, died, according to New Jersey State Police.\nAlexander Harriman, 11, remained in severely critical condition at Cooper University Hospital Friday, officials said. LePage, 44, also remained hospitalized at Cooper.\nNeighbors identified the victims Thursday, but authorities waited to confirm their names until they family members, including the children's father who was located in Maryland, were informed of the deaths.\nAnother relative who lives in the house found the victims around 9 a.m. and called for help.\n\"When police got there, they found a really horrific scene,’ said Jones. The victims were found in the same room and police believe they were shot with the same handgun, which was found at the scene.\"\nNeighbors said that LePage shared the bed with her children and was in financial troubles.\nInvestigators believe the shootings occurred sometime between 5 and 9 a.m.\nNine people live in the house. They have all been accounted for and were interviewed by police, who assured neighbors early in the investigation that there was no manhunt and no reason for anyone to feel threatened or alarmed.\nLePage tried to hide the shootings, according to police.\n\"A pillow was used to muffle the gunshot sounds, which we believe is why the other members of the house didn't hear the gunshots,\" said Noble.\nInvestigators said they will determine what charges LePage will face if she survives.\nThe shootings shock the quiet community.\nMembers of the community organized a candlelight vigil Thursday night at Tabernacle's Town Hall, located at 163 Carranza Rd. At the vigil, children remembered their classmates.\nStudents and staff at Seneca High School — where Nicholas attended — had a moment of silence for the family Friday morning. Grief counselors were also on hand at local schools Friday to talk with grieving students and staff.\nA trust fund was set up at PNC Bank under LePage-Harriman Memorial Fund."}