{"uri": "http://www.tulsaworld.com/news/crimewatch/brother-two-others-charged-with-murder-in-shooting-death-of/article_2dab319e-c6e0-551c-a876-573f511a5a27.html", "title": "Brother, two others charged with murder in shooting death of teen after attempted drive-by", "dct": "Thu, 01 Sep 2016 00:01:00 GMT", "id": "1b0742d792256ec5b286b0f4bf537d49", "content": "Related story: Two arrested in shooting death of teen after attempted drive-by; suspected shooter released\nThree men have been charged with first-degree murder in connection with an alleged attempt at a drive-by shooting that led to the death of a 17-year-old last week, according to court documents.\nProsecutors allege that Chrishun Marquiss Smith, Zaire Dequan Ross and Deonta Ramon Mullins, all 18, were attempting a drive-by shooting on the night of Aug. 23 in the 1600 block of South 125th East Avenue. But 17-year-old Marquiss Mullins, who was also participating in the drive-by, was fatally shot when a man they were shooting at shot back at the SUV they were in, according to Tulsa police homicide Sgt. Dave Walker.\nMarquiss Mullins and Deonta Mullins are brothers, Walker said. Deonta Mullins was driving the vehicle at the time of the shooting.\nThe three men were each charged with one count of first-degree murder and two counts of use of a vehicle in discharge of a weapon, according to court documents.\nRoss was additionally charged on one count of possessing a firearm after juvenile adjudication, court documents show.\nThe victim’s brother was interviewed on the night of the shooting, Walker said, but his name was withheld from the public as a suspect in the murder in concern for the suspect’s well-being, Walker said.\n“His brother was just killed,” Walker said. “We wanted to at least give him the benefit of the doubt. If we put him in jail he wouldn’t be able to attend the funeral, be with family, so it was just sort of a humanitarian type thing.”\nRoss and Smith were arrested and booked into the Tulsa Jail on Aug. 24 and are being held without bond, according to online jail records. Tulsa police have not received an arrest warrant for Deonta Mullins yet, Walker said."}