{"uri": "http://www.fox23.com/news/man-dies-after-east-tulsa-shooting/428645854", "title": "Tulsa police ID victim in latest homicide", "dct": "Wed, 24 Aug 2016 22:20:00 GMT", "id": "b1b372feaf1cb93e14b3074d6f58ef74", "content": "TULSA, Okla. - Quick facts:\nPolice said a man died after an east Tulsa shooting.\nTwo teens at the scene said someone opened fire on them\nA teen they were with was hit by the gunfire and died\nRoderick Harbin was brought in for questioning as a person of interest. He was later released.\nPolice responded to a shots fired call near 21st Street and South 129th East Avenue Tuesday evening, but didn't find a victim.\nLater, a teen in a silver SUV showed up at St.Francis hospital with a gunshot wound in his back. The victim died at the hospital\n#BREAKING @TulsaPolice on scene of homicide near 129th East Ave & 21st. Victim showed up at St. Francis. #FOX23 pic.twitter.com/8MBu6quHYd\n— Jonathan McCall (@JonathanMcCall) August 24, 2016\nPolice said a 16-year-old and a 19-year-old were walking down the street when someone drove by in a silver SUV and shot at them.\nThey were unharmed. Police said they found several shell casings in the area.\nSEE MORE: Tulsa police overwhelmed by string of recent homicides\nAfter investigation, police learned that Zaire Ross, 18, and Chrishun Smith, 18 were with the 17-year-old victim and his brother looking for someone who allegedly shot at Ross beforehand.\nThere, they allegedly opened fire on Cameron Bell, 19, and another person walking in a neighborhood near South 125th. The people walking fired back and hit the 17-year-old in the back.\n© 2017 Cox Media Group.\nPolice identified the victim as Marquis Mullins, 17. Mullins was a linebacker for the East Central High School football team.\n© 2017 Cox Media Group.\nThe high school plans to release balloons at halftime of their Friday football game.\nWATCH: Vigil held for Marquis Mullins\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nAccording to police, Ross, Smith and the victim had the victim's brother drive to Peary Elementary, where Ross hid their guns on school grounds before driving to St. Francis to drop off the victim.\nWATCH: Mayor Dewey Bartlett reacts to string a homicides in Tulsa this week:\nRoss and Smith were arrested for felony murder, claiming their actions by shooting at the two walking around caused the deadly shots fired at their car.\nTulsa police identified Roderick Harbin as a person of interest,.\nHarbin is a Cameron Bell's stepfather. Police said they want to know why Harbin opened fire.\nThey said he was not at his home when they searched the home to find evidence.\nHe later turned himself in Wednesday. Harbin was then released after questioning.\nHarbin told FOX23 his home was sprayed with bullets and that the suspects were trying to kill his stepson.\nHe said he went into protection mode and did what he had to in order to protect his family.\nFOX23 will continue to follow this story.\n---\n© 2017 Cox Media Group."}