{"uri": "http://mwnews.net/html/2014.html", "title": "Four Boscobel people receive Federal Indictments", "dct": "Mon, 13 Jan 2014 00:00:00 GMT", "id": "d33750b3595636839a19307b6008d61f", "content": "of an apparent drug overdose of Jordan Faulkner, 18 of Boscobel. An autopsy revealed that Jordan died of a morphine overdose.\nA yearlong investigation by the Boscobel Police, The Richland Iowa Grant Drug Task Force, and the Dept. of Justice, Division of Criminal Investigation has culminated in the arrests and Federal Indictments of:\nCraig D. Bellis, 33, Boscobel, WI\nMary E. Grant, 63, Boscobel\nBrent A. “Tony” Venglish, 46, Boscobel\nThomas A. Kussmaul, 24, Boscobel\nThe above individuals who are all charged with Distribution of controlled substance, Morphine, a scheduled II controlled substance.\nGrant, Venglish, Kussmaul, were arrested on 1-9-14 and transported to the U.S. Marshall’s office in Madison, WI to await their initial appearance. Bellis is currently in the Grant County Jail on unrelated charges.\nThis is an ongoing investigation with more charges expected. The Grant County Sheriff’s Office assisted in the arrests.\nApproximately 50 freight trains pass through Prairie du Chien, WI on a typical day, many are oil trains pulling 100 oil tanker cars. The sheer number of these shipments means that while the chance of a derailment and explosion is still unlikely, it is much more likely now than it was just a few years ago.\nConsidering that oil trains transit many small towns through Grant and Crawford Counties, Midwest News wanted to know if city planners and emergency personal have plans in place to deal with a train derailment and explosion. Midwest News talked with Crawford County Emergency Management Director Roger Martin See video.\nOn Sunday January 19, 2014 at approx. 3:30 p,m. Dispatch received a call of an ongoing domestic on Cyprus Lane in Bridgeport Township. As officers responded the information gathered was that a 36 year old male had gotten into an argument with his 34 year old wife at their rural Bridgeport home.\nDuring the argument and prior to officers arriving the 36 year old male had barricaded himself inside his bedroom with numerous weapons. Sheriff Deputies arrived and took the wife of the man along with their four children out of the home and to safety. The Crawford County Crisis Resolution Team (CRT) was activated. The team is made up of members of the Crawford County Sheriff Dept., Prairie du Chien Police Dept. and the Wisconsin State Patrol.\nThe home was surrounded by members of the CRT team, Crawford County Sheriff Deputies and Prairie du Chien Police Department officers.\nMyself, Prairie du Chien Police Chief Chad Abram and the two CRT Team leaders discussed our options in this situation said Sheriff McCullick. We decided based on the fact that the General Public was in no way threatened, and the man was confined to his bedroom we were going to secure the residence and wait him out, added McCullick.\nWe had constant voice contact with the subject and we were continually attempting to talk him out of the room. We made it as uncomfortable inside the home as we could, said McCullick and eventually he came out. At 3:15 a.m. almost 12 hours after the initial call came in, the 36 year old man placed his gun outside the bedroom and walked out to our officers.\nThe outcome was exactly what we wanted, Said McCullick. The male subject was extremely paranoid and delusional and sometimes those types of situations don’t end this well. All of the officers involved in this did a great job.\nWe want to thank Tri State Ambulance as well, they were put on standby and they had an ambulance waiting less than a mile from the scene during the entire situation.\nJanuary 27, 2014 – Recent news stories have mentioned an LP gas shortage nationally, and today, Wisconsin was one of the states mentioned as being adversely affected. The unusually cold weather, that has much of the country shivering, has increased the demand for LP beyond typical levels.\nWill we run out of LP, or have to pay exorbitant prices? Midwest News asked New Horizons Supply Cooperative's General Manager David Neal about the possibilities.\nSee Video"}