{"uri": "http://www.spokesman.com/stories/2015/jun/14/family-friends-mourn-montana-murder-suicide/", "title": "Family, friends mourn Montana murder-suicide victim Arie Lee", "dct": "Sun, 14 Jun 2015 00:00:00 GMT", "id": "84813d936fd82ff59aaf5f7ce630ceda", "content": "KENNEWICK – Former classmates who attended Kamiakin High School with Arie Arlynn Lee in the early 1990s are still mourning their longtime friend.\nMiriam Byerly of Milton met Lee their freshman year in 1991. She remained friends with Lee, who was known as Arie Edward in school, the rest of Lee’s life.\nByerly last talked to Lee, 37, on May 25, less than two weeks before Lee and her three children were shot dead by Michael Augustine “August” Bournes, 59, her companion and the kids’ father.\nBournes then set fire to their southwestern Montana log cabin, laid down next to the children’s bodies and shot himself with a .45-caliber pistol.\nFriends say there were signs of trouble with Bournes, who had recently had an argument with the closest thing to neighbors in the remote wilderness area they lived in.\n“At the end, you could only talk to her for a little bit before she would have to go,” said Byerly, who has lived off-and-on in the Tri-Cities for years.\nThat was a change from the woman her friends knew.\n“She exuded confidence, was strong, spoke her mind and had a great sense of humor,” Byerly said. “She was also kind, loyal, smart and the most loving person I’ve ever met. She was and always will be a beautiful soul.”\nLee was born in Spokane and moved to the Tri-Cities at a young age, said her brother, Phil High-Edward.\nTashia Flieger of Pasco took her children to visit Lee and her family at their Montana cabin in 2013, when they were in the area for her son’s baseball tournament. Her son helped Bournes get firewood for the long winter, while she watched Lee cook on a propane stove.\n“Everything she did was homemade,” Flieger said. “I must have a million pictures on my phone of something she would bake.”\nFlieger and Lee last saw each other a year later, when Lee visited them in Kalispel when Flieger returned for another tournament. Flieger cried for hours after they said goodbye, only to talk to Lee and learn that she did the same.\nAfter Lee’s youngest child, Arie, who was 1 when she was killed, was born, Flieger noticed a change.\n“I sent her a picture of the kids back in November and it took her a week to respond,” she said. “She said she was too busy.”\nFlieger feels bad because she did not try harder to find out what was going on with her friend.\n“I let her phase out,” she said. “Arie was not the kind of person who would share if she was going through hard times.”\nLee hadn’t lived in the Tri-Cities since graduating from Kamiakin in 1995, but her friends continued to keep up with her. They have scheduled a celebration of life service at 6:30 p.m. Thursday at Calvary Chapel Tri-Cities, 10611 W. Clearwater Ave. in Kennewick.\n“There is an outpouring of people here who knew her and loved her,” Flieger said. “She was a huge part of the community, and her mother was a huge part of the community.”\nHigh-Edward, who lives in Spokane, will return to the Tri-Cities for the event.\n“I think it’s a perfect time to come together and remember Arie for the very sweet, nice, kind person she was,” he said."}