{"uri": "http://www.wkow.com/story/31036827/2016/01/22/breaking-5-year-old-boy-killed-in-shooting-in-beloit?utm_medium=social&utm_source=facebook_WKOW_27", "title": "UPDATE: 5-year-old boy killed in Beloit shooting", "dct": "Sat, 23 Jan 2016 02:53:00 GMT", "id": "05179a6aeac35799d4b2b1ac1ac56b39", "content": "UPDATE (WKOW) -- Beloit police are seeking the public's help to find a suspect who shot at a vehicle, killing a five-year-old boy Friday night.\nInterim Police Chief David Zibolski says a town of Beloit man and his son were driving near the intersection of Shopiere Road and Prairie Avenue around 7:10 p.m. when multiple shots were fired from another vehicle. Police say the boy, sitting in a car seat in the back of the car, was hit in the abdomen. He was taken to a hospital where he died.\nPolice have not identified any suspects at this time, but are looking for a maroon SUV, a late 1990's or early 2000's model, possibly a GMC. Investigators don't know how many people were in that vehicle or whether the vehicle that was hit was the intended target. The man reported the SUV had been following his vehicle for some time, according to Zibolski.\nThis incident happened near several stores on a busy road so it's likely someone saw the shooting. At a news conference Friday night, Zibolski urged anyone with any information about the shooting to come forward.\n\"I'm certain there is someone in this community right now, one or more, that know who did this and they need to step up and work with us so that we can put the responsible party behind bars,\" Zibolski says.\nTown of Beloit Police Department and the Rock County Sheriff's Office assisted on the scene as officers searched for evidence in the street.\nCall Beloit Police Department at (608) 364-6800 with any information.\n********\nBELOIT (WKOW) -- A spokesperson for the Beloit Police Department confirms to 27 News that a 5-year-old boy was killed in a shooting near Shopiere Road and Prairie Avenue.\nPolice say it happened around 7:15 Friday evening at the intersection of Prairie Avenue and Shopiere Road. Police are asking the public to avoid that area as they investigate. Our 27 News crew at the scene says part of Shopiere Rd. is blocked off.\nAnyone with information should call Beloit Police at 608-364-6800.\nInterim Police Chief David Zibolski will address the media at 9:45.\nStay with 27 News and WKOW.com for the latest on this breaking story."}