{"uri": "https://www.washingtonpost.com/news/morning-mix/wp/2016/02/23/like-talking-to-a-30-year-old-murderer-teen-charged-with-killing-his-little-sister/", "title": "‘Like talking to a 30-year-old murderer’: Teen charged with killing his little sister", "dct": "Tue, 23 Feb 2016 00:00:00 GMT", "id": "628b95fa9514238355f967ff8597a349", "content": "A 10-year-old girl was fatally shot by her teen brother in Fountain, Fla., on Sunday. Authorities say it is still unclear how the incident occurred because the suspect gave multiple versions of his alleged involvement in her murder. (News Herald)\nWhen search crews found the body of 10-year-old Izabella Heffernan, she was clad in a white sundress and covered in towels.\nHer older brother admitted to fatally shooting his sister after he was brought in for questioning, according to an arrest affidavit. But the 15-year-old said it was a mistake — that he thought he was shooting at a deer.\nThen he changed his story.\nThen he changed it again.\nAnd now, authorities say, the teen is facing an open count of murder in the death of his little sister.\nIzabella’s body was discovered Sunday afternoon, hours after her family reported her missing in Fountain, Fla., according to the Bay County Sheriff’s Office.\nAt a news conference Monday, Bay County Sheriff Frank McKeithen described the behavior of the older brother who was charged with her death, characterizing it as unusual for his age.\n“This is not the typical 15-year-old kid you would see every day on the street,” McKeithen said, according to the Panama City News Herald. “This is a hard-core kid: He lied, he was deceitful, he screamed, he cursed. He was like talking to a 30-year-old murderer.”\nDuring an interview with investigators, the 15-year-old admitted to shooting Izabella, although he said that he had mistakenly thought his sister was a deer when he fired, according to an arrest affidavit. He told the sheriff’s office that after he shot the girl with a .22-caliber rifle, striking her in the chest and face, he moved the body and hid the gun.\nHe later changed his story, according to the affidavit, instead telling authorities that he was trying to shoot someone who was attacking the 10-year-old. He said he had accidentally shot his sister instead.\nFinally, the teen told police that he was teaching Izabella to shoot, which was why he had taken her outside early Sunday morning.\n“While doing this he stated he accidentally shot her in the chest,” the affidavit reads. “He thought it hit her in the lungs and stated, ‘She started making gurgling noises, and I did not know exactly how to deal with that, so I shot her again.’ ”\nThe 15-year-old told investigators that he moved the body and put Izabella in a white dress, according to the documents.\nHe also told investigators where to find the gun that he used: in an abandoned home that was nearby.\n“I heard a young man say that she was one of those students who, if you were having a bad day, she would come sit by you and talk to you,” Izabella’s elementary school principal, Chris Beard, told the News Herald. “She always had a smile. She was a very sweet little girl.”\nRead More:\n‘I could feel my intestines outside my body’: Woman describes attack that killed her fetus\nHow often do children in the U.S. unintentionally shoot and kill people? We don’t know."}