{"uri": "http://www.toledoblade.com/Police-Fire/2015/02/23/Blind-man-charged-in-girl-s-shooting.html", "title": "Blind man charged in girl’s shooting", "dct": "Mon, 23 Feb 2015 00:00:00 GMT", "id": "1b2a4e7e8cb12e6b97b2f550c0296389", "content": "Not only is Michael C. Reyes prohibited from having a gun, the Toledo man charged with accidentally shooting his 3-year-old daughter Saturday is legally blind, court records show.\nReyes, 27, of 749 Parker Ave. is to be arraigned this morning in Toledo Municipal Court on charges of having weapons while under disability and negligent assault in the shooting of Kaylee Reyes. The toddler was in serious condition Sunday in the pediatric intensive care unit at Mercy St. Vincent Medical Center.\nAccording to court documents, Reyes told police “he had a handgun in his possession when it discharged and struck his 3-year-old daughter” inside 533 Prouty Ave.\nToledo police spokesman Sgt. Joe Heffernan could not be reached for comment.\nRELATED ARTICLE: Bond set at $100,000 for man charged in girl’s shooting\nPolice were called to the Prouty Avenue duplex on a report of a person shot about 1:45 p.m. Saturday. Officers were seen escorting Reyes from the home to a waiting police wagon just after 4 p.m., and he was booked into the Lucas County jail about 7:30 p.m.\nRecords show Reyes and his girlfriend, Solana Mendoza, 24, each were convicted of aggravated assault in Lucas County Common Pleas Court in 2009. The conviction meant they were prohibited from owning, possessing, or using a firearm.\nReyes was placed on community control for three years and ordered to spend 90 days at the Corrections Center of Northwest Ohio and 60 days in the Lucas County Work Release Program.\nIn a motion asking the court to modify his work release sentence to house arrest, Reyes’ attorney wrote that Reyes was “legally blind and disabled from any type of employment because he has profound loss of vision from a childhood illness at the age of three.” Reyes had childhood retinitis, the motion stated.\nYoung Kaylee’s shooting was the second such incident this month.\nOn Feb. 6, Marquise Hudson, Jr., 2, was shot in an apparent gang-related drive-by at a home in the 200 block of Maumee Avenue not far from the scene of Saturday’s incident. The shot that struck the 2-year-old shattered a glass front door, passed through the youngster’s arm and lodged in his stomach. No arrests have been made.\nAccording to the 2014 report, “Innocents Lost: A Year of Unintentional Deaths,” at least 100 children were killed in unintentional shootings in the United States between December, 2012, and December, 2013. Some 65 percent of those incidents occurred in a home or vehicle that belonged to the victim’s family, while 19 percent took place in the home of a relative or friend of the victim.\n“Of the child shooting deaths in which there was sufficient information available to make the determination, 70 percent could have been prevented if the firearm had been stored locked and unloaded,” stated the report by Everytown for Gun Safety and Moms Demand Action for Gun Sense in America. “By contrast, incidents in which an authorized user mishandled a gun — such as target practice or hunting accidents — constituted less than 30 percent of the incidents.”\nContact Jennifer Feehan at: jfeehan@theblade.com or 419-213-2134."}