{"uri": "http://abc7ny.com/news/suspect-idd;-community-mourns-2-killed-at-halloween-party/1581507/", "title": "Suspect ID'd; Community mourns 2 killed at Newburgh Halloween party", "dct": "Tue, 01 Nov 2016 00:00:00 GMT", "id": "4f4e96507eaae2fc8ec3a501b7e4d956", "content": "NEWBURGH, New York (WABC) --\nAuthorities have identified the suspect they believe was the gunman responsible for a shooting Sunday inside a Newburgh apartment building that left two people dead and five others wounded.\nOmani Free, an 18-year-old senior at Newburgh Free Academy, and 20-year-old Tabitha Cruz were killed.\nNew York State CrimeStoppers is now offering a $2,500 reward for information leading to the arrest of 17-year-old Nija Johnson, who is wanted for second-degree murder. Anyone with information is urged to contact CrimeStoppers at 1-866-313-TIPS or Newburgh police at 845-561-3131.\nMeanwhile, two other suspects have been arrested \"related to actions of subjects that assisted the shooter immediately following the incident.\" They are not accused of committing the shooting.\nAuthorities say 21-year-old Rainier Hamilton and 20-year-old Tyson Oliveira are charged with felony tampering with evidence, while Hamilton is also charged with felony criminal possession of a weapon.\nFriends and family members of the women killed came together Monday for a march and rally to call for an end to the deadly violence, while a touching memorial to the victims continues to grow outside the building. Rhonda Valentine-Free and her family came to see for themselves, as dozens of candles honored her daughter and Tabitha Cruz.\n\"Loving, caring, very sweet, always full of life,\" Valentine-Free said. \"It's sad. They just took them. They just took them away.\"\nClassmates were being offered counseling services, school officials said.\nAbout 100 people showed up at the party at 119 Broadway, described as an art gallery. But what began with costumes and dancing ended with gunfire and panic.\n\"They started fighting about the DJ booth, then they pushed somebody,\" witness Imani Robinson said. \"Lights went off, they started shooting.\"\nMiguel Cruz lost his daughter, Tabitha, who volunteered with young girls.\n\"My daughter did a lot for kids,\" he said. \"She guided them to the right path for the wrong past. Big tragedy.\"\nDonnell Simpkins, a freshman at Mount Saint Mary, was one of the five others who were wounded.\n\"I was screaming at the top of my lungs, saying I got shot, and someone rushed me to the hospital,\" he told Eyewitness News via Facetime. \"One I felt it hit me, because I was there. All I kept hearing was the gun going off a whole bunch of times, and until it actually hit me, it went through my mind was 'I really have to get out of here before they hit me again.'\"\nOmani's family is hoping the shooter or shooters will do the right thing and turn themselves in to police.\n\"An unfortunate situation, but just turn yourself in, turn yourself in and do the right thing,\" the victim's aunt, Rikki Pearson, said. \"She was very full of life. She was loving. She was caring. She was an awesome niece and awesome daughter.\"\nFree had made a last-minute decision to go to the party, about five blocks from her home in Newburgh, when a friend became available on Saturday night and otherwise would have been due home around the time the gunfire broke out, said her mother.\nValentine-Free said she had left home for her own social engagement and didn't know her daughter had decided to go to the party.\nShe said she and her husband first got word that something had happened when a friend of their 15-year-old son who had been at the party called to say their daughter had been shot. She said they went to a hospital, where their daughter died hours later.\n\"She was a sweet girl,\" Valentine-Free said. \"She was my chocolate baby.\"\nShe said her daughter had gone to a party in another section of the building before without incident.\n(The Associated Press contributed to this report.)"}