{"uri": "http://www.greenvilleonline.com/story/news/crime/2015/11/03/anderson-county-sheriffs-office-4-adults-murdered/75091588/", "title": "Anderson County Sheriff's Office: 4 adults murdered", "dct": "Tue, 03 Nov 2015 00:00:00 GMT", "id": "75e6423a180adc2f3ab3bd70f137a540", "content": "The Anderson County Sheriff's Office is investigating the deaths of four adults as a quadruple murder, Lt. Sheila Cole said Tuesday.\nMike Scott, 58, and wife Cathy Scott, 60, and their mothers, 80-year-old Barbara Scott and 82-year-old Violet Taylor, were found dead Monday afternoon at their home on Refuge Road in Anderson County, the Coroner's Office said.\nThe manner of death was ruled homicide for each decedent and the cause of death was gunshot wound in each case, Coroner Greg Shore said Tuesday. Cathy Scott's daughter called 911 after she found Mike Scott and the mothers dead in a den and Barbara Scott in a bedroom, Shore said.\nNo arrests have been reported. No weapon was found at the scene, Shore said. Forensic investigators on Tuesday returned to the scene to look for additional evidence, Cole said.\nAnyone with information about the case is asked to contact the Sheriff's Office at 260-4400 or Crime Stoppers at 888-CRIME-SC.\nThe Scotts and their mothers were last seen alive at their home Saturday, Shore said. One of Cathy Scott's brothers went to the home about 3:30 p.m. Sunday and no one came to the door, Shore said.\n\"I feel like it happened some time Sunday, early afternoon,\" Shore said of the fatal shootings.\nThere were no signs of forced entry into the home, Shore said. All of their vehicles were accounted for, he said.\nMike Scott worked for the South Carolina Department of Transportation, Shore said, and went to Columbia to assist during severe flooding last month. Cathy Scott did not work but cared for the couple's elderly mothers, the Coroner's Office said.\nMike Scott talked to his boss Sunday via text message, Shore said. Scott told his employer that he planned to be at work Monday after taking annual leave days late last week, Shore said.\nThe Scotts and their mothers were the only four people who lived at the home, Shore said.\nCathy Scott is survived by a daughter, who recently was married and lives at a home on the same property, Shore said. Violet Taylor, Cathy Scott's mother, was the mother of two daughters and two sons, Shore said."}