{"uri": "http://abc11.com/news/1-year-old-in-hospital-after-shooting-in-chapel-hill/1136277/", "title": "Chapel Hill drive-by shooting critically injures child", "dct": "Sun, 27 Dec 2015 00:00:00 GMT", "id": "10a31dffc50c37c58af768829116b666", "content": "CHAPEL HILL, N.C. (WTVD) --\nA 1-year-old girl is at UNC's Children Hospital receiving care around the clock after she was injured during a shooting on Christmas Day.\nUPDATE: The Orange County Sheriff's Department told ABC11 they have one person in custody. Read more here.\nFamily friends said a bullet hit Maleah Williams in the head during a drive-by shooting.\nGOFUNDME PAGE FOR MALEAH WILLIAMS\nLarunda Craig is the little girl's godmother.\n\"It's senseless, very senseless,\" she said. \"Respect for the kids, nobody. And I just think who ever did this senseless crime needs to be caught.\"\nIt happened around 5:40 p.m. in the 700 block of Trinity Court. Officers said the shots were fired from a vehicle leaving the apartment complex.\nPolice said Maleah remains in critical condition at UNC Hospitals.\nEyewitnesses say before the shooting, kids were outside playing with their new toys from Christmas. Parents were standing nearby, watching the children play. Eyewitnesses said when someone drove up and opened fire, kids started screaming, and parents were panicking.\nOne of the bullets pierced Maleah as she was being held in her mother's arms.\nGodmother of baby injured in driveby shooting speaks. Here's her message to gunman.The child's in critical condition pic.twitter.com/jpmyJZyx2z\n— Elaina Athans (@AthansABC11) December 26, 2015\n\"The mama didn't even realize the girl was hit until she got around the corner and realized the little girl was bleeding from the head,\" said Craig.\nMaleah, who is affectionately called \"Peanut,\" has undergone two surgeries, according to friends of the family.\n\"I hope they catch the suspect and I hope that he gets a death sentence, and is treated just like Maleah. Maleah is suffering right now and I think they should suffer as well because she did not deserve any of this,\" said Craig.\nNo other kids were injured during the shooting.\nPolice are investigating and asking anyone with information about the incident to call 911 or Crime Stoppers at (919) 942-7515.\nReport a Typo"}