{"uri": "http://wjhl.com/2015/12/28/1-year-old-girl-dies-after-being-shot-on-christmas-in-nc/", "title": "1-year-old girl dies after being shot on Christmas in NC", "dct": "Mon, 28 Dec 2015 17:17:00 GMT", "id": "db2dc832b3c428ab0cc58b6bf8e65f3e", "content": "CHAPEL HILL, NC (WNCN) – The one-year-old girl shot in Chapel Hill Dec. 25 has died Monday from her injuries, family members confirmed.\nMaleah Williams was injured when shots were fired from a vehicle leaving Trinity Court just before 5:45 p.m., police said.\nWilliams was transported to UNC Hospitals where she underwent surgery.\nFamily members confirmed Monday the toddler has died.\nShaquille Oneill Davis, 22, was arrested in connection with the shooting just before noon Sunday by the U.S. Marshals Joint Fugitive Task Force, Chapel Hill Police said.\nDavis appeared in court Monday via video feed on charges of attempted first-degree murder and assault with a deadly weapon with intent to kill inflicting serious injury.\nThe judge added two conditions Monday to Davis’s $650,000 bond.\nHe must not have any contact with the victim’s family and he cannot possess a firearm.\nHe is scheduled to appear in court again Jan. 4 in relation to the Dec. 25 shooting.\nDavis is scheduled to appear in Orange County court Jan. 15, 2016 on five unrelated charges ranging from drug possession/selling to probation violations.\nA collection of toys, candles and notes – praying for Maleah to get well, have been set up in the area near the apartment where she was shot.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}