{"uri": "http://www.greenvilleonline.com/story/news/local/2014/11/13/williamston-man-charged-shooting-deaths-court/18967257/", "title": "Williamston man pleads guilty to three fatal shootings", "dct": "Thu, 13 Nov 2014 00:00:00 GMT", "id": "215f801a36fd1840eef9374579371082", "content": "A Williamston man Thursday pleaded guilty to three counts of murder and four counts of attempted murder in connection with a triple homicide followed by a high-speed pursuit.\nJared Michael Williams was sentenced to serve three consecutive life sentences in connection with the shooting deaths of three people and other charges he pleaded guilty to in a violent sequence of events starting at a Pelzer home. Prosecutors say an argument over shoes preceded the shootings, which killed Victor Vandegrift, 48; Wanda Anderson, 40; and Hank Eaton, 32, at a residence on Law Street.\nVandegrift's sister, Vivian Vandegrift, tearfully addressed the courtroom and said she believes Williams deserved the death penalty but accepted the sentence. Vandegrift spoke about how she became closer with her brother in recent years after their parents died. She described Williams as an \"evil\" person and said, \"Except for friends, I have no one else close to me.\"\n\"Please never allow him to do mayhem again,\" Vandegrift said.\nSolicitor Chrissy Adams considered pursuing the death penalty but settled on the consecutive life sentences without parole as part of the plea deal.\nOn March 5, Williams shot Vandegrift after they argued, then went through the small house and proceeded to \"shoot everybody else who was there,\" said Assistant Solicitor Rame Campbell.\n\"After he did the initial shooting, he went back through the house and fired rounds again at everybody,\" he said.\nTara Hendricks was shot in both hands and the leg but survived and was present in court Thursday. She told the court she lost her two best friends in the shooting.\n\"It was senseless and it didn't have to happen,\" she said.\nAnderson was not present when the gunfire began, prosecutors said. When she came back and closed the door, Williams shot her in the head, Campbell said, and left the scene in her truck.\nOfficers were able to locate that vehicle, and a pursuit began. Williams fired several shots at an Anderson County deputy, Campbell said. Williams also shot at two Greenville County sheriff's officers who were trying to put down stop sticks to disable the car, Campbell said.\nLater in the chase, he attempted to carjack a woman who was with her daughter at their house. The woman shielded the daughter, and he ran off, Campbell said. He ran to a construction site and took a truck at gunpoint.\nOfficers continued to pursue him, and Williams sideswiped a vehicle. That collision sent the truck careening into a home, which had to be later destroyed because it was knocked off its foundation, Campbell said. Williams confessed to his actions at the Sheriff's Office, Campbell said.\nWilliams, who had a previous criminal history, also pleaded guilty to carjacking, armed robbery and possession of a weapon during a violent crime and received the maximum amount for those charges."}