{"uri": "http://www.mlive.com/news/ann-arbor/index.ssf/2016/11/mother_of_3-year-old_fatally_s.html", "title": "Mother of 3-year-old fatally shot by other child: 'Part of my world died'", "dct": "Fri, 18 Nov 2016 16:57:40 GMT", "id": "e414e52dec65777cfa121e07fc5dcc6a", "content": "YPSILANTI TOWNSHIP, MI - The last word 3-year-old Jamari Moore said was, \"Mommy.\"\nThe toddler, who loved Ninja Turtles, painting and sports - he most recently wanted to be a basketball player, his mom said - died Sunday, Nov. 13 after an accidental shooting by another child at the Country Meadows Apartments complex, 212 Stevens Drive in Ypsilanti Township.\nAlisha Moore, 34, said she had just set him, his brother and the son of her significant other in a back bedroom to watch a Ninja Turtles show and settled in a different room to watch the movie \"Class Act\" at the man's home. She heard a popping noise.\nShe went out to the hallway, assuming something broke, and found her young son bleeding. He ran to her, and said his last words.\n\"I tried to stop the blood,\" Alisha Moore said. \"I'm just sitting here, looking at my baby, telling him to fight - to fight, fight, fight.\"\nHe looked so scared, she said. But as she called 911 and carried him, trying to find the best way to help him, he grabbed her shoulder.\n\"He was trying for me,\" she said.\nJamari Moore wouldn't make it. He died Sunday, in what Alisha Moore says was a tragic accident.\n\"I don't wish this pain on my worst enemy,\" she said. \"I just feel like part of my world died Sunday and it's like, how do I pick this world up and keep going?\"\nLoved ones huddled together as a woman cried out at the scene of the shooting death of a 3-year-old boy on Sunday, Nov. 13.\n'Ripped from my soul'\nMoore lives in Ypsilanti, but stayed the night at her significant other's Ypsilanti Township home after a wedding on Saturday.\nAt the wedding, Jamari Moore had served as a ring bearer for close friends, who Alisha Moore called Jamari Moore's \"second family.\" They had taught him Spanish - something he kept trying to teach his siblings - and he'd spent the reception cutting a rug on the dance floor, she said. He was truly happy, Alisha Moore said.\nShe remembered getting into the car after the wedding, and asking him if he had fun.\n\"Yeah,\" he replied, according to Alisha Moore. \"I like to dance.\"\n\"I said, 'I know you like to dance, I saw you,'\" she said, laughing slightly.\nShe asked him about what he'd want to do for his birthday, which is coming up in January. He said he wanted a Ninja Turtle party - which he always wanted - and fell asleep a few minutes later.\nThe next day, they woke up, had breakfast and the kids watched cartoons. Alisha Moore said she planned to go to work, but decided to stay home Sunday to watch the boys when she didn't feel well and her significant other had to leave for work. The children had spent a lot of time together, and Jamari Moore considered the son of Alisha Moore's significant other to be one of his brothers.\nAlisha Moore knew there was a gun in the house, but never saw it that day, she said.\nIt was typically kept in a locked box on a high shelf in the closet, she said. She believes another child there had retrieved it to play with it.\nPolice said the weapon was left unattended and unsecured in the apartment.\nWashtenaw County Sheriff's Office Detective Lt. Jim Anuszkiewicz said the incident remains under investigation, and the case isn't expected to be forwarded to the Washtenaw County Prosecutor's Office for review until next week.\nToday, Moore is left grieving the loss of her son.\nHe was energetic, funny, and fun-loving, she said. He also loved watching sports with his grandfather, and loved arts and crafts.\nShe began to cry as she discussed his many paintings. There is some comfort having those, and being the one to hold him as he died, she said.\n\"To have the night before this wonderful wedding ... and then for the next day to have him pretty much ripped from my soul, is just heartbreaking,\" she said.\nShe'll never see him grow up and actually be a basketball player, she said. But she doesn't hold anger for the other child involved in the incident or his father. It's one of the few emotions she isn't experiencing.\nAlisha Moore said she knows the incident was an accident, and has been speaking with the other boy's mom to coordinate counseling for the boy. She doesn't want him to feel responsible.\nShe also implored other parents to take precautions if they own a gun.\n\"Honestly, if you have gun, don't even let them know you have it,\" she said of other children. \"If you got to, put it in a safe - put it in a big safe and a small safe. Kids don't understand the dangers of them.\"\nIf there's some other lesson in this loss, Alisha Moore said she hasn't been able to figure out what that is.\n\"Nobody should be burying their child,\" she said.\nPublic visitation for Jamari will take place from 4 p.m. to 8 p.m. Nov. 21, at the C&H Community Home for Funerals Lucille's Memorial Chapel, 411 S. Adams St. in Ypsilanti, and the funeral is scheduled for 11 a.m. Nov. 22, at Grace Fellowship House of Solutions, 1301 S. Harris Road in Ypsilanti Township, with a family hour beforehand.\nDonations toward funeral costs can be made at a GoFundMe page in Jamari Moore's name."}