{"uri": "http://www.fox4now.com/news/man-recalls-terrifying-encounter-with-suspect-in-fatal-shootings", "title": "Man recalls terrifying encounter with suspect in fatal shootings", "dct": "Tue, 07 Jun 2016 08:51:00 GMT", "id": "7744a167ae71e019b427b97bdb60e975", "content": "Autoplay:\nCAPE CORAL, Fla. -- A Cape Coral man is sharing his terrifying encounter with a gunman who was shot and killed after going on a rampage that left two others dead and three more hurt.\nPolice say the gunman shot and killed a motorcyclist on Skyline Boulevard on Sunday evening before going to the Circle K at Chiquita Boulevard and killing someone there. Police then stopped the gunman in his car and opened fire on him during a violent exchange on Cape Coral Parkway.\n\"I said 'is that real?' He said 'you think it's real?' and he put it again in my face.\" Chris Flaker believes he's lucky to be alive after a previous close encounter with his neighbor who was out to kill. \"He goes over to his red Mazda and pulled out a shotgun, and he comes walking over to me and puts it in my face and says 'do you have anything to do with my abduction?' I said 'sir, I told you, I don't know what you're talking about, but you have a baby five feet away from you.'\"\nChris says he was referring to the suspect's child, who was sitting in his car.\nHe says the gunman, who also goes by the name Chris, was with his girlfriend named Maria. Throughout their exchange, he says the gunman acted erratic and wasn't making sense. \"I turned and walked away and I heard Maria at that point was yelling, 'Chris, Chris, let's go. Let's get out of here,'\" says Flacker.\nChris says he was walking down the stairs when the suspect flagged him over to some mailboxes. It's there Chris says the suspect pointed a shotgun to his head twice after confronting him about an alleged abduction. Luckily he was able to talk the suspect down.\n\"I actually was kind of relieved. It was out of his hands and he wasn't going to shoot me at that time. The two other times I didn't think he was going to shoot and kill me, my first concern was that baby,\" said Flacker.\nThe gunman spared Chris' life, but minutes later, went on the shooting rampage that left two others dead. Witnesses say the girlfriend and child were with him during the entire crime spree.\nAnd after looking the killer in the eyes, Chris is left wondering how he survived. \"I'm questioning why didn't he shoot me? What did I say that made him put that gun down and lay it in front of me?\"\nCopyright 2015 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}