{"uri": "http://www.news-press.com/story/news/crime/2016/03/22/little-info-shooting-south-lee-county-development/82120562/", "title": "Father, friends remember man shot in south Lee County", "dct": "Tue, 22 Mar 2016 00:00:00 GMT", "id": "c8cfbfaccd6da31590f9304b55ad9ce3", "content": "\"For no reason at all, someone stole a big piece of my future for no reason,\" the man's father said.\nRyan Modell's night started poolside celebrating a new job prospect and the chance to make a life with his girlfriend.\nIt ended with him shot dead in sandals.\nThe Lee County Sheriff's Office on Tuesday identified Modell, 32, as the victim in the Sunday death investigation that started in the gated Emerson Square development where he lived.\n“I’ve lost one of my best friends,” said his father, Sandy Modell of Winter Park.\nModell said his son was at the south Lee County complex's pool with friends about 2:30 a.m. Sunday when he headed back to his apartment.\n“My son went back to his unit to get something and went to the wrong unit,” he said. “The complex has a lot of buildings who look the same. It was in the wee hours of the morning.\"\nHe said his son left after realizing it was the wrong condominium.\n\"My son was walking away and then something else took place,\" he said. \"It was an inadvertent mistake. What it’s done has cost us a very special young man.\"\nModell wouldn't go into more detail about the active investigation, but the condo group sent a note out to residents right after the shooting: \"In an unusual and isolated situation, a resident was shot and killed early this morning under circumstances that involved alcohol. There were no breaches of the security system or the entrance way to the community. Our sincere condolences to those effected by this tragedy.\"\n\"For no reason at all, someone stole a big piece of my future for no reason,\" he said.\nModell said his son graduated from Winter Park High School where he was a four-time, all-county tennis player and team captain for the last two years before graduating from University of Central Florida’s business school with honors in 2006.\nHe worked sales jobs around the country, but the new prospect he was celebrating was a calling.\nModell was expecting an offer servicing and doing upkeep on heart equipment like pacemakers for an Orlando cardiac surgeon group's three clinics. He'd graduated from an intense six-month program in Boston after learning how to maintain the equipment.\nThe reason for the career change came Jan. 24 — that's the day his mother, 58-year-old Donna Louise Modell, died of a heart arrhythmia.\n\"My son thought he could help someone,\" Modell said. “He would have been back home with us and doing the things he wanted.\"\nModell was excited to have both of his children home, as his older daughter who also lives in Orlando had a child in December.\n\"He was all excited to be a brand new uncle,\" Modell said of his son. \"We were just starting to heal, and now we have this.\"\nAnother layer to the excitement was that Ryan Modell and his girlfriend, Kristin Ann Westlund, planned on settling down in Orlando.\n“They were looking to build a life together,” Modell said .\nDeputies arrested Westlund, 34, for misdemeanor obstruction of justice without violence, shortly after they responded to the 911 call, near the site of the death investigation.\nAn arrest report said Westlund tried to go under crime scene tape several times after being told to stop. The report said she told deputies \"I don't care about your tape. I need to know what's going on.\"\nShe was released from Lee County Jail less than 4½ hours later on a $1,500-bond.\nWestlund is an insurance adjuster at the Naples-based Keys Claims Consultants, Inc. where she has worked for nearly seven years, according to her LinkedIn page.\n\"I was advised that we have no comment,\" said an employee who answered the phone at Key Claims on Tuesday. \"She’s not here.\"\nThe condo unit that is listed in the sheriff's report, 102, where the couple lived, is owned by Mark and Judith Aldrich and Todd and Lisa Aldrich of Fremont, Indiana.\nMark Aldrich, reached at his Fremont home Tuesday, said he, too, was trying to find out more about what happened.\n\"We're not really sure. We heard there was a party and then someone knocked on a door,\" he said. \"We heard someone was shot. But that's all second-hand information.\"\nA 911 hang-up call is what first caused deputies to respond to 17483 Harmony Drive in Harmony Point.\nSandy Modell said that after his wife died, his son was such a support for him and the whole family.\n\"It’s been a tough 14 months,\" he said.\nConnect with this reporter on Twitter, @ben_brasch."}