{"uri": "http://www.cincinnati.com/story/news/2017/01/18/man-10-year-old-girl-shot-mount-auburn/96741510/", "title": "Mt. Auburn school remembers 9-year-old shooting victim", "dct": "Wed, 18 Jan 2017 00:00:00 GMT", "id": "d436a0ab58c89bd8eee5f565ecf370f1", "content": "It's the smiles, the hugs and Alexandrea Thompson's leadership that the staff and the 431 students at Mount Auburn International Academy will remember the most.\nAnd miss the most.\nThat was evidenced in a light green poster board students here signed as notes to the fourth grader who wanted to grow up and become a teacher.\n\"I will forever miss you.\"\n\"Rest up baby, I love you sissy.\"\n\"Your new wings are magnificent.\"\nThe 9-year-old girl died after she was shot along with her father Wednesday in Mount Auburn, police said. Officers found the two injured in a shooting after they were called to 2235 Burnet Avenue at approximately 5:30 p.m.\nClaudia Ehrle, interim director of the school that's just blocks from where Alexandrea was shot and killed Wednesday night, may miss the 9-year-old the most.\nAlexandrea, who was known in school as Sissy, was the kid who immediately welcomed Ehrle when she came to the school in November.\n\"You know when you start in a new place and some people just stand out? She was one of those,\" Erhle said. \"My lasting memory of her will be that hug and that smile. She made me feel welcome.\"\nEhrle said that green memory board along with several balloons will be placed in the school's central hall near a bulletin board where 10 pieces of Alexandrea's art are on display.\nThe hand-drawn art includes several calls of superheroes and girl power. The board also includes a sheet where Alexandrea drew pictures of her family members – mom, dad, brother and sister. In it she also said she liked \"chilli\" and \"potery.\"\nAlexandrea lived at the home with her father, Alex Thompson, 39, and as many as nine siblings and step-siblings, relatives told The Enquirer.\nAlexandrea died at Cincinnati Children's Hospital Medical Center. Alex Thompson was taken to University of Cincinnati Medical Center for treatment. Catherine Thompson, Alex's mother, said her son is in intensive care, but has been able to talk.\nCatherine Thompson described her granddaughter as a “vibrant” and “very bright” girl who liked to draw and who excelled at school.\n“She was a very sweet, adorable child,” Catherine Thompson said. “She was so adorable.”\nAssistant Chief Paul Neudigate said the father and daughter were shot inside the residence on Burnet Avenue. Investigators reported that a witness saw three to four males at the scene at the time of the incident.\n\"It's always a tough day when we have shootings. It's even tougher when they are a young child, truly innocent victims,\" Neudigate said. \"All life is valuable to us. We put forth a great effort to solve all these shootings, but it even hits home that much more when it's a small child. And let's be honest, we're going to push that much harder.\"\nAlex Thompson was upstairs and was looking for a gun shortly before he was shot, said the Rev. Peterson Mingo, who spoke with him at the UCMC before he went into surgery Wednesday. He was shot more than once in the torso.\n\"He said he was not involved in anything; said he was not into drugs or any of that,\" Mingo said. \"He said he had a job. He said he worked at night.\"\nMingo said witnesses said men were seen leaving in a white two-door car that was possibly a convertible.\n\"Cincinnati police are working hard, working very diligently on this,\" Mingo said.\nMingo said his group will be joined by several other community groups this evening at the United Way to fan out in the neighborhood as a way to encourage any witnesses to come forward.\nBurnet Avenue was closed at McGregor Avenue while police investigated the scene. About a dozen community outreach workers with the city's Office of Human Relations and Cincinnati Works Phoenix Program gathered at the crime tape for several hours. They only left to travel straight to the hospital in an effort to calm the family of the victim and stop any retaliatory violence.\nOzie Davis with the Avondale Comprehensive Development Corporation was among the outreach workers at the scene Wednesday.\n\"This type of senseless shooting, potentially the homicide, of a young baby, a 9-year-old, it has to stop. More importantly, we have to stop protecting known shooters,\" Davis said. \"This can't continue to happen this way. We're losing people faster than we can change the culture of killing in our city. It's a shame.\"\nIn 2016, seven juveniles died in Cincinnati as the result of homicidal violence ranging from shootings to child abuse.\nAnyone with information about this homicide is asked to call the Criminal Investigation Section at 352-3542 or CRIMESTOPPERS at 352-3040 or text “CINTIP” plus your message to CRIMES (274637). Callers may remain anonymous and may receive compensation for their information."}