{"uri": "http://wishtv.com/2015/07/05/at-least-six-hurt-in-early-morning-fort-wayne-shooting/", "title": "9 people hurt in early-morning Fort Wayne shooting", "dct": "Sun, 05 Jul 2015 04:06:00 GMT", "id": "380cadf19af1ac8c4c7aeaef722e5282", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nFORT WAYNE, Ind. (WANE) – The Fort Wayne Police Department is investigating a shooting that left nine people injured on the city’s east side. Police were responding to a disturbance at about 1:15 a.m. Sunday morning in the area of the 1400 block of McCulloch Street. While on the way, they were told that multiple people were shot, according to Fort Wayne Police Department Officer Chris Felton. They found six victims suffering from apparent gun shot wounds.\nOne woman was taken to a local hospital in critical condition, but she was later upgraded to serious condition. Five other people were taken the hospital in good condition.\nA short time later, three more people walked into a local hospital, Felton said. Two of them were in good condition while one man was in critical condition.\nFelton said it appears that there was a party at a home in the area and a disturbance happened leading to the shooting. However, police still are unclear as to what exactly prompted the incident.\nPolice are interviewing witnesses and looking for evidence at the scene. Investigators don’t have any suspects or anyone in custody. Police said it’s too early to tell if the shooting is gang-related. Police also haven’t recovered any weapons.\nAnyone with information is asked to call the Fort Wayne Police Department at (260) 427-1222 or Crime Stoppers at (260) 436-7867.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}