{"uri": "http://www.wrdw.com/home/headlines/Person-grazed-by-bullet-in-Richmond-County-hunting-accident-298646981.html", "title": "UPDATE | Deputies investigate accidental discharge after child is grazed by bullet", "dct": "Fri, 03 Apr 2015 22:35:00 GMT", "id": "ae4468ee7449b42ea1a34d9e334add4d", "content": "View Map\nNews 12 at 6 o'clock / April 4, 2015\nHEPHZIBAH, Ga. (WRDW) -- Jimmy Thompson has lived in this house for more than 50 years.\n\"I was raised here, been in this community all my life,\" he said.\nHe has not moved from this area on Horse Shoe Circle.\n\"I will say I married my wife, she was the next door neighbor,\" said Thompson, \"She lived on Neely Road, and at the time I lived on Collins Road, living with my grandparents.\"\nHe may not always know the neighbors, but he keeps his eye out.\n\"We got new people moving in but the people that I know those who have moved in are good people,\" he said.\nBut last night, deputies were called to a home in his neighborhood around 9:20 p.m. after the accidental misfiring of a firearm sent a 5-year-old to the hospital.\nDeputies say the bullet grazed the child's head, but the injuries are not life-threatening.\nAnother neighbor on Horse Shoe Circle says the man who fired the gun tripped down a stair on his way to chase off a coyote, causing him to shoot.\nIn a rural area filled with hunters, gunfire is not a surprise to Thompson, but he never expected a bullet to hit a child.\n\"Only problem we ever had was people stealing,\" he said.\nThe victim was already on the way to GRU when deputies arrived, her life - not lost in the firing accident.\nNeighbors say the area is safe, and people keep to themselves.\n\"Only thing I know is that people are okay around here,\" affirmed Thompson.\nSo his plan is to stay here, comfortable in the community he knows best.\nLuckily, injuries to the victim are not life-threatening.\nNeighbors and officials agree this looks like a freak accident. The case is still under investigation.\nFriday, April 3, 2015\nRICHMOND COUNTY, Ga. (WRDW) -- Richmond County Sheriff's Office confirmed a child grazed by a bullet Friday night is suffering from non-life threatening injuries.\nThe Sheriff's Office stated the shooting appears to be accidental. The five year old victim was taken to GRU in a personal vehicle. Injuries do not appear to be life threatening, they say.\nDispatch said the call came in around 9:20 p.m. on the 4900 block of Horseshoe Circle.\nDeputies said an adult had been in the yard with a gun after hearing what he thought was a coyote. They say there was accidental discharge and the five year old was grazed in the head by the bullet.\nThe Sheriff's Office states the case in still under investigation."}