{"uri": "http://chicago.suntimes.com/news/another-dead-in-east-chatham-mass-shooting-on-christmas/", "title": "Another dead in East Chatham mass shooting on Christmas", "dct": "Fri, 06 Jan 2017 21:51:00 GMT", "id": "4cb5f641ba2327cbc6a0227f1253c31f", "content": "A 33-year-old man has died nearly two weeks after he was shot in a mass shooting on Christmas night in the East Chatham neighborhood, authorities said.\nThree men were killed and four other people were wounded in the shooting, which happened about 9:20 p.m. on Dec. 25, Chicago Police said. A group of people were gathered on the porch of a home in the 8600 block of South Maryland for a party when someone wearing a gray hooded sweatshirt walked out from an adjacent alley and opened fire before running away.\nSteven Freeman, of the 7600 block of South Normal, was shot in the body and taken to Stroger Hospital, where he died at 1:53 a.m. Friday, according to police and the Cook County medical examiner’s office.\nAlso killed were James Gill, 18, who was shot in the head and pronounced dead at the scene; and Roy Gill III, 21, who was shot multiple times and taken to Christ Medical Center in Oak Lawn, where he died, authorities said.\nA 35-year-old man suffered multiple gunshot wounds and was also taken to Christ, where he was listed in critical condition, police said. A 27-year-old man and 21-year-old woman both suffered a gunshot wound to the leg and were taken to Stroger, where their conditions were stabilized. A 39-year-old man shot in the foot later showed up at Roseland Community Hospital in good condition, police said.\n“We heard the shots and hit the deck,” a neighbor who asked not to be named said the morning after. “There’s people in and out of that house all the time.”\nLitter, including an empty bottle of Ketel One vodka and empty beer cans, strewn the lawn near police tape that cordoned off the crime scene.\nA police officer guarding the scene said at least five shell casings were recovered as the snow covering a patch of grass outside the home melted overnight.\nArea South detectives were investigating. No one was in custody."}