{"uri": "https://www.adn.com/nation-world/2016/12/01/after-a-toddler-accidentally-shot-and-killed-his-older-sister-a-familys-wounds-run-deep/", "title": "After a toddler accidentally shot and killed his sister, family’s wounds run deep", "dct": "Fri, 02 Dec 2016 00:00:00 GMT", "id": "8f25ddbd5c56d2767a12c8c65a51338e", "content": "IRONDALE, Ala. – They have put it off all spring and summer, but now it's autumn and they're out of excuses, so they set out on what should be the most ordinary of chores: to dismantle a trampoline in one backyard and rebuild it in another.\n\"I love you,\" the 4-year-old boy says as they drive through their neighborhood, just after his mother, who awoke with another migraine, told him to \"shut up and sit on your butt or else.\" \"I love you,\" he says again, a few seconds later, for what seems like the 10th time today, and now no one says anything. His grandmother stares ahead, dreading where they're going.\nThe truck pulls up to a single-story home where, seven months before, a 9-year-old named Kimi Reylander was accidentally shot to death.\nThe family gets out: Kimi's mother, her grandmother and, finally, her little brother. In front of them, in Kimi's great-grandfather's house, is the bedroom where Kimi died from \"a perforating gunshot wound to the head,\" according to the autopsy report, and also where, in that instant, the others began a new life defined not only by their suddenly changed relationships with one another but also their suddenly complicated relationships with guns.\nIn a nation where nearly 4 percent of shootings are unintentional and, in a given week, two children die from accidental shootings, according to gun violence research, what happened to Kimi's family has occurred at least 25 times since January 2015. A child gets hold of a gun and accidentally kills a sibling, and a family is left trying to figure out how to recover. In De Queen, Arkansas, where a 12-year-old boy shot and killed his 16-year-old brother, one family looked for recovery at church. Another family in Vista, California, looked for it in the criminal justice system after a 14-year-old boy shot and killed his 9-year-old brother. In the District of Columbia, after a 7-year-old boy shot and killed his 3-year-old sister, another family sought it in counseling services. And now a family in Irondale is trying to find it, or at least its beginnings, by taking the trampoline from the house where Kimi used to play on it to the house where Jaxon, they hope, might.\n\"You going to come here and give me a hug?\" Joel, inside on the couch, asks his great-grandson.\n\"Let's go take the trampoline down,\" Amanda, 27, says. Out back is a trampoline covered in leaves and dust. A swimming pool that Kimi used with friends has a film of green on the bottom and leaves floating on the top.\n\"Y'all got that thing loaded that quick?\" Joel asks a few minutes later, after the trampoline has been dismantled and put on the truck's trailer.\nIt was Feb. 6, a Saturday morning. Amanda was exhausted from another week of work. Jaxon, then 3, was with Tina, and Kimi was at Joel's house. It was a good morning for Amanda. She and her boyfriend had started talking about marrying. She believed, after having two kids before 24, that she was finally getting good at being a parent. Then the phone rang, and a relative was saying, \"Kimi's been shot,\" and someone else was saying, \"Baby, it's bad,\" and now it's seven months later, and she's sitting on her bedroom floor, holding her head in her hands.\nJaxon is with a relative for the morning, so she and her boyfriend go for a drive. She plugs her phone into the car's stereo, puts on a hard rock song and sets down the phone, reaching past a bottle of sleeping pills the doctor gave her because of the dreams she'd been having of Kimi – Amanda saying to her, \"You're dead,\" and Kimi saying, \"No, I'm not. I'm right here.\"\nThe pills were supposed to help with nights, but what about the days? Just that morning, she had yelled at Jaxon again when she caught him throwing away his breakfast, and he began to cry.\n\"I know this sounds horrible, but do you know how hard it is not to have ill feelings toward a kid? How hard it is not to be upset at Jaxon? Do you know how hard it is?\" she had asked the night before. \"I have no one to blame. I can't blame my kid. I can't blame God because it's inappropriate. I have nobody to blame. I have no outlet as far as taking out my anger, so I use my family and my fiance as a punching bag.\"\nIn the car now, she turns the volume up so loud that conversation with her boyfriend becomes impossible. She grips the wheel tightly, looks straight ahead and mouths the words of a song as she steers a car that has, among other things, a loaded gun in the glove box. It's a 9mm – the same caliber that killed Kimi – but while her anger bothers her, guns don't. She doesn't feel nervous around that gun or any other gun. She's more scared of not having one. She still has a child to raise, and what if there's an intruder, and that intruder has a gun, and she doesn't? How would she recover from that? How could she live knowing she could have protected Jaxon but had decided she was too afraid to have a gun?\nShe ignores the question. She flips through a few songs and decides on another heavy metal one. She turns it back up and continues to drive.\nIt wasn't the gun's fault Kimi died, she tells herself. A car wreck could have just as easily killed her. Or a bad fall. Kimi's death, she has come to believe, was a random accident. So after the burial, after child services searched the house to ensure that every gun was secure, after reading online comments calling for her prosecution and Jaxon's removal, Amanda had no hesitation about going shooting again. She hoisted a long .22-caliber pistol with a scope that day, took a photograph of herself half-smiling and made it her profile picture on Facebook. \"I'm pretty badass,\" she wrote after posting the photo. \"I feel for the person who even thinks about messing with MY child.\" Six weeks after that, she went with Joel to her first marksmanship competition, outshot him, posted a video about it to Facebook and tagged Tina, who she thinks would feel better, too, if she went shooting. Maybe then Tina wouldn't get upset whenever she sees Amanda's gun.\nTina, the grandmother who didn't see the gun, drives home in silence after a morning shift at the bank. Today is Saturday, and Saturday is when she cleans the house she shares with Amanda, Jaxon and her husband, just down the road from where Joel, her father-in-law, lives. She cleans every room, even the one that now makes her most anxious, the bedroom where her husband keeps his guns.\nShe has spent her entire life around guns, and in those first weeks after Kimi's death, when she found herself afraid of guns for the first time, she thought she was still in shock, that it wasn't the guns, it was her. She just needed more time. Guns were all over her childhood home – guns for hunting, guns for protection – and she learned how to shoot at a young age. When she was 19, she married a man who had been raised the same way, and both of her daughters grew up knowing guns, too. Guns were so ordinary she rarely gave them much thought. Now, at 53, she's always thinking about them. The gun her husband carries, the gun Amanda carries, and, most of all, the gun she didn't see.\nShe collects a bucket of cleaning materials and walks to the other end of the house. She had always been happy here. She raised four kids in this house – two kids, two grandkids – and though she hates the shaggy green carpet, the unfinished cabinets, the faded furniture, she only started considering leaving after Kimi died, when she realized that the guns were staying and that she was the only one who thought they shouldn't.\nShe gets down on her hands and knees. \"I don't see how this place gets so dusty,\" she says and moves on to another dresser, where she finds one of Kimi's tubes of lip gloss. She picks it up, puts it down. She would like to picture Kimi using it in front of her bathroom mirror as she used to, but all she sees is that day: going over to Joel's house to help do his bills. Kimi watching a show on her iPad on the floor and Jaxon going up on the bed so he could see better. Leaving the room, hearing a pop and thinking it was a balloon. Then the blood and the smell and cradling Kimi until the paramedics arrived, some of whom looked at Tina as if she were to blame. Her thinking she was.\nShe sees seven pistols hanging against the door: the Taurus .40 caliber, the Kimber 1911, the Beretta 9mm, the .45 ACP, the .357 magnum, the .380, the .22. She sees five long guns – one .30-06 rifle, four shotguns – leaning against a corner. She sees boxes and boxes of ammunition, red and green shotgun shells, magazines in leather sleeves.\nJoel, the great-grandfather who left the gun out, lives at the base of a small hill in a quiet three-bedroom house. \"It's always quiet here,\" he says one afternoon, just as a faint sound filters in from outside. He cranes his neck and looks outside. \"Did you hear that?\" he asks and, seeing it's only a neighbor, leans back again into the couch.\nThere are so many things he could be doing. The pool and garage need cleaning. He has a treadmill he doesn't use. And a work shed where he has assembled thousands of bullets and where he would like to assemble thousands more. He loves guns so much he sometimes falls asleep thinking of them. But then it's morning again, and he's walking past the room where it happened, past all the pictures of Kimi, and sitting on the couch where the thoughts start over again. Was the trigger defective? How much pressure did it take to pull it? How could a little boy have fired a 9mm pistol?\nThe idea that Jaxon was somehow able to pull that trigger is just about the last mystery guns have for him. He's been shooting since he was 6, when he lived in a country shack whose floorboards barely hid the ground and his father gave him a pellet gun. In the time since, he has shot nearly every gun he can think of. He has won marksmanship championships. He has taken guns apart and put them back together again. There are guns in his bedroom, living room, kitchen, stairwell and basement, where he keeps a large safe stocked with guns and a closet filled with disassembled gun parts. When he worked as a painter or did drywall, he would think about retirement and see days tinkering with and shooting guns.\nAnd then Kimi. He never had a daughter. She came over so much that he set up the spare room as her playroom and taught her the same way he did his two boys and his father taught him. He took her hunting. He brought her inside his gun workshop. When she picked up the pink .22-caliber rifle he gave her when she was 6, he told her not to touch the trigger, and she never did. He never worried something would happen because it never had before. Even in 2010, when a .25 pistol toppled off a bedroom closet shelf, hit the floor and went off, the bullet grazing his wife's arm and narrowly missing Kimi, he dismissed it as a freak accident.\nKimi, the girl who died by accident, was 9 years old and had \"unremarkable\" blue eyes, according to the autopsy report. She had unremarkable ears. The soles of her feet were unremarkable. Her nose, neck, tongue, lungs and heart were unremarkable. Her body carried no \"significant trauma or natural disease.\" She was 55.5 inches tall and weighed 85 pounds, and when the gun went off, she was wearing a green elastic hair tie.\nNow, up on his trampoline for the first time, he turns, sees Amanda and calls out, \"I love you, Mommy.\""}