{"uri": "http://mtpr.org/post/deer-lodge-residents-stunned-after-murdersuicide-claims-family-five", "title": "Deer Lodge Residents Stunned After Murder/Suicide Claims Family Of Five", "dct": "Tue, 09 Jun 2015 00:00:00 GMT", "id": "5f5fb64c1f3b66c5542077509f7266ba", "content": "This week, people in the community of Deer Lodge, population 3,000, are trying to come to grips with a great crime, and a great loss.\nChief Tim Barkell with the Anaconda-Deer Lodge County Police says they got a call Sunday morning from a man described only as an “acquaintance” of Michael Augustine Bournes, saying that Bournes had just killed his wife and three children, and planned to take his own life.\n\"I then went up to the station, talked to the acquaintance by telephone, and asked him what Michael had said, and why he would do this. The acquaintance stated that Michael Bournes said his wife had been mocking him and riding him all day.\"\nBarkell says police had no address for the family, but they eventually found the cabin on fire in the hills near the Orofino Camp Ground. After fire crews doused the flames, investigators determined that Bournes, who was 59, had shot his 37-year-old wife Arie Lee, and their 15-months-old daughter also named Arie inside the home, before he headed outside and shot their two boys, five year-old Gus and four year old Woodrow, and bringing their bodies inside and laying them on the bed beside their mother and sister.\n\"The adult male, Michael Augustine Bournes, then laid next to the children and shot himself in the head, after setting fire to the couch.\"\nChief Barkell says although Bournes had a collection of \"constitutionalist\" literature and generally wanted nothing to do with government officials of any kind, he and his family were not known to the local police before last weekend.\nIn Deer Lodge, a city of 3,000 people, Bournes, who went by his middle name Augustine, and his wife Arie were well known, not as loners or extremists but as a fairly normal family that often came to town.\nMuriah Buck owns a restaurant on main street, where the couple and their kids would often eat.\n“I met the whole family actually. They came into the restaurant on many occasions, sat here and ate,\" Buck says. \"My husband and I, we held her baby so she could eat, we’ve chatted with the kids, we’ve chatted with her, she was wonderful, she was such a sweet girl.\"\nBuck described Augustine Bournes as a controlling man whose behavior she found troubling.\n“It was always kind of an uncomfortable situation, because he would make her hurry up and finish, and they would leave even if she wasn’t done. She just seemed like kind of docile, that she was really controlled by him,\" Buck said.\nIn a booth nearby, high school senior Tiana Albery remembers working with Arie, the mom, on a community theater production just a few days ago.\n\"We were painting sets for a cast work-day for 'To Kill a Mockingbird' and we were all just joking around and she seemed fine. She was pretty upkept and kept to herself but still would joke around.\"\nAlbery too remarked how normal the family appeared.\n\"I saw her around town with the kids a lot, like at Safeway, or restaurants. You wouldn’t think anything was going on with how well behaved all the kids were,\" Albery said.\nIn the next booth over, Ed Murphy of Warm Springs was chatting with a friend. He too knew the family, and know what their loss is doing to the community.\n\"I’m friends with their coach, who coached their two boys in t-ball, and she is devastated. She like all her kids, but they were among her top favorites. Woodrow and Gus, they were smart little kids. Woodrow was probably, I think he was probably three the first time he spelled his name for me.\"\nMurphy says Augustine Bournes appeared to be loving dad, who enjoyed being with his kids, but he too noticed something troubling in the man’s behavior.\n\"I knew he was very, very angry and unhappy, and very difficult to talk to. I knew he was angry, but I couldn’t have imagined anybody being that angry.\"\nPolice chief Tim Barkell says officers who responded to the crime scene Sunday and found the bodies of all five family members will receive mandatory counseling to deal with the experience. The people of this community will have to deal with the murder-suicide in their own way; they are already talking about it with each other, at places like Muriah’s Restaurant."}