{"uri": "http://www.click2houston.com/news/8-year-old-shot-in-head-dies-while-playing-with-gun-police-say_20151123143403878", "title": "8-year-old shot in head, dies while playing with gun, police say", "dct": "Fri, 31 Jul 2015 12:06:00 GMT", "id": "b4b78560b9764f7cf0cb84b0855ccbff", "content": "HOUSTON - An 8-year-old was shot and killed while playing with a gun inside a house in southeast Houston on Thursday afternoon, according to police.\nAccording to officers, the incident was called in about 4:45 p.m. at 8442 Tavenor Lane near Hobby Airport.\nPolice said an 8-year-old and 11-year-old found two guns inside a home they were visiting and began playing with one of the guns. According to officers, they were throwing the gun back and forth when it went off and the 8-year-old was struck in the head.\nThe child died at the scene. The case will be handed over to the Harris County District Attorney's Office.\n\"We believe that the magazine was not in the firearm but one round was chambered in the barrel,\" said Detective Robert Klementich with the Houston Police Department homicide division.\nForensic testing will be done on the weapon to be sure. Police said it was .380 semi-automatic handgun.\nInvestigators said the guns were unsecured in the home.\n\"We don't own guns, I know they don't own guns, so I don't know,\" said Jordan Hightower, whose 11-year-old brother was involved in the shooting.\nHightower told KPRC 2 News he knew the 8-year-old victim very well, and their families were close friends. He didn't know there were guns in the home.\nThe boys were visiting the home where the shooting happened.\nPolice said the boys were home alone with two 12-year-old girls when the accident happened. The adults had just run out to pick up dinner.\n\"He had a bright future,\" Hightower said. \"He was smart in school and played football. Now, I'll never see him again.\"\nThe victim has not been identified.\nNo charges have been filed at this time.\nCopyright 2015 by Click2Houston.com. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}