{"uri": "http://www.khou.com/story/news/local/2015/07/30/child-fatally-shot-in-se-houston/30911443/", "title": "8-year-old Houston boy fatally shot while playing with gun", "dct": "Fri, 31 Jul 2015 00:00:00 GMT", "id": "cf06f45c0f2bc04a20df727426ce2670", "content": "HOUSTON - Two young boys were playing with a gun when it went off and fatally struck one of them in the head, Houston police said.\nDetectives with the Houston Police Department said the 11-year-old and 8-year-old found two guns inside an upstairs bedroom at a home near Hobby Airport in southeast Houston. Police said the boys didn't think the gun was loaded because there was no magazine, but there was a round in the chamber.\n\"I just saw him yesterday. We were playing basketball at the gym. He had a bright future,\" said Jordan Hightower, god-brother to the boy who investigators say tragically lost his life Thursday night. \"I heard my little brother was playing with a gun. It ended up being a real gun and accidentally shot my god-brother.\"\nPolice were called to the scene at 8442 Tavenor Lane around 5 p.m. Thursday.\nPolice said there were four kids in the house at the time of the shooting—the two boys upstairs and two girls downstairs. The adults had left to get food for the kids. According to police, the gun belonged to the homeowners, and all the kids in the house were visiting.\nThe two girls ran to a neighbor's house and told adults of the shooting. When police arrived the boy was already dead.\n\"I just want to give him a hug,\" said Hightower about his 11-year-old brother. \"I just want to give him a hug, just to let him know that everything else is going to be OK.\"\nPolice said it appears the shooting was an accident, but evidence will be turned over to the Harris County District Attorney's Office.\nThe incident serves as an important reminder to parents.\n\"As a gun owner, you have to have responsible ownership, and that includes securing your firearms in a locked box,\" said Detective Robert Klementich with HPD's Homicide Division.\nHPD stated Friday that no charges have been filed as the investigation is continuing."}