{"uri": "http://www.oregonlive.com/washingtoncounty/index.ssf/2016/10/beaverton_police_investigating_2.html", "title": "Dad kills 2 children, then himself, in Beaverton", "dct": "Thu, 06 Oct 2016 12:34:25 GMT", "id": "be81b84851ccbaf08eb93188c8cd9670", "content": "Update: Police have identified the father and children.\nA father killed his 6-year-old son and 8-year-old daughter before fatally shooting himself at a Beaverton apartment complex, police said Wednesday.\nA female relative found the three inside a unit of the Redwood Creek Apartments at Southwest Windmill Drive and Greenway Boulevard, police said.\nShe called police just before 4:30 p.m. and officers arrived and entered the apartment shortly after. They found the two children and their father and believed they all were dead, said Officer Jeremy Shaw, a Beaverton police spokesman.\nPolice backed out to preserve the scene, and as they reached the threshold of the front door, officers heard the racking of a gun's slide followed by a single shot, Shaw said. Before the gunshot, he said, the man's wounds appeared so serious that officers had believed he was dead.\nThe county's Tactical Negotiations Team then responded to the scene, entered the apartment and confirmed the three fatalities. Shaw said the 36-year-old father fatally shot himself but he didn't say how the two children died.\nThe father lived there with the children and their mother, Shaw said. He didn't know whether the couple had other children or whether the mother was home at the time of the killings. She was not wounded, Shaw said.\n\"They're in our thoughts and in our hearts,\" Shaw said. \"As they grieve, we grieve as a community.\"\nShaw didn't know whether Beaverton police had ever contacted the family before.\nBeaverton detectives are investigating along with members of the Washington County Major Crimes Team, who heard the call over the police radio and showed up to help.\nAshley Allen, who lives on the other side of the sprawling apartment complex, said she was walking to the community gym when she heard sirens from an ambulance and police cars. She wondered what happened.\nAt the gym, her neighbors explained what they'd heard: Two children and a man were dead at a unit in their complex.\n\"It's really awful,\" she said.\nAllen said she moved to the Beaverton area last year from Los Angeles and then into the Redwood Creek Apartments in July. She said she thought she had left violence behind by coming to Oregon.\n\"There's an eclectic group of people who live in such a big complex,\" she said.\nBut before Wednesday, she said, it'd been relatively quiet.\nNeighbor Herman Fanger was coming home from walking his dog when he saw police cars drive by. He tried to go to his apartment, which is behind the one where the man and children were found.\nA police officer stopped him and told him there was a hostage situation and to move away from his building, Fanger said. Later, an officer told him it was safe to go back inside.\n\"It hits close to home,\" Fanger said. \"It's sad, it's pretty sad. Some people seem to make terrible choices.\"\n-- Samantha Matsumoto, Jim Ryan, Everton Bailey Jr. and Rebecca Woolington"}