{"uri": "http://www.nydailynews.com/new-york/nyc-crime/shot-gun-fight-brooklyn-church-sources-article-1.2201266?utm_content=bufferf2c9b&utm_medium=social&utm_source=facebook.com&utm_campaign=NYDN+Facebook", "title": "Two dead, four wounded in possible gang-related shooting outside funeral service in Brooklyn", "dct": "Tue, 28 Apr 2015 02:55:23 GMT", "id": "a4783bfa7f7ff4f0bd1e4de9f3e0eb9a", "content": "A Brooklyn funeral took a lethal turn Monday when a shootout erupted outside the service, leaving six people wounded -- two mortally, authorities said.\nMore than 40 people were leaving a service for 39-year-old Jose Luis Robles at the Emmanuel Church of God on Flatbush Ave. near Foster Ave. at about 8:30 p.m. when three men fired up to 15 shots into the crowd.\nOne funeral attendee fired back, wounding one of the assailants before the three men fled in a silver SUV, cops said.\n“People (were) shooting in front of the location in towards the church, and one shooting from the church out,” NYPD Chief of Detectives Robert Boyce said. “Right now the investigation is early on, we're trying to figure things out about what happened.”\nPanicked mourners and pedestrians scrambled for cover.\n“It sounded like a war ... boom, boom, boom,” said witness Carlo Stamand, 60, who owns the nearby Cafe Creole restaurant. “I ran. After that, the police came.”\nRobles died of natural causes on April 16.\nTo view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nHe was a “former gang member” who did time in prison and may have been affiliated with the Bloods, police sources said.\n“Rival gang members heard about the funeral and decided to start shooting the place up,” a police source said.\nAngela Diggs, 50, was worshiping at another church when gunfire — which was picked up by the NYPD’s new ShotSpotter system -- rang out.\n“We didn’t come out,” she said. “We just continued praying for whatever was happening out there. Praying that nobody died.”\nBut when the smoke cleared, two men were dead, police said. Four others, including two women, were wounded.\n“I saw two guys on the floor, right in front of the church,” said witness Jose Donate, 54. “The cops tried to do CPR, but it looked like they were already dead. (The cops) were pumping them. They said ‘Come on, come on, breathe!’ ”\nThe dead included a 44-year-old man who was hit in the chest and a 40-year-old man who took a bullet to the stomach, officials said. Neither was identified.\nBoth died at Kings County Hospital, according to authorities.\nA second 40-year-old man — believed to be one of the gunmen — was found shot in the stomach five blocks away in a vehicle on E. 32nd St. and Farragut Road. His accomplices had vanished.\nOther victims included a 38-year-old woman shot in the leg, a 37-year-old man shot in the hand and a 29-year-old woman who showed up at Kings County Hospital a half hour later, shot in the leg.\nSome witnesses said the shooting took place after a fight broke out as people waited outside to pay their respects.\n“This was about something that happened 20 years ago and had nothing to do with Robles,” a source close to the investigation said. “(The shooter) confronts one of the victims and gets punched. That guy’s friend pulls a gun and starts shooting.”\nOne of the dead men had jumped in front of his wife as the gunman started shooting, the source said. His wife suffered critical injuries.\nCommunity leaders were outraged by the gunplay.\n“This again proves that there are too many guns on the streets in the hands of people who have no regard for human life,” said community activist Tony Herbert, founder of the One Family, One Community Initiative, an anti-violence campaign where stakeholders from community, religious and business groups work together to steer kids away from gangs and violence. “This is definitely a call for the mayor to get on board with our agenda.”\nRobles’ relatives did not believe the shooting was connected to their dearly departed family member.\n“Whatever was happening, it had nothing to do with the funeral,” said Alcides Perez, 31, Robles’ nephew and an Iraq War veteran who suffers from post-traumatic stress disorder.\n“I was outside getting fresh air, and I ended up seeing something worse. It reminded me a lot of Iraq.”\nNo arrests were immediately made.\nON A MOBILE DEVICE? WATCH VIDEO HERE."}