{"uri": "http://www.newsnet5.com/news/local-news/oh-cuyahoga/cleveland-heights-man-charged-with-murder-in-death-of-15-year-old-boy-at-mr-hero-restaurant", "title": "Cleveland Heights man charged with murder in death of 15-year-old boy at Mr. Hero restaurant", "dct": "Wed, 19 Oct 2016 11:42:00 GMT", "id": "7e8f77d202fc503f63284a1e9ae5a924", "content": "Autoplay:Family of 15-year-old killed in Mr. Hero armed robbery wants justiceCONNECTING...\nCLEVELAND HEIGHTS, Ohio - A 20-year-old Cleveland Heights man was charged with the aggravated murder in the slaying of a 15-year-old boy at a Mr.Hero restaurant.\nWATCH LIVE as Daveion Perry appears in court at 2 p.m. on the News 5 Facebook page.\nDaveion Perry is charged with aggravated murder, two counts of felonious assault, two counts of aggravated robbery and two counts of kidnapping for the slaying of Sunny Ravi Patel and another robbery, Cleveland Heights police announced during Wednesday press conference.\nPatel was found by police with a gunshot wound in the head inside the fast food restaurant about 8 p.m. Friday.\nPolice performed first aid to Patel until paramedics arrived. He was taken to University Hospital where he later died.\nPatel was a sophomore at Mayfield Heights High School. He was buried Monday.\nPerry, who matched the description of the man seen on surveillance video at the Mr. Hero restaurant, is accused of committing a second robbery Saturday night in University Heights.\nPolice officers arrested Perry after he was observed putting on a white mask and gloves and entering a Dollar General on Lee Road at East Overlook Road Sunday about 9 p.m. Perry came out of the store with a gun and refused to follow commands by officers.\nHe ran away, but was later caught inside of a garage by police.\nPerry is scheduled to be in court at 2 p.m. Wednesday. Watch Perry's afternoon court appearance by clicking here.\nCuyahoga County court records show an open criminal case against a Daveion Perry from earlier this year. Perry was charged with two counts of robbery for an incident that occurred March 20. Court records show Perry was released on bond for the charges. He was scheduled to be sentenced for the burglary charges Oct. 27, the court records said."}