{"uri": "http://www.burlingtonfreepress.com/story/news/local/2016/11/13/police-hunter-shoots-his-own-foot/93770876/", "title": "Police: 2 shoot themselves while hunting", "dct": "Sun, 13 Nov 2016 00:00:00 GMT", "id": "6eb6600f32ea8f18b792d0d6050452f0", "content": "Two people were taken to the hospital after accidentally shooting themselves in the foot while hunting in Vermont on Sunday morning, Vermont State Police said.\nVermont's rifle deer hunting season opened Saturday.\nIn the first incident, police said Patrick Dixon, 47, of West Chazy, New York, was transported to the Dartmouth Hitchcock Medical Center in Lebanon, New Hampshire, after sustaining the gunshot wound to his right foot.\nIn the second incident, police said a 15-year-old, whose name they withheld, was hunting near his home in Royalton and shot himself in the foot when he lost control of his gun.\nState police, Vermont Fish and Wildlife Department game wardens and emergency medical services were called to the first incident on Reed Road in Vershire shortly before 7 a.m. Sunday for the report of a man who sustained a gunshot wound to his foot while hunting.\nPolice discovered Dixon was part of a hunting party consisting of his family and friends. Preliminary investigation showed that Dixon was completing final preparations for hunting after being dropped off in the area of Reed Road when he accidentally shot his foot with a rifle, police said.\nMembers of Dixon's hunting party assisted him to a nearby residence where he was met by emergency responders and transported to the hospital, police said.\nLater in the morning, around 10:46 a.m., Vermont State Police received a call from Gifford Medical Center in Randolph saying there was a 15-year-old patient who had sustained a gunshot wound to the foot. A trooper and a game warden responded to the hospital.\nInvestigation showed that the teen was hunting near his home on Gage Road in Royalton, and he attempted to get up from a stump on which he sat. Police said the boy lost control of his gun and tried to grab hold of it before the gun discharged a round into his foot. The boy had been brought to the hospital in a private vehicle.\nPolice believe there is no outstanding safety risk to the public stemming from the incidents. Police said the Vershire incident remains under investigation by game wardens and Vermont State Police.\nThis story was first posted online on Nov. 13, 2016, and it has been updated.\nDo you have a breaking news tip? Call us at 802-660-6500 or send us a post on Facebook or Twitter using ‪#BFPTips."}