{"uri": "http://miami.cbslocal.com/2014/08/05/teen-charged-in-deadly-florida-city-shooting/", "title": "Teen Charged In Deadly Florida City Shooting", "dct": "Tue, 05 Aug 2014 19:02:00 GMT", "id": "651e9dfb7fd519e95a1b4e67bd2d4e79", "content": "MIAMI (CBSMiami) – A Florida City teen has been charged in the shooting death of another teen over the weekend.\nDarin Booker, 13, died from a gunshot wound Sunday night just blocks from his home.\nEarly Tuesday Curtis Hollinger, 15, was arrested and charged with manslaughter and resisting arrest without violence.\nJuvenile Judge Angelica Zayas ordered Hollinger held in secure detention. A prosecutor told the judge the state may “direct file” the case against Hollinger to adult court. Manslaughter can carry a penalty of up to 30 years in prison.\nClick here to watch Gary Nelson’s report.\nA defense attorney waived Hollinger’s appearance in court, in order to avoid his being photographed by a television camera in the courtroom. No family members appeared in court.\nWitnesses told police a large group of family friends were talking in front of a home at 425 NW 13th Street when Hollinger brought out a gun. While showing it off, he thought he fully unloaded it and then fired it three times.\nThe gun, however, was loaded and the third time he pulled the trigger a bullet fired and struck Booker.\nBooker’s friend, Ashley Kendall, who was across the street at the time of the shooting believes it was accidental.\n“They was playing with the gun and just trying to see like the parts of it and he was trying to take the bullets out but he left one in. He pointed it at him and he shot it. Nothing happened. Shot it again, nothing happened. The third time the boy got shot in the chest,” said Ashley Kendall. “I’m very sad. I watched him die. It hurt my heart.”\nAfter the shooting, Hollinger ran off and hid the gun in some nearby bushes. After giving sever false statements, he finally confessed during questioning, according to his arrest report.\nCBS4’s Gary Nelson learned Hollinger told investigators that he had bought the gun off the street from another kid in what would be an illegal cash transaction.\nEarlier Tuesday, a man at Hollinger’s home slammed the door on the face of a CBS4 News reporter.\nBooker was a seventh grader at Redlands Middle School. Friends said he loved to laugh and play football.\nThe dead boy’s uncle on Tuesday said the family takes little comfort in Hollinger’s arrest.\n“It won’t bring Darin back,” said the uncle, Travis Jackson. “He was only 13-years-old. It [the arrest] won’t change nothing.”\nCassandra Anderson, Darin’s mother, said she was heartened to learn Hollinger will be held accountable for his actions, and spoke of the loss of her son.\n“He will never walk through my door again,” she said. “I’m expecting him to come home, but he will never come home again.”\nA vigil in Darin’s memory is planned for Thursday at 7pm at the scene of the shooting.\nRELATED CONTENT:\nFollow\nGary Nelson has been a member of the CBS4 News team since September, 1992, coming on board in the days following Hurricane Andrew, a storm that ripped a swath of devastation across our community and ripped the roof off Gary's house. Ga...\nMore from Gary Nelson"}