{"uri": "http://miami.cbslocal.com/2014/08/04/teen-killed-in-florida-city-shooting/", "title": "Suspect In Custody In Shooting Death Of Florida City Teen", "dct": "Mon, 04 Aug 2014 23:00:00 GMT", "id": "a9078b3173003758782eb772b1ad330a", "content": "FLORIDA CITY (CBSMiami) – Miami-Dade Police have made an arrest in the shooting death of a Florida City boy.\nDarin Booker, 13, was killed Sunday night just blocks from his home.\nPolice said charges against a suspect were pending Monday night, but did not release that person’s name.\n“There’s a lot that I need to know, a lot that I need to know,” said Helen Booker, the victim’s grandmother.\nBooker told CBS4’s Peter D’Oench, “I loved him. That’s my only son’s son. Of course Iove him. We all know he wasn’t a perfect kid but he was a loveable kid. Both sides know that.”\nBooker’s mother had hoped to speak to reporters outside the family’s Florida City home. But when D’Oench asked her if there was anything she would like to say about her son, she answered “no” and then broke down in tears and had to be escorted by loved ones into her home.\nIt happened around 9:20 p.m. at 425 NW 13th Street.\nWitnesses told police a large group of family and friends were talking in front of the home at that address when a 15-year old brought out a gun he said wasn’t loaded. While showing it off, he fired three times at his friends.\nThe gun, however, was loaded and the third time he pulled the trigger a bullet fired and struck and killed 13-year old Darin Booker.\nBookers friend, Ashley Kendall, who was across the street at the time of the shooting believes it was accidental.\n“They was playing with the gun and just trying to see like the parts of it and he was trying to take the bullets out but he left one in. He pointed it at him and he shot it. Nothing happened. Shot it again, nothing happened. The third time the boy got shot in the chest,” said Ashley Kendall. “I’m very sad. I watched him die. It hurt my heart.”\n“They say this man pulled his gun and shot two times, two times and nothing came out,” said Helen Booker. “That’s murder. That’s murder. The 3rd bullet came out after he pulled it.”\nBooker’s aunt, Michelle Jackson, said, “This is very painful, very painful. I helped raise Darin as a child. I just want to get to the bottom of this and hope that justice will play out.”\nKiana Simmons, a friend of Booker, said she was in the house when she heard the shot.\n“I came outside and it was like, no, my cousin came inside and said ‘oh, somebody is shot, somebody is shot’ he told momma. We came outside and Darin he hit, he hit the gate and fell and he was like taking his last breath. I was just crying cause that was hurtful, like we used to play together and we knew each other. We used to play football, basketball and today we were playing football in the park,” said Simmons.\nViola Knight was one of the first adults to reach the scene of the shooting.\n“All the kids went running by, wild and screaming, they went and got his mother from around the corner. It’s just sad, it’s a sad tragedy,” said Knight.\nBooker’s cousin, Thomas Daniels, doesn’t believe the shooting was an accident.\n“It wasn’t that, the whole neighborhood knows, everybody seen that it went, they knew that gun was loaded,” said Daniels.\nDaniels said his cousin and two of the teens involved were friends who had recently had a falling out. Daniels believes his cousin was murdered.\n“They was his friends at one time but I guess he did something to them and they didn’t like him no more and they did that to him,” said Daniels.\nBooker was a seventh grader at Redlands Middle School. Friends said he loved to laugh and play football.\nHis sister, Keke Anderson, said “It just doesn’t seem right. To think he was having a beef with those teenagers and we didn’t know about. He didn’t know if would mean so much trouble otherwise he wouldn’t be around them. We just want to know what happened and why it happened.”\nA vigil in Darin’s memory is planned for Thursday at 7 pm at the scene of the shooting.\nRELATED CONTENT:"}