{"uri": "http://chicago.suntimes.com/news/15-shot-3-fatally-in-city-attacks-since-friday-evening/", "title": "11 killed, 48 wounded in Christmas weekend shootings in Chicago", "dct": "Sat, 24 Dec 2016 06:30:00 GMT", "id": "695e388a159d630b02bd14b8cee4504c", "content": "Sign-Up for our News & Politics Newsletter Sign-Up\nA violent year in Chicago appears poised to grind to the end of the calendar, as 11 men were killed and at least 48 more people were wounded in shootings across the city over Christmas weekend.\nThe 59 gunshot victims tallied between Friday evening and Tuesday morning nearly doubled the toll from the same four-day holiday weekend last year, when 30 people were shot across the city, leaving six dead.\nThe weekend’s most recent homicide happened about 9:20 p.m. Sunday in an East Chatham neighborhood mass shooting that left two men dead and five others wounded, two critically, on the South Side, according to Chicago Police. People were gathered for a party on the porch of a home in the 8600 block of South Maryland when someone wearing a gray hooded sweatshirt walked out from an alley and opened fire. The shooter then ran away.\nJames Gill, 18, was shot in the head and pronounced dead at the scene, and 21-year-old Roy Gill III died of multiple gunshot wounds at Christ Medical Center in Oak Lawn, according to police and the Cook County medical examiner’s office. A 35-year-old man suffered multiple gunshot wounds and was also taken to Christ, where he was listed in critical condition, and a fourth male shot in the body was taken in critical condition to Stroger Hospital. Also, a 27-year-old man and 21-year-old woman each suffered a gunshot wound to the leg and were taken to Stroger, where their conditions were stabilized. A 39-year-old man shot in the foot later showed up at Roseland Community Hospital. He was listed in good condition.\nAbout 4:30 p.m., officers responded to a call of a person shot in the 2800 block of East 79th Street in the South Shore neighborhood and found 25-year-old Jamil Farley with gunshot wounds to the back, leg and head, according to police and the medical examiner’s office. Farley, of the 9900 block of South Clyde, was taken to South Shore Hospital where he was pronounced dead at 4:40 p.m.\nEarlier Sunday afternoon, a man was killed in a Humboldt Park neighborhood drive-by shooting on the West Side, authorities said. Jerry Thomas, 22, was in the 4400 block of West Chicago at 1:45 p.m. when a black truck drove by and someone inside fired shots, striking him multiple times. Thomas, who lived in the 1200 block of South Kolin, was pronounced dead at the scene at 2:21 p.m.\nAt 9:54 a.m., officers responded to a call of a person shot in the Morgan Park neighborhood on the Far South Side and found 24-year-old David McClure shot multiple times in the 1100 block of West 112th Place, authorities said. McClure, who lived in the same block as the shooting, was taken to Christ Medical Center, where he was pronounced dead at 10:37 a.m.\nAt 1:33 a.m. Sunday, 18-year-old Fabian Ortega was shot to death in the Gage Park neighborhood on the Southwest Side, authorities said. He was driving north in the 5300 block of South Francisco when shots rang out and he was struck in the neck and back. Ortega, of the 3500 block of West 83rd Place, was taken to Mount Sinai Hospital, where he was pronounced dead at 2:16 a.m.\nLess than an hour earlier, 21-year-old Niko L. Walker was gunned down in another South Shore neighborhood shooting, authorities said. He was found at 12:49 a.m. lying on the ground in the backyard of a home in the 2600 block of East 76th Street. Walker, of the 5700 block of South Paxton, had been shot in the head and was pronounced dead at the scene at 1:12 a.m.\nShortly before 9 p.m. Saturday, 30-year-old Nathaniel L. Edwards was found unresponsive with a gunshot wound to the left side in a backyard in the 8900 block of South Hermitage in the South Side West Englewood neighborhood, authorities said. Edwards, of the 10600 block of South Aberdeen, was taken to Christ Medical Center, where he was pronounced dead at 9:03 p.m.\nOfficers responded to a shooting just after midnight Saturday in the 3000 block of West 38th Place in the Brighton Park neighborhood on the Southwest Side and found a 27-year-old man on the ground with gunshot wounds to the head and abdomen. Juan Gonzalez was pronounced dead at the scene at 12:25 a.m., authorities said. He lived in the 3300 block of West 38th Street.\nThe weekend’s first killing happened at 10:50 p.m. Friday outside an Austin neighborhood home on the West Side. Two men walked outside in the 500 block of North Laramie, and at least one person opened fire on them, police said. The older man, 21-year-old Derrick Jones, was shot across the body and pronounced dead at the scene at 11:19 p.m. The other man, Stephen Tucker, 20, suffered gunshot wounds to the head and back and died at Mount Sinai Hospital at 11:44 p.m., authorities said. They both lived on the block where they were killed.\nIn one of the weekend’s nonfatal shootings, a teenage girl was shot in the Gresham neighborhood on the South Side. Two girls, ages 13 and 14, were sitting in a van at 11:34 p.m. Monday in the 7500 block of South Union when two males fired shots into the vehicle, police said. The 14-year-old was struck in the back and taken in critical condition to Comer Children’s Hospital. The 13-year-old was cut on the arm by broken glass and was taken to St. Bernard Hospital, where she was listed in good condition. Police initially reported that she had been shot but later clarified the details of her injuries.\nThe younger girl’s father, a 28-year-old documented gang member, was driving the van shortly before the shooting, according to police. He had just gotten out of the van and gone inside a home when the shooting occurred. Police said it was not known if the girls were the intended targets, but neither of them had any gang affiliations. A 2-year-old boy was also inside the van at the time of the shooting, but he was not injured.\nAt least 42 people were wounded in other shootings between 4:30 p.m. Friday and 1 a.m. Tuesday. Track all of the city’s shootings over Christmas weekend here."}