{"uri": "http://www.carthagepress.com/article/20160116/NEWS/160119109", "title": "UPDATE: Sheriff says father shot his two children, then shot himself", "dct": "NODATE", "id": "c836491d77c0a08cf943e91e3de228fe", "content": "A father apparently shot and killed his two young children before taking his own life at a mobile home south of Carthage late Friday or early Saturday.\nA father apparently shot and killed his two young children before taking his own life at a mobile home south of Carthage late Friday or early Saturday.\nThe Jasper County Sheriff's Office said Tony Kernel, 55, and his son, Wesley Kernel, 9, and daughter, Timber Kernel, 7, were found dead from gunshot wounds Saturday morning in a mobile home at 5920 Stone Hill Loop in the Malfunction Junction mobile home park in the Fidelity area near the intersection of Interstate 44 and I-49.\nJasper County Sheriff Randee Kaiser said the crime appears to be a murder-suicide with Kernel, the biological father, shooting his two children before shooting himself.\nAuthorities were called at 10:55 a.m., the Sheriff's Office said in a written release.\n\"A neighbor was contacted by the male's employer who said he didn't show up for work and asked the neighbor to go check on him,\" Kaiser said. \"The neighbor knocked on the door and saw what happened, then contacted us.\"\nSchool reaction\nBoth children were students at Steadley Elementary School in Carthage.\nDr. Tom Barlow, principal at Steadley, said the school was preparing to help students deal with the sudden and violent death of their friend.\n\"These demonic actions not only robbed two beautiful children of their lives, it affects the lives of those children around them,\" Barlow said. \"The Sheriff's Department notified the district staff and now we'll work on our plans to deal with this kind of thing. We're all in shock and reeling from this and now we've got to try and figure out how to help the children deal with it.\"\nNeighbors react\nRob Anderson, the neighbor who called 9-1-1, said he'll live with the scene in the front room of that trailer for the rest of his life.\nAnderson lives across the mobile home court lane from the trailer where the children were found. He said he and his children have played with the two children who were killed.\n\"I'm still sick at my stomach and I'm glad I didn't find the little girl,\" Anderson said. \"There were no red flags that we saw, nothing to look for that we could see. We knew things were rough for him with the breakup, but why take the children? I don't understand.\"\nAnderson said Tony Kernel was a cook at the Highway 59 Cafe near Diamond and he always called in if he had to miss a day of work.\nThe owner of the cafe is the brother of Anderson's wife. He called and asked that they go check on him when Kernel failed to show up for work Saturday morning and failed to call.\n\"I threw some shorts on and walked over and knocked on the door,\" Anderson said. \"It was kind of creepy, the door swung open slowly and I hollered inside for a few minutes. You know how you get the feeling something just isn't right? That's how I felt, then I saw a little foot sticking out from under a blanket on the couch. If he didn't wake up from all my yelling, something was wrong, so I checked on him and it was obvious he was gone.\"\nAnderson said he left the trailer immediately after finding the little boy on the couch and called 9-1-1.\nAnderson's daughter, Demi Anderson, said she babysat the two children from time to time and spent time with them when they were out playing in the mobile home park.\n\"I can't fathom how someone could do that to their own kids,\" Demi Anderson said. \"They were such good kids. This family will need a lot of prayers.\nCustody dispute?\nOnline Jasper County Court records show that Kernel had been scheduled to appear before Jasper County Judge Stephen Carlton on Tuesday morning for a hearing on a an amended parenting plan in a custody case between Kernel and Brandy L. Corum.\nDistraught relatives of the children's mother were at the scene a little more than an hour after the victims were found.\nJosh Beck, brother to the mother of the two children, said the mother and the rest of the family are devastated.\nHe said there were custody problems between the mother and Kernel and the family had contacted state and county officials about possible abuse on the part of the father.\n\"I've never hurt this bad in my life,\" Beck said. \"Now I've got to help my sister bury two kids that never even got to start their lives.\"\nBeck said his family had called child protective services in the past to report Kernel for abusing the children.\n\"I can't believe he didn't take my sister with him,\" Beck said while standing outside the home. \"He knew they were her weak link. This was an epic failure of state and local juvenile justice officials to protect these kids. I respect everything these officers do, I've been an officer in the past, but you don't know how helpless you feel when it happens to your family.\""}