{"uri": "http://wreg.com/2014/12/15/grandmother-boy-shot-sister-in-face-by-accident/", "title": "Grandmother: Boy shot sister in face by accident", "dct": "Mon, 15 Dec 2014 15:52:00 GMT", "id": "896e7c376baa59e02e5905a79fd1e157", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nMEMPHIS, Tenn. -- New developments in the case of a 4-year-old girl who was shot in the face Sunday night in Frayser. The Grandmother, who owns the gun, says the girl's older brother pulled the trigger, but she admits she made the mistake of not putting it away\nRosie Boylan says she keeps a gun for safety reasons because she lives by herself and doesn't feel safe.\nBoylan told WREG what happened inside her home Sunday night.\n\"I thought it was my Christmas tree,\" she explained, \"I thought something had blowed it over. I remember yelling what was that!\"\nBut that boom was the sound of her gun going off. Boylan says her grandsons found the weapon in her bed.\n\"I got up to go to church and I forgot to put it up. They came over, and I just forgot.\"\nShe admits she made a mistake, but never imagined this could happen. Boylan says the 4-year-old girl had a gun pointed toward her head, and her brother pulled the trigger. The bullet hit her on the side of the face.\nTerrance Brock lives across the street and couldn't believe the news.\n\"I came home from church, and there were police cars and ambulances all over the street,\" he said.\nInside that ambulance was the 4-year-old girl. She was back in surgery Monday morning for injuries to her jaw.\nBrock says if you have kids around you have to be more careful.\n\"I understand she wants to keep her self and the kids safe but at the same time you have to keep it away from the kids.\"\nBoylan tells WREG she lost a daughter to a gun accident years ago, and she's incredibly thankful she didn't lose a granddaughter to the same tragedy Sunday night. The family is urging people to put their guns away and get a lock, so they don't have to go through this family's living nightmare."}