{"uri": "http://www.walb.com/story/27626288/4-year-old-shot-in-frayser", "title": "6-year-old shoots 4-year-old with great-grandmother's gun", "dct": "Mon, 15 Dec 2014 02:32:00 GMT", "id": "eb01dd786a13d7dfc8c96a996cf9ecb4", "content": "MEMPHIS, TN (WMC) -\nA four-year-old was taken to Le Bonheur Children's Hospital in non-critical condition after a 6-year-old shot her Sunday night, according to Memphis Police Department.\nThe shooting happened in the 3300 block of Aden Street in Frayser, while the child was visiting her grandmother.\nInitially, MPD said that the 4-year-old accidentally shot herself, but later, they released a statement saying the 6-year-old child was responsible for the incident.\n“Just thank God she's gonna be alright,” said Rosie Boyland.\nShe's been worried about her great-granddaughter since she was shot Sunday evening.\nFour-year-old Brila was visiting her great-grandmother's house when she was accidentally shot in the face by a 6-year-old. MPD would not release further details, and it is unclear at this point whether the two children are related.\n“She ran to me holding her face. I was telling her not to cry,” said Boyland.\nBrila was taken to the hospital in non-critical condition. The bullet grazed the side of her face. Her mother tells WMC Action News 5 that she had surgery Monday and may not have vision in one of her eyes.\n“I didn't know they was coming. I stay here by myself and I have to have some type of protection, but now I have a different outlook on things,” said Boyland.\nShe says they've had conversations about guns in the past, she never imagined Brila or the others would find the gun, let alone pick it up.\nAn undercover WMC Action News 5 investigation in May revealed that many children, the same age as Brila, were curious enough to pick up the gun.\nIt served as a powerful teaching moment for parents and kids alike.\n\"The only reason I want you to know to never touch a gun is because it can kill you, and then I won't have you. I won't be with you every day. OK? Promise me that you won't touch no more guns,” said Lacy Brassfield.\nBoyland's family says she slept with the gun, though it is unclear where it was stored otherwise.\n\"Well, we thought it was my grandma that had got shot in the face, but when I got here they told me it was my little cousin.\" said Kiara Marshall. \"It was like the worst news tonight.\"\nIn this case, Brila is expected to be okay and at this point no charges have been filed. However, Memphis police says this incident is a good reminder to purchase a gun lock. MPD offers free gun locks at all precinct locations.\nRosie Boyland says this whole incident has put life in perspective.\n“Put your guns up, you know. Might even be best not to have one. I don't think I want another gun,” said Boyland.\nYou can pick up a free gun lock at the following law enforcement agencies while supplies last:\nMemphis Police Department\nClick here to find the Memphis police precinct nearest you.\nWest Memphis Police Dept.\n626 E. Broadway Blvd\nWest Memphis, AR. 72301\n870-732-7535\nTipton County Sheriff's Office\n1801 S. College St.\nCovington, TN. 38019\n901-475-3000\nSouthaven Police Dept.\n8710 Northwest Dr.\nSouthaven MS. 38671\n662-280-2489\nDyer County Sheriff's Office\n401 E. Cedar St.\nDyersburg, TN. 38024\n731-285-2802\nGermantown Police Dept.\n1930 S. Germantown Rd.\nGermantown, TN. 38138\n901-754-7222\nBartlett Police Dept.\n3730 Appling Rd.\nMemphis, TN 38133\n901-385-5555\nMillington Police Dept.\n7950 Memphis Ave\nMillington, TN. 38053\n901-873-3886\nCopyright 2014 WMC Action News 5. All rights reserved."}