{"uri": "http://koin.com/2016/06/27/possible-multiple-victims-in-marion-county-shooting/", "title": "3 dead, 1 critical in berry farm shooting near Woodburn", "dct": "Mon, 27 Jun 2016 12:01:00 GMT", "id": "5767cb6ad786103f251c872e276b8121", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nWOODBURN, Ore. (KOIN) — Three people were killed and another critically injured in a shooting Monday at a berry farm outside Woodburn.\nReports of the shooting came in around 11:05 a.m. and police arrived at the farmhouse on the 13000 block of Killiam Road NE about 15 minutes later.\nTwo men were pronounced dead at the scene, and the third person, a woman, died later, officials told KOIN 6 News.\nThe shooting happened at an operational berry farm that has a legal marijuana grow operation, but investigators do not believe it’s related to the crime.\nInvestigators spent Monday afternoon combing through the large crime scene both inside and outside the house. Police said they have responded to the house before on reports of loud parties.\nOregon State Police caught the suspected shooter on I-84 east of Portland.\n“He definitely was trying to make a getaway,” Marion County Lt. Chris Baldridge said. “Luckily we were able to stop him and take him into custody without incident.”\nThe suspect was later identified as 29-year-old Bonifacio Oseguera-Gonzalez, deputies said. He is expected to be charged with 3 counts of aggravated murder and attempted aggravated murder.\nAt this time it is not clear how the people are connected to each other.\nLt. Baldridge said neighbors should call 911 if they see anything suspicious, but added he did not think the community was in immediate danger.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}