{"uri": "http://koin.com/2016/06/28/berry-farm-triple-killing-suspect-in-court/", "title": "Victims ID’d in berry farm triple murder", "dct": "Tue, 28 Jun 2016 14:02:00 GMT", "id": "62b21d99738a9d7c73ec3c42cd9f4890", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nSALEM, Ore. (KOIN) — The 29-year-old accused of killing 3 people and critically wounding another in a shooting near Woodburn on Monday was in court Tuesday afternoon.\nBonifacio Oseguera-Gonzalez was arrested along I-84 east of Portland not long after the 4 were found at a berry farm in the 13000 block of Killiam Road NE.\nAuthorities quickly got a description of the suspect and the car and let other law enforcement agencies know. Around 1:30 p.m. — just more than 2 hours after the shootings — the Oregon State Police, the Hood River County Sheriff’s Office and Hood River Police stopped the car and took him into custody without incident.\n“He definitely was trying to make a getaway,” Marion County Lt. Chris Baldridge said. “Luckily we were able to stop him and take him into custody without incident.”\nHe was charged with 3 counts of aggravated murder and attempted aggravated murder.\nAccording to court documents, Oseguera-Gonzalez admitted to investigators he shot all 4 people.\nThe berry farm was originally thought to have a legal marijuana grow operation, but investigators now say the pot farm is on another property and do not believe it’s related to the crime.\nInvestigators spent Monday afternoon combing through the large crime scene both inside and outside the house. The only previous times police went to the house were over reports of loud parties.\nVictims identified\nRuben Rigoberto-Reyes, 60, and Edmundo Amaro-Bajonero, 26, died at the scene. Katie Gildersleeve, 30, was rushed by ambulance to Legacy Emanuel Hospital in Portland. She later died from her injuries.\nThe 4th person, Refugio Modesto-DeLaCruz, was taken by ambulance to OHSU. He is critically injured but is expected to survive.\nThe 3 men lived at the Killiam Road house, while Gildersleeve was the girlfriend of another man who was not home at the time of the shootings.\nOseguera-Gonzalez, the suspected shooter, was known to “frequent the residence,” the Marion County Sheriff’s Office said in a release.\n‘Very shocking’\nA neighbor told KOIN 6 News she’s never seen any problems at the farm.\n“I think it’s, like, very shocking. I’ve never seen this before,” neighbor Jocelyn Caporal said. “It’s so calm here. I like living here. We’ve lived here all our life. It’s very peaceful and then this happening. It’s really shocking.”\nIn an email thread with KOIN 6 News, Katie Gildersleeve’s sister, Rachel Landry, said she was the most kind-hearted person she’s ever known.\n“She always thought about others before herself, she lived to laugh and was a joker always laughing and being silly. Her family was the most important thing to her she would give everything she had to make sure they were taken care of,” Landry wrote.\n“She truly was a bright light that was snuffed out too soon.”\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nGildersleeve’s mother, Linda Patt, who spoke to KOIN 6 News in a phone interview, says she’s still struggling to come to terms with the fact that she’ll never see her daughter again.\n“She’s gone. She’s gone and I can’t bring her back,” Patt said. “There’s nothing I can do to bring her back.”\nShe’s not even sure why her daughter was shot, and Patt doesn’t recognize the man who admitted to shooting 4 people. Investigators are still looking for a motive.\nPlatt hopes to come face to face with Oseguera-Gonzalez in court.\n“Do you know what you’ve taken from me? Do you even care what you’ve taken from us? Why? Give me a reason. Because God above, I want to forgive you and I know I should, but I can’t and I want an answer,” Patt said.\nDetectives say Gildersleeve was the girlfriend of a resident who wasn’t home at the time of the shooting.\nHer family says she’ll always be remembered for the joy she brought into everyone’s lives.\n“Everyone will remember Katie for her sweet disposition and her beautiful smile and her ability to make you laugh and think everything’s going to be alright and to give you hope that life can be good,” Patt told KOIN.\nFamily members set up a GoFundMe page to help with funeral expenses.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}