{"uri": "http://www.nbcnews.com/news/us-news/three-fatally-shot-party-mukilteo-washington-n620156", "title": "Gunman Shoots Dead 3 Young Partygoers at Mukilteo, Washington, Home", "dct": "Sat, 30 Jul 2016 19:46:00 GMT", "id": "9ffa0457f3528a06483c92b27ac94a38", "content": "Three partygoers were killed and a fourth was injured in a shooting spree in Mukilteo, Washington, police said.\nAbout 15 to 20 teens and young adults were inside a home in the affluent Seattle suburb when a suspect walked in and began shooting, Mukilteo police said. Most were college-aged.\nThe shooting happened in the Chennault neighborhood, not far from the Boeing airfield between Seattle and Everett. Neighbors told NBC affiliate KING5 they heard 10 to 12 shots ring out.\nOne suspect, a 19-year-old male, was in custody after being apprehended many miles to the south in Lewis County, the Mukilteo city officials said.\nPolice told reporters at a news conference that no other suspects were being sought and the alleged gunman's identity was not released.\nSnohomish County Jail records show Allen Christopher Ivanov was booked on three counts of murder, including one count of aggravated murder. A spokesman for the company Ivanov worked with, Skirmos, said \"We are as shocked and disturbed by the events in Washington state as everyone.\"\n\"These victims were just starting the new chapter of their lives as young adults,\" Washington Gov. Jay Inslee said in a statement. \"Such a loss is difficult to comprehend and we know the hearts of every Washingtonian go out to their grieving mothers and fathers.\"\nOne of the victims was identified by his family to NBC News as Jordan Ebner, who listed on Facebook that he attended Everett Community College.\n\"There were many young people who saw and heard things that no one should ever experience,\" Mukilteo Mayor Jennifer Gregerson told reporters.\n\"Our community has suffered a great loss tonight,\" she added.\nKenny Slade, who lives two blocks from the house, told The Seattle Times that he heard gunfire just after midnight from a \"large-caliber rapid fire.\"\n\"Then, right after that, there was the pop, pop, pop of a smaller weapon,\" Slade said. \"Then, after that, there were larger caliber shots.\"\nSusan Gemmer told The Associated Press that her 18-year-old granddaughter, Alexis Gemmer, hid in a closet to escape the gunman. She was hanging out with friends from Kamiak High School at the home in Mukilteo when a young man showed up with a rifle.\nGemmer said that according to her granddaughter, the gunman shot two people at a fire pit before going onto a roof and firing more shots from there.\nGemmer said the young man who lived at the home tried to lead her granddaughter to safety by running out a garage door, but as he exited the garage, the gunman shot at him.\nHe made it across the street to safety, but Alexis Gemmer ran back inside and hid in a closet, from where she called and texted her grandmother.\nGemmer said the shooter and one of the victims had recently broken up, although police did not immediately confirm a motive.\nSkirmos, the company Ivanov worked for called for gun control in the wake of the shooting.\n\"Allen Ivanov has worked with us and been our friend and colleague for a number of years. That said, this event is another example of our need for gun reform in this country. No person should have the opportunity to possess a firearm that can discharge a weapon 20 times in short succession,\" Skirmos spokesman Dave Waakeman said."}