{"uri": "http://www.charlotteobserver.com/news/local/crime/article31618352.html", "title": "Sheriff: Iredell County man who fatally shot young sons has died", "dct": "Thu, 20 Aug 2015 11:30:00 GMT", "id": "4847b5b1c823783d3f157ec0ccbf5931", "content": "An Iredell County man who admitted killing his 3- and 4-year-old sons before shooting himself Aug. 9 died Wednesday night at Carolinas Medical Center in Charlotte due to complications from his injuries, Sheriff Darren Campbell said.\nShawn Fuller admitted to shooting his sons and said he was prepared to kill law enforcement officers, according to a report released by the Iredell County Sheriff’s Office the day after the shootings.\nFuller was on the phone with an unidentified person when he made the confession, the report said.\nBut by the time deputies arrived at Fuller’s home in the 100 block of Trent Road in Statesville, a confrontation was no longer a threat. Fuller was already critically injured with a self-inflicted gunshot wound.\nDeputies found him outside his front door. They also found a weapon that had been hidden in the house by Fuller’s wife and likely was used to fire on his sons, according to the report.\nThe bodies of Uriah Fuller, 4, and his brother, Josiah Fuller, 3, lay inside the house. They suffered multiple gunshot wounds, Campbell said in the report.\nWhile only one gun was found in the home, Fuller and others frequently fired guns in the backyard, neighbors told the Observer.\nNeighbor Ronnie Patterson said Fuller had high-powered rifles as well as handguns. He said Fuller and others shot at targets such as milk jugs and cans and that several trees in the yard were damaged from the shooting.\nSometimes Fuller drank alcohol while shooting, and sometimes the children or others were there while the shooting took place, Patterson said.\nThe shooting next door was so common and disturbing, Patterson said, that his girlfriend had moved out of the house.\nJoe Marusak: 704-358-5067, @jmarusak"}