{"uri": "http://www.kansas.com/news/local/crime/article73395672.html", "title": "Family: Co-workers ‘playing’ when homicide victim shot", "dct": "Fri, 22 Apr 2016 16:22:00 GMT", "id": "ccd52be425b0c8933d0c421af0202116", "content": "Mekko Stumblingbear’s boss had forgotten to call him to say there was no demolition work to be done Friday.\nSo Stumblingbear — thinking he had to go to work — walked less than 50 steps across the street to his boss’ house Friday morning, where he got rides to work.\nStumblingbear, 19, was killed there early Friday morning. Police said he was shot in the living room of the home, at the corner of McCormick and Glenn streets in southwest Wichita.\nMegan Stumblingbear, his mother, said his co-workers inside the house were “playing with some of their Airsoft guns” — a brand of replica firearm designed to shoot pellets — when one of them allegedly picked up a real handgun and fired it at her son.\nAfter the shooting, the people inside the home scattered, and police received a call that Stumblingbear had committed suicide, she said.\nHe was pronounced dead at 7:15 a.m. Friday.\nThat didn’t make sense to the Stumblingbear family — suicide is strictly condemned in their Native American culture.\nplace_fact1\n“I was taught that (when) people that kill themselves, they don’t make it home,” Megan Stumblingbear said. “They don’t get to go to heaven.”\nThroughout the afternoon, police questioned other people inside the home and began seeking a 22-year-old man in connection with the case, Megan Stumblingbear said.\nWichita police Sgt. Nikki Woodrow said in a statement the man was arrested around 2:30 p.m. in the 2200 block of West McCormick.\nThe man arrested had just begun working with Mekko Stumblingbear on Tuesday, his mother said — he was called in to replace Mekko Stumblingbear when he was sick.\n“(He) has known Mekko … all through high school and they were fine — they never had an issue,” Megan Stumblingbear said.\n“Mekko … didn’t have an issue with anyone. He was just one of those people that had a smile from ear to ear. He always wanted everyone to be happy.”\nPolice investigators are working to determine whether the shooting was intentional or accidental, according to a news release from the department.\nMekko Stumblingbear was doing demolition work with Cessna Aircraft, said Selena Bozeman, one of his friends.\nplace_quote1\n“He was going to the military, and he was eventually going to go to college,” said Bozeman, who said she first met Mekko Stumblingbear at Jardine Middle School. “He had a good job — he was about to try and start a family, actually. He had a lot going for him and it was all just stolen from him.”\nHe was also active in the Native American community in Wichita, his mother said.\n“He’s sung ever since he was 9 months old, basically — he couldn’t even walk,” she said, fighting back tears.\nBy 5 p.m., no police cars remained at the scene.\nMegan Stumblingbear’s 6-year-old daughter ran up to her as she stood on the sidewalk, facing the home where her son was killed.\n“Mom, come see what we drew for Mekko! It’s very pretty,” she said.\n“OK, I will — give me one second,” Megan Stumblingbear said, wiping her eyes as she averted her glance from the home.\nMatt Riedl: 316-268-6660, @RiedlMatt"}