{"uri": "http://wjhl.com/2016/01/14/kingsport-father-accused-of-shooting-4-year-old-son-with-a-pellet-indicted-on-drug-charges/", "title": "Kingsport father accused of shooting 4-year-old son with a pellet indicted on drug charges", "dct": "Thu, 14 Jan 2016 16:21:00 GMT", "id": "6b82bd9364f2e7fdc783e158cf186d89", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nKINGSPORT, TN (WJHL) – A Kingsport man accused of shooting his 4-year-old son with a pellet rifle which caused the boy to be sent to a Knoxville hospital has been indicted on federal drug charges.\nMarco Bobo, 38, and seven other people were named in a thirteen-count federal indictment for distributing crack cocaine. That indictment was filed Tuesday in federal court in Greeneville. Authorities said 280 grams of the drug was distributed between October 2014 and this past November.\nEarlier this month Bobo was charged by Kingsport police with reckless aggravated assault for the injury to his son. That injury happened Jan. 8 as Bobo was firing a high-powered adult pellet rifle at targets across the street from a home on Michelham Drive, according to police. While he was target shooting, his son was struck in the head one time.\nPolice said the boy was taken to the University of Tennessee Medical Center in Knoxville.\nCopyright 2016 WJHL. All rights reserved.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}