{"uri": "http://www.wndu.com/home/headlines/Toddler-killed-in-suspected-accidental-shooting-289297351.html", "title": "Gunfire kills 3-year-old boy in Benton Township", "dct": "Wed, 21 Jan 2015 09:36:00 GMT", "id": "b54ecc3db3674b1f86939a580fe6ccf1", "content": "A three year old boy was shot and killed in his own home early this morning.\nIt happened in Benton Township in the 1600 block of Norton Street. Police got the call at 1:18 a.m.\n“If it was the little boy, he was a great, great kid,” said Jimmey Bolin, who lives next door. “We have a little dog and he always wanted to pet the dog, and wave to him and say hi, and just, you know, it breaks your heart if it’s the little boy.”\nBolin said a young boy lived at the home with two older sisters and his mom and dad.\nA written press release issued this morning from the Benton Township Police Department reads; “Initial indications are this was an accidental discharge of a weapon resulting in a fatality. No one else was injured at the residence. Names of the individuals involved are being withheld at this time while the incident remains under investigation.”\nThe release goes on to say that two firearms were recovered at the scene and that both were registered to one of the residents.\nOutside the home today, toddler toys were scattered about the yard and a mini-van was parked in the driveway.\nFor neighbors, that sense of normalcy was shattered when police tape was added this morning.\n“Last night I was just about to go to sleep and everything and I heard some kind of commotion and some screaming, so I came outside my door and about four or five cop cars rushed up and I seen ‘em run inside,” said Bolin. “We’ve never had the cops down here. We rarely ever see the police down here and if it is, it’s just driving down to the end of the road then turn around but, pretty quiet neighborhood.”\nAt this point, police aren’t saying if anyone was touching the gun when it went off, whether that be the boy or an adult.\nThe case has generated more than 150 comments on the WNDU Facebook page where some can’t imagine any scenario in which a toddler and a gun would be in the same place at the same time, while others argue that people should wait for the facts and that this is a good family that is hurting due to an accident."}