{"uri": "http://wkrn.com/2015/12/12/girl-dies-after-being-shot-in-estill-springs/", "title": "Girl dies after being shot in Estill Springs", "dct": "Sat, 12 Dec 2015 12:53:00 GMT", "id": "345bddf36fd5530c64057d1cc7725521", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nESTILL SPRINGS, Tenn. (WKRN) – Authorities say an 11-year-old girl has died after she was shot in Estill Springs Friday evening.\nIt happened in the 100 block of Honey Lane, about 85 miles south of Nashville, around 6:30 p.m.\nDeputies located the victim, identified as Sienna Owens, in the garage with a gunshot wound to her upper back.\nAccording to Franklin County Sheriff Tim Fuller, a responding deputy attempted to perform CPR.\nSienna was transported to Southern Tennessee Medical Center where she died.\nAn autopsy will be performed to determine if the shooting was accidental or intentional. Authorities are also working to determine if it was neglectful.\nAuthorities told News 2 Sienna did not live at the home where the shooting occurred and that they know who the shooter is.\nThe investigation is ongoing and no one has been detained for the incident yet.\nThe Rain Teen Center opened its doors Saturday to serve as a place for the community to come celebrate Sienna’s life. A sign outside the nonprofit expressed its sentiments to the Owens family for their loss.\nYouth pastors were on hand for those in need of counseling.\nEmployees told News 2 that Owens regularly attended the facility and that they recently nicknamed her “Smiley,” as she was always smiling.\nDozens of people from the community, including family of Owens, attended a vigil Saturday night.\nThe event was held in a soccer field at dusk, because Sienna’s middle name was Dusk.\nRed and blue balloons were released in her honor.\nAttendees told News 2 Sienna’s soccer coach retired her jersey and gave the family a signed ball from the team.\nA GoFundMe account was set up to help the family with funeral expenses. Click here to donate.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}