{"uri": "http://www.roanoke.com/news/crime/roanoke/no-arrests-in-roanoke-weekend-shootings/article_d8b58b02-65ac-57fd-bb9d-98e9410cc2ae.html", "title": "No arrests in 3 Roanoke weekend shootings", "dct": "Tue, 08 Nov 2016 12:45:00 GMT", "id": "e9bf4dfda49f854c766cfb07a64315a1", "content": "The first shooting happened at 1:58 a.m. Saturday. Officers went to the 1500 block of Wellsley Street Northwest and found a teenager on a driveway with a gunshot wound to his abdomen, police spokesman Scott Leamon said. He was conscious and alert when he was taken to Carilion Roanoke Memorial Hospital.\nLeamon said investigators determined that a black Jeep drove up after the teenager arrived at the house. The teenager spoke with someone in the Jeep, and then one of the occupants shot him.\nThe second shooting happened at 10:58 p.m. Sunday, about a mile and a half away. A report of shots fired sent police to the 2500 block of Centre Avenue Northwest, where they found James Earl Zimmerman, 19, with a graze wound to his chest, Leamon said. Zimmerman told officers that someone in a black Jeep shot him. An ambulance took him to Roanoke Memorial for treatment.\nA half-hour later, at 11:32 p.m., officers went again to the 1500 block of Wellsley Street Northwest for a report of shots fired and found Destiny Sade’ Robertson, 18, with a gunshot wound to her leg, Leamon said. She was taken to Roanoke Memorial.\nWitnesses said the shots were fired from outside the house, Leamon said. Officers found damage to the house and other physical evidence.\nAbout 10 minutes later, officers tried to stop a black Jeep that matched the description of the suspect vehicle, but the Jeep did not stop, prompting a short pursuit, Leamon said. The Jeep wrecked in the 1100 block of Marlian Avenue Northwest, and the occupants left the scene. Officers set up a perimeter and used a police dog to try to locate the suspects, but the search was unsuccessful.\nInvestigators believe the three shootings are related, Leamon said. Evidence so far indicates that the victims were not targeted at random.\nNo arrests had been made as of Tuesday, but detectives have identified people of interest.\nThe number of shooting incidents in the city so far this year has surpassed last year’s total. In 2015, there were 37 incidents of a suspect maliciously shooting someone else; this year, there have been at least 43 incidents accounting for 61 victims, according to police records tracked by The Roanoke Times."}