{"uri": "http://www.theledger.com/article/20160711/NEWS/160719900/1358/NEWS06?Title=Firearms-instructor-Victim-in-Haven-home-invasion-was-running-out-of-options-", "title": "Firearms instructor: Victim in Haven home invasion was 'running out of options'", "dct": "NODATE", "id": "f9945d0f8ae325bfe0c38be60395b384", "content": "Hide caption Paul and Mary McLees\nWINTER HAVEN - Paul McLees was being held at knifepoint by a man who'd broken into his Winter Haven home on Saturday when he decided to defend himself.\nThe decision cost him his life, but it was a situation with no clear answer, a retired police captain said.\nMcLees led 25-year-old Ricardo Gomez to a safe where he kept a firearm, according to the Polk County Sheriff's Office. He pulled the gun on Gomez and shot him once before Gomez fought him for it and shot him twice, killing him. Gomez later died from his injuries.\n\"He was running out of options in this case,\" said Bret Bartlett, a NRA firearms instructor, State of Florida certified instructor and retired Tampa police captain who's been teaching firearms classes for more than 30 years.\nShould McLees have used the gun or let Gomez take his property? Bartlett said no one answer applies to everyone in every situation.\n\"It's such a hard call. I know what I would do, but when you're faced with that, sometimes we change our minds,\" Bartlett said. \"It's a tough call and a very individual decision. There's no perfect solution.\"\nBy the time McLees had the gun in his hands, he fired one shot before Gomez took it and turned the weapon on him.\n\"You have to fire the gun until you incapacitate the bad guy,\" Bartlett said, adding that the dynamics of each scenario change the way a person may handle it. \"If you're in a room in close quarters, there's not much you can do.\"\n\"You have to find a balance between you and the bad guy and your environment,\" he said.\nPolk County Sheriff Grady Judd said Sunday that \"Paul McLees did what he should've done. He protected his family, he protected his wife in his home and he shot the robber.\"\nAlthough McLees died during the altercation, he was able to protect his wife, 72-year-old Mary McLees, who suffered from minor injuries after shrapnel and ricocheting bullets hit her knee and foot. She was released from the hospital Sunday.\nTony Dodds, a criminal defense attorney who's been practicing for 30 years, said Paul McLees had every right to pull a gun on Gomez.\n\"If somebody breaks into your home, you're fully entitled to defend yourself,\" Dodds said. \"That is without question.\"\nWhen someone enters your home, whether they have a weapon or not, Dodds said, you have every right to defend yourself.\n\"Clearly, they have no right to be there anyway,\" he said.\nBefore grabbing the nearest firearm to defend yourself against a home intruder, Bartlett said, you should know how to safely handle the gun. This includes pointing the gun in a safe direction and keeping your finger off the trigger until you're ready to fire.\n\"A lot of people who own guns don't know how to use them,\" he said.\nGun owners should know how to clean, load and unload the weapon. They should also train regularly to make sure they have good marksmanship, Bartlett said.\nOnce you know how to handle the gun safely, Bartlett said, you should create a plan on how to protect yourself and loved ones if someone does break into your home.\n\"Use an empty gun or plastic gun and run through scenarios in the house and practice with a loved one,\" he said. \"It's the little things that if you don't practice it, it won't happen under stress.\"\nGuns aren't the only way to protect yourself in the event of a home intrusion. Donna Wood, a spokeswoman for the Polk County Sheriff's Office, said self-defense sprays are useful.\n\"Not everybody is comfortable owning a gun or carrying a type of self-defense spray,\" she said.\nThat's why the Sheriff's Office offers free self-defense classes where people can learn to fight off an intruder, Wood said.\n\"Figure out what will work for you,\" she said.\n\"Whatever a person thinks is good for him is good for him,\" Bartlett said.\nBut that doesn't mean basic home safety guidelines should be ignored.\nWood said it's important to make sure deadbolts are working on all doors - a simple knob lock is not enough - and that there are locks on the windows. Garage doors should be kept closed, even when you are at home.\n\"Get into the habit of locking doors,\" she said.\nPracticing a safety plan is key, Wood said. Oftentimes, people place precedence on plans for a fire or hurricane, but a home intruder plan is just as important.\n\"Have a plan, practice the plan and put the plan to use if you can,\" Bartlett said.\n- Kaitlyn Pearson can be reached at kaitlyn.pearson@theledger.com or 863-802-7516. Follow her on Twitter @KR_Pearson."}