{"uri": "http://www.wrcbtv.com/story/32365817/teen-accidentally-shoots-herself-in-east-ridge", "title": "UPDATE: Teen accidentally shoots and kills herself in East Ridge", "dct": "Wed, 06 Jul 2016 22:25:00 GMT", "id": "65bced888f7748b8b92d6596477ddffd", "content": "EAST RIDGE, TN (WRCB) -\nUPDATE: East Ridge police said the 17-year-old girl who accidentally shot herself and later died was visiting family at an apartment. Investigators said it happened on Sunday at the Dogwood Place Apartments off Eads Street.\nA public obituary posted online identified Alana Luangaphay as the victim. The teen was showing a pistol to one of her cousins on Sunday, according to a police report.\nThat's when the cousin told police she unloaded all but one round and put the gun to her head. As the teen's cousin yelled at her for doing that and reached for the pistol, she shot herself in the right side of the head.\nChannel 3 spoke with a gun shop owner about safety in light of what happened.\n\"Accidents happen. There's no way that we can prevent every happen stance from occurring, but there are measures you can put into place that can eliminate the vast majority of it,\" John Martin of Shooter's Depot said.\nMartin hates to hear about cases like this one. He encourages anyone handling a gun to look out for themselves and others.\n\"Don't ever point the weapon at anything or anyone that you do not intend to shoot or in a direction where an unintended discharge may do harm. Number two. Never place your finger on the trigger until the moment you're actually ready for the firearm to go off,\" Martin said.\nLuangaphay was taken to the hospital and later died. It's unclear who owned the pistol or why she had it.\nMartin said it's a good reminder to never play with guns.\n\"Don't go get your gun and play with it. It's not a toy,\" Martin said.\nThe Hamilton County Medical Examiner's Office said they haven't determined an exact cause of death yet.\nFuneral arrangements are set for the teen in Murfreesboro for Sunday."}