{"uri": "http://www.kvue.com/news/crime/15-year-old-murder-victim-gives-life-saving-gifts-to-four/341387726", "title": "15-year-old murder victim gives life-saving gifts to four", "dct": "Thu, 27 Oct 2016 00:00:00 GMT", "id": "08b40f2e1ecfce0e0d5eeca7dbad5a46", "content": "DALLAS -- Roy Stuart’s heart lives on in someone else.\nHe was shot and killed last week in the South Oak Cliff apartment complex where he lived with his grandma. The person who shot him left him to die.\nThe South Oak Cliff High School freshman would have been 16 next month.\n“I just hope whoever received my baby’s heart knows that they received a precious gift, a precious gift,” said his grandmother, Brenda Stuart.\nHe is the latest of the city’s 146 murders, which are up about 25 percent from last year. At this point last year, 117 people had been killed.\nOn Oct. 26, DPD said it had arrested another 15-year-old boy for the murder. He has not been identified.\n“Why would you do it?” Brenda Stuart said, speaking directly to his killer. “If you have any conscious or any kind of heart, turn yourself in. Roy didn’t deserve this.”\nBrenda raised Roy from the time he was three weeks old. She adopted him as a toddler.\nRoy’s mom and dad have been in and out of prison his whole life. His father is Brenda’s son.\n“This is him when I brought him home,” she said, kissing a photo of him as an infant. “When I tell you perfect, he was a perfect baby. That was my heart.”\nRoy had big dreams. He wanted to be a professional football player.\nHe played football at Kennedy Curry Middle School. Roy and his grandmother were so proud of the trophy that he got for being named eighth grade defensive player of the year last year.\n“He was a good kid,” said Jeremy Anderson, his middle school football coach. “He was a good player. Football really kept him on the straight and narrow.”\nRoy was a team leader and very coachable, he said.\n“When I heard what happened, I was devastated,” Anderson said.\nRoy was playing in high school. He planned to try out for the basketball team.\nEvery time he left the house, he had a basketball or a football in his hand.\n“Sports was his world,” his grandmother said.\nHe was a respectful teen, too. Roy had just applied for a job and helped his grandma as much as he could.\nLast Tuesday, he checked on his grandmother as he left for school.\n“'Granny, you all right?'” she recalls him saying. “'Granny, you need anything? Alright Granny, I’m out of here.'”\nThat evening, she received a life-changing call while shopping for groceries.\n“Somebody asked me, ‘How is your baby doing?’\" she recalled. “I said, ‘I guess he’s doing alright. What’s supposed to be wrong with him?’ She said, ‘I heard he got shot.’\"\nBrenda left the groceries in the basket. She came home to find out that Roy had been shot in the head. He was on life support at a Dallas hospital.\nShe’s haunted by the fact that whoever was him just left him there. She wonders if he would have been saved.\nShe was by his side for the next three days. Doctors said there was no hope.\nBrenda talked to his dad about organ donation. The family agreed that they wanted a piece of Roy to live on.\nHe was taken off life support Friday.\n“I just told him that I loved him, and I know that he loved me and that his dad loved him and that we all loved him,” Brenda said. “And that that he was my little precious angel.”\nThe grief is crushing for Brenda, who walks with a cane. She has diabetes and high blood pressure.\n“I try to be strong for my son and my daughter and my other grandchildren, but sometimes I just feel like I can't go on,” she said. “I feel empty inside. I feel like it just took the life out of me. I feel hollow inside.”\nRelatives came and went Monday, trying to console her. They are making arrangements to bury Roy. Friends and family plan to gather for a candlelight vigil Wednesday at 6:30 p.m. at 4722 East Frio off Ledbetter at New Life Family Baptist Church.\nBrenda calls him her hero.\n\"Now, he's someone else's hero, because he saved four lives,” his grandmother said.\nRoy’s family donated his liver, lungs, kidney, and heart. Brenda dreams of meeting the person that received his heart.\n“He has a good heart, and it will live on in somebody else,” she said. “He was always trying to help somebody when he was alive, and now that he’s gone, he’s still helping people.”\nCopyright 2016 WFAA"}