{"uri": "http://fox43.com/2017/01/05/judge-rules-17-year-old-can-be-tried-as-an-adult-for-in-deadly-shooting-of-15-year-old-boy/", "title": "Judge rules 17 year old can be tried as an adult for in deadly shooting of 15 year old boy", "dct": "Thu, 05 Jan 2017 14:45:00 GMT", "id": "1d57f23584e6df5d396096c6b5252fe7", "content": "LANCASTER, Pa – A 17-year-old Mountville male will be tried as an adult for the deadly shooting of a 15-year-old boy this summer. Lancaster County Judge David Workman on Thursday ordered that 17-year-old George W. Rosado face counts of misdemeanor Involuntary Manslaughter, Felony Theft of a Firearm, and misdemeanor Drug Paraphernalia in the adult criminal court system.\nWorkman explained in court that Rosado’s history and prior experiences do not indicate Rosado could be rehabilitated in the juvenile court system.\nWorkman said he found testimony credible from a local psychologist, Dr. Jonathan Gransee, who opined at a hearing last month that Rosado is “unlikely to be rehabilitated in juvenile treatment.”\nRosado allegedly shot and killed 15-year-old Ibram Hanna on August 12, 2016 with a gun Rosado stole hours earlier from an unlocked vehicle.\nInvoluntary manslaughter involves a death that results from a reckless or grossly negligent act.\nAt Thursday’s hearing, Judge Workman ordered that Rosado be transferred to Lancaster County Prison and set bail at $100,000. Rosado has been at Lancaster County Youth Intervention Center since August.\nAssistant District Attorney Amber Czerniakowski, who presented testimony at the December 9 hearing, requested bail be set, considering Rosado is facing a prison sentence and is a possible flight risk.\nLancaster County District Attorney Craig Stedman, after Thursday’s hearing, stressed that Rosado is presumed innocent.\n“This is just one part of the process,” Stedman said. “We stand by our filings in the case requesting certification and the reasons we have asserted in court.”\nHanna died of a single gunshot. The shooting happened at Rosado’s West Main Street home where he lived with a relative."}