{"uri": "http://www.courier-journal.com/story/news/local/2015/03/27/call-year-old-boy-obtained-gun-shot-sister/70546930/", "title": "911 call: 5-year-old boy obtained gun, shot sister", "dct": "Fri, 27 Mar 2015 00:00:00 GMT", "id": "1b7227c783125df8631576a302149ff3", "content": "The 2-year-old girl shot in the head in her Kentucky home this week was shot by her 5-year-old brother, the children’s mother said in a 911 recording released Thursday.\n“My son got the keys to the gun cabinet and he shot his little sister,” Stephanie Reed said, her voice breaking as a child’s voice is heard in the background.\nThe 911 call and the police incident report, which were obtained by The Enquirer, detail what happened Monday inside the family home on Bon Jan Lane in Highland Heights. Police have said the toddler’s condition is critical.\nInvestigators, who continue to piece together exactly what happened, have not commented on who pulled the trigger or how the 5-year-old could have obtained the gun.\nKentucky’s gun laws are among the least restrictive in the nation, and the state does not have a “safe storage” law on the books.\nThe case detective did not respond to phone or email messages Thursday afternoon for an update on the investigation or the girl’s condition.\nPolice have characterized the shooting as accidental, and the records do not contradict that.\nReed placed the 911 call about 2 p.m. Monday, frantically asking first responders to hurry to the home. She told the dispatcher her daughter, who will turn 3 years old in April, was shot in the head and was barely breathing.\n“She’s tightening up,” Reed said.\nReed can be heard talking to both of her children during the 21/2-minute call, and she told the dispatcher her son was next to her and putting his shoes on.\nShe said she had put the gun back in the family’s gun cabinet. The records do not specify the type of gun.\n“We keep the keys put up on top of the fridge and he went and got ‘em,” she told the dispatcher.\nThe 911 call ended when officers arrived at the home, but the incident report picks up from there.\nThe officers found the girl lying on the floor breathing but unconscious, and one of them applied pressure to her bleeding head until an ambulance arrived, the report says.\nParamedics took the girl to Cincinnati Children’s Hospital Medical Center, where she underwent emergency surgery.\nReed and her son, meanwhile, were taken to the Children’s Advocacy Center in Florence to be interviewed by a social worker and police, according to the incident report. The children’s father, Kevin Reed, was not home at the time of the shooting.\nInvestigators remained at the home for nine hours; the initial investigation included calling a crime scene unit to assist at the home and obtaining a search warrant from a judge to enter the home."}