{"uri": "http://wncn.com/2016/12/05/2-injured-in-shooting-near-sanford-christmas-parade/", "title": "2 teens shot, 1 man arrested at Sanford Christmas Parade", "dct": "Mon, 05 Dec 2016 21:12:00 GMT", "id": "c37b219cb70f9a0613f23e4033279ad9", "content": "UPDATE: Accused Sanford parade shooter ‘just snapped’ after brother’s July murder, dad says\nSANFORD, N.C. (WNCN) — Two teens were hurt in a shooting in Sanford along the town’s Christmas parade route Monday night, officials said.\nThe shooting, which forced the parade to end early, happened at Wicker and Gulf streets in the Rite-Stop grocery store parking lot around 7:50 p.m.\nCLICK TO VIEW MUGSHOTS FROM ACROSS NC\nPolice say they have arrested 20-year-old Sanford resident Deion Jamille Johns, who is now facing one count of attempted murder. He was placed in Lee County Jail under a $360,000 secured bond.\nHis bond was increased to $1.5 million during a Tuesday court appearance.\nOne victim, 18-year-old Sean Dimitrius Matthews, of Sanford, was found suffering from several gunshot wounds to his lower abdomen area, arms and leg. He’s now recovering at UNC Hospital in Chapel Hill and he’s listed in critical condition.\nUPDATE: Accused Sanford parade shooter ‘just snapped’ after brother’s July murder, dad says\nA 16-year-old Sanford boy, Jadakis Tysor, was also struck by a bullet and is now being treated for injuries to his arm. Johns has been charged with one count of felony assault with deadly weapon inflicting serious injury in connection with the shooting.\nHe was also charged with three misdemeanors, including discharging a firearm within city limits, possession of a weapon at a parade, and going armed to the terror of the people.\nThe owner of Rite-Stop told CBS North Carolina that he watched his store’s surveillance video that showed a man walking up to a group in front of the store and firing shots as parade floats went by.\nThe store owner, Abdo Alwahishi, later released the video to CBS North Carolina.\n“It was scary. Cause everybody was nervous and as soon as they heard the gunshots, people were running inside the store and people were running out,” Alwahishi said of the shooting scene. “People were also running in the other direction hoping that the bullet wouldn’t hit them.”\nJust six seconds after the shooting, police officers who were stationed along the parade route swarmed the parking lot, the surveillance video showed.\nThe town’s annual Christmas parade was set to begin at 7 p.m. Monday evening and much of its route led along Wicker Street.\nLee County Schools released a statement Tuesday morning regarding the shooting:\nIn response to the incident at the Sanford Christmas Parade last night, administrators at Lee County High School, Southern Lee High School and Bragg Street Academy have put additional law enforcement officers on those campuses as a precautionary measure.\nAt times like this, we know that rumors are spread through social media. Based on the investigation of our SROs and administrators, we have found no credible threats to our schools.\nWe remain in close contact with the Sheriff’s Office as we go throughout the day. In addition, our counselors in all of our schools are available to students and staff who may need help in dealing with this terrible tragedy in our community.”"}