{"uri": "http://www.abc12.com/content/news/Security-increased-at-apartment-complex-where-5-people-were-shot-393573091.html", "title": "Security increased at apartment complex where 5 people were shot", "dct": "Thu, 15 Sep 2016 13:37:00 GMT", "id": "de28cd9d390e6cd3c492d5d319fd1965", "content": "SAGINAW COUNTY (WJRT) - (09/15/16) - There will be more security at the apartment complex near a Mid-Michigan university where five people were shot and injured last weekend.\nLaw enforcement agencies and the owner of the Campus Village apartments held a press conference Thursday morning to unveil changes in security at the complex.\nThere was one Saginaw County sheriff's deputy in another part of the complex when that shooting occurred early Sunday morning. There will be one more deputy there this weekend.\nSaginaw County Sheriff Bill Federspiel, Michigan State Police Lieutenant Dave Simon and John Leuenberger, who owns the complex, made that announcement at the apartments Thursday morning.\n“What we are looking at here is something we have not dealt with before,” Federspiel said.\nThere was a large party Saturday night that continued Sunday morning at the complex, which is across the street from Saginaw Valley State University property.\nPolice believe a man pulled out a gun and shot five people, all who are recovering with minor injuries.\nNot only will there be one more deputy, Michigan State Police will devote some resources in the vicinity of the complex to keep a closer eye on large parties.\nLeuenberger says the complex had five security officers on site as well and will try to keep the size of the parties under control. He doesn't believe there was 1,000 people at the party, but he agrees the crowd was too large.\n“We are working with university and the police departments to correct what was wrong and it will be down,” he said.\n“It’s in all of our best interests to do whatever we can to develop effective strategies to make sure this doesn't happen again,” Simon said.\nSVSU President Don Bachand has met with police and the complex owners.\n“We have improved our methods of communicating with one another. We had difficulty communicating with the management folks shortly after the event,” he said.\nBachand says the school has no jurisdiction over the complex, but the two entities are working on a memorandum - a working agreement to prevent similar problems.\nBachand wants an agreement sooner, rather than later.\n“There is some urgency to what we are doing here,” he said.\nFederspiel says the search continues for the gunman."}