{"uri": "http://www.ajc.com/news/news/crime-law/cops-6-year-old-atlanta-girl-shot-herself-dad-char/npYJf/", "title": "Cops: Loaded gun left on couch before 6-year-old shot, killed herself", "dct": "Sun, 29 Nov 2015 00:00:00 GMT", "id": "69aa5d99d275688ba7e1603b3fb621fa", "content": "Police believe 6-year-old Ja’Mecca Smith found a loaded gun tucked between the cushions of a sofa inside her family’s southeast Atlanta apartment Saturday morning and, one way or another, shot herself in the head.\nHer death came with at least four other children and two adults present in the home — and makes at least four Georgia children killed in accidental shootings in less than six weeks.\nAtlanta police responded to the apartment at 1041 Martin St. SE, about a mile southeast of Turner Field, just before 11 a.m. Saturday. Young Ja’Mecca was dead inside and her father — 25-year-old Demarqo Smith — was not there. Authorities said he briefly fled the scene before returning to speak with detectives.\nOn Sunday, they announced the father had been arrested and charged with involuntary manslaughter and reckless conduct. He is being held at the Fulton County jail without bond.\nFew other details about the case have been released.\n“It was a child,” neighbor Ellis Jackson told The Atlanta Journal-Constitution on Saturday. “It’s a tragedy to happen to the family.”\nThe same tragedy has befallen at least three other Georgia families since mid-October.\n• On Oct. 17, 8-year-old Sharia Lynch was killed inside her family’s Paulding County home. Her mother, Marsha, told investigators a handgun had fallen and discharged when it hit the floor.\nThe same bullet struck Sharia in the head and her mother in the leg.\n• On Oct. 27, a 2-year-old Acworth boy shot himself inside his family’s home after finding a semi-automatic handgun on a bed. The boy’s father, Grant Dennington, and 4-year-old brother were also home at the time of the shooting, though neither was injured.\n• On Nov. 11, 2-year-old Jayden Jamar Clay was shot in the lip and killed after finding a .45-caliber handgun while playing with his twin brother inside their Butts County home. His mother’s boyfriend, Christopher Dwayne Askins, was later charged with second-degree cruelty to children and weapons charges.\nAccording to a database maintained by advocacy group Everytown for Gun Safety, a total of 15 Georgia children have been injured or killed in accidental shootings in 2015. Also included is the August death of 25-year-old Douglas resident Dorothy Rearden, who was shot and killed by her 4-year-old son.\nEarlier this month, Dr. Viviana Goldenberg, a member of the Georgia chapter of Moms Demand Action, told The AJC that shootings like these come down to negligence.\n“It’s literally terrifying, and this is happening all over the country,” she said. “There is no gun owner responsibility. They’re not thinking of what measures to do to prevent access of the children to the gun.”"}