{"uri": "http://www.pressdemocrat.com/news/6380198-181/suspect-arrested-in-fatal-shooting", "title": "Suspect arrested in fatal shooting at Elem Indian Colony in Lake County", "dct": "Thu, 01 Dec 2016 00:00:00 GMT", "id": "ebe7913d375e92e4313377d0461b8c16", "content": "A Lake County woman was shot and killed early Thursday morning in a terrifying attack on her extended family that targeted the victim’s adult niece, who hid under a bed as her estranged husband barged in with a shotgun.\nThe violence that killed Theresa Brown also left her 6-year-old daughter, Brown’s sister and her husband with gunshot wounds, though all were expected to survive, according to Augustin Garcia, tribal chairman of the Elem Indian Colony near Clearlake Oaks, where the 2:16 a.m. shooting occurred.\nThe suspect, Ezekial “Junior” Bravo Jr., a Clearlake resident, fled the scene in one of the victims’ cars but was apprehended about 6½ hours later after being reported on the grounds of a local elementary school, Lake County sheriff’s officials said.\nBravo was booked into the Lake County Jail for suspected murder, attempted murder, kidnapping, assault with a deadly weapon and assault with serious injury, authorities said. His bail was set at $1 million, the Sheriff’s Office said.\nGarcia, one of Brown’s cousins, said family members were still piecing together exactly how the incident unfolded but said Bravo was after his estranged wife. She had recently left an abusive relationship of three years and was seeking full custody of their children.\nShe was in bed at the home of her mother, Stephanie Brown, as other family members slept when Bravo arrived and started shooting, Garcia said.\nThe woman’s aunt and mother had her get under the bed, Garcia said.\n“She was being protected by the family,” he said. “They had put her under the bed and asked her to remain there so she had to listen to everything that happened.”\nBravo shot Theresa Brown in the face, sending buckshot into the arm of her 6-year-old daughter, who lay next to her, Garcia said.\nStephanie Brown was shot as she escaped out the door. Her husband, Robert Brown, also was shot, and was missing a large portion of a forearm, Garcia and emergency medical personnel said.\nStephanie Brown, wounded in her shoulder, managed to get outside the rancheria and apparently called for help.\nThree North Lake Fire personnel who responded to the scene in the minutes after sheriff’s deputies arrived, described a chaotic situation and were unaware there was more than one victim or that a gunman was still on the loose.\nFire Chief Jay Beristianos was looking into the episode to ensure policies were sufficient to prevent his people from unnecessarily getting harmed. Paramedic Deke Madsen, who responded by ambulance with his partner, said department policy already prevents them from entering the rancheria without a law enforcement escort because of factional feuding that erupted in gunfire and arson fires 20 years ago.\nMadsen said he was staged outside the rancheria about 200 feet from the vehicle in which Stephanie Brown awaited help, not realizing she was a victim. After paramedics were given clearance to enter the rancheria, they learned Stephanie Brown was a victim, though by then she had driven herself to Saint Helena Hospital Clearlake. The medics then learned there were additional patients and were called back inside the house where the gunfire occurred. Picking up the little girl and her uncle they were instructed to move quickly because the suspected gunman was free."}