{"uri": "http://mydailysentinel.com/news/11033/teen-flown-by-air-medical-helicopter-after-accidental-shooting", "title": "Teen flown by air medical helicopter after accidental shooting", "dct": "Wed, 21 Dec 2016 00:00:00 GMT", "id": "1a7248d642d827505d16d48ed6ae2087", "content": "CHESHIRE TOWNSHIP — A teen on Turkey Run Road in Gallia County was reportedly accidentally shot Tuesday evening and was flown by air medical helicopter to Cabell Huntington Hospital with serious injuries.\nAccording to Gallia County Sheriff Joe Browning, the shooting reportedly happened around 9:35 p.m. Reports say two teenagers involved in the incident were 13 and 14 years of age.\n“In the initial report, the pair located the (firearm) within the home,” said Browning. “The information we have is that the two were at the residence and one of the young men had possession of a firearm and the gun discharged and struck the other. He was life-flighted with serious injuries and the case is still being investigated. It was reported as an accidental shooting. So far, everything is consistent with that.”\nGallia 911 Center incident report listings state the victim was reportedly shot in the back and the teenagers had believed the firearm to be empty upon its discovery. The specific circumstances as to how the firearm was discharged are still being investigated. Relatives reported the emergency.\n“It is a really bad thing,” said Browning. “We hope that he’s okay and makes a full recovery. Parents should always take the time, especially around the holidays, to talk to youth and teens about gun safety. If they’re in your home, you should take that extra step and talk to other family members about safety aspects if they should happen to find (a gun) on a shelf or somewhere. Always treat it as if it’s loaded. If they don’t know what to do with it or safe operation, they should always contact a responsible adult when they find a gun.”\nAccording to Browning, accidental shootings become more frequent during the holiday season.\nThe Gallia Sheriff’s Office has engaged in the Eddie Eagle program since 2009. Deputies have visited with schools and youth groups in an attempt to stress the importance of gun safety. The National Rifle Association program is nationally known for its safety slogan “Stop. Don’t touch. Leave the area. Tell an adult.”\nDean Wright can be reached at 740-446-2342, ext. 2103."}