{"uri": "http://www.fox5atlanta.com/news/209107603-story", "title": "18-month-old boy shot and killed", "dct": "Sat, 01 Oct 2016 21:22:00 GMT", "id": "11440d250a7e885c3148e05c99548763", "content": "MCDONOUGH, Ga. - An 18-month old boy was shot in the head, possibly by his three-year-old brother, and died shortly after he was transported to a local hospital, according to Henry County Police.\nPolice on scene said they are investigating the ordeal as a \"tragic accident,\" and believe the child was struck by a bullet somewhere on his head or face.\nThe ordeal happened around 3 p.m. off Kings Mill Road. Police were notified that the child died around 5 p.m. at Piedmont Henry Hospital.\nLt. Mike Ireland tells FOX 5, the gun involved in the shooting was a .45 caliber weapon, and belonged to a family member inside the home; he said the gun was set down in a bedroom while two adults were present, and after a gunshot went off, the adults turned to see the 18-month-old wounded.\nPolice said they believe the three-year-old sibling, who is adopted, is the individual who fired the weapon, but are also investigating if the 18-month-old toddler shot himself. The gun will be sent to the GBI for fingerprint testing to determine those details.\n\"We are actively investigating if it was an accidental shooting by the three-year-old, or accidentally inflicted by the one-and-a-half-year-old,\" Lt. Ireland said.\nThe name of the child has not been released. Police said both parents and grandparents were present in the home at the time, but declined to say who owned the gun.\nPolice have secured a search warrant at the home to investigate the bedroom where the shooting happened.\nNo word from police on any possible charges at this time. Investigators said, while the parents rode with the child to the hospital, the grandparents were interviewed by detectives at a police precinct.\nInvestigators said they will interview the child's parents tomorrow, after they give the family time to mourn. The body of the child will also be turned over to the GBI for an autopsy.\n\"We are allowing everybody to grieve at this time,\" Lt. Ireland said.\nPolice also declined to speculate if the adults present could have done anything differently with the firearm to prevent the tragedy."}