{"uri": "http://kwqc.com/2016/02/04/two-early-morning-shootings-in-burlington-iowa/", "title": "Two early morning shootings in Burlington, Iowa-UPDATED", "dct": "Thu, 04 Feb 2016 07:12:00 GMT", "id": "8c7397d7df2d8ced72a1603225d110c6", "content": "BURLINGTON, Iowa (KWQC) – Police are investigating two shootings from early Thursday morning, February 4, 2016.\nThe first happened around 2:30 in the 200 block of 8th Street. Police were called to the report of several shots fired. While they were on scene, officers say a man with a gunshot wound, 25-year-old Dominic Devon Eady of Burlington, checked into Great River Medical Center for treatment. It was determined that Eady was shot at the officer’s location.\nPolice say Eady sustained a gunshot wound to the arm and was transferred to University of Iowa Hospitals for further treatment. The incident is still under investigation\nThe second incident happened around 3:30 a.m. at an apartment in the 300-block of Angular Street. Officers found a 27-year-old man who had died from a self-inflicted gunshot. An autopsy is being performed at the University of Iowa Hospitals. An initial investigation did not reveal any signs of foul play.\nDetectives have not found any correlation between the two incidents and are currently following up on leads in both cases.\nAnyone with information regarding either incident is asked to call the Burlington Police Department at (319) 753-8366 or the Burlington Area Crime Stoppers at (319)753-6835.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}