{"uri": "http://www.al.com/news/birmingham/index.ssf/2016/08/1_dead_3_injured_in_shooting_a.html", "title": "1 dead, 4 hurt, including toddler, in Brighton park shooting", "dct": "Mon, 29 Aug 2016 05:38:15 GMT", "id": "d612dd6248a3936ee35d0648fe451d9d", "content": "One person was killed and four others were injured in a Saturday evening shooting at a Brighton park, according to Birmingham police.\nWitnesses estimated more than 700 people were celebrating Brighton Day near the community center on 7th Avenue when gunfire erupted at around dusk.\n\"It was chaos,\" event organizer Isaac Bruister said. \"People were running everywhere.\"\nThe man killed was identified by family members as Antonio Hinkle, 32, a father of three, who spent the day cooking food for his fellow Brighton residents.\nAmong those injured are a man, a mother, a toddler and a 3-or-4-year-old girl, according to bystanders.\nBill Veitch, district attorney for the Bessemer Division of Jefferson County, said multiple shooters were believed to have been involved.\nBrighton police are interviewing two people, but Veitch didn't know if they were witnesses or persons of interest.\n\"It is a big involved crime scene,\" he said, due to the number of shots fired.\nDemetrius Hinkle said his brother, Antonio, died in the shooting.\n\"I don't want my brother to be another statistic,\" he said, with tearing streaming down his eyes. He asked the people of Brighton to come forward and tell police who is responsible for the shooting.\nHinkle said what he will miss most about his brother is his love, and their discussions about football.\n\"I hate to see that he won't be there for his kids,\" he said.\nBruister, associate minister of Friendship Baptist Church, said a young girl, who was injured in the shooting, had asked him all day to spray her with water.\nWhen he heard the gunfire, Bruister said he ran to where the children were playing.\nThere he saw the same young girl \"on the ground helpless\" suffering from a gunshot wound. Bruister said he didn't know the severity of the girl's injuries.\n\"It could have been my child,\" he said. \"I could do nothing to help the child.\"\nEric Pams and Kenneth Rudolph said they were just hanging out and enjoying the day with their family when gunfire erupted.\nRudolph said when he heard the gunfire he immediately looked for his children.\nPams estimated 40 shots were fired near a water slide where children were playing.\n\"We were just trying to bring people together,\" Rudolph said. \"It is sad you can't come out to a park and get together without this happening.\"\nHe said community members held fundraisers for months to put on today's festivities.\nBrighton City Councilman Lonnie Murray said Brighton Day turned into a tragedy.\n\"It hurt my heart to see something like this,\" he said. \"It is a sad day for the people of Brighton.\"\nBrighton police are the lead investigating agency in the shooting. Police didn't provide a statement at the scene.\nBessemer police, Birmingham police and Jefferson County Sheriff's Office are assisting in the investigation."}