{"uri": "http://miami.cbslocal.com/2013/07/07/pompano-beach-robbery-attempt-turns-deadly/", "title": "Pompano Beach Robbery Attempt Turns Deadly", "dct": "Sun, 07 Jul 2013 18:20:00 GMT", "id": "efd83786d3358101042cb447d273d710", "content": "FT LAUDERDALE (CBSMiami) – One man was killed, three others injured, when they were shot in a robbery attempt in Pompano Beach over night.\nThe four men were playing dominoes outside a Pompano Beach home in the 1600 block of NW 7th Lane around 1 a.m. Sunday when four armed individuals tried to rob them, according to the Broward Sheriff’s Office.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\n“The gun was at my head. And it missed my head and hit me in each arm and in one leg. And I’m still able to walk. I’m still breathing,” said one of the men who was shot but did not wish to be identified in this report.\nHe said they were all sitting around playing when they heard footsteps. Suddenly four men stood over them and demand their money.\n“There was nothing to give in the first place. But they just said ‘give it up’. So we just sat there we were looking at each other, is it a joke? And they started shooting at us,” said the man.\n“We were watching a YouTube video and we heard a few gunshots go off and we immediately just froze for a minute, like what is going on? We thought it was some fireworks,” said neighbor Samuel Jennings. “Everybody was panicking. One dude was shot in the side. He ran inside the house.”\nJoshua Childs, 23, was pronounced dead on the scene. Alphonso Wright, 54, and Christopher Singleton, 35, were taken by fire rescue to Broward Health North.\nRashaad Payne, 23, who immediately ran when the gunfire erupted was driven by a relative to the same hospital. All are expected to survive.\n“It was crazy because I actually opened up the door and seen one of the dudes lying on the ground. I walked over and looked at the garage and saw another dude lying on the ground. I was like ‘Wow, I can’t believe that this really happened’,” said Jennings.\nBroward Sheriff’s Office spokesman Mike Jachles said the individuals they are looking for should be considered extremely dangerous.\n“This was nothing short of a brazen attempt of four people who have no regard for human life. They were playing dominoes,” said Jachles. “They were not bothering anybody. They attempted to rob them.”\nJennings said the shooting really shook him up. He was playing dominoes on Saturday in the spot where the shooting happened. He said it could very well have been him in the hospital – or worse.\n“I normally have my boys out here and we outside and everything too. So I’m just happy none of my boys was around when this happen because it could have been bigger than it actually turned out to be,” said Jennings.\nUnfortunately none of the three injured men were able to provide a good description of their attackers.\n“They had skullies on their head and bandanas around their face. I only know that they were all black males and they wore dark clothes. One of them had a big assault rifle and the rest of them had handguns,” said the man.\nThe sheriff’s office hopes someone steps forward and helps them solve this case before it happens again.\n“They are armed. They are dangerous. We need to get them off the streets. They’ve killed, injured. They can do it again,” said Jachles.\nAnyone with information about the case should call Broward Crime Stoppers at (954) 493-TIPS (8477)."}