{"uri": "http://potomaclocal.com/2014/01/20/4-shot-outside-nightclub-near-manassas/", "title": "News Updated: Arrest Made in Manassas Quadruple Shooting", "dct": "Mon, 20 Jan 2014 00:00:00 GMT", "id": "805a3e9e6c94962e74f118fa5472be38", "content": "Update 1:30 p.m.\nPrince William police announced an arrest today in connection with this case:\nArrested on January 20th:\nJeremiah Eugene PULLEN, 24, of 285 Manassas Dr in Manassas\nCharged with 4 counts of aggravated malicious wounding, 4 counts of use of a firearm in commission of a felony, 1 count of shooting into an occupied dwelling, and 1 count of shooting from a moving vehicle\nCourt date: unavailable | Bond: held WITHOUT bond\nPhoto credit: Prince William police\n8 a.m.\nMANASSAS, Va. — A woman remains in a hospital this morning after she and three others were shot outside a Manassas nightclub.\nMore in a unedited press release:\n*UPDATE: Shooting Investigation – On January 20th at 2:21AM, officers responded to 90 Degrees located at 8509 Rixlew Ln in Manassas (20109) to investigate a reported shooting. Officers arrived and located four victims suffering from gunshot wounds. All of the victims, two men and two women, were transported to area hospitals.\nThree of the victims have since been treated and released. The remaining victim, a woman, is still being hospitalized with non-life threatening injuries. The investigation into the shooting revealed that the suspect had been removed from the bar by security shortly after 2:00AM. Once outside, the suspect got into his vehicle and drove by the front of the establishment where he opened fire, striking the victims.\nOfficers arrived at the scene quickly and were able to broadcast a description of the suspect vehicle to adjoining agencies.\nA Manassas City Police officer located the vehicle and detained the suspect following a traffic stop. Detectives are currently interviewing the suspect and charges are forthcoming.\nThe nightclub “90 Degrees” is in Prince William County just outside Manassas, and is a restaurant by day and nightclub by night. It is located across from Manassas Mall and sits behind a Hooters restaurant."}