{"uri": "http://www.cantonrep.com/news/20161212/stark-deputy-killed-in-accidental-shooting", "title": "UPDATE: Son calls 911 after father accidentally shot through wall", "dct": "NODATE", "id": "3b605698bd1e0a2702d3d502072457ab", "content": "John Campbell, chief deputy for the Stark County Sheriff's Office, died Sunday night at his home. The Summit County Sheriff's Office has been asked to investigate the death.\nLAKE TWP. The chief deputy of the Stark County Sheriff's Office died following an accidental shooting Sunday night at his home.\nChief Deputy John Campbell died as his home apparently after being struck in the neck by a gunshot. Family members made a frantic call for help at 9:47 p.m.\nAccording to a news release from the Stark County Sheriff's Office, Campbell was struck following the accidental discharge of a firearm that traveled through a wall. Campbell and his family live in a house on Vixen Street NW.\nThe news release does not indicate how or why the gun fired.\nIn the 911 call, one of Campbell's two sons talks with the emergency dispatcher, explaining there had been an accidental gunshot at the house. When the dispatcher asks if everyone is OK, the caller responds, \"No. My dad got hit in the neck.\"\nThe Summit County Sheriff's Office has been asked to complete an investigation of the incident. Inspector Bill Holland said Summit County deputies were at the Campbell residence on Sunday. Initial indications are that the shooting was accidental, Holland said Monday.\nStark County Sheriff's Office staff members were hit hard by the loss, some greeting each other with hugs Monday morning.\n\"With heavy hearts, we mourn the untimely passing of our beloved chief deputy,\" the agency wrote on its Facebook page. \"A remarkable deputy, loving husband, dedicated father and irreplaceable friend.\"\nThe Facebook posting was filled with comments from area residents and former co-workers expressing sympathy and shock over Campbell's sudden death.\nStark County Sheriff George T. Maier didn't return calls Monday seeking comment.\nCampbell had been Maier's chief deputy for since February 2015. Before joining the staff, he worked for the Ohio Investigative Unit - formerly known as the Ohio Department of Liquor Control.\nIn December 2013, Campbell was named assistant deputy director and agent-in-charge of the Ohio Invstigative Unit's Canton, Toledo and Cleveland districts. Campbell joined the Ohio Investigative Unit in June 1992 and was assigned to the Akron district office. He became assistant agent-in-charge of the Cleveland district office in 2000 and agent-in-charge there in 2003.\nBefore joining the state agency, Campbell worked as a sheriff's deputy in Wayne County in 1991 and 1992, and in Carroll County from from 1987 to 1991. He graduated from Traynor's Basic Police Academy in Massillon in 1987, and completed training at the Southern Police Institute at the University of Louisville in 2002.\nDuring his career, Campbell received the Life Saving Award from the Buckeye State Sheriff's Association, and in 1999 he received a certificate of exceptional duty from the Ohio Department of Public Safety.\nHe is survived by his wife and two sons.\nReach the Repository's newsroom at newsroom@cantonrep.com or 330-580-8300."}