{"uri": "http://www.ibtimes.com/accused-gunman-charged-fatal-san-diego-police-shooting-2396137", "title": "Accused Gunman Charged In Fatal San Diego Police Shooting", "dct": "Sat, 30 Jul 2016 02:54:00 GMT", "id": "1fc6c625bac2c37f76da6893932f475f", "content": "A man suspected of opening fire on two San Diego police officers, killing one and severely wounding the other, has been arrested and charged with murder after a gunfight that left the accused gunman hospitalized, police said on Friday.\nA second man was arrested on an outstanding warrant near a house that a police SWAT team had surrounded in the aftermath of Thursday night's gun battle, but whether he was connected with the shooting was still under investigation, police said.\nThe two officers, members of the department's anti-gang unit, were shot moments after stopping at least one person in a high-crime neighborhood of southeastern San Diego, Police Chief Shelley Zimmerman said at a news conference.\nBut the precise circumstances of the shooting and what precipitated the incident remained unclear, in part because one of the two officers involved was dead and the other was hospitalized and had yet to be questioned, she told reporters.\nThe shooting came as police departments across the United States have been on high alert in the wake of fatal ambushes of law enforcement officers in Baton Rouge, Louisiana, and Dallas earlier this month, that left a total of eight officers dead.\n\"I can't begin to put into words the emotions and feelings that surround an event like this,\" Zimmerman said.\nZimmerman identified the slain officer as Jonathan DeGuzman, a 16-year-veteran of the force, who was married and the father of two young children.\n\"I worked with him,\" she said. \"I know him. He talked about his children every day.\"\nThe wounded officer, nine-year veteran Wade Irwin, was in serious condition on Friday and expected to survive, Zimmerman said.\nZimmerman said it was not clear whether the officers had made a traffic stop or a pedestrian stop when the shooting began.\nThe accused gunman, identified as Jesse Michael Gomez, 52, was charged with murder and attempted murder in the case. No charges have been filed against the second man arrested, aged 41, police said.\nUnlike sniper attacks on police that killed five officers on July 7 in Dallas and three more July 18 in Baton Rouge, there was no immediate overt indication that the police in San Diego were targeted for attack or that there were racial overtones.\nThe gunmen in Louisiana and Texas, both military veterans, apparently acted in retaliation for the high-profile deaths of a number of black men at the hands of police in confrontations that have heightened racial tensions in the United States and given rise to the Black Lives Matter movement.\nRepublican presidential nominee Donald Trump, who has vowed to be tough on crime, said in a Twitter post in response to the San Diego shooting: \"It is only getting worse. People want law and order!\"\n100%PAUSEDN/AN/AN/AN/A"}