{"uri": "http://www.nbcnewyork.com/news/national-international/San-Diego-Mayor-Kevin-Faulconer-SDPD-Chief-Shelley-Zimmerman-Police-Shooting-388746512.html", "title": "San Diego Mayor to Slain Officer's Kids: 'Your Dad is a Hero'", "dct": "Sat, 30 Jul 2016 18:58:00 GMT", "id": "837af5c14baf076c942febd18b3c95dc", "content": "San Diego Mayor Kevin Faulconer and San Diego Police Department (SDPD) Chief Shelley Zimmerman said the city stands behind the families of two police officers shot in the line of duty — officers who are true heroes.\nThe mayor and chief held a news briefing Saturday to discuss the shooting of two SDPD gang suppression officers, Jonathan \"JD\" De Guzman and Wade Irwin. The shooting shocked the city, and left De Guzman dead and Irwin seriously wounded.\nFaulconer and Zimmerman said they have been visiting the families of both officers, sharing the outpouring of love and support from the San Diego community with the grieving spouses, children and loved ones of the officers. At this point, investigators have not determined a motive for the shooting.\nFaulconer said he spoke with De Guzman's wife and young son and daughter and told them to hold their heads high.\n“We told them directly how proud all of us are — our city, our state, our nation — for JD. I told his wife and his son and daughter that he’s a hero for what he did, and that they have all of us standing behind their family. All of us.”\n\"We lost a terrific man,\" the mayor said of De Guzman. \"He served our city well, served this community for a number of years.”\nFaulconer said the past two days have been very emotional for the officers’ families and San Diego as a whole. He said the support from the community for the police department and the unity in the city is palpable, and can be felt by the families as they mourn.\n“This city is behind you and it’s going to stay behind you,” the mayor added. \"We have two heroes — who absolutely represent the best of the best.\"\nMeanwhile, Zimmerman said Saturday that the police department deeply appreciates the support from San Diego. Her officers are more determined than ever to continue to protect and serve the city.\n“Our resolve as San Diego Police officers is as strong as it’s ever been,\" the chief said. \"We will continue to go out there every single day — to proudly wear our badge, proudly wear our uniform – and make sure that our communities are safe.\"\nOn Thursday, at around 11 p.m., De Guzman, 43, and Irwin, 32, were on duty in San Diego’s Southcrest community, south of downtown. As the officers conducted a traffic stop in the 3700 block of Acacia Grove Way near Boston Avenue, they were fired upon.\nWithin seconds, the officers called for cover.\nDozens upon dozens of law enforcement officers raced to the scene, blanketing the neighborhood with patrol cars, sirens blaring. When backup officers arrived, they discovered both De Guzman and Irwin suffering from gunshot wounds.\nDe Guzman was rushed in a police patrol car to Scripps Mercy Hospital in Hillcrest. The officer — a 16-year-veteran of the force — died shortly thereafter.\nIrwin — a 9-year veteran of the department — was taken to UC San Diego Medical Center, where he underwent emergency surgery. Zimmerman said Irwin is expected to survive. His wife has been by his side as he recovers. They are parents to a 19-month-old baby.\nThe heartbreaking loss of Irwin’s partner was felt by the entire police department, Zimmerman said. The chief called the killing of De Guzman “senseless.”\nOn Saturday, the chief said telling De Guzman's family that he had died was one of the most difficult moments of her law enforcement career.\n\"It’s the most difficult thing a chief will ever have to do – to make that announcement, make that notification,\" she said. \"It was the most difficult thing I’ve ever had to do.\"\nZimmerman said she had worked with De Guzman at SDPD’s Mid-City Division and knew him well. In 2003, De Guzman earned a Purple Heart from the department after being stabbed by a suspect while in the line of duty.\nThat time, Zimmerman got to tell De Guzman’s wife that he was going to survive. This time, sadly, the chief said things turned out differently.\n“I was driving over that night, I knew I was going to have to make that notification that he was not going to be okay, and he was not coming home,” Zimmerman lamented. “Nothing prepares you for that.\"\nOn Friday evening, Zimmerman identified Jesse Michael Gomez, 52, as the suspect in the shooting of the officers. He was taken into custody shortly after the shooting in a ravine in the 1300 block of 38th Street. The chief said another “possible” suspect is Marcus Antonio Cassani, 41.\nCassani was arrested for an outstanding warrant Friday after an hours-long standoff at a home on 41st and Epsilon streets in Shelltown. At this point, it is still unclear is Cassani was involved in the shooting of the officers.\nZimmerman said the shooting occurred extremely quickly – within “seconds to a minute or so.” Both De Guzman and Irwin were wearing personal body cameras on their uniforms and the chief said “there is video evidence” on those cameras.\nOn Saturday, the chief said investigators were still working around the clock on the case, and she had no further details of the suspects to share.\nShe said although Irwin is now awake, he is still recovering from significant injuries and not in a condition to be interviewed by investigators about the incident. She said details from the surviving officer are forthcoming.\nWith the preliminary investigation underway, Zimmerman said details of the shooting could change. The chief has not said whether the shooting was an ambush.\nSources told NBC News the suspects are believed to belong to a local San Diego gang and there is no indication at this stage of the investigation that the officers were specifically targeted, as in recent incidents in Dallas and Baton Rouge that collectively claimed the lives of eight officers.\nZimmerman said that when the police shooting happened in Dallas and Baton Rouge, her department talked about and practiced what to do if this ever happened to San Diego officers. She said Saturday that investigators are “not making any correlation” to police shootings in those other cities.\n“We just don’t know yet. Our investigation will determine this,” she added.\nAt this point, the chief said investigators are not looking for any additional suspects in connection with the deadly shooting.\nZimmerman said the police department is overwhelmed by the outpouring of love and support San Diego has shown to officers.\n\"Since this tragic incident I've heard from our officers, as they're out patrolling, [that] so many community members are coming up and thanking them; more than ever before,” Zimmerman said. “And I'll tell you, that means everything.\"\n\"We became San Diego police officers because we are proud to wear the uniform and the badge of the San Diego Police Department,” she added. “We are unwavering in our commitment to make sure we have the safest city in the United States.\"\nZimmerman said a funeral for De Guzman has not been planned yet, but will share those details publicly once they're available. She described the fallen officer as a loving, caring family man who “came to work every single day just wanting to make a positive difference in his community.”\nThe chief described Irwin also as a caring, passionate police officer who works to serve the community each and every day.\n\"It’s a calling for him — for all of us,\" Zimmerman said. \"He wants to make sure our community can live in safety.\"\nShe said Irwin is eager to fully recover and get back to his duties as a police officer.\n\"That’s what he wants; he wants to get back out there as quickly as he can,\" she added.\nThe deadly shooting is a grim reminder of the dangers police officers face in the line of duty every day.\n“Police officers go out every single day, that wear a badge with pride. We all took an oath to protect and serve all of our communities. To have this happen to our police officers – we’ve seen this happen way too many times just in these last few weeks across our great country. It is tragic for everyone,\" Zimmerman said at an earlier news briefing.\nOn Saturday, the chief added that the police department and city is \"in this together,\" and it's \"never an us [SDPD] versus them [the public].\"\n“I want to thank all San Diegans who have shown their incredible support for these officers, for their families,” Faulconer added. “In times like this, it’s what brings us together. As we grieve, let’s stand strong for these families, for these officers, and what they mean to our city.”\nThe last time an SDPD officer was killed in the line of duty was in 2011, when Officer Jeremy Henwood was shot in San Diego's City Heights community. Since 1913, the city has lost 33 officers in the line of duty.\nA funeral mass will be held for De Guzman at Corpus Christi Catholic Church at 450 Corral Canyon Road, in Bonita next Thursday at 11 a.m. Members of the public are welcome.\nA public memorial service will be held at 11:00 am next Friday at Shadow Mountain Community Church at 2100 Greenfield Drive in El Cajon."}