{"uri": "http://fox61.com/2016/07/29/1-san-diego-officer-shot-and-killed-another-in-surgery/", "title": "San Diego police shooting: 1 officer killed, 1 injured", "dct": "Fri, 29 Jul 2016 06:10:00 GMT", "id": "8bc32a443b0e68db64fcf8c7559f8b1d", "content": "SAN DIEGO — One San Diego police officer was shot and killed and another was injured as they tried to make a stop, leading to one arrest and an extensive hunt for anyone else who might have been involved, police said.\nThe officer who died was Jonathan “JD” DeGuzman, 43, a 16-year department veteran and father of two, police Chief Shelley Zimmerman said Friday at a news conference.\nOfficer Wade Irwin, 32, a nine-year veteran, was in serious condition but is expected to survive, Zimmerman said.\nShe declined to name the suspect in custody, only saying he was a Hispanic male in critical condition with a gunshot wound to the upper torso.\nPolice have surrounded a house that may hold a potential second suspect in Thursday night’s shooting, Zimmerman said. Police are trying to determine whether anyone else was involved and asked residents nearby to stay inside as they searched.\nThe shooting occurred in the Southcrest section in the south part of the city, Zimmerman said.\nThe two officers, members of the department’s gang suppression unit, radioed shortly before 11 p.m. that they were going to stop someone, Zimmerman said. She said investigators have not determined whether it was a vehicle or a pedestrian stop or why officers were making the stop.\nAlmost immediately, they called for emergency backup, Zimmerman said.\nAsked whether the shooting was an ambush, the chief said it wasn’t clear.\nZimmerman said officers who responded to the pair’s call for help made a heroic attempt to save the life of their other colleague, rushing him to a hospital in a squad vehicle.\n“(There were) heroic efforts by the officers on scene, heroic efforts by the doctors to save his life,” she said, adding that he had been shot in the upper body more than once.\nOfficers’ shooting deaths up 79% from last year\nOn the subject of police shootings, Zimmerman said: “We have seen this happen way too many times just in the last few weeks.”\nThursday’s violence comes as this year’s shooting deaths of U.S. law enforcement officers outpaces those of 2015.\nAs of Friday, 34 U.S. law enforcement officers had died from shootings in 2016, a 79% increase from the total in the same period last year, according to the National Law Enforcement Officers Memorial Fund, which keeps data on officers killed on the job.\nMany of this year’s deaths came during a summer of heightened tensions between law enforcement and the communities they serve after civilian cameras captured the shooting deaths of Alton Sterling in Louisiana and Philando Castile in Minnesota at the hands of police.\nAmong the officer deaths this summer were the July 17 killings of three officers in Baton Rouge, Louisiana, and a July 7 attack in Dallas that killed five officers.\nAnnual rates of officer shooting deaths have fluctuated over the past 10 years. The decade’s highest total came in 2011, with 73 officers shot dead.\nFirearms were responsible for 41 of 123 officer fatalities in 2015, according to the memorial fund, but it was not the No. 1 cause of death. Traffic-related incidents, such as automobile and motorcycle crashes, caused 48 deaths.\nSo far in 2016, gun-related deaths are the leading cause, followed by 24 traffic-related fatalities.\nThe shooting comes with law officers around the country on alert following the killing of officers in Dallas and Baton Rouge, Louisiana, this month."}