{"uri": "http://www.nj.com/essex/index.ssf/2016/01/exchange_of_gunfire_with_newark_police_officer_lea.html", "title": "Suspect injured in exchange of gunfire with Newark police", "dct": "Sun, 31 Jan 2016 19:10:19 GMT", "id": "b455ecfc2f275352f195d89b78076685", "content": "NEWARK -- Authorities are investigating after a man was wounded Saturday night in an exchange of gunfire with a city police officer.\nA police report obtained by NJ Advance Media indicates that the shooting occurred in the midst of a traffic stop in the 100 block of Sunset Street at approximately 9:30 p.m.\nThe officer, whose name has not been released by authorities, reported to investigators that he was conducting the stop when the passenger bailed from the vehicle and fled on foot, the report indicates.\nAs the officer gave chase, the male suspect, whose name has not been released, fired two rounds from a firearm, the report states. The officer told investigators that he returned fire, striking the suspect, the report says.\nAccording to the report, a firearm was recovered from the scene.\nThe killings bring the city's homicide total to 10, six of which occurred in the last week.\nFollowing the shooting, the suspect was transported to University Hospital in Newark with non-life threatening injuries, the report says.\nKathy Carter, Essex County Prosecutor's Office spokeswoman, confirmed that the suspect remains in stable condition. Additional details of the shooting were not immediately available due to the preliminary status of the investigation, she said.\nThe police officer involved in the incident was uninjured, Carter said. He was taken to University Hospital for evaluation, she added.\nJames Stewart, president of the city's chapter of the Fraternal Order of Police, said the officer is a veteran of the police force. \"He is going home safely to his family and Newark is safer for his actions,\" he said.\nReached early Sunday morning, Newark Public Safety Director Anthony Ambrose, said the officer has been with the Newark Police Department for nearly a decade.\nAn investigation by the prosecutor's office Professional Standards Bureau is active and ongoing, Carter said.\nVernal Coleman can be reached at vcoleman@njadvancemedia.com. Follow him on Twitter at @vernalcoleman. Find NJ.com on Facebook."}