{"uri": "http://www.hendersondispatch.com/homepage/five-including-gunman-shot-in-greenville/article_999efd6c-1691-5294-805e-458a3afa3773.html", "title": "Five, including gunman, shot in Greenville", "dct": "Fri, 21 Jun 2013 00:00:00 GMT", "id": "8e470a0dbf4d083ae04c25616b93749d", "content": "GREENVILLE — A man armed with a shotgun shot one person outside a North Carolina law firm Friday, darted across a busy street and wounded three others outside a Wal-Mart before officers subdued him, police said.\nOfficers confronted the man outside the store and caught up with him behind a nearby Toys \"R'' Us. He fired at them and they shot multiple rounds back, hitting the gunman, said Greenville Police Chief Hassan Aden. The suspect was expected to survive as well as the four others he's accused of shooting, Aden said.\nGreg Siegel, a project manager at an Internet service provider near the shopping center, said he saw from his office window the gunman fleeing police. He said the man was dressed all in black and shot at police while he ran away.\n\"When the officers returned fire, I saw him get hit at least three times,\" Siegel said. \"At least two hit him in the left leg. I couldn't tell where else he was hit, maybe it was in the left shoulder, but it spun him around and knocked him down.\"\nThe gunman's first target was seated in his car outside the Kellum Law Firm on the city's south side, Aden said at a news conference. The firm's main office in New Bern declined comment. Kellum has nine personal injury offices in the eastern part of the state.\nThe suspect crossed five lanes of traffic after the Kellum shooting and injured the three others before he was caught, Aden said. Police are still trying to determine the shooter's identity and motive. He is in police custody at a local hospital, Aden said.\nThe victims are all in operating rooms at local hospitals, Aden said. He didn't give specifics on their conditions or their names and ages.\nThe shooter was using a \"pistol-grip shotgun\" with an unknown number of rounds, Aden said. He had a bag filled with ammunition, Aden said.\n\"He had enough to really do some significant damage,\" the chief said.\nEarly media reports said the gunman entered the Wal-Mart, but police later confirmed that the shooting took place outside.\n\"The gunman never entered our store. It was in the parking lot,\" Wal-Mart Stores Inc. spokeswoman Dianna Gee said. \"All customers and associates are safe.\"\nThe store has provided surveillance video to police to help their investigation, Gee said. The store never closed, she said.\nAden said police are still sifting through video footage of the scene in the city, which is about 85 miles east of Raleigh."}