{"uri": "http://www.wcti12.com/news/suspect-in-walmart-shooting-expected-to-make-plea/29380176", "title": "Gunman in Greenville shooting spree sentenced to 97 years", "dct": "Wed, 29 Oct 2014 01:20:00 GMT", "id": "ce380b8c4929c83ecacf9a7f2c387603", "content": "GREENVILLE, PITT COUNTY - The man who police say shot four people in Greenville in 2013 was sentenced to a minimum of 97 years, 8 months in prison Tuesday.\nLakim Anthony Faust pleaded guilty Tuesday morning to four counts of attempted murder, three counts of assault with a deadly weapon with intent to kill, and seven counts of assault on a police officer.\nOn June 21, 2013, Faust shot 64-year-old Timothy Edwards, a GEICO insurance adjustor, at the parking lot of the Kellum Law Firm on Greenville Boulevard at 11:44 a.m., Greenville Police said.\nFaust was armed with a pistol-grip shotgun containing bird shot, police said.\nFaust then allegedly shot three more people at the parking lot of the nearby Walmart, said police. Those victims were 70-year-old Carroll Oakes, of Grifton, 69-year-old Vernon Leggett, of Greenville, and 50-year-old Haywood Whichard, Jr., of Greenville.\nAll four victims survived the shooting spree and were released from Vidant Medical Center. But some of the men suffered severe and potentially life-altering injuries, investigators said.\n\"That could have been a disaster of international proportions because of the availability of victims and his willingness to inflict damage on our community,\" recalled Greenville Police Chief Hassan Aden.\nChief Aden said when police cornered Faust, they told him to drop his weapon, but he opened fire on the officers. Police then shot Faust, but he continued to resist arrest, forcing officers to approach him using a cruiser, said Aden.\nIndictment documents state that Faust shot and injured the victims because of their \"race, color, religion, nationality, or country of origin.\"\nFaust's trial was scheduled to begin on Jan. 20, 2015, but the plea he is expected to make today means no trial will be necessary. Following Faust's plea this morning, sentencing is expected to take place."}