{"uri": "http://www.wsvn.com/story/31813394/5-hospitalized-in-drive-by-shooting-outside-liberty-city-store", "title": "5 hospitalized in drive-by shooting outside Liberty City store", "dct": "Mon, 25 Apr 2016 00:00:00 GMT", "id": "08ebad31d575aec311ffd124a20daeb9", "content": "MIAMI (WSVN) — Four women and one man were taken to the hospital after, police said, they were shot outside a Liberty City store, Monday evening.\nCity of Miami Police are looking for the shooter or shooters, who remain on the run.\nPolice and fire rescue units responded to the scene of the reported shooting in the area of Northwest 15th Avenue and 70th Street in Miami, just after 6:30 p.m.\nOfficials said the victims were standing outside of a corner market when someone inside a lighter colored Nissan Altima opened fire on them. \"About 15 rounds possibly were shot at the time, and just very fortunate right now that there’s no fatalities,\" said Miami Police Officer Rene Pimentel.\nRudy Brown said he was grazed by one of the bullets. \"Just a little flesh wound,\" he said. \"They didn’t come out, they just kept shooting. They just drove by and started shooting.\"\nTonya Nelms said her 26-year-old cousin, Angel Nelms, was hit in the back and the hand. \"I’m on my way to the hospital,\" she said. \"When I just called her phone, I hear everybody yelling and screaming and crying.\"\nThe victims were transported to Jackson Memorial Hospital with injuries that were not life-threatening.\nFamily members formed a prayer circle outside the Ryder Trauma Center to fight fear and sadness with faith. \"It’s where our kids no longer have the privilege of enjoying outside and playing because they have to always be aware of bullets and stray bullets that are coming, intended for somebody else,\" said Vernon Gillum the pastor at New Life Tabernacle of Praise Church.\nOfficials said the passenger was the one who was likely behind the gun.\nIf you have any information on this shooting, call Miami-Dade Crime Stoppers at 305-471-TIPS. Remember, you can always remain anonymous, and you may be eligible for a $1,000 reward."}