{"uri": "http://www.nola.com/crime/index.ssf/2016/01/grandmother_arrested_in_toddle.html#incart_river_index", "title": "Grandmother arrested in toddler's death placed in 'medical custody' pending hearing", "dct": "Thu, 21 Jan 2016 09:52:00 GMT", "id": "339ee535d48fb2272579ad9d93c48e73", "content": "Deonca Kennedy, the eastern New Orleans grandmother arrested Wednesday (Jan. 20) after her 3-year-old grandson was fatally shot in her bedroom, is being held in \"medical custody\" while awaiting her first court appearance Friday, court records show.\nKennedy, 42, was booked with negligent homicide of a victim under 10, second-degree cruelty to a juvenile and child desertion after New Orleans police said she refused to cooperate with detectives investigating the case.\nPolice said the toddler sustained a gunshot wound to his chest shortly after 2 a.m., and died at a local hospital. The child's identity has not been disclosed by the Orleans Parish coroner.\n\"The initial investigation at the scene led detectives to believe that Kennedy was asleep in bed with her grandson at the time of the shooting,\" the NOPD said in a statement Wednesday. \"Kennedy's gun was underneath her pillow and detectives believe it discharged, striking the (toddler) in the chest.\n\"Detectives transported Kennedy to NOPD headquarters for questioning. However, Kennedy refused to give a statement or cooperate with detectives.\"\nThe nature of the booking charges seems to indicate police have doubts about whether Kennedy was attending to the child when the unsecured weapon was fired. Police said Kennedy is employed as a security guard.\nCourt records show that on Wednesday night, Orleans Parish Magistrate Commissioner Robert Blackburn found probable cause for all three allegations against Kennedy, who was not brought to court. The commissioner ordered Kennedy to be held without bond, pending a contradictory hearing scheduled for Friday at 3 p.m.\n\"I can't imagine what they're going through at that house,\" said Betty McCormick.\nAn Orleans Parish sheriff's office employee, not authorized to speak publicly, said Kennedy was not brought to court Wednesday because she was placed under light sedation over concerns for her health.\nThe records show the Orleans Public Defenders office was appointed to represent Kennedy. But the office filed a motion of notice to the court declining to represent her, citing caseload concerns. A judge can still order public defender representation for Kennedy if she cannot afford a private attorney.\nKennedy was ordered held without bond under provisions of Article 330.0, also known as \"Gwen's Law.\" It requires the contradictory bail hearing to be held within five days for a person in custody for certain domestic violence, stalking or allegations of felonies involving a deadly weapon committed upon dating partners, family or household members."}