{"uri": "http://www.nola.com/opinions/index.ssf/2016/05/accidental_shootings_louisiana.html#incart_river_index", "title": "12 deaths, 15 injuries from accidental shootings in Louisiana this year", "dct": "Fri, 13 May 2016 12:26:00 GMT", "id": "9438a3527280087b2093354a1feb6da4", "content": "In Detroit on Wednesday morning (May 11), 5-year-old Mariah Davis found a gun under her grandmother's pillow and shot herself to death with it. If this news surprises you, then you haven't been paying attention. There is a constant stream of news stories involving toddlers who are left in proximity to guns and inflict fatal injuries - sometimes to themselves and sometimes to others.\nIn New Orleans in January, Daniel K. Julian, a 4-year-old boy in New Orleans East, reportedly found a gun underneath his grandmother's pillow and killed himself with it. Daniel died at about 2 a.m. on a Wednesday, Jan. 20. By the next afternoon, when I was looking at a database of accidental shootings compiled by the Gun Violence Archive, the little boy's name was fifth on the list. That means that there had been four more accidental shootings that were reported and verified in a day and a half. We were still in January then, and the list of the country's accidental shootings was already 131 incidents long. There had been six reported gun accidents in Louisiana.\nAs of late morning Friday, May 13, there were 876 accidental shooting incidents listed in the database. Those incidents include 12 deaths and 15 injuries in Louisiana.\nThere were also 204 children ages 0-11 who had been injured or killed by guns and 1,021 children ages 12-17 who had been killed or injured. But not all those children were shot accidentally. Some were shot on purpose.\nIn October 2015 The Washington Post reported that there had been 43 reports that year of 1-, 2- and 3-year-olds injuring themselves or others with weapons. There hadn't even been 43 weeks in the year when that story was reported.\nThe newspaper didn't count children older than 3 as toddlers. So, presumably, when there's a report this year, the Detroit fatality mentioned above won't count. Neither will the fatality of the boy in New Orleans East.\nIn a report on NPR's \"Weekend Edition\" May 7, host Lynn Heary said, \"In the space of one week last month, four toddlers in the United States accidentally shot and killed themselves.\" Add to that the report out of Jacksonville, Fla., in March that a 4-year-old riding in the backseat of a 4-door-pickup truck shot his mother, the truck's driver, in the back. And add to that the report out of Milwaukee in April that a 2-year-old picked up a gun that slid from under the driver's seat and fired a fatal shot into his mother's back as she drove.\nOne of the dead toddlers NPR referred to is Shaquille Kornegay, a 2-year-old in Kansas City, Mo., who was taking a nap in bed with her dad, reached under his pillow and shot herself in the head. The district attorney there has charged the father, Courtenay Block, in the death of his daughter.\nWith what crime?\nMurder.\n\"This was far less of an accident as it was just a course of conduct of Block and a parenting style that left his child repeatedly in harm's way,\" Jackson County prosecutor Jean Peters Baker told NPR.\nWe should all be angry at adults who leave loaded and unsecured weapons in the reach of children, but murder doesn't seem like the appropriate charge. Deonca Kennedy, the New Orleans East woman whose grandson fatally shot himself, was charged with child desertion, second-degree cruelty to juveniles and negligent homicide of a victim younger than 10.\nIn Kansas, second-degree murder can be defined as the killing of a human being that's intentional or as the killing of a human being committed \"unintentionally but recklessly under circumstances manifesting extreme indifference to the value of human life.\"\nDoes a man keeping gun under his pillow meet that second definition of murder? I wouldn't think so. It would seem like Baker is trying to make a point. I get it. That's what prosecutors so often do. But Neary, the NPR host, asked Baker plainly, \"Does Missouri have any laws requiring the safe storage of guns?\"\nBaker said, \"No, we don't. We do not. But Missouri is not unlike a lot of states, you know, that leave that practice up to individual gun owners as to how they choose to store their weapons and then suffer the consequences, however, if something so tragic may result.\"\nAccording to the NPR report, the mother of the 2-year-old Shaquille does not want her dad charged with murder. He needs to be charged with something. Everyone who leaves lethal weapons in the reach of small children needs to be charged with something.\nBut charges can only follow tragedies. What we need is more people taking the necessary steps to prevent such tragedies and keeping their guns out of the reach of children.\n© 2016 npr\nJarvis DeBerry is deputy opinions editor at NOLA.com | The Times-Picayune. He can be reached at jdeberry@nola.com. Follow him at twitter.com/jarvisdeberry."}