{"uri": "http://www.nola.com/crime/index.ssf/2016/01/grandmother_arrested_in_shooti.html#incart_river_index", "title": "Grandmother arrested in east New Orleans toddler's shooting death", "dct": "Wed, 20 Jan 2016 19:01:25 GMT", "id": "ca24bb5e9b9808f4778c394b2a6be727", "content": "A 42-year-old grandmother has been arrested in the shooting death of her 3-year-old grandson, killed early Wednesday (Jan. 20) inside her eastern New Orleans home. Investigators think Deonca Kennedy was sleeping in a bed with the toddler when a gun beneath her pillow discharged, striking the boy in the chest, the Police Department said.\nPolice received a call at 2:12 a.m. about the shooting in the 5600 block of Red Maple Drive. The boy was taken to the hospital, where he later died, police said. Kennedy, who works as a security guard, was booked with negligent homicide, second-degree cruelty to a juvenile and child desertion.\nThe grandmother was the only one home at the time of the shooting, police said. She did not give a statement to police or cooperate with investigators, they said.\nLouisiana law defines child desertion as \"the intentional or criminally negligent exposure of a child under the age of 10 years, by a person who has the care, custody, or control of the child, to a hazard or danger against which the child cannot reasonably be expected to protect himself,\" or the abandonment of a child.\nKennedy's only other arrest was in January 2005, court records show. She was booked on charges of public intimidation and solicitation for murder. Records say about six months later, former Orleans Parish District Attorney Eddie Jordan's office refused to prosecute the charges.\nA domestic \"stay away\" order was issued in that case in February 2005, during a hearing in which Kennedy was released without bond. The record is not clear if the order was issued against Kennedy or another person.\nThe NOPD did respond to a query about the circumstances surrounding the 2005 charges. Assistant District Attorney Christopher Bowman, a spokesman for Orleans Parish District Attorney Leon Cannizzaro's office, said information about the refusal of the 2005 charges was not immediately available.\nChild abuse detective Tyra Pruitt is leading the investigation. Anyone with information on the case was asked to call police at 504.658.5267 or Crimestoppers at 504.822.1111.\nStay with NOLA.com for more on this developing story."}