{"uri": "http://www.azcentral.com/story/news/local/gilbert/2016/07/30/gilbert-area-slain-gerhart-siblings-remembered-queen-creek/87800656/", "title": "Slain siblings remembered at memorial as bright, kind", "dct": "Sat, 30 Jul 2016 00:00:00 GMT", "id": "688a13a8783611fbaed1c6ae1917ed19", "content": "Mark Quinones/azcentral.com\nSobs echoed across the auditorium as it filled with grieving parents and their children. As the lights went down, candles were lit, illuminating the tear-stained faces mourning the deaths of Kyle and Emily Gerhart.\nFriends and community members gathered in Queen Creek on Saturday to remember the two siblings found dead in their home along with their mother Monday.\nThe Maricopa County Sheriff’s Office believes Lisa Gerhart shot and killed 17-year-old Kyle and 12-year-old Emily before killing herself at their home in an unincorporated area of Maricopa County, but continues to investigate the deaths.\nKyle and Emily had been active with Queen Creek community theater. At Saturday's memorial at the Queen Creek Performing Arts Center, residents, classmates and fellow performers remembered them for their kindness, energy and talent. Attendees pinned yellow and green ribbons on their shirts as they entered, and filled out cards to share their memories of the children with surviving family members.\nHigh school student Jace Bright was in several plays with the siblings. He tried to remember the good times with Kyle and Emily. He said they immediately impressed him when he met the pair this year at a performance.\n“I was amazed by how well Kyle was able to pull off his accents and how sassy Emily was,” Bright said.\nHe said Kyle brightened his day.\n“I idolized Kyle for his comedy,” Bright said. “Sometimes he showed me up. It was a challenge. And Emily was just a little ray of sunshine. I’m sad they’re gone, but I know they’re out there somewhere.”\nThey 'encouraged me’\nMark Tubbs, play director at the center, said the Gerhart siblings were essential members of the town's “theater family.” He said they often encouraged other students to perform and helped with the stage setup.\nTubbs recalled a performance of \"Annie\" when Emily shined as a “spunky” lead actor.\n“I was just blown away by the girl’s talent,” he said. “She made me feel more comfortable in my own skin.”\nTubbs choked back tears as he read the handwritten memories aloud to the audience, revealing two children who were admired and loved.\n“I remember the first time I came into rehearsal and was nervous,” read one note. “Kyle and Emily encouraged me.”\nParents of another child wrote that Kyle was “the kindest-hearted young man we’ve ever met.” Another student wrote that Kyle was known as “the Frost guy” because of his job at the local ice cream shop, and “the cute guy who played the mayor” for one of his recent roles.\nPlay director David Lucas remembered when Kyle borrowed a suit jacket for a costume in one of the plays. Lucas said the boy returned the jacket dry cleaned and pressed with coupons from Frost tucked in the pockets.\n“What teenager does that?” Lucas said. “That’s pretty impressive. He was a wonderful young man.”\nHe said the siblings would swing dance between rehearsals, and that Emily was always the first to be quiet, but also the first to suggest a game of tag during breaks.\n“Emily is a spark,” Lucas said. “She was always the first to memorize her lines. That showed her commitment to not just being excellent, but extraordinary.”\nFollowing speeches from leaders of the Queen Creek Performance Arts Center, a candlelight vigil was held in the auditorium of the center while attendees sang along to “Seasons of Love” from the musical TV show \"Glee.\"\nSheriff 'confident' it was murder-suicide\nThe Sheriff's Office continues to investigate the deaths, but Sheriff Joe Arpaio said he is certain the children were murdered and the mother killed herself.\nA neighbor called law enforcement at 9 p.m. Monday and reported seeing a car running in the driveway with a hose running from the exhaust into the home. Deputies donned protective gear as they entered the home, which was filled with carbon monoxide.\n\"It's a sad situation,” Arpaio said. “Many of our deputies, including myself, are married and have children. But we have a job to do; I don’t know if you ever get used to it, but here we’re talking about a 12-year-old and a 17-year-old.\"\nAlthough he was confident in the murder-suicide theory, Arpaio said the possibility remains of an unknown assailant entering the home and murdering the family.\n\"We're looking at other aspects to make sure we get the correct evidence and conclusion to this sad situation,\" Arpaio said. “We’re leaving that little part open just in case someone else could have caused these three deaths. But I think we’re pretty confident it was a murder-suicide.”"}