{"uri": "http://www.ktvb.com/news/crime/second-suspect-in-shooting-of-10-year-old-girl-arrested/263385139", "title": "More arrests in gang-related shooting case", "dct": "Mon, 04 Jul 2016 00:00:00 GMT", "id": "e65ab03733b4ff2843ef909ac83c8fa6", "content": "NAMPA - Four people wanted in connection with last Wednesday's shooting outside a Walmart in Nampa are now in police custody. Three were arrested today and another man was arrested the night of the shooting.\nOfficers arrested 19-year-old Mario Garza this afternoon following a tense two-hour standoff at a Nampa apartment complex.\nPolice say two more men were also arrested today on charges stemming from a gang-related shooting that injured a 10-year-old girl.\nGarza was arrested without incident about 2:15 p.m. at the Gateway Crossing Apartments in Nampa.\nNampa police says Garza and 21-year-old Ezri Garcia got into an argument in the parking lot of the Walmart store on East Franklin Road around 10:15 p.m. on June 29. The fight escalated and both men pulled out guns and started shooting at each other.\nThe shooting happened as people had gathered to watch the fireworks show from the God and County Family Festival at the Ford Idaho Center. One bullet struck a 10-year-old girl in the shoulder.\nGarcia was taken into custody that night. A handgun was recovered at the scene. He is being held in the Canyon County Jail on $1 million bond.\nProsecutors say they believe it was a gang-related incident between the two men.\nNow after five days and a nearly two-hour standoff, Mario Garza is in police custody.\nThe standoff started just after noon. Police arrived with a search warrant after receiving a tip that Garza may be inside a unit there.\nBelieving that Garza may be armed, Nampa police arrived with its full crisis negotiation and tactical team.\nPolice negotiated with Garza over the phone and on the loud speaker, asking him to turn himself in. All this while dozens of neighbors looked on, many recording the standoff on their phones.\nThen around 2:15 p.m., Garza complied and turned himself over to police without incident.\nHe faces charges of aggravated assault with a gang enhancement and rioting.\nAlso arrested today was 24-year-old Eric J. Hernandez. He faces a felony charge of harboring a fugitive.\nAnother 16-year-old was arrested on charges related to Wednesday's shooting. That brings the total number of people in custody to four.\nCopyright 2016 KTVB"}