{"uri": "http://www.ktvb.com/news/crime/girl-shot-in-nampa-walmart-parking-lot/260491594", "title": "Child hit by stray bullet in Nampa Walmart parking lot", "dct": "Thu, 30 Jun 2016 00:00:00 GMT", "id": "f4410dfb58d0d4eec24ba0a168359fa4", "content": "NAMPA -- One man is in custody and police are looking for another suspect after a girl was shot in the parking lot of a Nampa business Wednesday night.\nThe shooting happened at about 10:15 p.m. in the parking lot of Walmart on East Franklin Road.\nNampa Police Capt. Curt Shankel said the 10-year-old victim was in the parking lot with her family to watch the fireworks show from the God and Country Family Festival at the nearby Ford Idaho Center when she was struck by a stray bullet.\nAccording to police, 21-year-old Ezri Garcia and another man got into a fist fight near the front of the Walmart. The fight escalated to a gun battle, with both men drawing weapons and shooting at each other, Shankel said. One of the rounds struck the girl in the shoulder.\nThe child was taken to the hospital by ambulance, where she will undergo surgery to remove the bullet. Garcia was taken into custody by police, but the other man who was shooting got away before officers arrived, police say.\nThe second suspect is described as a Hispanic man standing 5'7 or 5'8 with a small build. He was wearing a black shirt at the time of the shooting, and may have left with a group of males in a black sedan.\nIt's unclear whether that man was shot during the exchange. Garcia had an minor injury to his head, but did not need to go to the hospital.\nIt's unclear whether Garcia or the other man fired the round that struck the child.\nPolice found multiple shell casings from two different caliber guns in the parking lot, and say they seized one handgun when they arrested Garcia.\nGarcia appeared in court on Thursday. He's charged with one count of aggravated battery with an enhanced weapons charge, aggravated assault, and riot. Prosecutors said in court they do believe it was a gang-related incident between the two men. A judge set his bond at $1 million.\nIt's unclear what started the fight between the two men, but Shankel said Garcia and the other suspect exchanged words before the brawl began.\nShankel said the preteen was not involved in the dispute, and had not come to the parking lot with either suspect. Her injuries are not considered life-threatening.\nAnyone with information on the shooting is urged to contact Nampa Police immediately.\nCopyright 2016 KTVB"}