{"uri": "http://6abc.com/news/4-people-injured-in-wilmington-shooting/1386053/", "title": "Teens and 12-year-old injured in Wilmington shooting", "dct": "Wed, 15 Jun 2016 00:00:00 GMT", "id": "e268ec09d89f6ad4b1eb41d4b5983434", "content": "WILMINGTON (WPVI) --\nFour young people - three teenagers and a 12 year old - are recovering after a shooting in Wilmington, Delaware.\nThe shooting occurred before 9:15 p.m. Tuesday.\nA Wilmington police officer on routine patrol heard shots and called for back-up. He then found several victims scattered around the neighborhood.\nPolice determined four young people had been hit by gunfire. All were taken to area hospitals.\nBy Wednesday morning, 13-year-old Essence Hayman had been released, a bullet still lodged in her thigh.\nShe described when happened when the gunfire erupted.\n\"We started running,\" she told Action News. \"Chris, he had dodged behind a car. And I looked back, and he was on the ground.\"\nPolice say Essence and her friend, 12-year-old Christian Williams, were innocent victims.\nThey were playing a game of tag in front of a home on South Van Buren when a hail of gunfire peppered the intersection of Elm and South Van Buren.\nEssence was hit in the thigh. Christian was shot in his right side and feet.\n\"I was trying to get home,\" said Hayman. \"I was going to go back to get Chris but he told me to go on.\"\n\"I just saw blood,\" said Christian's grandmother, Darlene Van Riper. \"He was in shock and trembling.\"\nVan Riper knew he was outside and ran out when she heard shots. A bullet remains in Christian's side.\nPolice say the gunfire began shortly after 9 p.m. Initially they found a 16-year-old boy at Elm and South Van Buren shot in the legs and arm.\nHe was taken to the hospital with stable vital signs.\nMore 911 calls brought police up the block to Elm and South Harrison.\nThey found a 15-year-old with gun shots to his hand, stomach and leg. Medics rushed him to the hospital, where he remains in critical condition.\nThe shooting came just one day after another shooting the same neighborhood, which injured a 24-year-old man.\nPolice have not said whether the shootings might be connected, nor have they released information about a suspect in Tuesday night's violence.\nThe investigation is ongoing.\nAnyone with information was being asked to call Detective Lindsay Hageman at 302-576-3630 or Detective A. Reddick at 302-576-3649."}