{"uri": "http://www.cbs5az.com/story/32536849/mcso-mother-two-children-found-dead-in-probable-murder-suicide", "title": "MCSO: Mother, two children found dead in probable murder-suicide", "dct": "Tue, 26 Jul 2016 18:33:00 GMT", "id": "9502fe8b1859d7c65c4773a39f74c8f5", "content": "GILBERT, AZ (3TV/CBS 5) -\n\"We are almost sure this is a murder-suicide,\" says Sheriff Joe Arpaio.\nThe Maricopa County Sheriff’s Office says a mother and her two children were found dead in a home in an unincorporated area of Gilbert, near Recker and Ocotillo roads.\nThe mother has been identified as Lisa Gerhart, a woman in her mid-40s.\nThe two children are a 17-year-old boy and a 12-year-old girl.\nAll three victims had been shot.\nIn a Tuesday news conference, Arpaio said a handgun was found near the mother's body.\nArpaio also said a neighbor saw a car backed up to the house, and there was an exhaust pipe going from the car into a window of the home.\n[Raw video: Arpaio briefing on people found dead in Gilbert area home]\nSheriff’s deputies were called out to the residence Monday night in reference to deceased persons at the home.\nDeputies arrived on scene and found three bodies inside the home, according to MCSO.\nNeighbors tell us they noticed a heavy law enforcement presence near the home Monday night. \"We just saw cop cars, and the sheriff and an ambulance,\" said neighbor Louise Peaton.\nTuesday afternoon, officials could be seen wheeling out bodies out on stretchers. The bodies were covered in blue blankets.\n\"The children, everyone should help them or something, but there was nothing we could do,\" said neighbor Connie Rivera.\nArpaio says autopsies will be done to confirm the exact cause of deaths.\n\"I think we can be pretty confident this is a murder-suicide,\" says Arpaio.\nArpaio went on to say that this is likely a case of domestic violence, and said they had \"problems within the family.\" He said there could \"possibly be a separation between the husband and wife.\"\nArpaio called it a sad situation. \"Domestic violence is something we have to look into,\" he said. \"People are killing each other and taking their own lives.\"\nSheriff Joe Arpaio talks about the possible murder suicide in East Valley last night. Sad, mother and 2 juveniles pic.twitter.com/RVLnjmCKu0\n— Chris Hegstrom (@MCSOChris) July 26, 2016\nVictims were shot. Looks like murder-suicide, mother and 2 children\n— Lindsey Reiser (@LindseyReiser) July 26, 2016\nUpdate on bodies found outside Gilbert-@RealSheriffJoe says car exhaust pipe was going into window of home, home smelled of carbon monoxide\n— Lindsey Reiser (@LindseyReiser) July 26, 2016\nCopyright 2016 KPHO/KTVK (KPHO Broadcasting Corporation). All rights reserved."}