{"uri": "http://www.wcnc.com/news/crime/shelby-police-investigating-after-two-shot-in-drive-by-shooting/343075567", "title": "3 arrested in Shelby double homicide", "dct": "Fri, 28 Oct 2016 00:00:00 GMT", "id": "0b8e19515042728b424c71c6653c7f7c", "content": "SHELBY, N.C. -- Shelby Police said Friday afternoon that three arrests have been made in the shooting that left one injured and two dead-- including a 3-year-old little boy.\nPolice said they arrested Aubre Sucato, Morris Antonio Abraham and Mario Wilson.\nWhat was first thought as a drive-by was later corrected by investigators; they say the shooting was not a random act of violence, but intentional, and occurred inside the home.\nIn a press conference Friday, Shelby Police Chief Jeff Ledford said the shooting was a drug robbery gone bad-- that the trio tried to rob a man in the home of his marijuana.\n\"It is sad that something, a robbery of a person, would lead to that,\" Chief Ledford said.\nFamily members identified the victims as Miranda Woods and 3-year-old Liam Beason.\nLiam's stepfather, Tyler Beason, said, \"He was probably one of the smartest little babies I've seen in all my life-- full sentences-- he could count-- he knew hold he was was, when his birthday was.\"\n\"Who could do this to a child? Who is heartless enough to do this?\" a family member asked.\nLiam's family, who regard Miranda as another family member, say they have no idea who would kill her and the child.\nPolice say officers arrived around 7:30 Thursday morning to find little Liam dead, as well as Miranda Woods. A third person, Gerod Shippy, was taken to the hospital but is expected to survive. Police say it was Shippy's marijuana.\nShelby's Police Chief was clear upset when pointing out to reporters this is the second child shot in Shelby since May when 4-year-old Aryanna Odoms was hit in a drive-by; she's still recovering.\n\"There are children being hit by gunfire-- that is what we have got to stop,\" Chief Ledford said.\nCopyright 2016 WCNC"}