{"uri": "http://www.valleymorningstar.com/news/local_news/article_0551b254-74aa-11e6-a9bc-8ba83135e99e.html?mode=jqm", "title": "Another local teen dies in shooting: Best friend is charged with manslaughter", "dct": "Mon, 29 Aug 2016 00:00:00 GMT", "id": "3c4bea9bdd9ea8d10b27e7119b47941e", "content": "SAN BENITO — An 18-year-old San Benito man faces a manslaughter charge after accidentally shooting his friend with a .40-caliber pistol, according to authorities.\nRamon Saldivar Jr. has been charged in the death of 17-year-old Francisco Cortina, authorities said.\nIt was the second shooting death of a San Benito area teen in the past 11 days.\nThe latest shooting happened Monday evening in the 200 block of Los Ranchitos in El Ranchito.\nSaldivar called authorities Monday night to notify them he had accidentally shot his best friend, Cameron County Sheriff Omar Lucio said.\n“After being interviewed by the investigators,” Lucio said, “Mr. Saldivar stated that while playing with a .40-caliber handgun he accidentally shot his friend Francisco Cortina in the chest.”\nCortina was rushed to Valley Baptist Medical Center in Harlingen, where he was pronounced dead by medical officials, said Lucio.\nThe ownership of the handgun remains under investigation, the sheriff said.\nIn a press conference, Lucio expressed condolences to the Cortina family and lamented the “all-too-frequent” shootings of young people due to mishandling firearms.\n“Too many times, we see this tragic event caused by the mishandling of firearms by youths,” Lucio said.\n“And I urge the public to educate their children if they are going to handle firearms.”\nThe sheriff referenced a shooting that occurred Aug. 27 in San Benito in which he said that playing with firearms at a party led to the death of another teenage boy.\nDevin Leal, also 17, died after he was shot in the head at a “get together” with friends.\nHis friend Jonathan Gamez, 21, was charged with manslaughter after police said he told investigators he was handling a .40-caliber pistol when it went off, striking Leal.\njsalinas@brownsvilleherald.com"}