{"uri": "http://www.floridatoday.com/story/news/2016/09/06/man-charged-friends-cocoa-beach-shooting-death/89905222/", "title": "Man charged in friend's Cocoa Beach shooting death", "dct": "Tue, 06 Sep 2016 00:00:00 GMT", "id": "51aa857ccc028225a33bc49615f26893", "content": "A 58-year-old Merritt island man suspected of shooting to death a friend in his car during a dispute over the weekend has been arrested.\nLeonard Nelson Lopez was charged with manslaughter in connection with the Friday night (Sept. 2) shooting death of John Charles McLean, 53. Both men, who lived on separate houseboats in a marina off Merritt Island, were out with their wives in Cocoa Beach shortly before the incident happened. The shooting - the 19th reported homicide to take place in Brevard County this year - happened in Cocoa Beach. The couples had known each other for at least five months.\n“They were friends,” said Manuel Hernandez, spokesman for the Cocoa Beach Police Department.\nInvestigators said that the two men got into Lopez’s blue 2005 Lincoln Town Car as the wives walked away. The two men then got into an argument while sitting in the car in the parking lot of 150 Minutemen Causeway, officials reported. Moments later, police reported that Lopez used a gun to shoot McLean in the head.\n“What they were arguing about is unknown at this time. That’s still being investigated, but they were arguing,” Hernandez said.\nCocoa Beach police arrived at the scene along with crime scene agents from the Brevard County Sheriff’s Office. Lopez was taken into custody near his houseboat about 9 p.m. Monday.\n“This is certainly a tragic event. I am proud of our team for their professionalism throughout the investigation—from the officers on-scene to the detectives who worked assiduously to solve this case in a timely manner and bring some sense of closure to the decedent’s family. I would like to thank BCSO’s crime scene unit and Game Over task force for their assistance as well,” Chief Scott Rosenfeld said in a statement earlier Tuesday.\nLopez was booked into the Brevard County Jail Complex on a no bond status. He is set to go before a judge at the jail late Tuesday.\nContact Gallop at 321-242-3642, jdgallop@floridatoday.com and Twitter at @JDGallop"}