{"uri": "http://www.baynews9.com/content/news/baynews9/news/article.html/content/news/articles/bn9/2017/1/22/no_answers_yet_in_4_.html", "title": "Police release ID of boy, 4, shot to death in Auburndale", "dct": "Mon, 23 Jan 2017 01:35:00 GMT", "id": "f626ad55bf6d74f5555d1c2510a2de19", "content": "A death investigation is ongoing in Auburndale after a 4-year-old was killed Friday by an apparent gunshot.\nInvestigation ongoing after 4-year-old shot\nChild shot Friday night in Auburndale\nChild ID'd as Avion Weaver, according to Auburndale PD\nAuburndale police responded to a home in the 100 block of Lakeside Hills Loop around 10:15 p.m. Friday where they found an injured child.\nThe child, according to investigators, is A'vion Weaver.\nNeighbor Erika Byars called him \"very smart,\" and said he was well-known in the community.\n“He used to come every day and look for my son and they would ride their bikes together and stuff,\" said Byars. \"So, we’re going to miss him a lot. It’s not easy. It’s really been a lot of on us too. I mean they’ve been crying a lot, the kids. We just can’t believe this happened.”\nPolice said Weaver was watching television, in the care of his mother's live-in boyfriend, Demeko Robinson, 26, ​at the time of the shooting.\nAfter conducting interviews, Police believe Weaver got a hold of a loaded 9mm pistol in the living room while Robinson was outside talking to friends. Deputy Chief Andy Ray said the child accidentally shot himself in the face while playing with the gun.\n\"They really took good care of him. That’s why it’s hard for me to believe that [the gun] was left out,\" said Byars.\nAuburndale Deputy Police Chief Andy Ray said the initial story was that the boy had fallen and hit his head on the table, but they soon found that not to be the case.\nRay said the boy's mother, Deja Perry, was not at home at the time, but returned home minutes after Robinson called 911 and before the first officer arrived.\nWeaver was flown to Arnold Palmer Hospital in Orlando, where he was pronounced deceased around 11:27 p.m., according to Ray.\nInvestigators are working with the state attorney's office to determine if Robinson will be charged with culpable negligence, a third degree felony, for illegally having a loaded gun in an insecure location where a child could get ahold of it."}