{"uri": "http://www.nola.com/crime/index.ssf/2016/12/baby_murdered_marrero.html#incart_river_index", "title": "'They slaughtered a baby on our watch!' activist says of Marrero shooting", "dct": "Wed, 07 Dec 2016 13:05:34 GMT", "id": "058b1e0582a91b045b6d9694b40bf507", "content": "Ashonta Wyatt has attended a lot of vigils. \"I've done so many I've lost count,\" she said on the phone Monday evening. To hear Wyatt tell it, she's the go-to choice to speak when people are standing in a circle holding candles and openly mourning the loss of yet another person to violence. She's tired of it.\nOn Sunday night in Marrero, Wyatt was yet again in attendance as the community came together to mourn the death of Xy'Ahir Davis, a 10-month old who was shot when a gunman burst into a Marrero home Saturday afternoon.\n\"When are you going to be tired?\" she asked the people gathered at the vigil outside the house where the baby was killed. \"I hold everyone accountable for this. They don't have a box big enough for this baby.\"\n\"We cannot be OK with this,\" she said. \"And we better start speaking up.\"\n10-month-old Xy'Ahir Davis was shot and killed Saturday afternoon inside a home in the 2100 block of Caddy Drive.\nThe story about Sunday night's vigil described Wyatt as the founder and executive director of a group called Mother2Mother. When I asked her Monday what Mother2Mother does and how it got the name, Wyatt began with a story about growing up in the Fischer Housing Development in Algiers. There were \"back and forth retaliation killings,\" she said. \"The killings were very personal\" to her. \"I knew everybody involved.\"\nShe knew the mothers in the housing development knew everybody, too, and she figured that if they would come together, they could exert a positive influence that would decrease the amount of gunplay. They could - as she put it Monday - stop pretending not to know how their unemployed sons were bringing large sums of cash into the house. They could get their sons in line. \"Y'all can put a dent in this,\" she said.\nSo she had the idea for an organization of that name in her head. In January 2015 when 17-year-old Tokoyo Palmer was killed in Algiers - allegedly by a 21-year-old who was angry the teenager hadn't returned his $40 Xbox video-game controller - Wyatt said, \"I took (the idea) out of my head and I put it in action.\" She filed for 501c3 nonprofit status for her organization soon after that murder. \"If not me, then who?\" she said Monday.\nIt was hard to get an exact read on what Wyatt's organization does because it seems she and her organization do some of everything. The mission statement on the Mother2Mother website describes the group as \"a grass roots non-profit organization designed to connect the residents of New Orleans with crime prevention initiatives and community outreach opportunities aimed to improve quality of living, in an effort to reduce violence crime, particularly murder in the New Orleans Metropolitan area.\"\nShe has, she said, a \"case by case, whatever works kind of system.\" She has helped counsel people who are trying to put a life of crime behind them. She has supported mothers who have turned their criminal children in to authorities. She has helped mediate disputes. She's held several anti-crime rallies.\nBut everything is based on that original idea that mothers in the community can exert more of an influence, especially those mothers who have already buried children.\n\"If you ever lost a son,\" Wyatt said Monday, \"you ought to want to help this lady save her son.\"\nOf course, people are afraid. They feel that if they speak up and identify the people responsible for the murders in their community, then they, too, will be hurt or killed. It's not unwarranted for witnesses and other people with information about crime to fear being hurt. But Wyatt sounds a little bit like the television psychologist Dr. Phil who is notorious for asking people resistant to change, \"How's that working out for you?\"\nJefferson Parish authorities say at least five people were inside a house in the 2100 block of Caddy Drive when a gunman invaded at about 4:30 p.m. and started shooting.\nAt least five people were inside the home when someone came through the front door and started shooting.\nA man in the house was seriously wounded but was expected to survive. Xy'Ahir, the baby, was taken to West Jefferson Medical Center where he was pronounced dead.\n\"Fear is not keeping you safe!\" Wyatt said. \"They slaughtered a baby on our watch!\"\nJarvis DeBerry is deputy opinions editor at NOLA.com | The Times-Picayune. He can be reached at jdeberry@nola.com. Follow him at twitter.com/jarvisdeberry."}