{"uri": "http://www.dailymail.co.uk/news/article-3716521/Seattle-house-party-shooter-depressed-break-just-bought-AR-15-week.html", "title": "EXCLUSIVE: Seattle house party shooter ‘called pal in tears after murdering ex-girlfriend and asked how he should kill himself’… and was so depressed after break-up that friends BEGGED his parents to return his brand new AR-15", "dct": "Sun, 31 Jul 2016 01:58:00 GMT", "id": "b0cf6f39d1381612ac48c58205ea6911", "content": "A 19-year-old University of Washington student suspected of killing his ex-girlfriend and two others at a house party on Saturday had bought his AR-15 rifle only last week, a friend has revealed.\nAllen Ivanov is in custody for the murders of Anna Bui, Jake Long and Jordan Ebner, who were killed at a Mukilteo, Washington, house party just before 12.30am on Saturday.\nA grandmother revealed that she was texting her 18-year-old granddaughter as she hid in the closet as the shooting unfolded.\nA friend of Ivanov's, who would only identify himself as a Baltimore college student, has exclusively revealed to the Daily Mail Online that Ivanov was depressed after the break-up with Bui.\nScroll down for video\nThe friend said when Ivanov texted him a picture of an AR-15 last week, he at first thought nothing of it.\nBut that all changed in the early hours of Saturday morning, when Ivanov called the friend from his car and dropped a bomb, telling him: 'I just killed my ex-girlfriend'.\n'We didn't know if it was serious or not,' the friend told Daily Mail Online. 'We thought it was a joke, he called us at 2.30am.'\n'We didn't think he was capable of doing something like that. He was always a prankster and a jokester. He used to love playing Halo, but he never showed any signs of violent behavior.'\nBut the friend, who said he has known Ivanov for two-and-a-half-years after they met while playing Halo online, said he was hysterical.\n'Throughout the phone conversation he kept asking \"What's the best way to kill myself?\", he was crying, saying \"What did I just do?'\"\nThe friend tried to convince Ivanov to park the car, and immediately called Seattle Police. But it was too late.\n'He was definitely in an altered state of mind,' he said. 'The Allen that I knew was not anymore, that was definitely not Allen that I was talking to.'\nSusan Gemmer was texting her 18-year-old granddaughter Alexis at the time.\nShe told CBS News: 'She was hiding in the closet and called me from the closet while it was going on,.\n'We were texting back and forth, telling her to stay quiet, stay calm, we're on our way. She kept saying, 'They're dead, they're dead, I saw them, I was right there and I saw them.'\nIt was only after news broke that three had been left dead at a house party in Ivanov's hometown that the friend learned the University of Washington college student had not seemed like himself for some time.\nOther friends close to Ivanov had realized just how distraught he was over the split with Bui, and red flags were immediately raised when he purchased an AR-15.\nIvanov, who graduated from Kamiak High School in 2015, even posted a picture of the rifle on his Instagram, laying it on the ground with three bullets by the weapon's side.\nOn the rifle is a sticker from the exclusive Supreme New York streetwear brand that reads: 'Supreme 16 You Still Suck'.\nThere is also a piece of blue painter's tape on the gun that reads 'Christopher', which public records show is Ivanov's middle name.\nThe caption of the post reads: 'You can't run with me.'\nIvanov also posted cryptic tweets on his Twitter two days before the shooting.\n'First and last tweet,' he wrote on July 28. 'I've been through it all.'\nHe then tweeted 'What's Ruger gonna think?', which seems to be a reference to Ruger Firearms.\nSeveral friends became so concerned that they reached out to Ivanov's parents and asked them to return the gun, but they didn't believe Allen could ever do something so horrific.\nAnd, the friend, added, neither did anyone else.\n'Allen was very calm, very handsome, ladies loved him,' he said of Ivanov, who was supposed to start his sophomore year at the University of Washington this fall.\n'He was a very friendly guy, he was smart.'\nIvanov is a computer science and engineering major, according to his LinkedIn page.\nHe is also an engineer and founder of Skirmos, an open source laser tag system that allows users to 'imagine your favorite first-person video game in real life'.\n'I don't think his parents knew he was capable of something like this,' the friend said. 'We didn't know he was capable of something like this.'\nThe friend said he thought Bui had broken up with Ivanov a month or two ago, but he claimed to have dumped her.\nHe said Ivanov often had a jealous side and felt like he had 'something to prove', but said his longtime friend seemed completely normal when they met up in Washington DC earlier this summer.\nThe friend said others who knew the couple claim they only split last week.\nEither way, the friend said he and others close to Ivanov are now left wondering if anything could have stopped the deadly night that took Bui and two innocent boys' young lives away.\n'If he had talked to a psychiatrist or something before, maybe it would have prevented this,' the friend said.\nThe friend wonders if maybe Ivanov would have never been allowed to purchase a gun if he had to undergo a psych evaluation and if his depression over the break-up was more well-known.\n'My friends and I were talking, how can he easily get this AR-15? He had no criminal history, but he definitely had some psychological issues,' he said of Ivanov.\n'We didn't think gun control was that important until now,' the friend said in tears. 'We didn't realize how easy it was for a friend to get a gun and kill somebody.'\nDave Wakeman, who is listed as one of the founders of Skirmos, told Daily Mail Online the company was shocked by the shooting.\n'Allen Ivanov has worked with us and been our friend and colleague for a number of years,' he said.\n'That said, this event is another example of our need for gun reform in this country.'\n'No person should have the opportunity to possess a firearm that can discharge a weapon 20 times in short succession.'\n'The time to take action so that senseless deaths like this don't continue to be the norm in our country has passed. We absolutely need to take immediate action on this issue.'\nFriends of the three young victims immediately took to social media to pay tribute.\nThe Kamiak graduate told Daily Mail Online that she had a class with Bui, who she described as the ‘sweetest girl’.\n‘She always had a smile on her face and a joke at the ready,’ she said.\n‘She had so much energy and a light about her that could just brighten up a room. If she was in the building, you could hear her laughter.’\n‘She cared so much about her friends and was so full of love. She had a huge heart.’\nKayla, a senior at Kamiak, said Anna had been her idol both in choir and life itself.\n'She was the kindest and happiest soul,' Kayla told the Daily Mail Online.\nMembers of Kamiak Choir organized a candlelight vigil at the high school on Saturday night to honor Anna, Jake and Jordan.\nIvanov was arrested over 100 miles away in Lewis County when officers spotted a car that matched the suspect's description about two hours after the shooting.\nOfficer Myron Travis said police are not looking for any other suspects.\nThe shooter was due to be be booked into the Snohomish County Jail on Saturday on murder-investigation charges, according to the Seattle Times.\nA witness said the gunman walked toward the back of the $1million home in the waterfront Chennault Beach neighborhood and shot two people by a fire pit.\nHe then went up to the roof, where others were hanging out, and opened fire.\nOne person was taken to Harborview Medical Center with gunshot wounds and is listed in serious condition.\nMukilteo Mayor Jennifer Gregerson said initial reports regarding the injured victim are 'hopeful'.\n‘Our community has been shaken to its core,' she said during a media briefing. 'We grieve with the families of those lost in this horrible event. We will stand with them and be here for them.’\n‘One thing is clear. Our community has suffered a great loss tonight. There were many young people who saw and heard things that no one should ever have to experience.'\nIvanov's friend didn't see or hear the shooting, but he feels wracked with guilt.\n'I wish we could have stopped it, I really wish we could have stopped it,' he said. 'I couldn't sleep after that call.'\n'I hope Obama or the next president has psychological checks for this, because this is about people dying.\n'I just - I wish this would all change.'"}