{"uri": "http://www.heraldnet.com/news/ivanov-initially-told-police-mukilteo-shootings-were-an-accident/", "title": "Ivanov initially told police Mukilteo shootings were an accident", "dct": "Sat, 03 Sep 2016 01:30:00 GMT", "id": "f7a1c74632ca7602734d7ed6aa72fe28", "content": "EVERETT — As he met with detectives July 30, a few hours after allegedly shooting to death his former girlfriend and two young men, Allen Ivanov reportedly was contemplative.\nHe initially tried to claim that the gunfire at a Mukilteo house party was an accident, that he was confused and not thinking straight, according to new court papers made public late this week. But he also described skulking outside for a couple of hours and sneaking up close enough to eavesdrop on conversations. He admitted being angry and jealous that Anna Bui appeared to be having a good time without him.\nIvanov reportedly described going back to his car and spending about 20 minutes reading the owner’s manual for the Ruger AR-15-type semiautomatic rifle he’d purchased four days earlier. He needed to know how to load and ready the weapon to fire.\n“Ivanov admitted that when he put the magazine in the rifle and took the rifle out of the car that he intended to kill people,” Mukilteo police detective John Ernst said in an affidavit filed in support of Snohomish County Superior Court search warrants. “… He admitted that at the moment he loaded the magazine, his plan was to return to the party and use the rifle. Ivanov maintained that he did not mean to shoot Bui.”\nWhen confronted with evidence he’d deliberately targeted the young woman, Ivanov reportedly responded in fragments: “If you were in that situation, it’s hard to, I’m not trained.”\nThen, according to the detective, he added, “It’s so easy to do.”\nIvanov is charged with three counts of aggravated murder and two counts of attempted first-degree murder. The 19-year-old from Mukilteo has pleaded not guilty. He’s been ordered jailed without bail. Prosecutors have 120 days to decide whether to seek capital punishment. Aggravated murder carries two possible sentences: death or life in prison.\nThe new search warrants were sought so detectives can pore over social media accounts used by Ivanov, Bui and others. They’ve been using texts, Twitter posts and other digital evidence to document the interactions Ivanov had with others in the days leading up to the shootings.\nMuch of the information contained in the affidavits already has appeared in charging papers. There are more details, however, about Ivanov’s discussion with detectives after the shootings and excerpts of text messages to a friend in Kentucky whom he enlisted in an attempt to learn the party’s location and to monitor Bui’s social media.\nThat friend told investigators that in the days leading up to the attack, Ivanov had sent messages about shooting people, but he thought they were “just joking around.”\nIvanov told detectives that he was in touch with Bui in the hours leading up to the shootings. On July 28, he put his rifle in his car and then drove to a quiet spot to sit alone, he said. On July 29, he purchased a second magazine for his rifle. He texted Bui at about 6:30 after he’d finished shopping.\n“He said that Bui and his family had been worried about him because of his behavior the previous night,” Ernst wrote. “He wanted to assure Bui that he was not suicidal or ‘crazy.’ He said, ‘I wanted to assure her that I wasn’t going to do anything.’”\nIvanov said Bui met him in the parking lot of a Walmart a short time later and they talked for about half an hour. She then went to a friend’s house and from there to the party.\nThe defendant described how he later parked near the house party and crept to a place near an outdoor fire pit. He was near enough to hear conversations.\n“Ivanov said what he heard made him angry, and he could see Bui through the window and believed she was flirting with male partygoers,” the search warrant said. “He said this made him angry, so he went down to his car.”\nJake Long was shot first when he came across Ivanov hiding with his rifle. Will Kramer was struck in the shoulder but was able to run, wounded, to safety. Jordan Ebner was shot multiple times and did not survive.\nIvanov allegedly admitted to shooting Bui when he tracked her down inside the home.\n“I knew she knew who I was ‘cause I saw her face right before I pulled the trigger,” he reportedly told detectives."}