{"uri": "http://www.adn.com/article/20150823/1-dead-2-teens-injured-gunfire-reported-around-anchorage", "title": "1 dead, 2 teens injured as gunfire reported around Anchorage", "dct": "Wed, 28 Sep 2016 00:00:00 GMT", "id": "2af879a20c0e7347460daddb6f68f9a5", "content": "Anchorage police have identified the person killed in the Saturday shooting near Lane Street and Fifth Avenue as 19-year-old Byzantium Hill. The investigation is ongoing, police said, and no arrests have been made.\nFour separate instances of gunfire around Anchorage in less than 12 hours Saturday and Sunday left one person dead and two teenagers in critical condition, according to Anchorage police. No suspects were in custody in any of the incidents Sunday afternoon.\nThe first incident occurred shortly after 6 p.m. Saturday in the Spenard neighborhood, where police responded to a home at the 2500 block of Kona Lane and found an 18-year-old man suffering from a gunshot wound to his pelvis.\nHe was taken into surgery Saturday and remained in critical condition Sunday, according to a statement from the Anchorage Police Department.\nThen, around 2 a.m. Sunday, police were called to a report of gunfire in East Anchorage, where they found a man who had been shot at a residence on Lane Street. He was taken to a local hospital and pronounced dead. Police are investigating the incident as a homicide, but were not releasing additional details Sunday.\nOn Sunday afternoon, APD's mobile crime scene investigation unit was parked by a tan home near the corner of Lane Street and Fifth Avenue, a couple of blocks from Russian Jack Springs Park. Crime scene investigators tagged evidence from the top of a vehicle parked in a carport and removed a window pane near the front door. One neighbor said his mother had been awoken by gunshots and had called the police.\nAbout a half-hour after the shooting that left a man dead, police responded to the 3300 block of Boniface Parkway for another report of shots fired.\n\"Shortly thereafter, it was reported to police that an 18-year-old male had been shot while sitting in a parked truck in the driveway of a trailer home,\" police said in the Sunday statement.\nAccording to police, the man had been driving home with friends in his truck and heard a loud \"pop\" shortly after parking in the driveway, and realized he had been shot. No one else in the vehicle was injured, police said.\nAt 3:41 a.m. Sunday, the fourth gunfire-related call of the night drew police to the area of Chena Avenue and Davis Street, not far from the scene of the earlier homicide.\nMultiple people called in reports of gunfire, and some reported hearing yelling around the same time.\n\"Police arrived on scene five minutes after the initial call; no one was located in the area and multiple shell casings were located outside,\" police said.\nNo suspects were in custody Sunday afternoon, and police were asking for the public's help in learning more about the incidents. Anyone with information is asked to call APD at 907-786-8900 and press 0 to speak with dispatch, or submit an anonymous tip to Crime Stoppers at 907-561-STOP or at www.anchoragecrimestoppers.com."}