{"uri": "http://6abc.com/news/girl-5-injured-in-burlington-county-shooting-/1477911/", "title": "Suspect arrested in fatal Burlington County shooting", "dct": "Mon, 22 Aug 2016 00:00:00 GMT", "id": "7dcf6347ddce52402411089bf2cade09", "content": "BURLINGTON CITY, N.J. (WPVI) --\nBurlington County authorities have arrested the suspect in a shooting that killed a man this past weekend.\n26-year-old Samuel James was apprehended at the residence of an acquaintance by members of the Burlington County Sheriff's Department Warrant Unit at approximately 4:15 p.m. Monday.\nJames is charged with the murder of 24-year-old Byron Turner on Saturday in Burlington City.\nBail was set at $1 million. James is being held in the Burlington County Jail.\nBurlington City police officers were called to the 100 block of East Federal Street just before 7 p.m. Saturday and found the victim with a gunshot wound to the head.\nTurner was taken to Cooper University Hospital in Camden where he was pronounced dead.\n\"One of my cousins called me on the phone cause I'm close with the family. I been knowing him since he was a baby. Since she had him. He wasn't a bad kid,\" said Annie Mobley of Burlington City.\nRecords show James was arrested in Cedar Rapids, Iowa, in April of this year, and pleaded guilty after published reports quote local authorities as saying he chased down a man with a shotgun and threatened to kill him. In June, he was sentenced to 20 days in jail.\nNeighbors say a group of kids was playing outside near where the shooting happened and ran inside when they heard gunshots. Parents say now they'll think twice before letting their kids play outside.\n\"Next thing I know I see flashing lights. So I ran down there because I knew my daughter was down there, but they ran into the lady's house. Because they were scared,\" said Louis Hollinshed of Burlington City.\nA 5-year-old girl suffered minor injuries as she ran from the gunfire.\nShe was treated and released from Lourdes Medical Center of Burlington County in Willingboro.\nOn Sunday, the police chief, chaplains and Mayor Barry Conaway returned to the block to talk with residents. Conaway says shootings have increased in the city this year, even as local police have stepped up community outreach.\n\"We want the community to speak to us. We want the community to speak up so when there are things that are going on we want them to tell us so we can be out there,\" said Burlington City Mayor Barry Conaway. \"We want to be pro-active, we don't want to be reactionary.\""}