{"uri": "http://triblive.com/news/westmoreland/11039406-74/manners-shayne-hospital?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+alltribstories+%28TribLIVE+News%29", "title": "Family struggles to cover new medical needs of Saltsburg boy shot by hunter as infant", "dct": "Fri, 26 Aug 2016 11:00:00 GMT", "id": "cf0950564bc4f159be22dda5525f0b56", "content": "Nearly two years after a Saltsburg newborn survived being shot through the eye by a hunter’s stray bullet, the boy is facing a host of new medical crises. Shayne Iverson was airlifted to the hospital on Aug. 21, 2016, where he is battling pneumonia, a collapsed lung and bacterial meningitis. A GoFundMe page has been set up to help the family with mounting medical expenses.\nNearly two years after a Saltsburg newborn survived being shot through the eye by a hunter's stray bullet, the boy is facing a host of new medical crises.\nA GoFundMe page set up two years ago raised just over $20,000 to help cover expenses for the family of Shayne Iverson. But that page now is inactive, the money has been depleted, and family friends are seeking more donations to help cover expenses as the child battles multiple infections in an intensive care unit at Children's Hospital of Pittsburgh of UPMC.\n“It's a pretty big setback,” said Jeremy Manners of Apollo, a friend and former co-worker of the boy's mother, Stefanie Iverson. “He's just so compromised in every sense of the word, but that little boy is a fighter.”\nManners said Shayne became lethargic beginning Saturday and was airlifted to the hospital the following day — the fourth trip he's made there since Sept. 25, 2014, when a bullet from a hunter's rifle shattered the Iversons' living room window and pierced the boy's skull.\nAs a result of sinus fractures stemming from the bullet wound, Manners said, Shayne has contracted bacterial meningitis and also is battling pneumonia and a collapsed lung. The boy had a blood infection when he arrived at the hospital.\n“Luckily, everything was caught relatively quickly, and they were able to get him on antibiotics,” Manners said.\nHe reported the boy is sedated and receiving antibiotics intravenously and is expected to remain in the hospital at least for two more weeks.\n“He's most likely going to have to have surgery to repair the sinuses,” Manners said. “He's got many surgeries ahead of him. It's going to be a long haul.”\nManners and his wife, Jennifer, have established a new GoFundMe page and hope to raise at least another $20,000 to help Shayne's parents meet mounting expenses. In the initial three days the page has been active, eight people have donated a combined $375.\n“People wanted to make donations. That's why we started the new page,” Jeremy Manners said.\nWhile his mother has been staying at Shayne's side in the hospital, Manners said, donations could help cover the cost of other family members' repeated trips of about 40 miles to the hospital. According to Manners, a mileage recalculation means the Iversons no longer meet the minimum distance to stay in Pittsburgh's Ronald McDonald House — as they had during Shayne's previous hospital stays.\nShayne lost both eyes as a result of the bullet wound. Doctors found it also damaged his pituitary gland, Manner said.\n“That's severely affected his growth and metabolism and how he regulates his body temperature,” he said, explaining that the Iversons are hoping to relocate to a home where they can install central air conditioning for their son.\nAccording to Manners, the boy's adrenal glands also have been affected, hampering his immune response: “That's why he has a problem with all these infections. The natural antibodies aren't there.\n“Shayne can't crawl, walk or sit up on his own,” Manners said, noting the boy can suffer up to 50 seizures in a day. “It's a struggle on a day-to-day basis with nurses and therapists.”\n“He remains on a feeding tube and has a night nurse,” Jennifer Manners said. “There's just a bunch of additional expenses the family has to deal with every day.”\nJeremy Manners said Stefanie has not been able to work while caring for Shayne and two older children in the household, while her husband, Jeremie, has worked sporadically as a union carpenter. They have not been able to obtain Social Security disability benefits for Shayne.\n“It's a big struggle for both of them. They keep going, but I don't know how the heck they do it,” Jeremy Manners said.\nJeff Himler is a Tribune-Review staff writer. Reach him at 724-836-6622 or jhimler@tribweb.com."}