{"uri": "http://www.kxii.com/content/news/Murder-Suspect-Found-in-Backyard-Neighbors-Shocked-383045041.html", "title": "Murder suspect found in backyard: Neighbors shocked", "dct": "Tue, 14 Jun 2016 19:00:00 GMT", "id": "96aeb3d7cfed8524a22734072dc20c78", "content": "ARDMORE, Okla. -- The Oklahoma State Bureau of Investigation is investigating the death of a 17-year-old in Seminole County, after arresting the suspect in one family's backyard.\n\"I had no idea that the murder suspect was hiding in their backyard.\" Neighbor Jeanna Thompson said when she found out where the suspect was laying low.\nThompson says her street was packed with police cars all night while officers searched for 19-year-old Curtlon Panoske.\n\"We saw all of the police and everything. They had flashlights and were in the backyard behind me.\" Thompson said.\nOSBI agent Jessica Brown says Panoske shot and killed 17-year-old Seth Johnson at a home in Seminole county. Brown says a witness was able to identify Panoske as the suspect.\n\"We believe they knew each other and I don't know what started this homicide, but it is something that we are going to try to find out as we gather information.\" Brown said.\nOSBI says Panoske took off in Johnson's car and headed to Ardmore. Ardmore police tried to stop him at the Willowbrook Apartments near Monroe St. in Ardmore, where officials believe he stayed a couple hours with someone he knows.\n\"Ardmore police actually spotted the vehicle, and tried to engage in a traffic stop.\" Brown said. \"Panoske actually pulled over, jumped out of the vehicle and ran from the area.\"\nHe was found a few hours later hiding in one resident's backyard.\n\"My mother saw them arrest that guy and put him in the vehicle.\" Thompson said.\nThompson says she thinks Panoske ran through her backyard to escape police.\n\"I have six dogs and they were barking and the neighbor behind us, he was barking, and they were having a commotion.\" Thompson said.\nThompson says just knowing a murder suspect was in her neighborhood is terrifying.\n\"[I was] scared. I mean, I have two kids.\" Thompson said."}