{"uri": "http://www.nbclosangeles.com/news/local/Teenage-Girl-Fatally-Shot-in-Lynwood-402841106.html", "title": "16-Year-Old Girl Killed in Lynwood Car-to-Car Shooting", "dct": "Thu, 24 Nov 2016 11:46:00 GMT", "id": "3cc80ca0defe46ba8608cf5e2445dd21", "content": "A 16-year-old girl was shot and killed when she was caught in a car-to-car crossfire as she returned home from church with her family Wednesday night in Lynwood.\nThe girl, her mother and brother were driving back home when the shooting occurred at around 9:27 p.m. at the 12600 block of Long Beach Boulevard, according to Los Angeles County Sheriff’s Homicide detectives.\nThe girl was riding in the back seat of a gray Mustang when she was shot in her upper torso. \"Although life saving measures were performed,\" the girl died from her injuries at the scene, detectives said in a statement.\nThe girl was identified as Danah Rojo-Rivas of Hawthorne on Thursday morning, according to the Los Angeles County Coroner's Office.\nDetectives said Rojo-Rivas was riding in the back seat of her family's car with a dog on her lap as her mother drove eastbound on Euclid Avenue. Her 18-year-old brother was sitting in the passenger seat.\nSimultaneously, a \"possible car-to-car shooting or chase was approaching from behind, unbeknownst to them,\" homicide detectives said in a statement Thursday.\nWhen a car that was the intended target of the shooting became stuck at a stoplight, a man got out of another car and started shooting toward the car he was targeting.\nOne of those shots struck Rojo-Rivas's family car near the rear license plate and struck her from behind.\nThe shooter's car then made a U-turn and drove away headed westward on Euclid Avenue, authorities said.\nThe two men inside a red Saturn SUV, which detectives say was the intended target of the shooting, were not injured. Both men ran away after the shooting, leaving the car behind.\nRojo-Rivas's mother pulled over after her daughter was shot, detectives said in a statement. Although her mother and brother were not hurt, the dog sitting on Rojo-Rivas's lap ran into the street when she was shot and was fatally struck by a car.\nA vigil of flowers and candles grew Thursday night on Euclid Avenue, where family and friends gathered to mourn.\nNeighbors said the shooting was so close to the church, fellow worshippers ran out to help the family when they heard the gunshots.\n\"I saw the life go out of her eyes,\" Ethan Rojo said. \"I just stood there, I couldn't do anything.\"\nAlthough there was no description of the shooter or his car, detectives noted there may be more than one suspect involved.\nThe gun had not been recovered Thursday, and the investigation of the shooting was ongoing.\nAnyone with information about the shooting was encouraged to call the Los Angeles County Sheriff's Homicide Bureau at 323-890-5500.\nThe family set up a GoFundMe to help with funeral costs that can be found here."}