{"uri": "http://www.kansascity.com/news/local/article316555/Lethal-invasion-happened-at-home-of-college-students-KC-police-say.html", "title": "Lethal invasion happened at home of college students, KC police say", "dct": "Fri, 22 Mar 2013 11:22:00 GMT", "id": "6c6f6d5976231f512508859d8a81a3ff", "content": "Aaron Markarian was an aspiring opera singer who built elaborate snow forts, joined impromptu concerts in the park and knew his pizza delivery guy on a first-name basis.\nOn Thursday night, the 23-year-old college student became Kansas City’s latest homicide victim, killed in a shocking home invasion robbery near the Country Club Plaza. Three other people were wounded by gunfire.\nTwo women were among the victims. One was shot in both legs. The third victim, a man, remained in critical condition Friday after undergoing surgery.\nPolice are investigating whether one of Markarian’s roommates may have known the two men who barged into the home about 11:20 p.m. in the 4900 block of Brookside Boulevard. The intruders stole cellphones and valuables from the eight people inside the home, then started shooting.\nMarkarian, who attended the University of Missouri-Kansas City, and his roommates had invited several people over for a party Thursday night, police said. Spring break for UMKC started Friday, and many of the people at the home were college students.\nUMKC officials issued a statement Friday that said Markarian was “a bright and talented young man who was studying at our Conservatory of Music and Dance We are distressed by all acts of violence that affect our Kansas City community, and by any act of violence that affects our students.”\nFriends said Markarian possessed a wide vocal range. He often sang baritone, but could also sing tenor. A reviewer in recent years called one of Markarian’s performances “superb,” adding that he possessed a magnificent, full voice and commanding stage presence. Markarian also won a scholarship last year from the Kansas City Musical Club after competing in an audition.\nMarkarian sang in many stage plays, including a performance of “A Midsummer Night’s Dream” at the Conservatory on Sunday. Besides singing on stage, Markarian also sang to himself while he walked down the street, said Kyle Little, a fellow student, who met Markarian last year while performing together.\n“Anytime I saw him, he would be singing old English folksongs in a high pleasant tone,” Little said.\nMarkarian was unique, friends said. He liked old school romantic music and would give presents to his pizza delivery guy. Markarian also was hilarious, friends say.\nWhen friends played music, Markarian would sing along with lyrics that he made up on the spot, often employing accents to pump up the humor.\nAfter the recent snowstorms, Little saw Markarian engaged in a pretend sword fight in his front yard, near a gigantic snow fort that Markarian and his roommates had created. The fort encompassed the entire front yard with castle walls. Inside the fort, they used snow to create a dragon’s head that served as a cooler to hold beverages.\nMarkarian later came by Little’s home to check out the snow fort Little had built with friends.\n“He just had to stop and say how much better his fort was,” Little said. “It was pretty cool.”\nMarkarian went all out for Halloween as well. Last year, he dressed as a French painter, wearing a curly mustache and beret and carrying a pallette with paint on it.\n“He offered to paint people’s faces,” Little said.\nBy the end of the night, Markarian’s face bore a blue handprint. Blue handprints are still visible on Little’s basement wall.\nMarkarian, who was from Warrensburg, Mo., appeared on the front page of The Star last week in a photo that captured an impromptu jam session at Loose Park on an unusually warm day.\nAndrew Long, a student at Johnson County Community College, said he climbed a tree and started playing his alto saxophone. Little joined him with a mandolin and Markarian spotted his friends.\n“Hey,” he called out. “I’ve got a drum!”\nHe fetched the drum, climbed onto a branch and joined them in a performance that drew other park-goers.\nOn Friday, handprints appeared to cover the glass in the front door of Markarian’s home. A red mountain bike sat on the porch.\nMatt Noonan and his wife, who live next door, were asleep when their doorbell rang about 11:30 p.m. They figured it was somebody drunk staggering home from the Plaza.\nBut it was one of men who lived in the house where the shooting occurred. He asked to use a phone because the intruders had taken cellphones from the victims.\nThe man did not appear to be hurt, said Noonan, who watched police arrive and the victims taken away.\n“To have it so close makes it seem so real,” Noonan said. “You want your home to be safe for your family.”\nHe described residents of the small white house as typical college students. He was never sure of who actually lived there because there often were visitors.\n“They were always nice and respectful,” Noonan said. “They asked to borrow my snow shovel and when I got back home, they had shoveled my drive.”"}