{"uri": "http://www.ajc.com/news/news/crime-law/arrest-made-in-homicide-following-fayette-pool-par/nmgzk/", "title": "UPDATED: Arrest made in homicide following Fayette pool party", "dct": "Fri, 19 Jun 2015 00:00:00 GMT", "id": "a7cbb5ce503458a0aa50b1f7b1be5081", "content": "An 18-year-old convicted felon has been charged with murder for the fatal shooting of a teen at a Fayette County pool party over the weekend.\nTerrence Kyreef Montgomery Jr., 18, of Atlanta was arrested in the city Friday on a warrant executed by the the U.S. Marshalls Southeast Regional Task Force, according to the Fayette County Sheriff’s Office. Montgomery, who was arrested without incident, has been charged with felony murder and malice murder, four counts of aggravated assault and possession of a firearm by a convicted felon in connection with the death of Wali Clanton Jr., 19, of Stockbriddge.\nClanton was one of five people wounded after an argument broke out near midnight Saturday at the end of a pool party that attracted more than 400 people, many drawn by social media announcements. The party was at a home in the 600 block of Highway 279 in north Fayette County. The other four received non-life threatening injuries.\n“We’re confident we have the person who shot Wali Clanton,” Allen Stevens, executive assistant to Fayette Sheriff Barry Babb, said Friday.”Our investigators have been working around the clock since the shooting. Our investigation pointed to the person who was arrested. We wanted to bring some closure especially to the family who lost their son.”\nWhen asked if more arrests were imminent, Stevens said “I don’t know if there’ll be any others but the sheriff did state the investigation is continuing.”\nStevens said he did not know the details of Montgomery’s prior felony charges.\nClanton’s family learned of the arrest shortly before 4 p.m. Friday. One relative said it’s not likely Clanton and Montgomery knew each other.\n“It’s mixed emotions,” said Clanton’s aunt Anita Robinson who lives in Lawrenceville. “Even though my heart feels less heavy, this (arrest) feels like a gut punch. I don’t find comfort in someone else’s loss. The process of justice is started. I don’t rejoice in that. I know for us as a people, two of our boys are now gone. We’ll leave it in God’s hands.”"}