{"uri": "http://www.wxyz.com/news/region/wayne-county/one-person-killed-in-shooting-at-taylor-sportsplex", "title": "7-year-old girl has died after Taylor Sportsplex shooting", "dct": "Fri, 04 Dec 2015 17:14:00 GMT", "id": "fc1207afae3d92aed1c48aa360dfabd4", "content": "Autoplay:7-year-old girl has died after Taylor Sportsplex shootingCONNECTING...X7-year-old girl dies after Taylor Sportsplex shooting\nTAYLOR, Mich. (WXYZ) - Taylor police say Thursday night's shooter at the Taylor Sportsplex was a family friend who had taken a liking to Emma Watson Nowling, a bright-eyed 7-year-old. But they're now trying to solve the mystery why 57-year-old Timothy Nelson Obeshaw targeted her and her mother before shooting and killing himself.\nPolice say Obeshaw was seen earlier that evening hugging Emma during soccer practice. Shortly after 8 p.m. Obeshaw approached Emma and Sharon Elizabeth Watson as the two were leaving, and he shot into their vehicle.\n\"He struck the child first and then opened fire on the mother, and then turned and shot and killed himself,\" Taylor Police Chief Mary Sclabassi said.\nPolice found a 9mm gun legally registered to Obeshaw next to his body. Obeshaw was also a CPL holder.\nEmma and her mother were rushed to the hospital. Emma died late Thursday night at Children's Hospital. Watson remains in serious but stable condition at a local hospital.\nOutside the Taylor police station Friday, Emma's soccer coach, Mario Scicluna, struggled to process the news.\n\"Nothing makes sense of why someone would take an innocent life like that,\" he said.\nTaylor police say Obeshaw lived with Emma, Watson, and Emma's father for the past year or so in Belleville. He had recently moved to a home in Taylor, where police say he lived with at least one other person.\nWitnesses and family members told police Obeshaw had displayed signs of mental instability lately, and that he believed someone was out to get him.\n\"We found evidence that Obeshaw believed that someone was trying to control him through mind control,\" Sclabassi said. \"Obviously if the persons close to this individual had perhaps taken the steps to make sure he got the help that he needed, he may not have been in the position to obtain the firearm that he had yesterday,\" she added.\nSclabassi said there are no official records or diagnosis that showed Obeshaw sought treatment.\nIn September 2015, Obeshaw legally registered the handgun in his name in Belleville.\nPolice are still working to determine a motive in the shootings.\nArrangements are being made for donations for the family of Emma Nowling.\nCopyright 2015 Scripps Media, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.\nPrint this article Back to Top"}