{"uri": "http://www.idahostatejournal.com/members/online-fundraiser-aims-to-help-man-accidentally-shot-by-toddler/article_9ba6c2f3-b1b7-5a82-9063-17a38f5f2d93.html", "title": "Online fundraiser aims to help man accidentally shot by toddler", "dct": "Mon, 04 Apr 2016 00:00:00 GMT", "id": "a4af6bc2723cf733f7a1742067fc3557", "content": "An online effort has been started to help 25-year-old Travis Sorensen, of Idaho Falls, with medical costs he faces after being accidentally shot in the foot by a 3-year-old in Rigby on March 26.\nAccording to the fundraising page at gofundme.com/gxwvt958, Sorensen will be out of work for at least six weeks and faces recovery from surgery and physical therapy costs.\nSorensen was taken by ambulance to the Eastern Idaho Regional Medical Center in Idaho Falls on March 26 after his foot was struck by a ricocheting bullet fired from a .40-caliber pistol picked up a toddler in a home where Sorensen was helping family members move.\nA new release from the Rigby Police Department said the pistol had been found between mattresses while a bed was being broken down. The gun was placed on the floor, where the boy later found it.\nOn the gofundme website, it states the gun was placed on the floor by non-family members helping with the move before the youngster found it, picked it up and pulled the trigger.\nTwo bones in Sorensen’s foot were fractured and his pinky toe was shattered. He will need surgery to fix the shattered toe, according to family members. The doctors will be using bone from his hip to replace the bone in his foot.\nDonations will help with the medical costs and the monthly expenses for Sorensen’s family until he recovers.\n“Our family has been so grateful and humbled by this experience,” the family posted on the gofundme site. “Words can’t even describe the love, help, and concern that has already been given by so many. We are very thankful for any help in this time of need.”\nAccording to statistics published in the Washington Post, shootings involving toddlers were relatively frequent in the U.S. last year. In 2015 there were at least 13 toddlers (ages 3 or younger) who accidentally killed themselves with a firearm, 18 who injured themselves, 10 who injured other people; and two who killed someone else."}