{"uri": "http://www.ksla.com/story/21535475/police-arrest-second-suspect-in-deadly-cedar-grove-shooting", "title": "Police arrest second suspect in deadly Cedar Grove shooting", "dct": "Wed, 20 Mar 2013 17:58:00 GMT", "id": "24f1a0800252983f96e4e81c2cd7b665", "content": "SHREVEPORT, LA (KSLA) -\nShreveport Police arrested the second of two people they believe is connected with the shooting death of a Shreveport teen and the wounding of three others last week.\nRavion Alford, 17, was taken into custody Tuesday evening after a family member brought him to the police station. Police say that Alford, who was wanted on an outstanding warrant as a principal to second-degree murder, surrendered without incident.\nEarlier Tuesday, police arrested a 15-year-old boy and charged him with second-degree murder along with six additional counts of attempted second-degree murder. The juvenile was booked into the Caddo Parish Juvenile Detention Center.\nThe arrests follow the shooting death of 18-year-old Chauncey 'Trey' Broadway, Jr., who was one of four people struck by bullets while visiting at a home in the 7000 block of Burlingame Blvd. early on the morning of March 2. Police say those bullets came from outside the home.\nIn a call to KSLA, Alford's mother, who wished not to be identified, says her son and Trey were in opposing sets of teenage boys who constantly \"had beef\" with each other.\nShe insists that her son, Ravion, is innocent. The mother, who did not want to be identified, says her son has an alibi.\nShe explained that she turned Ravion in believing that police needed to hear his side of the story. She says she did not expect authorities to arrest him.\nAlford also is charged with six counts of attempted second-degree murder. After his interviews with investigators, Alford was booked into the Shreveport City Jail. His bond was set at $500,000.\nRavion's mother says she plans to hire an attorney and fight the charges.\nInvestigators are urging anyone with information about this case to contact Crimestoppers at (318) 673-7373 or on their website at www.lockemup.org\nCopyright 2013 KSLA. All rights reserved."}