{"uri": "http://www.tampabay.com/news/publicsafety/crime/tampa-police-investigating-shooting-near-ybor-city/2282472", "title": "Father of arrested 18-year-old: Cellphone led to death of Tampa teen", "dct": "Tue, 21 Jun 2016 18:56:00 GMT", "id": "0310f674690cfd24217e25e6fe70a98b", "content": "TAMPA — Ronnie Thornton was angry Monday because friends had accused him of stealing one of their cellphones. His father tried to calm things down by kicking the friends out and sending his 18-year-old son to his great-grandmother's house.\n\"I told him, 'Go to your grandma's house,' \" the father said. \"Cool down.\"\nBut something went very wrong on the way there, Tampa police said. Now Ronnie Thornton is sitting in the Hillsborough County jail, facing a charge of second-degree murder.\nRonnie Thornton left his father's house around 4 p.m. Two hours later, police said he and his friends met up again. This time, Ronnie Thornton opened fire on the car full of teens near 3615 Potter St. in the College Hill area, according to Tampa police.\nThe 18-year-old fired several gunshots, police said, fatally wounding Corey Gordon, 17, and striking Christopher Vilbreana, 14.\nBoth victims were taken to Tampa General Hospital. Gordon was pronounced dead Monday evening. Vilbreana, who was shot in the foot, was reported to be in stable condition on Tuesday.\nThe father, also named Ronnie Thornton, said the teens in the maroon Volkswagen Passat were close friends with his son.\nThe father said that he had hoped to head off a confrontation by separating his son and his friends.\n\"(My son) was mad and upset,\" the father said, \"and they wanted to fight.\"\nGordon, Vilbreana and the 18-year-old arrested in the shooting all lived within a mile of each other. The shooting took place a five-minute walk from the great-grandmother's home, where police arrested the 18-year-old around 11 p.m. Monday.\n\"I'm shocked,\" the arrested teen's father, Ronnie Thornton, 48, said Tuesday. \"I just hate to see it go down like that.\"\nThe shooting, the father said, \"was over some stupid s---.\"\nThe families of Gordon and Vilbreana could not be reached for comment Tuesday.\nThe great-grandmother, Hazel Thornton, 89, said she tried to help raise 18-year-old Ronnie Thornton despite a difficult childhood. She said he was often bullied and beaten up in the east Tampa neighborhood where he grew up.\n\"The kids bothered him because he was small,\" she said.\nThe great-grandmother said the younger Ronnie Thornton was also taking medication for mental illness and first started hearing voices in his head at the age of 12. She also said she had to deal with her great-grandson's angry outbursts. He would scream and throw objects in her house, such as the time he shattered her porch window. He was also arrested on a charge of burglary in 2014.\n\"He threw a chair at the window,\" she said, adding: \"He's a loving child when he doesn't get upset.\"\nThe younger Ronnie Thornton also faces charges of aggravated battery causing great bodily harm, being a juvenile felon in possession of a firearm and shooting into an occupied vehicle.\nHe was being held Tuesday without bail in a Hillsborough County jail.\nContact Ariana Figueroa at afigueroa@tampabay.com or (813) 226 - 3350."}