{"uri": "http://www.wrcbtv.com/story/29297883/cpd-responding-to-reports-of-shooting-involving-a-4-year-old", "title": "UPDATE: More children become victims of gang violence in Chattanooga", "dct": "Thu, 11 Jun 2015 17:33:00 GMT", "id": "290a5c8609194a6f086ae712b87f3f80", "content": "CHATTANOOGA, TN (WRCB) - UPDATE: Two 4-year-old girls were injured Thursday in an apparent drive-by shooting. Their injuries are said to be non-life threatening.\nBut that is not diminishing the seriousness of the events. It happened at a home on Youngstown Road in Chattanooga .\nInvestigators are still trying to piece together exactly what happened, but now say they're looking into whether the children were caught in crossfire between gangs.\nWhen Channel 3 visited the home Friday we could see several bullet holes in one of the front windows of the duplex where those two girls were playing.\nPolice say they're investigating if this was a shootout. They're following up on what they call \"very credible leads\", but aren't releasing any names or a vehicle description for the suspects yet.\nI've been a police officer for three decades, and I cannot imagine what kind of sociopath it takes to endanger two 4-year-olds,\" said Chattanooga Police Chief Fred Fletcher.\nStrong words from Chattanooga's Police Chief after two young girls were caught in the middle of gang violence Thursday.\nHe says all resources are being focused on finding the suspects. Both girls were released from the hospital. A bullet grazed one of their temples and shrapnel hit the other child in the back of her neck.\n\"Regardless whether they were hit by bullet debris, or debris from something that was struck, the consequence is the same. Two four-year-olds were harmed and seriously endangered because of the brazen and heinous acts of two violent criminals,\" said Fletcher.\nRight now investigators are trying to figure out. If the shooting was between rival gangs or within the same one which is often the case with the city's gang violence.\nFletcher says this drive-by shooting could be related to other drive-by's reported in the city earlier this week.\nGregory Gillespie and Thomas Simmons were arrested on Wednesday after a police chase ended near Roanoke Avenue.\nThey were driving the suspect vehicle called in for drive-by shootings in the area.\nBack here on Youngstown Road, neighbors say they're afraid.\nA woman didn't want her face on camera out of fear. She says she's moving as soon as her lease is up.\nFrightened after Thursday's shooting in the middle of the day.\n\"Only thing you see is violence and crack. All day, all night,\" said Frightened Neighbor.\nAccording to police records, shots were fired on the same block a month and a half ago.\n\"Nobody should grow up afraid that a bullet could penetrate their house or catch them in their yard. That's absolutely unacceptable,\" said Fletcher.\nPolice have responded to that block of Youngstown Road 17 times since January.\nThose calls range from shots fired calls to burglary calls and again police ask Channel 3 to share with you if you have any information in the shooting incident these two little girls were involved in to give them a call.\nTwo 4-year-olds are recovering after they became victims in a drive-by shooting Thursday afternoon.\nIt happened outside a duplex along Youngstown Road. It's the second shooting in 12 hours, happening just three miles away from each other. Police say both are gang related, they are working to see if they are connected.\nBullet holes riddle the glass windows of one side of a duplex along Youngstown Road.\nPolice believe someone inside was the intended target of Thursday's drive-by shooting but instead, shrapnel hit two 4-year-olds playing outside.\nThe act is something Chattanooga Police Chief Fred Fletcher takes personally.\n“This could have been horrifically tragic. Someone fired rounds near two small children and put their lives in danger and that is completely unacceptable,” Fletcher said.\nFletcher believes the shooting is gang related and says investigators have received reports of other acts of violence that had gone unreported in the past.\nNeighbors in the area, like Leelee Pressley, describe it as your average quiet and family friendly community. But Pressley believes this shooting shows anyone can become a victim of gang violence.\n“When you're out for someone, you don't have any respect. You do what you want to do and that's just how it is,” she said.\nThis is the second time in just six months a child has been a victim of gang violence in Chattanooga.\nOne-year-old Zoey Duncan was shot in the back during a home invasion in January. One other person died and two others were injured in the shooting. Police arrested the shooter two days later.\nWhile both 4-year-olds in this shooting are expected to be okay, Fletcher says he wants those responsible to be off the street.\n“We are bringing every possible resource we have. We've called in people and investigators to find this offenders who would jeopardize anybody but especially four-year olds in our community,” Fletcher said.\nChattanooga Police tell Channel 3 two 4-year-old girls were not shot Thursday afternoon near Youngstown Road. After further investigation police have determined the two girls were not directly hit by bullets, instead they were injured by bullet shrapnel.\nWitnesses tell Channel 3, they saw a car in the area at time of shooting and police tell Channel 3, shots were fired from a vehicle. Police tell Channel 3 they believe the shooting is gang related. Chattanooga Police Chief Fred Fletcher spoke with the media, he calls this unacceptable.\n“Any injury to a community member any injury to a child is serious to me. It's offensive and the fact that somebody would target a house with 2 four-year-olds in front of the house is horrifying and offensive,” said Fred Fletcher, Chief, Chattanooga Police Department.\nChannel 3 spoke with a pastor; he's the minister of a church just down the street from where the shooting happened. He says he's rallying the church together for prayer.\n“Especially with children being involved, it's always a tragic thing whenever that happens. It impacts so many people in so many different ways,” said Joey Harris, Pastor, Harmony Baptist Church.\nBoth of the girls were taken to the hospital with non-life threatening injuries and are expect to be okay.\nPREVIOUS STORY: Chattanooga Police are responding to reports of a 4-year-old shot near Youngstown Road .Channel 3 has a crew en route to the scene.\nStay with Channel 3 for more information on this developing story."}