{"uri": "http://www.dispatch.com/content/stories/local/2015/12/13/1-week-6-shot-2-die.html", "title": "Gun violence in Columbus: 1 week, 6 shot, 2 die", "dct": "NODATE", "id": "4aa7d508997b980b1876e83896febc76", "content": "Just before 6 p.m. on Dec. 2 - about the same time that a husband and wife were locked in a gunbattle with California police after one of the nation's worst mass shootings - a stranger armed with a handgun barged into Mark Kilgo's South Side mobile home and demanded his wallet. The 59-year-old, who has cerebral palsy, was struck repeatedly with the butt of the gun and kicked until he surrendered his wallet.\nJust before 6 p.m. on Dec. 2 - about the same time that a husband and wife were locked in a gunbattle with California police after one of the nation's worst mass shootings - a stranger armed with a handgun barged into Mark Kilgo's South Side mobile home and demanded his wallet.\nThe intruder grabbed him by the sweater and yanked him out of his armchair.\n\"He threw me on the carpet here and put the barrel of the gun to the base of my neck,\" Kilgo said.\nThe 59-year-old, who has cerebral palsy, was struck repeatedly with the butt of the gun and kicked until he surrendered his wallet. The man tied him up with twine and ran out of his home.\nKilgo quickly wriggled free, but not in time to see where the robber went.\nWord of Kilgo's brief, violent ordeal didn't spread much further than his sister and mother, his immediate neighbors and Columbus police. But his experience was far more typical in terms of day-to-day, gun-related violence in Ohio's capital city than the horrific mass shootings that have captured the nation's attention.\nShow more...\nIn an effort to gauge a typical week's worth of gun violence in Columbus, The Dispatch reviewed crimes involving guns on the six days bracketed by the shooting at a Planned Parenthood office in Colorado Springs, Colo., on Nov. 27, and the San Bernardino shooting that claimed 14 lives on Dec. 2.\nThe analysis looked for any significant incidents in which guns were reported to be directly involved or seen by witnesses. These included homicides, aggravated assaults, armed robberies and certain menacing calls. The information was collected through a review of incident reports, as well as public-records requests on all reported shootings and \"man with a gun\" runs during the time period.\nIncidents in which gun use was only suspected or threatened - such as reports of shots fired with no one seen or menacing reports in which a suspect threatened to use a gun without showing it - were not included.\nTwelve shootings were reported in the six-day stretch. Two people died, and there were wounded victims - including a 3-year-old - in four other shootings. Among the victims:\n- Lester Thomas, 35, was shot to death on Nov. 28 in the driveway of a home on Blue Spruce Place on the North Side.\nNo arrests have been made in the case. Thomas, originally from Elyria, spent 10 years in prison for aggravated robbery and felonious assault involving a gun, according to Lorain County court records.\n- Hector Flores, 27, was shot to death on Dec. 2 by Dennis Juris, 22, who later hanged himself. Columbus police said Juris killed Flores because the victim was seeing Juris' ex-girlfriend. The woman witnessed the homicide but was uninjured.\nThe four nonfatal shootings included the wounding of a toddler on Dec. 2 at an apartment on the West Side. A man told police that he had been baby-sitting the girl \"when she retrieved the handgun from his rear pants pocket and accidentally shot herself in the right leg,\" according to a search warrant filed in the case.\nColumbus police also received 64 \"person with a gun\" reports. The most notable: the Nov. 29 shooting at the Wexner Center for the Arts in which a former security guard briefly took another guard hostage and vandalized an undisclosed amount of artwork before killing himself in the galleries.\nOther \"gun runs\" included a despondent man who threatened to kill any police who showed up, and then apologized and said he would never harm officers; a man who abducted a woman at gunpoint during a domestic dispute and threatened to kill her family members; and a report that an employee of an East Side business had brought a gun to work despite a policy prohibiting them.\nFourteen armed robberies involving guns were reported.\nColumbus historically sees between 2,000 and 3,000 robberies a year, ranging from armed robberies to unarmed purse snatchings. As of Nov. 30, there had been 2,386 robberies, and the city is on pace to come in under 2014's total of 2,723, said Sgt. Shaun Laird of the robbery squad.\nOf the armed robberies, \"We very rarely have one where it's a lawful gun owner,\" Laird said. \"In my business, you're dealing with people who are going out to commit a felony crime. They're not dissuaded by the fact that the handgun they have might be illegal.\"\nAn armed robbery at Game On, a video-game store on S. High Street, was a first for owner Brian Wingfield. His stores have been burglarized before, and one summer day he ran right out of his flip-flops while chasing a young thief who had snatched a new Xbox One.\nNothing approached what happened just before closing on Dec. 1, when a man wearing gloves and with his face almost entirely concealed threw open the door and trained a handgun on Wingfield's solitary employee. A second employee had just left, and Wingfield wonders whether the robber had been watching the store.\nHis employee complied, handing over the whole cash drawer of one register and fumbling with the second out of fear before getting it open.\nThen the robber was gone.\n\"It was very quick,\" Wingfield said.\nAs aggressive as the robber looked in the store's recorded security video, \"he apologized several times to the employee,\" Wingfield said.\nWingfield, who grew up on a farm around hunters and guns, faults the criminal, not the gun.\n\"No law-abiding citizen has ever committed a crime with a gun,\" he said, then cracked a smile and added, \"You like my circular reasoning?\"\nHe said the robbery, which according to a police report netted $1,000, was frustrating.\n\"It's a small business, and it's a lot of cash,\" he said.\nOf the 86 homicide victims reported in Columbus through Dec. 11, 71 of them, or 82 percent, were shot. Guns were used in 86 percent of the city's homicides in 2014 and 77 percent in 2013.\n\"The amount of violent crimes remains pretty steady,\" said Columbus Police Cmdr. Kelly Weiner, who oversees the Crimes Against Persons bureau that includes the homicide, assault, gun crimes and robbery sections.\n\"I don't see a great increase of anything,\" agreed Sgt. Loucious Hollis of the second-shift assault squad.\nDavid Bucy, a detective with the division's gun unit, said the unit took in 28 firearms from Nov. 27 through the morning of Dec. 3. Four of those guns were found, two were voluntarily surrendered for safekeeping by police, six were seized in search warrants, and 16 were seized in misdemeanor and felony investigations.\nThe division took in 2,039 firearms through Nov. 30 this year. It took in 2,452 in all of last year and 2,436 in 2013.\nNot all of those guns are linked to crimes, but \"felonies are our top number, usually,\" Bucy said.\nAs police take guns off the streets, others take their place. During the six days from Nov. 27 to Dec. 2, at least 16 guns were reported stolen from Columbus homes, according to police reports."}