{"uri": "http://www.cleveland19.com/story/31135205/man-who-admits-to-killing-roommate-might-only-face-five-years-behind-bars", "title": "Man who admits to killing roommate might only face five years behind bars", "dct": "Fri, 05 Feb 2016 02:28:00 GMT", "id": "9ce8853295e3dc231c1bbcb5b536ea21", "content": "BROOKLYN, OH (WOIO) -\nBrooklyn police say 21-year-old Michael Lancaster bonded out of the city jail Thursday afternoon. Lancaster was charged with Reckless Homicide after he told police he accidentally shot his roommate, 18-year-old Olivia Stull in the chest.\nLancaster called Brooklyn police Wednesday and told them he shot the 18-year-old Parma woman in the chest.\nLancaster dialed 9-1-1 moments after shooting Stull.\n\"I have a gun, and I didn't know that it was loaded and I shot it, and it was pointed at my friend. Please, I need your help so bad,\" Lancaster told the operator.\nLancaster told the 9-1-1 operator that Stull was still breathing. She was later pronounced dead at MetroHealth Medical Center.\n\"Please, please come quick. Please come quick. I feel hopeless,\" he said as he pleaded with the 9-1-1 operator for help.\nLancaster appeared in Parma Municipal Court not even 24 hours later, pleading not guilty to Reckless Homicide. His attorney told the judge he was on suicide watch.\n\"This is a very unfortunate situation. It's terrible what happened. There was no fight going on. There was no illegal activity. It's my understanding they were about to paint a room together. They are a close couple, and the picture they were going to paint. He has some weapons. He usually unloads them, disengages them, and he puts them away. With guns, they are very dangerous and things like this can happen,\" said Lancaster's Attorney, Stephen McGowan.\nNeighbor Robert Siddall said Lancaster had just moved in a few weeks ago. Siddall never saw a woman at the apartment.\nSiddall says his wife heard more than one gunshot.\n\"At first, she didn't even know it was a gunshot. She thought they dropped furniture. Until the police came, they rushed the building, we didn't know what was going on,\" described Siddall.\nSiddall says emergency crews took Stull outside the apartment where they tried to save her life.\n\"They laid her on a stretcher and started doing CPR. They had him, there's a \"for rent\" sign, I guess they had him on his knees. He could see what was going on, and I guess he kept screaming, 'I'm sorry I shot her. I shot her I shot her. I didn't mean to,'\"\nsaid Siddall.\nLancaster's bond was set at $25,000. If convicted, he faces up to five years in jail.\nA GoFundMe account has been started for Stull's family to help with funeral expenses. Click HERE for more.\nDownload the Cleveland 19 News app.\nCopyright 2016 WOIO. All rights reserved."}