{"uri": "http://www.wave3.com/story/34160255/toddler-shot-on-new-years-eve-night", "title": "Toddler hit by stray bullet on New Years Eve identified by family", "dct": "Sun, 01 Jan 2017 03:51:00 GMT", "id": "840aa6497dbcb33a11489bd2836a1204", "content": "LOUISVILLE, KY (WAVE) - The parents of a toddler who was shot on New Year's Eve in the Portland neighborhood are asking for tips about who may have been responsible for their son's injuries.\nPolice were called to the 2300 block of Griffiths Avenue at 10:42 p.m. on Saturday, where they found a two-year-old who had been hit by a projectile.\nMORE FROM WAVE3.COM\n+ Crews battle large fire in California neighborhood\n+ Crews responding to fire in Okolona\n+ 2 shot in Louisville; police investigating possible scene\nThe boy's father, Dustin Compton, posted a picture of his son, Cameron Eli Compton, on Facebook and described what happened.\n\"I want everyone to know that this is what happens when dumb people decide to shoot their guns off on new year's. This is Cameron Eli Compton he is my and Jaime Stclair 2 yr old son. He was shot tonight around 10:30pm on 22nd and Griffiths. I was leaving a service call to fix the heat and when his mom was putting him in his car seat when a bullet hit him in his shoulder. Thank God it's not fatal. Pray for my son and pray even harder for the idiot that done this. I hope if someone knows anything they will do the right thing. Happy New Year everybody from me Jaime and Eli,\" the post read.\nA spokesperson for LMPD released the following statement on Sunday:\nFiring a gun into the air is not only dangerous but illegal since what goes up must come down. According to the Centers for Disease Control (CDC), the majority of injuries related to guns fired in the air are to the feet, shoulders and head, which can result in death. The LMPD is thankful that no one was seriously injured in last night's celebrations and we encourage the community to refrain from or report gunfire as well as any other illegal activities.\nWAVE 3 News spoke to Cameron Compton's mother, Jaime St Clair, but she did not want to release any further information about the incident or Cameron's condition.\nAnyone with information about the shooting on Griffiths Avenue should call police at 574-LMPD (5673).\nCopyright 2016 WAVE 3 News. All rights reserved."}