{"uri": "http://www.wdrb.com/story/33076333/police-3-year-old-boy-accidentally-shot-himself-with-dads-gun", "title": "3-year-old boy accidentally kills himself after playing with dad's gun", "dct": "Mon, 12 Sep 2016 21:46:00 GMT", "id": "f935f99fcb340c372ca543a5a59e17d4", "content": "LOUISVILLE, Ky. (WDRB) - A 3-year-old boy is dead after police say he accidentally shot himself while playing with a gun.\nLMPD officers were called to an apartment complex on Brashear Drive at around 10:45 p.m. Sunday. Officials say Anthony Blake Wells was rushed to Kosair Children's Hospital but later died after suffering a gunshot wound to the head.\n\"People are feeling it. Everybody's talking about it,\" said Stephanie Brown, who lives a few doors down from where it happened. \"He's a sweet little boy. He was a good little boy.\"\nPolice say the child's father had a gun in the house and that he had tried to hide it.\n\"Everybody was asleep in the apartment. The 3-year-old got up, out of bed, found the weapon, was playing with it and accidentally shot and killed himself,\" said LMPD Homicide Unit Lt. Todd Kessinger.\nLMPD officers have responded to similar shootings recently. One happened in the same Algonquin neighborhood apartment complex. Last month, police say a 4-year-old girl shot herself with a stolen gun but survived.\nA few weeks later, investigators say an 11-year-old boy accidentally shot and killed his 12-year-old brother.\n\"It's simple. Keep them unloaded and keep them locked up,\" Kessinger said. \"You can't put a loaded weapon anywhere that a child could get possession of it.\"\nSo could the parents in this most recent case be charged? We're told they were both home at the time of the shooting, along with other kids.\n\"That's a decision that will be made at a later time,\" Kessinger said. \"We'll take the facts, and we'll give it to the Commonwealth's Attorney, but I don't anticipate any charges, but obviously that's my opinion, and it could change.\"\nRelated Stories:\nUPDATE | Coroner identifies 3-year-old boy who accidentally shot himself in Algonquin neighborhood\nCopyright 2016 WDRB Media. All rights reserved."}