{"uri": "http://www.ksl.com/index.php?sid=42212206&nid=148&title=jittery-man-shoots-self-passenger-in-legs", "title": "'Jittery' man shoots self, passenger in legs", "dct": "Mon, 14 Nov 2016 00:00:00 GMT", "id": "f4298abbb625804b3bd5ba2cb0e8c1e2", "content": "OREM — Police are investigating an early morning shooting in which a man shot both himself and the woman he was sitting next to, putting a bullet through three of their four legs.\nAbout 1:30 a.m. Monday, Jarrat Broadbent, 22, got into a car with four other people, according to Orem Police Lt. Craig Martinez. The four were acquaintances, he said. Witnesses later told investigators Broadbent appeared nervous, jittery and was sweating.\n\"He appeared to be under the influence of something and was acting very suspicious. The female victim was sitting next to Jarrat and could see that he had something in his coat. She asked what it is was, he pulled out a handgun, and dropped it on the floor. When he went to pick it up, it went off. The bullet went into and through his leg and through the victim's leg and lodged into her other leg,\" Martinez said.\nBroadbent then pointed the revolver at the driver's head and told him to take them to the hospital, according to Martinez. When they got there, he ordered everyone to get out of the car, and then drove off, the lieutenant said.\nA 29-year-old woman from Nephi was treated for gunshot wounds to both her legs. Police later found the vehicle and Broadbent, and took him to a local hospital, where he was under watch while being treated.\nWhen he is released, Broadbent will be booked into jail for investigation of four counts of aggravated assault, robbery, theft of a vehicle, and possession of a stolen firearm, Martinez said.\nPolice were still investigating Monday what the group was doing when Broadbent was picked up.\nIn March, Broadbent was convicted of misdemeanor drug possession, according to court records. In February, he was convicted of failing to stop at the command of a law enforcer, speeding away at 112 mph, according to charging documents. He was convicted on similar charges in December 2015, court records state.\nIn 2013, Broadbent was convicted of attempted theft.\nContributing: Dave Cawley"}