{"uri": "http://www.ajc.com/news/news/crime-law/rockdale-sheriff-calls-store-patron-hero-for-firin/nmSbG/", "title": "Rockdale sheriff calls store patron ‘hero’ for firing on gunman", "dct": "Mon, 01 Jun 2015 00:00:00 GMT", "id": "3bbe79c4dcfd9a9fd5feca7e85cba397", "content": "A man killed in a shootout with deputies in Rockdale County on Sunday night had armed himself with an assault rifle and a bullet-proof vest before deputies arrived, according to details released Monday.\nJeffrey Scott Pitts was involved in a liquor store shootout in which two people were killed before driving about five miles to Ebeneezer Road where he shot and wounded his parents, Rockdale Sheriff Eric Levett said in a news conference Monday.\nPitts, 36, then armed himself with AR-15 assault rifle, a 100-round double magazine and the vest while awaiting deputies who responded to the 911 call, Levett said.\nHe then opened fire on responding deputies, who were also armed with assault rifles, Levett said. One deputy shot back although it was unclear whether Pitts was shot by the return fire or committed suicide, Levett said.\nMun Hyuk Cha, a 44-year-old clerk, and Otonicar Jimquez Aikens, a 39-year-old customer, were shot and killed at Magnet Package Store, Levett said.\nThe killings followed an earlier confrontation when Pitts forced a store clerk to return his driver’s license at gunpoint. The clerk had retained the license during a dispute, Levett said.\nDeputies were out looking for Pitts by the time he had returned to the store and opened fire with a pistol, Levett said.\nPitts fled after another patron, Todd C. Scott, of Covington, opened fire with his own hand gun. It is still unclear whether Aikens died before or after Scott returned fire with Pitts, but the sheriff credited Scott with saving lives.\n“I consider him to be a hero,” Levett said.\nPitts police record included a driving while intoxicated charge and a misdemeanor marijuana possession in 2010 in Newton County, Levett said.\nThe details were still sketchy Monday because police had not interviewed Pitts’ parents Alan Pitts, 63, and Judith Pitts, 64, who were still in an Atlanta hospital, Levett said.\nThe Georgia Bureau of Investigation, which in investigating the officer-involved shooting, expects that the dash-camera recording of the shootout at Ebeneezer Road will be released Tuesday, said Sherry Lang, deputy director of the GBI."}