{"uri": "http://www.11alive.com/story/news/local/conyers/2015/05/31/conyers-gunman-shoots-multiple-victims-at-two-locations/28276861/", "title": "Police: Gunman killed after shooting spree in Conyers", "dct": "Mon, 01 Jun 2015 00:00:00 GMT", "id": "91f9af9e910587920c255e4c6193d56c", "content": "CONYERS, Ga. -- Authorities say a man shot four people at two different locations before he was fatally shot in Rockdale County on Sunday.\nAccording to officials on the scene, it began with an altercation at Magnet Package Liquor Store on Ga. Highway 20 and Bell Road. An altercation apparently occurred after a store clerk took 36-year-old Jeffrey Scott Pitts' identification.\nPitts left, but then returned with a large assault rifle. He allegedly opened fire killing a customer, 39-year-old Otonicar Aikens, and shooting the 44-year-old store clerk, who later died.\nPitts left after a customer, identified by authorities as Todd Scott, began returning fire.\nFrom there, authorities Pitts say returned to his home and shot his parents.\nInvestigators said Pitts fired at deputies and they fired back. Pitts was killed in the exchange of gunfire, officials said.\nAuthorities have not said if Pitts was shot by sheriff's deputies, or if he turned the gun on himself. The GBI said that information should be released by Tuesday.\n(Story continues below photo)\n(Photo: Ryan Kruger/WXIA)\nPitts' parents were transported to an Atlanta-area hospital in stable condition, officials said.\nThe GBI is investigating the officer-involved shooting scene at the home.\nGBI spokesperson Sherry Lang said that Pitts was firing an AR-15 and .45 caliber handgun. He was wearing a ballistics vest padded with weights, Lang said.\nEmployees of the liquor store said that Pitts was a regular at the store, but some had recently accused him of shoplifting.\n(Story continues below photo)\nAll deputies involved in the shooting at the Ebenezer Road residence have been placed on paid administrative leave pending the outcome of a GBI investigation."}