{"uri": "http://www.covnews.com/section/1/article/59620/", "title": "Covington man who fired back at Magnet store shooter called 'hero'", "dct": "Tue, 02 Jun 2015 00:11:00 GMT", "id": "a12e73ec68ae3945c1faa1ecdb67218b", "content": "Conyers - After Sunday's tragic events in Rockdale County, the Rockdale County Sheriff's Office staged a press conference to give updates on the investigation. The victim's names, criminal history of the shooter Jeffrey Pitts, and other details were made available.\nConyers resident Mun Hyuk Cha was one of the victims. The 44-year-old business owner was working behind the counter of the Magnet Package Store on Ga. Highway 20 and Bell Road, along with his wife when Pitts opened fire. After being airlifted to Grady Memorial Hospital in Atlanta, Cha died of his injuries.\nThe other victim was 39-year-old Otonicar Jimquez Aikens. The Covington resident died the scene of his gunshot wounds. The husband and father of three was celebrating his son's eighth birthday and had gone to the store to make a quick purchase for the cookout.\nThere were three customers who weren't injured in the incident inside the liquor store.\nOne customer, Todd Scott, returned fired from a handgun from the back of the store at Pitts, effectively saving the lives of those around him, according to Rockdale Eric Levett.\n\"I consider him to be a hero,\" said Levett about the 44-year-old Covington resident. \"Although we did have a fatality at that location, he did save some other lives that were inside that business.\"\nLevett wouldn't say how many times each victim was shot or if Scott, who has a Georgia license to carry weapons, made contact with Pitts.\nIt was reportedly the first time the Porterdale restaurant owner had had to fire his handgun.\n\"I'm not a hero. I just did what I thought should be done,\" Scott later told WSB-TV. \"I definitely wasn't going to lie on the floor and take it.\"\nAfter firing shots inside the store, an emergency call from 3535 Ebenezer Road was made by a \"hysterical\" woman who said she'd been shot, according to Levett. The woman was Pitts' 64-year-old mother Judith, whom Pitts shot in the arm. Pitts also shot his 63-year-old father, Alan, in the head. Both are believed to be stable condition at Grady Memorial Hospital.\nPitts lived with both parents at the residence.\nPitts had no criminal history with the RCSO. In Newton County, he was arrested in November 2010 for driving under the influence and being in possession of marijuana, a misdemeanor. He received a fine, community service and 12 months of probation for the offense.\nFour RCSO deputies, Lt. Tom Brewer, Sgt. Dan Lang, Deputy Brad Lockridge and Deputy Paul Oberholtzer, and one Conyers Police officer, Cpl. Jerahmy Williams, were involved in the shooting incident at the Pitts' family residence.\nLockridge was the first to arrive and, armed with an assault rifle carried by select trained deputies, was the lone deputy who fired shots at Pitts, who had also equipped himself with an AR-15 in addition to a handgun. Pitts was also wearing a ballistic vest padded with weight plates during the incident, according to Sherri Lang, public information officer for the Georgia Bureau of Investigation.\nLang didn't disclose why only one deputy returned fire. She also couldn't tell us how many shots were fired during the police shootout with Pitts.\n\"We have not determined how many shots were fired,\" said Lang. \"We'll determine that whenever we get all shell casings pick up.\"\nLang did say the GBI has performed an autopsy on Pitts' body and those results will be released \"whenever those results are available.\"\nServal key witnesses and people in these incidents have yet to be thoroughly interviewed for the investigation as well, including the deputies, the other store clerk inside at the time of the shooting and Pitts' parents.\n\"Again, the parents need to be interviewed. Once they're in a position where we can interview them, we'll interview them and get some more information on that,\" said Lang when asked why Pitts shot his parents after the store shooting. \"Right now, what I would prefer, since everyone has not been interviewed, I would prefer to wait to answer that question tomorrow,\" said Lang.\nPolice video of the shootout at the household will also be released Tuesday, June 2.\nRockdale County Commission Chairman and CEO Richard Oden also gave a statement at the conference. He said that he had received calls from concerned citizens about the incident and wanted to let them, the country and the world know that Rockdale is still a safe place despite this isolated incident.\n\"We are all impacted by this,\" said Oden. \"We are going to join together, hold each other up and move forward as best we can.\"\nvar articlebody_textsize_span = document.getElementById('articlebody_widget_forsizeuse'); var articlebody_default_size = DomUtilities.getCSSProperties(articlebody_textsize_span, 'font-size');"}