{"uri": "http://www.masslive.com/news/boston/index.ssf/2016/06/2_men_arrested_on_murder_charg.html#incart_river_index", "title": "2 men arrested on murder charges in the shooting of Raekwon Brown in Dorchester", "dct": "Wed, 22 Jun 2016 13:34:00 GMT", "id": "91c35d7f7263ad435d9be5087a8810de", "content": "BOSTON -- Boston Police Homicide investigators arrested two men in connection to the fatal shooting of Raekwon Brown, a 17-year-old who was gunned down near Jeremiah Burke High School in Dorchester earlier this month.\nJonathan Aguasvivas, 23, of Roxbury and Benzy Bain, 24, of Mattapan, were arrested Wednesday on warrants charging them both with murder, Boston Police said. Authorities said more charges could be filed.\nPolice were called to the area of 46 Washington St. on June 8 around 1:15 p.m. after receiving reports that people had been shot.\n\"On arrival, officers learned of four victims suffering from gunshot wounds,\" police said.\nBrown died at the scene. Two other victims, ages 17 and 16, were taken to a local hospital for treatment. Their injuries were non-life threatening. A fourth victim, a 60-year-old woman, was treated at the scene for a non-life threatening injury.\nInvestigators said camera footage and other evidence contributed to the arrests.\n\"When a young man finishing up his junior year of high school gets gunned down in broad daylight, finding those responsible for such a senseless tragedy is of the highest priority to the men and women of the Boston Police Department,\" Boston Police Commissioner William Evans said. \"Clearly, those responsible for the shooting cared little about who they hurt, harmed or injured while displaying an absolute disregard for the safety and well-being of every person living or working in that neighborhood.\"\nEvans hoped the arrests give Raekwon's family some measure of comfort and solace. Suffolk County District Attorney Daniel Conley said the arrests mark a step toward justice for the young man's family.\n\"Every life is precious, but a young life like Raekwon's carries promise that no one has the right to extinguish,\" Conley said."}