{"uri": "http://www.myfoxboston.com/news/2-people-shot-near-school-in-dorchester/330705583", "title": "Teenager 'gunned down' leaving Dorchester school", "dct": "Thu, 09 Jun 2016 14:15:00 GMT", "id": "d469b5b87b56c9a2f1d6374964e3b951", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nBOSTON - A 17-year-old teenager was killed and three others injured after a shooting in Dorchester shortly after 1 p.m. Wednesday.\nBoston Police said the shooting happened near 66 Washington St. outside of Sun Pizza. Three of the people shot were teenagers, including 17-year-old Raekwon Brown who did not survive.\nThe two other teen victims have non-life threatening injuries and the fourth victim is a 67-year-old woman, who had a bullet graze her.\n\"When a 17-year-old dies on the street, coming out of school, we should all be outraged,\" said Boston Police Comm. William Evans.\nBrown was a student at Jeremiah Burke High School, which was across the street. Witnesses told FOX25's Bob Ward that there was a fire alarm and the shooting happened a short time after while students were outside. Police said they have no indication this was a drive-by shooting.\nClassmates told FOX25 that Brown was very friendly.\n\"He was a good kid, despite what he did outside of school. I don’t know what he did outside of school,” Victoria Johnson said.\nMayor Marty Walsh asks for tips in the murder of a 17-year-old, who was \"gunned down in the middle of the day time.\"\n— FOX25 News Boston (@fox25news) June 8, 2016\nDue to the proximity, Jeremiah Burke High School, Dearborn STEM Academy, and Lilla G. Frederick Pilot Middle School were put in safe mode while police investigated.\nBoston Police said they were reviewing surveillance video from the area to see if they can spot the shooter. Grief counselors were expected at the school Thursday.\nFlowers now also at memorial for teen shot, killed in broad daylight outside his H.S. #FOX25 https://t.co/vRwxUEmxDP pic.twitter.com/PyN5CzdPC1\n— Michael Henrich (@MichaelHenrich) June 9, 2016\n© 2017 Cox Media Group."}