{"uri": "http://www.lagrandeobserver.com/news/local/4861244-151/briefly-nov-30-2016", "title": "BRIEFLY: Nov. 30, 2016", "dct": "Wed, 30 Nov 2016 11:28:00 GMT", "id": "966307cc68bbc8917f44565a657bdbda", "content": "La Grande man OK after shooting self in the hand\nLA GRANDE — The Union County Sheriff’s Office received information that a 75-year-old man had shot himself in the hand while unloading a small pistol Nov. 26. The unidentified man, who lives in the La Grande area, was driven to Grande Ronde Hospital in a private vehicle. He was treated and released with minor injuries.\nA deputy investigated the incident and determined the case was an accident. There were no other injuries associated with the incident.\nSummerville woman arrested on drug charges\nSUMMERVILLE — A woman was arrested by the Union County Sheriff’s Office Tuesday night after deputies served a search warrant related to alleged drug activity at her home at 509 Patten Street.\nNickole Luan Thamert, 42, of Summerville, was arrested and lodged in the Union County Jail on charges of possession of a controlled substance (methamphetamine), two counts of endangering the welfare of a minor and frequenting a place where drugs are used, according to a UCSO press release. The case is still under investigation.\nVFW Post sponsors Pearl Harbor dinner Saturday\nUNION — The Veterans of Foreign Wars High Valley Post 4060 invites the community to a dinner Dec. 3 in memory of the bombing of Pearl Harbor on Dec. 7, 1941, and to honor our World War II veterans. The dinner will be served from 3 p.m. to 7 p.m. at the VFW Hall in Union. Tickets are $12, and the menu is rib-eye steak, baked potatoes and green salad. Call Ken McCormack, past post commander, at 541-805-9321.\nBazaar helps fund fifth-grade student’s trip\nGingerbread Cottage, 1302 Sixth St., is having a bazaar Dec. 2-3, featuring holiday decor, gifts, goodies, jam and more. The sale is open from 4 p.m. to 7 p.m. Friday and 9 a.m. to 4 p.m. Saturday. The bazaar will help fund a La Grande fifth-grader’s trip to OMSI.\nMinistering event returns\nLast fall’s special event hosted by Damascus Road Ministries is being revived Dec. 1-3, led by special guests Sidney and Polly Smith who will minister through music and the Word. Each evening the gathering will get under way at 6 p.m. at 905 C Ave., La Grande. Organizers call for all to come and “enter into a personal experience with Jesus the Healer” and “expect the miracle.” Direct all inquiries to Pastor Kemit Knight at 541-910-0063.\nMining group meets Friday\nBAKER CITY — The Eastern Oregon Mining Association meets the first Friday of the month at Baker City Hall, situated at First and Auburn streets.\nA board meeting begins at 6 p.m., followed by a general meeting at 6:30 p.m. The meetings are open to the community."}