{"uri": "http://www.nydailynews.com/new-york/nyc-crime/bronx-teen-killed-drive-by-shooting-article-1.2756227", "title": "Bronx teen killed in drive-by shooting; he's second son heartbroken family has lost to gun violence", "dct": "Thu, 18 Aug 2016 10:33:58 GMT", "id": "f50d24be8740274579d85fc5b3b023c4", "content": "A 17-year-old Bronx boy who had dreams of becoming a rapper was fatally shot during a drive-by shooting — becoming the second member of his family to be murdered in six years, officials and heartbroken family members said Thursday.\nDontay (Tae) Gordon and a 21-year-old friend were on College Ave. near E. 170th St. in Claremont Village around 9:15 p.m. Wednesday when a passenger in a passing livery cab opened fire at them, witnesses told police.\nGordon was shot in the stomach, cops said. He was rushed to Lincoln Hospital, where he died.\n\"That's my baby son... I can't really speak,\" Gordon’s father Durand Gordon, 47, told the Daily News early Thursday. \"Someone has to pay.”\nThe elder Gordon said his oldest son, 19-year-old Durand Gordon Jr., was shot to death in April, 2010.\n“I have one more son left,” the heartbroken dad said. “It's just hard because (Dontay) was going to be somebody. He was a dancer and he was rapping.\"\nThe teen’s friend was also wounded and remained at Lincoln Hospital in critical condition, officials said. Police sources said that the second victim was “less than thrilled” to talk about his pal’s slaying and would only say that the gunshots came out of nowhere.\nDontay Gordon’s friends and family set up a makeshift memorial in the shape of a “T” outside his apartment building on Morris Ave. — which was around the corner from where he was killed.\nThe teen was going to be a senior at Renaissance High School in the fall, his father said.\n“The family is taking it hard,” Dontay’s friend Ralique McNeil, 18, said. “(Dontay) was a good guy. He was someone you want to keep around all the time. At first he wanted to be a football player, but he decided he wanted to be a rapper.”\nPolice said that Durand Gordon Jr. — a breakdancer who was written up in a New York Times article about subway performers — was found sprawled out on E. 169th St. with three bullets in his chest on April 1, 2010.\nJust like his brother, he was found around the corner from his home, police said. Witnesses called 911 after hearing multiple gunshots.\nFurther details of the investigation were not immediately disclosed."}