{"uri": "http://www.timesfreepress.com/news/local/story/2016/mar/16/womshot-killed-chattanooghome/355528/", "title": "Unintentional firing of weapon inside house kills Chattanooga woman", "dct": "Wed, 16 Mar 2016 00:00:00 GMT", "id": "7bb4d478b0e9ab13f1b4c2e2fbe32db0", "content": "The shooter sat in the sun with his head in his hands as investigators walked in and out of the house beside him Tuesday afternoon.\nAt 1:09 p.m., Aaron Randal, 22, was handling a weapon when it discharged and he unintentionally shot and killed 19-year-old Carly Ellis inside the home at 1206 Lewis St.\nThe bullet went through a wall and hit Ellis in the neck, according to Chattanooga police. Investigators have not said what type of weapon was involved.\n\"One occupant of the house was handling a firearm and negligently discharged that firearm,\" police Chief Fred Fletcher said.\nAfter the shooting, after the ambulance left and police arrived and the crime scene tape went up, Randal sat silently on the ground, not looking at anyone as investigators gathered evidence and processed the scene. Blood soaked his pants.\nLater, he was handcuffed and placed in the back of a police car. He has not been charged with a crime, but Fletcher said he hasn't ruled out charges. Investigators will work with District Attorney Neal Pinkston to determine if charges should be brought, Fletcher said.\n\"We are doing a complete investigation, and if somebody behaved in a way that was criminal we will work with the district attorney to make sure that the community has the opportunity to hold people accountable to any criminal charges,\" Fletcher said.\nIt's unclear how Ellis and Randal knew each other. They weren't related, Fletcher said, and the woman did not live in the home. Neither Ellis nor Randal have criminal histories in Hamilton County, court records show.\nEllis is the sixth person in Chattanooga to be killed so far in 2016. Seven days ago, 41-year-old Michael Hines was shot to death at his mother's home in Brainerd. And on March 2, 71-year-old Orlandus Metcalfe was gunned down while at home in his bed.\nEllis, who worked at downtown club Raw Chattanooga, is at least the second person to be unintentionally shot and killed in the Chattanooga region this year — on Feb. 29, 3-year-old Gavin Pittman found a gun in a glovebox and accidentally shot and killed himself in Apison. His mother, Kelly Pittman, later was charged with criminally negligent homicide.\nA woman on the front porch of the home on Lewis Street declined to speak with the Times Free Press Tuesday.\nContact staff writer Shelly Bradbury at 423-757-6525 or sbradbury@timesfreepress.com with tips or story ideas. Follow @ShellyBradbury."}