{"uri": "http://www.whec.com/news/hilton-accidental-shooting/4288344/", "title": "Arrests made following accidental shooting in Parma", "dct": "Wed, 12 Oct 2016 19:11:00 GMT", "id": "e4851b12611202c1c5345e5c5d32cf37", "content": "Two men are facing charges after an accidental shooting on Tuesday in Parma.\nOn Tuesday, around 4:45 p.m., deputies responded to an area behind 629 Moul Road in Parma for a man who was shot in the abdomen while working on his property. As deputies responded to the area, they say they could hear shots being fired at a distance.\nDeputies located the shooters, 34-year-old Ryan Pellman and 35-year-old Matthew Rodgers, in an area of land behind and to the west of 249 North Avenue. Once the shooting stopped, deputies found the victim in an area about 800 feet south of 629 Moul Road.\nDeputies tell us two men were using rifles to shoot at paper targets somewhere in the woods. In the process, they hit and seriously injured 42-year-old Kevin Flannery who neighbors say was out mowing his lawn at the time.\nNeighbors along Moul Road in Parma tell us target shooting is common around the area. So when Amanda Redick heard shots Tuesday while she was mowing her lawn, she didn't think anything of it. Until she saw several Monroe County Sheriff's deputies down the road.\n\"I heard a lot of sirens, choppers started flying really low over the fields,\" she says.\nDeputies tell us 34-year-old Ryan Pellman and 35-year-old Matthew Rodgers were target shooting behind their house in Parma. They say the men were shooting at paper targets with rifles and without any solid back stop.\n\"It surprises me a little bit because most people out here target shoot properly into a berm with a backstop,\" says Redick. \"I don't know what happened here but that was a little surprising.\"\nThe men were arrested and charged with assault and reckless endangerment. Neighbors like Redick, who has a young son, tell us this kind of incident, happening so close to home, scares her.\nShe tells us, \"When you're out in your yard, it's a little concerning because there's not much you can do so you've got to rely on other people to be target shooting properly and safely.\"\nFlannery's injuries did require surgery and at last check he was still in guarded condition at Strong Memorial Hospital. The two men, Pellman and Rodgers, are expected to be back in court on October 27."}