{"uri": "http://www.thenewstribune.com/news/local/crime/article85551222.html", "title": "Coroner releases identities of Dutterow Road shooting victims", "dct": "Thu, 23 Jun 2016 12:46:00 GMT", "id": "3cde965424334841ec69da9f257f5377", "content": "Thurston County Coroner’s office released the identities of the two men and one woman shot to death early Wednesday morning east of Lacey.\nThe woman’s body found in a camping trailer just off Dutterow Road was identified as 31-year-old Terron R. McGrath of Olympia. The men, also found in the trailer, were 28-year-old Jackson L. Edens of Olympia and 36-year-old Gerald M. Berkey of Elma.\nCoroner Gary Warnock said that all three victims died of gunshots, but declined to provide more details so as not to compromise the investigation.\nChief Dave Pearsall of the Thurston County Sheriff’s Office had said that based on the crime scene’s appearance, the shooting likely happened quickly, without much of a struggle.\nPearsal said Thursday the Sheriff’s Office doesn’t have a suspect, and they also have not found the weapon used.\nOn Wednesday, deputies found a half-pound of methamphetamine and a “baseball-sized” amount of black tar heroin in the trailer, along with several thousand dollars in cash, one handgun and five rifles, Pearsall said.\nMcGrath and Edens lived in the trailer, he said.\nDeputies responded to the scene when a man called 911 about 5:15 a.m. Wednesday and told dispatchers he had been shot, his friends were dead and he didn’t know where he was, according to Pearsall. Deputies used the man’s cellphone signal to track the call to a small, fifth-wheel camping trailer behind a residence on the 500 block of Dutterow Road Southeast.\nThe caller was found lying on the ground near Dutterow, shot in the chest, and was taken to Providence St. Peter Hospital in Olympia. The surviving victim underwent surgery and was in stable condition Thursday.\nPearsall said the survivor isn’t likely a person of interest. Following surgery, detectives conducted a brief interview with the man, but wouldn’t disclose the content for fear of disrupting the investigation."}