{"uri": "http://komonews.com/news/local/police-probe-whether-drug-dealing-led-to-triple-murder-near-lacey", "title": "Victims of triple murder near Lacey identified", "dct": "Thu, 23 Jun 2016 00:00:00 GMT", "id": "ced6588291494789035831b067e3f513", "content": "LACEY, Wash. -- The Thurston County Coroner's Office has identified three people shot to death Wednesday near Lacey.\nThey are Gerald M. Berkey, 36, of Elma; Jackson L. Edens, of Olympia; and Terron R. McGrath, 31, of Olympia.\nAn autopsy revealed the three victims died of gunshot wounds.\nInvestigators are trying to determine if drug dealing played a role in the slaying.\nThe investigators found half a pound of methamphetamine, heroin, thousands of dollars in cash and about half a dozen firearms in a travel trailer where the two men and a woman were found dead on Wednesday, Thurston County Chief Deputy Dave Pearsall said.\nThey don't believe any of the weapons found were involved in the shooting, Pearsall said.\n\"We've developed information that these folks inside this trailer, two of them lived there, and it was a place that drugs were being dealt out of,\" he said.\nPearsall said that they're not yet calling it a drug-related crime, but noted \"this is a known area for some narcotics being sold.\"\nA 911 call was received at 5:17 a.m. Wednesday from a 30-year-old man from Olympia who said that he had been shot, his friends were dead and that he didn't know where he was, Pearsall said.\nDispatch was able to use the caller's cellphone to find his general location - on a property on the east side of Lacey, just north of the state capital of Olympia. \"We found him collapsed on the driveway,\" Pearsall said.\nThe man had a gunshot wound to the chest and was transported to the hospital, where he was in stable condition after undergoing surgery, Pearsall said.\nPearsall said there was no sign of a struggle in the trailer, and that the two men were both shot in the head and the woman was shot in the back.\nInvestigators have talked with the man who survived the shooting, but Pearsall said he's still not coherent following surgery. He hasn't been ruled out as a suspect at this time, but he is not currently a suspect, Pearsall said.\n\"The suspect is still at large, we don't know who the suspect is at this time,\" he said, noting that the person \"could be armed with the weapon that was used to kill these people.\"\nInvestigators at the scene were observed going in and out of the trailer and walking around the property. Authorities are working on search warrants to follow up on leads as they work to establish a suspect, Pearsall said.\n\"We're doing everything we can to follow up on some leads,\" he said."}