{"uri": "http://www.theolympian.com/news/local/crime/article85239992.html", "title": "3 dead, 1 injured in shooting near Lacey", "dct": "Wed, 22 Jun 2016 14:01:00 GMT", "id": "d78b52d9d1109b643f8ab7616478cbde", "content": "Thurston County Sheriff’s detectives are investigating an early Wednesday shooting that left three people dead and one injured inside a small camping trailer east of Lacey.\nChief Deputy Dave Pearsall identified the victims as a 31-year-old Olympia woman, a 28-year-old Olympia man and a 36-year-old Elma man. He said it is unclear how they knew each other or what their relationship was.\nEach of the three people appears to have been shot once. Both men were likely shot in the head, and the woman was likely shot in the back, Pearsall said. Based on the crime scene’s appearance, the shooting likely happened quickly, without much of a struggle.\n“We don’t know the motive or have a suspect at this time,” Pearsall told reporters late Wednesday afternoon. They also have not found the weapon used.\nA 30-year-old man who was taken to Providence St. Peter Hospital with a gunshot wound to the chest likely isn’t a suspect, but he hasn’t been ruled out as a person of interest. Detectives tried to interview him Wednesday afternoon, but he had undergone surgery and was unable to provide much information. He was listed in stable condition Wednesday afternoon.\nThe suspect, or suspects, in the shooting are still at large and likely armed, Pearsall said.\n“It could be one (person), or it could be several,” Pearsall said. “We don’t know at this point.”\nThe victims’ bodies were removed from the trailer about 12:30 p.m. Wednesday. Coroner Gary Warnock said that autopsies likely would be performed sometime Thursday. Names of the victims will not be released until their families have been notified.\nDeputies found a half pound of methamphetamine, some black tar heroin, several thousand dollars in cash, and six or seven guns inside the camping trailer. Pearsall said that one of the guns is a handgun, and the others are rifles. But it doesn’t appear that any of the guns were used in the shooting. However, the presence of the drugs, cash and guns points to the likelihood that drugs were being sold from the trailer, he said.\nAt least two of the people lived in the trailer, Pearsall said.\nDeputies were first mobilized when a man called 911 about 5:15 a.m. Wednesday and told dispatchers he had been shot, his friends were dead, and he didn’t know where he was, according to Pearsall.\nDeputies used the man’s cellphone signal to track the call to a small, fifth-wheel camping trailer behind a residence in the 500 block of Dutterow Road Southeast.\nThe caller, a 30-year-old Olympia man who was found lying on the ground near Dutterow, was taken to the hospital.\nThere are three other structures on the property besides the trailer: a house, a mobile home and a standalone garage. Pearsall said there were people inside each of the structures at the time of the shooting, but so far no one has been able to provide any information about what happened.\nSheriff’s deputies have searched the entire property, including vehicles, he said.\nSteeley McGrath, who said she is the sister of the woman who died, entered the scene with sheriff’s deputies about 10 a.m.\nJohn Robitsch, who lives across the street from the trailer, said he heard the gunshots.\n“I was sitting on my porch at 5 a.m., and I heard five or six shots,” Robitsch said. “After hearing that, I went back in the house.”\nJan Phipps, whose mobile home backs onto Dutterow, said that about 8:45 p.m. Tuesday she had heard a sound that she thought was fireworks. After learning of the shooting, she now thinks it might have been gunshots. She said she didn’t see any vehicles coming or going from the crime scene but did see a man walk toward the road and then walk back onto the property.\nHowever, Pearsall said deputies believe the shooting occurred just before the 911 call.\n“Until we talk to the guy who’s in the hospital, we believe that it happened at 5 o’clock this morning,” he said.\nThe property has a reputation as a drug house, Phipps said.\n“It scares me and makes me mad, because that little bit of innocence I have left is gone now,” said Phipps, a 16-year resident of the neighborhood.\n“It really makes me stop and think about the safety,” she added.\nPearsall said he did not know if the sheriff’s office had a history of responding to calls at the address.\n“It’s a tragedy for the area, and we want to find out who did this,” he said.\n“We’re just hoping some of the stuff we have right now will point us in the right direction.”"}