{"uri": "http://thetelegraph.com/news/68559/alton-brothers-charged-in-shooting", "title": "Alton brothers charged in shooting", "dct": "Fri, 17 Jul 2015 00:00:00 GMT", "id": "7b0322ef40027e125c6fa0df486c4dea", "content": "EDWARDSVILLE — Madison County State’s Attorney’s Tom Gibbons filed charges Friday against two Alton brothers stemming from a shooting last month at a nightclub in Venice.\nVincent Gordon, 32, and Vontarius Gordon, 31, are facing multiple charges in connection with the June 28 shooting.\nOn June 28, a physical altercation between Vincent Gordon and a female patron occurred at the C & M Lounge, according to a release from the State’s Attorney’s Office. He is alleged to have punched the female in the face, which led to a confrontation between multiple people that eventually spilled out into the parking lot.\nAt that time, Vontarius Gordon began shooting into the crowd with a semi-automatic handgun, hitting people on the parking lot, the C & M Lounge itself and a vehicle, the release said. It is also alleged that Vincent Gordon began firing shots with his own weapon, an assault rifle. Both men fled the scene before police arrived.\nOfficers with the Venice Police Department, in conjunction with investigators from the Illinois State Police (ISP), the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF), and the Granite City Police Department worked the case and were able to identify the brothers as the shooters.\nBoth men are facing six counts of aggravated battery with a firearm, a Class X felony, for the six victims who were injured at the scene. None of the injuries were life-threatening. They also face two counts of aggravated discharge of a firearm, a Class 1 felony, for shooting the Lounge and a vehicle on the parking lot. Finally, both men were on parole and were therefore charged with one count of unlawful possession of weapons by a felon, a Class 2 felony.\nBond was set at $1 million by Associate Judge Neil Schroeder.\nVincent Gordon is currently in custody at the Madison County Jail in Edwardsville. He is awaiting transfer to Missouri for his parole violation on a kidnapping conviction. Vontarius Gordon, who was convicted in Illinois for aggravated battery with a firearm, has already been transferred to Menard Correctional Center on his parole violation.\nGibbons thanked Assistant State’s Attorney Crystal Uhe, chief of the Criminal Division, and the officers from the multiple police departments for sorting out a difficult case that led to Friday’s charges.\n“We are very fortunate that no one was killed that night,” said Gibbons. “It was a very chaotic scene and thanks to the diligent work of everyone involved, both of these violent men are back in custody.”\nMaximum penalty for a Class X felony is 6-30 years in prison; maximum for a Class 1 felony is 4-15 years in prison and 3-7 years on the Class 2 felony.\nThe charges, as well as the statements made by the State’s Attorney’s Office, are based upon probable cause. The defendants are presumed innocent unless proven guilty."}