{"uri": "http://www.sacbee.com/2014/10/12/6778220/three-shootings-kill-five-people.html", "title": "Three shootings kill five in Stockton in four-hour span", "dct": "Sun, 12 Oct 2014 05:00:00 GMT", "id": "d8d3b7cb00295b0c09fdb65becbc6f6f", "content": "It all began just before midnight on Saturday, when Stockton police responded to a deadly shooting at a home on Bourdeaux Avenue. Minutes later, officers rushed to a second homicide, and then, in the wee hours of Sunday morning, a third.\nWithin a span of four hours, five people were dead and one seriously wounded in a string of separate, apparently unrelated shootings in the city.\n“This is highly unusual. Our resources became very thin,” said Stockton police Officer Joseph Silva. “Our detectives and crime scene investigators were running from one homicide to the next.”\nDispatchers got the first call a few minutes before midnight on Saturday, and responded to a home in the 1500 block of Bordeaux Avenue. In the front yard lay a man who had been shot by a relative, Silva said. The man, 28, later died at a hospital.\nPolice arrested a family member in connection with the shooting. Andy Hem, 21, was booked into the San Joaquin County Jail on Sunday afternoon on a homicide charge. Police did not release the name of the victim or his relationship to the dead man. Silva said alcohol was a factor in the fatal dispute.\nOfficers responded to the second shooting at about midnight, in the 3200 block of Farmington Road. There they found a man, 26, dead from gunshot injuries. Witnesses said they heard gunfire and saw vehicles fleeing the area, including a white Chrysler Sebring.\nThe victim was a gang member, Silva said. “So we are trying to determine whether this was gang-related.”\nThe third shooting, in the 1100 block of East March Lane, claimed the lives of three people.\nOfficers arrived at the address about 3:30 a.m. to find a woman and a man, both 19, and another unidentified man dead. A third man, 21, was taken to a hospital with serious injuries.\nMotives for the incident are unclear, Silva said. “All we know is that there was some sort of dispute prior to the shooting,” he said.\nThe Police Department has called upon the state Department of Justice to help investigate the third case, Silva said. “With six people shot in four hours, we just didn’t have the resources,” he said.\nPolice are looking for a possible suspect in the third incident. He is described as an African American, about 20 years old, with dreadlocks and wearing a red hat.\nThe department is encouraging citizens to call if they have information on any of the shootings. Tipsters should call the Stockton Police Department at (209) 937-8377, the Investigations Unit at (209) 937-8323, or Crime Stoppers at (209) 946-0600. Callers can remain anonymous. Crime Stoppers pays cash rewards up to $10,000 for information that may lead to an arrest.\nCitizens may also text information from their cellphones to Crimes (274637) and type the keyword TIPSPD and then their tip or logon to the Stockton Police Department’s Facebook page and click ‘Submit A Tip’. Tipsters may also send tips on the Stockton PD Mobile Phone App.\nCall The Bee’s Cynthia Hubert, (916) 321-1082. Follow her on Twitter @Cynthia_Hubert."}