{"uri": "http://fox5sandiego.com/2016/12/18/boy-playing-outside-shot-by-man-cleaning-his-rifle/", "title": "Boy playing outside shot by man cleaning his rifle", "dct": "Sun, 18 Dec 2016 10:09:00 GMT", "id": "4fbb119132ec73beafb773b614760114", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nOCEANSIDE, Calif. - An 11-year-old boy playing on his skateboard was shot in the hand by a man who was cleaning his rifle, police said Sunday.\n“I saw one kid grabbing his neck and his hand and he was just bleeding another kid was holding his knee and I said what happened and he said I don’t know I think we got shot,\" said neighbor Carlos Millan who heard the gun shot.\nOfficers responded to the 400 block of Vandegrift Boulevard shortly before 8 p.m. Saturday, where they found the boy in the pool area with a non-life threatening injury, Oceanside Police Lt. Daniel Sullivan said.\nThe boy was taken by helicopter to Rady Children's Hospital in Kearny Mesa.\nThe victim told officers he was skateboarding near the pool area with two friends and felt the injury to his hand after hearing a loud single pop, Sullivan said.\nOfficers searched the area, located the crime scene and several witnesses and found the gunman inside his apartment. The suspect eventually told officers he was unloading his .223 caliber rifle and accidentally fired a bullet through the exterior wall of his apartment, Sullivan said.\nOfficers found a bullet hole in the exterior of the building in the same area as where the children were playing. The shooting suspect was detained and transported to the Oceanside Police Department for further investigation, Sullivan said.\nThe boy had stable life signs and was expected to recover from the gunshot wound. Meanwhile residents like Millan are still unsettled about the shooting regardless.\n“That still makes me feel insecure. I tell my kids now stay away from that area. Is anyone else cleaning their guns?”said Millan.\nThe shooting is still under investigation."}