{"uri": "https://www.facebook.com/photo.php?fbid=10207860755135860&set=a.1012118302292.2001909.1205049444&type=3&theater", "title": "I will use social media to call out prayer warriors.", "dct": "Fri, 17 Jun 2016 00:00:00 GMT", "id": "1f0fcb9dee0e80196f9c0eefb133b18f", "content": "Morgan was visiting a friend and Jett found a 22 handgun, it fired and hit Jett between his eyes and came out on the top left side of his head.\nHe has been flown in AngelOne to Children's hospital in Little Rock where he is in ICU. They are monitoring the pressure in his brain and keeping him in a medically induced coma so his brain can 'rest'.\nIf the pressure and swelling can be controlled with medication they will do so, surgery may be necessary at some point.\nHe is moving his right side. When he starts coming to, he tries to pull out the tubes etc. Movement is good, but we would love to see him move both sides.\nPrayer focus is first of all, healing. Complete with nothing altered.\nPray that every detail will be noticed, every doctor and every nurse or medical staff will be alert to every single detail in caring for Jett.\nPray for Morgan, that she will not listen to the devil's accusations or his shaming. This is not the time for assigning fault or making accusations. Pray that she has supernatural strength to be who she is called to be in this tragedy, and that she lives in THIS moment, not the past, not the unknown future, but THIS moment, as she walks hand in hand with our Father God thru this awful event.\nPray for Elizabeth and Jason as they parent their daughter thru this horrible time. Give them wisdom and discernment to handle this very sensitive situation. Pray that God will grant to them that 'peace that passes understanding'.\nPray for Joe Pat, who is in basic training, and his parents who have traveled to Little Rock to be with Jett. Pray that LaQuita and Phillip will bring comfort and great strength to Morgan and Elizabeth and Jason.\nI ask that any negative comment not be posted here on Facebook or even voiced verbally. The negative comments that ARE made need NOT be addressed. Kerry always said, 'the more you stir it, the more it stinks'. So let's just leave it all alone shall we? You can help us in that big way.\nI will post updates as I can, as there is anything to tell. They all appreciate your concern, covet your prayers, and bask in your love during this heartbreaking time. Love them and pray for them.\nI believe this child will live and live well. I stand on faith in the God Who heals, El Rapha. I have boldly asked Him, as many of you have, and I believe He will grant that in His perfect time. I believe He will bring great blessing even from this tragedy. He is the God Who brings beauty from ashes. He is the God Who speaks and it IS.\nWe ask You God to heal this child."}