{"uri": "http://www.cleveland.com/metro/index.ssf/2017/01/man_charged_after_teen_was_kid.html", "title": "Man charged after teen was kidnapped, pistol-whipped, shot four times in Cleveland", "dct": "Wed, 04 Jan 2017 13:05:00 GMT", "id": "772031a5324540f54aaafae0506adde3", "content": "(cleveland.com file photo)\nCLEVELAND, Ohio -- A 15-year-old boy was held against his will at a Cleveland home and beaten for hours before his attackers hauled him to the city's East Side and shot him four times, police say.\nPolice are now searching for a Bedford Heights man wanted in connection with the Dec. 20 assault.\nLawan Elliott, 25, was charged with first-degree kidnapping Dec. 28 by way of a warrant. He remains at-large.\nPolice accused Elliott of holding the boy against his will at a home on Mt. Hermon Avenue in the city's Central neighborhood.\nThere, Elliott and an unknown number of accomplices pistol-whipped, punched and kicked the boy \"continuously\" for at least two hours, according to court documents.\nThe boy suffered injuries to his face, but the attack didn't end there, police say.\nAfter the beating, Elliott is accused of ordering two accomplices to \"take the victim away,\" court documents say.\nThe boy watched as Elliott handed the pair a gun, records say.\nThe two accomplices drove the 15-year-old more than four miles away, to the 10200 block of Meech Avenue, records say.\nThe accomplices shot the boy four times at close range and left, records say.\nThe boy made his way to a home on nearby Dove Avenue, where a resident let him inside and called 911, according to a police report.\nHe was rushed to Rainbow Babies & Children's Hospital with gunshot wounds to his abdomen, forearm, hip and thigh, police said.\nPolice haven't released details on the boy's current condition.\nThe boy's mother told investigators that the Dec. 20 shooting began with an incident at Arbor Park Village, which is where the Mt. Hermon Avenue home is located.\nWhen officers searched the area later that day, however, they found no evidence of violence there, the report says.\nOfficers did recover evidence of a shooting at the Meech Avenue location, according to a police report.\nWhen the warrant for Elliott's arrest was issued last week, a detective asked a Cleveland Municipal Court judge to set a high bond in the case, records say.\nIn April 2016, Elliott pleaded no contest to a misdemeanor drug charge after he was arrested by Cleveland police. He was also indicted in June 2016 in a Euclid police case for felony drug possession and illegal conveyance, records say.\nElliott's criminal history further includes a 2009 conviction for attempted theft in Bedford Heights, a 2011 conviction for attempted burglary in Warrensville Heights, and a 2014 conviction for receiving stolen property, also in Warrensville Heights, according to court documents.\nIf you'd like to comment on this story, visit Wednesday's crime and courts comments section."}