{"uri": "http://www.mysanantonio.com/news/local/article/Murder-suicide-ends-with-three-people-dead-in-8331887.php", "title": "Police: Firefighter kills 12-year-old stepdaughter, wife before turning gun on self in Aransas Pass", "dct": "Wed, 29 Jun 2016 00:00:00 GMT", "id": "c8476682ad72698ed343fe34b682e5ca", "content": "Five days after a Katy mother shot and killed her two daughters before being gunned down by police, another Texas town is going through a similar family tragedy.\nIn Aransas Pass, about 195 miles south of Katy, near Corpus Christi, police are investigating a shooting that began as domestic violence that left a man, his wife and 12-year-old stepdaughter dead Tuesday night, according to Aransas Pass Assistant Police Chief David Perkins.\nSteven Dolan shot himself after shooting his 47-year-old wife Brenda and stepdaughter in their home in the 1700 block of West Highland Avenue in Aransas Pass, Perkins said. Dolan's wife was pronounced dead at the scene. Dolan and his stepdaughter were taken to a nearby hospital where they died later that night, according to the Corpus Christi Caller-Times.\nDolan was found next to the garage of the house with a gunshot wound to his head and a 9 mm semi-automatic handgun laying next to him, Perkins said. He said it looks like Brenda suffered from gunshot wounds to her upper torso, hand and forearm, but that the investigation is still ongoing. The 12-year-old suffered a gunshot wound to her upper torso and leg.\nPerkins said there is not indication at this time that Dolan had any mental health issues. However, Perkins said, there might be some history of family violence.\nHe could not confirmed if Dolan was a licensed gun owner.\nCorpus Christi Fire Chief Robert Rocha told MySA.com Wednesday that Dolan was a firefighter for the department for 19 years.\n\"We have no past history that we identified that could have predicted this type of behavior,\" Docha said. \"If so, we would have done everything in our power to try and prevent it.\"\nThe fire chief said Dolan's wife had relatives who worked for the department and that \"many\" are feeling \"confused\" and \"upset\" about the incident.\n\"Thoughts and prayers are with all of the families involved in this tragic situation,\" he said. \"We're just all upset about the loss of life that took place.\"\nIn Katy, the Fort Bend County Sheriff's Office responded to a family meeting that ended with a mother and two daughters fatally shot in the street on Friday, June 24. Investigators said Christy Sheats called a family meeting Friday when an argument escalated out of control when she lifted a five-shot, .3-caliber handgun and opened fire on her two daughters, Taylor, 22, and Madison,17.\nBoth daughters and their father managed to leave the house, where Madison fell down and died. Taylor ran into the street and her mother shot her again, went back inside to reload the gun, and then shot her daughter again. Taylor later died at the Texas Medical Center.\nChristy Sheats was shot by police after she refused to drop her gun.\nkbradshaw@express-news.net"}