{"uri": "http://www.fox5vegas.com/story/30182031/vegas-man-suspected-in-killing-of-woman-boy-identified", "title": "Vegas man suspected in killing of woman, boy identified", "dct": "Mon, 14 Dec 2015 22:43:00 GMT", "id": "d48bf2122cd21e78ed72cfb5c410a4ed", "content": "LAS VEGAS (FOX5) -\nMedical examiners identified the man who Las Vegas police believe shot and killed his neighbor and her 8-year-old son before turning a gun on himself.\nAccording to the Clark County Coroner's Office, Joseph Frankulin, 47, of Las Vegas, died of a self-inflicted gunshot wound.\nAccording to Las Vegas Metro police, the bodies of Frankulin and a child were found last Friday inside the man's home in the 7200 block of Hardtack Circle, near Warm Springs Road and Tamarus Street. SWAT officers responded to the neighborhood after a call reporting a woman's death and her child's abduction.\nPolice said Frankulin went to the woman's home where he shot and killed her. The man then took her son to his home a couple of doors down. The woman’s young daughter ran to a neighbor’s home and the 9-1-1 was called.\nAccording to investigators, officers arrived at the woman's home and and found her body in a doorway. The woman's 2-year-old was found inside the home unharmed and was taken so safety by police. Officers made their way to the man's house and when they heard shots fired.\nMetro believed the man was holding a hostage and called in crisis negotiators and the SWAT team.\nAfter a couple of hours, officers went into the man’s home where they found the bodies of both Frankulin and the 8 year-old.\nOn Sunday, the coroner's office identified the woman and the child as 39-year-old Jennifer Bagley and Lex Donoso, respectively. Both died as a result of a homicide\nMetro said they are still trying to determine a motive for the killings.\nThe deaths of the woman and boy marked the 97th and 98th homicides in Metro's jurisdiction this year.\nCopyright 2015 KVVU (KVVU Broadcasting Corporation). All rights reserved."}