{"uri": "http://www.nwitimes.com/news/local/lake/sheriff-s-officer-serving-in-n-d-accidentally-shoots-self/article_30d60edc-b1ea-55a1-a0c6-1a48e1ce18d9.html", "title": "Sheriff's officer serving in N.D. accidentally shoots self", "dct": "Thu, 27 Oct 2016 00:00:00 GMT", "id": "9bc41466bfee9b721c1a758744d0af3e", "content": "One of four Lake County sheriff’s officers on special assignment with Homeland Security in North Dakota accidentally shot himself in the foot Oct. 25 while checking his department-issued rifle, an official said.*\nThe officer received medical treatment and is recovering, sheriff’s spokesman Mark Back said.\nThe officers are among about three dozen from Indiana who responded to the state of North Dakota’s request for assistance in Morton County under an Emergency Management Assistance Compact contract. In addition to the Sheriff’s Department, officers from Munster, Hammond, Schererville, Griffith and Michigan City are part of the Region contingent.\nProtesters trying to stop construction of the Dakota Access oil pipeline were bracing for a confrontation with police Thursday after the demonstrators refused to leave private land in the pipeline’s path, The Associated Press reported.\nA months-long dispute over the four-state, $3.8 billion pipeline reached a crisis point when some 200 protesters set up camp on land owned by pipeline developer Energy Transfer Partners. The disputed area is just to the north of a more permanent and larger encampment on federally owned land where hundreds of protesters have camped for months.\nLaw enforcement officials demanded that the protesters leave the private land on Wednesday, but the protesters refused.\nNorthwest Indiana officers from the Indiana Department of Homeland Security District 1 Task Force were deployed Saturday and will remain there for about two weeks under the contract, said Munster Police Chief Steve Scheckel, also the state’s Homeland Security liaison.\nNorth Dakota will be responsible for reimbursing out-of-state police agencies for various costs, said John Erickson, spokesman for the Indiana Department of Homeland Security. Such costs include wages, overtime, officer benefits, meals while officers are on duty, a per diem while officers are off duty, lodging and mileage for the communities that sent vehicles.\n* Editor's note: This story has been updated to correct the date of the accidental shooting. The Times regrets the error.\n+8"}