{"uri": "http://www.ajc.com/news/news/crime-law/11-people-shot-inside-georgia-bar/nnpy2/", "title": "Sheriff: Gambling dispute led to 10 people shot at Georgia bar", "dct": "Mon, 28 Sep 2015 00:00:00 GMT", "id": "de7468b157d7abdd5116ef739edf8f41", "content": "A gambling dispute turned violent Sunday morning when several suspects opened fire and shot 10 people inside a crowded west Georgia bar, authorities said.\nAs of Monday morning, no arrests had been made, but the local sheriff is vowing to get the establishment shut down.\nIn an emailed news release, Meriwether County Sheriff Chuck Smith said deputies from his agency responded to Hill Haven Event Center in Greenville — about 60 miles southwest of Atlanta — just before 3 a.m. They found three people with gunshot wounds, and later learned at least seven others were shot and left to seek medical attention on their own.\nThose wounded included five women and five men, and their ages ranged from 16 to 29, Smith said. By Monday morning, all 10 had been released from their respective hospitals.\n“Injuries sustained ranged from gunshot wounds to their arms, legs, feet, shoulder and one that was grazed in the head,” Smith said.\nHe said investigators determined that, before the gunfire erupted, “an altercation occurred involving several subjects over illegal gambling that was taking place in the back portion of the building.” Several people, none of whom have been identified or apprehended, pulled handguns and fired “indiscriminate” shots, Smith said.\nThe sheriff also said it was “evident” the bar — formerly known as Club CJ’s Sports Bar & Grill — was not operating “within the confines of its operational license,” which prompted him to ask the Meriwether County government to shut it down.\nA sheriff’s office spokesman declined to provide specifics on the alleged licensing violations. A woman who answered the phone at Hill Haven Event Center early Monday afternoon declined to comment but said a message would be passed along to the owner.\n“No community should be subject to this type of violence,” Smith said, “and my agency is going to [do] all that we can under the law to prevent this from occurring in this community again.”\nAnyone with information about the shooting is asked to call the Meriwether County Sheriff’s Office at 706-672-4489."}