{"uri": "http://thetelegraph.com/news/76566/it-was-very-senseless-teen-arrested-in-boys-murder-more-could-be-charged", "title": "‘It was very senseless’: Teen arrested in boy’s murder, more could be charged", "dct": "Thu, 14 Jan 2016 00:00:00 GMT", "id": "d4b180eadbaecca9c09deaf8a982007b", "content": "ALTON — Authorities said a social media disagreement prompted a man to fire on a group of youths, killing an 11-year-old boy this week, but Facebook also led them to the alleged shooter’s identity.\nThursday afternoon, the Madison County State’s Attorney’s Office charged suspect Ta’mon F. Ford, 18, of the 400 block of Emerald Avenue in Alton, with two counts of first degree murder in Monday’s shooting of Romell L. Jones, of the 3100 block of Paul Street. The shooting was in front of the Alton Acres public housing complex community center, at Paul and Acorn streets.\nThe charges identify the boy as “Ronnell,” which his family said is misspelled on his birth certificate, with his correct and preferred name being, “Romell.” The warrant also says Romell was shot in the back, although the Madison County Coroner’s press release previously said he suffered one gunshot wound to the chest.\nJudge Richard Tognarelli denied bond for Ford, who authorities arrested Thursday morning. He was at Alton City Jail on Thursday afternoon, awaiting transfer to the Madison County Jail in Edwardsville.\nPolice declined to say where they located Ford or the car from which he is suspected of shooting at the crowd of young people. Police had the vehicle towed Wednesday afternoon to the sally port on the upper level of the Donald E. Sandidge Alton Law Enforcement Center for processing.\nMaj. Jeff Connor, deputy commander of the multi-agency Major Case Squad of Greater St. Louis in Illinois, discussed the investigation Thursday afternoon at a press conference at the law enforcement center, 1700 E. Broadway. He called the crime “heart-wrenching.”\nConnor was flanked by more than 25 members of the Case Squad from 15 agencies in Southern Illinois, Madison County State’s Attorney Tom Gibbons and Chief Jason “Jake” Simmons of the Alton Police Department.\nJones’s family sat in the rear pews of the satellite courtroom, quietly listening to the officials.\nAfterward, the boy’s father, Robert Jones, 32, of St. Louis, said he is glad the suspect is off the street. “I’m glad justice is served, but it is not going to bring my son back.” He said he is shocked his innocent son was killed over a social media dispute. “It was very senseless.”\nWhen asked what his favorite memories are of Romell, he didn’t hesitate, quietly answering: “His heart, his smile and how he was excited to wake up and go to school and play sports. That’s what we talked about all the time.”\nNeither Jones nor mother Sonya Dixon, 29, who lives across from the community center, knows Ford. She has eight other children.\n“I’m glad they got him, and we still have a long recovery to go, but this is a start,” Dixon said, but said she is “not surprised at all” her son senselessly was killed over a social media dispute.\n“I just want to thank everyone, the Major Case Squad detectives and the Alton Police Department, for bringing my son’s killer into custody,” she said. “It’s going to be a long process but I’m focusing on burying my son and moving forward.”\nConnor said an online dispute between two people, including on Facebook, sparked plans for an “anticipated fight,” but not involving guns or young Romell. He declined to describe nature of the dispute.\n“It is believed that Ford was coming to the scene to confront those individuals involved in the dispute,” Gibbons also said.\nAuthorities said Ford, who was inside a red, 1999 four-door Oldsmobile Alero traveling on Paul Street, fired a 9 mm handgun at 5:16 p.m. from above the car roof. He allegedly aimed toward 20 to 30 young people outside the community center, some playing basketball. Gibbons said Ford’s “targets,” at least two people, were in the group.\nInstead, one of the bullets hit Romell, who was waiting for a ride to his city recreational league basketball practice, a sport numerous people have said he loved. No one else was injured. The vehicle fled the area and Romell was pronounced dead at 6:02 p.m. in the emergency department at OSF Saint Anthony’s Hospital.\nGibbons said five other people were inside the car at time of the shooting, who have not been charged with an offense, although the investigation continues. “There may be other charges,” he said. “This is still under investigation and other things still are being worked on.\nConnor repeatedly praised cooperation of the Major Case Squad and the Alton community for providing numerous tips to investigators that helped lead to Ford. “A little bit of everything — tips, hard work and luck” helped the Major Case Squad solve the crime within days, he said.\n“I want to give kudos to the citizens,” who kept the phones ringing at the police station with information, he stressed. The security cameras at Alton Acres also assisted in identifying the suspect’s car, he said.\nWhen asked if social media, which reportedly spurred the dispute, also contributed to Ford’s identification, Connor said: “That’s a fair way of saying it.” He also is chief deputy of the Madison County Sheriff’s Department.\n“It’s a terrible way to start the new year,” Gibbons said. “This is an absolutely heartbreaking tragedy. It leaves me saddened to have to start 2016 off with a young boy losing his life in such a senseless, violent way. I’m also tremendously angry. This defendant’s actions showed that he had a complete disregard for the life of this young boy and everyone else at the (community) center. He made the decision to try and resolve a dispute with a gun, and now my office is going to do everything they can to ensure a lengthy prison sentence to ensure that he will no longer be a threat to our community.”\nGibbons also praised investigators. “Only through the hard work of rugged individuals” did they solve the killing so quickly. “They have given everything. Our primary goal was to get the shooter charged and in custody.”\nIf Ford is convicted of 1st degree murder, he would face up to 20-60 years in prison. Gibbons, though, said because a firearm was used, Ford is eligible for an additional 25-year sentence. A judge also could impose a life sentence. If convicted, he will have to serve 100 percent of his sentence, Gibbons said.\n“There is no easy answer to stop violence, to stop an individual from making such a choice,” Gibbons said. “The community comes together … that is the most important take away from this, so we can have justice.” He also praised Assistant State’s Attorney Josh Jones and his office’s Violence Crimes Unit for their part in solving the case.\nSimmons said Ford has a police record, but would not give specifics. Madison County court records show a misdemeanor charge for obstructing identification and an ordinance violation for graffiti.\nPeople still may drop off cash or check donations to help with Romell’s funeral expenses at the Alton Housing Authority main office, 2406 Crawford St., during business hours; and (checks) in Harrison Funeral Home’s drop box outside the office, 1924 Central Ave., both in Alton. Checks should be made out to: “Harrison Funeral Home.”\nThere also is an online, gofundme site soliciting money for the family’s expenses.\nReach Linda N. Weller at 618-208-6450 or on Twitter @Linda_Weller"}