{"uri": "http://www.mailtribune.com/news/20160915/medford-man-who-killed-friend-gets-75-months", "title": "Medford man who killed friend gets 75 months", "dct": "NODATE", "id": "242347df662f02ea809eb85009283e08", "content": "A Medford felon was sentenced Thursday by Jackson County Circuit Court Timothy Barnack to more than six years in prison after admitting he killed his friend while handling a revolver under the influence of heroin.\nVincent Santana DiCostanzo, 23, pleaded guilty to manslaughter and weapons charges Thursday for firing the fatal shot into 34-year-old Luke Adrian Heiner-Barmes April 30 in the backyard of the victim's west Medford home.\nDiCostanzo had traded Heiner-Barmes heroin for a computer tablet, according to Senior Deputy District Attorney Terry Smith-Norton, who prosecuted the case. The two were friends, and the gun involved was separate from the drug transaction, Smith-Norton said. The weapon was meant to be a gift because Heiner-Barmes had been robbed in the weeks before the shooting, according to DiCostanzo's lawyer Christine Kantas Herbert.\nWhile DiCostanzo showed Heiner-Barmes how to use the revolver, he pulled the hammer back but couldn't figure out how to disarm the loaded firearm.\n\"He couldn't get it to go back,\" Smith-Norton said. \"He touched the trigger and it went off.\"\nMembers of the Heiner family expressed anger that DiCostanzo immediately fled after shooting his friend in the chest. The victim's aunt, Thursa Heiner, said Heiner-Barmes' \"kind neighbor\" was with her nephew in his final moments, not his friend.\nMembers of the Heiner family, including Heiner-Barmes' grandmother, aunt and mother, described Heiner-Barmes as an exceptionally bright and compassionate man who struggled with addiction. They said Heiner-Barmes suffered chronic pain after undergoing major chest surgery at age 11 and became addicted to oxycontin at age 19.\nFamily recalled he had little more than a bicycle and a night job at Jack in the Box. He worked his way up to manager there, then became manager at a KFC restaurant before relapsing in summer 2015 while dating a woman who used heroin.\n\"Yes, addiction did change Luke, but it didn't take away his decency,\" Thursa Heiner said.\nKantas Herbert said her client has suffered severe depression for killing his friend and fleeing the scene. His feelings of regret were among the reasons he was sent to the state hospital in June.\n\"He regrets that then and he regrets that now,\" Kantas Herbert said.\nUpon his release from the hospital, DiCostanzo expressed a desire to face the consequences of his actions, she said.\nDiCostanzo showed remorse but struggled with what to say to Heiner-Barmes' family.\n\"I'm sorry Luke's not here,\" DiCostanzo said, adding that the only way he knows to honor him is by living a clean life going forward.\nDiCostanzo was sentenced to 75 months in prison after pleading guilty to felony charges of second-degree manslaughter and felon in possession of a weapon.\nReach reporter Nick Morgan at 541-776-4471 or nmorgan@mailtribune.com. Follow him on Twitter at @MTCrimeBeat."}