{"uri": "http://kstp.com/news/2-shootings-downtown-minneapolis/4280148/?cat=1", "title": "6 Hurt in 2 Downtown Minneapolis Shootings, Suspect Arrested", "dct": "Tue, 04 Oct 2016 09:24:00 GMT", "id": "442541db647b6aa9eef2a259d460ad31", "content": "Police say six people were hurt in two separate shootings early Monday in downtown Minneapolis.\nAccording to Minneapolis police, the first shooting occurred just after 1 a.m. on First Avenue between Third and Fourth Streets. There were two victims; a man was found at the scene with gunshot wounds to his leg and hand. Another man went to Hennepin County Medical Center with a gunshot wound to his leg.\nThe second shooting happened about 15 minutes later, police said, in the area of Fourth Street and Hennepin Avenue. There were four victims in that shooting and all were found at the scene. All of the victims were male, and one was a juvenile.\nFive of the six victims sustained injuries that were not life threatening. The sixth victim, who was shot in the chest, was hospitalized and is stable, police say.\nPolice say the victims are not cooperating with the investigation. Police said they have recovered two handguns and say they believe the shootings are gang related.\n\"We know this is about groups and that moment in time, so our greatest challenge is knowing where and when. We know the groups, we don't know who the individuals are,\" said Minneapolis Police Chief Janee Harteau.\nHarteau also said the shootings started with a fight that was live streamed on social media.\n\"We believe that was a precursor to the first shooting. They were able to identify people and knew exactly where they were downtown. They used social media,\" she said.\nA suspect, identified in a police report as Qumari Spencer, was arrested after a foot chase following the second shooting, officers said. According to the police report, Spencer fled the scene with a loaded handgun.\nInvestigators don't know if Spencer is responsible for the first or second shooting. Authorities said the two shootings are related.\nMonday afternoon Minneapolis Mayor Betsy Hodges said she plans to launch a \"Group Violence Intervention Initiative\" to begin later this year. The initiative will be funded with a grant from the U.S. Department of Justice and will aim at at-risk and repeat offenders.\n\"Gun violence anywhere in this city is unacceptable and I'm sick of it,\" she said.\nAnyone with information on the incidents is asked to call the department's tip line at 612-692-8477 or text the tip to 847411 by entering \"MPD,\" a space, and then the tip information.\nPolice are going over surveillance video and body camera video from shooting in warehouse district @KSTP\n— Ellen Galles (@EGallesKSTP) October 3, 2016\nHarteau: Two downtown shootings this morning are connected...involving 5 adults and 1 juvenile. Police recovered 2 guns @KSTP.\n— Ellen Galles (@EGallesKSTP) October 3, 2016\nMayor Hodges: \"Gun violence anywhere on this city is unacceptable and I am sick of it.\" pic.twitter.com/pL8Ej3I2aQ\n— Ellen Galles (@EGallesKSTP) October 3, 2016"}