{"uri": "http://www.click2houston.com/news/police-teenage-boyfriend-accidentally-shot-and-killed-by-girlfriend", "title": "Teenager accidentally shot and killed by girlfriend, police say", "dct": "Fri, 15 Jul 2016 04:54:00 GMT", "id": "dd51add69c82cb3adf3fb871210938b8", "content": "HOUSTON - A teenager died early Friday morning after what police said was an accidental shooting in southeast Houston.\nFriends and family members gathered outside the home of Jacob Lara in the 11200 block of Sageland Drive near Beltway 8, just hours after Houston police said he was accidentally shot to death by his girlfriend.\n\"It's my understanding this was an accidental discharge. I don't think these individuals had experience with guns and as far as we we can tell, there is no evidence there was any argument any fighting of any kind,\" Sgt. Hector Garcia of the HPD Homicide Division said.\nDetectives believe that Lara, 19, had recently purchased the handgun.\nHe and his 16-year-old girlfriend were handling the gun just after midnight Friday. The 16-year-old apparently was trying to latch the safety lock when the gun went off, hitting Lara in the face.\nDetectives said Lara was dead when they arrived.\nFriends of Lara said he was a big fan of cars and sports. And that's how they plan to remember him, as they're left devastated by his sudden death.\n\"Was never a bad kid. He was everything a mom would ever wish for in a son,\" his friend Vianey Gomez said. \"Always polite, very educated. So many things I'll remember Jacob as. He'd always going to be in my heart.\"\nPolice are still investigating, but believe Lara's death was just a tragic accident that is especially heartbreaking given the circumstances and how young he was.\n\"I just really, really want to send my prayers to his family and my heart goes out to them,\" Gomez said.\nWanda Durham, who has lived in the neighborhood for more than 50 years, said there have never been any issues and it's always been quiet.\n\"It's just the world we live in today. So many things are happening that I'm not used to. We didn't used to have to go through things like this,\" Durham said.\nThe case will now head to a Harris County grand jury to see if charges may possibly be filed.\nA GoFundMe account has been set up for the family.\n2016 Click2Houston/KPRC2"}