{"uri": "http://www.nbcphiladelphia.com/news/local/4-People-Shot-in-Atlantic-County-Wind-Up-at-Wawa-Parking-Lot-391645281.html", "title": "1 Dies, 4 Hurt in Atlantic County Shooting That Leads Victims to Wawa", "dct": "Tue, 30 Aug 2016 15:33:00 GMT", "id": "3b47044964799d8f834fe6ab03374181", "content": "UPDATE: New Jersey State Police charged four men and a teen with weapons charges and identified the gunshot victim who didn't survive.\nA man died and four others were hurt in a shooting that led victims to a South Jersey Wawa for help, officials said.\nState Police first received calls reporting a shooting along the Atlantic City Expressway near milepost 12 in Egg Harbor Township shortly before 3 p.m. Monday. Around the same time, a bullet-riddled Ford Expedition, missing a rear tire and windows, barreled into the parking lot of the Egg Harbor Township Wawa store along Tilton Road, witnesses said.\nInside, there were four men who pleaded for help from strangers.\n\"The driver said he was shot,\" witness Erwin Ashworth told NBC10's Ted Greenberg. \"The passenger was hanging from the window... He said everybody was shot at least a couple times.\"\nBloodied clothes sat crumpled on the ground outside the truck where the victims were treated by medics. They were eventually transported to the Atlantic City Medical Center for treatment. A crime scene investigation is underway at an Egg Harbor Township Wawa after bullet-riddled car rolled into the parking lot. NBC10's Ted Greenberg has more details from the scene and reaction from locals who say they've never seen anything like this before. (Published Monday, Aug. 29, 2016)\nOne person was said to be critically injured and three others suffered minor injuries, according to law enforcement sources.\nNew Jersey State Police said there was a fifth shooting victim found in a vehicle on the northbound side of the Garden State Parkway near Exit 38. That's about a mile from the Wawa, which is located next to Atlantic City International Airport. Police say a passenger inside the vehicle had been shot in the head and was later pronounced dead. The driver was not injured.\nOfficials are trying to sort out the details but investigators believe the shooting occurred on the AC Expressway eastbound between milepost 11 and milepost 12. Police also say they don't believe the shooting was a random act and that the people involved likely knew each other. Investigators also found several weapons they believe are connected to the shooting at an unspecified location.\nWhile police have not identified any of the victims of the shooting, they say all of them are men under the age of 40.\nPart of the Atlantic City Expressway east was closed due to the investigation and traffic was diverted to Exit 14. It later reopened."}