{"uri": "http://foxbaltimore.com/news/local/bpd-officer-shot-in-cherry-hill-from-accidental-discharge-of-his-gun", "title": "BPD: Officer shot in Cherry Hill from accidental discharge of his gun", "dct": "Thu, 13 Oct 2016 00:00:00 GMT", "id": "0448ce80e12c3f877dd9e037a2263ddf", "content": "The officer who sustained a gunshot wound while investigating a carjacking in Cherry Hill was shot from an accidental discharge of his gun, police announced Thursday afternoon.\nBALTIMORE (WBFF) -- The officer who sustained a gunshot wound while investigating a carjacking in Cherry Hill was shot from an accidental discharge of his gun, police announced Thursday afternoon.\nDuring the initial briefing, held shortly after the shooting occurred late Wednesday night, police said the investigation indicated that the officer was struck by suspect gunfire as he approached the carjacked vehicle.\nThe officer sustained a gunshot wound to the wrist.\nIn the Thursday afternoon update, police provided more information about the carjacking, which happened around 10:40 p.m. Wednesday in the area of Grindall Street and William Street. Investigators say the two female victims were leaving their car when three armed male suspects demanded keys and purses and drove off with the vehicle, a 2011 Honda CRV.\nApproximately 40 minutes later, detectives from the southern district responded to Cherry Hill because they had information that individuals committing carjackings in the southern district were taking cars to that area.\n“CitiWatch noted that vehicle entered the area of Cherry Hill, in the 1000 block of Bethune Avenue and the two Southern District detectives were also in the area and they encountered that vehicle and attempted to identify the occupants and actually engage the occupants of the vehicle,” Deputy Commissioner Jason Johnson said Thursday afternoon. \"At the point that the officers engaged these people, an individual from the passenger’s side of the suspect’s vehicle fled from the scene. It’s at that point that our detective who was riding in the passenger’s seat of an unmarked police vehicle was struck by gunfire. Now last night our initial preliminary information was that we believed that the detective was struck by gunfire that was fired by a suspect, but our investigation which began immediately thereafter and continued through the night and through the morning has now concluded that in fact the officer had an accidental discharge, a discharge of his own firearm, and struck himself in the hand. There was no gunfire by a suspect, there was no other gunfire by any police on the scene.”\nThe injured officer has not been interviewed at this time, as he is still receiving medical treatment.\n\"It was chaos,\" Baltimore Police spokesperson T.J. Smith explained. \"You have a partner who, you hear this boom and, 'Is anybody hit?', 'I'm hit,' and the next thing you know, all of this stuff transpires.\"\nThe officer who was injured is a 15-year veteran of the agency, Smith noted, and was a 25-year member of the armed forces before joining the BPD.\nAfter the discharge, the police vehicle and the suspect vehicle traveled to the end of a cul-de-sac, where the suspects fled on foot.\nThree suspects were involved in the robbery and police say they have identified three persons of interest, all juveniles.\nNo one has been charged at this time."}