{"uri": "http://www.baltimoresun.com/news/maryland/crime/bs-md-ci-officer-shot-20161012-story.html", "title": "Baltimore police track carjacking suspects using crime patterns, but then detective shoots himself", "dct": "Thu, 13 Oct 2016 19:42:00 GMT", "id": "ba9ea565b7b2787af6a5357c017f619f", "content": "A Baltimore police officer accidently shot himself on Wednesday night in South Baltimore, police said.The officer suffered a non-life threatening injury.\nAfter an armed carjacking in Federal Hill, Baltimore police used recent trends to predict — correctly — that the suspects would head south to Cherry Hill.\nBut as two detectives spotted the stolen Honda CRV in the neighborhood and prepared to make an arrest, one of them accidentally shot himself in the wrist, and the suspects escaped.\nWhat was almost a policing success — a victory based on good intelligence and crime analysis —slipped away.\nThe events of late Wednesday were described by police on Thursday afternoon to correct an earlier version of what happened provided shortly after the incident. Police previously said that the detective was shot by a fleeing suspect and that the detectives had not fired their guns.\n\"It did not take very long for investigators to begin to gather enough physical evidence to suspect that, in fact, it was an accidental discharge versus gunfire by a suspect,\" said Deputy Commissioner Jason Johnson. \"However, we really wanted to be cautious and make sure that we gathered sufficient evidence before we made a public announcement.\"\nJohnson said the wounded detective, a 15-year veteran of the department and 25-year military veteran who has not been identified, was recovering from his injuries Thursday and had yet to be interviewed by police investigators \"due to the trauma of the situation.\"\nThe shooting, during which other officers applied a tourniquet to stanch the wounded detective's bleeding, will be investigated by the department's Special Investigations Response Team. The detective, who is in good condition, will receive additional training before returning to duty, Johnson said.\nThe second detective in the vehicle, a 25-year veteran of the department who also has not been identified, \"at least initially believed that the gunfire came from outside the car,\" Johnson said. He remains on active duty.\nThe episode began about 10:40 p.m. Wednesday in the 200 block of Grindall St., where two women were exiting their vehicle and were approached by three armed males, police said. The women were robbed of their purses and vehicle but were not injured.\nIn recent months, police have identified a trend in which stolen vehicles, often taken by juveniles, wind up in Cherry Hill. As of last week, carjackings were up 46 percent citywide compared to this time last year, and up 233 percent in the Southern District. Police have called halting the trend a priority.\nSo, when a report of the Grindall Street carjacking came through on the radio, CitiWatch operators were mobilized to begin tracking the vehicle through camera feeds, and the department's Foxtrot helicopter was deployed to assist.\nAbout 40 minutes later, the detectives spotted the stolen CRV in the 1000 block of Bethune Road. As the officers stopped to approach the vehicle as it parked, one of the carjackers jumped out of the passenger's side and began running, police said.\nIt was about the same time that the detective, in the passenger's seat of the unmarked police vehicle, shot himself, police said. The driver of the stolen vehicle then escaped as well, police said.\nThe bullet that wounded the detective was found in the detectives' vehicle, and his firearm \"had one less round than he should have had,\" Johnson said. The doors of the vehicle had not been opened prior to the shooting and there was no shattered glass.\nOn Thursday, police played a recording of police radio chatter from the time, which captured what T.J. Smith, a police spokesman, called the \"trauma\" of the moment.\n\"We need a medic! We have an officer shot!\" a detective can be heard yelling.\nPolice also showed a video of one of the suspects jumping out of the stolen vehicle and running.\nJohnson said three individuals considered \"persons of interest\" in the carjacking were being questioned about the incident, but no arrests have been made.\nEarly Thursday morning, before it was clear the officer had shot himself, Commissioner Kevin Davis said Cherry Hill had become a hot spot for carjackers to take the cars they had stolen.\n\"When our carjacking victim was attacked in Federal Hill and her car was taken, the Southern District patrol officers and detectives did a fantastic job of deploying in this area because they know based on recent patterns and trends that carjacked vehicles have been taken to this area after carjackings,\" Davis said.\nIn correcting the story Thursday afternoon, Johnson and other police officials also focused on the police work that led to the detectives locating the suspects.\nSmith said detectives, patrol officers and commanders are \"awfully familiar\" with the Cherry Hill area and some of the individuals who frequent the area, who they suspect may be involved in robberies and carjackings.\nMaj. Kimberly Burrus, commander of the department's district detective unit, which investigates carjackings and robberies citywide, said her team identified a pattern linking carjackings in the Southern District, including in Federal Hill, to the Cherry Hill area and is responding to it.\nShe said there is \"an actual nexus\" between a carjacking that occurred in Federal Hill on Oct. 7 — in which a suspect was arrested with a handgun and a mask — and the one on Wednesday night.\n\"We are making the connections,\" she said, including by looking into the suspect's \"associates.\"\nBurrus said one of the reasons carjackings — which involve victims essentially being robbed of their vehicles — are up is that modern, parked vehicles are more difficult to steal without keys.\n\"The vehicles nowadays are very hard to steal,\" she said, \"so the only way to steal them is to commit a carjacking.\"\nSmith said that with the trend of juveniles committing carjackings in the city, people worried about their safety should follow the lead of the two women carjacked in Federal Hill.\n\"Some of these young people really operate as if they have nothing to lose, and it's better to relinquish your property than fight with them,\" he said.\ntwitter.com/rectorsun"}