{"uri": "http://www.msnewsnow.com/story/32771405/9-year-old-shot-in-back-of-head-brother-in-police-custody", "title": "11-year-old's mother: shooting 'was an accident'", "dct": "Wed, 17 Aug 2016 12:35:00 GMT", "id": "4300a960d5b5c7510b922fb0dedc7592", "content": "MARSHALL CO., MS (WMC) -\nAn 11-year-old could face charges in connection with the death of his 9-year-old brother. The mother of the child, now faced with burying the younger child, said it was a horrible accident.\n\"It was an accident. That's all it was,\" Elizabeth Courson said. \"It was an accident. It's just an accident. My baby is gone because of a tragic accident.\"\nThe two brothers were left alone in their Byhalia, Mississippi home while their mother was at work on Monday. Their father lives out of town.\nThe mother said a friend was supposed to come by and check on the two boys while they were alone, but the friend didn't go check on them.\n\"He was supposed to come by and check on the boys and he didn't,\" she said.\nShe said her sons had just been back in Marshall County for three days. They had spent the entire summer with their father.\nShe said they had their .22 rifle outside.\n\"They weren't supposed to have to go outside to shoot it and they did,\" Courson said. \"They're just boys. They're 11 and 9 years old. My babies.\"\nCourson said the 11-year-old brought his brother into the house after the shooting and went to a neighbor for help. She said she had been at work for a few hours.\n\"I got a call on my lunch break to come home because my son was dead,\" she said.\nCourson said her sons were inseparable.\n\"They love each other so much and Kristopher always talked about how he has to take care of his brother,\" Courson said. \"He has to be his brother's keeper.\"\nShe said 11-year-old Kristopher is in shock.\n\"He's crying. He's upset. He's sad,\" she said. \"He's sorry and he blames himself.\"\nCourson worries what will happen next and worries that her son could be charged with murder.\n\"It was an accident. It just accidentally happened,\" she said.\nNeighbors said they saw the boys outside playing all the time.\n\"They're just out here in the yard playing all the time,\" neighbor Rick Markle said.\nThe 11-year-old reportedly told deputies he shot his brother in the woods behind their home, once in the head and again in the arm, before dragging his body into the house. The rifle was located in the woods about 400 to 500 feet away. But, that wasn't the first story he told deputies. He initially reported hearing gunshots and his brother was injured when he found him.\nSources close to the investigation said the 11-year-old had multiple reports of anger issues at Byhalia Elementary, where he attended school.\n\"I heard the shots. A child. It's unthinkable. I cried when it happened,\" neighbor Debbi Wilbanks said.\n\"Losing a kid is the most horrific thing you can go through,\" Markle added. \"They still got a long road to go through now with the other son.\"\nThe boy was taken for a mental evaluation at Parkwood Behavioral Health Systems.\nThe sheriff said the 11-year-old has not yet been charged in the shooting, and it could take some time before charges are filed. Investigators are still working the case.\nCopyright 2016 WMC Action News 5. All rights reserved."}