{"uri": "http://www.localmemphis.com/story/d/story/2-arrested-in-deadly-shooting-of-7-year-old/42300/zDL22nOoKkCvAXDqcFHcEw", "title": "3 Arrested In Deadly Shooting Of 7-Year-Old", "dct": "Wed, 15 Apr 2015 16:07:00 GMT", "id": "d6c32350254200f59e33796bc371ccc7", "content": "MEMPHIS, TN (localmemphis.com)--Memphis police have arrested three men for the fatal shooting of 7-year-old Kirsten Williams. Kirsten was shot in during a drive-by shooting last Friday as she was outside playing.\nDuring a news conference Wednesday, Memphis Police Director Toney Armstrong announced the arrest of 19-year-old Branden Brookins and 21-year-old Jordan Clayton. Both men are known gang members and have an extensive criminal history.\nArmstrong says solving this murder case was a priority for his department, and that Kirsten's murder made him think of his own daughter.\n\"Those of use here who have kids, it gives you a moment of pause,\" said Armstrong. \"It gives you a moment to appreciate the relationship you have with your kids.\"\nInvestigators say that around 11:00 p.m. on April 9th, officers responded to Regional One Hospital regarding a 22-year-old man who was shot in the 2600 block of Durby Circle in south Memphis. The victim refused to cooperate with police.\nA day later, around 5:55 p.m., officer responded to a drive-by shooting at 2674 Durby Circle that resulted in the shooting of 7-year-old Kirsten Williams who was playing outside in the front yard.\nA.P. Crockett witnessed the shooting from his yard across the street.\n\"She ran to the house to put down her backpack, came back to play with that little girl she came from school with, Crockett said. \"Here comes that man in the truck, shot her down.\"\nPolice say someone at that same location was an intended target in that drive-by, but it hasn't been determined if Kirsten was the target.\nHomicide investigators, with the assistance of Multi-Agency Gang Unit, developed Clayton and Brookins as suspects. They have been charged with First Degree Murder.\nAs the investigation continued Wednesday, homicide investigators later charged 19-year-old Carl Johnson with First Degree Murder.\nCrockett finds some peace in knowing there are now suspects in custody.\n\"I feel great. I thought they weren't gonna find them,\" Crockett said.\nAll three suspects are members of the Young Mob, Bloods and Gangster Disciples street gangs.\nCopyright 2017 Nexstar Broadcasting, Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed."}