{"uri": "http://www.nbcphiladelphia.com/news/national-international/baby-shot-face-compton-hospital-holly-avenue-368263811.html", "title": "'Hole in Her Head': Baby Shot in Face in California", "dct": "Wed, 10 Feb 2016 04:11:00 GMT", "id": "502f1e981b867798e0e78df2adf35b5e", "content": "The search for two attackers continued Wednesday in the fatal shooting of a 1-year-old girl who was struck by gunfire in her family's home.\nThe mother of 1-year-old Autumn Johnson said she was making a bottle for the baby, who was in her bed, when she heard gunfire coming from outside the Compton home in 200 block of Holly Avenue. The family was in a garage that had been converted to a living space, authorities said.\n\"There were just gunshots, and I saw my baby lying there,\" said Blanche Wandick.\nWitnesses said one attacker drove the getaway car while passenger opened fire. One woman said she saw the baby's father running while holding the baby, who wasn't moving.\n\"When I grabbed the baby, the baby was slumped over, and she had a hole in her head,\" said uncle Cornell Patton.\nThe baby died later at the hospital, according to the LASD. She was six days past her first birthday.\nMany neighbors told NBC4 they were heartbroken.\n\"I heard the shots maybe 10-12 shots,\" the Rev. Maurice Johnson, Kingdom Life Christian Fellowship Church, said. \"I assumed it was firecrackers. On this side of Compton, we don't hear gunshots very often.\"\nThe father told NBC4 he was not home at the time of the shooting, which investigators said they suspect was a gang-related attack.\nDuring the initial call, deputies responded to a report of gunfire at 7 p.m. When they arrived, they found the child with a gunshot wound to her face.\nDeputies rushed the baby to the hospital in their patrol car.\n\"The person who did this, honestly, all I can do is pray for them,\" said aunt Kenyia Hicks.\nActivists said after the horrific shooting, they were going to keep close watch, in case gangs are to blame.\n\"We're just going to make sure there's no retaliation, and more innocent people getting harmed as a result,\" Ben Owens of Southern California CeaseFire said.\nEditor's Note: This story has been updated from an earlier version."}