{"uri": "http://www.11alive.com/news/local/riverdale/school-on-precautionary-lockdown-after-students-body-found-nearby/346229956", "title": "Student found shot, killed near high school", "dct": "Wed, 02 Nov 2016 00:00:00 GMT", "id": "4cd4c37fd7b67a4ae962333a1220376f", "content": "RIVERDALE, Ga. -- A Clayton County school was placed on lockdown Wednesday as a safety precautions after a student's body was found nearby.\nCharles Drew High School made the decision Wednesday morning after the school was informed that an 11th grade student's body was found on Eagles Feather Lane in the Eagles Crossings Subdivision just after 8:00 a.m.\nPolice identified the victim as 17-year-old Cedric Clark. Police said he died from a gunshot wound and was found in the backyard of a home.\nClark's family told 11Alive News he was walking with another friend in the neighborhood Tuesday night. He lived in the next neighborhood over, so his family believes he was on the way home.\nA car pulled up and started shooting so the two boys split up and ran, according to family. They said Cedric tried to duck between houses when he was shot. They do not believe he was the target.\nCedric's family said he has a bright future and was interested in sports. He played on Drew high school's football team.\nDeputy Chief Joseph Woodall said investigators have not made any arrests but said they are conducting interviews. He called the shooting troubling.\n\"It's a concern and we're going to initiate all our resources to bring it to a conclusion,\" Woodall said.\nJada Dawkins, Director of Communications with Clayton Schools, said nothing happened on campus. The school is located in the 3000 block of Garden Walk Blvd. which is about a mile away from where Cedric's body was found.\nThe district's crisis team was on campus Wednesday to provide support to the staff and students, and will return on Thursday. A spokesperson for the school system released a statement: \"This is an unfortunate incident. Our heart goes out to the students, staff and family of the victim.\""}