{"uri": "http://murderpedia.org/male.G/g/griego-nehemiah.htm", "title": "Nehemiah GRIEGO", "dct": "Mon, 21 Jan 2013 00:00:00 GMT", "id": "8a1f8423d2bd1152b0d9e100138c3563", "content": "Classification: Mass murderer\nCharacteristics: Juvenile (15) - Parricide\nNumber of victims: 1\nDate of murders: January 18/19, 2013\nDate of arrest: Next day\nDate of birth: 1997\nVictims profile: His father, Greg Griego, 51; his mother, Sarah, 40; his brother Zephania, 9; and his sisters Jael, 5, and Angelina, 2\nMethod of murder: Shooting\nLocation: Albuquerque, Bernalillo County, New Mexico, USA\nStatus: Remained in custody at the Juvenile Detention Center and remains held without bond\nphoto gallery\n2013 South Valley, New Mexico homicide\nOn the night of January 19, 2013, five people were found dead inside a house by police in South Valley, New Mexico. A .22 caliber rifle was used to shoot a woman and three children and an AR-15-style rifle was believed to be the weapon used to shoot an adult male when he came home later. A 15 year old male was arrested in connection with the shooting.\nEvents\nAccording to police, Nehemiah Griego first killed his mother with a .22 rifle at around midnight. His brother Zephaniah woke up and Nehemiah told him he had shot their mother, but his brother initially did not believe him until Nehemiah showed him her bloodstained face. He stated to police his brother became upset, and then Nehemiah proceeded to shoot him with the same rifle. He then went into the bedroom his two younger sisters shared and found them crying, and shot them both in the head. He then proceeded downstairs and waited for his father to return home, which he did at around 5:00 am, upon which his son shot him multiple times with an AR-15 semiautomatic rifle with a scope.\nIn that statement of facts he gave to police, Nehemiah said that he had been having suicidal and homicidal thoughts, that he had obtained the guns from his parents' closet, that he had mailed a photo of his dead mother to his girlfriend, and that he had intended to drive off and use the guns to kill more individuals and ideally die in a gun battle with police. (The statement will only be admissible as evidence in court if he made it freely and voluntarily without coercion, and that he knew his attorney was not present and waived that right).\nUnder the laws of New Mexico, those of his age charged with first-degree murder are tried as adults, though minors can no longer be given the death penalty or an automatic life-without-parole sentence. He had originally lied to his girlfriend and church officials that his parents were killed in a car accident, and later said that he discovered their bodies and drove off.\nVictims\nThe five victims were a man, his wife, and three of their children, including two girls and one boy. The man, 51-year-old Greg Griego, was a former pastor at the area's Calvary Church who was also a chaplain to the Albuquerque Fire Department, and his wife, 40-year-old Sarah Griego, were the father and mother of the alleged shooter, Nehemiah Griego. The children (9-year-old Zephania, 5-year-old Jael, and 2-year-old Angelina) were Nehemiah's younger siblings.\nSuspect\nThe suspect is 15-year-old Nehemiah Griego. He was booked into Bernalillo County Juvenile Detention Center and was charged with two counts of murder and three counts of child abuse resulting in death.\nWikipedia.org\nNehemiah Griego: 6 months after the shootings\nBy Tina Jensen - Krqe.com\nWednesday, July 24, 2013\nALBUQUERQUE (KRQE) - It has been six months since New Mexicans first heard the news that 15-year-old Nehemiah Griego was arrested for the shooting deaths of his parents and three siblings.\nNow, with his family still grieving, his future is unclear.\n\"Clearly, there was some sort of break or psychotic break that happened that night,\" said Nehemiah's aunt, and now guardian, Regina Griego.\nRegina Griego is still grieving the death of her brother, Albuquerque pastor Greg Griego, and his family while trying to get the right mental health care for Nehemiah.\nRegina visits Nehemiah at the Bernalillo County Juvenile Detention Center every week.\n\"It's a cycle every week for me, to be reminded of the tragedy and the sadness of everything because I miss my brother a lot but I have such compassion for Nehemiah ,\" Regina said.\nIt is that compassion that is driving her to fight for better mental health treatment for Nehemiah.\nRegina says at the Juvenile Detention Center, he gets one hour of counseling a week and 15 minutes with a psychiatrist.\nShe was not allowed to see his medical records unless he signed them over.\n\"First of all, he's young, cognitively - to me, he's a child. And secondly, he's got some mental impairment,\" Regina said. \"So it has not made sense to me in any shape or form.\"\nSince then, Regina says Nehemiah has a working diagnosis with psychosis and dissociative disorders and has started medication.\n\"Now he has a full range of emotion,\" Regina said. \"He's missing his family. He obviously cries a lot about what happened.\"\nRegina says the Juvenile Detention Center is not the place for someone like Nehemiah, who needs intensive mental health care.\n\"It's a holding point. It's not really a healing point,\" Regina said. \"He's got to get to some mental health care facility to heal.\"\nNo one knows the real reason for the killings, except for maybe Nehemiah.\nDeputies say the homeschooled boy told them he was mad at his mom, but didn't say why.\nHis aunt believes he had undetected mental health issues and just snapped. She said maybe they were brought on by violent video games and easy access to his father's guns.\n\"This could happen to you,\" Regina said. \"I would advise parents to get smart on mental health. \"We're doing it now, after the crisis. Do it before the crisis.\"\nThe family has said if the 16-year-old is convicted in the case they hope he's sentenced as a juvenile, which would mean he'd be out of jail by age 21.\nNo trial date has been scheduled.\nGriegos: Give Him a Second Chance\nBy Jeff Proctor - Abqjournal.com\nWed, Jan 30, 2013\nIn the early morning hours of Jan. 20, 15-year-old Nehemiah Griego sat in an interrogation room at Bernalillo County Sheriff’s headquarters in Downtown Albuquerque and gave a detailed confession of how he had killed his parents and three younger siblings the day before.\nThe only others in the room were BCSO investigators.\nRight outside the room, Griego’s 21-year-old sister, Vanessa Lightbourne, was asking to be allowed access to her brother. She says her request was denied.\nMeanwhile, four more adult members of the Griego family say they were outside the building, trying unsuccessfully to get in, to get to Nehemiah, to get an adult seated next to him during questioning.\nThe killings have sparked intense media coverage; public grieving, especially for an Albuquerque megachurch community; and a localized version of the fiery national gun control debate. On Tuesday, the Griegos sat down with the Journal for their first in-depth interview.\nThey say they have many concerns about the case.\nThe circumstances surrounding Nehemiah Griego’s confession rank near the top.\nThrough a spokesman, Sheriff Dan Houston declined to comment for this story. But according to the charging documents, BCSO detectives read the teen a Miranda warning and asked whether he wanted an adult or a lawyer present. He declined and agreed to speak with investigators alone, the documents state.\nHis family says Nehemiah was in no condition to give a statement to authorities, especially not alone.\n“No lawyer, no adult, no access to any family members, (he) makes a statement, if that’s not damaging enough … for us the hardest thing is that became fact,” said Eric Griego, the boy’s uncle and a former state senator.\nThe family objected to the way Houston and BCSO investigators have publicly revealed details of the confession – presenting them as fact and as evidence that the teen had planned to go on a killing spree after slaying his parents.\n“As far as we know, that whole narrative that he was going on this grandiose shootout was based on a scared 15-year-old in the middle of the night, in the sheriff’s department, no parent, no adult, no lawyer, saying ‘I’m going to do this,’ ” Eric Griego said. “Should he have said it? Of course not. If any of us would have been there, we would have just told him to shut up.”\nEric Griego added: “With what we’ve all learned about brain development, something must have gone wrong with his brain.”\nAbove all else, the Griegos want everyone to know they are united in standing behind Nehemiah. They don’t dispute that the boy killed five family members. But they don’t want him tried as an adult.\nUnder New Mexico law, Griego will automatically be sentenced as an adult if convicted of first-degree murder. The charges against him all carry 30-year sentences, although a judge can give him less time.\nNew Mexico law automatically transfers 15-, 16- and 17-year-olds into the adult system as “serious youthful offenders” if they are charged with first-degree murder. The statute was created in 1993 and amended to include 15-year-olds in 1996.\nRedemption for all\nThe Griegos say theirs is a family that believes no one is beyond redemption, no one beyond repair.\nThe belief stems from personal experience: Greg Griego, who authorities say was the last one killed in the family’s South Valley home when Nehemiah ambushed him with an AR-15 assault-style rifle, had fallen into a life of drugs and gangs after a stint in the 82nd Airborne Division and was later “transformed” when he became a Christian while in jail in California in the early 1990s.\n“We all know what my dad and Sarah (Griego, his wife) would’ve wanted,” said Annette Griego, Greg Griego’s eldest daughter. Greg Grigo had five children before he met his wife, Sarah, with whom he had five more.\n“We have spent our lives watching them live their lives for others. And we know that, more than anything else, they would’ve wanted Nehemiah to be given a second chance, and that’s what we want as well … If my dad were here, my dad would stand by Nehemiah.”\nThe surviving family members also have taken exception to media portrayals of Greg Griego’s family as an insular, secluded lot.\nNehemiah Griego and his siblings were home-schooled, yes, but they spent countless hours at their church and interacted with similarly situated children, according to the Griego family.\nThere was plenty of love in the household, family members said. Greg Griego’s family loved music, dancing, playing games and spreading the Christian gospel together. They were always together.\nNehemiah Griego had entered into a quieter, awkward stage, as many teenage boys do, his family said. But no one noticed anything that could have predicted what would happen on the 2800 block of Long Lane SW in the early morning hours of Jan. 19.\nHe was interested in wrestling and music, he was affectionate toward his siblings and he had plans to follow in his father’s and other family members’ footsteps and join the military.\nThey say that what caused Nehemiah Griego to kill five family members – whether it was a yet-undiagnosed mental illness or something else – remains a question mark.\n“For the sheriff to tell us he had a little disagreement with his mother before he decided to kill her – the absurdity of that makes him out to be this complete sociopath, and that doesn’t make sense,” Eric Griego said.\nFamily members say they have visited Nehemiah in the juvenile lockup, but declined to discuss those meetings and how he’s doing.\nAlways a leader\nGreg Griego, according to his family, had always been a leader. People followed him – whether it was in the neighborhood near Avenida Cesar Chavez and Eighth Street SW where Greg Griego grew up with a brother, two sisters and a mother who refused welfare despite poverty, or at the Bernalillo County Metropolitan Detention Center, where he spent 13 years as a jail minister.\nThat leadership extended to the way he raised his children and ran his household, according to the Griego family. Greg Griego was old-school.\nHe liked his daughters to have long hair because he thought it looked pretty, said the eldest, Annette Griego, and he liked his sons to be tough.\nGreg and his wife, Sarah Griego, were loving but strict parents, according to the family. From a young age, the children were involved in the church community at Calvary of Albuquerque, where, until a recent falling out, Greg Griego had spent several years as a pastor.\nThe children weren’t allowed to date until reaching a certain age, family members said. That assertion contradicts BCSO statements that Nehemiah had a 12-year-old girlfriend. Officials say the boy exchanged text messages and a photograph of his dead mother with the girl on the night of the killings.\nFamily members said they weren’t aware of the girl. They had never seen her at family events, and they were positive Greg and Sarah wouldn’t have allowed their son to have a girlfriend.\nNehemiah Griego spent much of Jan. 19 with the girl after the killings, according to BCSO. Deputies say she knew what the boy had done, although Nehemiah told different versions of a story about how his family died to others. The girl is not facing any charges at this point.\nGreg Griego also wanted his family to know how to protect itself. According to family members, would-be burglars had entered the Griegos’ home years ago while Sarah Griego was home with the couple’s children. She managed to scare them away by calling out from another room that she had a shotgun.\nAfter that, Greg Griego bought guns, including those his son would later use to kill him and the other family members. He taught his family – including his wife and Nehemiah – to shoot them.\nThe guns weren’t kept under lock and key, according to the surviving family members, because Greg Griego wanted Nehemiah to have access to them if needed to protect the family.\nJournal staff writer Deborah Ziff contributed to this report\nNehemiah Griego's father came home to family massacre in New Mexico\nBy Matt Pearce - Los Angeles Times\nJanuary 23, 2013\nGreg Griego's wife, a son and two daughters were already dead. One of his other sons, Nehemiah, 15, was waiting for him in a bathroom with a high-velocity AR-15 rifle, police say.\nGreg Griego, who'd turned around a troubled life and involvement with gangs to become a chaplain, apparently had spent his last hours helping the homeless in Albuquerque, according to the Albuquerque Journal.\nHe was returning home from an overnight shift at the Albuquerque Rescue Mission when he was killed early Saturday morning, the newspaper reported.\nNehemiah Griego is charged with killing his mother, father and three siblings.\nThe teenager waived his right to an arraignment in adult court Tuesday and was being held without bond. Relatives have asked the public not to politicize the shooting, which has resonated with the nation amid the debate over guns, particularly military-style, semiautomatic rifles. The shootings add to the small portion of gun crimes committed with rifles.\nGreg Griego's responsibilities at the homeless mission weren't clear; the mission did not respond to a phone message left Wednesday morning. According to the mission's website, it offers emergency overnight shelter to families with children 10 or younger during the winter.\nGriego had young children of his own at home: Zephania, 9; Jael, 5; and Angelina, 2. They died of gunshot wounds to the head in an early-morning rampage that their brother allegedly contemplated for a week, officials said.\nAccording to court documents, Nehemiah Griego took a .22-caliber rifle from his parents' closet, shot his mother, Sarah, as she slept, then shot his 9-year brother who was in bed next to her. The teen said he then \"lost his sense of conscience\" and shot his two younger sisters in a nearby bedroom after they started crying, police said.\nPolice said in a statement that Greg Griego was not a convicted felon and that his guns had been purchased legally.\nNehemiah Griego told officials he loaded weapons into the family van and hoped to carry out an assault on a Wal-Mart, then die in a shootout with police, according to court documents. Instead he went to church.\nThere, he told his girlfriend and her grandmother that his family had died in a car accident, and a church security guard called 911, officials said.\nPolice also said the teenager, who is being charged as an adult, had texted a photo of his mother's body to his girlfriend.\nNehemiah Griego had \"many friends\" and spent much of his free time playing basketball and playing music, according to a statement from relatives published by KRQE-TV on its website Tuesday night.\nIn the statement, relatives asked the public and the media \"to not use Nehemiah as a pawn for ratings or to score political points.\" It was reportedly issued by Eric Griego, Nehemiah's uncle and a former Democratic state senator.\n\"It is clear to those of us who know and love him that something went terribly wrong,\" the statement said. \"Whether it was a mental breakdown or some deeper undiagnosed psychological issue, we can’t be sure yet. What we do know is that none of us, even in our wildest nightmare, could have imagined that he could do something like this.\n\"There is so much more to the Nehemiah we know than what the media is portraying. We know him as a bright, curious and incredibly talented young man. He was a brother, nephew, grandson and cousin.\"\nThe statement added: \"To be clear, our family has differing views on gun rights and gun control. What we do agree on is that those who wish to score political points should not use a confused, misguided, 15-year old boy to make their case.\"\nTeenager Contemplated Killings for ‘Some Time’\nBy Jeff Proctor and Patrick Lohmann - Albuquerque Journal\nWed, Jan 23, 2013\nNehemiah Griego had long harbored violent fantasies that included mass killings and murder-suicide scenarios.\nMore recently, those fantasies started to crystallize into a specific plan to kill his family, his girlfriend’s family and even strangers at a local Walmart, Bernalillo County Sheriff Dan Houston and one of his lead investigators said Tuesday.\nAccording to sheriff’s investigators, the 15-year-old followed through with part of the plan early Saturday, when they say he fatally shot his mother and younger brother in bed, his two young sisters in another room and then waited five hours to ambush his father in the family’s South Valley home.\nNehemiah’s father, local pastor Greg Griego, had been working an overnight shift at the Albuquerque Rescue Mission before returning home around 6 a.m. Saturday, officials said.\nHouston said during a news conference Tuesday morning that authorities have “no best judgment on a motive” other than he was “frustrated” with his mother.\n“This is beyond any human reasoning or understanding at this time,” he said. “It’s horrific. What other word do you use? It’s the first time I’ve been to a crime scene with this much destruction.”\nShortly after he shot his mother while she slept – around 1 a.m. Saturday – Nehemiah texted a picture of his mother’s body to his 12-year-old girlfriend, Houston told reporters. And it appears the girlfriend, who spent much of Saturday after the slayings with Nehemiah, knew he had killed his family even as he told different stories to others.\nBCSO Lt. Sid Covington said it appears that Nehemiah had made comments consistent with his plan for at least a week prior to the shootings, but he would not say who the teen had talked to.\n“That’s part of the investigation that’s still active,” Covington said.\n“… We’re still investigating who he might have told and what exactly he told them.”\nWhen asked whether he told the girlfriend his plans prior to the killings, Covington said that’s one possibility investigators are looking into.\nInvestigators are searching through the girlfriend’s cellphone as well as Nehemiah’s, the Journal has learned.\nHouston said the girl could face charges, although he did not say what she could be charged with and did not call her a suspect. A BCSO spokesman said later Tuesday that there are no pending charges, and authorities aren’t contemplating any at this point.\nOfficials said at the news conference that it didn’t appear Nehemiah had any history of mental illness or that he had been taking any kind of medication.\nFacing 200 years\nNehemiah has been in custody at the Bernalillo County Juvenile Detention Center since early Sunday. He was scheduled Tuesday afternoon for an initial appearance in Metropolitan Court on five counts of murder and three counts of child abuse resulting in death.\nBut Nehemiah waived the court appearance, and state District Judge Yvette Gonzales signed a stipulated order between prosecutors and the Public Defender’s Office under which he will be held without bond.\nDistrict Attorney Kari Brandenburg said Tuesday that the case should be presented to a grand jury within 10 days. Nehemiah will be tried as an adult under the state’s Serious Youthful Offender Act, which applies to any teen aged 15, 16 or 17 charged with first-degree murder.\nIf convicted, he could face more than 200 years in prison – 30 years for each murder charge in addition to 30 years for each child abused – but because he’s a juvenile, the judge has more sentencing discretion, Brandenburg said.\nHowever, she said the gravity of the charges against Nehemiah would give any judge pause before going easy on the teen.\n“The fact that five people lost their lives – some very young children – that certainly wouldn’t result in a light or minor sentence,” Brandenburg said.\nThe victims are: Greg Griego, 51; Sarah Griego, 40; Zephania Griego, 9; Jael Griego, 5; and Angelina Griego, 2.\nJeff Buckels, who supervises the Capitol Crimes division of the state Public Defender’s Office, will represent Nehemiah. Buckels did not return calls for comment Tuesday, but Brandenburg said he is an experienced and thorough public defender.\n“I would suspect that (Nehemiah) will be well represented, and that every issue possible will be addressed fully and completely,” Brandenburg said.\nMore killings considered\nDuring Tuesday’s news conference, Houston and Covington answered some lingering questions and provided some previously undisclosed details.\nPreliminary reports indicate that Nehemiah waited for his mother to fall asleep, and then retrieved several guns from the closet of his parents’ bedroom about 1 a.m. He shot his mother once in the head, then shot his 9-year-old brother multiple times, including in the head, with a .22 caliber rifle, Houston and investigators said.\nHe then shot his two sisters, aged 5 and 2, in another room with the .22 caliber rifle, Houston said. One of the girls was awake, he said, and the other was sleeping. One was shot multiple times; the other once.\nCovington said Nehemiah shot his father multiple times with an AR-15 assault-style rifle, including at least once in the head.\nOfficials said the teen was familiar with firearms because his father had taught him to shoot.\nAfter the killings, Nehemiah reloaded the .22 caliber rifle and the AR-15, put them in the family’s van along with several rounds of ammunition and drove away, officials said.\nThey said he had contemplated killing his girlfriend’s family and then “going and ending this at a Walmart with mass destruction.”\nInstead, Nehemiah spent much of Saturday with his girlfriend and her grandmother, officials said. It’s unclear exactly where they were, and Nehemiah on a few occasions left the two and then reconnected with them.\nAround 8 p.m., he went to Calvary Chapel on Osuna NE, where his father worked until recently as a pastor, officials said. Nehemiah told a church security guard that his family was dead. The security guard drove the boy to the Griegos’ home on the 2800 block of Long Lane SW and called 911.\nNehemiah agreed to speak with investigators without an attorney or an adult present. The interview lasted about 90 minutes, the Journal has learned, and investigators began by asking Nehemiah to talk about himself and his interests.\nCovington said during the news conference that Nehemiah told detectives he enjoyed playing video games, including Modern Warfare and Grand Theft Auto. Covington said he didn’t know whether Nehemiah’s parents knew he played those games.\nOfficials said the two guns used in the killings, as well as two pistol-grip 12-gauge shotguns found in the Griegos’ home, had been purchased legally. It is not clear, however, who bought them.\nCovington said it appears some of the guns owned by Greg Griego – including possibly those used in the killings – had been purchased by Greg Griego’s friends and then either sold to or given to the pastor. BCSO is working with the federal Bureau of Alcohol, Tobacco, Firearms and Explosives to trace the history of those guns, as well as the two shotguns.\nGriego had told friends, colleagues and inmates he worked with that he was an ex-con and had done prison time. That raised the question of how he obtained the guns.\nHouston said that although he has numerous arrests in his past, it does not appear Greg Griego was a convicted felon. A BCSO spokesman said it appears Greg Griego’s arrests were out of state. He could not say what the charges were.\nDocuments show Griego planned more extensive attack\nBy Kayla Ayres - Krqe.com\nMonday, January 21, 2013\nALBURQUERQUE (KRQE) - A statement of probable cause outlines how Nehemiah Griego eventually confessed to killing his family and how he told officers he did not want it to stop there.\nA Bernalillo County Sheriff's officer recounts questioning Griego after the 15-year-old boy told him he understood his rights and did not want an adult or lawyer present.\nGriego told conflicting stories before admitting he was \"annoyed with his mother,\" and allegedly confessing to gunning down his parents and three younger siblings. Even how he allegedly sent a picture of his dead mother to his girlfriend.\nAccording to the statement Griego also told officers after shooting his family , he reloaded two rifles so \"he could drive to a populated area to murder more people.\"\nSources say Griego went to the South Valley Walmart after investigators say he killed his family. He sat in the parking lot for up to an hour with an AR-15 assault-type rifle and a .22 rifle with a scope, as he contemplated shooting people at the store.\nThis news shocked shoppers.\n\"I think we were there on Saturday,\" one woman told KRQE News 13. \"That makes me scared. Thing have been happening all over the world, but to have it less than a mile from your home, makes you more scared.\"\nGriego also told investigators, \"he wanted to shoot people at random and eventually be killed while exchanging gunfire with law enforcement.\"\nSources say he contemplated doing the same thing at Calvary of Albuquerque in the North Valley.\nNeither happened.\nInstead, Griego went to the church, where he told a pastor and security guard his family was dead. The security guard then called 911.\nDickie Maestas, a neighbor of the Griego family, says he's relieved the carnage stopped on Long Lane.\n\"It's just really sad,\" Maestas said. \"I'm glad it didn't go any further than it did, and it's sad that it ended up the way it did. I'm sure all the neighbors feel the same way.\"\nAfter confessing, Griego was arrested. He faces two charges of murder , and three charges of child abuse resulting in death.\nThe District Attorney says Griego will be tried as a serious youthful offender, which means he could be sentences as an adult if convicted of first degree murder.\nGriego could make his first appearance in court on Tuesday.\nComplaint details horrific murders\nBy Magdalena Sharpe - Krqe.com\nMonday, January 21, 2013\nALBUQUERQUE (KRQE) - According to new details released the teen accused of murdering his parents and three young siblings was planning to carry out even more carnage in a public arena.\n15-year-old Nehemiah Griego made up several stories before finally confessing to authorities that he had killed his father, Greg Griego, mother, Sara, and three young siblings Jael, Angelina and Zephania.\nNehemiah had at first told authorities he had come home after being at a friend's house and found his family dead. He said that after finding the bodies he took the family van and drove to Calvary Church where he told his girlfriend that his family had been killed in a car crash.\nWhen authorities asked why he had not called 911 the teen said he had panicked.\nThe teen also changed his story several times regarding why he had rifles in the cargo area of the van.\nAlthough finally after Griego was informed by questioning officers that his story was not making sense, the teen started to tell authorities what had taken place.\nGriego said he had been annoyed with his mother and was having homicidal and suicidal thoughts prior to the killings. He said on the evening of the murders he had taken a rifle from his parent's closet and used it to first kill his mother. He then killed his younger brother and two younger sisters. The teen then waited for his father to come home and around 5 a.m. Greg Griego did just that. Nehemiah says he waited for his dad to walk past him several times before he shot his father multiple times with a separate rifle.\nThe teen told authorities after killing his family he reloaded his weapons so that he could \"drive to populated area to murder more people.\" He expressed a desire to shoot people at random and eventually be killed while exchanging gunfire with law enforcement.\nLuckily he didn't make it that far.\nAfter giving police the information above he was placed under arrest and is being charged with two counts of murder and three counts of child abuse resulting in death."}