{"uri": "http://www.independentmail.com/news/man-charged-with-killing-police-dog-hyco-denied-bail-ep-1365438494-347776231.html", "title": "Man charged with killing police dog Hyco denied bail", "dct": "Thu, 12 Nov 2015 00:00:00 GMT", "id": "b93d965128e7d20b89aed0b856aa1b86", "content": "Anderson County Sheriff’s Deputy Brandon Surratt said in court Thursday that his longtime partner and police dog, Hyco, likely stopped a bullet meant for him.\nSurratt’s tearful testimony about the death of his dog helped persuade Judge Lawton McIntosh to deny bail for Martavious Craig, one of the people accused in the killing of the 7-year-old German shepherd.\n“It was the worst day I’ve ever had in my entire life,” Surratt said Thursday, recounting what happened. “A piece of me was killed that day. But if it had not been for Hyco, I believe my family would’ve had to bury me.”\nAnderson County Sheriff John Skipper and at least nine other deputies stood behind Surratt as he testified at the Anderson County Courthouse but did not speak at the hearing.\n“It’s an emotional issue,” Skipper said after court. “It affects us all.”\nHyco was on his way to the vet to get his teeth checked Oct. 21 when Surratt got an emergency call. Soon, their patrol car was turned around, headed toward New Prospect Church Road outside Anderson. Deputies had been a chasing a vehicle, and three men who were allegedly involved in a carjacking. Soon, the three men were involved in a gunfight with Surratt and Deputy Matthew Grant. One of the bullets hit Hyco.\nCraig, 18, is from Seneca and is the youngest person charged in the case. Investigators say he was in the car with Sergio Montez Martin, 23, and David Morris Jr., 22, They are all charged with attempted murder of two deputies and with the killing of Hyco. A Seneca woman, 23-year-old Shirlandria Dixon, is accused of lying about the carjacking. She has been charged with filing a false report.\nCraig’s attorney, Bill Yarborough, described him as a remorseful young man who was in the wrong place at the wrong time. Yarborough said Craig did not know Hyco had been shot until after he turned himself in to authorities.\n“He shouldn’t have been where he was,” Yarborough said. “There’s no question he was in the wrong place at the wrong time.”\nHis defense attorney and prosecutors agree that Craig was not the shooter of Hyco, but he is charged with killing him under South Carolina’s “hand of one, hand of all” law.\nCraig’s grandmother, Melinda Craig, described him as a respectful teen who helps her with household chores and yard work.\n“I just cannot see him being the hardened criminal he has been made out to be,” she said.\nAssistant Solicitor Rame Campbell did not paint the same picture as Martavious Craig’s grandmother. Campbell said that when deputies searched the car that Craig and his co-defendants had been inside, they found stolen property from Seneca, three guns and three masks.\n“This was a robbery crew,” Campbell told McIntosh. “I ask that you deny bond based on how violent it got and how quickly it got that violent.”\nMcIntosh denied bail, saying the circumstances of the case and Craig’s juvenile record “all point to me that he is a danger to the community.”\nFollow Nikie Mayo on Twitter @NikieMayo"}