{"uri": "http://www.actionnewsjax.com/news/local/jacksonville-police-responding-to-reported-shooting-in-moncrief/466895692", "title": "Jacksonville police responding to reported shooting in Moncrief", "dct": "Mon, 14 Nov 2016 20:01:31 GMT", "id": "064f6d13fc82443448ed5152c00bf95c", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nJacksonville police said two women and a baby are dead after a shooting Sunday night near the Cleveland Arms Apartments.\n2 women and an infant killed in shooting near Cleveland Arms apartments\nAnother man, woman were injured in the same shooting\nPolice investigating possibility of more than one shooter, more victims\nPolice said it's too early to release suspect information\nThe Jacksonville Sheriff's Office said two women and an infant are dead after a shooting on Sunday night near the Cleveland Arms Apartments. A man and another woman, also believed to be injured in the shooting, are being treated.\nPolice shut down the intersection of Moncrief Road and Myrtle Avenue North Sunday night while investigating the shooting.\nAt 6:07 p.m., JSO got a call from the Lil' Albert Food Store reporting that there had been a shooting, said Ron Lendvay, JSO director of investigations and homeland security.\nA short time later, police got a duplicate call about the shooting from Jacksonville Fire and Rescue Department Station 18 at 3504 Myrtle Ave. North.\nFire Station 18 told police that multiple people who had been shot were driven to the fire station. In that car were two women, a man and an infant, who were all shot. One of those women was pronounced dead at the fire station while the man, the other woman and the infant were taken to UF Health Jacksonville.\nThe infant and the other woman were pronounced dead at the hospital, Lendvay said. The man is being treated for his injuries, though his condition was not known as of late Sunday night.\nAnother woman later showed up at UF Health Jacksonville with a gunshot wound and her wound is believed to be related to this shooting. Her condition was also not available as of late Sunday night.\n\"It's a sad day for Jacksonville. It's a sad day for everyone who lives in this area, and it's a sad day for everyone investigating this terrible crime,\" Lendvay said.\nJacksonville police identified the victims of the shooting as Xacia Burnem, 18, Kadejah Williams, 22, and 11-month-old Tedashi Williams.\nInvestigators believe the shooting may stem from a disagreement that happened earlier Sunday between some females.\nPolice said there was at least one shooter, but they have not ruled out the possibility that there was more than one, Lendvay said. A handgun is believed to have been used in the shooting.\nLendvay said at this point it is too early to release suspect information as police are still conducting interviews and want to ensure the information they release is correct.\nInvestigators also think there could possibly be more victims from the shooting. Lendvay said anyone who witnessed the shooting or anyone who was a victim is asked to contact the JSO Homicide Unit at (904) 630-0500 or CrimeStoppers at 1-866-845-TIPS.\nAction News Jax is following the story. Watch Action News Jax and follow us on Twitter @ActionNewsJax for the latest.\nA friend of one of the victims tells me this happened at the Cleveland Arms apartments after a fight. @ActionNewsJax\n— Kevin Clark (@KevinANjax) November 14, 2016\nInvestigators taking pictures and examining a car closely outside fire station @ActionNewsJax pic.twitter.com/rH5S7o8f2K\n— Kevin Clark (@KevinANjax) November 14, 2016\nAnother view outside Fire Station 18. Crime Scene Unit here and ambulance still on scene. @ActionNewsJax pic.twitter.com/V0vZwApPTi\n— Kevin Clark (@KevinANjax) November 14, 2016\nMoncrief and Myrtle still blocked off with heavy police presence @ActionNewsJax pic.twitter.com/9bVIxPvXBm\n— Kevin Clark (@KevinANjax) November 14, 2016\nOther scene is outside Cleveland Arms Apts. Evidence markers everywhere. @ActionNewsJax pic.twitter.com/Bbb2fNTwKy\n— Kevin Clark (@KevinANjax) November 14, 2016\nInvestigators are speaking to an employee at this grocery store. @ActionNewsJax pic.twitter.com/I9olcpp9nL\n— Kevin Clark (@KevinANjax) November 14, 2016\nSad update to this story: An infant is among those shot and killed in Northwest Jax: https://t.co/eUHA7yV4aT https://t.co/2eKvWWILc0\n— ActionNewsJax (@ActionNewsJax) November 14, 2016\n5020 Cleveland Rd - Have info on this shooting? Call #JSO at 630-0500 or Crime Stoppers at 1-866-845-TIPS to remain anonymous/reward. #JAX\n— Jax Sheriff's Office (@JSOPIO) November 14, 2016\n5020 Cleveland Rd. - Media will be briefed at 9:15 p.m. near the scene of the shooting. #JSO #JAX #Jacksonville pic.twitter.com/5gWxkFhVHz\n— Jax Sheriff's Office (@JSOPIO) November 14, 2016\n@JSOPIO reporting multiple people shot and killed, including an infant, near Cleveland Arms Apts. More to come. @ActionNewsJax\n— Kevin Clark (@KevinANjax) November 14, 2016\nWe're working to get more information on a reported shooting that has left at least 1 person dead:\n© 2017 Cox Media Group.\nWe Tried Blue Apron: Here's What Happened4 Heart Disease Warning Signs - No. 3 Will Shock You7 Things Glasses Stores Don’t Want You to KnowPopular seafood restaurant under investigation for food-borne...Deputies: Florida man permanently disfigured in fight over Minute Maid punch6 Duval Co. teens arrested after 6 hour search in St.Johns Co."}