{"uri": "http://jacksonville.com/news/2016-11-13/police-identify-infant-2-women-killed-jacksonville-shooting-sunday-near-cleveland", "title": "Police identify infant, 2 women killed in Jacksonville shooting Sunday near Cleveland Arms apartments", "dct": "Sun, 13 Nov 2016 18:57:00 GMT", "id": "c3fb4983c66c5f39be1a71559779c786", "content": "An infant and two women died after a Sunday shooting in Jacksonville near the Cleveland Arms apartments that left two others injured after an argument earlier in the day.\nPolice identified the child who died as 11-month-old Tedashi Williams, according to a Jacksonville Sheriff’s Office incident report. The two women were identified as Xacia Mikia Burnem, 18, and Kadejah Monae Williams, 22, according to the report.\nThe relationship between Kadejah and Tedashi Williams is unclear, but the report lists the same address in the 3600 block of Clyde Drive for both victims.\nWitnesses reported gunfire just after 6 p.m. at the Lil’ Albert Food Store in the 5100 block of Cleveland Road, said Director Ron Lendvay.\nHe said a short time later there was a second call from the fire station at Moncrief Road and Myrtle Avenue where multiple people were being treated for gunshot wounds after driving from the scene.\nRescue workers pronounced a Kadejah Williams dead at the fire station and transported the three others to UF Health Jacksonville with life-threatening injuries, Lendvay said. Burnem and Tedashi Williams were pronounced dead at the hospital, according to the report.\nAnother female gunshot victim arrived at the hospital later with non-life-threatening injuries, Lendvay said.\nThe two victims who survived have been identified as Teresa Nicole Grayer, 41, and Quadrae Breyon Johnson, 23, according to the report.\nLendvay said investigators are interviewing witnesses to determine what happened, but it appears there was some sort of altercation earlier in the day.\nPolice were canvasing the apartment complex Monday morning. No arrests have been announced.\nAnyone with information about the shooting is encouraged to call the Jacksonville Sheriff’s Office at (904) 630-0500 or to remain anonymous and possibly receive a reward contact First Coast Crime Stoppers at (866) 845-8477.\nTeresa Stepzinski: (904) 359-4075\nJoe Daraskevich: (904) 359-4308"}