{"uri": "http://www.wbir.com/news/crime/kpd-teenager-shot-during-drug-deal-and-robbery-at-west-knoxville-apartments/349396157", "title": "KPD: Teen shot during marijuana deal and robbery at West Knoxville apartments", "dct": "NODATE", "id": "a52a4619346c2944aa151e76408809e4", "content": "Knoxville police say a 17-year-old male was shot in the course of a drug deal and robbery at Sutherland Park Apartments in West Knoxville Monday afternoon.\nKPD said the teen was taken to UT Medical Center for a non life-threatening gunshot wound after the incident at the apartment complex at 509 Vista Glen Way.\nThe teen was the only person hurt in the incident, although one round of ammunition went into an apartment building and hit a piece of furniture.\nKPD said two suspects ran away after the shooting and are not in custody. Police said several people are in custody for questioning, and at least some of the people involved in the incident live at the apartment complex.\nAccording to KPD, four males went to the apartment complex to sell marijuana to a resident a little after 3 p.m. While they were preparing to make the drug deal, two males from the apartment pulled a handgun and robbed the dealer of his drugs and money, police said.\nThe victim ran toward his vehicle, and yelled to his friends that he had been robbed. The four males were walking back toward the apartment when three suspects came around the corner and started shooting, KPD said.\nWitnesses on site told WBIR 10News that two groups of men exchanged gunfire near a playground at the apartment complex where multiple kids were playing.\nCreasha Sheadrick lives at Sutherland Park Apartments and was playing at the playground with her three children when the shooting happened.\n\"I don’t know what these people are up to, I don’t care, but there was at least nine kids at the park,\" she said. \"The school bus had just left maybe five minutes after they had got there. The kids were just getting off the bus. A lot of the kids came to the park.”\nSheadrick said she grabbed her three kids and ran when the gunfire broke out.\n\"All three of my kids were crying, simply because I don't know if they didn't know what was going on, if they were scared the way I reacted,\" she said. \"I don't know, but they were crying, and I mean crying fiercely. I don't like that.\"\n(© 2017 WBIR)"}