{"uri": "http://www.huffingtonpost.com/entry/shooter-tennessee-quran_55aab832e4b065dfe89e8af5?", "title": "Tennessee Shooting Suspect Texted Friend An Islamic Verse Hours Before Attack", "dct": "Sat, 18 Jul 2015 16:47:00 GMT", "id": "450fc5ba9486bd90642e2d9d90c48396", "content": "CHATTANOOGA, Tenn., July 18 (Reuters) - Hours before the Tennessee shooting that killed five U.S. servicemen, the suspected gunman texted his close friend a link to a long Islamic verse that included the line: “Whosoever shows enmity to a friend of Mine, then I have declared war against him.”\nHis friend thought nothing of it at the time, but now wonders if it was a clue to Thursday’s rampage in Chattanooga, which has re-ignited concerns about the radicalization of young Muslim men.\n“I didn’t see it as a hint at the time, but it may have been his way of telling me something,” the friend told Reuters on Saturday. He requested anonymity for fear of a backlash.\nThe suspect, Mohammod Youssuf Abdulazeez, a Kuwaiti-born naturalized U.S. citizen, was killed in a gunfight with police. The FBI is investigating the attack as an act of terrorism, but said it was premature to speculate on the gunman’s motive.\nWhile a firm connection between the 24-year-old suspect and radical Islam has not been established, the shooting follows a series of attacks or thwarted attacks in the United States and other countries by Muslims claiming to be inspired by Islamic State or other militant groups.\nAbdulazeez returned from a trip to Jordan in 2014 concerned about conflicts in the Middle East and the reluctance of the United States and other countries to intervene, according to two friends who knew him since elementary school.\nHe later purchased three assault rifles on an online marketplace and used them for target practice, they said.\n“That trip was eye-opening for him. He learned a lot about the traditions and culture of the Middle East,” said one of the two friends, the person who received the text message.\nAbdulazeez was upset about the 2014 Israeli bombing campaign in Gaza and the civil war in Syria, he said. “He felt Jordan, Qatar, Saudi Arabia were not doing enough to help, and that they were heavily influenced by the United States.”\nThe other friend said Abdulazeez had always talked about the Middle East, “but I’d say his level of understanding and awareness really rose after he came back.”\nU.S. authorities said Abdulazeez sprayed gunfire at a joint military recruiting center in a strip mall in Chattanooga, then drove to a Naval Reserve Center about 6 miles (10 km) away, where he killed four Marines before he himself was shot dead.\nThree other people were injured, including a sailor who died from his wounds on Saturday. The U.S. Navy identified the sailor as Navy Petty Officer 2nd Class Randall Smith of Paulding, Ohio, who left behind a wife and three young daughters.\n“He was an awesome young man,” said Smith’s step-grandmother, Darlene Proxmire. “He loved his wife and children. He loved the Navy.”\nJORDAN TRIP WAS “EYE-OPENING”\nAbdulazeez, an engineer, went to the Middle East in 2010 and visited several countries, said the first friend. He then went to Jordan in 2014 to work for his uncle, and lived with his uncle and his grandparents there, he said.\nAfter Abdulazeez returned, he seemed more mellow, less interested in partying. “That is part of what drew us closer. He was a guy who wanted to settle down and get his life going. That connected us,” he said.\nThe night before the attack, just after 10 p.m., the friend received a text message from Abdulazeez with a link to a Hadith, or Islamic teaching: http://sunnah.com/nawawi40/38. He showed Reuters the text message on his phone.\nThe friend said he had been asking Abdulazeez for job advice, and continued to text him that evening and into Thursday but did not get a reply.\nThe friend said he was interviewed by the Federal Bureau of Investigation. The FBI declined to comment on Saturday.\nFor jihadists and ultraconservative Salafist Sunni Muslims, the Hadith “is usually understood within the context of al-wala wa-l-bara (or) love for Islam and hatred for its enemies,” said David Cook, an associate professor who specializes in Islam at Rice University in Texas.\nAccording to Abdulazeez’s friends, he purchased three guns on Armslist.com after returning from Jordan, including an AK-74, an AR-15, and a Saiga 12. They said he also owned 9mm and .22-caliber handguns.\nArmslist.com is an online listing site on which individuals can buy and sell firearms through private transactions. Critics say it enables people to obtain weapons without background checks, though the site has a disclaimer that it requires users to agree to follow all state and federal firearms laws.\nEmails seeking comment from Armlist.com and Armslist Legal Defense Fund, created to defend Armslist against lawsuits, were not immediately answered.\nGUNS, FAST CARS\nAbdulazeez’s friends said he occasionally smoked marijuana and drank alcohol, and struggled to reconcile that with his faith in Islam. At one point, in 2012 or 2013, he received therapy for drugs and alcohol use, they said.\n“He used it to de-stress, when things were difficult at home, or whatever,” the first friend said, adding that tensions between Abdulazeez and his Palestinian parents had also upset him. His parents nearly got divorced in 2009, according to court records.\nIn April, Abdulazeez was charged with driving under the influence and had faced a July 30 court date.\nAbdulazeez also had problems with local youths that sometimes took on a religious and racial tone, his friend said.\n“There were rednecks, ignorant people, who sometimes would cause problems. Mo never fought, but he used to get worked up and yell and stuff,” he said. “Afterwards he would calm down, and just say it doesn’t matter.”\nOver the past few months, Abdulazeez and his friends practiced shooting in the Prentice Cooper State Forest near Chattanooga, sometimes two or three times a week.\n“He was always interested in guns, since he was young. He started with a BB gun and paintball, and went on from there. We would go out shooting quite often,” said the friend.\nAbdulazeez also liked driving fast in the hills surrounding Chattanooga.\nTwo nights before the attack, he and some friends went joyriding in Abdulazeez’s rented gray convertible Ford Mustang, passing through the towns of Whitwell, Dayton and Jasper.\n“Fast car on a rainy night. We were flying, doing tight turns and drifting,” said the friend, adding that they returned home at about 3 o’clock in the morning.\n“He seemed totally normal. We made plans to hang out on the weekend,” he said.\nHe said Abdulazeez had a good paying job and many plans for his life, including possibly starting a computer sales business in Chattanooga. “He wanted to buy a car. He wanted a video console, to make a man cave - every guy’s dream.”\nHe said it was difficult to understand how his friend became the suspect in the rampage.\n“The signs just weren’t there,” he said. “The only thing I can think of is that it was a combination of things - what is happening overseas, his family problems, maybe some of the issues with the less educated people here. I don’t know.” (Additional reporting by Frank McGurty in New York, Mark Hosenball in Washington, Brendan O’Brien in Milwaukee and Alex Dobuzinskis in Los Angeles; Editing by Tiffany Wu)"}