{"uri": "http://www.aikenstandard.com/news/blotter-for-jan/article_5b3edc7c-dcc5-11e6-b002-13fb311d3dbb.html", "title": "Blotter for Jan. 18", "dct": "Tue, 17 Jan 2017 00:00:00 GMT", "id": "f6dce42e00f0a335e5859f24e978b2ff", "content": "According to reports provided by the Aiken County Sheriff's Office:\nDeputies were called to Rhombi Road in Belvedere on Saturday after two men fought each other following an altercation between their children at school.\nA North Augusta man was arrested Saturday after witnesses said he squirted ketchup all over a business on Cary Drive in Beech Island. Witnesses said he also became aggressive and chased a person around the store, then threw a 12-pack of soda at someone.\nFirefighters responded Monday to a fire on Corley Drive in North Augusta, after the residence caught fire and the back of the building was completely burned down. Police were told the home had been abandoned for a decade, therefore no power should have been used.\nAn Aiken man reported Monday while sitting in his car on Vaucluse Road at Shore Drive in Aiken an unknown black male fired a gun toward him, striking his car three times. The victim said the shooter was sitting in a gold Toyota Tercel.\nDeputies responded to an Augusta hospital after a juvenile reported on Sunday that a 33-year-old North Augusta man kissed her at a birthday party.\nDeputies reported Monday a North Augusta man accidentally shot himself in the hand while trying to clean his gun outside of his Celeste Avenue home.\nAccording to reports provided by the Aiken Department of Public Safety:\nAn Aiken woman was arrested Friday after she called 911 multiple times asking for a ride. She was located inside the Kershaw Street home of a 65-year-old woman where she had no permission to be.\nOfficers charged a man with disorderly conduct Friday after he was involved in a fight with another man in front of a Richland Avenue hotel. The man said he was fighting in self-defense, because the other man had hit his girlfriend. Officers reported the suspect appeared to be intoxicated.\nA 21-year-old Aiken woman called police Friday claiming bouncers kicked her out of a Hampton Avenue bar and threatened her for no apparent reason. The bouncers told police the woman threw a drink pitcher across the room at another group of people.\nA 65-year-old Aiken man reported Friday someone broke into his vehicle while it was parked outside his Hickory Ridge Road home.\nA 61-year-old Aiken woman called police Saturday claiming someone broke into her grandmother’s Maurice Terrace home and stole two flat-screen televisions.\nOfficers charged a man Saturday with malicious injury to property after he caused damage to multiple items in his room at a motel on Richland Avenue. The suspect said he was agitated due to his drug problem.\nEmployees at a Fabian Drive sporting goods store in Aiken called police Saturday after two unknown black males stole more than $200 worth of merchandise from the store. The suspects fled before police arrived.\nA 31-year-old Aiken woman reported Friday someone stole her prescription medication from her purse at her place of work on Richland Avenue. Officers recovered security footage, which showed another employee rummaging through the victim’s purse."}