{"uri": "http://www.wkyt.com/home/headlines/Lexington-police-on-scene-of-reported-shooting-265316871.html", "title": "Teen killed in Lexington shooting, three others wounded", "dct": "Mon, 30 Jun 2014 22:08:00 GMT", "id": "0f6225afdc5da5d4291453ac1ad7031a", "content": "LEXINGTON, Ky. (WKYT) - One of four women wounded in a late night shooting in Lexington has died.\nThe Fayette County Coroner says Kieara Green, 18, of Nicholasville, died Tuesday afternoon at UK Hospital.\nGreen was one of four women police say were shot at a home on Scottsdale Circle on Monday night.\n\"Fun-loving person. Always had a smile on her face. Real, real bubbly and lively,\" said Green's brother, Aaron Floyd. He says she had just graduated from east Jessamine High School.\n\"She told me she wanted to get into nursing school because she loved helping people, working with children, things like that,\" Floyd said.\nNow, that future is gone. Green's love for his little sister replaced by something else for whoever did this.\n\"Honestly...it's a strong word, but I hate them. I hate them for what they took from me,\" Floyd said.\nPolice are having a hard time coming up with any suspect descriptions because they say witnesses are giving them conflicting accounts of what happened. Floyd says whoever knows what happened needs to call police.\n\"A lot of people say, 'I don't want to be a rat, I don't want to be a snitch,' but then again, look what you're doing to society. You're just making it worse by not saying anything,\" Floyd said.\nPolice tell us at least a dozen shots rang out. When officers arrived on the scene, they tell us they found three injured women. Two had gunshot wounds to the arms and a legs. Green was critically injured by a gunshot wound to the upper body. A fourth victim drove herself to UK Hospital for treatment.\nPolice tell us one of the gunshot victims could be a juvenile. Right now, police aren't releasing any other information about the victims.\nLexington Police say they need tips from the public to help them piece together the events that led up to the shooting.\n\"At this time we have very differing accounts of exactly what happened,\" says Lexington Police Spokeswoman Sherelle Roberts. \"Some of our witnesses, some of the people involved, some of the people who were in the area all can't give us really consistent clues about what happened. So we need people to call in so we can start matching up those clues and see if we can really piece the situation together.\"\nRoberts says there is not a consistent suspect or vehicle description right now. They're encouraging witnesses to reach out however they can, whether it is by phone or social media."}