{"uri": "http://www.statesmanjournal.com/story/news/2015/10/01/shooting-reported-umpqua-community-college/73154132/", "title": "Victims of Umpqua shooting named", "dct": "Thu, 01 Oct 2015 00:00:00 GMT", "id": "9896451b7f8f9ba96bf5cd93bd16ae01", "content": "UPDATE at 2:56 p.m.\nThe Oregon community college where nine people were shot and killed has canceled classes for all of next week.\nAuthorities on Friday identified the nine victims as 19-year-old Lucero Alcaraz, of Roseburg; 18-year-old Quinn Glen Cooper, of Roseburg; 59-year-old Kim Saltmarsh Dietz, of Roseburg; 18-year-old Lucas Eibel, of Roseburg; 67-year-old teacher Lawrence Levine, of Glide; Jason Dale Johnson, of Winston; 18-year-old Rebecka Ann Carnes, of Myrtle Creek; 44-year-old Sarena Dawn Moore, of Myrtle Creek; and 20-year-old Treven Taylor Anspach, of Sutherlin.\nA statement from Eibel's family says he volunteered at a wildlife center and animal shelter. He was studying chemistry and loved to play soccer.\nCooper's family says he was funny and compassionate and loved dancing and voice acting.\nA statement from Johnson's family says he was a Christian and recently enrolled in school.\n——\nUPDATE at 2:50 p.m.\nThe victims of the deadly Oregon college shooting ranged in age from 18 to 67 and included several freshman students and a teacher.\nAuthorities released the names, ages and brief biographical information about the nine people who died at a Friday news conference.\nThe victims included a freshman who was active in Future Farmers of America and loved to play soccer. Another was an 18-year-old who graduated from high school in June and was in his fourth day of college.\nYet another was a 34-year-old who was proud of himself for recently enrolling at Umpqua Community College.\nDouglas County Sheriff John Hanlin also clarified Friday that nine people were injured in the shooting.\n——\nUPDATE at 10:35 a.m.\nDouglas County Sheriff John Hanlin said during a press conference Friday morning that victim identifications have not yet been made pending notification of families. Celinez Nunez, an agent from the Bureau of Alcohol, Tobacco, Firearms and Explosives, said thirteen weapons in total were recovered. The suspect had six weapons at the school while an additional seven were found in his home.\nHanlin believed the victim's identities would be shared later Friday. The college campus was expected to be reopened next week but details are still uncertain.\n——\nUPDATE at 6:08 a.m.\nOfficials from Mercy Medical Center, the Roseburg hospital, report that of the ten individuals brought to the hospital one is still in critical condition, one died during surgery, three were transferred to facilities with higher levels of care and the others were either released or are in stable condition.\n——\nROSEBURG, Ore. — Ten people were killed and another seven injured Thursday after a 26-year-old gunman opened fire in a classroom at a community college here in southern Oregon.\nDouglas County Sheriff John Hanlin said the gunman was shot and killed during an exchange of gunfire with officers at Umpqua Community College. Hanlin refused to name the killer, saying, \"I will not give him the credit he probably sought prior to this horrific and cowardly act. You will never hear me mention his name.\"\nA federal law enforcement source identified the gunman as a local Oregon man, Chris Mercer. The official said Mercer was armed with up to four firearms, including one rifle. Investigators were interviewing his mother to try and determine what caused his rampage.\nAuthorities were investigating whether Mercer, who is believed to have some connection to the school, specifically targeted victims, rather than engaging in random gunfire.\nThe attack — the fourth shooting at a U.S. college campus since August — prompted a visibly angry President Obama to note that the USA is \"the only advanced country on earth that sees these kinds of mass shootings every few months.\"\nSpeaking from the White House, Obama said the gunman was clearly troubled, but said, \"It cannot be this easy for somebody who wants to inflict harm on other people to get his or her hands on a gun.\"\nObama vowed to continue pushing new gun policies that he said would prevent further mass shootings.\n\"Each time this happens, I'm going to bring this up,\" he said.\nMercy Medical Center in Roseburg said on its Facebook page that it received a total of 10 patients from the shooting. The conditions of patients weren't disclosed. PeaceHealth Sacred Heart Medical Center in Springfield, about an hour north, said on its Facebook page that it received three patients and could get more. Both hospitals were holding blood drives on Friday.\nRoseburg Police Sgt. Aaron Dunbar told USA TODAY that the incident was contained to one classroom on the sprawling campus.\nHannah Miles, 19, was in her fourth day of college Thursday, attending a writing class, when a loud noise came from the classroom next door. It sounded like a ruler hitting a blackboard, she said.\nWhen two more loud noises came from the room, Miles' teacher, Amy Fair, opened the door between the classrooms to see if everything was OK.\nIt wasn't. Fair turned back to the class and immediately hustled them outside. As they ran down the hall to leave the building, Fair banged on classroom doors and yelled for everyone to leave right away, Miles said.\nOnce outside, the class ran to the school bookstore, locked themselves into a back room and called police, Miles said.\nMiles' mother, meanwhile, was at work as a respiratory therapy nurse at nearby Mercy Medical Center. Sandy Miles heard about the shootings and, knowing her daughter was at the school, began to worry. But then patients from Umpqua Community College began arriving and she kicked into action.\n\"All I could think was, 'This could be my daughter,'\" Sandy Miles said.\nSandy's husband was able to call her and let her know that Hannah was safe. Like others, Hannah was bused off campus to the Douglas County Fairgrounds.\nAccording to The Oregonian/oregonlive.com, a 911 call came in at 10:37 a.m. local time.\n\"UCC this is going to be the Snyder hall,\": the caller said. \"The ... somebody is outside one of the doors shooting through the door there is a female in the computer lab. We do have one female that has been shot at this time. We're still (incomprehensible) to get further.\"\nUmqua Community College English Professor Jillanne Michell said the shooting erupted in Snyder Hall, apparently in a writing and speech class,oregonlive.com reports.\n\"That is the building where the shooting did take place,\" she said, adding that it's possible additional shots were fired elsewhere. \"I heard the shots,\" said Michell, who was in Snyder Hall at the time. \"It was a lot.\"\nJared Norman, a nursing student at UCC, toldThe (Roseburg) News-Review that he heard shots \"and then everyone was running.\"\nHe was initially locked down in a cafeteria with 50 other students. \"They've heard there is a shooting, but they don't know what's going on. And they're scared,\" he said.\n\"We locked our door and I went out to lock up the rest rooms and could hear four shots from the front of campus,\" UCC Foundation Executive Director Dennis O'Neill told the newspaper.\nThe News-Reviewalso reported that an automated phone call went out to parents at Roseburg School District at 11:42 a.m. PT, informing them of the shooting.\nSara Mattison, a reporter for KVAL television, said she could see a female student covered in blood get into a car and leave the campus. Mattison also saw parents crying and looking for their children at the campus.\nShortly after the gunfire broke out, Kayla Marie, a music student at the school, tweeted: \"Students are running everywhere. Holy God.\"\nLorie Andrews, 57, who lives across the street from the campus, said she heard several shots while sitting on her back porch, oregonlive.com reports. She estimated that some 20 ambulances and 75 police vehicles responded to the incident.\nSix Life Flight helicopters were dispatched to help the victims.\nThe school was placed on lockdown while police went building to building. Students eventually were allowed to leave, but were not permitted to take their own cars. \"Everybody is in shock. Very very shocked,\" Andrews said.\nSean Clark, a spokesman for Roseburg Health Care System, told KATU television that the hospital called in extra doctors and other staffers from other shifts to care for wounded in the attack.\nThe federal Bureau of Alcohol, Tobacco, Firearms and Explosives tweeted that it had special agents at the college and was sending additional agents, as well as a K-9 team, to the scene. Officers from the federal Department of Homeland Security were also sent to the college.\n\"While it is still too early to know all of the facts, I know I am joined by my fellow Oregonians and Americans in profound dismay and heartbreak at this tragedy,\" Oregon Gov. Kate Brown told reporters before leaving for Roseburg. She offered few details about the massacre except to say that the male shooter was 20 years old.\nThe White House said President Obama was briefed on the situation by his Homeland Security Adviser Lisa Monaco. He was to continue receiving updates throughout the day.\nThe college, 6 miles north of Roseburg, Ore., normally has 3,000 full-time students and 16,000 part-timers. Authorities quickly spread the word and called on residents and students not to go to the campus.\nUmpqua Community College was established in 1964, has 16 buildings, and the campus includes a track, tennis courts, an outdoor pool and a vineyard.\nThe 100-acre campus is situated on verdant pasture along the North Umpqua River. In 2010, the school started construction on a $6.7 million viticulture building that now houses the Southern Oregon Wine Institute, which is a state of the art wine production and teaching facility.\nSarah Cobb, 17, was in the classroom next to the shooter. Her family hunts, so she knew immediately what the noise was.\n\"I was one of the first out the door,\" she said. As she ran, she warned people milling about on campus. Cobb said she kept her head until she was safely locked in the student center. Then she broke down.\nBy the time she arrived at the fairgrounds, she had regained her composure, and spent the rest of the day helping the Red Cross take names of people who had not yet been located.\nCobb's family moved to Roseburg from Eugene a couple months ago, and it was her first week of college.\n\"I don't even know what to think,\" she said. \"I'm terrified. I don't want to go back there for a long time.\"\nThe shootings are the first mass killings — an incident in which four or more people die, excluding the suspect — on a school campus this year, according to USA TODAY's database of mass killings since 2006. On Oct. 24, 2014, Jaylen Fryberg, 15, shot five students, four of them fatally, at Marysville-Pilchuck High School in Marysville, Wash., before dying at the scene of a self-inflicted gunshot wound.\nHanlin, the Douglas County sheriff overseeing the investigation, has been vocal in opposing state and federal gun-control legislation.\nHanlin registered his opposition this year as state lawmakers considered requiring background checks on private, person-to-person gun sales.\nHanlin told a legislative committee in March that a background-check mandate wouldn't prevent criminals from getting firearms.\nHe said the state should combat gun violence by cracking down on convicted criminals found with guns, and by addressing people with unmanaged mental health issues.\nHanlin also sent a letter to Vice President Joe Biden in 2013, after the shooting at a Newtown, Connecticut, elementary school.\nHanlin said he and his deputies would refuse to enforce new gun-control restrictions \"offending the constitutional rights of my citizens.\"\nContributing: Aamer Madhani, Kevin Johnson, Bart Jansen, and Greg Toppo, USA TODAY, Associated Press"}