{"uri": "http://ktla.com/2016/02/23/man-23-arrested-in-shooting-death-of-1-year-old-compton-girl/", "title": "Man, 23, Arrested in Shooting Death of 1-Year-Old Compton Girl", "dct": "Tue, 23 Feb 2016 23:00:00 GMT", "id": "4011669bb658deedee9d4095a789dcb5", "content": "You need to have the Adobe Flash Player to view this content. Please click here to continue.\nA 23-year-old man has been arrested on suspicion of murder in the fatal shooting of a 1-year-old girl who was struck by gunfire in her crib at a Compton home, authorities said Tuesday.\nRay Howard Patterson was arrested about 2:30 p.m. Monday in the area of Bullis Road and Rosecrans Avenue in Compton, according to a news release from the Los Angeles County Sheriff's Department.\nPatterson is suspected of being the gunman who shot Autumn Johnson about 7 p.m. Feb. 9 at her home in the 300 block of North Holly Avenue. Responding deputies found the child's father holding her, crying.\nBefore paramedics arrived, the two deputies rushed the girl to the hospital, where she was pronounced dead. Her funeral was Saturday, Feb. 20. She had turned 1 about a week before she was killed.\nThe baby's grandparents said they were relieved by the arrest of Patterson, who lives near the site of the shooting. They said they do not know the suspect.\n\"This shows a lot of forward progress for the sheriffs out here,\" said grandfather Jeffrey Wandick. \"There's a lot of ... unsolved homicides out here that just get swept under.\"\nA sheriff’s lieutenant said it appeared the shooting was gang-related, and that the gunman was targeting someone who lived in the converted garage where Autumn was shot.\nTwo black men were seen fleeing in a blue Chevrolet Impala, investigators said.\nThe Sheriff's Department said detectives were continuing to look for \"additional evidence and suspects.\"\nInmate records indicated Patterson was being held in downtown Los Angeles without bail and was due in court for arraignment on Wednesday.\nA $75,000 reward was offered in the case."}