{"uri": "http://www.theadvocate.com/baton_rouge/news/crime_police/article_afa3af80-b4fd-11e6-86ea-5fc86837b8ba.html", "title": "More details emerge Monday from deadly Essen Lane shooting; victim, alleged gunman identified", "dct": "Sun, 27 Nov 2016 18:00:00 GMT", "id": "1bc821d3b33359a4bd685ccf1170a2eb", "content": "Latest: The 17-year-old EMT trainee who stopped to help a woman who had been shot and tossed from a vehicle was first hit by the gunman, Terrell Walker, and then shot as Walker attempted to flee the scene on foot, the East Baton Rouge Parish Sheriff's Office reported.\nWalker was driving a dark-colored Chevrolet Malibu when he shot his live-in girlfriend, 30-year-old April Peck. A passing EMS vehicle was flagged down prior to the arrival by deputies. A doctor, who had also stopped, and the 17-year-old EMT trainee both attempted to help the woman when Walker turned around and drove back to the scene.\nBoth the doctor and EMT trainee were injured when Walker returned to the scene. The Sheriff's Office reported that both were injured and taken to a hospital and are expected to recover from their injuries.\nUpdated, 9:20 a.m.: The woman killed in a shooting in Essen Lane that began a violent few hours was identified this morning as 30-year-old April Peck, said Dr. William \"Beau\" Clark, the East Baton Rouge Parish coroner.\nHer alleged killer, who died after a gunfight with sheriff's deputies hours later, was 48-year-old Terrell Walker, Clark said.\nAutopsies for both are scheduled for tomorrow.\nOriginal story:\nA woman's fatal shooting on Essen Lane followed by a rampage against by-standers and paramedics by a 48-year-old man Sunday evening ended hours later in the gunman's death after a shootout with sheriff's deputies.\nTwo deputies confronted the suspected gunman, who'd fled from the scene of the slaying earlier on United Plaza Boulevard at Essen Lane, as he walked near the Bluebonnet Boulevard exit off Interstate 10 just before 9 p.m., said Maj. Bryan White, chief of detectives for the East Baton Rouge Parish Sheriff's Office.\nWhen the deputies demanded he show his hands, he fired several rounds at them, but did not hit them, White said. Deputies returned fire, and the fatally injured man fled into a wooded area off Bluebonnet Boulevard near the eastbound exit of Interstate 10.\nThe suspect — whose identity wasn't released Sunday night — was apprehended and taken away in an ambulance but died en route to the hospital.\nThe alleged shooter's death brought to a close a frantic search that began with a pair of shootings about two miles away on Essen Lane.\nTrouble viewing video? Click here.\nTo view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nAround 5:30 p.m. Sunday, the same man shot a woman and threw her out of his car into the roadway at Essen Lane and United Plaza Boulevard, White said, before driving off.\nAs sheriff's deputies were still making their way to the scene, a handful of passers-by — including a local physician and a 17-year-old training to be an emergency medical technician — stopped to help the mortally wounded woman, White said. An East Baton Rouge EMS ambulance crew also arrived to try to save her.\nBut then the shooter returned, running over two of the by-standers, including the 17-year-old, before stepping from his vehicle and opening fire, wounding one, White said.\nThe gunman then drove off, crashing into the ambulance as he fled.\nThe bystander wounded in the shooting and one of those run over were taken to the hospital Sunday for treatment but are expected to survive their injuries. The woman, fatally wounded in the shooting, was pronounced dead shortly after being rushed from the scene.\nJust what led up to the woman's shooting Sunday evening remains under investigation, White said. The chief detective, speaking late Sunday night on the side of Interstate 10 near the spot where deputies killed the shooter, said he didn't grasp yet what led the gunman to return and attack those trying to save her.\nDistrict Attorney Hillar Moore III, standing alongside White, described the woman slain Sunday evening as in her 30s and said she knew her killer. The district attorney, though, declined to discuss the nature of their relationship.\nWhite said deputies tracked down the suspected shooter after identifying him from prior reports from both the Sheriff's Office and city police.\nAuthorities said her name and the name of the gunman are being withheld until next-of-kin are notified.\n\"It's unfortunate that it turned out this way,\" Moore said, \"but it was a dangerous situation that the Sheriff's Office encountered.\"\nTrouble viewing video? Click here.\nTo view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nUnder a standing agreement with the Sheriff's Office, the Louisiana State Police will handle the investigation of the shooting of the suspect. State Police are routinely called in to investigate officer-involved shootings involving sheriff's deputies.\nCol. Mike Edmonson, the State Police superintendent, said his detectives would be working well into the night to process the shooting scene along the eastbound exit ramp and would interview the deputies involved in the fatal shootout in the coming days. A final report on the shooting will be turned over to Moore, whose office will make a final determination on whether the shooting was legally justified.\nSeveral dozen of patrol cars surrounded both crime scenes as officers combed the areas for evidence. On Essen Lane, where city police shut down the northbound lanes north of the interstate, the yellow crime scene tape snaked around an ambulance with its back door wide open, a stretcher on the ground nearby and medical supplies strewn about on the ground."}