{"uri": "https://www.flashalert.net/news.html?id=1402", "title": "String of car burglaries in Mountain home", "dct": "Thu, 12 Jan 2017 00:00:00 GMT", "id": "8ed328ea687d8aea0b87dfa45a207253", "content": "Subscribe to receive FlashAlert messages from Mountain Home Police. Please use any browser other than Internet Explorer.\n- 01/12/17\nFOR IMMEDIATE RELEASE\nOur community has had a string of vehicle burglaries on the northeast side of town in the last couple of days. The burglars are taking the easy route and it is suspected they are targeting unlocked cars in the middle of the night that are parked on the streets and in driveways. Police are conducting extra patrols in the neighborhoods and stopping to talk to any persons walking around at night in an attempt to stop the burglaries from occurring. Don't become a victim of opportunity. Take your valuables inside and lock the doors to your vehicles. Please be vigilant and report all suspicious activity. We are asking the public to report all vehicle burglaries, even if there wasn't anything stolen. This will help us with our investigation. Please contact our dispatch center at 208-587-2100 if you have any information pertaining to this case, or contact Detective Mack Saterfield at 208-587-9637 ext 1220.\nPolice Chief honors officer with distinguished medal of valor (Photo) - 01/10/17\nOn Monday, January 9, 2017 at 6:00 PM, Mountain Home Police Chief Nick Schilz awarded the Medal of Valor to Sergeant Russell Griggs at the City Council meeting that took place at the Elks Lodge located at 325 South 3rd West, in Mountain Home, Idaho. The Medal of Valor recognizes acts of personal valor or heroism in the delivery of exceptional courage, regardless of personal safety, which results in the saving of a life under extreme conditions and in extraordinary circumstances. Sergeant Griggs and Officer Brian Thomas entered a burning home full of smoke with the basement engulfed in flames on Monday, September 12, 2016, and saved the life of an elderly woman who was asleep in the back bedroom. Officer Thomas received a Medal of Valor at a previous function due to having moved to another police department in another state. In addition, there were other officers that received Lifesaving Awards for different incidents. \"In this line of work, courageous acts can be part of one's daily duties, these Officers set themselves apart through deeds of incredible self-sacrifice and were therefore recognized for their distinguished service\" Chief, Nick Schilz.##\nAttached Media Files: griggsmedal.jpg"}