{"uri": "http://kstp.com/news/south-minneapolis-fatal-shooting-11th-avenue-26th-street-stewart-park/4290426/", "title": "Teen Charged with Murder in Shooting Deaths of Baby, Man in Minneapolis", "dct": "Thu, 13 Oct 2016 19:57:00 GMT", "id": "7cb6129ed8aa3597da3669edd45f08be", "content": "A 17-year-old boy has been charged as an adult with four counts of first-degree murder in the shooting that killed a baby and a 20-year-old man in South Minneapolis on Sunday.\nJquan LeeArthur McInnis of Minneapolis has been charged with two counts of premeditated murder and two counts of drive-by shooting, Hennepin County Attorney Mike Freeman announced at an afternoon news conference Thursday. Even though he's a juvenile, the charges were filed in adult court and he will be treated as an adult at trial because he had a previous certification as an adult for attempted first-degree robbery, Freeman said.\nEight-month-old Jayden Eric Redden and 20-year-old Gustav Duane Christianson II were shot while sitting in the back seat of a parked car. Christianson died at the scene. Jayden died at nearby Children's Hospital.\nRecords show McInnis was driving when he saw Christianson, got out of his car and shot him. The complaint filed Thursday in Hennepin County District court says McInnis told police he didn't know Jayden was in the car.\nFreeman said the shooting may have been the result of a dispute over an unpaid debt. Witnesses had reported seeing McInnis arguing with Christianson before the shooting. Based on information at this time, Freeman said the shooting does not appear to be gang related.\nAfter being read his rights, McInnis has confessed, Freeman said at the news conference.\nIt wasn't immediately clear if McInnis has an attorney.\nFreeman said his office is seeking $1 million bail for McInnis and the case will be brought to a grand jury, which must be done for first-degree murder charges. Prosecutors will also seek a sentence of at least 30 years.\nKSTP's Todd Wilson's stopped over at McInnis' grandmother's house who is his legal guardian. She's sad about the death of eight month Jayden Redden.\n\"It's very disturbing rather it was him or someone else it's very disturbing,\" she said.\nShe doesn't believe he did this on his own.\n\"I don't think he was the shooter, maybe he was with them,\" she said.\nRELATED CONTENT: Raw Video of Hennepin County Mike Freeman's Full Press Conference\nThe Associated Press contributed to this report."}