{"uri": "http://www.ketv.com/news/man-wanted-in-double-homicide-turns-himself-in/36852730", "title": "Dontevous Loyd turns himself in Tuesday morning", "dct": "Wed, 09 Dec 2015 00:21:00 GMT", "id": "d9952e04febac5b3060b4743fce05d76", "content": "OMAHA. Neb. —\nAn autopsy conducted on the woman killed in Sunday night's shooting determined she wasn't pregnant, according to a release from the Omaha Police Department.\nAutopsies were performance on Destacia Straughn, 22 and her daughter, Kenacia Amerson-Straughn, 2, according to the release. The finding means the man accused in the crime, Dontevous Loyd, will not face additional charges.\nLoyd turned himself into police Tuesday around 5:30 a.m. and will appear in court later this week.\n\"He took a little bit of relief, a little bit of pressure, a little bit of stress off people knowing he turned himself in,\" said Michael Roby, the father of Kachelle Roby, who was injured in the shooting. \"But at the end of the day, there are still people out there that might want to do something else.\"\nLoyd posted a photo (below) of himself at the Douglas County Jail on his personal Facebook page with the caption \"im here.\"\nAuthorities handcuffed Loyd and took him to police headquarters for questioning shortly after.\nPolice believe Loyd shot and killed Destacia Straughn and her daughter, Kenacia Amerson-Straughn.\nStacey Straughn, the mother of Destacia, said on a phone interview that she is glad he's (Loyd) in custody. She said that there's a lot of sadness in her home.\nThe shootings happened in an apartment near 108th and Ida streets just after 11 p.m. Sunday.\nThree others were also shot and left in critical condition. Police identified them as Kachelle Roby, 22, Jamie Latner, 18, and Larrion Williams, 21.\n\"It's not right, senseless,\" Bill Hanes, the step-grandfather of Latner, said.\n\"What's wrong with you?\" asked Michael Roby. \"Why would you do something like that? You weren't in harm's way. They weren't jumping on you.\"\nMichael Roby said he knows Loyd.\n\"His nickname is Sleepy in the streets,\" Michael Roby said. \"I met Sleepy about three years ago. He showed no signs he could do something this horrific.\"\nKachelle Roby, a mother of two, was shot three times.\nWilliams is at Nebraska Medicine, and her condition will not be released.\nLatner could be going home soon.\n\"The bullet did go through all the way, and she is in pain,\" Hanes said.\nHanes said his step-granddaughter and the other women went to the apartment near 108th and Ida because their friend felt something bad was about to happen.\n\"Just went because the girl called, 'Please come over. I'm scared,' so they went,\" Hanes said. \"When a friend calls you, try to help. I hope he never sees the light of day again.\"\nKETV NewsWatch 7's attempts to reach Williams' family were unsuccessful. The families of the other survivors said they're praying for Destacia Straughn's loved ones, and hope anyone who knows anything about the case will speak up."}