{"uri": "http://www.chieftain.com/news/crime/4300952-120/trinidad-police-investigation-station", "title": "Boy, 9, accidentally shot in the head in Trinidad", "dct": "Tue, 05 Jan 2016 00:00:00 GMT", "id": "b8f1e53b0774f416ce22eb74f2a00213", "content": "TRINIDAD — A 9-year-old boy was accidentally shot in the head in Trinidad on Monday after he and his brother found and handled a loaded handgun while inside of a parked car.\nThe Trinidad Police Department communications center received a call around noon that a male was injured and needed medical attention at the Sparks Natural Gas station near a Shell station on Goddard Street.\nPersonnel from the Trinidad Ambulance District and Trinidad Fire Department arrived on scene and determined that the injured male was a 9-year-old child who had sustained a gunshot wound to the head, according to police.\nOfficers with Trinidad police then took over the scene and the Colorado Bureau of Investigation was called to assist in the investigation.\nDue to the age of the children involved, forensic interviewers from the Pueblo Police Department also assisted.\nUpon further investigation, officers learned that the 9-year-old victim had been inside a parked vehicle with his 8-year-old brother at the Shell station. The two boys found a loaded gun in the vehicle and the gun was discharged while it was handled, and a bullet struck the 9-year-old boy in the head.\nThe victim was transported to Mt. San Rafael Hospital and then flown via Flight for Life to Denver Children’s Hospital. He underwent surgery and is in critical condition.\nPolice said the two boys were in the care of family friend James Howard, 63, of Trinidad, while the boys’ parents attended a medical appointment. Howard is an employee of the Sparks Natural Gas station and was working on a pump at the time of the incident.\nNo arrests have been made at this time, according to police. Once the investigation is complete, it will be reviewed by the district attorney to determine what charges, if any, will be filed."}