{"uri": "http://www.goerie.com/news/20161223/police-id-man-who-shot-self-after-slipping-on-ice", "title": "Police ID man who shot self after slipping on ice", "dct": "Sat, 28 Jan 2017 17:46:00 GMT", "id": "e1208ed9e440c249afb5603922528a90", "content": "Erie police charge that the subject of a suspicious-person investigation at an eastside public housing complex on Friday morning pulled a gun from his waistband while being chased by an officer and fired it, sending a bullet into his own chest, when he either tripped or slipped on some ice.\nLawrence Anderson, 38, of Erie, was recovering at UPMC Hamot on Friday afternoon after undergoing surgery following the shooting. He was in custody at the hospital, under police guard, and will face a series of criminal charges in the incident, Erie police Inspector Matthew Fischer said. The charges include attempted homicide and attempted aggravated assault, Fischer said.\nPolice charge that Anderson accidentally shot himself as he fled from a city police officer who responded to the 2000 block of East Seventh Street, between Tacoma Road and Franklin Avenue in the John E. Horan Garden Apartments housing complex, at about 5:30 a.m. Friday. Police were called there to investigate a report of a suspicious male, Fischer said.\nA city police officer who responded to the call arrived in the neighborhood and saw Anderson. The officer tried to call Anderson over to the officer's police cruiser, but Anderson refused and took off running, according to Fischer.\nThe officer began chasing Anderson and shot his Taser at him in an effort to stop him, but the Taser had no effect because of the winter clothing Anderson was wearing, Fischer said.\nThe officer chased Anderson for about two blocks before Anderson turned around and pulled out a gun. The weapon fired, shooting Anderson in the chest, when he tripped, according to investigators.\nAnderson was rushed to the hospital after the shooting. The officer was not injured.\nPolice recovered the gun at the scene.\nIt was unfortunate that Anderson was shot in the incident, but it was good that the officer wasn't injured, Erie police Deputy Chief Greg Baney said Friday.\n\"You have to be prepared for anything,\" Baney said, adding that the officer \"handled the situation very well.\"\nTim Hahn can be reached at 870-1731 or by email. Follow him on Twitter at twitter.com/ETNhahn."}