{"uri": "http://www.kake.com/story/32190039/autopsy-on-hesston-gunman-released", "title": "Autopsy: Hesston gunman had meth, alcohol in system", "dct": "Fri, 10 Jun 2016 03:15:00 GMT", "id": "1d8a375a1fafb35098050101dd89dd71", "content": "WICHITA, Kan. (KAKE) -\nAn autopsy shows a man who went on a shooting spree at Excel Industries in Hesston was high on meth and drunk.\nA coroner's report obtained by KAKE News Thursday shows Cedric Ford had more than 135 times the standard dose of methamphetamine and three times the legal limit of alcohol in his system, before being gunned down by the Hesston police chief in February, Ford died from four gunshot wounds.\nFord went on a shooting spree, killing three people at the plant where he worked. He had been served a protection order at Excel hours before the attack.\nThe woman accused of transferring guns used in the Excel Industries shooting spree has pleaded not guilty.\nSarah Hopkins, 28, is charged with knowingly transferring weapons to a convicted felon. Court documents show she and Cedric Ford had a past relationship. She faces up to ten years in prison and a $250,000 fine if convicted.\nTimeline of shooting spree:\nAt 3:30 p.m., the gunman, identified as 38-year-old Cedric Ford, was served a protection from abuse order filed by his ex-girlfriend. This happened in Newton, where Ford lived.\nAt around 5 p.m., dispatchers received a report of a shooting at 12th and Meridian in Newton. Sheriff Walton said a man driving with two children was shot in the shoulder. The gunman fired at a second vehicle, nearly missing the woman who was driving. The bullet went through her windshield. Walton said Newton police and Harvey County deputies responded withing three minutes.\nWhile officers were responding to the first shootings, another shooting happened on Highway 81 near Northeast 36th Street. Walton said Cedric Ford had driven into oncoming traffic. His vehicle and an oncoming vehicle went into a ditch and stopped. As Ford and the other driver exited their vehicles, Ford shot the driver. Walton said for then took the victim's vehicle and drove to Excel Industries in Hesston, his place of employment.\nThe gunman entered on the northeast side of Excel and shot one person in the parking lot, Walton said. A sheriff's deputy pulled into the parking lot and reported being fired upon. Ford then entered the building where he shot 14 people, three of them fatally.\nHesston Police Chief Doug Schroeder responded and entered the building where the shootings occurred. Schroeder encountered Ford and the two exchanged gunfire. The officer shot and killed Ford at 5:23 p.m.\nWalton said Ford was armed with \"an assault rifle and an automatic pistol.\""}