{"uri": "http://kwqc.com/2016/02/25/shooting-reported-at-excel-industries-in-hesston/", "title": "Up to 4 dead, 20 injured in shooting at Excel Industries in Hesston, Kansas", "dct": "Thu, 25 Feb 2016 17:38:00 GMT", "id": "6ec96a7aec54f5c06a7a7892b3dc350d", "content": "HESSTON, Kan. – Law enforcement officers responded to the scene of a workplace shooting at Excel Industries in Hesston Thursday afternoon with reports of multiple fatalities and people wounded. The incident began about 4:40 p.m.\nHarvey County Sheriff T. Walton confirmed up to 4 people were dead and as many as 20 others injured. One of those killed, Walton said, was the shooter, an Excel employee.\nQuotes from Sheriff Walton:\n“As officers were responding to that we had further reports coming in of a shooting at Meridian and Hesston Road. As other officers were responding to that we had a report of an active shooter inside Excel here in Hesston.”\n“As of now there is a lot of things going on. There are known deaths in regards to these shootings. There are a lot of shot victims.”\n“The shooter himself has been shot and killed. He is an Excel employee.”\n“We know the shooter is down. There could be as many as three to four others and possibly up to 20 people who have been injured.”\n“There are numerous crime scenes involved here, and we have a team of KBI coming in, the FBI coming in, we’ve got all the local law enforcement here and this will take some time to work through this. There are so many crime scenes and so many people.”\n“We want to get the people that are so concerned that their loved ones have been shot or hurt. We want to get everybody identified. We are working on that. We want to get that information out as soon as we can. I understand how hard it is for everybody else.”\n“I don’t know that I can answer a lot of questions at this time. I don’t have a lot of answers.”\n“We will come back at 9:00 with where we’re at with the investigation.”\n“This is just a horrible incident that has happened here,” said Walton.\nWalton said the lock-downs in the Hesston area have been lifted.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nVia Christi reports there are a total of six victims, some of them arriving by helicopters from Hesston. Earlier, Via Christi officials reported two victims were in serious condition, one was in fair condition, one was still being assessed, and two others were en route from Hesston.\nA manager at the plant told KSN when gunfire broke out, the first action was to get the doors open and get employees out of the building.\nMarguerite Weaver works at grocery store near the plant. She reports that her father-in-law works at the plant and she hasn’t heard from him yet. She was advised to lock down the store.\nMarguerite told us that Excel was a wonderful company in the community. “I am completely blown away. I thought it was a lie,” said Weaver.\nA worker named Dillon was at the plant unloading palettes when he heard the gunshots. He thought at first it was just noise, then someone told them there was someone shooting in the front of the plant.\n“We were out back unloading the palettes and we heard a pop, pop”, said Dillon.\nA plant employee named Donna said her husband reported seeing the shooter. She said she had not received any training to deal with a shooter situation like the one at her plant. She told KSN when she left the building she immediately ran to her truck. “I didn’t even buckle my seat belt I was so scared,” Donna said.\nWe talked to a woman who drove to Hesston from Valley Center, concerned about her daughter that was working second shift at the plant. Her daughter had called and told her there was a shooting and she was taking cover.\nDonna said she saw the gunman and that he had a dark complexion and was wearing a muscle shirt.\nEmployees were asked to stay in the area of the plant so officials could get a head count.\nKSN Chief Photojournalist Scott Dietz reports as he was driving to Hesston there were three ambulances headed toward Wichita. Sedgwick County Emergency Medical Services is sending three ambulances to Hesston to assist authorities there.\nExcel manufactures lawn care products including riding lawnmowers. The business has been in Hesston since the early 1960s.\nMAP OF MULTIPLE CRIME SCENES\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}