{"uri": "http://www.kansas.com/news/local/crime/article62604937.html", "title": "Hesston co-workers describe scene of shooting at Excel Industries", "dct": "Thu, 25 Feb 2016 23:28:00 GMT", "id": "ca7ea80c128141cd8246d1319a489d56", "content": "Two paint-line employees at Hesston’s Excel Industries say they saw Cedric Ford, another paint-line worker, fire off rounds from an assault weapon Thursday.\nMatt Jarrell, of Hesston, said Ford was his partner at work, meaning they worked at the same post. He said he considered Ford a close friend.\nThe two arrived in the Excel parking lot at the same time Thursday, around 2:05 p.m.\nFord hopped out of his truck to talk to him and threw a peace sign at him, Jarrell said.\n“He said, ‘How you doin’ bro? How you feelin’?’ And I was like ‘I’m good,’” he said. “Everything was totally normal.”\nFord had bought a truck from Jarrell’s neighbor a week before and drove the truck to work for the first time Thursday, Jarrell said.\n“He was happy as all could be,” he said.\nFord told him he couldn’t get the tag off the truck, so they talked about taking it off later that day.\n“I’m in shock. I mean, we had a normal conversation. I was gonna help the man out this afternoon,” he said.\nfacebook twitter email Share\nVIDEO: Excel employee describes saving co-worker during mass shooting\nExcel employee Jacob Hershberger describes being in the building in Hesston, Kansas, where a gunman started shooting. Hershberger saved a co-worker while fleeing for his life. (Video by Fernando Salazar)\nfsalazar@wichitaeagle.com\nWhen they went into work, Jarrell went to paint first and Ford planned to cover for him when he took his break. When break time came, Jarrell said he couldn’t find Ford anywhere, so another co-worker covered his break.\nJarrell went outside to sit in his pickup during his break. He said he saw Ford pull into the parking lot in a Dodge full-size pickup – not the truck Ford had just bought.\nHe said he saw him fire three shots outside and then enter the building.\n“He was strapped up with an assault rifle,” he said. “I saw casings fly out of the gun. It was like something out of the movies.”\nHe said he left immediately and called 911.\n“One of the gentlemen that got shot, he was the one that took me out of that spot minutes before,” Jarrell said.\nJarrell said he has a 12-day-old baby.\n“I left to break at 4:55 and it was probably 4:57 when he went in the parking lot and started shooting,” he said.\n‘Fire,’ ‘explosion’\nAlicia Sloan, a Newton woman who has worked at Excel for a year, said she and her boyfriend were working on the paint line when Ford came from Plant 4 to Plant 1, where she worked, through a tunnel.\nShe said co-workers started yelling “fire” and “explosion.” She heard 20 gunshots go off within a matter of seconds.\nShe ran for a door, ran outside and saw a friend bolting up over nearby railroad tracks.\n“He looked completely scared,” she said.\nSo she ran fast.\nWhen she got to the top of the railroad tracks, she saw Ford, who by then was outside shooting.\nShe looked over and saw one of her supervisors.\n“He was limping up the hill to get over the railroad tracks, and you could tell he was shot in the leg,” she said. “He got shot in the back twice while I was looking at him.”\nShe said she dropped below the railroad tracks because they provided cover.\n“The gunshots were coming and I was over that hill, so I could lay down and not get hit,” she said.\nOnce she felt like she could run, she said, she ran with her boyfriend and others to a mobile home park across the street.\n“I saw a friend I went to school with, and he was shot in the leg, and he was losing so much blood,” she said. “People were helping him onto the steps so he could sit down, and someone took a belt and tied it around (his leg) to get the pressure.”\nfacebook twitter email Share\nVIDEO: Witness describes being at Excel during mass shooting\nExcel employee Marty Pierce describes hearing the shots and running out of the building when a gunman started shooting people inside the building in Hesston, Kansas, on Thursday. (Video by Fernando Salazar)\nfsalazar@wichitaeagle.com\n‘I just keep crying’\nSloan said law enforcement officers came within four or five minutes and the ambulances arrived around five to 10 minutes after.\nTwo of her cousins also were working at Excel during the shooting. She found them both afterward.\nOne cousin is her supervisor. She said he tried to do a headcount of their team right away and announced that someone from their team had died.\n“That was confirmed right away,” she said. “He got shot in the head.”\nRepresentatives from the company and law enforcement directed employees to walk to the back of Plant 2 in an open area, she said. They gathered around and wrote down their names and clock-in numbers.\nShe said they were there for an hour and a half or two hours. Then a sheriff’s officer announced the plant would be closed the rest of the day and that no one could reenter to get keys, purses or any other belongings.\n“I don’t feel safe going anywhere,” she said. “I definitely didn’t even want to go back into the building. I just keep crying because I think about the guy that I’ve seen get shot.”\nfacebook twitter email Share\nVIDEO: Excel employee who witnessed shooting: 'I met today with a different embrace'\nExcel employee Ryan Bartel attended a candlelight vigil for victims of the Excel shooting in Hesston, Kansas, on Friday night. Bartel was in the Excel parking lot when the gunman arrived and started shooting.\ntheying@wichitaeagle.com\nfacebook twitter email Share\nVIDEO: 'He shot me four times'\nAdam Miller was shot twice in the chest and once in his arm and his leg during the mass shooting at Excel Industries in Hesston, Kansas. (Mike Hutmacher, The Wichita Eagle)\nmhutmacher@wichitaeagle.com\nfacebook twitter email Share\nVIDEO: Harvey County sheriff identifies those killed\nHarvey County Sheriff T. Walton gives his final news conference in connection to the shooting in Hesston that left 4 people, including the shooter, dead and more than a dozen injured. Walton gave the names of those killed Thursday afternoon by Cedric Ford. (Bo Rader/Kansas.com)\nbrader@wichitaeagle.com\nfacebook twitter email Share\nVIDEO: Excel employee Tim Kasper talks about shooting\nTim Kasper of Newton, an Excel Industries employee, was in the building when shooter Cedric Ford began his rampage Thursday in Hesston. (Bryan Horwath/Wichita Eagle)\nbhorwath@wichitaeagle.com\nfacebook twitter email Share\nVIDEO: Harvey County Sheriff updates shooting situation in Hesston\nHarvey County Sheriff T. Walton updates the media about the shooting that took place at Excel Industries in Hesston, Kansas, during a 9 p.m. briefing Thursday night. ( Video by Fernando Salazar)\nfsalazar@wichitaeagle.com\nGabriella Dunn: 316-268-6400, @gabriella_dunn"}