{"uri": "http://thepolicenews.net/default.aspx?act=Newsletter.aspx&category=News+1-2&newsletterid=63922&menugroup=Home", "title": "Toddler shot after finding gun in home", "dct": "NODATE", "id": "7bf13508ce2c8d3dedeb002236753f84", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nFORT WORTH, Texas - A Fort Worth toddler is in the hospital after police say he found a gun in his home and shot himself in the arm.\nPolice have not released the mother's name. They say she has been a victim of domestic violence in the past and purchased the gun for personal protection.\nPolice say the 3-year-old was wounded by a 9mm handgun. The investigation is still going, but it's believed the child's mother was keeping the gun under a pillow.\n“We really haven't had a lot of incidents where children are shooting themselves with guns. But it’s always searching through things they shouldn't,” said Fort Worth Police Officer Tamara Valle. “They are busy bodies always trying to find things to get into. And when they do and they find that gun, it's just a bad situation\nIt's still not clear how the gun went off, but the bullet hit child's left arm. He was taken to Cook Children's Medical Center and is expected to recover.\nSo far, police are investigating the shooting as an accident. There were other children who live in the house, but police say they were in school.\nPolice say the mother was home with the 3-year-old and an infant sibling. People who saw the toddler at the hospital say he was alert and seemed to be doing alright.\nThe mother told police she recently got the gun for home protection.\n“There really hasn't been an increase that I've noted,” said Valle. “But it's still wise to let people who have children in the house – if you have those weapons, just put them up. Don't let the children know where they are. Lock them up, and keep them safe.”\nComments:\nThey are making this sound like a no big deal. A child shot it's self w/ a gun that was not in a safe place away from children and no adult charges filed yet? Just stupid. Reckless and Child Endangerment charges ya think....? Parents..wake up. YOU WILL BE HELD ACCOUNTABLE in such cases Post a comment\nName/Nickname:\n(required)\nEmail Address: (must be a valid address)\n(will not be published or shared)\nComments: (plain text only)"}