{"uri": "http://www.southbendtribune.com/news/local/held-after-shooting-at-event-center/article_b95a82eb-adf8-5a60-8e4c-eadf6d7700d8.html", "title": "1 held after shooting at Mishawaka event center", "dct": "Thu, 11 Dec 2014 00:00:00 GMT", "id": "69c95a5a13b1e51523a3697714c6a635", "content": "MISHAWAKA — One man is charged with illegally carrying a handgun in connection with a shooting that injured four people after a party swelled to hundreds of people at an event center in southeastern St. Joseph County.\nRodney Taylor, 34, was arrested on a single count of being a serious violent felon in possession of a handgun after police responded to gunfire at the Oaks at Southpaw Farm, 16323 Roosevelt Road, early Sunday morning.\nCounty police were still working to identify possible suspects in the shooting, Lt. Matt Blank, a spokesman, said Wednesday. He said Taylor was part of the investigation, but it was unclear if he was suspected of taking part in the gunfire.\nThree of the victims were hospitalized with non-life-threatening injuries Sunday morning, and a fourth ran away from the scene of the shooting. None of the victims had provided police with information about possible shooters.\n\"We're getting very little cooperation,\" Blank said. \"This thing's kind of moving real slow at this point.\"\nTerrance Shorter, 22; Armond Davis, 21; and Brandon Burton, 21, were among those injured.\nPolice who responded to the shooting found a chaotic scene, as party-goers tried to run away before officers could secure the area. Police estimated about 500 people attended the event.\nBlank said management at the Oaks likely had no idea the party, which was originally billed as a much smaller event, would end in violence.\n\"I think they're more the victim here than anything,\" he said. \"I'm quite sure they had no idea\" the event would spiral out of control.\nThe Oaks is operated by a Christian organization called Point of Light Ministries, according to its website. The 77-acre property once belonged to former Major League Baseball pitcher Jamie Moyer, who converted the large barn into an 11,000-square-foot home. A reporter's call to the facility went unanswered Wednesday.\nAccording to court documents, the shooting Sunday broke out on the back deck of the house. Security guards may have also been involved in an altercation around the time the shooting broke out, according to the documents.\nPolice found Taylor in an upstairs bedroom. A black-and-silver handgun was allegedly found in his pocket. He previously served time in federal prison for his role in a bank robbery, the court documents said."}