{"uri": "http://www.chicagotribune.com/news/local/breaking/ct-bridgeport-murder-arrest-met-20160605-story.html", "title": "Boy sent Snapchat video admitting to killing friend: prosecutors", "dct": "Sun, 05 Jun 2016 19:26:00 GMT", "id": "2560abd57c5a6df160a2e81625cb7259", "content": "Christian Bandemer, of the 900 block of West 36th Street, was pronounced dead at the scene after being shot June 3, 2016, in the chest with a shotgun, according to police and the Cook County medical examiner's office.\n(Provided by family)\nA boy charged in the fatal shooting of a teenager in Bridgeport last week admitted to the killing in a Snapchat video sent from the back of a squad car after he was arrested, prosecutors said.\nAnthony Mendoza, 17, is charged with first-degree murder in the killing of his friend Christian Bandemer, 16, who was shot in the chest at 11:37 a.m. Friday in the 3500 block of South Parnell Avenue.\nPolice initially said the shooting might be accidental, as Bandemer was with a friend and a cousin who were showing him a shotgun before it went off.\nBut Assistant State's Attorney Anna Sedelmaier said in court Sunday that Mendoza should have known there was a strong possibility of killing someone with the gun, that he was the only one in the room with Bandemer when the gun went off and that he told the 20-year-old cousin “not to snitch” about the shooting.\nIn the court hearing Sunday, Judge Peggy Chiampas ordered Mendoza held in lieu of $250,000 bail, declining a prosecution request to hold him without bail.\nMendoza wore a blue, juvenile detention center T-shirt while prosecutors detailed how he was loading and unloading the shotgun with his friend. The cousin later told police that Mendoza was the only one in the room with Bandemer, and Mendoza was the one with the gun.\nAfter Bandemer’s cousin walked outside to smoke a cigarette, he heard a “pop.” The cousin returned to find Bandemer bleeding and began to apply pressure to the gunshot wound, Sedelmaier said.\nMendoza threw away the shotgun in high grass in front of an abandoned house, Sedelmaier said. “After about a minute, the defendant came back from hiding the gun and he has blood on him and asked the cousin what happened,” she said.\nPolice arrived and took Mendoza into custody. When he was put in the back of a police squad car, he posted a video on Snapchat, admitting to killing his friend.\n“I killed Chris and now I'm going to kill myself,” the defendant said, according to Sedelmaier.\nDefense attorney Mike Johnson characterized the shooting as an “accident,” adding that Mendoza had “no animosity toward” the victim.\n“What this is, is a tragedy. An absolute tragedy,” said Chiampas as she set bond, later saying there wasn't enough evidence to make her believe the shooting was intentional.\nAs a condition of bond, the judge ordered there be no firearms in the household.\nBefore the he was taken into custody, Mendoza, with slicked back hair and a furrowed brow, looked back into the gallery, where a small group of friends and family stood in the last row.\nTwitter @_tonybriscoe"}