{"uri": "http://www.timesreporter.com/article/20151127/NEWS/151129405", "title": "Boy, 5, accidentally shoots himself", "dct": "Sun, 29 Jan 2017 00:49:34 GMT", "id": "aa4fd6ad87ecdfc1e07af01680761cdd", "content": "A 5-year-old boy is expected to recover after shooting himself in the leg Thursday night with a handgun he found in an apartment he is living in with his mother and her boyfriend.\nA 5-year-old boy is expected to recover after shooting himself in the leg Thursday night with a handgun he found in an apartment he is living in with his mother and her boyfriend.\nThe boyfriend, 27-year-old Adam D. Bays, of Baltic, was arrested Thursday night and is being held in the Tuscarawas County Jail on child endangering charges.\nSheriff's Chief Deputy Orvis Campbell said deputies received a call at 6:55 p.m. Thursday night of an accidental shooting at the apartment complex at 102 Baltic Haus Drive.\nHe said the boy discovered a 9mm Ruger on a dresser, picked it up and unintentionally shot himself in his groin. The bullet passed through the boy's leg and came to rest under a dresser in a bedroom.\nThe boy was responsive with Sugarcreek EMS personnel and was flown to Akron Children's Hospital, where he underwent surgery Thursday night.\nCampbell said the boy is in good condition and is expected to recover from his injuries that caused minor damage.\nBays claimed the gun was locked up, but Campbell said there was no evidence of a lock to the gun cabinet and his story conflicts with how the boy said he was able to take possession of the gun. Deputies also seized multiple other guns from the apartment.\nCampbell said Bays has no known criminal record and has a conceal-carry permit issued out of Holmes County. The permit was confiscated and will be returned to the Holmes County Sheriff's Office.\nSheriff records show that in June while investigating an unrelated call, deputies discovered a loaded gun in the living room of the home and ordered Bays to lock it up.\nChildren Services was notified of the situation, and other children living in the home were given temporary placement with a relative. The agency also was made aware of unsanitary conditions in the apartment.\nBays likely will be held in jail until Monday, Campbell said, when a charge of third-degree felony child endangering is expected.\nReach Alex at 330-364-8314 or\nalex.knisely@timesreporter.com"}