{"uri": "http://www.fox46charlotte.com/news/local-news/144308968-story", "title": "Police: Sixth man charged in Shelby drive-by shooting", "dct": "Wed, 01 Jun 2016 12:45:00 GMT", "id": "0965e48c46a21fc56a9bda81102a2d62", "content": "SHELBY, NC (WJZY) - Six arrests have now been made in the drive-by shooting that injured 4-year-old Aryanna Odoms, according to Shelby Police.\nLance Neach Jackson, 26, and Robert Lee Strong, 22, appeared in Cleveland Co. district court on Tuesday, May 31, where they both received court appointed lawyers. Their next court date will be June 20.\nPolice charged Jackson and Strong with assault with a deadly weapon with intent to kill inflicting serious injury and discharging a firearm into an occupied property. They were both taken to the Cleveland County Jail where they were given $250,000 bonds.\nPolice say Aryanna was shot in a drive-by shooting in Shelby Monday night.\nPolice: Sixth man charged in Shelby drive-by shooting\nShelby police told FOX 46 Charlotte it happened around 11 p.m. Monday, May 23 at a home on the 1100 block of Toms Street.\nWitnesses said more than a dozen shots were fired into two different homes, one of them hitting the little girl in the left side of her body.\nThe girl was first taken to the hospital in their personal vehicle, then airlifted to Carolina's Health Care System Cleveland. Police said she is in stable condition.\nAnother nearby home was hit in the shooting. Aryanna's uncle described the scene, saying, \"It was a chaotic.\"\nAfter investigating and receiving tips in the community detectives were able to identify multiple suspects in the case.\nShelby Police said on Thursday Cameron Brett Shrader was arrested for obstruction of justice and accessory after the fact. He is currently being held in the Cleveland County Jail without bond. His first court appearance is set for Friday.\nPatrick Christopher Rucker was arrested for assault with a deadly weapon intent to kill inflicting serious injury and discharging a firearm into occupied property. He is being held in the Cleveland County Jail under a $250,000 bond and has his first appearance hearing on Friday, according to police.\nJulian Kyle Jackson and Marquise Santonio Beam were arrested and both charged with assault with a deadly weapon with intent to kill inflicting serious injury and discharging a firearm into occupied property.\nJackson and Beam had their first court appearance Thursday where they both received a secured bond of $250,000 each. They are being held in the Cleveland County Jail. Their next court appearance is scheduled for June 14.\nThis investigation is ongoing. If anyone in the community has information on this case please contact the Shelby Police Department at (704) 484-6845 or if you wish to remain anonymous you can call Crime Stoppers at (704) 481-8477.\nMother says, \"My baby's not supposed to be lying on that (hospital) bed. She's nothing but four (years old).\" pic.twitter.com/xBddPACTbi\n— Caroline Fountain (@FountainFox46) May 24, 2016"}