{"uri": "http://www.wsoctv.com/news/local/2-men-arrested-after-4-year-old-girl-shot-in-drive-by/304243393", "title": "4-year-old girl injured in drive-by shooting returns home", "dct": "Mon, 30 May 2016 09:35:00 GMT", "id": "38b5dcf491eda67d93a038c249ac0528", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nSHELBY, N.C. - Aryanna Odoms, 4, who was shot last Monday during a drive-by shooting in Shelby, is out of the hospital Sunday.\nPolice have since charged six men in the shooting on Toms Street.\nPolice told Channel 9 that the child was in the living room when someone drove by and fired several shots into her house and another home.\nPHOTOS: Girl, 4, injured in drive-by shooting returns home\nThe shooters may have been shooting at someone near the house and the house wasn’t the intended target, police said.\nPolice said 48 shots were fired from a semi-automatic weapon.\nAryanna’s grandmother Bridgette Smith said the bullet hit the girl’s side and got lodged in her intestine.\n“She said, ‘Maw-Maw, I got shot,’” Smith said.\nThat bullet has been removed but the girl is struggling with pain.\nAryanna is expected to be in the recovery room for weeks.\nTeam Trublue, a Charlotte community group, presented Aryanna with gifts Friday night to put a smile on the girl’s face.\n\"Every day something else is happening somewhere, horrific,” Will Adams of Team Trublue said. “And this little girl is in a hospital bed because somebody decided to take a gun and start shooting, and you shot through her home, you know, as if her life wasn't valuable.\"\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nCLICK HERE to read our original story\nOn Monday, police charged Julian Kyle Jackson, 24, and Marquise Santonio Beam, 24, in the case.\nBoth men are charged with assault with a deadly weapon with intent to kill inflicting serious injuries and discharging a firearm into an occupied property.\nPolice arrested Patrick Rucker, 25, and Cameron Shrader, 24 on Thursday.\nRucker is charged with assault with a deadly weapon with intent to kill inflicting serious injury and discharging a firearm into occupied property.\nOfficers charged Shrader with obstruction of justice and accessory after the fact.\nOn Friday, Shelby police arrested Robert Strong III, 23, and Lance Jackson, 26, and charged both with assault with a deadly weapon with intent to kill inflicting serious injury and discharging a firearm into an occupied property.\nRead more top trending stories on wsoctv.com:\n© 2017 Cox Media Group."}