{"uri": "http://www.santapaulatimes.com/news/archivestory.php/aid/30225/SPPD:_Suspect_in_party_bus_drop-off_shooting_arrested_Saturday.html", "title": "SPPD: Suspect in party bus drop-off shooting arrested Saturday", "dct": "Mon, 20 Jul 2015 00:00:00 GMT", "id": "d83ab5b5cb2b4d156457b00f3d231f1a", "content": "Santa Paula Police made an arrest Saturday after an early morning shooting left five men wounded…and the man taken into custody was one of those injured in the melee that occurred during a party bus drop-off.\nOne victim of the shooting that took place at about 2:47 a.m. July 18 is in critical but stable condition.\nEric Medrano, 22, of Santa Paula, was arrested for suspicion of attempted murder Saturday at approximately 10 p.m.\nAccording to SPPD Sgt. Cody Madison, “Medrano was one of the initial reported ’victims’ however through investigation he was determined to be a suspect,” and after he was medically cleared at the hospital he was transported to the SPPD Station for processing.\nMedrano, who was on parole, was later transported to Ventura County Main Jail in Ventura; although bail was initially set at $500,000 an increase was requested that raised it to $1 million.\nSince Medrano was also on active parole at the time of his arrest a no bail hold was also placed on him.\nPolice are looking for other suspects in the incident that occurred near the corner of Ojai-Santa Paula Street (Highway 150) and High Street when a party bus reportedly returning from Los Angeles dropped off a large group of up to 50 people.\nMany, according to a witness, were intoxicated.\nPeople started fighting — an altercation that SPPD Commander Ish Cordero said could have started on the bus — and witnesses said they heard 15 to 20 gunshots from what they believed was more than one shooter. When the shooting stopped the suspects took off in a vehicle.\nAll the men that were wounded are 20 to 35 years old.\nSanta Paula Fire EMTs and ambulances also responded to the scene where people were screaming and crying including those according to a witness that were “hysterical…and getting in the way of the firemen and ambulance guys,” trying to treat the wounded.\nCordero said officers had to “restore order” at the scene that he described as “chaotic…”\nThree others wounded had non-life threatening wounds; one man had a bullet graze his arm and he did not seek hospitalization. Two victims were taken by ambulance to Ventura County Medical Center in Ventura — where the most seriously injured victim remains — and a third was sent to Santa Paula Hospital. One shooting victim turned up at VCMC after being driven there in a private vehicle.\nCordero said the incident is believed to be gang related and is still being investigated.\nAs of Monday there were no additional arrests or “weapons recovered at this point.”\nCordero added, “There is a lot of work to do on this one…”\nMedrano has been arrested numerous times in the past on weapons and gang related charges.\nAnyone with information on the shooting is asked to call Detective Walter Harper at 525-4474, ext. 221.\nIf you would prefer to remain anonymous, call the SPPD recorded Tip Hotline, 933-5691 or email tips to tipline@spcity.org\nVentura County Crime Stoppers will pay up to $1,000 reward for information that leads to the arrest and criminal complaint against the person(s) responsible for this crime. Call Crime Stoppers at 800-222-TIPS (8477); the call is not recorded and the caller may remain anonymous.\nVentura County Crime Stoppers can also be contacted by texting “Busted” plus your message to CRIMES (274637).\nCrime Stopper Tips can also be sent via the website, www.venturacountycrimestoppers.org"}