{"uri": "http://www.toledoblade.com/Police-Fire/2016/12/22/Boy-15-among-3-victims-ofgunplay-in-area.html", "title": "Girl, 15, among 3 victims of gunplay in area", "dct": "Thu, 22 Dec 2016 00:00:00 GMT", "id": "1f3250416374c42165d1db1d124cd0c3", "content": "Toledo police Wednesday investigated three recent incidents in which three people were shot in the city.\nMost recently, Sparquaja Fields, 15, of South Toledo, and Kevin Lovett, 18, of Monclova Township, were shot within 30 minutes of each other late Tuesday — first in North Toledo, then in West Toledo, police said.\nPolice responding to a report of a person shot arrived about 8:30 p.m. and found young Fields lying on the floor at an apartment in the Greenbelt Place apartments in the 800 block of Walnut Street. She had been shot in the left hip.\nThe teen told police she was walking to a store at Walnut and North Michigan Avenue a short time before, when she was struck by a bullet. She was taken to Mercy Health St. Vincent Medical Center, where a spokesman said she had no information about a person by that name.\nPolice had no witnesses and no suspects, according to a police report. The victim told police she did not know who shot her.\nAbout 8:55 p.m., police responding to another report of a shooting arrived and found Mr. Lovett at a residence in the 1800 block of Wyndhurst Road, suffering from three gunshot wounds. By that time, an “unknown” shooter had fled the location, police said in one police report, adding that the shooting may be drug-related.\nMr. Lovett was later taken to ProMedica Toledo Hospital. Police said his injuries did not appear to be life-threatening.\nAdditionally, police were looking into a Tuesday shooting that injured James Lyons, 26, of Toledo.\nMr. Lyons told police he was walking down Upton Avenue near Macomber Street about 1:15 p.m. when “an unknown person” came around the side of a building and shot him. He “was not forthcoming with any further information,” police said in a report.\nMr. Lyons then sought medical help at ProMedica Toledo Hospital for a single gunshot wound to his left thigh and was admitted, according to police.\nA ProMedica Toledo Hospital spokesman said she had no information about anyone by either Mr. Lovett’s or Mr. Lyons’ name.\nContact Mike Sigov at: sigov@theblade.com, 419-724-6089, or on Twitter @mikesigovblade."}