{"uri": "http://www.northwestgeorgianews.com/rome/news/local/copeland-street-homicide-victim-identified-police-seeking-for-at-least/article_748f101c-dda2-11e4-bbd5-239ba13534da.html", "title": "Copeland Street homicide victim identified; police looking for at least 2 in shooting death", "dct": "Thu, 09 Apr 2015 10:00:00 GMT", "id": "c18473e8c738999de2f2eac498bc2192", "content": "Detavious Jamalcom Milner, 22, of 205 Ross St., died in a 11:10 p.m. Tuesday shooting at 20 Copeland St. Gunfire also struck three other men who later were taken to Floyd Medical Center, detective Chris Arrington said.\nArrington said the shooting victims were being treated at the hospital. FMC officials said they have no record of the men — Dishon Lamar Glanton, 21; Quatevious Tarae Johnson, 22; and Craig Bernard Calhoun Sr., 23.\nNo weapon has been recovered. The suspects, considered armed, remain at large, authorities said.\n“We’re following up on leads,” Capt. Mark Tison added.\nAt least two suspects — described as black men wearing dark-colored masks — entered the Copeland Street home, firing several shots, Arrington said.\nAn officer responding to calls about the gunfire saw a man running toward his patrol car, saying he’d been shot and needed help. Several other people were running in the street screaming, reports state.\nOne person told police a shooting victim was inside the home. An officer entered the house and found Milner on the floor, reports state.\nOfficers then secured the scene as a large crowd gathered.\nMilner was pronounced dead at 12:07 a.m. Wednesday on the scene, Coroner Barry Henderson said.\n“We urge anyone, if they have any information, to call us,” Arrington said.\nPeople can reach the Rome police crime line at 706-236-5000, the police station at 706-238-5111 or Arrington directly at 706-238-5126. Callers can remain anonymous.\nTkeyah Underwood said she and Milner graduated from Rome High School in 2011.\nMilner, a high school football player, enjoyed telling jokes and making people laugh, Underwood said.\nOf the shooting victims, Johnson’s address is listed as the Copeland Street house, Calhoun lives elsewhere in Rome and Glanton is from Cave Spring."}