{"uri": "http://www.recordnet.com/apps/pbcs.dll/article?AID=/20130709/A_NEWS/307090313", "title": "Deadly gunfire followed reported argument at party", "dct": "NODATE", "id": "b97b26f2bdd3f3be55833daf8fb891d4", "content": "STOCKTON - Officials identified Mahelani Josiemarie Posada, 19, of Stockton as the lone fatality among five people struck by gunfire early Sunday at the southwest corner of Connecticut and Flint avenues in Stockton's Conway Homes neighborhood.\nSTOCKTON - Officials identified Mahelani Josiemarie Posada, 19, of Stockton as the lone fatality among five people struck by gunfire early Sunday at the southwest corner of Connecticut and Flint avenues in Stockton's Conway Homes neighborhood.\nOn Monday, police offered limited additional information on the mass shooting. Those wounded included two women, ages 40 and 18, and two men, 23 and 19. Their identities were not provided, and all had non-life-threatening injuries.\nWhile the investigation remains active, police would only say they are interviewing people and trying to establish a motive.\nThe shootings were reported at 3:38 a.m. Sunday outside a duplex near two quiet residential streets.\nMonday afternoon, police evidence markers remained where stray bullets had struck walls, and blood smears stained patches of lawn. Candles still burned at a makeshift memorial set up Sunday evening with bouquets, beer cans and a pink-and-white Hello Kitty stuffed animal lining the base of a fence near the crime scene.\nNeighbors eyed the scene warily, reluctant to speak about what they saw or heard. One longtime resident said a loud party with about 50 guests started about 10:30 p.m. Saturday and was still raging five hours later when the shooting occurred. She requested anonymity out of concern for her safety.\nShe said the house was occupied by two sisters in their 20s, one of whom had a baby boy. The house had a reputation among the neighbors as a party house, but what was unusual about this party was its late start after the neighborhood's 10 p.m. curfew and the large number of guests, the woman said. Her information could not be verified by police.\nThe woman went on to say that just before the shooting, an argument broke out inside the house among party guests, the music was turned down and those fighting were told to take it outside. At that point, the shooting began, she said. It is unknown if more than one person had a gun or if the victims were struck by more than one gunman.\n\"A lot of people ran after the shooting. Cars were going everywhere like cockroaches after the lights are turned on,\" the woman said.\n\"There was screaming, yelling, 'I'm hit! I'm shot!' \" the woman said. She saw party guests calling police about 10 to 15 minutes before the first officers arrived, she said.\n\"Our heart goes out to the family of the one that passed away. I hope we can go back to the peaceful neighborhood we had. It's too bad she had to lose her life because of a party,\" the woman said.\nContact reporter Joe Goldeen at (209) 546-8278 or jgoldeen@recordnet.com. Visit his blog at recordnet.com/goldeenblog."}