{"uri": "http://www.timesunion.com/local/article/Cops-press-probe-of-fatal-fire-at-Colonie-6820129.php", "title": "Sources: Colonie officer despondent before killing wife, son", "dct": "Wed, 10 Feb 2016 00:00:00 GMT", "id": "4074a91eff0366092b5b6925ac04f464", "content": "Colonie\nA Colonie police officer suspected of fatally shooting his wife and 10-year-old son — before setting their house on fire and killing himself — showed signs of despondency and took steps to preserve the belongings of his teenage son, who was at a high school basketball game that Tuesday evening.\nPeople briefed on the investigation said that before the fire broke out at the family's Schalren Drive home, Officer Israel J. Roman, 44, loaded a family car with his 15-year-old son's clothing, some money and other valuables. Roman then moved the car to the street in front of the house before the fast-moving fire broke out.\nBy then, according to law enforcement sources, Roman had allegedly fatally shot his 44-year-old wife, Deborah, who was a Mohonasen school district teacher, and his younger son, who attended school in the North Colonie school district. Roman wrapped the bodies of his wife and son in blankets before pouring gasoline in the home and setting the fire. Police believe Roman then shot himself. The three bodies were found on the couple's bed, said the law enforcement officials, who are not authorized to comment publicly on the case.\nThere are indications Roman may have planned the killings in advance of the fire, which was spotted by a neighbor just before 6 p.m.\nEarlier Tuesday, he took four of his guns, including two rifles, to a local gun store and bartered with employees who eventually paid him for three of the weapons. Prior to the sale, Roman had exchanged texts with the gun store's owner, who said he knew Roman for about 20 years and that nothing about his behavior Tuesday seemed out of the ordinary.\nRoman left the store about 3 p.m. Tuesday with his hunting rifle, which he wanted more money for than they were willing to pay, according to people briefed on the case.\nInvestigators believe Roman used his police-issued service pistol in the shootings, according to the law enforcement sources. The semiautomatic pistol was found next to him, sources said.\nRoman also had texted his mother, who lives in Troy, throughout the day Tuesday. She told investigators that her son appeared despondent, but that he was also concerned about getting a ride for his older son, who was attending a boys basketball game at Shaker High School, a person briefed on the case said.\nThe suspected murder-suicide stunned Colonie police and other law enforcement officers who knew Roman, who grew up in Lansingburgh and worked for the Rensselaer County Sheriff's Department before joining the Colonie force more than 10 years ago. Some people who knew him privately described Roman as soft-spoken and said he enjoyed guns and archery.\nThe State Police Major Crimes Unit is leading the investigation, which included interviewing Roman's 15-year-old son late Tuesday. However, law enforcement sources said a home-security camera at the couple's residence has helped them confirm some details, including the teenager leaving for the basketball game and Roman entering the residence after that, and before the slayings took place.\nNorth Colonie school Superintendent Joseph Corr said grief counselors are helping students deal with the younger son's death. He promised the district would be \"honest and open and deal with what we know.\"\n\"It is one of profound sadness when involving family and children. ... It is very difficult to believe,\" Corr said. \"It is difficult to accept.\"\nThe district declined to provide any information on either of Roman's children, who both attended school in the district.\nKathleen Spring, superintendent at Mohonasen schools where Deborah Roman was employed, declined to respond to requests for comment. A person briefed on the case said Deborah Roman was not at work Tuesday because she said she had a doctor's appointment.\nThe victims were discovered after firefighters battled the flames, an effort that was hampered by exploding ammunition.\nPolice have not provided many details about the incident or their investigation.\nPublic records indicate the single-family residence off Forts Ferry Road was purchased in 2013 by Roman and his wife.\nRoman was listed as a patrol officer with Colonie. At Rensselaer County, he began working as a corrections officer at the jail in 1997, then worked briefly as a road patrol deputy before returning to the jail.\nA neighbor who declined to give his name said he called 911 when he saw the fire just before 6 p.m. Tuesday. He said the fire appeared to start inside the front of the house in an area near the porch and quickly engulfed the house.\nThe neighbor said he was surprised when he learned three people died. \"Thought they were away,\" he said. \"People could have easily gotten out.\"\nBud Lindner, another neighbor, got a call about the fire at dinner. He went outside and saw the flames rise as high as a 30-foot pine tree next to the house. He said he knew his neighbor was a police officer, but little else. It is the kind of neighborhood, Lindner said, where people wave to each other, but not much beyond that. Lindner said he saw Roman doing yard work and would see his two boys play baseball in the front yard, but had never met his wife.\nMarge Lindner, Bud's wife, said she once gave Roman, or \"Izzy,\" as he was known, some tomato seeds for a garden. The next year, she said, he arrived at their door with a basket of tomatoes.\nThe deaths were shocking. \"It's just horrendous,\" she said.\n\"You begin to wonder, question — what happened?\" Bud Lindner said.\nLindsay Murthy, another neighbor, said she and her husband were still in shock.\n\"I haven't slept at all since last night,\" she said. \"Sick to my stomach.\"\nShe would see Roman walking his dog. On Wednesday, her husband saw three bodies being removed from residence before dawn.\n\"It's pretty surreal,\" she said.\nblyons@timesunion.com • 518-454-5547 • @brendan_lyonstu"}