{"uri": "http://www.mlive.com/news/saginaw/index.ssf/2013/03/police_gang-related_shootout_a.html", "title": "Police: Gang-related shootout at Buena Vista bar leaves 1 man critical, injures others", "dct": "Sun, 03 Mar 2013 09:49:00 GMT", "id": "a44ef7e4ccfd7cc6dff882ba642cccb0", "content": "BUENA VISTA TOWNSHIP, MI — A shootout after midnight at Better Dayz Bar and Grill injured several people and sent patrons running for cover as rival gang members began firing at each other, police said.\nTwo victims remain hospitalized, a 23 year-old man initially listed in critical condition and a 34-year-year-old man initially listed in stable condition, according to a news release from the Buena Vista Township Police Department.\nTwo women, 17 and 25, were treated and released, police said.\nBuena Vista officers responded with Saginaw police, Bridgeport police, and the Saginaw County Sheriff's Department to a report of multiple shots fired at 12:26 a.m. Sunday, March 3, at the bar located on Dixie near Farmer.\n\"The scene was chaotic as at least 100 patrons flooded the parking lot and took cover inside when a dispute between rival gang members quickly escalated and guns were pulled,\" Buena Vista Detective Sgt. Gregory Klecker said.\nPolice said they collected dozens of spent shell casings that were ejected from at least three weapons at the scene.\nDetectives have interviewed several persons caught in the cross-fire and throughout the early morning hours and are trying to sort out what started the conflict, police said.\nKlecker said Saginaw police officers were key in the investigation, providing \"good information and intelligence on the local gangs in the city.\"\nThe bar was locked and quiet Sunday about 10 a.m.\nA sign posted near the entrance states, \"Must be 25 with proper ID, Fri/Sat nights enforced.\"\nDetectives have identified persons of interest related to the shooting but said they have not received much cooperation in their investigation.\nPolice are asking anyone with information to contact the Buena Vista Police Department Detective Division at 989-753-7790 or the detective tip line at 989-233-2363.\nBuena Vista Police continue the investigation of a drive-by shooting that injured two Buena Vista residents on Wednesday, Feb. 27. One man has been charged related to the incident."}