{"uri": "http://www.sacbee.com/news/local/crime/article125158354.html", "title": "Deputies arrest two additional men in fatal Foothill Farms apartment shooting", "dct": "Sat, 07 Jan 2017 11:05:00 GMT", "id": "0e23a98fb81c8eceb71ffc6d07eccbcd", "content": "The Sacramento County Sheriff’s Department made two more arrests in a December shooting at a Foothill Farms apartment that killed a 38-year-old woman and injured three others, according to a department news release.\nTyquil Armstrong and Jerrell Jackson, both 21, were arrested on suspicion of murder and attempted murder in connection with the shooting of Sungaya Fleming. Jackson was already in custody for being an ex-felon in possession of ammunition. Armstrong was arrested and booked into jail Friday night by sheriff’s deputies.\nFleming was in a Myrtle Avenue apartment on Dec. 12 with 15 other people when gunfire blasted through the closed front door of the apartment just before 9 p.m. Five children, ages 4 to 16, were in the home.\nThree other people in the apartment suffered gunshot wounds and were taken to a hospital. The other victims, a 39-year-old woman, a 21-year old man and a 15-year-old girl, are still recovering, according to the news release. Fleming died from her injuries Dec. 19.\nA third man, 21-year-old Lawrence Johnson, was arrested Dec. 20 for his involvement in the shooting.\nSgt. Tony Turnbull, sheriff’s spokesman, said Johnson was acquainted with people in the apartment and that detectives believe he got into an argument that led to a physical fight with a male at the apartment earlier that day.\nJackson and Armstrong are scheduled for an arraignment hearing at 1:30 p.m. Tuesday at Sacramento Superior Court. Both men are ineligible for bail.\nfacebook twitter email Share\nSee what's behind the police eyes in the sky\nThe Sacramento Police Department gave reporters a look at its \"real time crime center.\" The center pulls in video feeds from across the city.\nEllen Garrison The Sacramento Bee\nNashelly Chavez: 916-321-1188, @nashellytweets"}