{"uri": "http://www.lehighvalleylive.com/bethlehem/index.ssf/2017/01/woman_arraigned_on_gun_charges.html", "title": "Woman, 24, had 5 guns and no permit to carry, cops say", "dct": "Fri, 13 Jan 2017 10:50:00 GMT", "id": "57c0b21f9f4bbc540361aa087be15fbe", "content": "A gun recovered from a Bethlehem woman's vehicle is consistent with a weapon described by a victim who says he was accidentally shot on the city's South Side, police said.\nMelanie Frances Santos, 24, of the 800 block of Atlantic Street, was arraigned before Senior District Judge Joseph Barner on Thursday on five counts each of carrying a firearm without a license and illegal possession of a firearm, both felonies.\nPolice picked up Santos on Tuesday and held her on a probation violation. She was arraigned via video from Northampton County Prison with the judge setting bail at $25,000.\nShortly after 3 p.m. Monday, city officers were dispatched to St. Luke's University Hospital in Fountain Hill for a man suffering from a gunshot wound to the leg. Police later identified the patient as Earl Perkins, 26, of Irvington, New Jersey.\nA woman who allegedly ran from police looking for the crime scene faces 10 felonies as the investigation continues.\nPerkins told police he was shot while walking in the area of East Fifth and Atlantic streets. He said a woman he only knew as \"T\" shot him accidentally with a revolver-style handgun, and then his girlfriend took him to the hospital for treatment, according to court records.\nOfficers then began searching around Yosko Park and found Santos standing next to a Hyundai in the 800 block of Laufer Street. She took off running, with officers in pursuit, according to police.\nSantos was arrested at 3:22 p.m. while running through back yards. While running, she allegedly dropped a loaded Ruger .357-caliber revolver that officers seized from a back yard.\nInside the Hyundai, police observed the barrel of a rifle sticking out from under a blanket in the back seat, they said. Investigators secured the vehicle and obtained a search warrant that turned up: a Marlin .308 lever-action rifle with scope; a Marlin .30-30 lever-action rifle with scope; a Ruger .22-caliber revolver; a Remington XP100 7mm bolt-action pistol; and three rifle scopes, as well as various boxes of ammunition.\nBethlehem Police Chief Mark DiLuzio said no one had been charged in the shooting, which remains under investigation. However, police did say a Ruger Single Six .22-caliber revolver style handgun recovered from the Hyundai was consistent with the gun described by Perkins as the one that caused his gunshot wound.\nInvestigators also are trying to determine where Santos obtained the weapons, DiLuzio said.\nA check on the Hyundai revealed it was registered to Santos' sister. The sister told police she removed her license plate from the vehicle and her sister affixed her own plate to it.\nVarious documents also were seized from the car, including Northampton County Adult Probation paperwork belonging to Melanie Santos. Police said Santos violated convictions of criminal trespass and false imprisonment stemming from a December 2015 arrest, which prohibited her from owning firearms.\nIn the December 2015 kidnapping incident, Santos and another woman traveled to a home in the 800 block of Wyandotte Street in Bethlehem and forced their way inside. The pair were accused of stealing a TV, computer and other items totaling $900, according to court records.\nThe victim told police the two women chased her through the house and attempted to kidnap her.\nIn February 2016, Santos was accused of giving a man crack to smoke, cutting him and then hitting him with a car when he refused to pay her.\nSantos is tentatively due back in court for a preliminary hearing Jan. 30.\nPamela Sroka-Holzmann may be reached at pholzmann@lehighvalleylive.com. Follow her on Twitter @pamholzmann. Find lehighvalleylive.com on Facebook."}