{"uri": "http://www.mcall.com/news/breaking/", "title": "Syrian families bound for Allentown turned back under Trump order", "dct": "NODATE", "id": "71387df6ad7216d566f0deca703a9f70", "content": "After months of work, the house on Second Street in Allentown was ready Saturday for Ghassan Assali's two brothers and their families. Assali and his wife, Sarmad, remodeled it and furnished it and were prepared to hand over the keys to the Syrian relatives upon their long-awaited arrival Saturday...\nBreaking News\nEquipment stolen from Lower Saucon property\nA piece of equipment worth more than $2,000 was stolen from a Lower Saucon Township property. Michael Kiefer, of 4310 Lower Saucon Road, reported the theft to Lower Saucon Township Police Thursday. Kiefer said an auger attachment for a mini-excavator was taken from his property. He said he last...\nBreaking News\nTruck stolen from Upper Macungie business\nA pickup truck was stolen from a business in Upper Macungie Township sometime between Thursday and Friday. Upper Macungie Township Police said a white Ford F-350 was stolen from the parking lot of Highland Tires, 6551 Tilghman St., between 5 p.m. Thursday and 7 a.m. Friday. The truck has Highland...\nHealth Care\nIn marijuana competition, a tension between clinical, alternative medicine\nTim Charles describes himself as a serial entrepreneur. The Allentown native has dabbled in energy efficiency, international trade, manufacturing and real estate. Now, Charles, CEO of PA Cannabis LLC, hopes to bring medical marijuana to Main Street via a dispensary that offers patients a holistic...\nBreaking News\nMount Bethel man attacked in his greenhouse; suspect arrested along Delaware River\nA trespasser tackled a Mount Bethel man in his greenhouse, hit him with a screwdriver and fought with him Friday morning before running off along the Delaware River, police said. Hours after a state police helicopter crew failed to find him, suspect Alan E. Vest, 46, was spotted on River Road and...\nBreaking News\nEaston house hit by a bullet; police look for red SUV\nEaston police searched Friday afternoon for a red vehicle they believe was involved in a drive-by shooting at a house on Washington Street. At least one shot was fired about 5:50 p.m. in the 1100 block of Washington Street, city police said. One bullet was found lodged in a house there. No one...\nEntertainment\nJohn Hurt, British actor known for roles in 'Elephant Man,' 'Alien,' dies at 77\nJohn Hurt, a British actor who gave compelling depth to desperate, flawed and sometimes monstrously deformed characters in performances that captivated audiences and critics for more than five decades, has died. He was 77. The actor announced in 2015 that he had pancreatic cancer. His agent, Charles...\nEnergy Sector\nRate hike dispute between Amtrak, PPL not speeding toward a conclusion\nThe dispute between PPL Electric Utilities and Amtrak over a proposed rate hike to cover upgrades to a Lancaster County substation does not appear to be speeding toward a resolution anytime soon. The Pennsylvania Public Utility Commission last week decided to suspend PPL's proposed rate increase...\nBreaking News\nStroudsburg ambulance worker molested 3 patients, police say\nA Stroudsburg area emergency medical technician molested two boys and a man who were his patients last year and this month in his work for Suburban Ambulance, police said Friday. In three separate incidents, Matthew J. Menist, 31, of Stroudsburg assaulted each of the patients as another worker drove...\nPolice\nAllentown man charged in Thursday night stabbing\nA 30-year-old Allentown man was charged with stabbing another man to death Thursday night in an east Allentown apartment, according to police. Jonathan Lirano-Rodriguez, 30, of the 800 block of North Sherman Street, was charged early Friday with one count of homicide and sent to Lehigh County Jail...\nPennsylvania News\nPa. abortion foes optimistic about policy changes under Trump\nAs abortion opponents descended on the National Mall Friday for the movement's 44th annual rally, Pennsylvanians in the crowd described a much different tone this year with a new Republican president in the White House. Optimism, encouragement and hope were how attendees from the Allentown Diocese...\nBreaking News\nTwo New York men charged in alleged Ponzi scheme for 'Hamilton' tickets\nTwo New York men have been accused by the Securities and Exchange Commission of defrauding investors out of millions of dollars in what the agency described as a “Hamilton” ticket-resale Ponzi scheme. The SEC said Friday that Joseph Meli, 42, and Matthew Harriton, 52, convinced at least 125 investors...\nNation/World\nTrump suspends admission of refugees, increases vetting of Muslims; vows priority for Christians\nPresident Donald Trump signed an order Friday to suspend admission of all refugees for 120 days while a new system is put in place to tighten vetting for those from predominantly Muslim countries and give preference to religious minorities. Trump said that the goal is to screen out \"radical Islamic...\nEntertainment\nEmmy-winner Barbara Hale, who played Perry Mason's secretary, has died at 94\nBarbara Hale, best known for her Emmy Award-winning role as Perry Mason’s loyal secretary Della Street on the long-running 1950s and ’60s TV series starring Raymond Burr, has died. She was 94. Hale died Thursday, according to her son, actor William Katt, who posted the news on his Facebook page....\nPennsylvania News\nPennsylvania Gov. Tom Wolf to seek consolidation of 4 health agencies\nGov. Tom Wolf's administration notified state officials and employees Friday afternoon that he wants to consolidate four state agencies into a single department as the first-term Democratic governor deals with a massive budget deficit and a Republican-controlled Legislature averse to raising taxes....\nPolice\nLife sentence closes case of fatal 2012 Wilson robbery\nAfter five years of heartbreak, countless hours of investigations, two trials and a guilty plea, the criminal proceedings tied to the death of a Wilson grandmother came to a close Friday at a court hearing with a predetermined outcome. As expected, Quadir Taylor was sentenced to life without parole..."}