{"uri": "https://www.ksl.com/?sid=42949210&nid=148", "title": "14-year-old girl critically injured after being shot near West Valley mall", "dct": "Sat, 21 Jan 2017 00:00:00 GMT", "id": "ceea4f122e617cb99c0c7a488dc526c7", "content": "WEST VALLEY CITY — A 14-year-old girl was hospitalized in critical condition Saturday after she was shot in what police say was a gang-related confrontation near the Valley Fair Mall.\nThe girl received a call telling her to come to the area, according to West Valley Police Lt. Robert Hamilton. When she arrived with friends just before 7:20 p.m, there was an altercation and shots were fired, one of which struck the girl.\nBased on accounts from witnesses, Hamilton said police believe the incident is \"gang-related and intentional.\"\nThe shooting occurred in the parking lot of Costco, 3747 S. 2700 West, which adjoins the mall parking lot. After the girl was shot, Hamilton said she ran north through the mall parking lot where she eventually collapsed and was found by police.\nThe girl was transported to an area hospital in critical condition.\nTwo witnesses who saw the shooting ran across the street to the police station to report what had happened.\nPolice are searching for a male who may have been involved, though officers don't know whether he was the shooter, the lieutenant said. No information, including the male's age, was given.\nHamilton said police do not believe there is any danger to the public. No one was arrested following the shooting but police later said they had identified a person of interest.\nOfficers said three shell casings were located. One bullet struck a truck that was parked some distance across the mall parking lot. The truck's owner was inside the mall at the time.\nBecause investigators were initially unsure what had happened, only that shots were reported near the Valley Fair Mall busy with shoppers on a Saturday night, officers called for support from anyone in the area as a precaution. A large swath of the lot was marked off as numerous officers responded.\nThe mall and surrounding businesses remained open as police investigated.\nPhotos"}