{"uri": "http://www.firstcoastnews.com/news/crime/jso-multiple-people-shot-at-eureka-gardens_/290750321", "title": "Police say 7 shot in hail of gunfire, two in critical condition", "dct": "Mon, 08 Aug 2016 00:00:00 GMT", "id": "c884b6d6af9865b428b5dafad9a79b2e", "content": "JACKSONVILLE, Fla. -- The Jacksonville Sheriff's Office is reporting that a total of seven people were shot, with two in critical condition, earlier this morning at the Eureka Gardens Apartment Complex. Three suspects are being sought.\nEureka Gardens shooting overnight: Over 50 shots fired (rifle and handgun). #JSO #JAX #Jacksonville\n— Jax Sheriff's Office (@JSOPIO) August 8, 2016\nPolice responded to a call about someone shot at around 12:30 a.m. Monday. When they arrived on scene they saw that multiple people were shot.\nOfficers say the victims were sitting on a staircase when a suspect with a long gun and hand gun opened fire on the group. A mother was among those struck.\nVictims have been transported to UF Health and Orange Park Medical Center.\nThere is an active and ongoing investigation into the shooting and the suspects involved.\nPolice say among those in the line of fire were infants but none were struck @FCN2go pic.twitter.com/CwvrxgimGf\n— Joe Massa (@tvjoe12) August 8, 2016\nAnyone who has any information reference this shooting is asked to contact the Jacksonville Sheriff's Office at 904-630-0500 or email at JSOCrimeTips@jaxsheriff.org. To remain anonymous and receive a possible reward up to $3,000 contact Crime Stoppers at 1-866-845-TIPS.\nIn response to the shooting, Congresswoman Corrine Brown (D-Fla.), whose district includes the Eureka Gardens apartment complex, penned a letter to HUD Secretary Julian Castro, asking for around-the-clock security and improved surveillance for the protection of the residents for both Eureka Gardens and another HUD property in the area, Washington Heights.\nBrown is currently under a federal investigation for fraud and tax evasion charges.\nIn her letter to Castro, Brown says that she hopes he briefs her on the new security details after Congress's August recess.\nI am deeply disturbed by this shooting at Eureka Garden apartments. As if the residents haven't been through enough already because of slumlords stealing taxpayer money and failing to provide safe, livable conditions, now this terrible act of violence occurs. My heart goes out to the families dealing with this tragedy, and our prayers are with the wounded. It’s important that we get all the facts about what happened, whether an appropriate amount of security is being provided, and what steps need to be taken to make this community more safe. There must be accountability and the perpetrators of this attack must be held responsible.\nThis is a developing story. Stay with First Coast News for updates and read the full letter to HUD below:"}