{"uri": "http://www.wearewvproud.com/story/34201445/teenager-in-critical-condition-after-shooting-in-bluefield-va", "title": "Funeral Arrangements announced for victim in fatal shooting", "dct": "Fri, 06 Jan 2017 17:30:00 GMT", "id": "709592f46df5475555e5b30417304e57", "content": "Neighbors at the Crescent View Apartment Complex in Bluefield, Virginia offered sympathy for the family of shooting victim Tyler Buchanan on Monday January 9, 2017. The 16 year old passed away on Friday January 6, 2017.\nNeighbor Gloria Wilson said, \"So sorry for the family that they had to go through something like that.\"\nBluefield Virginia Police said on Thursday January 5, 2017 the dispatch center received a call about a gunshot wound victim at the Crescent View Apartments. Calvin Powers of Bluefield, Virginia is charged with aggravated malicious wounding, and use of a firearm in commission of a felony. Tazewell County Commonwealth's Attorney Michael Dennis said Powers asked Buchanan to play a game of Russian roulette, but Buchanan reportedly didn't want to play.\nPowers reportedly put the gun to his own head and pulled the trigger and the gun didn't go off. Investigators said Powers then put the gun to the back of Buchanan's head, pulled the trigger leading to his death. Elaine Oliver said she's lived at the Crescent View Apartments for 10 years and she was shocked when she heard the news.\nElaine Oliver said, \"It's really sad you know that happened. My first reaction was you know I was thinking about my daughter. That could have been anybody and they could have been outside and that could of happened.\"\nOliver is asking for prayers for the family.\nOliver said, \"It's tragic because I believe she saw him like that. She was called and she was trying to wake her baby up. That's tragic for any mother to see their child like that.\"\nDennis said an autopsy has been performed on Monday January 9, 2017 and they are waiting for the results from the medical examiner. He said he anticipates additional charges to be filed.\nFuneral Arrangements are being handled by Mercer Funeral Home. A visitation will be held at the funeral home chapel from 1 to 2 p.m. on Wednesday, Jan. 11, 2017. That will be followed by the services.\n________________________________________________________________________________________________________________________\n4:30 p.m. Jan. 9, 2017 UPDATE:\nA teen has died from injuries involved in an impromptu game of Russian roulette that he did not even want to be a part of. The Commonwealth Attorney in Tazewell County has confirmed that 16-year-old Tyler Buchanan passed away on Friday, Jan. 6, 2017 from a gunshot wound to the back of the head.\nCalvin Powers is charged in the case. Prosecutors said the evidence shows Powers asked Buchanan to play Russian roulette. Buchanan apparently told Powers he did not want to play. Powers told investigators he left one round in the revolver, spun the cylinder, held the gun to his own head and pulled the trigger. The gun did not fire. According to the release, Powers then spun the cylinder again, held the gun to the back of Buchanan's head and pulled the trigger. This time the gun went off.\nAn autopsy was held on Monday, Jan. 9. When the results come back, prosecutor Michael Dennis said he is expecting to file additional charges in the case.\nORIGINAL STORY: A young man is being treated for injuries after he was shot at an apartment in Bluefield, VA. Officers were called to the Crescent View Apartment Complex at around 4:50 p.m. on Thursday, Jan. 5, 2017. The victim, whose name is not being released, is 15-years-old. Police said he is listed in critical condition.\nCalvin Powers, 28, of Bluefield, VA was arrested in the case. He is facing charges of Aggravated Malicious Wounding, and Use of a Firearm in Commission of a Felony. Powers is being held Southwest Virginia Regional Jail. The case is still under investigation by the Bluefield Virginia Police Department."}