{"uri": "http://onlineathens.com/mobile/2016-10-21/barrow-county-blotter", "title": "Barrow County blotter", "dct": "Fri, 21 Oct 2016 14:29:00 GMT", "id": "ff1bfd15ba29abcc6068013d85215f03", "content": "The Barrow County Sheriff’s Office reported the following incidents:\nRAW DEAL: On Oct. 8, a Winder man reported he had found a Jeep Cherokee for sale on a Facebook site and that he had contacted the seller, who said he would swap the Jeep for the man’s Chevrolet pickup. The two agreed and the man met with the seller in Gwinnett County, where they traded vehicles. When the Jeep experienced mechanical problems, he called the seller and asked where he had gotten the Jeep. After getting the name, the man called this person, who said the Jeep was stolen from her in Hall County. The vehicle was towed. The victim knows the seller only by his name .\nSHOOTING: On Oct. 8, a deputy was dispatched at 11:44 p.m. to a home on Wages Road in Auburn, where a man said he had been cleaning a gun when it accidentally discharged and shot his hand. The entry wound had a fair amount of black residue. Auburn police arrived to secure the scene and the deputy located a trail of blood from the living room to the kitchen sink. He also ound a bullet hole in the armrest of a blue chair. A Glock 40-caliber pistol was on a table along with cleaning supplies.\nHARASSMENT: On Oct. 17, a deputy met with a Winder woman who was being harassed by her ex-daughter-in-law. who was sending unwanted text messages. The deputy called the suspect and advised her to stop and she agreed.\nGUNSHOT: On Oct. 17, a deputy was dispatched to Kirkland Circle, where a resident reported she came home and found a hole in her pool. She woke her husband and upon checking the pool, they found a spent bullet on the bottom. A neighbor told the officer that his daughter had accidentally fired a gun. The daughter arrived and explained she had been at the shooting range and upon returning home, her 9mm pistol accidentally discharged as she was putting it into a holster. She found a hole in her wall but did not realize the bullet had hit the neighbor’s swimming pool.\nMISSING KEYS: On Oct. 17, two deputies were working the x-ray screening machine at the Barrow County Courthouse when an attorney placed his items on a tray, including the keys to his BMW. However, the lawyer retrieved his briefcase but did not collect the keys. A few minutes later, a white woman wearing a red blouse entered and placed her purse in a tray and deputies then gave her the keys. The woman left with the keys and never informed anyone the keys did not belong to her. The woman went into the district attorney’s office and later left the courthouse. However, no one could identify the woman and the lawyer was informed of this fact.\nMARITAL DISCORD: On Oct. 16, a deputy was dispatched to a home in Hoschton, where a man explained he was 99 percent sure he did not love his wife anymore and wanted her to leave the house. The wife also complained that the husband had the keys to her car and would not return them. The wife explained she had signed a prenuptial agreement in which she gets nothing if she leaves the house. The couple were told this is a civil mater.\nBURGLARY: On Oct. 15, a deputy was dispatched to the Mosaic Clubs and Resorts and Pan Pacific on Barber Creek Road, where someone had entered the location on the evening of Oct. 14 and stole $18,800 worth of property. The lock to the gate of the property was not damaged, but the thieves somehow had entered and stole a Ezgo brand golf cart valued at $8,000. A welder was taken along with an 18-foot flatbed trailer, which would require a large vehicle to tow with a receiver hitch.\nTHIEVES ARRIVE: On Oct. 14, a deputy met with a resident of Winder, who reported he had contacted a man on Craigslist to mow his yard. The man and a woman showed up and as they prepared to work, the man took the homeowner’s power saw, valued at $700, placed it in his vehicle and drove off.\nTRAILER RECOVERED: On Oct. 14, a deputy met with a Hoschton woman, who reported she had received a call from Braselton police that her trailer, valued at $8,000, had been recovered on the side of Interstate 85. The trailer was stolen out from under a metal building in her backyard the previous day. An off-duty Gwinnett County Sheriff’s Office deputy found the trailer in the median of the highway, although he did not see the vehicle it came off of."}