{"uri": "http://www.brownsvilleherald.com/news/texas/article_f564a81d-6424-501c-a477-81f6bef06d80.html", "title": "Maquiladora strike comes to an end Agreement: Matamoros workers agree to a 12 percent pay increase.", "dct": "Sat, 10 Feb 2001 00:00:00 GMT", "id": "5c6d821271687420916360005550b326", "content": "The Brownsville Herald\nMATAMOROS Three days after a strike at two maquiladoras brought operations\nat the two plants and 57 others to a standstill, management and the Union of\nIndustrial Workers and Day Laborers have agreed to a 12 percent pay increase\nThe agreement Thursday among the 59 plants under contract with the union,\nknown by its Spanish acronym SJOIIMM, means the renewal of collective\ncontracts, officials said.\nIn December in Ciudad Victoria, the unions had asked for a 30 percent\nincrease, but when the minimum salary was increased, they lowered their\ndemands to 13 percent. Just before the strike, they were asking for a 12.75\npercent increase.\nAll of us want it to be over, said Juan Villafuerte Morales, spokesman for\nA standstill in negotiations in Ciudad Victoria prompted the strike at the two\nMatamoros maquilas, Industrias Gobar S.A. de C.V. and Federal Mogul, both of\nwhich assemble auto parts.\nWorkers at nine other plants stopped work in solidarity and management at 48\nother maquilas suspended operations because of the strike.\nThe standstill left about 60,000 workers in limbo while their representatives\nnegotiated.\nFederal Mogul came to an agreement Wednesday night.\nWe agreed (to the increase) to avoid more harm to the company. We accepted a\n12 per cent increase, plant manager Alfonso Tagle said.\nTagle said the plant resumed operations Thursday. He said the amount of losses\nthe company incurred had not been estimated.\nAt Industrias Gobar, Chairman Raul Gonzalez Barron said the strike involved\nabout 300 workers and was costing the company $80,000 to $100,000 a day in\nlosses.\nFinally we reached an agreement, Gonzalez Barron said.\nVillafuerte Morales compared labor disputes with marriage.\nIts like in marriage: we fight a little and later we hold hands, he said."}