{"uri": "http://www.wrdw.com/home/headlines/BREAKING-Student-at-Hornsby-School-shot-and-taken-to-hospital-322826461.html?device=tablet&c=y", "title": "UPDATE| Gun owner in W.S. Hornsby shooting turns himself in", "dct": "Fri, 28 Aug 2015 00:00:00 GMT", "id": "14686372167b24ed6f78713eb0855422", "content": "AUGUSTA, Ga. (WRDW) -- The owner of the gun in the W.S Hornsby K-8 School shooting is officially charged, according to the Richmond County Sheriff's Office.\nKingsley Smith is charged with contributing to the delinquency of a minor, according to the Sheriff's Office. Smith is the grandmother's boyfriend of the third grader, according to Richmond County BOE Police Chief Alfonzo Williams.\nChief Alfonzo Williams confirms Smith turned himself in on Thursday, and he is the owner of the gun brought to Hornsby School.\nNews 12 First at Five / Wednesday, August 26, 2015\nAUGUSTA, Ga. (WRDW) -- We're finally getting answers to how a child got his hands on the gun he brought to his elementary school.\nThe gun went off in a 3rd grade classroom at W.S. Hornsby K-8 Tuesday morning. School officials say the boy was playing with it inside his desk.\nAfter grazing the side of a 3rd grade girl, parents wanted to know how the gun got to school in the first place.\nRichmond County School Safety and Security Chief Alfonzo Williams says the child was looking for a toy when he came across a loaded gun. A re-enactment told them how the student reached far above his third grade stature to get it.\n\"The child used a chair to climb onto the kitchen counter and propelled himself up to a curio stand in the kitchen area where he got the firearm,\" Chief Williams said.\nThat firearm ended up in the boy's desk at school where it accidentally fired, grazing a little girl.\n\"We think the school administration and faculty and staff as well as the students acted very quickly, very appropriately,\" Williams said.\nThe .380 semi-automatic handgun belonged to his grandmother's boyfriend who is now facing charges for contributing to the delinquency of a minor.\nThe gun, although out of reach, was not locked up.\nAs for the student, school safety and the DA decided together how to move forward.\n\"The third grade student who possessed and caused the .380 semi-automatic handgun to fire a projectile which grazed a classmate will be referred to the Department of Juvenile Justice as a CHINS case. That's a Child in Need of Services case,\" Williams said.\nWilliams says they referred the case the the Department of Family and Children's Services Child Protective Services Unit, too.\nWilliams says community forums about gun safety earlier this year were supposed to help prevent this kind of thing, but he admitted \"attendance from the community has been fairly dismal.\"\nHe says now their best defense is a well-trained faculty and staff.\nWilliams says he will continue to hold community forums on firearm safety and hopes now more people will come to learn about them.\nHe says they've begun their \"after action report\" which means they're going over all their processes to see if they need to make any changes.\nRight now, he says he believes what they're currently doing is sufficient.\n\"We believe that having vigilant students, staff, and faculty a well-trained students, staff, and faculty is probably the best prevention,\" he said.\nWednesday, August 25, 2015\nAUGUSTA, Ga. (WRDW) -- A charge of contributing to the delinquency of a minor is currently pending against the owner of the firearm connected to WS Hornsby Elementary School.\nThe third grade student who fired the semi-automatic handgun will be referred to the Department of Juvenile Justice.\nAdditionally, the case has been referred to the Department of Family and Child Protective Services Unit, according to Richmond County Safety and Security Department Director Alfonzo Williams\nThe child used a chair to climb on to a kitchen counter, and propelled himself up to a stand in the kitchen area where he got the firearm. The gun was on top of the cabinet out of the child's natural reach.\nReportedly, the child was looking for a toy when he came across the weapon. The gun is owned by the boyfriend of the child's maternal grandmother.\nAt this time, the district isn't releasing the name of the child who brought gun got to school.\nWilliams believes tighter security measures aren't necessary at the school.\n\"In the past we have held community forums through churches and civic organizations and other mediums and on the topic of firearm safety...attendance from the community has been fairly dismal,\" Williams said. \"We will continue to hold these forums in hopes of educating our citizenry on the safe use and practices of firearms and we certainly encourage parents and guardians to attend those forums.\"\n\"We believe that having a vigilant students staff and faculty a well-trained students staff and faculty is probably the best prevention.\nAnd that is where we really need to focus our efforts there are times when metal detectors are a necessary tool in our business. we think the school administration and faculty and staff as well as the students acted very quickly very appropriately,\" Williams said.\nNews 12 at 11 o'clock// Tuesday, August 25, 2015\nAUGUSTA, Ga. (WRDW) -- A long and scary day at W.S. Hornsby school. One that parents like Tandra Williams will never forget.\n\"I just think that for some reason with everything that is going on in the world, We here in Augusta seem to think it can't happen to us,\" said Williams.\nIt started early at 10:45 this morning. A bullet is fired by a third grade boy playing with a gun inside his desk.That bullet grazing one of his classmates. The school went on lock-down, the student was rushed to the hospital and parents were notified. Two hours later News 12 watched that same little girl, who was clipped by the bullet, leaving the hospital.\nWilliams says the girl was lucky and the school was unprepared.\n\"That situation could've been a lot worse,\" said Williams.\nAt 4 o'clock it was time for the school district to answer questions.\nI asked the school district what safe guards the district has to protect students in situations like this.\n\"In certain schools we do conduct metal detector searches in certain schools when there is a need for this type of thing, but this is an isolated incident and we just try to make sure it doesn't happen again,\" said Richmond County BOE Public Safety Assistant Chief Ted Brown\nAnd they say those certain schools with metal detectors don't include elementary schools.We also asked what this meant for the student who shot the gun and his parents.\n\"Like I said it's still under investigation, so we haven't made any decisions about charges at this time,\" said Brown.\nFuture decisions that could lead to criminal charges. For now Superintendent Pringle says she is just happy that the little girl is doing well.\n\"In fact, just earlier the victim said to me, Mrs. Pringle I would like to go to school tomorrow,\" said Pringle.\nSchool officials say the investigation is being handled by board of education public safety team. Once public safety and children services are finished with their investigation Richmond County law enforcement will be able to determine what charges the parents and child could face. Some determining factors will be whether the gun was legally registered, how the student got a hold of the gun and how old he is.\nNews 12 First at Five // Tuesday, August 25, 2015\nAUGUSTA, Ga. (WRDW) -- A place meant to be a safe space for students to learn is shattered by the crack of a gunshot.\nThe third grader grazed by a bullet at W.S. Hornsby has been released from the hospital.\nSchool officials say another student was playing with the gun in his desk when it accidentally went off.\n\"What a child doing with a gun? A little child got a gun?\" asked sister Tasha Williams.\nThat's the question every family member wants to know as they rushed to W.S. Hornsby to make sure their own child was not the victim of a shooting there Tuesday morning.\n\"I said oh Lord. I hope it wasn't my son, you know what I'm saying? I just freaked out,\" Williams said.\nThe school was a mad house after word spread a gun went off, grazing a third grade girl in the side.\n\"I was scared because all I kept hearing was 'Come get me. Come get me.' Then he would hang up the phone,\" mother Alicia Polen said.\nSchool officials say the student who brought the gun was playing with it in his desk when it accidentally went off around 10:45 Tuesday morning.\nStudent Maequoia was sitting in class when she heard it go off.\n\"I heard something. A gunshot. I was about to run outside, but our teacher and stuff like that told us to sit down,\" she said.\nFourth grader Jeffrey Gross, Jr. heard the chaos that happened next.\n\"The kids they all start yelling and screaming and then that's when the teacher came. She picked the little girl up and start running down the hallway. That's when the police and the ambulance came,\" Gross said.\nWhen asked if he feels safe in his school, Gross said, \"No ma'am.\"\nHornsby went on lockdown after the gun went off.\nThe girl who was shot was taken to the hospital. Since the bullet just grazed her side, she wasn't there long. News 12 cameras captured her walking out of GRU just two hours later.\nBack on campus, parents, grandparents, brothers, and sisters were flocking to the school to pick up their kids.\n\"I said let me get out of here and go get my grand baby. I got in my car and I took off,\" grandmother Johnnie Mae Brown said.\nWorried families filled the parking lot to pick up their kids, some getting frustrated.\n\"Saying it's not that serious? It's very serious. I don't know what planet he live on, but it is very serious. A child got shot,\" Polen said.\n\"It was a lot of fussing and cussing and frustration. Everybody wants their kids and the police saying oh you have to wait one at a time,\" sister Martika Jackson said.\nLong before parents filled the streets, emergency vehicles filled the scene and rushed the injured third grader to the hospital. News 12 cameras captured her being loaded into an ambulance on a stretcher and again leaving Georgia Regents Medical Center a couple hours later.\nAs parents and kids were reunited, it was hugs all around. Everyone was thankful the shooting wasn't worse.\n\"I was just glad that wasn't me that got shot,\" 4th grader Jeffrey Gross said.\nSchool officials say the student who brought the gun to school was taken into custody shortly after it happened.\n\"It's a shame these kids can't go to school and be safe. You don't even want to see your child at school no more,\" Polen said.\n\"Pray to God my child is here another day,\" father Jeffrey Gross said.\nIn a news conference late Tuesday afternoon, a host of officials including Superintendent Angela Pringle and Richmond County Sheriff Richard Roundtree talked about today's shooting.\nThey say until the investigation is finished, they don't know if the parents of the student who brought the gun will face charges.\nUPDATE | 1:10 p.m. // Tuesday, August 25, 2015\nAUGUSTA, GA (WRDW) -- The student who was grazed by a bullet at W.S. Hornsby School Tuesday morning has been released from the hospital.\nShe was being treated at Georgia Regents Medical Center.\nTuesday, August 25, 2015\nAUGUSTA, GA (WRDW) -- The Richmond County Board of Education confirms that a female student at W.S. Hornsby School has been grazed by a bullet but is expected to be okay.\nSchool officials say around 10:45 a.m. a male student at W.S. Hornsby Elementary School was playing with a gun in his desk when it went off, grazing the female student.\nThe student with the weapon was taken into custody, according to school officials. The child that was hurt was taken to the hospital, and suffers from non life-threatening injuries. W.S. Hornsby is no longer on lockdown.\nThere is no further danger in the school. Parents can come pick their students up or check on their student at W.S. Hornsby Elementary School at the grade 6-8 building. Parents must bring an ID in order to pick up their student, according to school officials."}