{"uri": "http://www.seattletimes.com/seattle-news/witnesses-among-5-dead-in-federal-way/", "title": "Witnesses among 5 dead in Federal Way", "dct": "Tue, 23 Apr 2013 13:43:00 GMT", "id": "374645f2a3bc7b09f9bd794be261aee7", "content": "A man who killed his girlfriend at their Federal Way apartment Sunday night and then killed three others before he was fatally shot by police may have been determined to leave no witnesses, police said.\nFederal Way Police Chief Brian Wilson said the city’s deadliest shooting began as a domestic-violence homicide around 9:35 p.m. when the gunman shot his 25-year-old girlfriend in the head in their apartment at Pinewood Village in the 33300 block of 18th Lane South.\nThe 27-year-old gunman then left the apartment with a duffle bag of his belongings and headed to the parking lot, Wilson said.\nThere he encountered two men, 23 and 46, who were standing next to a car. Wilson said police do not know what, if anything, the two men said to the gunman, but witnesses reported hearing shouting and yelling before both men were shot.\nPlay VideoPlayMuteCurrent Time 0:00/Duration Time 0:00Loaded: 0%Progress: 0%Stream TypeLIVERemaining Time -0:00Playback Rate1\nChapters\nChapters\ndescriptions off, selected\nDescriptions\nsubtitles off, selected\nSubtitles\ncaptions settings, opens captions settings dialog\ncaptions off, selected\nCaptionsAudio TrackFullscreen\nThis is a modal window.\nCaptions Settings Dialog Beginning of dialog window. Escape will cancel and close the window. Text Color White Black Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Opaque Background Color Black White Red Green Blue Yellow Magenta Cyan Transparency Opaque Semi-Transparent Transparent Window Color Black White Red Green Blue Yellow Magenta Cyan Transparency Transparent Semi-Transparent Opaque Font Size 50% 75% 100% 125% 150% 175% 200% 300% 400% Text Edge Style None Raised Depressed Uniform Dropshadow Font Family Proportional Sans-Serif Monospace Sans-Serif Proportional Serif Monospace Serif Casual Script Small Caps Defaults Done\nPolice said witnesses told them that the shooter “executed” one of the men. One died next to the car, and the other was shot in the back as he tried to run away, police said.\nAs shots were fired, resident James Mack, 63, said he and a neighbor opened their doors to see what was happening.\nMack said the neighbor ran up a small flight of stairs to look out into the parking lot, then he ran back down and told Mack to call 911. Both men went back into their apartments, Mack said.\n“I saw him go into his apartment and we both closed our doors,” Mack said. “Next thing I know, I hear more gunshots. I looked through my peephole and saw a man I didn’t recognize leaving his apartment.”\nWilson said the gunman used a shotgun blast to breach the door of Mack’s 62-year-old neighbor’s apartment and then killed him with a second shot.\nMack said he believes the gunman may have tried to kill him as well.\nThere were 15 bullet holes on the walls outside his apartment, though it wasn’t immediately clear if any came from responding police.\n“We believe he may have been trying to kill his witnesses,” Wilson, the police chief, said of the gunman.\nResponding officers heard gunshots as they began arriving at the complex, said Federal Way police spokeswoman Cathy Schrock. They found the armed man in a stairwell, where officers ordered him to drop his shotgun, but he “did not comply,” Wilson said.\nPolice opened fire, wounding the gunman and causing him to drop the shotgun. But he ran from the stairwell and headed back into the parking lot before falling to the ground near one of the two men he had shot earlier, Wilson said.\nThat’s where police found him and again ordered him to surrender. However, the officers said they opened fire when he reached for a gun that was on the ground nearby, Wilson said.\nAfter the suspect was killed, police made a door-by-door search of the complex and found his girlfriend and the 62-year-old victim, police said.\nCarry permit and domestic-violence reports\nThough police have not released the gunman’s name, a law-enforcement source identified him as Dennis Clark III.\nClark’s grandmother, Lillie Johnson, 73, of Renton, said Monday that\nshe had never known him to fight with anyone.\n“He was no violent person,” she said. “He got along with everybody. He wasn’t violent at all.”\nJohnson said she last spoke to her grandson three weeks to a month ago, and that she had not talked to Clark’s mother since Christmas.\nHis father, she said, left when Clark was a baby.\nHer grandson grew up in Seattle and called her regularly, she said.\n“He was always happy calling me, telling me he loved me,” Johnson said.\nHe made a point of saying he was trying to stay out of trouble and telling her how he was doing in school, she said.\n“Laughing and talking, and just make your day,” Johnson added.\nThe gunman was armed with a .40-caliber semi-automatic handgun and a pistol-grip shotgun, Wilson said.\nHe said the gunman had a permit to carry a concealed weapon and was the registered owner of at least two firearms, including the handgun he used to kill the first three victims. The history of the shotgun used to kill the fourth victim was being investigated by the federal Bureau of Alcohol, Tobacco, Firearms and Explosives, Wilson said.\nAlthough police said the shooter did not have a criminal history, he had been reported to police in Seattle and Federal Way for domestic violence involving verbal abuse.\nWilson said preliminary records indicate there was no cause to arrest the gunman on the previous reports of domestic violence because there were no allegations of assault.\nHe also said that the victim killed Sunday evening was not the victim in either of the earlier reports.\nClark and his slain girlfriend had formerly lived in a Kent apartment complex but moved about a year ago, according to an apartment manager.\nA total of eight officers fired their weapons during the confrontations with the man, said Schrock. All have been placed on administrative leave, per standard policy, as the investigation continues.\nNo officers were injured.\nOne of the dead was identified as Ceasar Valdovinos, 23, according to family members who said police confirmed the young man’s death Monday morning. The names of the other three people were not released Monday by the King County Medical Examiner’s Office.\nMistaken for fireworks\nResidents of the apartments and some neighbors said the incident is out of character for the complex.\nJennifer Brown, 37, who has lived in the apartment complex with her husband, two sons and a daughter for three years, said she went out on their porch about 9:30 p.m. to smoke a cigarette.\n“That’s when I heard the first round. I thought it was firecrackers at first because it was an awful lot of them,” she said.\nA few moments later she heard several more shots, and then her 14-year-old son saw a man in the street running from the complex.\nPolice arrived in about 10 minutes, and Brown heard them tell people to get back into their apartments.\n“I could hear a police officer over a speaker say, ‘Stop or we’ll shoot. Get down.’ They said it over and over.”\nShe then heard another burst of gunfire.\n“I’ve seen police activities out on the streets, but nothing to this extent,” she said of her time at the apartments. “The apartments are actually pretty safe. But after this, I definitely want to move.”\n“I heard pop, pop, pop, pop”\nSunday night was Jane Friedman’s first night as a resident of the apartment complex.\n“I can’t believe it. I’m in shock. This was my first night here,” said Friedman, who said she had just sold a family farm near Enumclaw.\n“I was in my bedroom and I heard pop, pop, pop, pop. Then, pop, pop, pop, pop.”\nSoon, she said, “There were police officers all over the place. They said get back into your apartments. We have someone running around with a gun.”\nShe then heard more shots, but did not go out to investigate, and learned of the deaths only when she went out to talk with reporters Monday.\n“It’s absolutely devastating.”\nKristina Braun, 23, said she and her husband and 3-year-old daughter had gone to the movies and dinner Sunday, arriving home about 9:30 p.m.\n“We saw and heard a ton of ambulances and police cars everywhere,” she said Monday.\nShe and her family were still awaiting an OK from police Monday morning before they could return to their apartment.\n“It’s actually really calm, normally … This is the first huge issue,” said Braun, who’s lived in the complex for two years. She said about six months ago, a lot of police responded to a robbery at a nearby grocery.\n“Gunshots. Lots of gunshots”\nSung Yang, who runs a motel nearby, said he and residents heard the gunfire.\n“I heard gunshots. Lot of gunshots. It was scary,” Yang said.\nThere was a series of shots at first and then after about 10 minutes, more shooting, he said.\nKelly Burki, a resident of the complex, said Monday morning,“I’ve lived here five and a half or six years, and I’ve never had a problem. I just don’t understand it.”\nBurki, 51, had been out for the evening and was returning home about 11 p.m. to find her street closed by police.\nBurki said she is a bartender who frequently doesn’t get home until around 2:30 a.m. “But even at that hour, I’ve always felt safe. I’ve never had fear.”\nWilson, the police chief, said Sunday’s shootings resulted in the largest loss of life in a single incident in the city’s history.\nThe city of about 91,000 residents had three homicides in 2012 and one in 2011.\nSeattle Times staff reporters Sara Jean Green, Steve Miletich and Alexa Vaughn and news researcher Gene Balk contributed to this report."}