{"uri": "http://q13fox.com/2013/04/22/gunshots-injure-at-least-3-at-federal-way-apartment-complex/", "title": "Police: Suspect went on violent rampage in Federal Way apartment shootings", "dct": "Mon, 22 Apr 2013 11:30:00 GMT", "id": "71c4f339fb846e99bb720fb53f82f660", "content": "FEDERAL WAY, Wash. — Four people were killed by a man on a deadly rampage before he was shot and killed by police Sunday night at a Federal Way apartment complex, police said.\nAccording to police, the shootings took place shortly after 9:30 p.m. at the Pinewood Apartments in the 33300 block of 18th Lane South in Federal Way. Piecing together stories from witnesses and investigators, police believe the killings began with a domestic violence homicide and continued with the angry man walking outside and shooting those who confronted him.\nThe incident started when the 28-year-old suspect shot his 25-year-old girlfriend in the back of the head in their shared apartment. The man then walked outside and encountered two men; a 46-year-old and a 24-year-old. Witnesses reported hearing yelling, and the suspect shot both men with a handgun, killing them. The younger man was shot in the back while attempting to run, police said, and witnesses said they saw the suspect “execute” the man once he fell to the ground.\nA neighbor in his early 60s walked outside his apartment when he heard the gunfire and saw the shootings. The man yelled for someone to call 911 and locked himself inside the apartment. Police said the suspect shot open the man’s door with a shotgun, entered the apartment and shot him in the stomach. The neighbor had no known contact with the man prior to the incident, police said.\nAs soon as police arrived, they saw the suspect exiting a stairwell carrying a shotgun. Police told the suspect to drop the gun, but he allegedly continued to advance and police shot him. Wounded, the man ran into the parking lot and fell. He allegedly then reached for a handgun when several officers fired on the suspect, killing him.\nThe suspect had a record of prior verbal domestic disputes, and was known to carry firearms. He had a valid Concealed Pistol License and many guns, police said. Somewhere between six and 15 shots were fired at the scene.\nEight Federal Way police officers have been placed on administrative leave, which is standard policy for officer-involved shootings.\nPolice held a press conference Monday morning about the incident, and ensured neighbors that there was no potential safety threat. Counselors were on hand to assist witnesses and family members."}