{"uri": "http://www.federalwaymirror.com/news/204381321.html", "title": "Names of victims emerge after deadly Federal Way shooting", "dct": "Thu, 25 Apr 2013 02:31:00 GMT", "id": "8214f3b2b6a60dd84c5d2bc40bc52a02", "content": "A trail of domestic violence and other details have emerged following a shooting that left five dead in Federal Way.\nDennis Clark III, 27, fatally shot his girlfriend in the head on Sunday night, then killed three more people at the Pinewood Village Apartments, located near South 333rd Street and Pacific Highway South.\nFederal Way police encountered and shot Clark in a stairwell. Clark retreated on foot, and according to police, had ignored commands to stop reaching for a handgun on the ground. That’s when eight officers opened fire and shot Clark dead.\nFamily and friends of the victims have placed candles, flowers and condolences at the entrance of the apartment complex.\nThe King County Medical Examiner identified the shooter’s live-in girlfriend as Justine E. Baez, 24.\nCeasar A. Valdovinos, 23, died of a gunshot wound to the torso. Valdovinos was one of two men who were killed in the apartment’s parking lot about 9:35 p.m. April 21. The other man, age 47, has been identified as Bradley Fischer.\nAnother victim, 62-year-old Roland L. Scobee, was shot and killed inside his apartment while attempting to call 911. Police believe that Clark was trying to kill any witnesses.\nAbout the suspect\nDennis Clark III had no criminal history, although he was involved in two prior calls related to verbal domestic violence. He was not arrested in those calls.\nOn March 23, Federal Way police responded to a call at an apartment in the 32000 block of Military Road South. Neighbors reported hearing a female screaming for help. An investigation revealed Clark and another woman got into a dispute when she tried to break up with him. The report says Clark ripped her jacket and tried to take her phone. No injuries were reported. When officers arrived, Clark fled the scene in a vehicle registered to girlfriend Justine Baez. Police located the vehicle in the complex, which was blocked by officers, but Clark was never contacted.\nClark had a concealed pistol license. However, police say Clark had multiple guns registered in his name and was known by police to carry firearms. The Bureau of Alcohol, Firearms and Tobacco (ATF) is investigating whether Clark’s weapons were used in any other crimes. Two weapons were found at the scene: a .40-caliber Taurus semi-automatic pistol, and a pistol-grip Mossberg 500 pump shotgun with a four-round saddle.\nIn 2009, Clark was charged for harassing a Kent police dog. He was arrested after verbally provoking the dog in its police car kennel while the K9 officer was addressing another situation away from the car.\n“At the time of his arrest, Clark was armed with a gun, which he was legally licensed to carry,” Kent Police Lt. Pat Lowery told The Mirror. “He pled guilty to the charge in 2012 in the Kent Municipal Court and paid a monetary penalty, at which time the case was closed.”\nIn 2003, fourth-degree assault charges were filed against Clark, who was age 17 at the time, for allegedly shooting a girl in the buttocks with a BB gun. The incident occurred in 2002 after she broke up with him, and according to Snohomish County Juvenile Court, the charges were dismissed when the defendant turned 18.\nA Facebook page (www.facebook.com/dennis.clarkiii) lists Clark as a former student of Highline Community College in 2013, and reports that he graduated from Everett’s Mariner High School in 2004. Justine Baez was a student at Highline CC.\nPolice response\nThe eight Federal Way police officers who discharged weapons at the crime scene were placed on paid administrative leave, which is standard protocol. The Auburn Police Department is investigating. The Renton Police Department is handling media inquiries and reports that multiple 911 recordings from Sunday night could be released later this week.\nAt Monday’s press conference at City Hall, Federal Way Police Chief Brian Wilson praised the actions of officers who responded to the scene of this “domestic violence homicide.” He said the incident highlights the importance of police training to protect officers as well as the community.\n“This is one of the more dangerous calls for law enforcement,” he said, referring to the shooting-in-progress that officers encountered upon arrival.\nLearn more\n• The city will host a meeting for residents of Pinewood Village Apartments who need more resources or assistance. The meeting will begin at 6:30 p.m. Wednesday, April 24, at Federal Way City Hall, 33325 8th Ave. S.\n• Click here to read the initial report of the April 21 shootings in Federal Way. More information will be reported when available."}