{"uri": "http://www.wmcactionnews5.com/story/34314333/4-shot-2-killed-in-drive-by-shooting", "title": "4 shot, 2 killed in drive-by shooting", "dct": "Mon, 23 Jan 2017 19:53:00 GMT", "id": "9ebe7225854c36026f08b08836587f37", "content": "MEMPHIS, TN (WMC) -\nFour people were shot and two are dead after a drive-by shooting in Memphis.\nPolice said the four men were shot by multiple men inside a car on Delta Road before 2:30 p.m. Saturday.\nOne victim was taken to the hospital in critical condition and later died. A second victim was pronounced dead at the scene. Memphis Police Department later identified the victims as 32-year-old Charles Coleman and 31-year-old Joe Lobbins.\nThe other two victims were taken to the hospital. One is in critical condition; the other is in non-critical condition.\nNeighbors said dozens of shots were fired from automatic weapons while children were outside running from the bullets.\n“The passenger had like a long shotgun, looked like to me, it was so long,” one neighbor said. “And was just shooting out and started shooting. And I told my husband, ‘get down,’ and we just hit the floor and the shots kept ringing.”\nNeighbors also said the victims had just returned from a funeral when the shots were fired.\n“All of a sudden the folks started shooting and we started running,” Antonio Benson said.\nFamily members said Coleman had a one-year-old baby and another on the way. Family said Lobbins was a cousin.\n“I can't believe that stuff,” Benson said. “Stuff happens so fast. You just got to be careful out here.”\nKelan Sherrod is a close friend of Coleman and said he called him family.\n“It's sad, man,” Kelan Sherrod said. “Just...what I heard was bullets. They was riding up and down the streets shooting at each other, but there's so many innocent people out here man. I just don't know what to say.”\nPolice believe the victims knew the suspects.\n“And now they got two more funerals to go to,” a neighbor said. “All I can do is pray for the family and pray for Memphis and pray for everyone who's carrying a gun. It's not worth it.”\nPolice said the four suspects were in a black Chevy Impala with tinted windows. No one is in custody at this time.\nCopyright 2017 WMC Action News 5. All rights reserved."}