{"uri": "http://www.wdsu.com/article/victim-of-bourbon-street-mass-shooting-hit-in-hand-and-chest/8381228", "title": "Baton Rouge amateur boxer shot in hand, chest in Bourbon Street crossfire", "dct": "Wed, 30 Nov 2016 15:34:00 GMT", "id": "f21d22eb2998b8ec8aac98e37802039b", "content": "NEW ORLEANS —\nOne of the victims of the mass shooting on Bourbon Street is speaking out after he was shot multiple times.\nCorey Singleton is out of the hospital and recovering at his home in Baton Rouge after he was shot twice early Sunday, once in the hand and once in the chest.\n\"One finger was hanging off and the other one was, like, blown off, and you can look inside my finger and see my bone,” Singleton said.\n\"I tried to escape and run. I got hit in my chest and I got hit in my fingers. It knocked one of my fingers off my hand.\"\nSingleton was New Orleans for the busy Bayou Classic weekend.\nWhen he was heading back to his hotel early Sunday, gunfire erupted in the 100 block of Bourbon Street.\n\"I did hear the gunshots. That's why I turned and started running,” Singleton said. “I think it was a little too late because as soon as I turned, I got shot. As I was turning, I was getting shot. I think it was a little too late. I actually pushed my friend out of the way so he wouldn't get shot either.\"\nPolice said 10 people were wounded. One of the victims was killed.\n\"All the police started gathering, getting everybody,” Singleton said. “They actually had three other people surrounding me that was, like, on the ground. I think one of them had got shot in the neck and the other one had got shot in the leg and it broke his leg. He couldn't really get up.\"\nSingleton works in LaPlace at an oil refinery and enjoys amateur boxing.\n\"(I'm not) getting my fingers back because they were (blown) off, so it's just reality set in,” Singleton said.\nHe said doctors were able to repair his fingers, but they won’t be the same. The tips of the two fingers that were hit are gone.\nDetectives said two men got into an argument and opened fire. None of the victims who were injured in the crossfire were intended targets.\nSingleton wants the gunmen to come forward and hopes to return to some sort of normalcy soon.\n\"I don't think it will be difficult,” Singleton said. “I'm up for any challenges. I'm going to go see after a few months how this is going to work. I'm going to start back exercising, start back training, start doing things I thought I couldn't do. So I am going to find out on my own, eventually.\"\nSingleton said he will never visit New Orleans during Bayou Classic again.\nAnyone with information about the case is asked to call Crimestoppers at 504-822-1111.\nKeep up with local news, weather and current events with the WDSU app here. Sign up for our email newsletters to get breaking news right in your inbox. Click here to sign up!"}