{"uri": "http://www.mercurynews.com/crime-courts/ci_27299636/san-jose-five-shot-outside-nightclub-hosting-r", "title": "San Jose: Five shot inside packed nightclub hosting R&B star Chris Brown", "dct": "Sat, 10 Jan 2015 21:19:00 GMT", "id": "f57f92d0a68a5c0a85fe388ffbe07ebe", "content": "SAN JOSE — Five people were shot and wounded early Sunday inside a packed San Jose nightclub that was hosting a visit by popular and controversial R&B star Chris Brown. The shooting sent the crowd into a panic, with many ducking for cover and jamming club exits.\n“There was screaming, pushing and running,” said Edgar Jimenez, a bartender at the Fiesta nightclub who ducked under the bar at the nightclub at 3840 Monterey Highway. “Of course I was scared, because you’re in the middle of a shooting.”\nAccording to San Jose police, the shooting started at about 1:20 a.m. at the club across from the West Wind Capitol Drive-In. Officers arrived to find four people suffering gunshot wounds, and they were rushed to a hospital. A short time later, another shooting victim walked into a hospital.\nThe conditions of the victims were not immediately available, but police said all of the victims are expected to survive. Brown was not injured.\nThe performer, with 13.9 million followers on Twitter, later tweeted “I’m 100,” a reference to being 100 percent OK . Later, however, the official Chris Brown online forum was “temporarily closed.” A note on it asked fans to “check back later.”Video posted\nPolice said several people were detained in the aftermath of the shooting but would not release additional details.\nAccording to promotional materials and event attendees, Brown was at the nightclub as part of a VIP birthday event with celebrants including the singer’s manager. Local KMEL DJs Big Von and Black Marc were advertised as providing music for the event. The event fetched ticket prices starting at $50 and going as high as $2,500.\nSome celebrants captured the panic inside the nightclub and quickly posted the videos and audio recordings on social media, where news media picked them up. In the videos, Brown is seen performing when shots are heard and a scramble ensues inside the venue.\nAccording to promotional materials and attendees, the party was moved at the last minute from the Rockbar Theater on Saratoga Avenue in San Jose, site of the former Garden City Casino, because of capacity demands.\nThe Fiesta usually features live Mexican “banda” music, a western genre featuring brass and percussion, but the venue occasionally hosts rhythm-and-blues and hip-hop performers.\nOn Sunday morning, the grimy parking lot around the boxy nightclub was strewed with the signs of panic — broken cocktail glasses and abandoned scarves and women’s high-heeled shoes. Several celebrants who had dropped their car keys, purses or identification cards in the rush to get out showed up in the morning to retrieve them, only to be told they could not enter the crime scene.\nMost of them declined to speak to journalists, but the few who did requested anonymity out of fear for their safety. One woman said the shooting started when Chris Brown finally got on the stage near the end of the party.\n“The shooting started when he started the third verse of the song,” she said. “That’s when everybody leaned back or dived.”\nBrown, who in the video is seen being swarmed by his security team and ushered away amid the commotion, is preparing to embark on a national arena tour at the end of the month, with a concert stop in San Jose on March 6 at the SAP Center.\nThe best-selling, Grammy-winning artist has a fiercely loyal fan following even as he battles image issues stemming from a string of run-ins with the law. Those include violent incidents involving other celebrities and singers, most infamously a 2009 domestic-violence charge involving pop icon Rihanna, Brown’s girlfriend at that time. In August, Suge Knight and two others were shot at party co-hosted by Brown at a Los Angeles nightclub.\nSunday’s shooting occurred just footsteps away from a Rancho Drive home that was the site of a double shooting in September that killed a San Jose man and his son. Two Pittsburg men were arrested in that case.\nThe management of the Fiesta nightclub could not be reached for comment. Most employees leaving the building declined to speak to reporters."}