{"uri": "http://www.wafb.com/story/29621572/3-dead-9-injured-in-lafayette-shooting-at-grand-16-theater-on-johnston-street", "title": "3 dead, 1 in critical condition, 8 others injured in Lafayette shooting at Grand 16 Theater", "dct": "Fri, 24 Jul 2015 01:37:00 GMT", "id": "f5dd28aa76e74401f14bd0ad24a2a09b", "content": "LAFAYETTE, LA (WAFB) -\nThree people are dead and nine people were wounded in a shooting that happened around 7 p.m. Thursday at the Grand 16 Theater on Johnston Street in Lafayette. As of 2 a.m., one woman is still in critical condition, and others have been released from the hospital. The nine injured in the shooting range in age from late teens to early 60s.\nOfficials say this is a major crime scene and for residents to stay away from the theater.\nAccording to police, about 100 people were in the theater for a screening of \"Trainwreck\" when an unidentified 58-year-old white man began shooting. Lafayette Police say two people were pronounced dead at the scene, one victim and the suspected shooter.\nEight people were transported to area hospitals by ambulance and one person was taken to the hospital by a private party. One of the victims taken to the hospital was later pronounced dead.\nThe shooter died of a self-inflicted gunshot.\nPolice say the shooter was not in the theater very long and when he stood up and started firing, people started rushing. Chief Craft said police know he was trying to leave and they think he saw two officers who were on the scene within a minute because they were there in the parking lot. According to witnesses, he had turn around and move against the crowd after possibly spotting the officers.\nThe chief said the shooter was seated in the theater just like everyone else, and as far as anyone knows he was sitting alone.\n\"He was by himself. He sat by himself. The first two people he shot were sitting right in front of him,\" said Chief Craft.\nLouisiana State Police Explosive Ordinance Disposal and Lafayette Fire Department remain on scene conducting safety checks of the theater building, surrounding buildings, and vehicles parked in the area.\nPolice know the identity of the shooter, but have not released it at this time. Officials say the shooter has a criminal history, \"but it's old.\" Investigators will check the shooter's home and talk with friends before releasing his name. They are working to find a motive for the mass shooting. Officials do not believe anyone else is involved.\nInvestigators are checking several addresses in Louisiana and other states to learn more about the shooter. Craft believes the shooter is from out of state.\nCraft said in a press conference Thursday night that officers entered the theater to engage the shooter and found him dead. A witness on the scene said that she heard about six shots before fleeing the theater.\nLouisiana State Police are on the scene supporting the LPD. FBI is also on the scene along with Lafayette Parish Sheriff's Office and municipal law enforcement agencies.\nThe Greenbriar Apartments near the theater were evacuated by police. Louisiana State Police's hazmat was called to the scene. That evacuation is expected to be lifted soon. The other Grand Theater in Lafayette was closed as a precaution just after the shooting.\nCol. Edmonson stated suspicious items were found in the shooter's vehicle and officials were going to \"blow out the windows\" of the vehicle to make sure no other threats existed. No explosive devices were found.\nThe search K-9s \"hit on stuff inside\" the theater and officials x-rayed a few items. A lot of purses, shoes and other items were left behind in the theater.\nOnce the scene is secure, the crime lab will be brought in.\n\"Today is a day that not only angers but also saddens all of us. This should never happen anywhere, but you certainly never imagine, we never imagine it would happen in Louisiana, never imagine it would happen in Lafayette.\"\nJindal went on to say \"It's kind of an awful night that brings us together as a community, We are a resilient community.\"\nAfter visiting with some of the survivors at a hospital, Jindal said that one of the victims, who is a teacher, pulled the fire alarm to help get everyone out of the building. All the victims Jindal visited with were adults.\n\"A couple of teachers were in the theater, both of them were shot,\" said Jindal. \"One of them was released tonight. Her friend literally jumped over her and, in her account, actually saved her life. If she hadn't done that, the fellow teacher got shot, she believed that bullet would have hit her in the head. Now both teachers ended up shot. The second one, the one whose life was saved, even though she was shot in the leg she had the presence of mind to pull the fire alarm to help save other lives.\"\n\"[Law enforcement officials] ran towards danger, not away from it. The first officers could literally still hear the gunshots and they still ran towards that theater. They do an amazing job protecting us every single day,\" Jindal said.\nAmy Schumer, the star of the movie showing at the time of the shooting, tweeted her support for the community Thursday night.\n\"My heart is broken and all my thoughts and prayers are with everyone in Louisiana.\"\nCol. Edmonson says the investigation will go into the night and through Friday morning. The next update from police is expected to be held around 6:30 a.m.\nCopyright 2015 WAFB. All rights reserved."}