{"uri": "http://www.palmbeachpost.com/news/crime--law/bond-for-two-homicide-suspects-third-refuses-appear-court/AtrLYO9l7qR1ym9grYd3EN/", "title": "No bond for two homicide suspects; third refuses to appear in court", "dct": "Fri, 23 Dec 2016 00:00:00 GMT", "id": "a3be558744d9fad5bf0248b5ad440383", "content": "To view this page ensure that Adobe Flash Player version 10.2.0 or greater is installed.\nTwo of the three men arrested in three recent fatal shootings will remain in the Palm Beach County Jail until their next court appearances, a judge ruled Friday morning.\nCounty Judge Sandra Bosso Pardo ordered Joel Rodriguez, 18, and Carlos Hernandez, 19, to have no contact either with each other or their co-defendant, Augustine Rivera, 20, who refused to appear in court Friday.\nRivera is now scheduled to appear before a judge this morning, court records show. It was not immediately clear Friday when Rodriguez and Hernandez will return to court.\nRodriguez, a Boynton Beach resident, will face charges of first-degree murder in all three slayings — those of Dalton Dobkins, 17, in Wellington on Nov. 30 and of Aaron Valle, 18, and Elijah Montas, 17, outside the Serrano Apartments just east of Greenacres on Dec. 10.\nRivera, also of Boynton Beach, will face a first-degree murder charge in the fatal shooting of Dobkins, who the Palm Beach County Sheriff’s Office said was slain during a burglary attempt at his Wellington residence at the The Estates at Wellington Green, an apartment complex just beyond the Mall at Wellington Green.\nHernandez, a West Palm Beach resident, will face first-degree murder charges in the slayings of Valle and Montas, who were fatally shot during an attempted robbery, the sheriff’s office said.\nThe three slayings are among 83 confirmed homicides in Palm Beach County this year, according to a Palm Beach Post database.\nThe men were taken into custody early Thursday after Lantana police responded to reports of break-ins at the Hypoluxo Yacht Club. Rodriguez reportedly fired at an officer with a .380 caliber handgun — the same weapon believed used in all three killings.\nA fourth person suspected in the yacht club break-ins was not apprehended Thursday, Lantana police said.\nPBSO said in announcing the arrests Thursday that besides three counts of first-degree murder, Rodriguez is facing two counts of robbery with a firearm and one count of armed burglary. Hernandez faces two counts of robbery with a firearm in addition to two counts of first-degree murder. Rivera is accused of armed burglary besides the one murder charge."}