{"uri": "http://www.palmbeachpost.com/news/crime--law/pbso-identifies-teenagers-fatally-shot-east-greenacres/ju6LMO0NBOtxVx2UYs9CvK/?ref=cbTopWidget", "title": "PBSO identifies teenagers fatally shot east of Greenacres", "dct": "Mon, 12 Dec 2016 00:00:00 GMT", "id": "a7bc7abf1e88d3f2ebdfb830e66292a8", "content": "On Saturday night, just after 9 p.m., Palm Beach County sheriff’s officials responded to reports shots fired at an apartment complex near Greenacres.\nTwo teenagers had been killed.\nThose teens, Aaron Valle, 18, and Elijah Montas, 17, are the first killed in that area, just east of Jog Road and south of Forest Hill Boulevard, in years, according to a Palm Beach Post database.\nAs the wait for understanding of what led to the shootings continued, family and strangers began to take to social media remembering Valle and Montas.\nRobert Avossa, the superintendent of the Palm Beach County School District, expressed his sympathy over Twitter late Sunday night.\n“I’m saddened to hear about the violence that has impacted our youth — please pray for all those impacted by the violence in our community,” Avossa wrote.\nAlso offering support was Valle’s former first-period teacher at Palm Beach Central High School in Wellington.\n“Words can’t describe the grief that I feel. Both of these young men were seniors in high school with so much opportunity ahead,” Jennifer Briceno wrote in a Facebook post, adding, “Growing up in today’s world is tough. Now, more than ever – it takes a village.”\nOne resident of Serrano Apartments said Sunday that the shooting occurred next to her apartment in Building 6018. She had no idea about any dispute, except that the shooting occurred inside an apartment.\nKelly Francisque has lived at Serrano for four years.\n“It happened last night and they haven’t told us anything,” she said. “My kids are always at the playground here. This place used to be decent.”\nAnyone with information is urged to contact Crime Stoppers at 1-800-458-TIPS (8477).\nStaff writer John Pacenti contributed to this article."}