{"uri": "http://www.chron.com/houston/article/Child-wounded-in-gunfire-in-NW-Harris-County-6105827.php", "title": "3-year-old dies after NW Harris County shooting", "dct": "Sat, 28 Feb 2015 00:00:00 GMT", "id": "b0b1e6b971f122cdda43e837ef689ce6", "content": "A 3-year-old boy died at the hospital after he was struck in what investigators characterized as an \"accidental shooting\" at his home in northwest Harris County.\nSheriff's deputies said the incident happened about 12:30 p.m. Friday inside the two-story home in the 7400 block of Betanna near Elmont.\nThe boy, his mother, and another young sibling were the only ones in the house at the time.\nThe mother was in another part of the house when she heard a gunshot, officials said.\nShe rushed to her two children and found the 3-year-old with a gunshot to the neck or jaw area, deputies said.\nThe boy, who has not been identified, was flown by LifeFlight to Memorial Hermann Hospital at the Texas Medical Center, where he died, officials said.\nSheriff's detectives said later Friday they have not yet questioned the boy's mother, who was at the hospital.\nThe detectives said they were still trying to determine how access was gained to the firearm. They did not spell out the type of gun that was fired.\nAfter the detectives left the house, a small teddy bear was perched against the mail box in front of the home as an apparent makeshift memorial for the child.\nNext-door neighbor Richard Gilliam said the family has lived there for about a year.\n\"It's just heart-wrenching,\" he said as crime scene investigators continued their work inside the house.\nGilliam called the family next-door \"good neighbors\" and said they were quiet and generally kept to themselves. He said their children would sometimes accidently send a ball over the fence into his yard while they were playing.\n\"And my two boys would throw it back over to them,\" Gilliam said.\nMichelle Galang, who lives a few houses down the street, said she did not see or hear anything and only looked outside after hearing the news helicopters.\n\"I'm really sad and I'm praying for the family,\" Galang said.\nSheriff's deputies said the case will likely be presented to a Harris County grand jury once the investigation is complete."}