{"uri": "http://breaking911.com/mysterious-disappearance-colorado-mother-2-sons-leads-horrific-ending/", "title": "Mysterious disappearance of Colorado mother, 2 sons leads to ‘horrific ending’", "dct": "Sun, 04 Dec 2016 00:00:00 GMT", "id": "073b06ee099a5dfe75fa39bca74a9ac2", "content": "Jennifer Laber was last seen on Tuesday afternoon, when she walked out of Bear Canyon Elementary School in Highlands Ranch, about 12 miles south of Denver, with her sons, Adam and Ethan.\nAn image clipped from surveillance camera footage shows the two Laber boys, one sporting a backpack, the other trailing him in a blue and black coat.\nThe mother and her sons were reported missing hours later, on Tuesday night. Authorities released a description of the three and information on the minivan that Jennifer Laber was last seen driving, a silver Chrysler Town & Country.\nThe next day, though, the silver van was spotted parked outside a closed sports equipment store in Lone Tree, about five miles from Highlands Ranch. And inside the vehicle were the bodies of Jennifer Laber, Adam, 3, and Ethan, 5.\n“We certainly did not see this horrific ending that this case has come to today,” said Chief Deputy Steve Johnson of the Douglas County Sheriff’s Office, according to the Denver Post. “We do not have a lot of answers.”\n“It’s about as bad as it gets,” family spokesperson and neighbor Brandon Tartler told KUSA-TV.\n“Adam and Ethan were little bundles of energy,” Andrew Pena, another neighbor, told the Denver Post. “They were full of life and really smart. This is a real tragedy.”\nFew details about the deaths and subsequent investigation were released Wednesday, in the hours after the bodies were discovered. But police in a news release said that preliminary information suggested there was “no danger to public at this time.” Authorities also said the boys’ father wasn’t a suspect.\n“A proper background check protocol was followed,” Beals said of the purchase of the gun, which was later located in the minivan.\nPreliminarily autopsy results show that Jennifer Laber died from a single gunshot wound, which evidence suggests was self-inflicted, and that Adam and Ethan each died from a single gunshot wound, Beals said. The manner of death in all three cases was still pending.\nThe Denver Post reported that authorities were not calling the incident a murder-suicide on Thursday but have said there were no suspects.\n“We’re just not ready to put that label on it yet,” Beals said, according to the newspaper.\nPolice found the Glock in the minivan with the bodies. No suspects. PD stopping short of calling case a murder-suicide.\nAuthorities began searching for the trio after a missing-persons report was filed at around 8 p.m. on Tuesday, the Douglas County Sheriff’s Office said in a news release. Responding deputies learned that Jennifer Laber hadn’t returned home and was last seen with her sons at the school at around 2 p.m. that afternoon.\n“At the time we were notified,” Johnson told reporters, “there was no indication that it would come to this horrific ending. There were no red flags.”\nThe bodies were found Wednesday morning, after police in Lone Tree received a call about a silver van outside a vacant store, the agency said in a news release. The caller thought the van was the same one referenced in the missing-persons case.\nOfficers on the scene determined that it was the same vehicle and confirmed that three people were dead inside. The bodies were tentatively identified as Laber and her two sons on Wednesday, according to a news release.\n“This is a tragic event and we wish it would have had a different outcome,” Lone Tree Police Chief Ron Pinson said in the release. “Our thoughts are with the family and loved ones during this difficult time.”\nThe three deaths left neighbors of the Laber family reeling. The Denver Post this week reported that some brought food trays to the Laber home, and a woman tied balloons to a tree. She also left flowers — red roses.\n“There’s a lot of grieving going on,” Tartler, the neighbor, told the newspaper. “It’s a shock . . . It’s unfathomable.”\nTartler, who described Adam and Ethan as “loving, joyful, good kids,” was asked about what neighbors were doing, to which he responded: “respecting privacy,” and “helping.”\n“It’s basically all we can do,” he said. “It’s a blind-side.”\nThe Denver Post reported that the two boys were “well liked in the neighborhood.” Pena, a neighbor who spoke with the Denver Post, called their mother “a really sweet person,” saying there wasn’t anything that might indicate trouble or cause concern.\n“Her little boys were full of excitement,” another neighbor, Phyllis Dubas, told the newspaper. “She was with the children all the time. It’s so very, very sad.”"}