{"uri": "http://fox6now.com/2016/08/14/police-identify-6-of-7-homicide-victims-killed-during-a-violent-weekend-in-milwaukee/", "title": "Police identify 6 of 7 homicide victims killed during a violent weekend in Milwaukee", "dct": "Sun, 14 Aug 2016 19:52:00 GMT", "id": "87593e2b63986c9a514c4dcdb6019c2c", "content": "MILWAUKEE — Milwaukee police have released the names of six of the seven homicide victims killed this weekend.\nThe first fatal shooting happened around 6:00 p.m. Friday near Sherman and Burleigh. One man was killed at that location, according to the medical examiner.\nPolice say the victim is a 33-year-old man, identified as Steve Earl, who was driving on Sherman when he was shot. His vehicle then collided with another vehicle that was turning onto Burleigh from Sherman. The occupants of that vehicle sustained minor injuries.\nThe circumstances surrounding this shooting are under investigation.\nThe second fatal shooting happened just after 1:00 a.m. Saturday near 23rd and State. Two men were killed there, according to the medical examiner.\nPolice said this shooting involved a 21-year-old man, identified as Tyrone Richmond and a 23-year-old man, identified as Quishawne Williams.\nPolice said this incident was robbery related.\nAt approximately 2:30 a.m., police say a fight at All Stars near 41st and Fond du Lac spilled into the parking lot where two men, ages 34 and 36, were shot and killed.\nThey have been identified as Earl Hubanks and Shomaray Jackson.\nPolice say a 26-year-old woman and 30-year-old man were also injured in this shooting.\nThe fourth fatal shooting happened near 29th and Lisbon around 10:00 p.m. on Saturday.\nA 23-year old Milwaukee man, identified as Worn Jones was stabbed during a dispute with another male around 10:00 p.m.\nJones died at a hospital. Milwaukee police continue to seek the suspect.\nAnother homicide happened Sunday, August 14th around 4:30 p.m. near 28th and Lisbon — marking six homicides over the weekend.\nOfficials with the Milwaukee Fire Department responded to an alley near 28th and Lisbon.\nPolice say a woman was taken to the hospital from the scene, but she passed away."}