{"uri": "http://www.mcdowellnews.com/news/police-vortex-gunman-in-custody/article_6294315c-1f1d-11e3-9e10-0019bb30f31a.html", "title": "Police: Vortex gunman in custody", "dct": "Mon, 16 Sep 2013 00:00:00 GMT", "id": "ae8f58d6f03eb6bffc7faa6eebc99f38", "content": "We hope you will enjoy this free article on The McDowell News. You're entitled to view 10 free articles every 30 days, and you currently have 1 remaining. Then, if you enjoy our site and want full access, we'll ask you to purchase an affordable subscription.\nThe alleged gunman in Saturday’s shooting at the Vortex nightclub was arrested in Forest City around 4:30 p.m. Monday, according to Lt. Scott Spratt of the Marion Police Department.\nOfficer Eric Rodriguez charged Earl Spencer Boyce Jr., 35, of Forest City, with one count of assault with a deadly weapon inflicting serious injury with intent to kill, three counts of assault with a deadly weapon inflicting serious injury and one count of possession of a firearm by a felon.\nSpratt said more charges are possible. He also added that so far, Boyce is the only suspect charged in this case. At this time, there is no motive in the shooting.\nIn the early morning hours on Saturday, several people were shot outside of the Vortex on Finley Road in Marion after a night of birthday celebrations and what was listed on the Vortex Facebook page as a tribute to the late rapper Tupac Shakur.\nThree people were transported to McDowell Hospital with non-life threatening injuries and one was sent to the Memorial Mission Trauma Center with what was thought to be serious injuries, according to the EMS. All were later released from the hospitals.\nBoyce's bond was set at $250,000 and his first appearance in court is Wednesday. Spratt said Boyce has an extensive criminal history.\nJake Asta, owner of Vortex, released this statement on Saturday concerning the shooting:\n\"My condolences are to the victims and this is such an unfortunate event. We (Vortex) had a birthday/ family reunion party Friday night with a family that I have had a good working relationship in the past, and we agreed to do concessions for their event. I had no reason to think there would be trouble. There was a family related scuffle inside that was over 15 minutes prior to the shooting that took place outside. No one inside was aware of the shooting, until people started exiting slowly. It really had nothing to do with us (Vortex). We try to maintain a chill atmosphere and this is definitely not a typical night for us.\""}