{"uri": "http://wsvn.com/news/local/4-shot-1-possible-fatality-at-miami-nightclub/", "title": "1 dead, 3 injured after Miami nightclub shooting", "dct": "Sat, 10 Sep 2016 00:00:00 GMT", "id": "a54fe69e012039cc5d8963d22f89f74a", "content": "MIAMI (WSVN) - One man was killed and three other people were injured after a shooting outside a nightclub in Miami, Saturday morning.\nCity of Miami Police responded to the scene outside El Nuevo Romance Restaurant & Nightclub, located at 3451 N.W. 36th St., at around 6:15 a.m.\nAccording to Miami Police Detective Rene Pimentel, officials encountered four victims just feet away from the club. “There was an exchange of gunfire. One person was fatally wounded,” he said.\nPolice said it all started as an argument that apparently escalated, shortly after 6 a.m. “There are several different casings on the scene, different weapons,” said Pimentel.\nOne man was pronounced dead at the scene. He was later identified as 24-year-old Michael Tito Lorenzo.\nParamedics rushed another male victim to Ryder Trauma Center in critical condition. The other two victims, a man and a woman, were transported in stable condition.\nA fifth male victim also required medical attention after breaking a leg while trying to jump a fence.\nCrime scene investigators combed the street for evidence and interviewed witnesses. “We do need the public’s help, because obviously there were plenty of people out here,” said Pimentel.\nIt is unclear if the club’s cameras captured the shooting. People going in and out of the business after the scene had been cleared declined to comment on the incident.\nPimentel said there has been trouble at this club before. “It appears to have a bit of a history, as far as this place and violence of some sort,” he said.\nPolice said the motive behind the shooting remains unclear. No arrests have been reported.\nIf you have any information on this shooting, call Miami-Dade Crime Stoppers at 305-471-TIPS. Remember, you can always remain anonymous, and you may be eligible for a $3,000 reward.\nCopyright 2017 Sunbeam Television Corp. All rights reserved. This material may not be published, broadcast, rewritten or redistributed."}