{"uri": "http://chicago.suntimes.com/news/boy-15-shot-to-death-in-englewood/", "title": "Two teens charged with murder of grandson of Danny Davis", "dct": "Fri, 18 Nov 2016 20:07:00 GMT", "id": "5e7084de894be2879c64885d93d91834", "content": "Two teenagers have been charged with the fatal shooting of Congressman Danny Davis’ 15-year-old grandson in Englewood Friday evening.\nA 16-year-old boy and 17-year-old girl are each charged with first-degree murder, according to Chicago Police. Their names were not released Sunday morning because they are juveniles.\nThey are scheduled to appear in bond court Sunday, police said.\nPolice say a dispute over gym shoes led to the fatal shooting of 15-year-old Javon Wilson.\nAbout 6:45 p.m. Friday, Wilson was inside his home in the 5600 block of South Princeton when two people came in, started arguing with him and then shot him in the head, according to Chicago Police and a statement from the congressman.\nWilson was pronounced dead at the scene at 7:32 p.m., according to the Cook County medical examiner’s office.\n“I grieve for my family,” Davis said. “I grieve for the young man who pulled the trigger. I grieve for his family, his parents, his friends, some of whom will never see him again.”\nWilson’s mother had just left to pick up food before the shooting, leaving the boy with his two brothers, ages 8 and 14; his 16-year-old sister, and an uncle, Davis said.\nDavis said he was told a 15-year-old boy traded slacks for gym shoes with Wilson’s 14-year-old brother and went to Wilson’s house with a 17-year-old girl to reverse the trade when the boy shot Wilson.\nDavis wondered how the 15-year-old boy obtained a gun and who allowed him to have it. He said the answer is that “the availability of guns is so prevalent in America you almost can’t tell who has a gun” anymore.\nA spokeswoman for Davis said Wilson was a well-liked sophomore at Perspectives Charter School and was an avid basketball fan.\n“What could have prevented this tragedy? Better education, more supervision after school activity. Better parenting,” Davis said.\nOn Friday, Chicago surpassed 700 homicides so far this year.\nShootings in the city are also far surpassing the 2015 totals, with Chicago Police reporting 3,165 shooting incidents through Nov. 16. More than 3,290 people have been injured in those shootings, and that does not include the 629 who died as a result of being shot.\nContributing: Associated Press"}