{"uri": "http://www.doingitlocal.com/2017/01/bridgeport-news-2-youths-arrested-sweet-16-shooting/", "title": "Bridgeport News: 2 Youths Arrested In Sweet 16 Shooting", "dct": "Sat, 14 Jan 2017 00:00:00 GMT", "id": "2565e2271ceb302cfb7df200f3b64720", "content": "Bridgeport – Bridgeport Police today are announcing the arrests of two juvenile suspects in connection with a shooting incident on November 12, 2016 where five people were shot at Club Sportivo, located at 2500 Park Avenue in Bridgeport.\n“I want to thank the men and women of the Bridgeport Police Detective Bureau for their round the clock efforts and good, thorough police work that has led to the arrests of these two individuals,” said Bridgeport Police Chief Armando “AJ” Perez. “We will continue to investigate this crime until we bring all those responsible to justice. Bringing guns to a teenage sweet 16 and crashing the party, causing a ruckus where people end up getting shot is totally unacceptable. Playing around recklessly with illegal guns puts people’s lives in danger and we have zero tolerance for it in Bridgeport. If anyone has further information about this crime, I ask that you call the Bridgeport police anonymous tips line 203-576-TIPS or 203-576-8477.”\nOn November 12, 2016 at approximately 2239 hours, Bridgeport Police began to receive multiple calls about a large group of people fighting both inside and outside Club Sportivo, located at 2500 Park Avenue Bridgeport. Police dispatch then began receiving 911 calls of “shots fired” at this location. Approximately twenty police officers responded to the scene and located five (5) gunshot victims. These victims were transported to local hospitals, and all five survived their injuries. Several days later, a sixth gunshot victim was located, who initially did not seek medical treatment. Due to the complexity of the crime scene, all evidence processing was completed by the Bridgeport Police Department Identification Unit.\nThis investigation began on November 12, 2016 and is still ongoing. After speaking with multiple witnesses, victims and suspects, and reviewing surveillance of the scene and evidence, detectives determined the following:\nOn November 12, 2016, Club Sportivo was rented out to the family of a 16 year old female to host a Sweet Sixteen party. This party was by invitation only, but at approximately 2200 hours, the hosts of the party began to charge admission for an “after party”. Many people who were not invited to the Sweet Sixteen paid admission to enter the party, and some were patted down for weapons by adult males, who appeared to be acting as security. At approximately 2220 hours, a fight erupted on the dance floor, and spilled out into the vestibule. Several males were then seen displaying firearms inside the club. Several minutes later, shots were fired outside the club, resulting in six victims being shot.\nBased on this investigation, probable cause existed to charge two juvenile males with various assault and weapons offenses. Juvenile #1 is a 15 year old male. An arrest warrant was issued for him on January 6, 2017 charging him with Criminal Attempt at Assault first Degree, Carrying a Pistol without a Permit, Unlawful Discharge of Firearms, Reckless Endangerment in the First Degree and Breach of Peace in the Second Degree. Juvenile #1 was arrested on January 9, 2017. Juvenile #2 is a 17 year old male. An arrest warrant was issued for him on December 21, 2016 charging him with Carrying a Pistol Without a Permit, Unlawful Discharge of Firearms, Reckless Endangerment in the First Degree and Breach of Peace in the Second Degree. Juvenile #2 was arrested on this warrant on January 13, 2017.\nDue to the fact that this is an ongoing investigation, and that those arrested so far are juveniles, no additional information will be released at this time."}