{"uri": "http://www.ctpost.com/policereports/article/Two-arrested-in-shooting-at-Sweet-16-10855878.php", "title": "Sweet 16 party shooting in Bridgeport: Two teens arrested, charged", "dct": "Fri, 13 Jan 2017 00:00:00 GMT", "id": "6e158514359e0674e8e8e88c18737c8e", "content": "BRIDGEPORT — Two juveniles have been arrested in connection with a shooting at a Sweet 16 birthday party that left six people injured.\nBoth were charged with carrying a pistol without a permit, unlawful discharge of firearms, first-degree reckless endangerment, and second-degree breach of peace.\nThe first suspect, a 15 year-old boy, was arrested on Monday. He was additionally charged with criminal attempt at first-degree assault. The second, a 17-year-old boy, was arrested Friday.\n“The detective bureau did ... great attention-to-detail work and were able to secure two warrants at this time,” Bridgeport Police Chief Chief Armando Perez said in a press conference in his Congress Street office Friday afternoon.\n“It’s a sad ... you see the age of the people pulling the trigger,” City Council President Thomas C. McCarthy, D-133, said at the press conference. “It makes you wonder about their home life and things like that... but it doesn’t matter what your age is, (but) how you live your life.”\nThe invitation-only party at the Circolo Sportivo on Park Avenue was being held on Nov. 12 in honor of a girl’s 16th birthday. The hosts began charging admission to an after-party at about 10 p.m. and a fight soon erupted on the dance floor and spilled into the vestibule, police said.\nA melee broke out inside the club, according to Perez, and was followed by shootings outside.\n“That evening, we heard the shots from our house,” said City Councilwoman Jeanette Herron, D-133, at the press conference. “I was mortified... we’re not going to tolerate (violence).”\nPart of the melee was caught on video.\nFive victims—four males and one female—were rushed to hospitals with non-life-threatening gunshot wounds on the night of the shooting, according to police spokesman Av Harris. A sixth victim who did not seek medical treatment was found by police several days later.\nMore than 300 people were at the party when shots were fired.\nRepresentatives of Circolo Sportivo declined to comment Friday. Perez stuck by his November comments that the incident could have been prevented by hiring police security.\n“With a police vehicle outside the venue, it wouldn’t have happened,” he said.\nCity councilors have warmed to an idea proposed by Perez in November to have an ordinance requiring a hired police officer for large parties.\n“We are not there yet ... we’re definitely working on it,” said McCarthy, who anticipated producing a draft ordinance in two or three months.\nStaff writer Frank Juliano contributed to this report."}