{"uri": "http://www.wtol.com/story/34250985/teenager-shot-in-east-toledo-police-say", "title": "Man arrested after teen shot, killed in east Toledo", "dct": "Fri, 13 Jan 2017 03:26:00 GMT", "id": "9cfa3c6c0c8eccb22c75d6fc13bfed2c", "content": "TOLEDO, OH (WTOL) -\nToledo police have arrested a 19-year-old man accused of shooting and killing a 14-year-old Thursday night.\nOfficers were called to the 1500 block of East Broadway, near Oakdale just after 7 p.m.\nAccording to police, Dominique Alexander, 14, had been shot at least once. He was taken to St. Vincent's Hospital where he later died.\nDuring the investigation, officers arrested Leonard Temple, 19, a friend of the victim. He's charged with reckless homicide, child endangering and tampering with evidence.\nThough, police charged Temple with reckless homicide, they know he didn’t plan it and don’t believe he wanted to do it. But what he was doing at the time when the gun went off was wrong.\n“More of an unfortunate set of circumstances than anything else,” Lt. Joe Heffernan said. “Yet again, we have another young life lost because of an unsecured gun in the home and falls in the wrong hands and is mishandled, and now, we have a 14-year-old dead.”\nPolice are still working to determine who was the owner of the gun and why it was unsecure and left within reach of Temple.\nAlexander was an eighth grader at East Broadway Elementary School. A TPS spokesperson says grief counselors are on hand at the school for students and staff.\nTemple is currently being held in jail on a $500,000 bond. He will be back in court on Jan. 17.\nRegardless of the answers police are looking for, Alexander is the third, young life lost in Toledo within a month, after a gun has been left out in a home. It is the second homicide of the year for the city of Toledo.\nThe police department recently purchased gun locks and are working to have an event to get them out to those who need them. If you can’t wait, they are available at the Safety Building downtown."}