{"uri": "http://www.whio.com/news/crime--law/woman-shot-herself-accident-trotwood/Wh429MArnZ80QKx0nSqxbO/", "title": "Woman shot herself by accident in Trotwood", "dct": "Sun, 16 Oct 2016 00:00:00 GMT", "id": "20a21b4b23dd10020098dcae1115ad45", "content": "The principal of a Florida elementary school has been removed from the school after police say she pawned a school computer at a West Palm Beach pawn shop five times in the past year.\nWest Riviera Elementary Principal Tonja Lindsey-Latson, 48, was arrested Thursday by school district police. Investigators said they caught her pawning a school-owned laptop this month and claiming it as her own.\nShe was arrested on a charge of false verification of ownership and booked into the Palm Beach County Jail. She was later released on a $5,000 bond. She is suspended with pay from the school while the case proceeds.\nEach time Lindsey-Latson pawned the Apple MacBook Pro laptop, she received between $300 and $500, police say. In the first four cases, detectives say she recovered the laptop after paying the loan amount, plus a cash fee, at Cash America Pawn on Okeechobee Boulevard in West Palm Beach.\nPolice say they caught on after she pawned it for a fifth time, for $300, on Jan. 17, a transaction that triggered an alert from an Internet service that monitors pawn shop transactions.\nConfronted by a school district detective, Lindsey-Latson first claimed that the laptop was hers, then said that she confused it with an identical one that she owned, according to the arrest report. Later, she admitted that she did not currently own a similar computer.\nShe told the detective that she had pawned it because she had a personal emergency and needed money. Each time she pawned it, she said, she retrieved it after receiving her next paycheck or money from some other source.\nLindsey-Latson did not respond to a call to her cell phone seeking comment.\nOn Wednesday, school district officials alerted parents at West Riviera Elementary that Lindsey-Latson would be \"absent from campus for an extended period of time for personal reasons.\"\nIn her place, the school's assistant principal, Willie Nelson, will lead the campus, Deputy Superintendent David Christiansen wrote.\nLindsey-Latson has been principal at West Riviera since 2011, where she currently earns $93,200 a year, school district records show.\nIn a statement, the school district confirmed that she had been removed from the school.\n\"Ms. Lindsey-Latson is suspended with pay at this time,\" the district said. \"We will begin our internal investigation once the criminal investigation is complete.\""}