{"uri": "http://www.postbulletin.com/news/crime/man-charged-with-second-degree-murder/article_50f94bae-b214-5075-8e89-bac9e1165b48.html", "title": "Man charged with second-degree murder", "dct": "Sat, 13 Aug 2016 00:00:00 GMT", "id": "b05f0779fd8dcb97fb30eeb3bc98c16f", "content": "The man accused of firing a gun inside a car early Wednesday morning, killing his friend, has been charged with second-degree unintentional murder.\nAbdulkadir Omar Mohamed, 30, made his first appearance Friday in Olmsted County District Court. He remains in custody in lieu of $200,000 conditional bond and is due back in court Aug. 23.\nIn addition to the murder charge, Mohamed faces one felony count each of second-degree manslaughter and reckless discharge of a firearm, as well as one count of carrying a pistol without a permit, a gross misdemeanor.\nAbdullahi Omar Sheikh, 31, died minutes after the shooting. An autopsy performed Wednesday morning revealed the bullet entered the upper right portion of his body, then ricocheted into his heart.\nVideo surveillance from the area revealed Mohamed, who initially told police he was the only passenger in the vehicle and had been riding in the front seat, was actually in the back of the car. Another male, considered a witness in the case, was in the front passenger seat.\nIt likely wasn't intentional, said Rochester Police Capt. John Sherwin, but caused by careless handling of the gun — which was found in a large planter near the vehicle.\nThe case began at 2:23 a.m., when members of an ambulance crew saw a car traveling north on 14th Avenue Southwest at a high rate of speed. They watched as the vehicle went through the red light at the intersection of 14th Avenue and Second Street Southwest, turned \"slightly left\" on Second Street and crashed into the curb.\nThe ambulance personnel called 911 immediately, then watched as two men got out of the car on the passenger side, arguing loudly. Unaware that Sheikh was in the driver's seat and concerned about their own safety, the ambulance drove off while requesting law enforcement.\nWhen officers arrived, Sheikh was unresponsive in the street; Mohamed was standing near him. Mohamed told an officer they crashed while turning onto Second Street; he climbed into the back seat and exited through the rear passenger-side door, then tried to pull Sheikh out of the car.\nWitnesses at a nearby hotel who heard the crash, however, said the car was carrying three people. The driver was pulled out by the other two, one of whom was Mohamed; the other man then ran away.\nMore surveillance video from the area confirmed the witnesses' version of events, court documents say.\nMohamed continued to insist he was the only passenger and was asleep at the time of the crash. He couldn't get out via the front passenger door, he said, so climbed over the front seat and exited from the back.\nLater that day, officers located the front-seat passenger, who confirmed what the video reportedly showed: Sheikh was driving, and Mohamed was in the rear passenger seat.\nThe passenger said Mohamed had a gun, and at one point, handed it to him. The witness said he cocked the hammer and handed the gun back to Mohamed. As they drove near Saint Marys Hospital, the passenger heard the pop of a gun and the car hit the curb.\nHe told investigators that Sheikh asked, \"Did you just shoot me?\" then collapsed sideways. The witness tried to reach the steering wheel, but the vehicle crashed. He tried to help Mohamed pull Sheikh from the car, the man said, but got scared and left to go home.\nFurther investigation of the vehicle itself indicates the path of the bullet; based on the angle of the bullet's entry into the upper right side of the driver's seat and Sheikh's body, \"it is apparent that the shot was fired from inside the car in the rear passenger seat,\" the complaint says."}