{"uri": "http://kimt.com/2016/08/10/rochester-police-investigating-suspicious-death/", "title": "UPDATE: Suspect in Rochester homicide facing new charge", "dct": "Wed, 10 Aug 2016 05:19:00 GMT", "id": "df93dc11c0b2921b381a41cd4218792c", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nUPDATE: Abdulkadir Mohamed, 30, is now being charged with second-degree unintentional murder after the shooting death of 31-year-old Abdullahi Omar Sheikh last week.\nAuthorities say he was handling a gun that fired inside a car and struck Sheikh. Despite being just a block away from the emergency room, he died from a single gunshot wound to the torso.\nInvestigators say both men were friends and they don’t believe he meant to kill the man.\nThis was Rochester’s second homicide of the year.\nPrevious coverage below.\nROCHESTER, Minn. – Rochester police say the man detained Wednesday after a fatal shooting is now facing charges of second-degree manslaughter and reckless discharge of a firearm.\nAbdulkadir Mohamed, 30, was arrested at the scene after police say another suspect fled.\nAt this point, investigators think these three men were friends and went out to downtown bars carrying a handgun. When they supposedly had a fight, the gun went off in the backseat where Mohamed was, piercing the driver’s seat and killing 31-year-old Abdullahi Omar Sheikh.\nOn Wednesday night, officers found the third man who was in the car at the time — at this point, he’s only a witness.\nPolice are still looking for a piece of evidence — a gray Georgetown Hoyas basketball jersey. They think it may be in the area from 16th Ave. to Fourth Avenue, between Seventh Street and Second Street.\nPrevious coverage below.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nROCHESTER, Minn. – Police are asking for the public’s help in Wednesday’s fatal shooting.\nResidents in the Kutzky and Cooke Park neighborhoods are being asked to check their yards for discarded clothing. Rochester police say there are particularly looking for a gray Georgetown Hoyas basketball jersey. They think it may be in the area from 16th Avenue to 4th Avenue, between 7th street and 2nd street.\nAnyone who locates an item of clothing is asked to immediately call (507) 328-6800.\nThe Rochester Police Department also says it has accounted for all the people who were in the vehicle with Abdullahi Omar Sheikh before he was shot to death. No arrests have been made but the investigation continues.\nUPDATE: Rochester police have identified the victim in Wednesday morning’s shooting as Abdullahi Omar Sheikh, 31, of Rochester.\nROCHESTER, Minn. – One man is in custody and police are searching for a second suspect after investigators say a 31-year-old man was shot while driving early Wednesday morning.\nOfficers arrived at the intersection of 14th Ave. And Second Street SW just before 2:30 a.m. to respond to a crash. While police were on their way, witnesses told them two men were trying to drag a third out of the vehicle.\nBy the time they got there, the victim was unresponsive and suffering from a single gunshot wound to the upper torso. CPR was performed before the man was taken to the hospital and pronounced dead. At this time, investigators believe he was shot while driving, causing the crash.\nPolice arrested 30-year-old Abdulkadir Mohamed, of Rochester, at the scene for a felony warrant out of Goodhue County. Another passenger fled before officers arrived, witnesses told police.\nInvestigators found a handgun at the scene and an autopsy is being done Wednesday.\nThis is Rochester’s second homicide investigation this year.\nStay with KIMT and install our free app for the latest on the investigation.\nPrevious coverage below.\nUPDATE: Traffic is opening back up at 15th Ave. SW. We expect to learn more about the investigation by 8:30 a.m.\nROCHESTER, Minn. – The Rochester Police Department is investigating a suspicious death at one of the busiest intersections in town.\nThe intersection at 14th Ave. and 2nd St. SW will be closed until at least 6:15 a.m. because it is an active crime scene.\nSo far it has been confirmed that an adult male has died from a gunshot wound at the hospital.\nAt this time, no other information is being released. Stay with KIMT for the latest details.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}