{"uri": "http://m.ajc.com/news/news/crime-law/second-15-year-old-in-two-days-shot-to-death-in-un/nnwst/", "title": "Second 15-year-old in two days shot to death in Union City", "dct": "Tue, 06 Oct 2015 00:00:00 GMT", "id": "633565e7823f51fed9e042806caee97d", "content": "A 15-year-old boy died after being shot in the chest at a south Fulton County apartment complex, police said Tuesday. It was the second fatal shooting in two days involving teenagers within a half-mile in Union City.\nAround 4:40 p.m. Monday, officers were called to the Landings at Oak Hill apartment complex on a report of a shooting, according to Officer Chris Murphy with Union City police. When officers arrived, 15-year-old Benson West was dead.\n“Investigations revealed that the victim was hanging out with a group of male friends in a nearby apartment,” Murphy said in an emailed statement. “One of the subjects had a gun in his possession that went off due to improper handling. The fired round struck the victim in the chest, causing a fatal wound.”\nWest lived in College Park, the Fulton County Medical Examiner’s Office said Tuesday. He was a freshman at Banneker High School, a spokeswoman for Fulton schools said.\nA second teenager, Ja’Quan Perry, was arrested and charged in connection with the shooting, police said. Perry, 17, was charged with involuntary manslaughter, possession of a firearm during a crime and reckless conduct. He was booked into the Fulton County jail, where he was being held Tuesday afternoon on $28,000 bond.\nThough the shooting deaths were not related, West was the second 15-year-old killed in as many days in Union City.\nSunday night, Amira Isis Cameron was shot to death at the Oakley Shoals Apartment Complex, according to police. Cameron was a sophomore at Langston Hughes High School.\nThe girl’s father, Horace Cameron, said witnesses told him a group of men in a rust-colored Chevrolet Malibu fired at someone else and struck his daughter instead.\n“All I know,” Horace Cameron said, “is that my son called me and said, ‘Daddy, Amira just got shot in the head.’”\nNo arrests had been made Tuesday in the case, which police have called a homicide.\nVisitation for Cameron will be held all day Friday at Gus Thornhill’s Funeral Home in East Point. Her funeral will be at 1 p.m. Saturday at St. Mark African Methodist Episcopal Church in Atlanta."}