{"uri": "http://wishtv.com/2015/08/27/3-bodies-found-inside-henry-county-home/", "title": "Father and two children found dead inside of home in Henry County", "dct": "Thu, 27 Aug 2015 11:59:00 GMT", "id": "d52fbb722ccb4690861144c1cc726a50", "content": "HENRY COUNTY, Ind. (WISH) — A man and his two kids were found dead inside of their home in Henry County on Thursday morning.\nIt happened in the 5500 block of West Old National Road in Raysville near Knightstown.\nThe Henry County Prosecutor identified the man as Joseph Horn, 48.\nDeputies with the Henry County Sheriff’s Department did a welfare check after neighbors said the kids never showed up for school.\nCrime scene tape blocked off what used to be the home of Joseph Horn. Deputies said the 48-year-old man died from an apparent gunshot wound.\n“This is such a strange incident. It’s just unusual for something like this to happen around a nice town,” said neighbor Ross Manche.\nDeputies said they arrived on scene before 9:00 a.m. and could see a little boy through the window, but once inside they realized the boy was dead.\nDeputies searched the home, also finding his 11-year-old sister lifeless.\n“There’s just no feeling to explain how bad the situation like this is for the kids and all the families involved,” said Manche. “It’s bad for their relatives and everybody left has to live with it.”\nDetectives spent hours gathering evidence inside of the two-story home.\nA man living across the street said Horn’s family moved in a couple of months ago.\n“I think they just wanted to get out of Indianapolis. They were looking for a nice, big, old home and that fits the bill,” said Mattix.\nMattix said he heard from a friend that the couple was going through a divorce.\nAccording to court records, Joseph Horn and his wife had a court hearing Wednesday.\n“I met him one time for 20 minutes. He came over and stood in my kitchen and talked and introduced himself that’s about it, came over with his little boy,” said Mattix.\nDeputies have not said how the children died or where everyone was found inside.\nInvestigators do not believe anyone else was connected to this crime."}