{"uri": "http://abc7ny.com/news/no-arrests-yet-in-shooting-of-7-year-old-who-called-911-after-being-hit/1224805/", "title": "7-year-old boy calls 911 after being struck by stray bullet while inside Paterson home", "dct": "Tue, 01 Mar 2016 00:00:00 GMT", "id": "546093f3bc78f3da7f406cbfd2e2149f", "content": "PATERSON, New Jersey (WABC) --\nPolice are looking for a suspect in the shooting of a 7-year-old boy who called 911 after being struck by a stray bullet in his Paterson home Monday.\nLeaving her Paterson home Tuesday night, Diana DeLeon told Eyewitness News her son Jaiden is a trooper. He is now recovering at home after being released from the hospital.\nA photo of Jaiden in the hospital holding a medal given to him by Paterson Police Department for being brave:\nThe 7-year-old is getting much needed rest after being hit just inches from his heart by a stray bullet that pierced through the family's living room window.\n\"He still has a bullet inside. They couldn't take it out because he could bleed out. We're glad that everything is fine. Just the investigation now and finding a suspect,\" said Jennifer Rodriguez, the victim's aunt.\nJaiden was playing with his siblings and cousins inside his family's home on Rosa Parks Boulevard.\nThey heard six shots and one struck the boy.\nThe second grade honor roll student was brave, he called 911, explained that he was shot, and then calmly gave his address.\n\"He told my grandmother, 'I'll take the phone and I'll call them myself,' and he called, he gave them the address, and he was very brave, didn't drop a tear at all,\" Rodriguez said.\nResidents say they're tired of living in fear.\nA year and a half ago 12-year-old Genesis Rincon was killed after being caught in the crossfire of a shootout\nCouncil member Alex Mendez says city leaders and police are putting together a plan to make this neighborhood safer.\n\"I had a conversation with the director of the Police Department. One of the things that they're doing is more patrols around the neighborhood, making sure that there is a police presence,\" said Alex Mendez, a council member.\n\"There have been bullets daytime, nighttime, at any hour and a hitting the kids. Paterson is always on the news for this,\" said Lourdes, a resident.\nJaiden's mother told Eyewitness News that they are staying with relatives because they feel it's not safe for them to stay in their home."}