{"uri": "http://www.baltimoresun.com/news/maryland/crime/bs-md-ci-shootings-20161201-story.html", "title": "Suspect who shot six in Northwest Baltimore, killing two, remains at large", "dct": "Fri, 02 Dec 2016 11:46:00 GMT", "id": "1855479c5322094030f53901f4c64646", "content": "Surveillance footage shows four men lingering outside the Stop 1 Food Store in Northwest Baltimore Wednesday evening, oblivious to what's about to come.\nA man in a striped Adidas jacket talks animatedly, gesturing with his hands. A customer walks past the group and exchanges a few words. A child sits in the passenger seat of a hatchback parked nearby.\nCreeping up from the side of the building comes a man in a hoodie. He fires a handgun in quick bursts. One man, shot in the back, crumples to the ground. The man in the Adidas jacket turns and runs, as do two others. The gunman continues spraying bullets.\nThen he turns to the victim bleeding on the ground at his feet.\nHe stands over him and pulls the trigger repeatedly, emptying the weapon until the victim's legs stop moving.\nThe brutal shooting Wednesday night at the corner of Duvall Avenue and Garrison Boulevard in Garwyn Oaks left two dead and four injured — the worst such attack in the city since eight people were wounded in late September in East Baltimore.\nFive people have been killed within a half-mile radius of the convenience store in three separate shootings since Nov. 15. They are among the 290 people killed in the city this year.\nR. Johnson owns the Right Cut, a barbershop across the street from the Stop 1 Food Store. One of the victims was found bleeding outside.\n\"You know what I call my neighborhood?\" he asked. \"Little Beirut.\n\"It's got to stop.\"\nBaltimore is on pace to cross the 300-murder threshold for the second year in a row — a sad milestone for a city that just five years ago saw homicides fall under 200 for the year.\nThe spike in killings that began during the unrest after Freddie Gray's death last year has not waned significantly.\nPolice have increased patrols in Northwest Baltimore. An entire class of police academy cadets in blue uniforms and khaki pants canvassed the area Thursday morning, looking for clues and handing out fliers asking for tips.\nPolice said the single gunman ran down Edgewood Street after the shooting and disappeared.\nDetectives have no suspects. One wounded victim remained in critical condition at an area hospital, police said. Three injured people have been treated and released.\nWhile police struggle to clamp down on the violence, they are imploring the community to help. They believe that some are shielding violent criminals from arrest, that others have become too passive or apathetic to help.\n\"This was a targeted incident. It was a straight-up execution. The bad guy knew who he wanted to kill, and he did just that,\" Baltimore police spokesman T.J. Smith said. \"It's almost a guarantee the way he went up and shot these people last night and executed that man last night, he absolutely will do it again, and he shouldn't be free to walk the streets. We can't allow our city to be numb to something like this.\"\nPolice identified the men killed in the shooting as Davon Dozier, 23, and Troy Smothers, 29. They were known as \"Day Day\" and \"Flip,\" according to people who came to the corner store on Thursday to revisit the incident.\nJohnson said Smothers was a father of three. Both men grew up nearby and lived a house apart in the 3500 block of Fairview Ave., two blocks northeast of the corner store, court records showed.\n\"Very nice guys,\" said Mike Issa, the corner store owner. \"I've been here 20 years. I've never seen them do anything wrong.\"\nIssa said he was in his back office when he heard gunfire.\nPolice do not know much about either victim. They recovered a handgun from one of the victims, according to Issa, who watched a crime scene technician empty the man's pockets.\nRelatives of the victims could not be reached Thursday.\nAs detectives went in and out of the corner store and police cadets went door to door in the neighborhood, friends of Flip and Day Day showed up to mourn and bemoan the violence.\nOne man said he had jury duty with Flip last week. A tall man in jeans shook his head and said \"I'm tired of this s——.\"\n\"I'm sorry about your friend,\" Issa replied.\nPolice believe the shooting is connected to at least one other recent shooting, and could be part of a cycle of retaliation.\nShawn Reid, 27, was shot to death in the 3000 block of Oakfield Ave. on Nov. 15. Jacob Hayes, 22, was shot dead in the 4000 block of Duvall Ave. on Tuesday.\n\"These folks all know one another,\" Smith said. \"This is intertwined. Family members know who these folks are, and we're going to continue to bury these young men if we don't collectively do something about it.\n\"We cannot allow the violence to continue, and allow for retaliation to continue because it's only going to go back and forth.\"\nA few hours after the shooting outside the convenience store Wednesday, 18-year-old Jamal Stewart was shot in the head and torso in the 3500 block of Fairview Ave. — the block where Dozier and Smothers had lived.\nStewart was the fourth Renaissance Academy student killed in the past year. City school officials said crisis teams will respond to the school to speak with students who need help.\nSharon Green Middleton, the city councilwoman who represents Garwyn Oaks, said residents on Duvall Street have been moved by police and city housing officials for their protection because they could be targets for retaliation.\nShe said neighbors have cited a house there as a \"nuisance\" property where drug dealing is suspected.\n\"It, just to me, shows the importance of a connection between housing, the police and the community — we all have to be connected because some serious problems are happening,\" she said. \"Really it's just so sad that it comes to things like this.\"\nPolice released the name of another man killed in a shooting on Wednesday. Dwayne Dorsey, 27, of the 6800 block of Sturbridge Drive was shot in the head in the 900 block of N. Broadway in the Gay Street neighborhood of East Baltimore.\nBaltimore Sun reporters Tim Prudente and Erica Green contributed to this article.\nTwitter.com/justingeorge"}