{"uri": "http://www.thegleaner.com/story/news/local/2017/01/05/three-guns-magazines-and-bullets-found-teen-who-killed-himself/96193160/", "title": "Three guns, magazines and bullets found with teen who killed himself", "dct": "Thu, 05 Jan 2017 00:00:00 GMT", "id": "15c647de21c506d0c04b568057be7c0c", "content": "Police discovered three guns and a backpack with bullets and 9 mm magazines near the teen who shot and killed himself outside of Central High School early Tuesday morning.\nRoman M. Kellough, 15, of Evansville died of a single, self-inflicted gunshot wound Tuesday, according to Vanderburgh County Coroner Steve Lockyear.\nPolice also said that there was a weapon found near Kellough's body.\nAccording to an Evansville Police Department report, officers discovered two 9 mm handguns and a .38-caliber handgun along with 46 9-mm bullets, two magazines and 13 38-caliber bullets, a backpack, cell phone and wallet.\nA school district spokesman confirmed Kellough was a former student at the school who had withdrawn near the end of the fall semester. District officials did not offer a reason for Kellough leaving the school, other than to say that he had done so on his own and was not an enrolled student at any Evansville Vanderburgh School Corp. facility.\nSpokesman Jason Woebkenberg refused to comment beyond a statement the EVSC issued on Wednesday. That statement, which did not include Kellough's name, warned against social media \"speculation.\"\nEvansville Police Sgt. Jason Cullum classified the case as \"still an active investigation\" when asked asked about Kellough's motives and whether he ever posed any additional threats. Cullum acknowledged multiple weapons were found and said investigators have spoken to several people during the last few days, including members of Kellough's family.\nCullum said police are still trying to determine how Kellough got the weapons or who they belonged to. Lockyear on Thursday said that it is believed that Kellough fatally shot himself \"several hours before he was discovered.\" Authorities do not have an exact time of death, but Lockyear has said it is not believed that there were any witnesses to the act.\nLockyear has there were no outside surveillance cameras to capture the incident."}