{"uri": "http://www.kansascity.com/news/local/crime/article112728203.html", "title": "Year-old boy dies after accidental shooting in KCK", "dct": "Fri, 04 Nov 2016 22:43:00 GMT", "id": "91ca0ca0b98f477d2b7375921d3d1e57", "content": "A 1-year-old boy injured Friday night in an apparent accidental shooting in Kansas City, Kan., has died, according to authorities.\nPolice identified the boy as Antonio Rucker, Jr. He was the second young child in as many weeks to die in an accidental shooting in the Kansas City area, after a 3-year-old died from gunfire in Kansas City nine days earlier.\nFriday night’s shooting was reported about 9:45 p.m. at a Little Caesar’s Pizza restaurant in the 7500 block of State Avenue.\nPolice officers found the boy injured and said it appeared the boy was shot inside his mother’s vehicle in the parking lot. The boy was taken to a hospital in critical condition.\nOn Saturday morning, police announced the boy had died from his injuries.\nPolice had originally described the child as being two years old, but later confirmed that the boy was about two months shy of his second birthday when he died.\nKansas City, Kan., police officials have declined to comment further on the shooting while the investigation continues. No charges were filed as of Saturday morning.\nAntonio’s death came a little more than a week after the accidental shooting on Oct. 27 of 3-year-old Jermone Green in the 1800 block of Topping Avenue in Kansas City. He was accidentally shot by his 5-year-old brother, according to Kansas City police.\nNationally, dozens of children younger than 4 years old die from gunfire every year, including 78 in 2014, the most recent year data is available from the Centers for Disease Control. As a group, preschoolers are more likely to die from gunfire than police.\nIn the Kansas City area, Antonio and Jermone weren’t the only children to die, or nearly die, from gunfire this year. Others, including some teenagers, have been victims of shootings under various circumstances.\nIn February, 15-year-old Jaiair Strong died after being shot in the chest, allegedly by another juvenile. That crime happened near U.S. 40 and Willow Road.\nIn June, 4-year-old Mahsaan Kelley-Wilson died after a bullet hit him as he rode in the backseat of his parents’ car near Eighth Street and the Paseo. The parents told police they got caught in the crossfire of a rolling gunbattle.\nIn August, Montell Ross, 8, and his 9-year-old cousin Jayden Ugwuone, died after being shot at home near 58th Street and College Avenue.\nAlso in August, a 2-year-old was critically wounded during a drug deal that ended in a shooting in the parking lot of a Church’s Chicken restaurant at Gregory Boulevard and Prospect Avenue.\nIn September, in Independence, 16-year-old Javon Reilly was fatally shot as he tried to walk away from a confrontation with a man near Van Horn High School.\nFriday night’s shooting remains under investigation and police are encouraging anyone with information to call the TIPS Hotline at 816-474-8477.\nIan Cummings: 816-234-4633, @Ian__Cummings\nToriano Porter: 816-234-4779, @torianoporter"}