{"uri": "http://krqe.com/2015/08/24/roswell-police-id-triple-homicide-victims/", "title": "Victims identified in Roswell triple homicide", "dct": "Mon, 24 Aug 2015 12:00:00 GMT", "id": "229e8c0171fa9f6ca0038509c46cb448", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nROSWELL, N.M. (KRQE) – Roswell Police have released the names of the victims in Saturday’s triple murder. Officials say all of the victims are from Roswell and each one suffered gunshot wounds.\nMere Contreras, 31, Damon B. Oswald-Newman,19, and 25-year-old Shelly Bird were found dead in a home in the 300 block of East Reed Street Saturday.\nPolice say a fourth victim, 24-year-old Candace Holloway is still being treated at a hospital.\nIt all happened at a home in the south part of Albuquerque around 8 a.m. on Saturday.\nNow family members say they want to know who did it and why. Family members say they are devastated and that they want justice. They are desperate for answers but so far they say they haven’t gotten any.\nPolice will not say if they know a motive for the killings or even if they have a suspect in mind.\nKRQE News 13 asked neighbors about the incident. They said they didn’t hear any noise or any sounds of gunshots coming from the home Saturday morning.\nThe incident is still under investigation. Anyone with information is asked to call the Roswell Police Department at (575) 624-6770.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}