{"uri": "http://rdrnews.com/wordpress/blog/2015/09/20/police-reports-reveal-homicide-details/", "title": "Police reports reveal homicide details", "dct": "Sun, 20 Sep 2015 00:00:00 GMT", "id": "b3002eb6ff05f9a8d30c8eb2e79f489d", "content": "Police reports obt[auth] ained by the Daily Record shed some light on recent homicides in Roswell, although questions remain about the location of a drug bust at a busy restaurant on a Friday night, why a police search failed to discover the body of a missing woman, and why there have yet been no arrests almost a month after a triple homicide.\nRoswell Police Department Public Information Officer Todd Wildermuth said police would offer no new information about the Aug. 22 triple homicide while the investigation continues.\nTherefore, the Daily Record on Tuesday requested police reports of the triple homicide and reports related to two other recent homicides in the city, pursuant to the state’s Inspection of Public Records Act.\nThe city clerk’s office made the documents available Friday, although there were numerous redactions, all allowable and legal under IPRA, a public records expert told the newspaper.\nTriple homicide\nOn Aug. 22, 31-year-old Mere Contreras, 19-year-old Damon B. Oswald-Newman and 25-year-old Shelly L. Bird were found dead at a home at 302 E. Reed St. in Roswell.\nA 24-year-old Roswell woman was also shot, but survived after multiple surgeries. She has spoken with law enforcement about the triple murder, said Michael Murphy, chief deputy district attorney for Chaves County.\nHowever, no arrests have been made almost a month after the homicides.\nRoswell police officer Miguel A. Lopez responded to the murder scene at 7:56 a.m. Aug. 22, according to a police report the city made available to the newspaper.\nLopez said a 911 caller reported the shootings.\n“As I got within a block and a half of 302 E. Reed, I noticed a Hispanic male riding eastbound away from 302 E. Reed,” Lopez wrote in an incident report. “The male subject had no shirt on, his shirt was over his shoulder and was on a mountain bike or 10-speed style bicycle. He was dark brown complexion with dark, brown hair or black hair. His hair was about 4 to 5 inches long.”\nLopez said when he arrived at 302 E. Reed St., the front door of the home was wide open and he found Bird dead, lying face-up in front of the door. Lopez said bloody shoe prints led to the home’s basement.\nLopez said he called for back-up and went after the bicyclist, “believing he had just committed a homicide.”\nLopez said he searched several streets, apparently unsuccessfully, before heading back to the murder scene.\nLopez said when he got back to the home, he heard a female voice coming from the basement. He said a woman was crying and holding the fourth shooting victim who survived.\nThe city redacted the name of the witness from the police report.\nLopez said he then noticed the body of Contreras lying face-up on a bed, and the body of Oswald-Newman lying face-down in a pool of blood.\nA sister of one of the victims told the Daily Record that Oswald-Newman was shot in cold blood while he slept.\nLopez said the surviving shooting victim was transported for medical treatment, and the witness was transported to the police department to be interviewed by detectives.\nLopez’s incident report was the only police report provided to the newspaper by the city, although 10 other RPD officers also responded to the scene.\nAsked why there have been no arrests made almost a month after the Aug. 22 triple homicide, Wildermuth said homicide cases require thoroughness.\n“Investigators always want to make sure the investigation has been completed thoroughly and accurately, and the evidence collection accomplished fully, so we can be confident we have the right suspect and the evidence collection and analysis will support a successful prosecution,” Wildermuth said.\n“In some cases, the process happens quickly; in others, it can take a significant amount of time. It all depends on the circumstances and extensiveness of the given case. Homicide cases, of course, can be among some of the tougher cases to work.”\nWildermuth said investigators are moving toward an arrest.\n“At this point in this case, our investigators are confident the investigation is moving in the right direction toward an arrest,” he said. “When that arrest will come remains uncertain right now. We want to make sure we reach the right result and not just a quick one.”\nTaco Bell shooting\nOn July 31, Jeremy L. Hatch, 34, was shot and killed during a gunfight with police amid a drug bust in the parking lot of Taco Bell at 3007 N. Main St.\nRoswell police officer Barton Devos, 30, was shot in the abdomen when he, along with other federal agents and local officers, stormed three suspects who arrived in two vehicles in the restaurant’s parking lot.\nDevos was wearing a bullet-proof vest. He was treated at a local hospital and released a few hours after the incident.\nRPD officer Mike Law responded to the scene at 8:39 p.m., according to a police report the city provided the newspaper.\n“Jeremy Hatch fired a bullet at Agent Bart Devos who was struck in the lower abdomen,” Law wrote in his report. “Jeremy Hatch was then struck by gunfire by officers on scene, and was later pronounced deceased at the scene.”\nLaw’s report contained no other pertinent information.\nLaw’s report was the only police report provided to the newspaper, although Law does reference further information in the supplemental reports of other officers.\nIt remains unknown how many times Hatch was shot by police, how many shots police fired during the shoot-out, and how far away from the scene other police bullets strayed.\nWildermuth said Hatch shot first, although the assertion has yet to be corroborated by an independent investigative agency.\nMurphy said the case would eventually be presented to the district attorney’s office for review.\nRoswell Deputy City Clerk Stephanie Garay said in a letter to the Daily Record Friday related to the newspaper’s IPRA request that the officer-involved shooting is under investigation by the RPD, the Chaves County Sheriff’s Office, New Mexico State Police and the FBI.\nThe Daily Record also requested video recorded by police during the Taco Bell shoot-out, but Garay said the FBI had requested its suppression.\n“At the request of the FBI, in light of their ongoing investigation, the video recordings are not being released as provided in (state law) at this time,” Garay wrote. “They will be released in the future when the FBI investigation is concluded.”\nGaray noted, under state law, law enforcement records that “reveal confidential sources, methods, information or individuals accused but not charged with a crime are an exception to the right to inspect public records.”\n“Records of video footage of the incident of the officer-involved shooting also contain information that may seriously compromise the ongoing federal investigation at this time,” Garay wrote.\nAsked why the drug bust was conducted, or somehow moved, to the parking lot of a busy restaurant on a Friday night, Wildermuth said the suspects determined the location.\n“The location was not of RPD’s choosing, unfortunately,” Wildermuth said. “The criminals decided where they would meet. Surveillance that was already being conducted provided location information to the local task force and federal agents, who then prepared and carried out the arrests, which can always pose a danger, as was so vividly seen here.\n“The suspects actually had their meeting set up at a different location, and at the last minute changed to the location where the incident later occurred.”\nWildermuth said critics of the drug bust’s location should weigh the potential impact of police not acting at the Taco Bell location.\n“Those who may believe the arrests should not have been made in that parking lot at that time must understand that had we decided to let the suspects leave there that night, they would have continued to pose a threat to the community in the future,” Wildermuth said.\n“No one can know what confrontations might have occurred after that night had they remained free. Had the suspects — which we learned were certainly capable of violence — been allowed to leave that night, a different group of critics would be asking why police did not arrest them when they had the opportunity that night.”\nMurder/suicide\nThe body of missing person Margarita Diaz, 55, was found July 12 at her home at 916 W. Wildy St. in Roswell.\nDiaz’s husband, Refugio Diaz Sr., killed himself July 10, the day after Margarita was reported missing, authorities said.\nPolice searched Margarita’s home on July 10, but failed to find her body. Family members found her body in a trash barrel in the backyard of her property two days after the police search.\nMurphy said indications are Margarita was killed by Refugio, and the case is effectively closed, although prosecutors are awaiting a report from the Office of the Medical Investigator.\nRobert Scribner of the RPD responded to the scene at 12:03 p.m. July 12 after Margarita’s body had been found, according to a police report provided by the city.\nScribner said Margarita’s body had been found in the trash barrel after family members tipped it over.\nScribner said family members were distraught after discovering the body.\n“I could hear yelling and moved through the house to the front area where I found officers and several upset people,” Scribner wrote. “I learned from them that they were going through papers from the funeral home and found a card that said, ‘You can find your mom in the trash.’”\nAsked why Roswell police did not discover Margarita’s body during their search of her home, Wildermuth said the RPD had no excuses.\n“We should have found the body. No excuses then, and no excuses now,” Wildermuth said.\nIn a July 14 public statement, the RPD said it was “shocked and immensely disappointed to learn that its search on July 10 had failed to locate the body.”\n“That failure does not meet RPD’s standards and does not represent or characterize the department’s usual operations that are carried out as effectively as possible and with the utmost of care,” the RPD statement said. “RPD apologizes to the families affected by this death and to the overall community we serve. Steps will be taken at RPD to reinforce to personnel the importance of making every effort to ensure searches are carried out in a thorough manner. RPD pledges to take the necessary internal actions to prevent such an unfortunate situation from happening again.”\nAsked if any police officers had been disciplined as a result of the botched search, Wildermuth said he could not comment on disciplinary matters.\n“We did, however, as is alluded to in the July statement, take measures to reinforce training and the standards expected of our personnel regarding searches, such as that one,” Wildermuth said.\nSo far this year, there have been nine homicides in Chaves County, nearly all in Roswell, including the officer-involved shooting of Hatch.\nSeven of those homicides have occurred since July 4, the last being the triple homicide of Aug. 22.\nStaff Writer Jeff Tucker may be contacted at 575-622-7710, ext. 303, or at reporter01@rdrnews.com."}