{"uri": "http://www.orlandosentinel.com/news/breaking-news/os-juvenile-shot-killed-sanford-20160302-story.html", "title": "Baby sitter charged after 6-year-old fatally shoots herself, Sanford police said", "dct": "Wed, 02 Mar 2016 19:22:00 GMT", "id": "ad3c0e09e09e53a3755d7e7e0f0cd73b", "content": "A 6-year-old girl accidentally shot and killed herself Tuesday night after finding a loaded pistol, marking the second time in about a week that a child in Sanford has found and fired an unsecured gun.\nA'letha Amanii Marie Burke is also the youngest fatal gunshot victim in Central Florida this year.\nHer death comes less than a month after roughly 200 gathered to rally against violence in their community.\nA'letha, a kindergarten student at Wicklow Elementary School, was playing in the living room of a family member's house on Highlawn Avenue in Sanford about 8 p.m. when she found the gun unsecured and without a trigger lock, police said.\nShe grabbed it and fired one round into her right shoulder, according to Sanford police. The bullet traveled through her body and exited her bottom.\nHer family member, 35-year-old Erick Dominick Williams, who was supposed to be baby-sitting her at the time, drove A'letha to a nearby hospital.\nFrom mass slayings to strange attacks, these are pictures of the most bizarre and shocking crimes to happen in Florida.\nShe died a short while later.\nPolice found out about the incident after getting a call 30 minutes later from hospital staff.\nDetectives started investigating and learned Williams knew the gun was stored unsecured under the couch, an arrest report states. But he let A'letha play near it anyway, police said.\n\"While A'letha was left in the care of Mr. Williams, he knowingly allowed her to play in the area where the firearm was stored,\" police spokeswoman Bianca Gillett said.\nWilliams was arrested on charges of child neglect and unsafe storage of a firearm. He is being held in the John E. Polk Correctional Facility in Sanford.\nWilliams' criminal record stretches back to 1999, records show. He has been arrested on charges of cocaine, trafficking, marijuana possession, and fleeing police, but has never served prison time in Florida, records show.\nChildren at Wicklow Elementary are being offered grief counseling, Seminole County Public Schools spokesman Michael Lawrence said. The school's principal sent a letter about A'letha's death home with students.\nThis is the second time in about a week that a child in Sanford has found a gun and fired it, Gillett said.\nHospital staff called Sanford police last week after a child showed up with a gunshot wound to the hand. That child survived, but police said they're frustrated with the amount of gun violence.\nGillett said the incidents are \"senseless\" and preventable if the community realizes the need for responsible gun ownership.\n\"As an owner of a firearm, you need to store it securely and away from juveniles,\" she said. \"We owe them that to protect them and keep them safe.\"\nPolice said the gun that A'letha found — a Springfield XD .45 pistol — didn't have a trigger lock or any other safety device on it.\nSanford officers hand out locks for free at the department, Gillett said.\n\"Anybody can come in, without any questions asked, we will give them out and it's a simple, effective manner to keep that firearm stored securely and our children safe,\" she said.\nThe death comes a month after another child in Central Florida died from an accidental shooting.\nLavardo Fisher, 13, of Ocoee was playing Xbox Feb. 7 in a house on Spottswood Drive when he was accidentally shot in the back of the head by his cousin.\nThe 18-year-old shooter was on a hoverboard and lost his balance, causing the gun to fire.\nDeputies determined the gun belonged to 35-year-old Walter Morame, who was not home at the time of the shooting and denied owning the gun. He was arrested on a charge of possession of a weapon by a felon.\nAlso last month, residents, community groups and police officers gathered for Sanford's first \"Stop The Silence\" Rally and Community Unity Day.\nThe event provided a forum for residents to ask for information about some of the city's unsolved crimes, including the slaying of 15-year-old son Tamar Harris on Jan. 29.\nHe was shot while riding in a vehicle near Altamonte Springs by a person who was standing in the street.\nAccording to the Centers for Disease Control and Prevention, more than 500 people died in 2013 from accidental gunshots, and 69 of them were children under 15 years old.\nSanford police are holding a gun-safety class at 4 p.m. Thursday at the department headquarters in hopes of educating residents on how to properly store their weapons.\nGillett said children are also welcome to learn what they should do if they find a gun.\nGal Tziperman Lotan contributed to this report.\nsallen@orlandosentinel.com or 407-420-5417"}