{"uri": "http://www.mysanantonio.com/news/local/article/School-in-West-Texas-on-lock-down-after-reports-9210008.php", "title": "Sheriff: Female student shooter, 14, dead, another girl injured at Alpine High School in West Texas", "dct": "Thu, 08 Sep 2016 00:00:00 GMT", "id": "309214232f8c98a7a0915aa609d22c6a", "content": "A 14-year-old female student shot another girl at Alpine High School in West Texas before turning the gun on herself, Brewster County Sheriff Ronny Dodson said Thursday.\nThe Brewster County Sheriff's Office were called to the scene for reports of an active shooter around 9 a.m. and evacuated students and put the campus, surrounding schools and administration on a \"critical lockdown.\"\nDodson said the suspect died from a self-inflicted wound after shooting another female student, who ran into the street in front of the school and was picked up by bystanders and taken to Big Bend Medical Regional Center for treatment.\nWhen police arrived on the scene, they found a girl with a gunshot wound and a weapon. Initially, authorities believed the girl was a victim, but later determined she was the shooter.\nDuring a news conference Thursday afternoon, Dodson said the shooter was a 14-year-old freshman whose family moved to Alpine about six months ago. At this time, a motive remains unclear.\nThe victim was hospitalized in stable condition with non-threatening injuries.\nFamilies have been notified on the incident and neither the shooter or the victim have been publicly named.\nAdditionally, a police officer was accidentally shot by another officer at the high school.\nFemale mass shooters are an anomaly, according to a detailed investigation by the Washington Post. The Post looked at each shooting where four or more people died in the U.S. since Aug. 1, 1966. Since then, there have been 127 mass shootings and 130 shooters. Of the shooters, only three were female and 73 of died at the scene, often due to self-inflicted wounds.\nAs the scene cleared, Dodson said law enforcement officials investigated a bomb threat made to Sul Ross State University. He said the threat came from the jail and that it was \"ridiculous for someone to call in something like this.\" The university was placed on lockdown and Dodson said he called the FBI to help with the ongoing investigation. Officials believe the call was a hoax.\nElizabeth Carter, a lieutenant at the Texas Department of Public Safety, said someone brought a gun onto the Alpine High School campus Thursday morning.\nThe sheriff's office initially said two possible shooters were on the loose.\nThe high school is about 30 miles east of Marfa. Alpine ISD has just under 1,000 students, according to the school's website.\nFormer U.S. Rep Pete Gallego, D-Alpine, tweeted early Thursday morning asking for prayers.\n\"As we all wait for more information, please keep Alpine - Alpine's kids - in your prayers this morning,\" he said.\nThis story will be updated as more information becomes available.\nText \"NEWS\" to 72727 to sign up for breaking news from mySA\nThe Associated Press contributed to this report.\nkbradshaw@express-news.net"}