{"uri": "http://www.wsmv.com/story/31929453/smyrna-toddler-recovering-after-accidental-shooting", "title": "Smyrna toddler recovering after accidental shooting", "dct": "Mon, 23 May 2016 22:20:00 GMT", "id": "994a0ffa08b91f3ab250eef7ef17db7d", "content": "SMYRNA, TN (WSMV) -\nA toddler remains hospitalized after she accidentally shot herself in the face.\nIt was the ninth reported accidental shooting involving children this year.\nThe 2-year-old girl is recovering after being shot at a home on Snowbird Drive in Smyrna on Saturday morning.\nPolice said the toddler was home with adults when she got hold of a gun and shot herself in the cheek. She was airlifted to Vanderbilt University Medical Center where she is in stable condition.\nThe child’s biological mother told Channel 4 she had just learned of the news and was in shock. She said the girl’s name is Veronica and had lived with relatives for most of her life.\nSmyrna police have not said if any charges will be filed in this case.\n“I can’t speak on any charges,” said Sgt. Bobby Gibson with the Smyrna Police Department. “The case has been turned over to the Rutherford County District Attorney’s office for evaluation.”\nGun safety advocates with the Safe Tennessee Project have been watching this story and others like it closely.\n“These are preventable tragedies. They should not keep happening,” said Beth Roth with Safe Tennessee Project.\nAccording to Safe Tennessee Project, the state is ranked ninth in the nation for accidental shootings. It is also ninth in the nation for death by firearm, and third for shootings in or near a school, college or university.\nThis year alone there have been nine reported accidental child shootings. Two have been fatal.\nThe Safe Tennessee Project said they hope by presenting these numbers to lawmakers, they can help make better child access prevention laws, known as CAP laws.\n“We were recently flagged as one of seven states with a disproportionate number of accidental shooting,” Roth said. “And all seven of those states, including Tennessee, lacked meaningful child access prevention laws.”\nParents and advocates hope to see fewer victims in the future.\nDepartment of Children’s Services officials said they are investigating this shooting incident, along with local law enforcement.\n“While we can’t discuss children’s and families’ histories with the department, foster families and those who take custody of a child on an initial placement agreement must have weapons locked in safes and the ammunition kept separately,” DCS said in a statement.\nRoth said Safe Tennessee Project plans to bring up Makayla’s Law again next legislative session. It would criminalize parents who leave a loaded gun near a child under 13, if that child injures or kills himself or another child by firing the weapon.\nCopyright 2016 WSMV (Meredith Corporation). All rights reserved."}