{"uri": "http://abc7ny.com/news/nyc-officials-5-people-injured-in-red-hook-shooting/901599/", "title": "3 in custody in Red Hook shooting that left 5 hurt, including pregnant woman who lost baby", "dct": "Wed, 05 Aug 2015 00:00:00 GMT", "id": "236ec54288e5886cea8768a629fb3ba6", "content": "RED HOOK (WABC) --\nThree people are in custody in the Brooklyn shooting that injured five people, including a pregnant woman whose fetus died.\nOne of those in custody is 19-year-old Frederick Marquise, who police had previously identified as a suspect in the drive-by shooting, which happened before anti-crime rallies and community celebrations for \"National Night Out.\"\nAll three are being questioned, and no charges have yet been filed.\nTwo of the victims were critically injured after the gunfire broke out in the Red Hook section, with police saying three of the victims were women and two men.\nThe pregnant victim, 19-year-old Special Houston, remains in critical condition. She was four month pregnant and lost her baby. The expectant father, 21-year-old Devin Callahan, and his sister, 21-year-old Deana Smith, were also hit outside their home.\n\"They weren't doing anything but waiting for their food,\" said Viva Smith, the victim's mother.\nDestiny Jones and another man were also hurt in the shooting.\nPolice say two men jumped out of a silver SUV and started firing. It was apparently part of a retaliatory shooting between two public housing complexes, but investigators say the men had the wrong block.\n\"Devastated, we're shocked, we don't even know how to handle this,\" the victim's cousin, Danielle Turner, said. \"This is new to us because we are used to being able to sit in front of our homes, but when people start shooting at children it's really sad.\"\nThe gunfire capped a violent weekend in New York City, in which three people were killed and more than a dozen others wounded in 10 incidents from Friday to Sunday.\nHundreds took part in Tuesday night's \"National Night Out\" event in Brownsville and around the city, offering a chance to meet neighbors and the police who serve this community.\nGiven the recent spate of gun violence, Mayor Bill de Blasio, Police Commissioner Bill Bratton and District Attorney Ken Thompson talked to the crowd about rash of recent shootings.\n\"I know that last night five people were shot in Red Hook and nine people over the weekend in East New York,\" Thompson said. \"We cannot have that, we have to come together to end the gun violence in the great County of Kings.\""}