{"uri": "http://www.nbcnewyork.com/news/local/5-Shot-Injured-Red-Hook-Brooklyn-Shooting-Officials-320569132.html", "title": "Pregnant Woman's Unborn Baby Killed, 4 Others Injured in Brooklyn Drive-By Shooting: Sources", "dct": "Tue, 04 Aug 2015 14:52:00 GMT", "id": "bec1a7d0cd0aaadec09013df9dc43827", "content": "A pregnant woman was shot five times and her unborn baby was killed after a drive-by shooting in Brooklyn Monday night that injured four other people, police sources tell NBC 4 New York.\nThe four-months pregnant woman, 19, was standing in front of a housing project on Dwight Street with two other women and two men when someone in a passing SUV opened fire at them, the sources say.\nThe pregnant woman was critically injured in the shooting, according to the police sources. One of her companions, a 20-year-old man, was hit seven times in the body, authorities said.\nThe woman is expected to survive.\nAnother 19-year-old woman was also shot five times, while the remaining two victims were shot in the legs. All five victims were taken to nearby hospitals.\nThe SUV drove off after the shooting. Police have identified the suspect as 19-year-old Fredrick Marquise, described as 5 feet 5 inches tall and weight about 140 pounds. They're asking anyone with information to contact them at 800-577-TIPS.\nPolice sources say the violence is thought to stem from a rivalry between residents of two housing projects in the neighborhood. Police are looking for two suspects.\n\"It's shocking,\" said neighbor Tamira Hoynes. \"This is the first incident I've heard of in, like, ages.\"\nThe drive-by comes after another shooting on Sunday.\nThree died and 16 were wounded in seven separate shootings across the city over the weekend, including one shooting in which nine people were shot during a backyard party in East New York.\nOn Monday, community activists took a coffin to Brooklyn Borough Hall in protest of the seeming rise in gun violence.\n\"I think that's crazy, it's happening all around the city, shootings everywhere,\" said Denise Morales, of East New York.\nBrooklyn Borough Hall President Eric Adams joined the protesters, speaking about the need to reduce gun violence.\n\"Our children deserve to live,\" he said. \"Our adults deserve to live. All lives matter.\"\nMayor de Blasio's office, however, says crime is actually down and that the number of shooting incidents has dropped slightly from 674 last year to 669 this year.\nNYPD Commissioner Bill Bratton urged New Yorkers to put the Monday night shooting in context, saying Tuesday: \"What we've been experiencing is far less than every other city.\"\nHe added that crime is down 6 percent for the year. Murders are up 9 percent, he said, but a recent batch of shootings are almost all clustered in Brooklyn and the Bronx. The gunman wanted in the Monday shooting, like those in the East New York house party shootings, are repeat offenders.\n\"They are the shooters committing these murders,\" Bratton said.\n--Andrew Siff contributed to this report."}