{"uri": "http://www.mailtribune.com/news/20160506/man-charged-with-manslaughter-in-medford-shooting?rssfeed=true", "title": "Man charged with manslaughter in Medford shooting", "dct": "NODATE", "id": "d6d6fdc8780b443f78a00c08f2730654", "content": "Medford police do not think a recent shooting that took the life of a 34-year-old man was intentional, but they do allege the man holding the gun when it went off \"acted recklessly with extreme indifference to human life.\"\nInvestigators have charged 23-year-old Vincent Santana DiCostanzo with first-degree manslaughter in the death of Luke Adrian-Heiner Barmes, according to a news release. Police say the two men met the afternoon of April 30 at a home in the 200 block of Iowa Street for the exchange or sale of property, about which investigators declined to elaborate. Medford police Detective Sgt. Brent Mak said DiCostanzo showed Barmes the gun sometime during the exchange, and the two were passing it back and forth when it went off.\n\"We do not believe the handgun was part of that trade or sale,\" Mak said. \"It was just in play, and they were passing (it) back and forth.\"\nDetectives said DiCostanzo and an unidentified person arrived at the home in a white Honda coupe, and that DiCostanzo and Barmes walked to the backyard. The unidentified person parked the vehicle in the street and waited. Police said DiCostanzo was holding the weapon when it went off. Police said the shot struck Barmes in the chest, and DiCostanzo reportedly fled in the vehicle.\nPolice responded to the scene shortly before 5 p.m. Witnesses directed officers to the backyard, where they found Barmes dead. Detectives later found the gun, which they believe was tossed from the vehicle, on Clark Street. Investigators said the weapon did not appear to be stolen, but they were still trying to determine its owner.\nWitnesses were able to provide police with a description of the vehicle, its license plate and a physical description of DiCostanzo. About five hours after the shooting, an Oregon State Police trooper saw the vehicle traveling southbound on Interstate 5 near milepost 30. The trooper pulled the vehicle over near the Phoenix exit, where police identified one of the occupants as the male who was in the car when the shooting occurred. A woman was also in the car. Both were interviewed and released.\nPolice found DiCostanzo at the Ashland Hills Hotel at 6:45 a.m. Sunday, May 1. Police said he ran from them but surrendered when he encountered a police canine. He was originally jailed on an unrelated warrant stemming from a heroin possession charge, according to jail records. The manslaughter charge was added Thursday. He remains in the Jackson County Jail on $1 million bail, records show.\n\"We took our time on this one,\" Mak said. \"It was a very complete and thorough investigation.\"\nReach reporter Ryan Pfeil at 541-776-4468 or rpfeil@mailtribune.com. Follow him at www.twitter.com/ryanpfeil."}