{"uri": "http://www.dnainfo.com/chicago/20151018/west-town/west-town-dad-charged-after-son-6-fatally-shoots-3-year-old-brother", "title": "Boy, 6, Fatally Shoots Brother, 3, While Playing Cops & Robbers: Officials", "dct": "Sun, 18 Oct 2015 06:10:00 GMT", "id": "c990841f282861b036c51753b3bf7b05", "content": "COOK COUNTY COURTHOUSE — With his father at work and his mother at the store, a 6-year-old boy on Saturday retrieved his dad's gun from on top of the refrigerator in their West Town home and accidentally shot his 3 year-old brother in the head, officials said.\nEian H. Santiago, 3, was pronounced dead later Saturday night at Mount Sinai Hospital, according to the Cook County Medical Examiner's office.\nHis father, Michael Santiago, has been charged with felony child endangerment after he knowingly left the loaded revolver on top of the family's refrigerator.\nSantiago, of the 1000 block of North Francisco Avenue, had illegally obtained the gun for protection after he testified in a murder trial, according to Assistant State's Attorney Joseph DiBella.\nSantiago, 25, is a former gang member, according to officials. He appeared in Central Bond Court Sunday and is being held on $75,000 bond.\nSantiago showed his 6 year-old son the gun a week prior to the fatal shooting, telling his son that it was for adults only, DiBella said. The loaded gun was wrapped in pajama pants on top of the family's refrigerator, DiBella said.\nOn Saturday, Eian and his 6-year-old brother were in the care of a grandfather while Santiago was at work and his wife was at the store with their youngest child, a 1-year-old, prosecutors said.\nThe children went downstairs into the kitchen, while the grandfather was in his residence directly above the family's. It is unclear how the 6-year-old retrieved the gun, DiBella said.\nThe children then began playing a game of cops-and-robbers with the loaded weapon, according to a police source.\nAround 9 p.m. Saturday, Eian was fatally shot while eating macaroni and cheese, prosecutors said.\nHis grandfather heard the shot and rushed his grandson to Norwegian Hospital before he was transferred to Mount Sinai, prosecutors and police said.\nSantiago was taken into custody soon after. He appeared in bond court Sunday, where prosecutors initially asked for a $1 million bond.\nAbout 10 of Santiago's family members stood when his case was called, holding up a sign with words of encouragement written in marker on the inside of a folder.\nThey shrieked when the state's attorney's office asked for the $1 million bond.\nSantiago's public defender asked the judge to consider a lower bond.\n\"He has family he aspires to be with at this very difficult time,\" the public defender said.\nWhen asked what would be a more suitable bond, the attorney then went to the family and asked how much money they had. They could offer up $1,000 to free their primary caretaker, the family and the public defender said.\nJudge James Brown then set the bond at $75,000.\n\"This is the ultimate tragedy,\" Brown said. \"I can set a high bond or a low bond, it won't bring the child back.\n\"This is what happens when people have guns who shouldn't have guns,\" he said.\nSantiago was ordered not to have contact with his 6 year-old son, who is a witness.\nSantiago's family wept after the case, and walked out of the courthouse arm-in-arm. They did not take questions from the media.\nFor more neighborhood news, listen to DNAinfo Radio here:"}