{"uri": "http://www.pennlive.com/news/2016/06/dear_lord_dont_let_that_little.html", "title": "'Dear Lord, don't let that little girl be dead': Littlestown murder-suicide", "dct": "Mon, 13 Jun 2016 15:22:49 GMT", "id": "50cfff7abba846e77531b5a2846ff2cb", "content": "UPDATE: Father, daughter have been identified\nLITTLESTOWN -- Neighbor Ellen Muller didn't hear the gunshots. Instead, she awoke at her customary 5 a.m. on Sunday, only to find her backyard crawling with cops and the yard abutting hers strung with yellow police tape.\nShe grew immediately uneasy, her mind leaping to the 9-year-old girl who played in the yard, relentlessly kicking a soccer ball into the net still set up there.\n\"I knew it was bad,\" Muller said Sunday afternoon, all signs of the horrible, 3 a.m. murder-suicide inside 35 James St. gone now. But that little girl's empty soccer net was still standing sentry at the end of the backyard, never to be used by her again.\n\"The first thought I had was, 'Dear Lord, don't let that little girl be dead,'\" Muller continued, looking off toward the yard. \"She played out there in that little yard. I'm glad I didn't hear the shots.\"\nPolice say those shots inside the humble, brown house were fired by the husband and father. He took the life of his daughter, age 9, and injured her mother.\nNone of the victims nor the shooter have been identified by police, pending the notification of family.\nThe woman, wounded in the shoulder, met responding police outside of the house, according to Sgt. Robert Funt of the Littlestown Police Department.\nFunt said police then found the bodies of the female victim's husband and their 9-year-old daughter.\nNext-door neighbor Deborah Berger said the shock of the shooting is still sinking in across the small Adams County community.\n\"It's a quiet neighborhood,\" Berger said. \"A small town. Nothing like this ever happened. It's just surprise. Concern.\"\nNeighbors said the husband and father, believed to be in his late 30s, had a disability that caused him to use a cane and kept him from working. Instead, the slight man could be seen sitting in a lawn chair in his backyard on mornings when the weather was nice.\nThe wife and mother worked at a restaurant in nearby Hanover, according to Berger.\nMeanwhile, the little girl loved soccer and her beagle dog. She was outgoing and friendly, according to Berger. But the rest of the family kept to themselves.\nThere was no sign of domestic violence or even squabbling coming from the house, neighbors said. And there was certainly no warning for what would transpire inside the home in the wee hours of Sunday morning.\nBerger says a medical helicopter landed at a nearby baseball field to fly the mother for medical treatment. She is reported in satisfactory condition.\nThe little girl who cherished her dog and loved kicking a soccer ball into her backyard net wasn't so lucky, shot dead at the hand of her dad. An autopsy is set for Tuesday.\n\"She's too little,\" Muller protested, still not wanting to believe that it actually happened. \"I prayed, don't let it be her; she ain't had a long life yet.\"\nMuller paused, then added in a hushed voice, \"But it was.\"\nDaniel L. Harris died of multiple gunshot wounds after being shot at around 12:45 a.m. Saturday. He was killed at the Haines American Legion on the 100 block of West Penn Street in Carlisle."}