{"uri": "http://www.fresnobee.com/2015/02/13/4378028/fresno-girl-10-accidentally-shoots.html", "title": "10-year-old daughter of Madera County sheriff’s lieutenant shoots sister, 8, with father’s gun in Fresno", "dct": "Fri, 13 Feb 2015 13:06:00 GMT", "id": "d1df7b97ec1ad60d43342e8198eb8f21", "content": "Fresno police are investigating an incident in which a Madera County sheriff’s lieutenant’s 10-year-old daughter shot her younger sister Friday.\nThe incident occurred just before 8 a.m. near Bullard and Cornelia avenues. Fresno police Lt. Joe Gomez said officers found an 8-year-old girl with a gunshot wound to her torso. She was talking and in stable condition Friday afternoon at Community Regional Medical Center.\nGomez said preliminary findings are that the girls’ father was getting ready for work and put his handgun on the bed in his bedroom while he was in the bathroom. The magazine was removed from the weapon, but there was a round in the chamber. The 10-year-old grabbed the gun, “manipulated it” and one round discharged, hitting the younger girl in the lower torso. Gomez said the lieutenant immediately called 911 for an ambulance and also notified Fresno police, who sped to the home.\nHe said it would be up to the Fresno County District Attorney’s Office to determine whether the lieutenant would face legal consequences, but added “we absolutely support him in this very difficult time — and his family — and what they are going through right now.”\nGomez said the findings of the investigation would likely be submitted to the DA’s office within the week.\nLt. Bill Ward of the Madera County Sheriff’s Office said the incident would be treated as a confidential personnel matter.\n“We are deeply saddened by this tragic event,” he said. “Our thoughts and prayers are with the family.”\nThe lieutenant and his family have been offered support services available outside the sheriff’s office.\nAt a 5 p.m. news conference, Madera County Sheriff Jay Varney said the gun used was the employee’s service weapon but that the employee — whose name was not provided — would not be placed on paid administrative leave.\n“I’ve considered the circumstance of what’s happened here and since he wasn’t directly involved with the discharge of the firearm — no, I will not be putting him on administrative leave.”\nVarney wouldn’t describe the shooting because it remains under investigation, but said, “the gun was only left unattended for a short time.”\nVarney said the employee is cooperating with the Fresno police criminal investigation. Following that, Varney said the Madera County Sheriff’s Office will conduct an internal administrative investigation to determine if any of the department’s policies were violated.\nVarney didn’t discuss those policies during the news conference, instead paraphrasing state law: “If you are going to store your firearm within your home with the ammunition, it has to be outside of the access of anyone under 18.”\nVarney issued a warning to other gun owners: “If you have a loaded firearm within your household, it takes a fraction of a second for something to go wrong.”\nHe said free gun locks are available by calling the Madera County Sheriff’s Office or any of its partner agencies, which also provide them to residents for free."}