{"uri": "http://www.ktxs.com/news/texas/man-questioned-in-2-texas-deaths-accused-of-resisting-arrest_/150816524", "title": "Missing Texas girl's body found; mom, sibling fatally shot earlier", "dct": "Thu, 10 Nov 2016 13:54:00 GMT", "id": "ab0ed2b55ce82e55d8228718a750aebd", "content": "BAYTOWN, TEXAS (AP) -- Baytown police say a body discovered in a wooded area behind a bar in Texas City is believed to be the missing 16-year-old daughter of a woman found shot to death along with another daughter at the family's home.\nAuthorities had been looking for Kirsten Fritch after the bodies of 37-year-old Cynthia Morris and her 13-year-old daughter, Breanna Pavilicek, were found Monday in their home in Baytown. Volunteers found the teen's body Thursday afternoon shortly after starting the second day of their search.\nPHOTOS OF SUSPECT AND VICTIMS -> http://www.ktxs.com/150835821\nFritch's 21-year-old boyfriend, Jesse Dobbs, was arrested Monday on a charge of resisting arrest in Texas City - about 25 miles from Baytown - where Morris' missing car was found.\nDorris says charges against Dobbs, who's been uncooperative with police, likely will be upgraded to murder.\nPrevious story:\nSearchers have found a body that police believe is missing Baytown teen Kirsten Fritch.\nThe discovery comes two days after two other family members were found dead in their Baytown home.\nAccording to the Baytown Sun, police say items found with the body have led authorities to believe it is the 16-year-old Fritch.\nPHOTOS OF SUSPECT AND VICTIMS -> http://www.ktxs.com/150835821\nAn Amber Alert issued for Fritch has been discontinued.\nA suspect in the case -- 21-year-old Jesse Dobbs -- is being held on a resisting arrest charge. His bond was set at $50,000.\nPrevious story:\nPolice say a Houston-area man questioned in the shooting deats of a mother and her 13-year-old daughter has been charged with resisting arrest.\nPHOTOS OF SUSPECT AND VICTIMS -> http://www.ktxs.com/150835821\nBaytown police say the search continues for an older daughter who's acquainted with 21-year-old Jesse Dobbs of Baytown. Galveston County jail records show Dobbs was being held Thursday on $50,000 bond.\nBaytown police say Dobbs was arrested late Tuesday near Texas City, just hours after authorities found the bodies of 37-year-old Cynthia Mooris and her daughter, Breanna Pavilicek, in the family's home. An Amber Alert was then issued for the woman's 16-year-old daughter Kirsten Fritch."}