{"uri": "http://kxan.com/2017/01/02/woman-hit-by-falling-bullet-during-new-years-eve-on-sixth-street/", "title": "Woman hit by falling bullet during New Year’s Eve on Sixth Street", "dct": "Mon, 02 Jan 2017 15:58:00 GMT", "id": "07d3dad00a7845da6620bc56dbd99516", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nAUSTIN (KXAN) – Police are investigating after a woman was hit by a bullet while party goers were ringing in the new year on Sixth Street Saturday night.\nVictoria Rocha, 35, was transported to University Medical Center Brackenridge with a gunshot wound to her leg.\nRocha tells KXAN she and her fiance had just parked minutes before and walked down to 6th and Brazos. She sat down on a bench across from the Driskill Hotel to rest her feet, and called her son at 12:03 a.m. to wish him a Happy New Year.\n“As soon as I hung up the phone we heard a loud bang out of nowhere,” said Rocha. “At the time I didn’t realize I was hit.”\nWhen she tried to get up she could tell something was wrong.\n“It was kind of numb and I could feel it burning like a hotness to my leg,” said Rocha.\nAustin Travis County EMS rushed her to the hospital where Rocha says doctors removed a 45 caliber bullet that had traveled from the front of her left thigh to the back.\nAustin police said they believe it was a falling bullet that came from someone firing a gun into the air nearby\n“I’m just left with why, I don’t understand,” said Rocha wiping tears from her eyes.\nThere are currently no suspects in the case and detectives are expected to be reviewing video footage to see if they can spot the person who pulled the trigger.\nA HALO camera is on the corner recording around the clock and and providing a live feed to Austin police.\nThe Driskill Hotel also has surveillance cameras. The head of security tells KXAN APD looked at their footage, but didn’t see much.\nOfficers stationed at the hotel, along with employees at nearby bars say they didn’t see or hear anything either other than a loud crowd in the packed street.\n“Not a way to start the year, but thank God it wasn’t worse,” said Rocha. “I really hope that they find the owner of the gun or that somebody comes forward.”\nIn the meantime, the mother of four will be home recovering and is unable to go back to work until her leg heals. A GoFundMe page has been set up to help with medical expenses.\nPlay Video\nPlay\nLoaded: 0%\nProgress: 0%\nRemaining Time -0:00\nThis is a modal window.\nForeground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Opaque\nBackground --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nWindow --- White Black Red Green Blue Yellow Magenta Cyan --- Opaque Semi-Transparent Transparent\nFont Size 50% 75% 100% 125% 150% 175% 200% 300% 400%\nText Edge Style None Raised Depressed Uniform Dropshadow\nFont Family Default Monospace Serif Proportional Serif Monospace Sans-Serif Proportional Sans-Serif Casual Script Small Caps\nDefaults Done"}