{"uri": "http://www.fox7austin.com/news/local-news/226733800-story", "title": "Several incidents of shots being fired hours into 2017", "dct": "Tue, 03 Jan 2017 03:34:00 GMT", "id": "7c200794fd0a0b71633c937aeafcfd45", "content": "Just hours into the new year, police were already dealing with several senseless acts. Many were related to shots being fired in the air.\nTwo people were struck by stray bullets and one man was arrested for firing his gun in protest of fireworks. One after another - shots fired in a South Austin neighborhood in a rage over fireworks.\n\"It was really scary because I didn't know where he was aiming it at. I thought oh no, he's aiming it at the people that were shooting off the fireworks. Or maybe it's in the air and might land on something or somebody,\" says Blanca Ibarra, neighbor.\nSeveral incidents of shots being fired hours into 2017\nBlanca Ibarra could see her armed neighbor outside of her bedroom window. She captured the incident on her cell phone before calling 911.\n\"It's a really disappointing way to start the new year,\" says Ibarra.\nAround 12:50 on New Year's Day, police responded to Gold Moss Cove and Windrift Way. According to court documents, witnesses told police the man was yelling \"People have to... work\" and \"I'm going to get my gun, I'm bringing my 12 gauge.\" After the first shot, people reportedly hid behind cars and in houses. 40-year-old Shawn Smith was placed under arrest and charged with discharging a firearm in public.\n\"They're not of sound mind to make proper decisions and just pulling out a gun like that, there's been so many accidents with guns nowadays. It's just not safe,\" says Ibarra.\nThis wasn't the only incident involving shots being fired just after midnight New Year's Day. Austin Police say a woman in her 30's was shot in the leg while on 6th and Brazos. Someone reportedly fired a gun in the air and the bullet came down, striking her.\n\"Anytime New Year's is on a Saturday, it typically tends to be a little more hectic. I think Saturday night, from about midnight to about 3:00 or 4:00 in the morning, it was busy for us but then things tend to taper off,\" says Division Chief Wesley Hopkins, Austin-Travis County EMS.\nIn Hidalgo County, State Lawmaker Armando Martinez is recovering after being struck in the head by a stray bullet. Martinez was outside of a friend's home during a New Year's Eve celebration when it happened. Colleagues are glad to hear he's improving.\n\"What I told my staff earlier is that it could've been a lot worse. He could've passed away. It could've happened just like that because people were celebrating and not being cautious about really the dangers of gun-ownership and gun use,\" says State Representative Mary Gonzalez, (D-TX).\nThe Hidalgo County Sheriff's Office is looking into the incident as a deadly conduct investigation."}