{"uri": "http://www.rrstar.com/news/20160623/dead-teen-identified-in-rockford-home-invasion-pregnant-teen-and-male-charged", "title": "Dead teen identified in Rockford home invasion; pregnant teen and male charged", "dct": "NODATE", "id": "f57f54ee5347c28be25ba468c1bde410", "content": "Hide caption Police investigate a homicide Wednesday, June 22, 2016, in the 4600 block of Manheim Road in Rockford. MAX GERSH/STAFF PHOTOGRAPHER/RRSTAR.COM\nROCKFORD - Two teens - one of whom is 17 years old and pregnant - were charged as adults after their arrest Wednesday in connection with a botched home invasion and armed drug robbery in which a purported accomplice was killed.\nAnd the Winnebago County Coroner's Office today identified the deceased as Manuel Ruvalcaba, 17, of Rockford, who was shot.\nWinnebago County State's Attorney Joe Bruscato identified the defendants as Melissa Alvarez and David Phorasavong. Although both are 17 year olds, they were charged in adult court under Illinois law because of the severity of the crime.\nThey were charged with first-degree murder. The charge is often referred to as \"felony murder\" because although the two are not suspected of pulling the trigger, they are accused of participating in crimes that led to the shooting death of Ruvalcaba and taking cash, drugs and personal property.\nAlvarez and Phorasavong are being held without bond in the Winnebago County Juvenile Detention Center.\nJudge Francis Martinez granted Deputy State's Attorney James Brun's request to allow detention officers to transport Alvarez to appointments for pregnancy and neonatal care. Brun told the judge that Alvarez is seven months pregnant.\nBoth are expected to appear Aug. 11 before Judge Rosemary Collins, who could consider requests to set bond.\nFamily members of the teens declined to comment outside the courtroom today.\nRockford Police Department Assistant Deputy Chief Kevin Ogden said several people had appeared to participate in the home invasion early Wednesday in the 4600 block of Manheim Road.\nOgden would not comment on whether police suspect the shooting was part of a drug deal gone bad or an attempt to steal drugs, citing the ongoing investigation.\nBut he said detectives believe a robbery victim overpowered Ruvalcaba. The robbery victim was not a homeowner, Ogden said.\nPolice have determined that the incident was not a random act of violence.\nAfter responding to the crime scene around 2:40 a.m. Wednesday, Rockford police kept it secured for hours as detectives worked with the State's Attorney's Office to obtain a search warrant.\n\"Especially in a homicide investigation, it's absolutely critical that we not so much be fast, but we get one chance at this and we need to be right,\" Ogden said.\nJeff Kolkey: 815-987-1374; jkolkey@rrstar.com; @jeffkolkey"}