{"uri": "http://chicago.cbslocal.com/2014/05/31/1-dead-3-wounded-in-weekend-shootings/", "title": "5 Dead, 17 Wounded In Weekend Shootings", "dct": "Sat, 31 May 2014 09:56:00 GMT", "id": "7fc334dd521a2407ae4b140c0c7ea89b", "content": "CHICAGO (STMW) –Five people were killed and at least 17 others have been wounded in separate shootings across the city since Friday evening, including eight shot within the first 30 minutes of June.\nThe most recent fatal shooting happened early Sunday in the Austin neighborhood, when a teenage boy was killed and five others were wounded.\nThe six were standing in a group at the intersection of West Ferdinand Street and North Lavergne Avenue about 12:30 a.m. when several shooters emerged from a nearby alley and opened fire, police said.\nDonald Williams, 17, of the 3000 block of West Dickens Street, was shot in the back, according to police and the Cook County Medical Examiner’s office.\nWilliams was taken to Mount Sinai Hospital, where he was pronounced dead at 1:19 a.m., the medical examiner’s office said.\nFive other people — all females — were shot and listed in “stable” condition after the shooting, police said. A 14-year-old girl was shot in the buttocks and taken to Mount Sinai Hospital. Another girl, 17, was also shot in the buttocks and taken to Mount Sinai. Two women — both 19 — were also shot. One suffered a gunshot wound to the arm and showed up at West Suburban Medical Center in Oak Park. The other woman was shot in the thigh and taken to John H. Stroger Jr. Hospital. A 22-year-old women took several “bullet fragments” to the back and was also taken to West Suburban, police said.\nA teenage boy was killed in a drive-by shooting Saturday night in the Irving Park neighborhood on the Northwest Side.\nNicholas Keener, 16, was walking with a group in the 3800 block of North St. Louis Avenue about 10:30 p.m. when shots were fired from a passing light-colored vehicle, according to police and the Cook County Medical Examiner’s office.\nKeener, of the 4800 block of North Hamlin Avenue, was shot in the chest and taken to Advocate Illinois Masonic Medical Center, where he was pronounced dead at 11:08 p.m., authorities said. Police said the shooting is possibly gang-related.\nAbout 15 minutes earlier, a 33-year-old man was shot to death in the South Chicago neighborhood.\nDe Angelo Russell was walking with a friend in the 2600 block of East 83rd Street about 10:15 p.m. when at least one gunman walked up and fired shots, authorities said.\nRussell, of the 8200 block of South Marquette Avenue, was shot in the thigh, leg and arm and taken to Advocate Christ Medical Center in Oak Lawn, where he was pronounced dead at 1:35 a.m., authorities said.\nAnother man was shot dead Saturday afternoon in the Chatham neighborhood on the South Side.\nMcArthur Swindle, 21, of the 7000 block of South Halsted Street, was sitting in an SUV in the 700 block of East 87th Street about 3:20 p.m. when someone walked up and fired shots, hitting him several times, police and the medical examiner’s office said.\nHe was dead at the scene at 3:25 p.m., authorities said.\nFriday night, a man was killed and another man was hurt in a shooting in the South Side Fuller Park neighborhood. Charles D. Short, 51, was shot in the head about 6:30 p.m. in the 4200 block of South Princeton Avenue, according to police and the medical examiner’s office.\nShort, of the 6700 block of South Indiana Avenue, was pronounced dead at the scene at 6:35 p.m., the medical examiner’s office said.\nAnother man, 32, was shot in the chest and taken to Stroger in “stable” condition.\nAt least 11 others were wounded in shootings across the city since Friday evening.\n(Source: Sun-Times Media Wire © Chicago Sun-Times 2014. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)"}