{"uri": "http://www.wftv.com/traffic/incidents/man-who-fatally-stabbed-wife-children-had-injunction-filed-against-him-months-earlier/223764646", "title": "Man who killed wife, children, self had injunction filed against him months earlier", "dct": "Tue, 19 Apr 2016 12:30:00 GMT", "id": "898342aa59d74b2567a81f8306e33172", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nSEMINOLE COUNTY, Fla. - A domestic violence incident came to a tragic end late Sunday night in Seminole County.\nInvestigators said Henry Brown stabbed his estranged wife, Chericia Brown, to death, before shooting his two children, Henry Jr. and Aleah, and then himself.\nChericia filed an injunction against her husband in January, saying that Henry Brown hit her and threatened her life.\nThe injunction states that he was \"grabbing her hair, hitting her head against the wall, and shoving a sock in her mouth to cover the screams.\"\nHenry Brown hid Sunday night in the trunk of his wife's car, which was parked at Lake Mary's Chili’s, jumped out and stabbed her, deputies said.\nBrown dumped his wife’s body in the bushes outside the restaurant, ran to the rear of the building and got into his vehicle, investigators said.\nPDF Document: Read injunction filed by woman in January\nMoments later, Henry Brown drove around the building and ran over his wife and two people who were helping her, Lemma said.\nThe two people were hit while helping the woman were medical professionals who were dining at the restaurant, Lemma said.\nAll three were taken to the hospital, where Chericia Brown died.\nOne of the people trying to help her was released from the hospital and the other was listed in stable condition, Seminole County Sheriff's Deputy Chief Dennis Lemma said.\nHospital shootout\nHours into the investigations, there were “still a lot of questions we need to answer,” Lemma said.\nDetectives in Seminole County on Monday were dealing with four dead bodies and three different crime scenes.\nAfter leaving Sanford, Brown drove to an apartment complex in Altamonte Springs, changed vehicles and picked up his two children, ages 1 and 4, from a babysitter, investigators said.\nHe drove to the Central Florida Regional Hospital, arriving at 12:25 a.m., Lemma said.\nBrown barged into the crowded emergency department, leaving the children in his truck, but was recognized by deputies and Sanford police officers, investigators said.\nAs Brown fled, he pulled out a gun and opened fire inside the hospital, Lemma said.\nDeputies returned fire, but Brown was able to make it back to his truck and drive away.\nIf not for quick thinking on the part of law enforcement personnel, the shootout could have ended in numerous injuries or deaths, Lemma said.\nThe sheriff’s office did not release the number of shots Brown fired in the hospital or how many were fired back at him.\nNo one was injured in the exchange of gunfire, Lemma said.\nDeputies were able to quickly track down Brown’s vehicle, a Ford F-250 pickup, and disable it.\nWhen deputies approached the vehicle, they found that Brown had killed the two children and himself, Lemma said.\nIt was not clear if the children were killed before or after Henry Brown arrived at the hospital, the sheriff’s office said.\n“We have all of our investigators from various units out here. They’ve been out here since 10 p.m., digging up every piece of information that we can find and (trying) to connect the dots,” Lemma said.\nCouple's history with police\nThe couple's domestic violence issues were documented last December when the Altamonte Springs Police Department responded to a report of domestic violence between the couple at Crescent Place Condos.\nChericia Brown, 31, claimed that her husband, Henry Brown, 30, had attacked her and threatened to kill her and their two children, an incident report said.\nThe responding officer reported that there wasn’t enough evidence to make an arrest, and because Chericia Brown had moved out of the home, authorities didn’t believe that there was a reason to worry about violence in the future.\n“Due to the fact that (the victim) will not be returning to the home and has not returned in 48 hours, the fear of further violence does not exist,” the report said.\nHenry Brown told the officer that his wife was making up the story because she found out that he was having an affair, the report said.\nAn assistant state attorney agreed with the officer’s assessment of the situation, and said there was “insufficient evidence to prove this case beyond a reasonable doubt,” in a Feb. 10 letter to Chericia Brown.\n© 2017 Cox Media Group."}