{"uri": "http://www.news-journalonline.com/article/20160418/NEWS/160419503/101040", "title": "Slain wife warned police that husband threatened to kill her", "dct": "NODATE", "id": "8daa2b1f85adbdb2d7bba5239ec4472d", "content": "A 30-year-old man stabbed and ran over his estranged wife, killing her, then hours later, early Monday, shot himself and his two children as he fled along Interstate 4 near Deltona, the Seminole County Sheriff's Office said.\nA 30-year-old man stabbed and ran over his estranged wife, killing her, then hours later shot himself and his two children as he fled along Interstate 4 near Deltona early Monday morning, the Seminole County Sheriff's Office said.\nThe truck the man used to get away with his two kids was found near the DeBary exit on I-4. All three were found dead inside the vehicle, according to Seminole County Sheriff's Office spokesman Dennis Lemma.\nAltamonte Springs police records show Chericia Brown, 31, filed a domestic violence injunction against her husband, Henry Ramone Brown, in January.\nShe initially filed an incident report with the Altamonte Springs police in December, according to official documents obtained by The Associated Press. In the report, Chericia Brown said she believed her husband was cheating on her and that he had threatened to kill her if she took the couple's children away from him.\nThe deadly attack started about 10 p.m. Sunday at a Chili's restaurant in Lake Mary, where Henry Brown waited in the trunk of Chericia Brown's car.\nHenry Brown stabbed her and fled to a vehicle, but when he saw two people helping her he ran all three of them over. The two good Samaritans - a paramedic and a nurse - were in stable condition, but Chericia Brown died at Central Florida Regional Hospital in Sanford, according to Lemma.\nAfter leaving Chili's, Henry Brown drove to pick up his kids, ages 1 and 4, from a baby sitter in Altamonte Springs. He then took the kids with him to the hospital, Lemma said.\nBrown apparently was searching for his wife at the hospital, when he was spotted by security and deputies, whom he opened fire on, the sheriff's spokesman said.\nBrown fled with the children in a truck along I-4 into West Volusia, where deputies used stop sticks to disable the vehicle.\nWhen deputies approached the truck about 12:30 a.m. Monday they found Brown had killed the two children and then himself, Lemma said.\nIn the December police report, Chericia Brown described multiple incidents of Henry Brown pulling her by the hair, slapping her face and threatening her kids and a friend when she went to the friend's home to get away from her husband.\nBut police investigators said in their report that Chericia Brown didn't have facial injuries to support her claims of being slapped. Henry Brown told detectives that his wife was upset over the fact that he had a mistress and her story was \"a lie\" to get back at him for having the mistress, according to a statement he gave police.\nChericia Brown hadn't returned to their home and had no plans to return so \"the fear of further violence doesn't exist,\" according to the December police report.\nThe State Attorney's Office agreed, writing in the police report, \"There is insufficient evidence to prove this case beyond a reasonable doubt.\"\nIn a form she filled out for the State Attorney's Office on Dec. 21, she checked the boxes \"fearful\" and \"nervous\" when asked to describe her state of mind, and she checked \"yes\" for the question, \"Do you think your partner/offender is capable of killing you?\" according to records released by the State Attorney's Office.\n- The Associated Press contributed to this report.\nWATCH RAW FOOTAGE OF DENNIS LEMMA'S PRESS CONFERENCE\nPlease install the latest Adobe Flash Player Plugin to watch this content."}