{"uri": "http://www.cbs5az.com/story/31289335/update-5-dead-after-shooting-fires-at-phoenix-home?autostart=true", "title": "PD: Man kills parents and sisters in Phoenix home", "dct": "Tue, 23 Feb 2016 12:01:00 GMT", "id": "f436fe93cff6da92a87e5014fb453f19", "content": "MESA, AZ (3TV/CBS 5) -\nFive people are dead after a shooting and two fires at a Phoenix home Tuesday morning.\nAlex Buckner, 26, killed his father Vic Buckner, 50; his mother Kimberly Buckner, 49; his 18-year-old sister Kaitlin Buckner and his 6-year-old sister Emma Buckner, according to Sgt. Trent Crump with the Phoenix Police Dept.\n\"They looked like a very happy family and they would always look out for one another,\" described Paulina Bustamante, who was a close friend of the family. \"They always showed they cared for them as family and for other people as well.\"\nCrump said Alex Buckner also died in the home. Police shot him when he pointed a gun at officers.\nFirefighters and police officers from Phoenix and Glendale responded to reports that a family of four had been shot at the home in the area of 47th Avenue and Cactus Road around 4:45 a.m.\n[SLIDESHOW: Gunshots inside home on fire]\n\"We’re getting some feedback from family members at this point on some of the problems that the suspect may have had,\" Crump said. \"There had been some indications of drug use that they had moved out of state. There was drug abuse alleged or even some treatment that it was alleged in Oklahoma where the family had resided.\"\nRelatives told police the Buckner family moved back to Arizona a few years ago. They knew of drug abuse in the past but they didn't suspect it now and this was completely out of character for Alex Buckner and they didn't see this coming.\nThe initial call came from the people inside the home who said they were being shot at, Sgt. Crump said. The caller said her brother shot her.\n\"You have a caller on the line who is indicating they need help and they can see people in the upper windows that are trying to get them to help them,\" Crump said.\nShortly before 7 a.m., police said the suspect \"is down.\"\nA team from the department's Special Assignment Unit wore self-contained breathing apparatus when they entered the home.\nOfficers located the suspect in a room.\n\"When they went in, they were confronted by the armed suspect. He pointed a gun at one of our officers and was shot,\" Sgt. Crump said.\nPolice said the gun Buckner used to kill his family belonged to his father and had been at the home and is believed to be the only gun in the home.\nThey all lived in the home on Sunnyside Ave. There were no previous emergency calls to that address and no known mental health issues with the killer, according to police.\nThe catalyst and timing of the incident is a mystery.\n\"We have witnesses or neighbors that have told us that probably a half-hour before our response out here they heard an argument come from that house,\" Crump said. \"What time that started, how long this had been going on, what it was over is unknown to us at this point and quite frankly we may never know.\"\nPolice said the parents were in an upstairs bedroom. Emma was in a bedroom and Kaitlin was in a closet in a downstairs bedroom.\nBustamante, preschool teacher, says Emma was bright and charming.\n\"May of 2015, we were just celebrating her preschool graduation,\" Bustamante said. Then, when she made it to first grade, Emma was taking on harder subjects and needed help.\n\"I started writing the correct way for her to show her how to do the letters,\" explained Sammie Evans, who is a retired school teacher and also lives right across the street from the Buckner's. \"I started keeping more of her writing and I was gone show it to her when she got out of first grade so she could see how she had progressed,\" Evans said.\nFrom what we've learned, Emma's sister Kaitlin had already started progressing in life. \"She was bright,\" Bustamante said. \"I would visit her at work every once in a while. She worked at Party City.\" Kaitlin also, we've learned, was planning for her future. \"She was going to Gateway College,\" Bustamante.\nAn entire family is now gone. That includes a mother who became a mentor for Bustamante. \"She would always give us advice,\" Bustamante said. \"She would always be asking us, \"How are you,\" \"How are your parents,\" \"How is school going?\"\nThe medical examiner will determine the cause of death for each victim.\n\"We had a large fire in this house as well and so to say that they died from gunshot wounds might be a little premature but everyone was shot,\" Sgt. Crump said.\nCapt. Reda Bigler with the Phoenix Fire Department confirmed three people died at the scene. A woman approximately 20 years old and a 6-year-old girl suffered life-threatening injuries and were transported to hospitals. Both later died.\nThat woman reportedly told first-responders that her brother was the shooter.\nCrews were working a first-alarm fire at the home, as well.\nWith victims alive inside the house, firefighters wanted to go in and get them. The active shooter inside, however, made it too big a risk. And police, lacking fire training, couldn’t battle the flames.\nFirst responders decided to build a brand-new response team on the fly, putting police officers in protective fire gear and giving them a crash course on entering a burning home.\n\"That was a decision that kind of happened there in the moment but the thoughts of it happening have always been on our minds. And it’s a lot easier for us to put officers in turnouts than convert firefighters into police officers,\" said Ardell Deliz of the Phoenix Fire Department. \"They weren't there to put out fires, they were there to [extricate] victims.\"\nDeliz said police officers and firefirefighter do receive some cross training, but Crump described the fire-elated training officers get at the police academy as slim to none.\nRegardless, the officers were able to go in and subdue the gunman and allow firefighters to get a handle on the blaze.\n\"Officers were getting shot at from the second floor of the home while they were trying to extinguish the fire and [extricate] people from the house,\" Crump said.\nFirefighters later knocked down that fire, however, smoke from a second fire was seen billowing from the roof around 6:45 a.m. That fire was under control around 7:30 a.m.\nThree police officers were transported to a hospital for smoke inhalation. They are expected to be OK.\n\"We did our best to try to save lives and it is a horrific and tragic event,\" Phoenix Police Chief Joseph Yahner said.\nPhoenix Mayor Greg Stanton thanked the police officers and firefighters who responded to the incident that happened on the border of Phoenix and Glendale.\n\"They willingly risked their lives to save members of that family,\" Stanton said. \"You had police officers who went into an active fire to pull out people to try to save their lives.\"\nStanton added, \"This is what heroes look like.\"\nPolice got a search warrant for the home on Tuesday evening and expected to be on scene all night long. The fire and water damage will complicate the investigation as investigators work to piece together all of the details about the tragic event.\nFor the 2nd week in a row, Arizona has seen a senseless gun tragedy. We cannot let this be the new normal. https://t.co/8hNiJfmfsN\n— Gabrielle Giffords (@GabbyGiffords) February 23, 2016\nCopyright 2016 KPHO/KTVK (KPHO Broadcasting Corporation). All rights reserved."}