{"uri": "http://www.dailymail.co.uk/news/article-2268979/Wilbert-Thibodeaux-Gunman-slays-lawman-wounds-torching-mobile-home.html", "title": "Shotgun-wielding gunman slays tribal lawman, wounds two other officers after torching a mobile home in which officials later discovered a 78-year-old local man's body", "dct": "Sun, 27 Jan 2013 06:00:00 GMT", "id": "e70ec5e1d90a008cfef6678cbd19d240", "content": "Shooting occurs in southern Louisiana's St. Mary's Parish\nWilbert Thibodeaux was arrested after he was shot by police\nEddie Lyons, 78, later found shot in torched mobile home\nRampage occurs quarter-mile from Native-American tribe's casino\nSlain officer was married with two children\nA man shot three police officers - one fatally - in southern Louisiana Saturday with a shotgun after mysteriously torching a mobile home inside of which fire officials later discovered the charred remains of a 78-year-old local man.\nWilbert Thibodeaux, 48, of Charenton was taken into custody after doctors treated him for a superficial gunshot wound he suffered when authorities returned his initial salvo of shot.\n'We've got a lot of unanswered questions,' State Police Capt. Doug Cain said of the affair in St. Mary's Parish, 45 miles southeast of Lafayette, and about a quarter-mile from the Cypress Bayou Casino.\nThe Chitimacha Tribe of Louisiana reportedly operates the casino. Killed in the affair was an as-yet unnamed Chitimacha tribal officer - one of seven full-time lawmen who patrol a 260-acre reservation that has roughly 150 homes, a grocery store, a small school and government offices.\n'He's a real great guy. Extremely dedicated to his job. Very brave,' Tribal councilman Toby Darden said, adding the slain officer is married and has two grown children. 'Everybody knows the officers personally. It's devastating.'\nThibodeaux also critically wounded a pair of St. Mary's Parish sheriff's deputies who responded as well to a report of a shotgun-wielding man walking down a road near the Cypress Bayou Casino, NBC33 Newsreports.\n'Thibodeaux fired at the Chitimacha Officer, fatally wounding him,' the state police said in a news release.\nScroll down for video\n'As two St. Mary Deputies, who were in the same car, arrived at the scene, Thibodeaux fired multiple shots hitting the deputies. During the encounter, Thibodeaux was shot.'\nInvestigators later found the burned remains of Eddie Lyons, 78, also of Charenton, after extinguishing a fire at a mobile home that Thibodeaux is suspected of setting before the officers arrived, Louisiana State Police Trooper Stephen Hammons said.\n'Detectives suspect Lyons was shot by Thibodeaux before the fire,' state police said in a news release.\nHammons said investigators were questioning Thibodeaux Saturday evening, adding the shootings occurred near - but not on tribal land. Charges against the gunman are pending.\n'Today is a difficult day for our partners in St. Mary Parish,' Col. Mike Edmonson, the State Police superintendent, said in a statement. 'My thoughts and prayers are with the deputies and the officer's families tonight.\n'I know the coming days and weeks will be difficult ones for the men and women of the Chitimacha Police Department and the St. Mary Parish Sheriff's Office,' Edmonson added. 'We will assist their agencies in any way we can during these trying times.'\nThe casino is run by the Chitimacha Tribe of Louisiana and is less than a quarter-mile from the scene of the shootings.\n\"Everybody is just in shock. It's small-town America,\" said Jacqueline Junca, the tribe's secretary and treasurer.\nPolice didn't immediately release the names of the officers. Authorities said they will do so at a Monday news conference.\nThe Chitimacha Tribe reportedly claims around 1,200 members, roughly half of whom live on the reservation.\nAccess to and from the casino was restricted for roughly 90 minutes as a precautionary measure while police responded to the shooting, said casino spokeswoman Nancy Herrington. Charenton is located about 45 miles southeast of Lafayette.\n\"We are very much in business and have been,\" Herrington said later Saturday. \"We have events tonight. All of those are taking place.\"\nOne of the injured deputies was taken to a hospital in New Orleans and the other was taken to a Lafayette hospital. Both were listed in critical but stable condition Saturday evening, Hammons said.\nVIDEO Tribal lawman killed, two other officers injured"}