{"uri": "http://www.wftv.com/news/local/boy-dies-after-being-shot-in-pine-hills-drive-by-during-17th-birthday-party/459800683", "title": "Boy dies after being shot during his 17th birthday party in Pine Hills", "dct": "Mon, 24 Oct 2016 19:13:00 GMT", "id": "2308edaf983d2330735f16bb6ca76d76", "content": "Please install the latest Adobe Flash Player Plugin to watch this content.\nORANGE COUNTY, Fla. - A Pine Hills teenager shot during his 17th birthday party died Sunday, the Orange County Sheriff’s Office said Monday.\nThe shooting was reported at about 10:30 p.m. Saturday at a home on Kingsland Avenue near Silver Star and North Pine Hills roads, officials said.\nTerrance Givens, 16, was shot in the head as he stood on his parent’s porch, Lt. Carl Santiago, of the Orange County Sheriff’s Office, said. He died on what would have been his 17th birthday.\nAn 18-year-old woman was also hit during the shooting, but her injuries were not life-threatening, he said.\n.@OCPSnews reports Evans HS requested additional counselors to help students dealing with news of the shooting. @WFTV #wftv pic.twitter.com/QGJzDWFTJq\n— Cierra Putman WFTV (@CPutman_WFTV) October 24, 2016\n\"Pine Hills is a mini Detroit to me. I mean every weekend there's a shooting. Every two weeks someone's child has been shot and they're dead. It's sad,\" said a neighbor who didn't want to be identified.\nHomicide detectives said they believe there were 50 - 60 people outside his home at the time of the shooting.\nInvestigators told Channel 9's Cierra Putman they're still not sure whether Givens was hit by stray gunfire or if he was targeted.\nNumerous shots were fired into the home, neighbors told Channel 9.\n“The sounds that I heard, it was so many of them and they were right behind each other,” a nearby resident said. “I was assuming that they were firecrackers.”\nBoth shooting victims were taken to Orlando Regional Medical Center.\nGivens' brother told Channel 9 that the victim attended Evans High School, which has requested additional counselors to help students and staff deal with the news of the shooting.\nAnother resident of the area where the shooting occurred said it was heartbreaking to hear about the boy's fatal injuries.\n\"I feel for the parents and I pray for the family, and I pray (to) God, just change all of this, very soon, because they need to keep these guns away from children,\" she said. \"Children need to be taught other things than go get a gun when you (are) upset about something.\"\nThe investigation is ongoing.\nAnyone with information on this homicide is asked to call Crimeline at 800-423-8477. There is a reward up to $5,000 for information.\n.@OrangeCoSheriff says Terrance Givens, 16, died yesterday after being shot in the head at his birthday party Saturday. @WFTV pic.twitter.com/nm4b0rinO7\n— Cierra Putman WFTV (@CPutman_WFTV) October 24, 2016\n© 2017 Cox Media Group."}