{"uri": "http://pittsburgh.cbslocal.com/2013/01/01/4-people-shot-in-mckeesport/", "title": "4 Shot At McKeesport New Year’s Eve Party", "dct": "Tue, 01 Jan 2013 17:05:00 GMT", "id": "44e86f777d93566304b115206a3f8ce8", "content": "MCKEESPORT (KDKA) – Allegheny County Police say they have issued an arrest warrant for the suspected gunman in an overnight shooting during a New Year’s Eve party in McKeesport.\nAccording to emergency dispatchers, the shooting happened near the intersection of Versailles Avenue and Coursin Street before 3:15 a.m. Three men and a woman were wounded in the gunfire.\nPolice are identifying the suspect as 20-year-old Julian Sims.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nSims is being charged with one count of criminal attempt homicide, four counts of aggravated assault, and four counts of recklessly endangering other persons as well as firearms violations. Sims is also wanted on a previously existing warrant for firearms violations, police said.\nHe is described as a light-skinned African American male, about five-foot-seven, 145 pounds with freckles and a large tattoo on the left side of his neck that says “Bridgette.”\nInvestigators say Sims should be considered armed and dangerous, and is known to frequent the Wilkinsburg, Braddock and Duquesne areas.\nFor most of New Year’s Eve evening, Gabriel Patterson’s Versailles Avenue house party was the place to be for about 140 people. The party information was posted on Facebook ahead of time.\nBy 3:15 a.m., most of the guests had left, except for three strangers and that’s when the trouble began.\n“I was sleeping. I woke up; I asked [them] to start clearing out… it’s time to go home. Came downstairs and [they were] sitting on the couch and they [weren’t] ready to go. They got mad that I told them to leave and they started shooting. I was really scared,” Patterson said. “I’d never been in a situation like that in my life.”\nGroggy from sleep, Patterson woke up quick with terrible images and fear now filling his mind.\nOne of the four people shot was Patterson’s good friend.\n“That’s my high school buddy. I wrestled with him and played football with him. I know [he] got hit because I [saw] it,” Patterson said. “That was the first time I’d ever seen anything like that. It was extreme.”\nPolice said that young man suffered a gunshot wound to the abdomen and is in critical but stable condition. The other three victims suffered minor wounds and are also expected to be okay.\nPlease install the latest Adobe Flash Player Plugin to watch this content.\nFor Patterson, fear is now anger and his thoughts are with his friend.\n“If he’s not alright, it’s not going to be pretty,” he said. “It’s not going to be pretty.”\nAnyone with information on Sims’ whereabouts is asked to contact the Allegheny County Police Homicide Unit at 412-473-3000.\nRELATED LINKS"}